{
  "id": "_YTMPmYBTlTomsSB-WwS",
  "document": {
    "title": "Beets v. Collins",
    "full_title": "BETTY LOU BEETS -APPELLEE, v. JAMES A. COLLINS, DIRECTOR TEXAS DEPARTMENT OF CRIMINAL JUSTICE, INSTITUTIONAL DIVISION -APPELLANT.",
    "jurisdiction": "Fifth Circuit",
    "date": "1995-09-22T00:00:00.000Z",
    "docket": "No. 91-4606",
    "body": "EDITH H. JONES, Circuit Judge:\n\nThe issue that provoked en banc rehearing of this capital murder case is whether a habeas corpus petitioner was deprived of her Sixth Amendment right to effective assistance of counsel because her attorney committed arguable ethical violations when he obtained a contract for media rights to her story and failed to withdraw and testify as a defense witness. More precisely, the court has divided over the issue whether these facts should be measured by the Strickland standard for an attorney's deficient performance\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e or by the Cuyler standard adopted for the special case of attorney conflicts in cases of multiple client representation.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e On reconsideration, we approve Judge Higginbotham's analysis in a concurrence to the panel opinion that Strickland more appropriately gauges an attorney's conflict of interest that springs not from multiple client representation but from a conflict between the attorney's personal interest and that of his client. Judged under Strickland, the attorney's actions in this case were neither deficient nor prejudicial. Alternatively, however, even if the Cuyler standard applies, we find that only a potential and not an actual conflict arose between Beets and her lawyer. On either ground, the writ must be denied.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nBecause our analysis of the Sixth Amendment issue depends upon a thorough recapitulation of the history of the case, the background is described with more than usual detail.\n\nI. BACKGROUND\n\nA. Summary of Proceedings\n\nOn October 11, 1985, petitioner Betty Lou Beets (Beets) was convicted of the capital murder of her fifth husband, Jimmy Don Beets (Jimmy Don). She was sentenced to death. Beets appealed unsuccessfully to the Texas Court of Criminal Appeals, see Beets v. State, 767 S.W.2d 711 (Tex. Crim. App. 1988), cert denied, 492 U.S. 912, 109 S. Ct. 3272, 106 L. Ed. 2d 579 (1989). Her request for a state writ of habeas corpus having been denied, Beets sought similar relief in federal court. 28 U.S.C. ยง 2254. The district court granted the writ on finding that Beets's defense counsel at trial was a material witness who should have resigned to testify rather than represent her. On appeal, this court rejected Beets's claims that her attorney labored under an actual conflict of interest stemming from either his status as a witness or the media rights contract. The panel majority applied the Cuyler standard to the case and, while Judge Higginbotham agreed with the Conclusion of no actual conflict, he maintained in a separate opinion that Strickland should be applied instead.\n\nB. The Murder Case\n\nBeets's fifth husband, Jimmy Don, disappeared on August 6, 1983. See Beets v. State, 767 S.W.2d 711 (Tex. Crim. App. 1988) (lengthy recitation of the evidence). His fishing boat was found drifting on Lake Athens, Texas, suggesting that he had drowned.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e More than a year later, a house that was Jimmy Don's separate property before his death was destroyed by fire. When the insurer, suspecting arson, refused Beets's claim for the loss, Beets sought the counsel of E. Ray Andrews, an attorney who had represented Beets since 1981 or '82. During their Discussions, it was decided that Andrews would pursue any of Jimmy Don's insurance or pension benefits to which Beets might be entitled.\n\nBeets and Andrews entered into a contingent fee arrangement covering these matters. Andrews preliminarily determined that certain benefits existed and then sought the assistance of two attorneys more experienced in collecting such benefits. Andrews arranged a meeting in his office with Beets and Randell Roberts, one of the other attorneys. Roberts agreed to associate his firm in the matter. Roberts's brother, attorney Bruce Roberts, eventually took over responsibility for Beets's claims. Through his efforts, Jimmy Don's former employer, the City of Dallas Fire Department, agreed to provide benefits to Beets.\n\nBefore Beets received the first check from the Fire Department, she was arrested on June 8, 1985, and was charged with the capital murder of Jimmy Don. Beets was charged with shooting and killing her husband and, with the assistance of her son, Robbie Branson, burying him in a sleeping bag under a planter in her front yard.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The body of Beets's fourth husband, Doyle Wayne Barker, was also found in a sleeping bag buried in the back yard underneath a patio upon which a storage shed had been erected. Beets had also shot another former husband, Bill Lane, although he survived.\n\nAndrews, described by the federal district Judge as a \"competent and tenacious criminal defense lawyer,\" agreed to represent Beets on the capital murder charge. The case generated significant local and national media interest. On October 8, just after Beets's trial commenced, she signed a contract transferring all literary and media rights in her case to Andrews's son. Andrews testified at the federal habeas hearing that this contract was signed after negotiations fell through to obtain his fee from Beets's children. The media rights contract later apparently became the subject of a State Bar grievance proceeding, but Andrews was not disciplined for it.\n\nThe trial Judge did not become aware of the media rights contract during trial, although he learned of it three months later during a hearing on Beets's motion to appoint counsel for appeal when the prosecutor asked Beets if she had signed over the book rights to her case to Andrews's son. The Judge did not inquire whether Beets was willing to waive her Sixth Amendment right to conflict-free counsel.\n\nBeets was convicted of murder for remuneration and the promise of remuneration on the theory that she killed her husband in order to obtain his insurance and pension benefits and his estate. See Tex. Penal Code Ann. ยง 19.03(a)(3) (Vernon Supp. 1991). The Texas Court of Criminal Appeals later held that \"a person commits a murder for remuneration . . . where the actor kills a victim in order to receive a benefit or financial settlement paid upon the death of the victim, such as proceeds of insurance and retirement benefits as in the present case.\" Beets v. State, 767 S.W.2d at 737. In other words, the state was required to show that Beets had the specific intent to receive remuneration in the form of insurance or pension benefits or other property upon the death of Jimmy Don.\n\nAndrews defended Beets primarily on the ground that her son Robbie actually murdered Jimmy Don and, second, by disputing that the murder was for remuneration. Andrews, his co-counsel Hargrave, the Texas Court of Criminal Appeals and the federal district court all concur that this was the order of Andrews's strategy. It was a good strategy, as the federal district Judge explained:\n\nThe court has carefully reviewed the record. It is apparent that the defense counsel, E. Ray Andrews, fought for his client to the full extent of his ability and energy. This case was vigorously prosecuted and vigorously defended before a careful and learned trial Judge. Andrews put forth the only evidence available to him that had evidence that a jury could conclude had scientific corroboration -- the results of the pathology report which raised the issue of an altercation and head injury unrelated to the gun shot. Such evidence, if believed, would be consistent with the defense position that Jimmy Don Beets was killed by petitioner's son, Robert F. Branson, II.\n\nAndrews strenuously cross-examined Robbie Branson, one of Beets's children, who was at the time of the offense a teenager living with her and Jimmy Don. Several times, he had quarrelled heatedly with his stepfather, and he had damaged some of Jimmy Don's property and taken money from him. Robbie had a criminal record for burglary and was accused of trying to pass stolen checks. Although Robbie denied killing his stepfather, Beets testified that Robbie and Jimmy Don fought on the night of the murder and, when she was in another room, she heard a shot fired in the bedroom. She found Jimmy Don dead on the floor. Beets said she helped Robbie dispose of the body. Together, they planned the boating accident ruse, and Beets went off to shop in Dallas with her daughter the next day.\n\nBeets denied being the murderer. She said she loved Jimmy Don and he had treated her well.\n\nSupporting the theory that Robbie committed the murder, the forensic pathologist, Dr. Petty, testified that Jimmy Don's fractured cheek bone, otherwise unexplainable by his head wound from the pistol, could have been inflicted in a fight with another man.\n\nCritical to the success of the non-triggerperson defense was Beets's motion in limine to prevent the state from introducing evidence of Barker's body, which had been dug up at the same time as Jimmy Don's. The state trial Judge initially granted this motion but changed his mind near the end of trial. This change made it possible for Beets's daughter Shirley Stegner to testify for the State that Beets had killed Barker in 1981 and obtained Shirley's help in burying him in the back yard.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Shirley was vulnerable as a witness because of her own criminal exposure in Barker's murder and her unsavory personal background. Andrews made the most of her impeachment. Nevertheless, the evidence of Barker's violent death was devastating to the defense, as Andrews and Hargrave both acknowledged at the federal habeas hearing.\n\nShirley Stegner's testimony about her mother's motive for killing Barker also enhanced the state's proof of motive in Jimmy Don's case. Shirley testified that her mother told her that\n\n\"she was going to kill Doyle Wayne Barker\" because \"she couldn't put up with any more of him beating her and that she didn't want him around anymore.\"\n\nHer mother also told her that\n\n\"the trailer [house] was in his name and she was just a co-signer on it and that if they were to get a divorce, that he would end up with the trailer [house].\"\n\nBeets v. State, 767 S.W.2d at 718.\n\nThe State adduced other evidence of Beets's attempts to enrich herself at the expense of Jimmy Don's life or his estate. Less than six months before he died, Betty Lou applied to J.C. Penney for a $10,000 life insurance policy in Jimmy Don's name, which she forged on the application. She directed all further correspondence on the policy to a daughter's home address. Coincidentally, a relative of her husband was then employed at J.C. Penney's and noticed some discrepancies on the paperwork, which she brought to Jimmy Don's attention. He promptly cancelled the policy.\n\nAfter Jimmy Don's disappearance, Beets forged his signature on the title certificate of the boat, which had been his separate property, and sold it for $3,250. She also tried to sell a house that had been his separate property. As has been related, the house mysteriously burned down, so she sought out Andrews to collect the fire insurance benefits.\n\nAlso important to the State was the testimony of Denny Burris, a chaplain with the City of Dallas Fire Department. Burris met with Beets several times during the first few weeks after Jimmy Don was reported missing:\n\nBurris testified that [Beets] made inquiry of him whether she was covered by any insurance policies that [Jimmy Don] might have had with the City of Dallas, as well as inquiring whether she would be entitled to receive any pension benefits that [Jimmy Don] might have accumulated. [Beets] did not profess to Burris that she had any specific knowledge of either insurance coverage on [Jimmy Don]'s life or any pension benefits [Jimmy Don] might have accumulated. Burris told her that he did not know but would check into the matter and report back to her. Burris did check and learned that [Jimmy Don]'s life was insured with the total amount of insurance being approximately $110,000. He also learned that [Beets] would be entitled to receive approximately $1,200 each month from [Jimmy Don]'s pension benefits. Burris advised [Beets] of his findings, and also told her that according to the City Attorney of Dallas that because [Jimmy Don]'s body had not been recovered there would be a seven year waiting period before any payment of insurance proceeds could occur.\n\nBeets v. State, 767 S.W.2d at 716-17. Burris's testimony implied that right after Jimmy Don's disappearance, the \"bereaved\" wife was inquiring about his death benefits. This testimony could be taken by the jury to mean that she was already greedy or truly ignorant about them at that time. In any event, Beets had to assume from Burris's information that she must wait several years before collecting them.\n\nAndrews's strategy to negate the specific intent element of the capital crime was to introduce Beets's testimony that she was unaware of any potential insurance or pension benefits available to her at the time she approached Andrews, eighteen months after Jimmy Don's \"disappearance,\" for assistance in pursuing her fire damage claim. Beets testified that Andrews suggested that she should pursue Jimmy Don's life insurance or pension benefits but that she never felt entitled to them.\n\nBruce Roberts testified as part of the strategy that Beets seemed interested in no other insurance claims than that pertaining to the burned house. Beets brought Roberts what looked like part of an insurance policy, and she mentioned pension benefits, but she gave Roberts no other information helpful to pursuing the claims. To Roberts, Beets appeared not to know anything about the amount or nature of any death benefits to which she might be entitled. Roberts confirmed that she never received any money on her claims.\n\nIn closing argument, Andrews informed the jury that it was his idea to pursue Jimmy Don's benefits for Beets. His statement was not objected to.\n\nThe jury disbelieved Beets's non-triggerperson defense and her denial of a pecuniary motive and so convicted her of capital murder. The state court of criminal appeals affirmed.\n\nC. Post-Conviction Proceedings\n\nIn the state habeas corpus proceedings, Beets, represented by new counsel, filed a voluminous petition but raised her Sixth Amendment conflict-of-interest claim only as to Andrews's media rights contract -- and without mentioning Andrews's status as a witness -- as claim number 34(h) on page 70 of her pleading. Andrews filed an affidavit that the media rights contract did not adversely affect his representation of Beets. The trial court, agreeing with Andrews, stated:\n\n(4) As to Petitioner's ineffective counsel claim, the Court finds from personal recollection of the trial that this case was hotly contested by Petitioner's trial counsel and that Petitioner was vigorously defended at every stage of the trial proceedings by her counsel. Petitioner's grant of \"book rights\" to the son of her counsel had no effect on the strategy of defense counsel. Counsel for Petitioner made an adequate factual investigation of the case.\n\nThe conduct of Petitioner's counsel at trial date did not so undermine the proper functioning of the adversarial process that the trial cannot be relied on as having produced a just result.\n\nThe conduct of petitioner's counsel during trial was not deficient and he presented all evidence then existing to support the defense of his client.\n\nThe court's denial of relief was affirmed by the Texas Court of Criminal Appeals.\n\nBeets's federal habeas petition alleged, among many other issues, that Andrews's failure to withdraw and offer direct testimony that Beets was ignorant of potential death benefits constituted an actual conflict of interest with his client. Beets further alleged that the media rights contract gave rise to a separate conflict of interest.\n\nThe district court, after holding an evidentiary hearing,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e decided that Andrews's failure to withdraw and testify resulted in an actual conflict of interest that adversely affected his representation of Beets. Granting the writ of habeas corpus on this basis, the court found:\n\nAndrews obviously should have known of his dual status as witness and advocate prior to trial. Andrews' dual status should have also been apparent to both the Judge and district attorney as the trial unfolded. The Court is persuaded that the conflict never occurred to any of the participants. The testimony that Andrews could have provided as an independent witness related to an essential element of the State's charge of murder for remuneration.\n\nThe court also concluded that the media rights contract, factually intertwined with the failure to withdraw conflict, constituted a separate conflict of interest, but he expressly found that it did not adversely affect Andrews's performance. In reaching his decision on the Sixth Amendment issue, the district court applied the test set out in Cuyler v. Sullivan, supra n.2.\n\nII. DISCUSSION\n\nRisen from obscurity in her state habeas petition to the dispositive issue in federal district court are Beets's complaints that her lawyer's ethical violations, breaches of the duty of loyalty to his client, violated the Sixth Amendment. No doubt Beets's constitutional right to effective counsel demands diligent protection. The primary question before us, however, is the applicable standard of protection.\n\nThe Supreme Court has determined that in most Sixth Amendment ineffectiveness cases, the defendant must show that counsel's errors fell below an objective standard of reasonableness and prejudiced his case, which ordinarily means establishing a reasonable probability that counsel's errors changed the result of the proceeding. Strickland, 466 U.S. at 686, 694, 104 S. Ct. at 2064, 2067. In some cases, however, prejudice is presumed if the defendant shows that an actual conflict of interest adversely affected his lawyer's performance. Cuyler, 446 U.S. at 348, 100 S. Ct. at 1718. The precise nature of Cuyler 's \"actual conflict\" and \"adverse effect\" elements is rather vague, but the Cuyler test sets a lower threshold for reversal of a criminal conviction than does Strickland. The Supreme Court explained the reason for this distinction as follows:\n\nOne type of actual ineffectiveness claim warrants a similar, though more limited, presumption of prejudice [than a case in which the defendant effectively had no counsel]. In Cuyler v. Sullivan, 446 U.S., at 345-350, 100 S. Ct. at 1716-1719, the Court held that prejudice is presumed when counsel is burdened by an actual conflict of interest. In those circumstances, counsel breaches the duty of loyalty, perhaps the most basic of counsel's duties. Moreover, it is difficult to measure the precise effect on the defense of representation corrupted by conflicting interests. Given the obligation of counsel to avoid conflicts of interest and the ability of trial courts to make early inquiry in certain situations likely to give rise to conflicts, see, e.g., Fed. R. Crim. Proc. 44(c), it is reasonable for the criminal Justice system to maintain a fairly rigid rule of presumed prejudice for conflicts of interest. Even so, the rule is not quite the per se rule of prejudice that exists for the Sixth Amendment claims mentioned above. Prejudice is presumed only if the defendant demonstrates that counsel \"actively represented conflicting interests\" and that \"an actual conflict of interest adversely affected his lawyer's performance.\" Cuyler v. Sullivan, supra, 446 U.S., at 350, 348, 100 S. Ct. at 1719, 1718 (footnote omitted).\n\nStrickland, 466 U.S. at 692, 104 S. Ct. at 2067.\n\nThe position adopted by this court en banc may be easily summarized. Strickland offers a superior framework for addressing attorney conflicts outside the multiple or serial client context.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e First, Cuyler, like all the other Supreme Court cases that have discussed a lawyer's conflict of interest, solely concerned the representation of multiple clients. The Supreme Court has not expanded Cuyler 's presumed prejudice standard beyond cases involving multiple representation. Although lower courts have generally extended Cuyler to \"duty of loyalty\" cases, their decisions have not grappled with the difficulties inherent in that position, and their reasoning has been inconsistent. See note 10, infra. Second, the demands and reasoning of legal ethics militate against treating multiple representation cases like those in which the lawyer's self-interest is pitted against the duty of loyalty to his client.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Finally, applying Cuyler in cases arising from a lawyer's conflict of interest between himself and his client ultimately undermines the uniformity and simplicity of Strickland. Each of these propositions will be discussed.\n\nA. Cuyler and Related Supreme Court Cases\n\nAlthough the federal circuit courts have unblinkingly applied Cuyler 's \"actual conflict\" and \"adverse effect\" standards to all kinds of alleged attorney ethical conflicts,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e a careful reading of the Supreme Court cases belies this expansiveness. Neither Cuyler nor its progeny strayed beyond the ethical problems of multiple representation. One cannot read Cuyler to analyze conflicts of interest in a context broader than that of multiple client representation. The case came to the Supreme Court raising two issues left open by a previous multiple representation case: whether a trial Judge must sua sponte inquire into the propriety of multiple representation, and \"whether the mere possibility of a conflict of interest warrants the Conclusion that the defendant was deprived of his right to counsel.\" Cuyler, 446 U.S. at 343, 100 S. Ct. at 1716. In stating its Sixth Amendment standard that has been quoted above, the Court said:\n\nGlasser established that unconstitutional multiple representation is never harmless error. Once the Court concluded that Glasser's lawyer had an actual conflict of interest, it refused \"to indulge in nice calculations as to the amount of prejudice\" attributable to the conflict. The conflict itself demonstrated a denial of the \"right to have the effective assistance of counsel.\" Thus, a defendant who shows that a conflict of interest actually affected the adequacy of his representation need not demonstrate prejudice in order to obtain relief. But until a defendant shows that his counsel actively represented conflicting interests, he has not established the constitutional predicate for his claim of ineffective assistance.\n\nCuyler, 446 U.S. at 349-50, 100 S. Ct. at 1719 (citations and footnote omitted). While some sentences in this paragraph do not refer explicitly to multiple representation, they must be read in the context of the first and last sentences of the paragraph, which do. In particular, the last sentence, which actually states the standard, requires that counsel have \"actively represented \" conflicting interests, not that he have \"actively been in a conflict situation.\" Further, the two cases cited as authority in this section, Glasser v. United States, 315 U.S. 60, 62 S. Ct. 457, 86 L. Ed. 680 (1942), and Holloway v. Arkansas, 435 U.S. 475, 98 S. Ct. 1173, 55 L. Ed. 2d 426 (1978), were multiple representation cases, and the footnote at the end of the paragraph cites a law review article about multiple representation: Comment, Conflict of Interests in Multiple Representation of Criminal Co-Defendants, 68 J. Crim. L. \u0026 Criminology 226, 231-32 (1977).\n\nJustice Marshall's separate opinion in Cuyler, written to challenge the adverse effect prong of the test, endeavors to define \"conflict of interests.\" 446 U.S. at 355 n.3, 100 S. Ct. at 1722 n.3 (Marshall, J., Concurring in part and Dissenting in part). In each of the ethics codes to which he refers, Justice Marshall cites only the canon or rule dealing with multiple client representation.\n\nFour later Supreme Court cases have clarified the scope of Cuyler. In the first, Wood v. Georgia, 450 U.S. 261, 101 S. Ct. 1097, 67 L. Ed. 2d 220 (1981), three employees of an adult movie theater were prosecuted for distributing obscenity. The theater paid for their representation and also agreed to pay their fines. When the theater broke its promise and did not pay, the employees' probation was revoked and the employees were incarcerated. The Supreme Court granted certiorari to examine whether a state could imprison a probationer for not paying a fine, but after viewing the record, the Court remanded the case for consideration of a possible conflict of interest.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Id. at 273-74, 101 S. Ct. at 1104.\n\nIn Wood, the Court was troubled by the lawyer's apparent decision to undertake a strategy that benefitted the theater at the expense of the employees. The opinion noted that \"their [the employees'] counsel has acted as the agent of the employer,\" id. at 267, 101 S. Ct. at 1101; charged \"that the employer and petitioners' attorney were seeking to create a test case,\" id.; and concluded its conflict Discussion by noting that \"if petitioners' counsel was serving the employer's interest in setting a precedent, this conflict in goals may well have influenced the decision of the trial court . . . .\" Id. at 268, 101 S. Ct. at 1102. While the opinion does not say whether the lawyer formally represented the theater or not, the lawyer was at least in the functional equivalent of a joint representation. \"Petitioners were represented by their employer's lawyer, who may not have pursued their interests single-mindedly.\" Id. at 271-72, 101 S. Ct. at 1103. Both the theater and the employees expected him to advance their interests, yet to serve one might require him to fail the others, while doing nothing could harm both.\n\nThe second case, Nix v. Whiteside, 475 U.S. 157, 106 S. Ct. 988, 89 L. Ed. 2d 123 (1986) placed an outer bound on Cuyler. Whiteside's counsel conditioned his representation on Whiteside's not committing perjury. Id. at 161, 106 S. Ct. at 991. The Court held that a \"conflict\" between a lawyer's ethical obligation not to aid perjury and a client's desire to commit perjury \"is not remotely the kind of conflict of interests dealt with in Cuyler v. Sullivan.\" Id. at 176, 106 S. Ct. at 999. It noted that \"if a 'conflict' between a client's proposal and counsel's ethical obligation gives rise to a presumption that counsel's assistance was prejudicially ineffective, every guilty criminal's conviction would be suspect if the defendant had sought to obtain an acquittal by illegal means.\" Id.\n\nThe third case, Strickland v. Washington, supra, addressed Cuyler while defining how much prejudice a defendant must show in the usual ineffectiveness case. The Court stated that Cuyler \"is not quite\" a \"per se rule of prejudice,\" and that \"prejudice is presumed only if the defendant demonstrates that counsel 'actively represented conflicting interests' and that 'an actual conflict of interest adversely affected his lawyer's performance.'\" 446 U.S. at 692, 104 S. Ct. at 2067 (quoting Cuyler, 446 U.S. at 350, 348, 100 S. Ct. at 1719, 1718). The language Strickland excerpted from Cuyler comes directly from the passage reproduced earlier, in which the Court discussed a lawyer who \"actively represented\" multiple parties.\n\nContrary to Beets's argument, Strickland did not say that prejudice is presumed whenever counsel breaches the duty of loyalty. See Beets, 986 F.2d at 1493 (Higginbotham, J., Concurring). Strickland mentioned the duty of loyalty to underscore the general significance of conflicts of interest. 446 U.S. at 692, 104 S. Ct. at 2067. To define when that problem becomes serious enough to attain constitutional import, or, put differently, when it triggers the \"not quite per se rule of prejudice,\" the Court quoted a section of Cuyler discussing multiple representations. Id.\n\nThe last case in this series is Burger v. Kemp, 483 U.S. 776, 107 S. Ct. 3114, 97 L. Ed. 2d 638 (1987), in which the Court applied the Cuyler analysis to determine whether a habeas corpus petitioner's case had been adversely affected by an \"actual conflict\" arising out of his attorney's having participated with a law partner in the defense of a co-defendant. Both men had been charged with capital murder, and each defendant contended that he had less responsibility and was less culpable than his co-defendant. Nevertheless, the Court found no actual conflict and no adverse effect of the assumed multiple representation on Burger's defense. Burger reinforces the notion that not every potential conflict, even in multiple representation cases, is an \"actual\" one for Sixth Amendment purposes.\n\nIn sum, the Supreme Court has not expanded Cuyler to reach the ethical violations alleged in Beets's case. Cuyler, a multiple representation case, restated a rule developed in multiple representation cases. Nix declined to extend that rule to all conflicts between client and lawyer. Wood simply recognized that some third-party fee arrangements can develop into the functional equivalent of multiple representation. Strickland cited Cuyler 's language dealing with the impact of multiple representation. Several Justices have acknowledged this apparent limitation of Cuyler. See Illinois v. Washington, 469 U.S. 1181, 105 S. Ct. 442 (1984) (White, J., Dissenting from denial of certiorari).\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e To this day, however, the uncertainty remains.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The Dissent shares this uncertainty, arguing on one hand that Cuyler is not limited to multiple or serial representation cases but acknowledging that it should not apply to most breaches of legal ethics.\n\nB. Whether Cuyler Should Apply to Conflict Between an Attorney's Personal Interest and his Client's Interest\n\nThe Sixth Amendment assures defendants of legal counsel whose reasonably effective assistance permits a fair trial. Strickland, 466 U.S. 668, 104 S. Ct. 2052, 80 L. Ed. 2d 674 (1984); Nix v. Whiteside, 475 U.S. 157, 106 S. Ct. 988, 89 L. Ed. 2d 123 (1986). In the absence of controlling authority, we must decide whether, when a lawyer places his self-interest above that of the client, the resulting conflict deserves Cuyler 's \"not quite per se \" rule of prejudice or Strickland 's more deferential standard of attorney competence. Which of these standards better promotes a fair trial?\n\nThose who seek to apply the Cuyler standard will argue that the attorney's duty of loyalty to the client is of fundamental importance. E.g., Strickland, 466 U.S. at 692, 104 S. Ct. at 2067. Compromise that loyalty, and the attorney has negated the assumption underlying Strickland 's deferential approach to reasonable professional conduct, which is that the attorney has the best interests of the client at heart. In order to satisfy the Sixth Amendment, any breach of the duty of loyalty must meet the severe standard of \"not quite per se \" prejudice.\n\nThat position has some appeal, but in our view, it oversimplifies legal ethics and would obscure Sixth Amendment doctrine. Not all conflicts of interest that affect the attorney's \"duty of loyalty\" have the same consequences, and they are not all suited to Cuyler 's stringent rule.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Even the Dissent does not advocate applying the Cuyler rule to all breaches of the duty of loyalty. The Dissent contents itself with arguing that a media rights contract and a few other breaches have a \"highly particularized and focused source\" that justified application of Cuyler.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\n1. The scope of the \"duty of loyalty\" is ambiguous.\n\nFounding constitutional doctrine on the lawyer's \"duty of loyalty\" is an enterprise set in shifting sand. The term \"duty of loyalty,\" narrowly defined, refers to an attorney's responsibility to place his client's interest ahead of his own interest or, in the case of multiple representation, not to sacrifice one client's interest for the other's. See, e.g., ABA Annotated Model Rules of Professional Conduct, Rule 1.7 cmt. (1992). But even on this level, legal ethics rules generally distinguish between the duty of loyalty as measured against an attorney's self-interest and cases of multiple representation. More troublesome, the boundaries of the duty of loyalty are elastic; they potentially subsume or overlap a number of other ethical responsibilities to the client.\n\nTaking the narrow sense of the duty of loyalty, the canons and rules of ethics treat separately conflicts arising from the attorney's self-interest and those involving multiple client representation. See, e.g., ABA Annotated Model Rules of Professional Conduct, Rule 1.7:\n\nConflict of interest: General Rule\n\n(a) A lawyer shall not represent a client if the representation of that client will be directly adverse to another client, unless . . .\n\n(b) A lawyer shall not represent a client if the representation of that client may be materially limited by the lawyer's responsibilities to another client or to a third person, or by the lawyer's own interests unless . . . .\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThe reason for distinguishing multiple representation conflicts from those involving self-interest is clear. When multiple representation exists, the source and consequences of the ethical problem are straightforward: \"counsel represents two clients with competing interests and is torn between two duties. Counsel can properly turn in no direction. He must fail one or do nothing and fail both.\" Beets v. Collins, 986 F.2d at 1492, (Higginbotham, J., Concurring). \"An attorney cannot properly serve two masters.\" United States v. Locascio, 6 F.3d 924, 933 (2nd Cir. 1993). Conflicts between a lawyer's self-interest and his duty of loyalty to the client, however, fall along a wide spectrum of ethical sensitivity from merely potential danger to outright criminal misdeeds. Sources of potential conflict, from among the manifold variations possible, include: matters involving payment of fees and security for fees; doing business with a client; the use of information gained while representing a client; a lawyer's status as a witness; and a lawyer's actions when exposed to malpractice claims. Ethical rules typically separate each of these problems, for each type deserves particular consideration. See, e.g., ABA Annotated Model Rules of Professional Conduct, Rule 1.8.\n\nUltimately, the duty of loyalty in its broad sense resonates against the lawyer's obligation to perform competent, effective work. The ABA Model Professional Rules express this overlap:\n\nThe lawyer's own interests should not be permitted to have adverse effect on representation of a client. For example, a lawyer's need for income should not lead the lawyer to undertake matters that cannot be handled competently and at a reasonable fee. See Rules 1.1 and 1.5.\n\nABA Model Rule 1.7 cmt. Rule 1.1 states the lawyer's duty of competence, Rule 1.5 the duty to charge a reasonable fee. If the lawyer stints on his work or is not sufficiently diligent for a client either because he is not well paid by that client or because of an extrinsic influence, he has potentially breached the duty of loyalty. Where the obligation to a single client is concerned, the duties of loyalty and competence are intertwined.\n\n2. The effects of breaching the duty of loyalty are clearest in multiple representation cases.\n\nBecause multiple defendant representation poses a unique, straightforward danger of conflict, the Cuyler rule of \"not quite per se \" prejudice makes eminent sense. A defendant whose attorney \"actively represented conflicting interests\" has had no real lawyer secured to him by the Sixth Amendment. As Justice Powell put it in Cuyler, \"the conflict itself demonstrated a denial of the 'right to have the effective assistance of counsel.'\" 446 U.S. at 349, 100 S. Ct. at 1719 (quoting Glasser, 315 U.S. at 76, 62 S. Ct. at 467). Moreover, this type of conflict may be addressed by a prophylactic rule, whereby a court, made aware of multiple representation, can insure early in the criminal proceeding that the client has been informed of the pitfalls of multiple representation and knowingly waived any conflict. See, e.g., Fed. R. Crim. P. 44(c). As Strickland pointed out, \"Given . . . the ability of trial courts to make early inquiry in situations likely to give rise to conflicts, . . . it is reasonable for the criminal Justice system to maintain a fairly rigid rule of presumed prejudice for conflicts of interest.\" 466 U.S. at 692, 104 S. Ct. 2067.\n\nBut only in the multiple representation context is the duty of loyalty so plain. Only then is the risk of harm high enough to employ a near-per se rule of prejudice.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e While loyalty may be implicated in other judgments a lawyer makes, in no other category of conflicts is the risk of prejudice so certain as to justify an automatic presumption. See Cuyler, 446 U.S. at 349, 100 S. Ct. at 1719. When the duty of loyalty is challenged by an attorney's self-interest, the range of possible breaches, as previously shown, is virtually limitless. Likewise, their consequences on the quality of representation range from wholly benign to devastating. Compare United States v. Horton, 845 F.2d 1414, 1418-21 (7th Cir. 1988) with United States v. Ellison, 798 F.2d 1102, 1106-09 (7th Cir. 1986) and United States v. Stoia, 22 F.3d 766, 769-70 (7th Cir. 1994). Applying a near-per se rule of prejudice to this spectrum of potential ethical problems is a draconian remedy.\n\n3. Strickland best addresses attorney self-interest conflicts.\n\nIn stark contrast to multiple representation situations, there is little meaningful distinction between a lawyer who inadvertently fails to act and one who for selfish reasons decides not to act. The \"conflict\" between the lawyer's self-interest and that of his client is not a real conflict in the eyes of the law. Rather than being immobilized by conflicting ethical duties among clients, a lawyer who represents only one client is obliged to advance the client's best interest despite his own interest or desires. Even though his disloyalty does not leave the client bereft of counsel, it may well impinge on the effectiveness of his representation.\n\nA few illustrations demonstrate the persistent overlap between self-interested duty of loyalty problems and attorney effectiveness:\n\n(1) An attorney represents a client charged with white collar crime. His fee will be paid from the profits of the business. The attorney has an incentive to plea bargain rather than risk the business's closing if the client is unsuccessfully defended.\n\n(2) An attorney has neglected to file a competency motion. To cover up the mistake, it is alleged, he tardily files an inadequate motion.\n\n(3) An attorney undertakes client representation despite an overabundance of work. He then neglects to interview a potential alibi witness.\n\n(4) An attorney is a potential witness for a client he has represented in the past. Rather than testify, however, he continues to represent the client in the case.\n\nSee also cases cited in n.10, supra. The duty of loyalty and other ethical rules have arguably been tested or breached in each of these cases, but each also raises a question of lawyer competency.\n\nBecause the scope of the duty of loyalty with respect to attorney self-interest is inherently vague and overlaps with professional effectiveness, Strickland ought to set the constitutional norm of adequate representation. The Court has already hinted at such a possibility:\n\nUnder the Strickland standard, breach of an ethical standard does not necessarily make out a denial of the Sixth Amendment guarantee of assistance of counsel.\n\nNix v. Whiteside, 475 U.S. at 166, 106 S. Ct. at 993. Nix invoked Strickland, not Cuyler, as the benchmark for judging ethical violations. In so doing, the Court hesitated \"to narrow the wide range of conduct acceptable under the Sixth Amendment so restrictively as to constitutionalize particular standards of professional conduct and thereby intrude into the state's proper authority. . . .\" Id. A standard that requires a showing of prejudice and affords appropriate latitude to professional judgment best addresses ethical breaches under the Sixth Amendment.\n\nStrickland lists other powerful reasons supporting its more flexible test of constitutional competence. Strickland declined to \"exhaustively define obligations of counsel [or] form a checklist for judicial evaluation of attorney performance.\" 466 U.S. at 688, 104 S. Ct. at 2065. The Court stated that \"prevailing norms of practice as reflected in American Bar Association standards . . . are guides to determining what is reasonable, but they are only guides.\" Id. As Strickland astutely warned, \"any such set of rules would interfere with the constitutionally protected independence of counsel and restrict the wide latitude counsel must have in making tactical decisions.\" Id. at 689, 104 S. Ct. at 2065. Indeed,\n\nThe existence of detailed guidelines for representation could distract counsel from the overriding mission of vigorous advocacy of the defendant's cause. Moreover, the purpose of the effective assistance guarantee of the Sixth Amendment is not to improve the quality of legal representation, although that is a goal of considerable importance to the legal system. The purpose is simply to ensure that criminal defendants receive a fair trial.\n\nId. at 689, 104 S. Ct. at 2065.\n\nThese considerations, which prompted the Court's reluctance to micromanage standards of professional and ethical behavior, apply with full force to the duty of loyalty with respect to attorney self-interest. The interests of both the defendant and society are served by a standard that, as far as possible, does not straitjacket counsel in a stifling, redundant federal code of professional conduct. Moreover, the purpose of the Sixth Amendment is not primarily to police attorneys' ethical standards and create a constitutional code of professional conduct; its purpose is to assure a fair trial based on competent representation. Finally, while Strickland does state that counsel owes the client a duty to avoid conflicts of interest (citing Cuyler), this is just one duty listed among others -- the duties to advocate the defendant's cause, to consult with and keep the defendant informed, and to employ skill and knowledge on the defendant's behalf. The Court emphasizes these as an unexhaustive list of the basic duties of counsel. Id. at 688, 104 S. Ct. at 2065. To list these duties is thus the starting point, not the Conclusion, of constitutional analysis. We are firmly persuaded that it is most consistent with Strickland to assess the duty of loyalty pitted against a lawyer's self-interest under the Strickland test.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\n4. Cuyler v. Strickland\n\nIf Cuyler 's more rigid rule applies to attorney breaches of loyalty outside the multiple representation context, Strickland 's desirable and necessary uniform standard of constitutional ineffectiveness will be challenged. Recharacterization of ineffectiveness claims to duty of loyalty claims will be tempting because of Cuyler 's lesser standard of prejudice. See United States v. Stoia, 22 F.3d 766, 769-70 (7th Cir. 1994); United States v. McLain, 823 F.2d 1457, 1463-64 (11th Cir. 1987). A blurring of the Strickland standard is highly undesirable. As a result of the uncertain boundary between Cuyler and Strickland, the focus of Sixth Amendment claims would tend to shift mischievously from the overall fairness of the criminal proceedings -- the goal of \"prejudice\" analysis -- to slurs on counsel's integrity -- the \"conflict\" analysis. Confining Cuyler to multiple representation claims poses no similar threats to Strickland. The Dissent, of course, purports to avoid unwarranted expansion of Cuyler by confining its scope, apart from multiple representation cases, to instances involving \"extraordinary\" attorney-client conflicts \"stemming from a highly particularized and powerful source.\" This open-ended, though hyperbolic, language is bereft of any animating principle and, as such, is unfortunately guaranteed to spawn far more litigation that it resolves.\n\nFor all these reasons, we conclude that Strickland governs the issue whether Andrews's media rights contract and status as a witness resulted in the denial of constitutionally adequate counsel to Beets.\n\nC. Strickland Applied\n\nTo prevail under the Strickland standard, Beets must show that her attorney's performance fell below an objective standard of reasonableness and that it prejudiced the defense, undermining the reliability of the proceeding. Strickland prejudice, as has been noted, considers the overall result of the prosecution. Beets alleged two ethical breaches by Andrews, the taking of a media rights contract in full satisfaction of his fee and his failure to withdraw and testify as a material witness. Although these lapses are alleged to interact, they may conveniently be discussed in turn. It is important to note that although the Dissent would not approve the following Discussion of Andrews's competence under Strickland, our colleagues do agree that if Strickland sets the Sixth Amendment standard here, there is no constitutional violation because Beets was not prejudiced by Andrews's conduct as her counsel.\n\n1. Media rights contract.\n\nThis court joins other courts, scholars and organizations of the bar who have uniformly denounced the execution of literary and media rights fee arrangements between attorneys and their clients during the pendency of a representation.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The Texas Code of Professional Responsibility stated at the time of this trial:\n\nPrior to the Conclusion of all aspects of the matter giving rise to his employment, a lawyer shall not enter into any arrangement or understanding with a client by which he acquires any interest in publication rights with respect to the subject matter of his employment or proposed employment.\n\nSupreme Court of Texas, Code of Professional Responsibility, DR5-104(B) (1982). See also ABA Model Rules of Professional Conduct, Rule 1.8(d). Succinctly, a media rights contract is offensive because it may encourage counsel to misuse the judicial process for the sake of his enrichment and publicity-seeking, and it necessarily trades on the misery of the victim and his family.\n\nPerhaps because of the widely shared professional disapproval of media rights contracts, few cases challenging them have arisen. Although the cases have been Judged under various legal standards, hardly any convictions have been reversed for a pernicious influence of such contracts on counsel's effectiveness.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nSo it must be here. Notwithstanding Andrews's apparent breach of his ethical obligations, this court sits not to discipline counsel but to determine whether Beets was thereby deprived of a fair trial. The state has the duty to punish an attorney for unethical conduct. For reasons not disclosed in the record, the state declined to discipline Andrews for this fee arrangement. While the media rights contract posed a serious potential conflict of interest, Beets failed to show how it hindered Andrews's presentation of her defense or prejudiced her by rendering the result of her criminal prosecution fundamentally unreliable. Beets has not asserted that Andrews manipulated the case to enhance publicity\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e or that the contract generally clouded his good judgment.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Beets has shown no actual influence of the media rights contract on the conduct of her defense. In the state habeas proceedings, Andrews filed an affidavit in which he denied that the media rights contract affected his representation of Beets. The state courts accepted this unrebutted statement. At the federal habeas hearing, Andrews's co-counsel Gilbert Hargrave was asked by the court, \"was there any action taken by Mr. Andrews during the trial of this case that was in any way affected by the fact that he or his son had this book deal assignment?\" Hargrave answered, \"No. If there is such an action, I'm not aware of it. I did not observe it.\" The federal district court concluded:\n\nAfter further review of the record, the Court simply does not believe that the media rights contract affected Andrews' performance at any conscious level. (footnote omitted). There is, of course, no adverse effect where there was no effect at all.\n\nThe finding of the district court is shielded by the clearly erroneous standard, while that of the state courts is entitled to the presumption of correctness in habeas corpus proceedings. 28 U.S.C. ยง 2254(d). Those findings are that the media rights contract did not affect Andrews's conduct of Beets's defense. Accordingly, whether or not the media rights contract represented deficient performance under Strickland, it did not prejudicially affect Beets's defense.\n\nBeets continues to assert, however, that because of the media rights contract, Andrews was motivated to continue his work as defense counsel when he should have withdrawn and testified as a material defense witness. There is no support in the record for a finding concerning Andrews's subjective motivation, and none has been made by the state or federal courts. Whether a lawyer-as-witness conflict existed, however, is a separate question to which we now turn.\n\n2. Andrews as defense witness.\n\nBeets's theory that Andrews should have testified as a defense witness runs thus: if the jury believed that Andrews first suggested to her, eighteen months after Jimmy Don's disappearance, the possibility of claiming Jimmy Don's death benefits from the fire department, they could not find that Beets murdered Jimmy Don for remuneration. Andrews was therefore a material exculpatory witness who was ethically required to withdraw and testify on her behalf.\n\nBoth prongs of Strickland are at issue here: whether Andrews's performance was unconstitutionally deficient and whether his failure to testify prejudiced the defense. From an ethical standpoint, the lawyer-as-witness conflict, unlike the loyalty conflict implicated by a media rights contract, is difficult to sort out. This court may be guided but is not constitutionally bound by the Texas Code of Professional Responsibility effective at the date of trial:\n\nIf, after undertaking employment in contemplated or pending litigation, a lawyer learns or it is obvious that he or a lawyer in his firm ought to be called as a witness on behalf of his client, he shall withdraw from the conduct of the trial and his firm, if any, shall not continue representation in the trial . . . .\n\nSupreme Court of Texas, Code of Professional Responsibility, DR 5-102(A) (1982) (emphasis added). For reasons that are intuitively obvious, neither this nor similar provisions creates a bright-line ethical rule requiring withdrawal of a lawyer whenever he might be a witness for his client.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e The constitutional evaluation of a lawyer's decision whether to take the stand must also be flexible and must accord a heavy measure of deference to the lawyer's presumed professional capability. Strickland, 466 U.S. at 690, 104 S. Ct. at 2066. The essential inquiry is what sort of testimony he could have given in Beets's defense.\n\nRegarding the alleged advocate/witness conflict, the district court concluded that\n\nAndrews obviously should have known of his dual status as witness and advocate prior to trial. Andrews' dual status should have also been apparent to both the Judge and district attorney as the trial unfolded. The Court is persuaded that the conflict never occurred to any of the participants.\n\nThe court correctly found that the experienced trial court participants never perceived of Andrews as a potential defense witness.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Perhaps it can be inferred from this collective unawareness that Andrews's exculpatory testimony was not highly significant. But more important than speculation is a careful review of the state court and federal habeas records, which considerably diminishes the force of such potential testimony.\n\nBeets relies heavily on an affidavit Andrews executed for the federal habeas proceeding stating that Beets\n\nhad no idea whether she was entitled to benefits. She did not even know whether benefits existed. She did not know, for instance, whether her husband had been insured, or whether he had a pension, nor did she know whether she was the beneficiary. She did not know who, if anyone, may have been her husband's insurer or what amount he may have been insured for.\n\nAndrews Affidavit P 7. He also stated that he \"was the one who mentioned the possibility that she may have been entitled to benefits.\" Id. P 10, Beets, 986 F.2d at 1487.\n\nTaken at face value, the affidavit suggests that Andrews would have been a helpful witness to Beets. At the habeas hearing, however, his answers to questions posed by Beets's new attorney were not nearly as strong:\n\nQ. Well, as your affidavit states, I believe she came to you looking for insurance benefits, but not with respect to the death of Jimmy Don Beets, rather for a home that had been burned. Is that correct?\n\nA. [Andrews] Well, I believe that was a mobile home.\n\nQ. Correct. And it was your idea that she may have some benefits arising from this death and she had no idea of this. Is that correct?\n\nA. Well, I thought it would be my idea and I think my obligation too because I don't know if it's in this affidavit or not, but her husband had been missing for quite some time and everybody in the community knew that. I knew Mr. Beets worked for the Fire Department. It was through an investigation of myself and two lawyers here in Tyler that we realized that some benefits might be due and payable.\n\nQ. Did Ms. Beets suggest this or did you in your initial conversations with her?\n\nA. Partner, that's been a long time ago. I believe that I went into it first. I couldn't swear to that and I'm under oath.\n\nQ. Well, in your affidavit you've stated that you knew from your Discussions with her that this was not the case, that is, that the State could not prove that she took the life of Mr. Beets for the purpose of remuneration. Is that correct? Is that a true statement?\n\nA. What page are you reading from?\n\nQ. That's Paragraph 14.\n\nA. That was my thought and belief. Yes, that's true and correct.\n\nQ. And just to reference Paragraph 7 of the affidavit, you also stated that when you first questioned Ms. Beets you quickly discovered that she had no idea whether she was entitled to benefits and you've sworn that that was a true statement. Is that correct?\n\nA. That was a Conclusion that I drew by my conversation with Betty Beets.\n\nThe most that Andrews could persuade the jury of was his \"Conclusion\" that Betty Beets knew nothing of her husband's benefits when she visited him.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nMoreover, Andrews was not the only source of testimony that Beets was unaware of Jimmy Don's death benefits before she visited Andrews. Beets herself so testified at trial under questioning by Andrews. Had Andrews elicited this testimony believing or knowing it to be false, he would be exposed to a charge of suborning perjury.\n\nAdditional testimony on Beets's ignorance of the death benefits was adduced from Bruce Roberts. The only part of Andrews's proposed testimony that Bruce Roberts could not replicate was Andrews's affidavit statement that he had been the one to suggest to Beets that she seek her missing husband's insurance and pension benefits. Beets vastly overrates the importance of this statement by Andrews, however. Because Andrews had no knowledge of Beets's activities from the time of the murder until nearly two years later when she met with him, he could not testify as to her knowledge of what benefits might be available. Both he and Roberts could only draw an inference or speculate upon her state of mind from their conversations.\n\nIn any event, neither Andrews nor Roberts was the first witness to discuss Jimmy Don's death benefits with Beets. That distinction belonged to Denny Burris, who testified that when he visited her a few days after the disappearance, she inquired about benefits. The fact of inquiry does not show that she knew beforehand of the existence of benefits, but her inquiry and Discussion with Burris necessarily weakened the argument that, many months later, Beets's attorneys thought she knew nothing of potential death benefits. Neither Andrews nor Roberts could dispel a certain skepticism about that claim.\n\nBecause Andrews's potential testimony for Beets was cumulative, he was not a necessary witness for her defense and did not face a substantial advocate/witness conflict. His failure to withdraw and testify was not professionally unreasonable under Strickland.\n\nNot only was Andrews's potential exculpatory testimony largely cumulative, but when considered against the totality of evidence that Beets committed murder for remuneration, we cannot say that his failure to testify was prejudicial. Beets told her daughter Shirley Stegner, in connection with the murder of Beets's fourth husband, that she would have lost the trailer, which he owned, if they had simply divorced. Beets surreptitiously tried to obtain a life insurance policy on Jimmy Don only months before he disappeared. After his death, Beets sold his boat and tried to sell and then to collect fire insurance proceeds on his separately owned trailer home. Chaplain Denny Burris testified that Beets was interested in Jimmy Don's benefits within days after he \"went fishing.\" All of this evidence, as the Texas Court of Criminal Appeals noted, was pertinent to the question of Beets's remunerative motive. Finally, the cold, calculated nature of the crime and its cover-up strongly suggested that Beets had a motive beyond simply getting rid of her husband after one year of marriage. She wanted it to appear that he died of natural causes. If he had merely disappeared, suspicion would have focused on her and she could not have benefitted from the crime. Neither we nor the Dissent can conclude that the result of her prosecution would in reasonable probability have differed if Andrews had testified.\n\nD. Alternate Cuyler Holding\n\nFinally, even if this en banc court has erred in suggesting that attorney conflicts of interest, apart from the multiple representation context, should be governed by the Strickland standard, we conclude that Beets's claim also fails to garner relief under Cuyler. Because there was no objection at trial to either of the alleged conflicts, Beets had to establish the existence of an actual conflict that adversely affected her lawyer's performance. Cuyler, 446 U.S. 335 at 348, 100 S. Ct. 1708 at 1718, 64 L. Ed. 2d 333.\n\nThe panel opinion first concluded there was no \"actual conflict\" of a witness/advocate nature because, as was shown in the preceding section, Andrews's testimony was cumulative of other defense evidence and not materially more helpful to Beets. The panel also concluded that Beets alleged, at most, a merely hypothetical or speculative witness/advocate conflict, which did not materialize into an actual conflict that forced Andrews to choose between his self-interest and his duty to Beets. See Stevenson v. Newsome, 774 F.2d 1558, 1561-62 (11th Cir. 1985), cert. denied, 475 U.S. 1089, 106 S. Ct. 1476, 89 L. Ed. 2d 731 (1986) (To establish an actual conflict \"it must be demonstrated that 'the attorney 'made a choice between possible alternative courses of action, . . . If he did not make such a choice, the conflict remained hypothetical.\"\") (citations omitted); United States v. Litchfield, 959 F.2d 1514, 1518 (10th Cir. 1992); United States v. Acevedo, 891 F.2d 607, 610 (7th Cir. 1989); United States v. Horton, 845 F.2d 1414, 1419 (7th Cir. 1988). The panel observed that Beets never proved that the potential conflict of interest developed into an actual conflict of interest.\n\nThe Dissent has agreed that a witness/advocate conflict alone is not the sort that even under their approach should be governed by a Cuyler inquiry. Because the entire court subscribes to the application of Strickland to this type of conflict, we are in agreement that Beets has not established a constitutional violation.\n\nAs to the media rights contract, there was no \"actual conflict\" under Cuyler because, as the record abundantly shows and as two Judges on the panel held, the potential conflict speculated by Beets never materialized into an actual conflict in Andrews's representation. The record does not demonstrate that the contract induced Andrews to compromise his zealous representation of Beets in favor of his own pecuniary interest. Absent a showing that Andrews nefariously chose to compromise his efforts in such a way, this court cannot conjecture otherwise. See, e.g., Stevenson 774 F.2d at 1561-62; see also cases cited n.20, supra.\n\nThe Dissent also charges that the existence of an actual conflict inducing constitutionally ineffective assistance of counsel is a question of fact Judged from an \"objective\" standpoint. However, the Supreme Court rejected this proposition in both Strickland and Cuyler. For instance, in Strickland, the Court explicitly recognized that\n\nin a federal habeas challenge to a state criminal judgment, a state court Conclusion that counsel rendered effective assistance is not a finding of fact binding on the federal court to the extent stated by 28 U.S.C. ยง 2254(d). Ineffectiveness is not a question of 'basic, primary, or historical fact.' Rather, like the question whether multiple representation in a particular case gave rise to a conflict of interest, it is a mixed question of law and fact.\n\nStrickland, 466 U.S. at 698, 104 S. Ct. at 2070 (quoting Townsend v. Sain, 372 U.S. 293, 309 n.6, 83 S. Ct. 745, 755 n.6, 9 L. Ed. 2d 770 (1963)) (citing Cuyler, 446 U.S. at 342, 100 S. Ct. at 1714). Consequently, as with the related question of constitutional ineffectiveness of counsel, the federal district court's finding of an actual conflict inherent in the media rights contract is not shielded from appellate scrutiny by the clearly erroneous rule.\n\nFinally, even if the media rights/witness conflict was an actual one, it did not adversely effect Andrews's representation of his client.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e The Dissent seeks to apply a three part test used by the Second Circuit in Winkler v. Keane, 7 F.3d 304 (2d Cir. 1993), cert. denied, 128 L. Ed. 2d 79, 114 S. Ct. 1407 (1994), as the basis of its Cuyler analysis. The Dissent thus argues that (1) there was an \"actual conflict\" for Cuyler purposes simply because of the existence of the media rights contract; (2) there was an \"adverse effect\" on Andrews's representation because he could have withdrawn and testified for Beets; and (3) the remaining question, which must be remanded, is whether the media rights contract caused Andrews to withdraw. Our disagreements whether there was an actual or potential conflict and whether the conflict should be Judged from an objective or subjective standpoint are of academic interest at this point, however. Even if we agreed with the Dissent's position on the first two Winkler issues, this en banc majority finds no basis for a remand for additional fact finding. The state courts did their job. Confronted with Beets's allegation that Andrews ineffectively represented her because of the media rights contract, Andrews filed an affidavit specifically denying the charge. The state trial courts specifically found that the contract did not affect his zealous representation.\n\nThis federal court must accord a presumption of correctness to that finding. Sumner v. Mata, 449 U.S. 539, 547, 66 L. Ed. 2d 722, 101 S. Ct. 764 (1981)\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e . Further, although the federal district Judge declined to plumb counsel's subconscious motivation, he found no conscious effect of the media contract on Andrews's decision not to testify. As the court put it, \"Where there is no effect, there can be no adverse effect.\" There is no point in remanding to give Beets a chance to prove what she has not yet proved in state or federal district court. The media rights contract did not adversely affect Andrews's performance because it had no impact on his failure to testify. See Winkler, 7 F.3d at 310 (the court adheres to state court findings that contingent fee did not cause counsel's strategy decisions).\n\nAccordingly, Beets has not established that she was deprived of constitutionally effective counsel under Cuyler because of the media rights contract or Andrews's dual status as witness/advocate.\n\nConclusion\n\nFor the foregoing reasons, the district court judgment granting the writ of habeas corpus must be REVERSED.\n\nHIGGINBOTHAM, with DAVIS and EMILIO M. GARZA, Circuit Judges, Concurring:\n\nI concur in the opinion of the court except its alternative holding that petitioner would be entitled to no relief if the Cuyler standard were applicable. For the reasons stated in my opinion Concurring in the panel opinion, I would afford petitioner at least the relief fashioned by Judge King in her Dissenting opinion's application of Cuyler, if it were applicable.\n\nKING, with POLITZ, Chief Judge, GARWOOD, SMITH and WIENER, Circuit Judges, Dissenting:\n\nI respectfully Dissent from the majority's decision to reverse the district court's judgment granting the writ.\n\nIt is important to recognize at the outset that whether an actual conflict of interest between an attorney and his client exists is a separate inquiry from whether we apply Cuyler v. Sullivan, 446 U.S. 335, 64 L. Ed. 2d 333, 100 S. Ct. 1708 (1980), or Strickland v. Washington, 466 U.S. 668, 80 L. Ed. 2d 674, 104 S. Ct. 2052 (1984), when a criminal defendant or, as here, a habeas petitioner challenges his conviction based on the alleged existence of an actual conflict of his trial counsel. Whether an attorney-client conflict exists must be addressed at the commencement of the representation not only by the attorney and his client, but also frequently by the trial court. The same question must be addressed as a threshold issue on appeal or on habeas review. If we allow the context in which the question of the existence of an actual attorney-client conflict arises here -- on retrospective review of a conviction -- to distort the criteria for determining whether an actual conflict exists, we inevitably skew the same inquiry when it is made at the beginning of the representation. This we cannot do.\n\nThe district court's Conclusion that the execution of a media rights contract created an actual conflict of interest between E. Ray Andrews and his client, Betty Lou Beets, is correct, and the majority's contrary Conclusion is legally and factually insupportable. If that conflict of interest was the cause of Andrews's failure to withdraw and testify on Beets's behalf -- an issue that I would remand to the district court to decide -- then Beets will have shown that it had an adverse effect on Andrews's representation, and applying Cuyler, the writ was properly granted.\n\nFinally, I disagree with the majority's unprecedented decision to limit the rule of Cuyler to cases involving multiple or serial representation. The court thereby excludes from the ambit of Cuyler an exceptional conflict between an attorney's self-interest and his client's interest stemming from a highly particularized and powerfully focused source, a media rights contract. If we reserve Cuyler for extraordinary attorney-client conflicts of that sort, not normally encountered in law practice, and we apply Strickland to alleged deficiencies in an attorney's performance having their sources in the more common incidents of the attorney-client relationship, we avoid having the Cuyler exception swallow the Strickland rule. At the same time we preserve the benefit of the Cuyler inquiry for those exceptional cases that lie at the heart of the principles animating it.\n\nI. BACKGROUND\n\nA. Andrews's Representation\n\nA full understanding of the issues in this appeal requires a more complete examination of the facts and circumstances surrounding E. Ray Andrews's representation of Betty Lou Beets than the majority provides. It is clear from the record of Beets's trial and from the record of the federal habeas proceedings that the testimony of Andrews was critical to Beets's defense that she did not murder Jimmy Don Beets for remuneration. It is also clear from the record of the federal habeas proceedings that Andrews contemplated obtaining the media rights contract very early in his representation of Beets, long before the trial began.\n\nAs the majority notes, in late 1984, more than a year after Jimmy Don's disappearance, the mobile home in which Beets lived was destroyed by fire.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The insurance company, apparently suspicious of the claim, resisted paying on the policy. Thus, in his testimony at the federal habeas proceeding, Andrews agreed that Beets \"came to [him] looking for insurance benefits, but not with respect to the death of Jimmy Don Beets.\" Instead, Andrews testified, Beets approached him for help in collecting the proceeds from the insurance policy covering the mobile home.\n\nAt the habeas proceeding, Andrews testified that he believed that he had suggested to Beets, and thought he was obligated to suggest, pursuing any benefits that might be available as a result of Jimmy Don's disappearance. As Andrews testified, \"Ms. Beets never pushed me like some clients would for money, proceeds, and it was . . . through independent investigation that I found out that she had money maybe due and payable or owing to her.\" Andrews and Beets agreed that Andrews, in a contingent fee arrangement, would help Beets pursue any benefits to which she might be entitled.\n\nAfter his initial efforts proved unsuccessful, Andrews sought the assistance of brothers Bruce L. and Randell C. Roberts, attorneys who were practicing in Tyler, Texas. According to Randell Roberts's affidavit that was admitted into the record of the habeas proceeding in lieu of live testimony, Andrews arranged for himself, Beets, and Randell Roberts to meet. Roberts recalled that Andrews did most of the talking at that initial meeting, and that:\n\nWith respect to potential life insurance benefits . . . Ms. Beets was able to provide . . . very little information. It was my impression that she believed at the time that there were probably some life insurance or pension benefits due to her, however, she appeared to know very little about the amount of the benefits in question or the potential insurance companies or other sources which would be responsible for these benefits.\n\nEventually, Randell Roberts passed the file to his brother Bruce, who began looking for benefits. At Beets's trial, Bruce Roberts testified that \"when [he] first took the case, [Beets's] primary concern was . . . with the fire insurance company.\" Bruce Roberts also testified that Beets had what \"looked like part of a policy from the credit union in Dallas. She also knew that she had or was asking me to check into pension benefits.\" Bruce Roberts further testified, and later reemphasized in his affidavit which was also admitted into the record of the habeas proceeding, that Beets had no idea what benefits she may have been entitled to. Despite Beets's ignorance about any benefits she may have been due, Bruce Roberts pursued the claims, writing letters and making telephone calls to anyone he thought might have owed Beets money as a result of her husband's disappearance. Bruce Roberts's efforts met with some success, and he had Jimmy Don declared dead and secured a settlement with the City of Dallas for some pension funds. In early June of 1985, before the settlement was finalized, Jimmy Don's skeletal remains were unearthed from a wishing well in front of the mobile home. Beets was subsequently arrested and charged with murder.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The case, as the majority notes, generated significant local and national media attention. Andrews agreed to represent Beets in the murder trial, and there is evidence that from very early on in his representation of Beets, Andrews envisioned profiting from the Betty Lou Beets story.\n\nThe same month that Beets was arrested and that Andrews began his representation of Beets -- June 1985 -- Andrews associated Gilbert M. Hargrave to assist in the trial. According to Hargrave's testimony in the federal habeas proceeding, in June of 1985, long before the trial began and before Hargrave had agreed to work on the case, Andrews stated, \"'I'm going to get the book rights and I'll give you twenty percent of the book rights.'\" Hargrave also testified that \"[Andrews] thought the case was a valuable case, that the book rights were valuable, that it was notorious, famous, . . . and that it would generate a lot of income-producing type of publicity for himself and myself.\"\n\nAdditionally, well before Beets's trial commenced, Andrews undertook efforts to secure the media rights. The record of the federal habeas proceeding contains two draft versions of a contract assigning the media rights of the trial to Andrews's son. Specifically, there is a typed draft of a media rights contract dated September 23, 1985 and a handwritten draft of the same document, presumably written sometime earlier. Thus, even though the majority notes that \"on October 8, just after Beets's trial commenced, she signed a contract transferring all literary and media rights in her case to Andrews's son,\" Beets v. Collins, F.3d , * 6 (5th Cir. 1995) (en banc), it is clear from the record that securing the media rights was on Andrews's mind virtually from the beginning of his representation of Beets in connection with her indictment for Jimmy Don's murder.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e As it developed, the assignment of the media rights was the consideration for Andrews's services in defending Beets.\n\nDuring the trial, Andrews had two lines of defense. His principal strategy during the guilt phase of the trial was simply to show that Beets did not commit the murder. Andrews, however, left little doubt that his secondary strategy was \"to try to attack the State's proof on their claim that [Beets] did it for remuneration.\" As co-counsel Hargrave testified at the habeas proceeding, \"the basic theory [of the defense] was that [Beets] was not guilty, that she hadn't committed the act that she was under indictment for and that if she actually had that she certainly hadn't done so for remuneration.\"\n\nAccordingly, during trial, Andrews repeatedly attempted to make clear to the jury that it was his suggestion that Beets seek out benefits resulting from Jimmy Don's disappearance. As noted above, Andrews elicited testimony from Bruce Roberts that pursuing benefits from Jimmy Don's disappearance was not suggested by Beets. Moreover, during his examination of Beets, Andrews attempted to show that Beets was not interested in any insurance benefits.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Further, during his closing argument, Andrews again attempted to convey that he had suggested pursuing insurance and pension benefits, stating:\n\nThey're saying that [Beets] killed Jimmy Don Beets for insurance money. Ladies and gentlemen, she didn't even know anything about insurance, how much insurance he had or anything. Me and other lawyers inquired into this. Never called me in nearly two years . . . . Does that sound like somebody that's out after insurance money?\n\nAndrews reemphasized this near the end of his argument, asking the jury:\n\nDid [the prosecutor] ever prove to you, people that she ever collected any of his retirement proceeds? . . . The only proof that came in was a lawyer works for money. If a lawyer sees . . . there's a case there, they're going to go after it. And I probably should have gone after it faster. I'm certainly glad now I didn't.\n\nViewing the record in this case, there is no question that attempting to show that Beets did not act for remunerative purposes was an important aspect of Andrews's strategy. Andrews's efforts to accomplish this objective, both in examination and in argument, were neutralized to some extent by the court's repeated instruction that \"what the lawyers say is not evidence.\" As Beets's counsel, Andrews, the only person besides Beets who could testify about exactly how the pursuit of the insurance and retirement benefits began, was precluded from testifying, and the jury was instructed not to consider as evidence any statements which he made about his involvement. Moreover, it is possible that the jury discounted the statements that he did make at trial as impermissible efforts to bolster his client's case.\n\nJudge Higginbotham's view about the importance to Beets's defense of Andrews's testimony, set out succinctly in his concurrence to the panel opinion in this case, bears repeating:\n\nAndrews's testimony could have significantly bolstered the defense. . . . Andrews . . . could have told the jury that he mentioned to Beets the possibility of receiving benefits shortly after Jimmy Don's disappearance. Any later interest or inquiry into benefits could have been attributable to this post-murder information. Moreover, Andrews could have established Beets's lack of knowledge at a time closer to the murder than Roberts' evidence. Andrews's testimony was not merely cumulative. . . . It certainly would have been in Beets's best interest for Andrews to have testified.\n\nBeets v. Collins, 986 F.2d 1478, 1491 (5th Cir.) (Higginbotham, J., specially Concurring), reh'g en banc granted, 998 F.2d 253 (5th Cir. 1993).\n\nB. The District Court's Findings\n\nA full grasp of this case also requires a careful consideration of the district court's findings. The district court began its Order by noting that \"it is apparent that the defense counsel, E. Ray Andrews, fought for his client to the full extent of his ability and energy. . . . Andrews is well known to the Court as a competent and tenacious criminal lawyer.\"\n\nSubsequently, the district court ruled against Beets on most of her habeas claims, and then turned to \"the issue which had proven most troublesome . . . [Beets's] Sixth Amendment claim.\" The court started its analysis by stating that \"there are actually two conflicts in this case, the conflict created by the media rights contract . . . and the conflict arising from the fact that the attorney should have been a witness instead of an advocate . . . .\" Although the district court stated that \"the two conflicts may be intertwined to a limited extent,\" it addressed the conflicts separately.\n\nAfter examining the framework for analyzing Sixth Amendment challenges based on conflicts of interest, as set forth by the Supreme Court in Cuyler v. Sullivan, 446 U.S. 335, 64 L. Ed. 2d 333, 100 S. Ct. 1708 (1980), the district court concluded:\n\nMere demonstration of an actual conflict is insufficient; the term 'adverse' must mean that some negative impact on counsel's performance is required. After careful consideration, this court is of the opinion that an adverse effect on performance is demonstrated when counsel, laboring under an actual conflict of interest, pursues some course of conduct inconsistent with the best interest of his client.\n\nApplying this standard, the district court first reemphasized that Beets had \"demonstrated two actual conflicts of interest in this case, the media rights conflict and the witness/advocate conflict.\" The court then turned to the adverse effect prong of its analysis. As to the media rights conflict, the court \"simply did not believe that [it] affected Andrews'[s] performance at any conscious level. There is, of course, no adverse effect when there is no effect at all.\" The court also noted, however, that \"the possibility exists that the media rights contract motivated Andrews at a subconscious level to remain in the case when he should have withdrawn and testified for Petitioner. To that limited extent, the two conflicts are intertwined.\" The district court did not explore this relationship, finding instead that \"the witness/advocate conflict is a separate conflict which did in fact adversely affect Andrews's performance. This is sufficient under Cuyler without a detailed analysis of Andrews'[s] possible motivation.\"\n\nAs to the witness/advocate conflict, the court described Andrews's knowledge of Beets's pursuit of benefits resulting from her husband's death as well as Andrews's efforts to communicate that knowledge to the jury. The district court found that those efforts were insufficient, stating that \"Andrews obviously should have known of his dual status as a witness and advocate prior to trial. Andrews'[s] dual status should have also been apparent to both the Judge and district attorney as the trial unfolded.\" Although the district court recognized that \"the conflict never occurred to any of the participants,\" it also noted that \"the testimony that Andrews could have provided as an independent witness related to an essential element of the State's charge of murder for remuneration.\" Thus, the district court concluded that \"counsel pursued a course of conduct inconsistent with his client's best interest when he accepted employment or failed to withdraw and testify as a witness on [Beets's] behalf.\" Accordingly, the district court granted Beets's habeas petition.\n\nWith a clear understanding of the factual background and district court findings in the case, I turn to an examination of the substantive issues in this appeal. To establish a Sixth Amendment violation, the Supreme Court has held that a defendant who did not raise the objection at trial \"must demonstrate that an actual conflict of interest adversely affected his lawyer's performance.\" Cuyler, 446 U.S. at 348. I first present what seem to me to be the threshold inquiries in the context of an asserted Sixth Amendment violation involving a conflict between the interest of a lawyer and the interest of his client. I look then at the question whether an actual conflict of interest existed between Andrews and Beets, and at the question whether any such conflict adversely affected Andrews's performance. Finally, I address why the Cuyler standard, as opposed to the more stringent Strickland standard, should apply to this case.\n\nII. THE CONFLICT BETWEEN ATTORNEY AND CLIENT\n\nA. The Threshold Inquiries\n\nThe Second Circuit's decision in Winkler v. Keane, 7 F.3d 304 (2d Cir. 1993), cert. denied, 128 L. Ed. 2d 79, 114 S. Ct. 1407 (1994), is particularly instructive in this case because, unlike the many cases addressing the actual conflict issue in the multiple representation context, Winkler addresses a conflict between the interest of the lawyer and the interest of his client. The issue presented by Winkler was whether a contingency fee agreement between a criminal defendant and his attorney created a conflict of interest for the attorney resulting in a violation of the defendant's Sixth Amendment right to effective assistance of counsel. The court began by noting that an attorney has an actual, as opposed to a potential, conflict of interest \"when, during the course of the representation, the attorney's and defendant's interests diverge with respect to a material factual or legal issue or to a course of action.\" Id. at 307 (emphasis added) (internal quotation omitted). Having defined when an actual conflict of interest exists between an attorney and his client, the court went on to analyze the alleged conflict at issue:\n\nWinkler argues that the contingency fee created an actual conflict of interest for trial counsel because Winkler's interests in effective representation were pitted against trial counsel's monetary interest. We agree. The contingency fee agreement in this case provided trial counsel with an extra $25,000 only if Winkler was acquitted or otherwise not found guilty. Thus, trial counsel had a disincentive to seek a plea agreement, or to put forth mitigating defenses that would result in conviction of a lesser included offense. Plainly the contingency fee agreement created an actual conflict of interest.\n\nId. at 307-08. It is important to note that the Winkler court focused only on the objective divergence of interests between the lawyer and his client to determine whether an actual conflict existed. Having found such a conflict, the court went on to reject Winkler's argument that proof of adverse effect was not needed to grant relief under the Sixth Amendment. The court held that to prove a Sixth Amendment violation, Winkler must meet the Cuyler standard, and that standard required proof of an adverse effect. See id. at 308.\n\nWinkler argued that he was adversely affected by his counsel's failure to initiate or to engage in plea bargaining and by his counsel's failure to develop an intoxication defense to Winkler's second degree murder charge. According to Winkler, both of these alleged failures were motivated by his counsel's pecuniary interest in total acquittal, which was the only outcome that would entitle counsel to payment of the $25,000 bonus under the contingency fee agreement. See id. at 309.\n\nTo address these adverse effect arguments, the court laid out a test for \"proving adverse effect on the basis of what an attorney failed to do\":\n\n[a defendant first] must demonstrate that some plausible alternative defense strategy or tactic might have been pursued. He need not show that the defense would necessarily have been successful if it had been used, but that it possessed sufficient substance to be a viable alternative. Second, he must establish that the alternative defense was inherently in conflict with or not undertaken due to the attorney's other loyalties or interests.\n\nId. (quoting United States v. Gambino, 864 F.2d 1064, 1070 (3d Cir. 1988) (quoting United States v. Fahey, 769 F.2d 829, 836 (1st Cir. 1985)), cert. denied, 492 U.S. 906 (1989)).\n\nIn applying the test, the court looked first at the failure to initiate plea bargaining. The court noted that the state court (which had held a hearing on the defendant's attorney-conflict claim) had found that in an alleged contract murder case, the prosecution would have been highly unlikely to accept a plea agreement. The court held, however, that:\n\nWinkler need not show that a strategy would have been successful, only that it \"possessed sufficient substance to be a viable alternative.\" Even if it is likely to be unsuccessful, the negotiation of a plea bargain in a case in which the evidence is strongly against a defendant is a viable alternative.\n\nId. (citation omitted). The court's determination that a viable alternative had not been pursued did not end the adverse effect inquiry. The court noted that the state court had found that plea bargain possibilities were not pursued because Winkler had advised his counsel that he was totally innocent and that he was not interested in pleading to a lesser charge even if the opportunity to do so were offered. See id. Thus, the Winkler court concluded that \"trial counsel did not pursue a plea bargain because Winkler rejected this path, not because of trial counsel's monetary interest in the outcome.\" Id. (emphasis added).\n\nThe court made the same kind of inquiry into the failure to develop an intoxication defense. Because \"Winkler had snorted cocaine and smoked marijuana before the fatal event,\" the court found that an intoxication defense also had sufficient substance to be a viable alternative. See id. at 310. Nevertheless, the court found that Winkler's counsel had discussed the possibility of a conviction of lesser charges on the basis of intoxication, but Winkler had rejected this alternative, again asserting his innocence. See id. The court accepted the state court's factual Conclusion that \"Winkler failed to establish that the fee arrangement caused trial counsel not to seek a conviction for lesser charges.\" Id. (emphasis added). The court ended by concluding that Winkler had \"failed to prove that trial counsel's representation was adversely affected by the conflict of interest. Thus, his Sixth Amendment right to counsel was not violated.\" Id.\n\nIn summary, the Winkler court made three distinct inquiries in its Sixth Amendment analysis. First, the court determined whether an actual conflict of interest existed between the lawyer and his client by asking whether the attorney's and defendant's interests diverged with respect to a material factual or legal issue or to a course of action. Second, in addressing whether there had been an adverse effect, the court inquired as to whether a viable alternative might have been pursued. Third, the court made a proximate cause inquiry, asking whether the viable alternative was not pursued because of the conflict. A Sixth Amendment violation was made out only if all three inquiries were affirmatively answered -- i.e., the interests of the lawyer and his client diverged, a viable alternative was not pursued, and the failure to pursue the viable alternative was caused by the divergent interests. Using this threshold framework, I proceed to Beets's case.\n\nB. Was there a Conflict?\n\nAs described above, the district court found that Beets \"demonstrated two actual conflicts of interest in this case, the media rights conflict and the witness/advocate conflict.\" I will address these two \"conflicts\" separately, turning first to the media rights conflict.\n\n1. Media Rights\n\nA conflict of interest between Beets and Andrews existed not later than the point at which the formal contract giving Andrews's son the media rights to the Betty Lou Beets story was executed, and perhaps earlier. The majority \"joins other courts, scholars and organizations of the bar who have uniformly denounced the execution of literary and media rights fee arrangements between attorneys and their clients during the pendency of a representation.\" Beets, F.3d at * 32. What the majority fails to acknowledge is the reason for such uniform condemnation -- the extraordinarily high probability that a media rights contract between counsel and client will create a conflict of interest. When Andrews began his representation of Beets on her murder charge, Texas's rules of ethics provided that \"prior to Conclusion of all aspects of the matter giving rise to his employment, a lawyer shall not enter into any arrangement or understanding with a client . . . by which he acquires an interest in publication rights with respect to the subject matter of his employment.\" State Bar Rules, art. X, ยง 9, DR 5-104(B) (Texas Code of Professional Responsibility) (1984).\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nThe reason for the rule is clear. Despite the majority's assertions, media rights contracts are not prohibited primarily because they \"encourage counsel to misuse the judicial process for the sake of his [own] enrichment and publicity seeking\" or because they \"necessarily trade[] on the misery of the victim and his family.\" Beets, F.3d at * 32. While ensuring that the judicial process is not misused and discouraging manipulation of the suffering of others for profit are important goals, commentators uniformly agree that the reason media contracts are frowned upon is because \"an agreement by which a lawyer acquires literary or media rights concerning the conduct of the representation creates a conflict between the interests of the client and the personal interests of the lawyer.\" Laws. Man. on Prof. Conduct (ABA/BNA) 51:702 (1984) (emphasis added); see also John Wesley Hall, Jr., Professional Responsibility of the Criminal Lawyer ยง 12.13, at 414 (1987) (\"A grave conflict of interest can arise from a [media rights contract] . . . .\" (internal quotation omitted)); Geoffrey C. Hazard, Jr. \u0026 Susan P. Koniak, The Law and Ethics of Lawyering 498 (1990) (\"The reason for prohibiting such arrangements is that what makes 'good copy' does not necessarily make a good defense.\"); Robert P. Schuwerk \u0026 John F. Sutton, Jr., A Guide to the Texas Disciplinary Rules of Professional Conduct, 27A Hous. L. Rev. 133 (1990) (\"The lawyer's acquisition from a client of publication rights to portrayals or accounts of the subject of the representation will probably create a conflict of interests.\"); Charles W. Wolfram, Modern Legal Ethics ยง 9.3.3, at 525 (1986) (\"The problems [with media rights contracts] are two -- conflict of interests and the revelation of client information . . . .\").\n\nThe rules against media rights contracts are designed to prevent the specific conflict resonating in this case; simply put, \"a lawyer in a criminal case who obtains from his client television, radio, motion picture, newspaper, magazine, book, or other publication rights with respect to the case may be influenced, consciously or unconsciously, to a course of conduct that will enhance the value of his publication rights to the prejudice of his client.\" State Bar Rules, art. X, ยง 9, EC 5-4 (Texas Code of Professional Responsibility) (1984) (emphasis added). Plainly, a media rights contract \"'may place the lawyer under temptation to conduct the defense with an eye on the literary aspects and its dramatic potential. If such an arrangement or contract is part of the fee, in lieu of the fee, or a condition of accepting the employment, it is especially reprehensible.'\" Hall, supra, ยง 12.12, at 414 n.19 (quoting ABA Standards, The Defense Function Std 4-3.4, Commentary).\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e In fact, a media rights contract is so rife with conflict that under Texas's rules \"client consent will not cure a violation of [the prohibitions of media contracts].\" Schuwerk \u0026 Sutton, supra, at 134.\n\nIn the instant case, the media contract weighed on Andrews's mind from the beginning of his representation. At the very least, the contract placed him in a situation of divided interests. Before the advent of the media rights contract, Beets's interest lay in having Andrews withdraw as her counsel and testify at her trial that he had initiated the idea of searching for Jimmy Don's insurance and pension benefits. As her attorney, this was also Andrews's interest because he was obligated to see to it that his client's best defense was put forward. After the media rights contract was confected, the interests of Beets and Andrews sharply diverged. While Beets's interest remained in having Andrews withdraw and testify, Andrews's interest now squarely lay in remaining as her counsel because only then would he be entitled to the potentially lucrative media rights. The record makes clear that the district court did not err in finding that Beets demonstrated that Andrews had an actual conflict of interest in regard to the media rights contract.\n\n2. The Lawyer as Witness\n\nThe district court also recognized a second conflict of interest, Andrews's advocate/witness conflict. The district court and the majority treat this conflict separately from the media rights conflict. In a situation where a lawyer can provide favorable testimony material to his client's case, his failure to withdraw and testify may or may not stem from an actual conflict -- i.e., from a divergence of interests between the lawyer and his client. If the failure to withdraw is caused, for example, by a desire to stay in the case for the fee involved, a conflict of interest may exist. As one commentator has suggested, when a lawyer has a duty to withdraw and testify in favor of his client, but does not do so, \"such a decision would raise serious questions about either the lawyer's competence or about the effect of a conflict of interest.\" Wolfram, supra, ยง 7.5.2, at 381 (emphasis added). According to this commentator:\n\nThe conflict is between the lawyer's duty of loyalty to the client, which urges the lawyer to give the needed testimony, and the lawyer's economic instincts, which may lead the lawyer to remain in the case as advocate in order to continue earning a fee that otherwise would have to be abandoned.\n\nId. (emphasis added). In my view, while Andrews's role as both an advocate and a potential witness may well have violated the applicable ethical rules,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e its significance for this case lies not in its possible status as an independent conflict, but rather in its relationship to the media rights conflict. That is, as the district court recognized but did not explicitly resolve, the question remaining in this case is whether the media rights contract is what caused Andrews to remain in the case as counsel.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nC. Was Andrews's Representation Adversely Affected?\n\nUnder Cuyler, a defendant does not have the burden of showing actual prejudice -- i.e., the defendant does not have to show that the result of the trial probably would have been different. See Strickland, 466 U.S. at 691-96; United States v. Greig, 967 F.2d 1018, 1024 (5th Cir. 1992). Instead, the defendant needs to demonstrate an adverse effect upon his representation, and \"Cuyler 's adverse effect element establishes a relatively low threshold for a petitioner to cross.\" Beets, 986 F.2d at 1490 (Higginbotham, J., specially Concurring). A limited presumption of prejudice arises from a showing of adverse effect because, as the Supreme Court has noted, \"it is difficult to measure the precise effect on the defense of representation corrupted by conflicting interests.\" Strickland, 466 U.S. at 692. To establish an adverse effect on the basis of what an attorney failed to do, a defendant must demonstrate that some plausible alternative defense strategy or tactic -- \"a viable alternative\" -- might have been pursued. See, e.g., Winkler, 7 F.3d at 309.\n\nIn Beets's case, Andrews's failure to testify had an adverse effect on her defense, as Andrews's testimony was clearly a viable alternative. Throughout the trial, Beets attacked the remuneration element of the State's case on which her capital murder conviction rested. Andrews had significant testimony to offer bearing on the critical issue of whether the killing of Jimmy Don was for a remunerative purpose, specifically to obtain Jimmy Don's life insurance proceeds and pension benefits. If the jury reasonably doubted that Beets killed her husband for the insurance money, the murder was not a capital offense.\n\nThe majority downplays the importance of Andrews's testimony by referring to it as \"cumulative.\" Beets, F.3d at * 40, 41. Of course, as mentioned, Beets does not need to show that Andrews's testimony would have been successful, but only that it possessed sufficient substance to be a viable alternative. See Winkler, 7 F.3d at 309. Andrews's testimony clearly meets this standard, and the suggestion that his testimony is cumulative is simply based upon an erroneous reading of the record. As evidence of the cumulative nature of Andrews's testimony, the majority points to Beets's own testimony that she was unaware of Jimmy Don's death benefits before she visited Andrews. But the jury may well have discounted Beets's testimony because of its self-serving nature.\n\nThe majority also points to the testimony of Bruce Roberts, who stated that more than a year after Jimmy Don's murder, Beets seemed ignorant of his insurance and benefits. Roberts's testimony, however, was damaging in certain respects to Beets's defense. Although Roberts did testify that Beets's \"primary concern was . . . with the fire insurance company\" and that Beets never pressured him to collect money from the City of Dallas, Roberts was also asked what Beets knew about benefits when she first came to him. In response, Roberts stated:\n\nAt the time I talked to her, she had one -- well, it looked like part of a policy, as I recall, from the credit union in Dallas. She also knew that she had or was asking me to check into pension benefits. Basically, that's all the information she could give me.\n\nThus, Roberts did not definitively testify that Beets was ignorant about the possibility of collecting benefits. Further, Roberts did not, and could not have, testified that Andrews suggested to Beets that they pursue Jimmy Don's insurance and pension benefits because Roberts was not present at the meeting between Beets and Andrews at which that suggestion was made.\n\nOther than Beets, only Andrews could have told the jury that he initiated the Discussion regarding Jimmy Don's death benefits with Beets, and only Andrews could have testified that she appeared to lack knowledge of any such benefits. Further, only Andrews could have testified that it was at his suggestion that those death benefits were pursued. Any later interest or inquiry into benefits by or on behalf of Beets could have been attributable to this meeting between Beets and Andrews that took place long after Jimmy Don's murder.\n\nSimilarly, the majority's invocation of Denny Burris's testimony to downplay any adverse effect from the absence of Andrews's testimony is erroneous. Burris, a disinterested witness, stated that Beets inquired about Jimmy Don's insurance soon after the murder. The suggestion is that because Beets discussed insurance with Burris, a chaplain, the biased testimony of Andrews was unlikely to have swayed the jury and its absence was unimportant. First of all, it is again worth mentioning that any suggestion that Andrews's testimony would not have been successful to Beets's defense is irrelevant. Second, although Burris was a chaplain, his assignment was to discuss with Beets the benefits due to the widow of a fireman. \"It was not a mission to console a widow with prayer where the widow's interest was insurance not intercession.\" Beets, 986 F.2d at 1491 (Higginbotham, J., specially Concurring). Thus, the evidence of Beets's early focus on insurance, as the State would have it, is not so compelling. Finally, Burris's specific testimony did not show that Beets already knew about Jimmy Don's insurance and pension benefits. Rather, Burris testified that, several days after Jimmy Don's disappearance, Beets \"asked about insurance, if she would be covered and things like that.\"\n\nIn short, it is all too clear that Andrews's testimony was a viable alternative, and his failure to testify had an adverse effect on Beets's defense. I agree with the assessment of Judge Higginbotham in his special concurrence to the panel opinion:\n\nAndrews's testimony was not merely cumulative. I cannot conclude that it would not have been helpful to Beets at trial. It certainly would have been in Beets's best interest for Andrews to have testified. Given the low threshold established by Cuyler, I would not reject [the district court's] Conclusion that Andrews's failure to give this evidence at trial adversely affected the conduct of her defense.\n\nId. at 1491-92 (Higginbotham, J., specially Concurring).\n\nOur task is not yet complete, however, as the third Winkler inquiry still remains on the table: whether Andrews's withdrawal and testimony -- the \"viable alternative\" -- was not pursued because of the media rights conflict. This is a fact-bound question that the district court did not directly answer.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e After hearing evidence, the district court found that \"Andrews obviously should have known of his dual status as witness and advocate prior to trial.\" The district court also concluded that Andrews \"pursued a course of conduct inconsistent with his client's best interest when he accepted employment or failed to withdraw and testify as a witness on Petitioner's behalf.\"\n\nOn the other hand, the court concluded that the media rights contract did not affect Andrews's performance \"at any conscious level.\" The court noted, however, that \"the possibility exists that the media rights contract motivated Andrews at a subconscious level to remain in the case when he should have withdrawn and testified for Petitioner. To that limited extent, the two conflicts are intertwined.\" These statements suggest that the district court did not definitively resolve whether Andrews's failure to withdraw and testify was attributable in some fashion to his actual conflict of interest arising from the media rights contract.\n\nThe majority holds that there is no need to remand this case to the district court for an explicit finding on whether the media rights contract caused Andrews to fail to withdraw for two reasons. First, the majority invokes, for the first time in the five years that this case has been in federal court, the presumption of correctness afforded by 28 U.S.C. ยง 2254(d) to the findings of fact made by the state trial court Judge on Beets's state habeas petition. The state trial court found as a fact that \"petitioner's grant of 'book rights' to the son of her counsel had no effect on the strategy of defense counsel.\" This finding was based on the trial court's own personal recollection of the trial and on Andrews's affidavit which stated that:\n\ndefense attorney had no conflict of interest throughout the proceedings by agreeing that book rights would be his entire fee, said defense attorney has no book rights, these rights were given to said attorney's son and were only given after the trial was into its third or fourth day, the State Bar of Texas has found said defense attorney committed no improprieties with regard to this matter.\n\nAt no point during the course of Beets's federal habeas proceedings has the State sought to invoke the presumption of correctness afforded by ยง 2254(d). Beets filed a motion for an evidentiary hearing along with her federal habeas petition. When the State filed its response (and an amended response) to Beets's petition, it did not object to the hearing and, in responding to Beets's claim of an actual conflict of interest, the State asserted:\n\nRespondent denies that there was any conflict of interest in this case. However, because the Court has scheduled an evidentiary hearing on the issue, rather than argue the claim at this time, Respondent will rely on the facts developed at that hearing.\n\n(emphasis added). Finally, the State (appellant in this court) did not raise the preclusive effect of the state court's habeas findings in any of the many briefs it has filed with this court. Neither the panel opinion nor Judge Higginbotham's special concurrence mentions ยง 2254(d) or Sumner v. Mata, 449 U.S. 539, 66 L. Ed. 2d 722, 101 S. Ct. 764 (1981), or any of its progeny. In a last ditch effort to avoid dealing with the ambiguities in the federal district court's fact findings, the presumption of correctness has been resurrected despite the State's unwillingness to invoke it. Because no party has addressed the presumption of correctness, we cannot determine whether any of its exceptions applies. For example, we do not know the position of the State or Beets on whether the factfinding procedure employed by the state court was adequate to afford a full and fair hearing or whether the material facts were adequately developed at the state court hearing. See 28 U.S.C. ยง 2254(d)(3) and (4). This case should not be decided at this late date on a basis not raised by the parties.\n\nThe majority asserts as its second reason why, applying Cuyler, there is no need to remand for an explicit finding on causation the district court's statement that \"the court simply does not believe that the media rights contract affected Andrews' performance at any conscious level.\" The majority ignores the district court's recognition of a possible connection between the media rights contract and what it termed the \"witness/advocate conflict\" and its failure to resolve the ultimate question whether they were related. The majority also ignores the contradiction inherent in the district court's opinion in finding the witness/advocate ethical problem to be an actual conflict (thereby implying that it stemmed from a divergence of interests between Andrews and Beets) while finding at the same time that the media rights contract (the likely source of the divergence) had no conscious effect on Andrews's performance.\n\nIn my view, because the district court did not explicitly decide whether Andrews's failure to withdraw and testify was caused by the actual conflict engendered by the media rights contract, the wiser course is to vacate the district court's judgment granting the writ and to remand the case so that the district court may consider the question in the first instance. If the district court determines on remand that Andrews's failure to withdraw and testify was caused by the actual conflict of interest arising from the execution of the media rights contract, with its powerful incentive to remain in the case, then Beets will have successfully demonstrated \"that an actual conflict of interest adversely affected [her] lawyer's performance,\" Cuyler, 446 U.S. at 350, and she will be entitled to habeas relief. The judgment granting the writ should then be reinstated. If, on the other hand, the district court concludes that Andrews's failure to withdraw and testify was not caused by the actual conflict stemming from the media rights contract, then that failure should be analyzed under Strickland. On this record, there is no reasonable probability that the outcome of Beets's trial would have been different, and Beets has failed to satisfy the prejudice prong of Strickland. The writ should then be denied.\n\nD. The Majority Opinion\n\nBefore explaining why Cuyler, as distinguished from Strickland, applies to this case, I turn to an examination of the problems in the majority's approach to the existence of a conflict in this case.\n\nThe majority is squarely faced with the district court's fact-bound Conclusion that Beets \"demonstrated two actual conflicts of interest in this case, the media rights conflict and the witness/advocate conflict.\" The majority holds, however, that \"only a potential and not an actual conflict arose between Beets and her lawyer.\" Beets, F.3d at * 2.\n\nThe majority discounts the district court's Conclusion that an actual conflict existed by reason of the media rights contract, noting that:\n\nThe media rights contract posed a serious potential conflict of interest, [but] Beets failed to show how it hindered Andrews's presentation of her defense or prejudiced her by rendering the result of her criminal prosecution fundamentally unreliable. Beets has not asserted that Andrews manipulated the case to enhance publicity or that the contract generally clouded his good judgment. Beets has shown no actual influence of the media rights contract on the conduct of her defense.\n\nBeets, F.3d at * 34. Moreover, the majority later seems to resurrect the vacated panel opinion, noting that two Judges held in that opinion \"as to the media rights contract, there was no 'actual conflict' . . . because . . . the record does not demonstrate that the contract induced Andrews to compromise his zealous representation of Beets in favor of his own pecuniary interest.\" Id. at * 43.\n\nSimilarly, in discussing whether there was a conflict in Andrews's failure to withdraw and testify, the majority states that \"because Andrews's potential testimony for Beets was cumulative, he was not a necessary witness for her defense and did not face a substantial advocate/witness conflict.\" Beets, F.3d at * 40-41. Again, the majority seems to resurrect the Conclusion of the panel opinion that \"Beets alleged, at most, a merely hypothetical or speculative witness/advocate conflict, which did not materialize into an actual conflict that forced Andrews to choose between his self-interest and his duty to Beets.\" Beets, F.3d at * 42.\n\nThe majority's Conclusions fail on two levels. First, the majority suggests that an actual conflict does not exist until an attorney makes a \"choice\" between his interest and the interest of his client. Building on the requirement of a \"choice,\" the majority seems to add (as did the panel) a scienter element to conflict analysis, inserting a requirement, heretofore alien to the law, that an attorney must consciously recognize that he is operating under a conflict before that conflict can be said to actually exist. Second and most noticeably, the majority conflates the existence and effect elements of the analysis by concluding that a conflict did not exist because Beets failed to demonstrate an effect.\n\n1. The Function of \"Choice\" in Conflict Analysis\n\nThe majority looks to statements by the Seventh, Tenth, and Eleventh Circuits to support the panel's contention that an actual conflict does not exist until an attorney makes a \"choice\" between his interest and the interest of his client. See Beets, F.3d at * 42 (citing Stevenson v. Newsome, 774 F.2d 1558, 1561-62 (11th Cir. 1985), cert. denied, 475 U.S. 1089 (1986); United States v. Litchfield, 959 F.2d 1514, 1518 (10th Cir. 1992); United States v. Acevedo, 891 F.2d 607, 610 (7th Cir. 1989); United States v. Horton, 845 F.2d 1414, 1419 (7th Cir. 1988)). The concept of \"making a choice\" is typically used in cases where an attorney has a potential conflict (frequently between two clients) -- i.e., a situation where interests have not yet diverged but could do so in the future. The courts look to whether a \"choice\" has been made only to signal that a divergence of interests has occurred -- i.e., only to signal that a potential conflict has become an actual conflict. The central question is whether the interests have diverged, and the concept of \"making a choice\" is an analytical tool used to answer this question.\n\nThe cases cited by the majority support this proposition. See Stevenson, 774 F.2d at 1562 (noting that \"there is no evidence in this case that [the attorney] was subject to divided loyalties sufficient to establish an actual conflict of interest\", thus, rejecting Stevenson's allegations upon a determination that divergent interests were absent from the case) (emphasis added); Horton, 845 F.2d at 1420 (focusing on the absence of divergent interests in finding no conflict was created by counsel's application for a position as a United States Attorney by stating that \"in any event, a candidate for a high federal position in his professional field would not advance his own interest by demonstrating that he is a weak or unskilled attorney on behalf of his client's interests.\"); Acevedo, 891 F.2d at 610 (failing to find conflict, but noting that if Acevedo had alleged in her affidavit that her attorney was involved with her in the criminal activity, he \"would have an obvious interest in preventing Acevedo from testifying and thus implicating him in the illegal scheme\"); Litchfield, 959 F.2d at 1518 (rejecting defendant's claim that a conflict of interest arose because trial counsel, concerned that defendant was going to commit perjury, held an ex parte conference with Judge, noting that \"the situation presented counsel with a difficult dilemma, and we cannot say that his ex parte Discussion with the district court was a violation of his ethical duty or evidence of a conflict of interest.\")\n\nThis focus on divergent interests to determine whether an actual conflict of interest exists is also the focus in our circuit: \"'[a] conflict exists when defense counsel places himself in a position conducive to divided loyalties.'\" United States v. Vaquero, 997 F.2d 78, 89 (5th Cir.) (quoting United States v. Carpenter, 769 F.2d 258, 263 (5th Cir. 1985)), cert. denied, 114 S. Ct. 614 (1993); accord Mitchell v. Maggio, 679 F.2d 77, 79 (5th Cir.), cert. denied, 459 U.S. 912 (1982).\n\nIn Beets's case, divergent interests existed, at the latest, when Andrews executed the media rights contract. At that point, it was in Beets's interest for Andrews to withdraw and testify, while it was in Andrews's interest to remain as counsel so that he would receive the value of the media rights.\n\nThe majority recognizes that disagreements between the majority and this Dissent exist not only on whether there was an actual (as opposed to a potential) conflict but also on whether the conflict should be Judged from an objective standpoint. Beets, F.3d at * 45. In my view, it is important to be clear that determining whether divergent interests are present such that an actual conflict exists contemplates an objective evaluation of the situation in which counsel is placed.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e As the Ninth Circuit recently noted, \"the existence of an actual conflict cannot be governed solely by the perceptions of the attorney; rather, the court itself must examine the record to discern whether the attorney's behavior seems to have been influenced by the suggested conflict.\" Sanders v. Ratelle, 21 F.3d 1446, 1452 (9th Cir. 1994).\n\nThis objective evaluation makes perfect sense, for if the rule were as the majority suggests, counsel's actions benefiting himself and harming his client would not be actual conflicts, irrespective of their effect on the proceedings, as long as counsel was too obtuse, insensitive, or selfish to recognize that the pursuit of his own goals was coming at the expense of his client's defense. As the Supreme Court commented in an analogous context, \"it is unlikely that [an attorney] would concede that he continued improperly to act as counsel.\" Wood v. Georgia, 450 U.S. 261, 265 n.5, 67 L. Ed. 2d 220, 101 S. Ct. 1097 (1981) (describing how the conflict of interest was properly presented when the lawyer who allegedly had the conflict of interest had prepared the brief and the petition for certiorari). The fact that Andrews arguably chose to continue his representation thoughtlessly as opposed to deliberately does not obviate the fact that given the possible decisions he could have made as an attorney, he undertook a course of action that benefited himself while hindering Beets's defense. Simply put, an actual conflict is demonstrated when a defendant objectively shows that his interest and his attorney's interest diverged with respect to a material factual or legal issue or to a course of action, and such a divergence occurred in this case.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\n2. Separating the Existence of a Conflict from the Effect of a Conflict\n\nThe majority also contends that there was no actual conflict in the context of the media rights contract \"because . . . the record does not demonstrate that the contract induced Andrews to compromise his zealous representation of Beets in favor of his own pecuniary interest.\" Beets, F.3d at * 43. Similarly, in the lawyer as witness context, the majority contends that there was no actual conflict \"because Andrews's potential testimony for Beets was cumulative, [and] he was not a necessary witness for her defense.\" Id. at * 40. As I have pointed out above, this Conclusion has no factual support in the record. As a legal Conclusion, it has no support in the case law surrounding Cuyler ; determining whether there was an actual conflict (as distinguished from determining whether the Sixth Amendment has been violated) does not require a showing of an adverse effect.\n\nAs the majority concedes, Cuyler incorporates a standard less rigorous than Strickland. See Strickland, 466 U.S. at 692 (noting that unlike general ineffective assistance of counsel claims, the criminal Justice system \"maintains a fairly rigid rule of presumed prejudice\" in the conflict of interest context). The reason for this lighter burden in conflict cases is clear. As the Supreme Court has noted, it \"is difficult to measure the precise effect on the defense of representation corrupted by conflicting interests,\" Strickland, 466 U.S. at 692, and accordingly, the Court has \"refused to indulge in nice calculations as to the amount of prejudice attributable to the conflict.\" Cuyler, 446 U.S. at 349 (internal quotation omitted). The majority, however, engages in such a calculation to determine whether a conflict even existed.\n\nThe question of whether there actually was a conflict plays an important role in separating cases where interests diverge -i.e, where the attorney places his own or another's interest above the client's interest -- from those situations where the conflict remains potential. Whether the conflict actually affected the representation is a separate inquiry from the question of whether there was an actual conflict. Even when addressing whether a conflict had an adverse effect, the degree of prejudice caused by the conflict is not material once any real effect is shown. See Cuyler, 446 U.S. at 349 (\"[A] defendant who shows that a conflict of interest actually affected the adequacy of his representation need not demonstrate prejudice.\").\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThe rule that the majority espouses goes even further than that prohibited in evaluating actual effect. The majority collapses the question of effect into the question of actual conflict. Just as it is improper to evaluate a foregone strategy's potential for success when determining whether there is an adverse effect, it is also improper to evaluate that strategy's potential for success when determining whether there is an actual conflict of interest.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nIII. WHICH STANDARD -- CUYLER OR STRICKLAND?\n\nThe majority holds that Strickland (rather than Cuyler) governs the analysis of Beets's claim. The majority contends that Cuyler 's analysis is applicable only to conflicts stemming from multiple representation, and it opines that \"Strickland offers a superior framework for addressing attorney conflicts outside the multiple or serial client context.\" Beets, F.3d at * 14. First, I disagree with the majority's Conclusion that Cuyler and the other Supreme Court cases addressing attorney conflicts support its decision to limit Cuyler to the multiple representation context.\n\nSecond, drawing on those cases and on some of the cases at the circuit level that apply Cuyler to attorney-client conflicts, I would apply Cuyler to a conflict between the attorney and his client which has a highly particularized and powerfully focused source, of a kind not frequently or normally encountered in the practice of law. It is these exceptional situations, where the divergence between the lawyer's self-interest and his client's interest poses an extraordinary threat to the lawyer's duty of loyalty, that warrant the protection of Cuyler. As this court and other courts have recognized, the conflict stemming from a media rights contract is such a conflict, as are the conflict arising from the kind of contingent fee arrangement at issue in Winkler and the conflict arising from an attorney's involvement in the allegedly criminal conduct of his client. If we reserve Cuyler for extraordinary attorney-client conflicts of that sort, not normally encountered in law practice, and we apply Strickland to alleged deficiencies in an attorney's performance having their sources in the more common incidents of the attorney-client relationship, we avoid having the Cuyler exception swallow the Strickland rule. At the same time we preserve the benefit of the Cuyler inquiry for those exceptional cases that lie at the heart of the principles animating it.\n\nA. Conflict of Interest Jurisprudence\n\nTo test the majority's hypothesis that Cuyler applies only to multiple representation cases, I look first at what the Supreme Court and other courts have said about attorney conflicts. It is well-settled that \"where a constitutional right to counsel exists . . . there is a correlative right to representation that is free from conflict of interest.\" Wood, 450 U.S. at 271; see also Cuyler, 446 U.S. at 335; Holloway v. Arkansas, 435 U.S. 475, 55 L. Ed. 2d 426, 98 S. Ct. 1173 (1978). The Supreme Court revisited Cuyler in Wood v. Georgia, 450 U.S. 261, 67 L. Ed. 2d 220, 101 S. Ct. 1097 (1981), and it applied its framework to a conflict created by a third-party's payment of counsel. After examining the record, the Court noted that the defendants' employer had paid for the defendants' legal assistance, for the defendants' bond fees, and for some of the other fines that the defendants incurred, but it had failed to pay the fines which resulted in the defendants' incarceration. Wood, 450 U.S. at 267. The Court further observed that:\n\nThe fact that the employer chose to refuse payment of these fines, even as it paid other fines and paid the sums necessary to keep petitioners free on bond in this case, suggests the possibility that it was seeking -in its own interest -- a resolution of the equal protection claim raised [in the case].\n\nId. (footnote omitted). The Court recognized that because the attorney was being paid by the employer, and was therefore the employer's agent, there was a \"clear possibility of conflict of interest.\" Id. In light of this possibility, the Court remanded the case to the state court, instructing the lower court to apply the Cuyler framework and to determine \"whether the conflict of interest that the record strongly suggests actually existed at the time of the probation revocation or earlier.\" Id. at 273.\n\nThe Supreme Court next discussed conflicts of interest in Strickland. In that case, the Court was called upon to determine the \"proper standards for judging a criminal defendant's contention that the Constitution requires a conviction . . . to be set aside because counsel's assistance at the trial . . . was ineffective.\" Strickland, 466 U.S. at 671.\n\nNotably, when describing the standard for evaluating the prejudicial effect of a counsel's failings, the Court distinguished ineffectiveness claims predicated on conflicts of interest. Specifically, the court noted that these claims warranted a limited presumption of prejudice, stating that \"prejudice is presumed when counsel is burdened by an actual conflict of interest.\" Strickland, 466 U.S. at 692 (citing Cuyler, 446 U.S. at 345-50). When there is an actual conflict, the Court emphasized that \"counsel breaches the duty of loyalty, perhaps the most basic of counsel's duties.\" Id. Additionally, the Court found that a limited presumption of prejudice was warranted because \"it is difficult to measure the precise effect on the defense of representation corrupted by conflicting interests.\" Id. Further, the Court reasoned that \"given the obligation of counsel to avoid conflicts of interest and the ability of trial courts to make early inquiry in certain situations likely to give rise to conflicts, it is reasonable for the criminal Justice system to maintain a fairly rigid rule of presumed prejudice for conflicts of interest.\" Id. (citation omitted).\n\nThe Supreme Court has not specifically addressed whether Cuyler applies to cases involving conflicts stemming from sources other than multiple representation. See Illinois v. Washington, 469 U.S. 1022, 1023, 83 L. Ed. 2d 367, 105 S. Ct. 442 (1984) (White, J., Dissenting from denial of certiorari). Nevertheless, as the majority concedes, this court, as well as every circuit court facing the issue, has applied the rule of Cuyler to many types of conflicts of interest.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e In fact, the Seventh, Ninth, and Eleventh Circuits have applied the Cuyler framework to conflicts stemming from media rights contracts. See United States v. Marrera, 768 F.2d 201, 205-09 (7th Cir. 1985) (employing Cuyler framework to claim predicated on \"conflict of interest between [the] lawyer's financial interest in proceeds from the movie rights and [defendant's] interest in acquittal\"), cert. denied, 475 U.S. 1020 (1986); Zamora v. Dugger, 834 F.2d 956, 960 (11th Cir. 1987) (noting that \"the standard developed in Cuyler has been applied to cases in which defendants argue that their lawyers were more interested in publicity than in obtaining an acquittal,\" and employing the Cuyler analysis); United States v. Hearst, 638 F.2d 1190, 1193 (9th Cir. 1980) (recognizing that the conflict in Cuyler was based on multiple representation, and observing that the case before it was \"based on private financial interests\" of the lawyer, but applying Cuyler because \"these differences are immaterial.\"), cert. denied, 451 U.S. 938 (1981).\n\nNevertheless, the majority boldly asserts that all of these other courts have misread Cuyler and the Supreme Court's subsequent cases, stating that \"one cannot read Cuyler [as] analyzing conflicts of interest in a context broader than that of multiple client representation.\" Beets, F.3d at * 15. As noted above, however, the Supreme Court did just that in Wood, applying Cuyler to a conflict of interest stemming from the fact that defendants' counsel was being paid by a third party. The majority attempts to distinguish this case by stating that the \"lawyer was at least in the functional equivalent of a joint representation. . . . Both the theater and the employees expected him to advance their interests, yet to serve one might require him to fail the others, while doing nothing could harm both.\" Beets, F.3d at * 18. The majority forces Wood into the multiple representation category by focusing on the common denominator of all conflicts: divided loyalties or divergent interests between two or more entities.\n\nB. Divided Loyalties: The Ethical Principles\n\nThe majority accurately notes that representation of two or more clients whose interests are best served by divergent litigation tactics presents a situation in which an attorney's loyalties may be pulled in different directions by his various clients. When such a situation arises, an attorney may be forced to choose the interest of one client at the expense of the interest of the other client, or the attorney may choose to do nothing and neglect the interests of both clients. See Geoffrey C. Hazard \u0026 W. William Hodes, 1 The Law of Lawyering ยง 1.7:101 (2d ed. Supp. 1992); Model Rules of Professional Conduct Rule 1.7, 1.9 (specifically addressing conflicts of interest arising from concurrent representation and serial representation).\n\nMultiple representation situations, however, are not the only circumstances in which a conflict of interest may test an attorney's duty of loyalty. A lawyer's duty of loyalty may also be compromised when his own interests diverge from his client's interests. See Wolfram, supra, ยง 7.1.3, at 317 (\"The principle of loyalty runs throughout conflicts thinking but is most prominent in the areas of simultaneous conflicts and conflicts involving the lawyer's personal interests.\"). In fact, the general rule against conflicts of interest provides that \"[a] lawyer shall not represent a client if the representation of that client may be materially limited by the lawyer's responsibilities to another client or to a third person, or by the lawyer's own interests.\" Model Rules of Professional Conduct Rule 1.7(b); see also Wolfram, supra, ยง 7.1.2, at 315 (describing how an older version of the rules governing conflicts \"dealt with two central situations -- when a lawyer's personal interests clash with those of a client and when a lawyer represents at the same time clients with differing interests\"). This potential for a conflict rooted in the attorney's self-interest is so severe that the Model Rule of Professional Conduct 1.8 is devoted almost entirely to prohibitions and restrictions aimed at preventing such conflicts.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e The reason for these rules is clear. Just as an attorney's loyalty may be pulled in different directions by clients' divergent interests, an attorney's loyalty can be sorely tested when his own self-interest runs counter to the interests of his client.\n\nThus, the majority's attempt to draw the Cuyler line at multiple representation is ill-considered, for there is no logical reason why the distinction could not be used to classify all conflicts (including those involving the attorney's self-interest) as \"multiple representations.\" Simply put, there is no intuitive reason why the Cuyler line should be drawn at conflicts where the interests of only third parties cause the divergence facing the attorney, as distinguished from conflicts where the interest of the attorney himself causes the divergence that he confronts. Indeed, there is a powerful intuitive reason why, in some situations, that line should not be (and has not been) drawn there. There are exceptional conflicts involving the attorney's self-interest that, human nature being what it is, are far more likely to impair the lawyer's ability to satisfy his duty of loyalty to his client than are the more ordinary conflicts between clients.\n\nC. Where Should the Cuyler Line Be Drawn?\n\nI recognize that not every conflict of interest pitting a lawyer's self-interest against his client's interests should trigger the analysis outlined in Cuyler. As one commentator notes, \"in a sense, every representation begins with a lawyer-client conflict. If the representation is for a fee, the lawyer's economic interest will be to maximize the amount of the fee and the client's will be to minimize it.\" Wolfram, supra, ยง 7.1.1, at 313. Conversely, if the representation is for a flat fee, the attorney's interest will be to minimize the amount of time spent on the case, and the client's interest will be to maximize it. Similar conflicts inure in any contract for the sale of goods or services; the seller's interest is to maximize the amount the buyer spends and minimize his own costs, and the buyer's interest is to minimize the amount that he spends and maximize the quality of the goods or services.\n\nThus, the Cuyler exception would swallow the Strickland rule if it were applied to every case in which a criminal defendant complains that his lawyer failed to investigate a witness or a defense, neglected to perform an experiment, did not hire a witness, or otherwise failed to take action because the attorney decided that it was not worth the time or the expense. We have recognized that Cuyler is not meant to cover these types of cases. Strickland appropriately governs claims for failure to investigate\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e and the like, and courts have had little difficulty in treating such claims under Strickland 's ineffectiveness rubric. See, e.g., Williams v. Calderon, 52 F.3d 1465, 1473 (9th Cir. 1995) (refusing to apply Cuyler when a defendant alleged that \"the fact that payment for any investigation or psychiatric services could have come from counsel's pocket forced counsel to choose between [the defendant's] interests and his own\"); United States v. Zackson, 6 F.3d 911, 921 (2d Cir. 1993) (finding that Strickland, not Cuyler, was applicable to a claim that defense counsel was \"plagued by a conflict of interest, namely that he was under enormous time constraints in regard to prior trial commitments\" (internal quotations omitted)); Yohey v. Collins, 985 F.2d 222, 227 (5th Cir. 1993) (finding that a failure to hire an expert was not a conflict in the Cuyler sense and applying Strickland to the alleged conflict).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nIn addition to conflicts that are more properly treated under Strickland as claims about competence and diligence, there are other attorney-client conflicts frequently or normally encountered in the practice of law that will be better handled under Strickland. For example, the conflict claimed to exist in United States v. Sayan, 296 U.S. App. D.C. 319, 968 F.2d 55, 64-65 (D.C. Cir. 1992), involving a lawyer who allegedly failed to request a continuance because he was afraid the Judge would take action against him and his law firm if he made such a request, would arise with some frequency, as would the conflict claimed to exist in Zamora v. Dugger, 834 F.2d 956, 960 (11th Cir. 1987), that the lawyer was more concerned with publicity than with his client's fate. Both these charges can be made, with some credibility, in a good number of cases, and where they form the basis for a claim for post-conviction relief, they should be evaluated under Strickland.\n\nWhile the great majority of alleged attorney-client conflicts arising in post-conviction proceedings -- those frequently or normally encountered in the practice -- will be better handled under Strickland, there are exceptional conflicts between an attorney's self-interest and his client's interest, stemming from highly particularized and powerfully focused sources, of the sort not normally encountered in law practice, that demand the application of Cuyler. A media rights contract is such a source,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e as are the kind of contingent fee arrangement at issue in Winkler and an attorney's involvement in the allegedly criminal conduct of his client. These circumstances present situations so fraught with the temptation for the lawyer to sacrifice his client's best interest for his own benefit that they constitute particularly serious threats to the duty of loyalty. Not coincidentally, the Supreme Court and lower courts have applied the Cuyler presumption to these very types of cases.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nThe majority posits that in these cases, unlike in the multiple representation context, the risk of prejudice is not plain, and that \"when the duty of loyalty is challenged by an attorney's self-interest, the range of possible breaches . . . is virtually limitless.\" Beets, F.3d at * 26. I disagree. The risk is all too plain. Further, Cuyler has been the law for fifteen years, and it cites precedents at the circuit level (including this circuit's decision in Foxworth v. Wainwright, 516 F.2d 1072 (5th Cir. 1975)), that are even older. The inescapable fact is that the courts have not had difficulty with the boundary problems described by the majority, as courts have been able to separate ordinary ineffective assistance claims (even those dressed in conflict language) from the exceptional cases that warrant the Cuyler standard. But even if we do encounter problems with cases at the boundaries, that is no reason to change the rule in a case that lies at the heart of the principles animating Cuyler.\n\nIn short, there is no authority whatsoever for limiting Cuyler to the multiple representation situation, and, as many courts have recognized, it makes no sense to do so in those exceptional cases where an attorney's self-interest poses a serious threat to the duty of loyalty.\n\nIV. SUMMARY\n\nUnder Cuyler, relief is proper on a Sixth Amendment claim of ineffective assistance of counsel when a defendant \"demonstrates that an actual conflict of interest adversely affected his lawyer's performance.\" Cuyler, 446 U.S. at 348. In the instant case, Andrews was faced with an actual conflict because, while Beets's interest lay in having Andrews withdraw and testify, Andrews's interest lay in remaining as her counsel, because only then would he be entitled to the potentially lucrative media rights. Additionally, because Andrews did not withdraw and testify, Beets's representation was adversely affected. A Sixth Amendment violation will be shown if the district court concludes that the conflict was the cause of Andrews's failure to withdraw and testify. I would vacate the district court's judgment and remand with instructions to resolve that issue. If the district court concludes that the conflict was the cause of Andrews's failure to withdraw, then a Cuyler claim has been successfully established and the judgment granting the writ would be reinstated. If the district court concludes that the conflict was not the cause of Andrews's failure to withdraw, then that failure should be evaluated under Strickland. Under that test, Beets has failed to show prejudice, i.e., that the result of her trial would have been different had Andrews withdrawn and testified. In that case, the writ should be denied.\n\n\u003cspan class=\"fn\"\u003e* Judges Stewart and Benavides were not members of the Court when this case was argued and have elected not to participate. Judge Parker is recused.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Strickland v. Washington, 466 U.S. 668, 104 S. Ct. 2052, 80 L. Ed. 2d 674 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Cuyler v. Sullivan, 446 U.S. 335, 100 S. Ct. 1708, 64 L. Ed. 2d 333 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The other issues dealt with in the panel opinion were not reheard by the court en banc and their Disposition is approved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Beets's son, Robbie, admitted at trial that he had set the boat adrift to give the appearance that Jimmy Don had fallen overboard. Jimmy Don's heart pills had been spilled on the floor of the boat to make his disappearance seem accidental.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The planter was also described as a \"wishing-well.\" Beets v. State, 767 S.W. at 739.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The introduction of this evidence was upheld by the state appellate court. Beets v. State, 767 S.W.2d 711, 737-41.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. It is not clear that Beets was actually entitled to an evidentiary hearing. If Beets's case arose today it is even more doubtful that she would have been so entitled under the cause-and-prejudice standard announced in Keeney v. Tamayo-Reyes, 504 U.S. 1, 112 S. Ct. 1715, 118 L. Ed. 2d 318 (1992). Under Keeney, Beets would be entitled to an evidentiary hearing only if she could \"show cause for [her] failure to develop the facts in state-court proceedings and actual prejudice resulting from that failure.\" Id. at 11, 112 S. Ct. at 1721. Moreover, Beets's failure to develop her claims in state court would be excused and a hearing mandated only if she could \"show that a fundamental miscarriage of Justice would result from failure to hold a federal evidentiary hearing.\" Id.; cf. McCleskey v. Zant, 499 U.S. 467, 495, 111 S. Ct. 1454, 1470, 113 L. Ed. 2d 517 (1991); Murray v. Carrier, 477 U.S. 478, 496, 106 S. Ct. 2639, 2649-50, 91 L. Ed. 2d 397 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Cuyler has been routinely applied to cases in which an alleged attorney conflict resulted from serial representation of criminal defendants as well as simultaneous multiple representation. See, e.g., Burger v. Kemp, 483 U.S. 776, 107 S. Ct. 3114, 97 L. Ed. 2d 638 (1987). For convenience, we denominate both of these situations as \"multiple representation.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See Garcia v. Bunnell, 33 F.3d 1193, 1198 n.4 (9th Cir. 1994), cert. denied, 115 S. Ct. 1374, 131 L. Ed. 2d 229 (1995) (\"It is not logically necessary that the approach of these [multiple representation] cases also apply to conflicts between a defendant's and the attorney's own personal interests\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See, e.g., United States v. Hanoum, 33 F.3d 1128, 1130-32 (9th Cir. 1994), cert. denied, 131 L. Ed. 2d 564, 115 S. Ct. 1702 (1995) (appeal dismissed without prejudice to bring again with more facts supporting allegation that attorney was having sex with defendant's wife and therefore had incentive to make sure defendant was found guilty); Winkler v. Keane, 7 F.3d 304, 307-10 (2nd Cir. 1993), cert. denied, 114 S. Ct. 1407, 128 L. Ed. 2d 79 (1994) (no adverse effect found in criminal defense contingency fee arrangement); United States v. Sayan, 296 U.S. App. D.C. 319, 968 F.2d 55, 64-65 (D.C. Cir. 1992) (no actual conflict when attorney who was appointed one week before trial failed to request a continuance allegedly because he was afraid of adverse consequences to him and his firm if he filed such a motion); United States v. Michaud, 925 F.2d 37, 40-42 (1st Cir. 1991) (no Sixth Amendment violation when defense attorney in tax case taught classes to IRS agents on how to detect tax fraud); United States v. Salerno, 868 F.2d 524, 540-41 (2nd Cir.), cert. denied, 493 U.S. 811, 110 S. Ct. 586, 27 L. Ed. 2d 25 (1989) (no actual conflict or adverse effect when attorney and his firm were being investigated by the government and were allegedly unusually cooperative with the government in defendant's case); United States v. Horton, 845 F.2d 1414, 1418-21 (7th Cir. 1988) (no actual conflict and no adverse effect when attorney was \"serious\" candidate for U.S. Attorney during his representation of the defendant); United States v. McLain, 823 F.2d 1457, 1463-64 (11th Cir. 1987) (found both actual conflict and adverse effect when lawyer was going to be indicted on unrelated matter at Conclusion of case; lawyer had incentive to delay proceedings and evidenced poor effort in plea negotiations); Zamora v. Dugger, 834 F.2d 956, 960-61 (11th Cir. 1987) (no actual conflict and no adverse effect on allegation that attorney was more interested in publicity than obtaining an acquittal); United States v. Ellison, 798 F.2d 1102, 1106-09 (7th Cir. 1986), cert. denied, 479 U.S. 1038, 107 S. Ct. 893, 93 L. Ed. 2d 845 (1987) (found both actual conflict and adverse effect when lawyer \"testified\" against defendant in a Rule 32 hearing fending off allegations by defendant which would constitute malpractice); United States v. Andrews, 790 F.2d 803, 810-11 (10th Cir. 1986), cert. denied, 481 U.S. 1018, 107 S. Ct. 1898, 95 L. Ed. 2d 505 (1987) (no actual conflict and no adverse effect when court refused to allow attorney to withdraw from representation and start medical school); Roach v. Martin, 757 F.2d 1463, 1479-80 (4th Cir.), cert. denied, 474 U.S. 865, 106 S. Ct. 185, 88 L. Ed. 2d 154 (1985) (no actual conflict when attorney was being investigated by state bar while representing defendant).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Wood was technically decided under the due process clause rather than the Sixth Amendment, because only the former provision sets constitutional bounds on parole revocation hearings. The Court analogized appellants' rights in Wood to those in Cuyler, however.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Justice White's opinion, joined by Justices Burger and Rehnquist, pointed out the conflict in the resolution of this issue between the Illinois Supreme Court, Illinois v. Washington, 101 Ill. 2d 104, 461 N.E.2d 393, 77 Ill. Dec. 770 (1984) (holding that Cuyler 's conflict of interest standard is limited to the multiple representation context), and numerous federal courts. See, e.g., Westbrook v. Zant, 704 F.2d 1487, 1498-99 (11th Cir. 1983), overruled on other grounds, Peek v. Kemp, 784 F.2d 1479, 1494 (11th Cir. 1986) (Cuyler not limited to the multiple representation context); United States v. Harris, 701 F.2d 1095, 1099 (4th Cir.), cert. denied, 463 U.S. 1214, 103 S. Ct. 3554, 77 L. Ed. 2d 1400 (1983); United States v. Knight, 680 F.2d 470, 471 (6th Cir. 1982) (per curiam), cert. denied, 459 U.S. 1102, 103 S. Ct. 723, 74 L. Ed. 2d 950 (1983); Ware v. King, 694 F.2d 89, 92 (5th Cir. 1982) (per curiam), cert. denied, 461 U.S. 930, 103 S. Ct. 2092, 77 L. Ed. 2d 302 (1983); Alexander v. Housewright, 667 F.2d 556, 558 (8th Cir. 1981); United States v. Hearst, 638 F.2d 1190, 1193 (9th Cir.), cert. denied, 451 U.S. 938, 101 S. Ct. 2018, 68 L. Ed. 2d 325 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See United States ex rel. Duncan v. O'Leary, 806 F.2d 1307, 1312 (7th Cir. 1986), cert. denied, 481 U.S. 1041, 107 S. Ct. 1982, 95 L. Ed. 2d 822 (1987) (\"The precise scope of the category of claims to which the Cuyler standard applies has not been definitively stated by the Supreme Court\"); Hayes v. Lockhart, 766 F.2d 1247, 1250 (8th Cir.), cert. denied, 474 U.S. 922, 106 S. Ct. 256, 88 L. Ed. 2d 263 (1985) (\"'There is no litmus test to determine whether an actual conflict exists'\") (citation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See Johnston v. Mizell, 912 F.2d 172, 177 (7th Cir. 1990), cert. denied, 498 U.S. 1094, 111 S. Ct. 982, 112 L. Ed. 2d 1067 (1991) (\"Cuyler presumption of prejudice cannot be applied blindly to every ineffective assistance of counsel claim involving a conflict of interest\"); Williams v. Calderon, 52 F.3d 1465, 1473, 1995 WL 150857 at * 5 (9th Cir. 1995) (Cuyler does not extend to defendant's claim that pro bono attorney was burdened with impermissible conflict under Cuyler because payment for additional investigative and psychiatric services would have had to come out of lawyer's own pocket); United States v. Zackson, 6 F.3d 911, 919-22 (2nd Cir. 1993) (Strickland, and not Cuyler, is the appropriate test when defendant alleged counsel's busy schedule created conflict in his representation of the case; this is not the kind of conflict subject to Cuyler rule). Indeed, prior to Cuyler, a significant majority of the circuits precluded habeas relief absent a showing of prejudice arising from a conflict between the interests of the defendant and his attorney. See Gregory S. Sarno, Annotation, Circumstances Giving Rise to Prejudicial Conflict of Interests Between Criminal Defendant and Defense Counsel, 53 A.L.R. Fed. 409, ยง 3 (1981) (Second, Third, Fourth, Sixth, Seventh, and Ninth Circuits required prejudice whereas the Fifth, Eighth, and D.C. Circuits did not).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The Dissent's \"rule\" reserves Cuyler at least for attorney-client conflicts based on media rights contracts, contingent fee arrangements and conflicts arising from an attorney's involvement in criminal conduct with his client. The Dissent, however, makes no effort to explain why these situations necessarily involve a greater constitutional risk than other ethical conflicts. Indeed, in light of the fact that hardly any criminal conviction has ever been reversed because of counsel's media rights contract, n.19 infra, the Dissent's selection seems extraordinarily result-oriented.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See also, ABA Model Rules of Professional Conduct, Rule 1.8, \"Conflict of interests: prohibited transactions,\" which list ten separate categories of \"prohibited\" transactions between an attorney and client, only two of which, ยงยง (f) and (g) deal respectively with a lawyer's receipt of compensation for representing a client from a third party and a lawyer's duty in regard to settlement when representing two or more clients in a civil or criminal proceeding. See generally, Developments in the Law -- Conflicts of Interest in the Legal Profession, 94 Harv. L. Rev. 1244 (1981). For simplicity, the ABA Model Rules will be referenced in this Discussion because they reflect prevailing standards in most United States jurisdictions. See also Raymond L. Wise, Legal Ethics 73-76 (1979 Supp.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Although we have no occasion to discuss the question here, a powerful argument can be made that a lawyer who is a potential co-defendant with his client is burdened by a \"multiple representation\" conflict that ought to be analyzed under Cuyler.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. There is another reason why multiple representation cases are more amenable to Cuyler 's fairly rigid rule of presumed prejudice. They are amenable to prophylactic rules requiring court oversight of potential conflicts. Self-interested duty of loyalty problems ordinarily defy prophylactic treatment, suggesting appropriateness of a real prejudice standard for after-the-fact review.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See United States v. Hearst, 638 F.2d 1190 (9th Cir. 1980) cert. denied, 451 U.S. 938, 101 S. Ct. 2018, 68 L. Ed. 2d 325 (1981); Mark R. McDonald, Literary-Rights Fee Arrangements in California: Letting the Rabbit Guard the Carrot Patch of Sixth Amendment Protection and Attorney Ethics?, 24 Loy. L.A. L. Rev. 365 (1991); American Bar Ass'n Standards for Criminal Justice, Standard 4-3.4 (2d ed. 1980); American Bar Ass'n, Model Code of Professional Responsibility, DR 5-104(B); American Bar Ass'n, Model Rules of Professional Conduct, Rule 1.8(d).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See Buenoano v. Singletary, 963 F.2d 1433, 1438-39 (11th Cir. 1992) (remanded for evidentiary hearing on whether fee arrangement that gave first $250,000 of book and movie contract to the attorney created an actual conflict and an adverse effect); United States v. Marrera, 768 F.2d 201, 205-09 \u0026 n.6 (7th Cir. 1985), cert. denied, 475 U.S. 1020, 106 S. Ct. 1209, 89 L. Ed. 2d 321 (1986) (found no actual conflict and no adverse effect in fee arrangement involving movie rights); United States v. Hearst, 638 F.2d 1190, 1193-94 (9th Cir. 1980), cert. denied, 451 U.S. 938, 101 S. Ct. 2018, 68 L. Ed. 2d 325 (1981) (remanded for a hearing on whether F. Lee Bailey's book contract with Patty Hearst created an actual conflict of interest); Wojtowicz v. United States, 550 F.2d 786, 793 (2d Cir.), cert. denied, 431 U.S. 972, 97 S. Ct. 2938, 53 L. Ed. 2d 1071 (1977) (Pre-Cuyler case found no prejudice from movie rights deal); Ray v. Rose, 535 F.2d 966, 973-75 (6th Cir.), cert. denied, 429 U.S. 1026, 97 S. Ct. 648, 50 L. Ed. 2d 629 (1976) (Pre-Cuyler case found no prejudice from media rights contract with attorney); Maxwell v. Superior Court, 30 Cal. 3d 606, 180 Cal. Rptr. 177, 639 P.2d 248, 257 (Cal. 1982) (publication rights contract between attorney and defendant does not per se render counsel ineffective and conflicts of interest created thereby are waivable); People v. Bonin, 47 Cal. 3d 808, 835, 254 Cal. Rptr. 298, 313-14, 765 P.2d 460, 475 (Cal. 1989), cert. denied, 494 U.S. 1039, 110 S. Ct. 1506, 108 L. Ed. 2d 641 (1990) (no reversible error in literary rights fee arrangement); People v. Gacy, 125 Ill. 2d 117, 134, 530 N.E.2d 1340, 1347, 125 Ill. Dec. 770 (1988), cert. denied, 490 U.S. 1085, 109 S. Ct. 2111, 104 L. Ed. 2d 671 (1989) (no conflict of interest when attorney rejected offer by defendant to grant attorney book rights); Stafford v. State, 669 P.2d 285, 296-97 (Okla.Crim.App.) cert. granted and judgment vacated, 467 U.S. 1212, 104 S. Ct. 2652, 81 L. Ed. 2d 359 (1984) (no actual conflict or adverse effect from publication rights contract); People v. Corona, 80 Cal. App. 3d 684, 720-21, 145 Cal. Rptr. 894, 916 (Cal.Ct.App. 1978) (found media rights conflict created an actual conflict and resulted in prejudice when \"trial counsel assumed a position virtually adverse to his client and, totally unsupported by strategic or tactical considerations, took deliberate steps to thwart the development of viable defenses\"); Dumond v. State, 294 Ark. 379, 743 S.W.2d 779, 784-85 (Ark. 1988) (no actual conflict in media rights contract between attorney and defendant and his wife).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See, e.g., United States v. Hearst, 638 F.2d 1190, 1193 (9th Cir. 1980), cert. denied, 451 U.S. 938, 101 S. Ct. 2018, 68 L. Ed. 2d 325 (1981); People v. Corona, 80 Cal. App. 3d 684, 145 Cal. Rptr. 894 (Cal.Ct.App. 1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See United States v. Marrera, 768 F.2d 201, 207-08 (7th Cir. 1985), cert. denied, 475 U.S. 1020, 106 S. Ct. 1209, 89 L. Ed. 2d 321 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The State contends that Roberts's testimony renders Andrews's potential testimony merely cumulative. The State asserts that where an attorney's testimony is not essential to the case, or would be merely cumulative of other evidence, there is no ethical duty placed upon Texas lawyers to withdraw from representation. See State Bar of Texas, Ethical Considerations on Code of Professional Responsibility, EC 5-10 (1972): It is not objectionable for a lawyer who is a potential witness to be an advocate if it is unlikely that he will be called as a witness because his testimony would be merely cumulative or if his testimony will relate only to an uncontested issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Nothing in the record suggests that the prosecutor or trial Judge thought Andrews was a possible witness, and Andrews was never directly asked at the federal habeas hearing whether he should have been a defense witness. Andrews stated that he believed Betty Beets did not commit the murders, but she was at first reluctant to reveal the true facts to him because of the implication for her children's guilt. Andrews did not consider withdrawing as Beets's attorney: Q. [McGlasson] It never occurred to you during the trial to withdraw, to move to withdraw or no one suggested that you should do that. Is that correct? A. Well, it sort of occurred to me when I found out I wasn't being paid, but I didn't. It occurred to me, I'm going to have to be honest with you, but I didn't do it. Q. But that was the only reason that it might have occurred to you is that you felt like you weren't receiving any payment. Is that correct? A. Well, that's true. I'm not doing this as a hobby. Q. Right. There's no other reason you could think of during the trial why you should withdraw from this case. Is that correct? A. From Ms. Stegner's case I did withdraw, there became a conflict. From Betty's case, I felt strongly toward this case and, no, I wouldn't let her down. Unh-unh. Q. Right. Okay. A. Not even for money, and I didn't get any.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Not only was Andrews's testimony limited to his inference about Beets's knowledge, but such testimony might well have led to incriminating cross-examination on his earlier dealings with Beets.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. With due respect, the Dissent's claim that this opinion somehow \"conflates the existence and effect elements of the [Cuyler ] analysis\" is mistaken. Of course, both elements are necessary before this court can grant habeas corpus relief under Cuyler ; Beets does not prove either element. This court's structured inquiry closely mirrors and is instructed by the Supreme Court's approach in Burger v. Kemp, 483 U.S. 776, 785, 107 S. Ct. 3114, 3121, 97 L. Ed. 2d 638 (1987), which held that \"the asserted actual conflict of interest, even if it had been established, did not harm [the] lawyer's advocacy.\" Likewise, had Beets been able to prove an actual conflict, habeas relief should still be denied because Beets did not demonstrate that it adversely affected her representation. Given the approach in Burger, the Dissent's critique obfuscates the proper Disposition of this case. Since both the state court and the district court agreed that the media rights contract had no effect on Andrews's representation of Beets, there is no need for a remand; relief under Cuyler is unavailable as soon as the petitioner fails to prove either an actual conflict or an adverse effect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. In relevant part, 28 U.S.C. ยง 2254(d) provides that In any proceeding instituted in a Federal court . . . for a writ of habeas corpus . . ., a determination after a hearing on the merits of a factual issue, made by a State court of competent jurisdiction in a proceeding to which the applicant for the writ and the State . . . were parties, . . . shall be presume to be correct, unless the applicant shall establish or it shall otherwise appear . . . 28 U.S.C. ยง 2254(d). Thus, the statute unambiguously dictates that the presumption of correctness afforded by this court is mandatory, not permissive. This presumption can only be rebutted if the petitioner proves one of the statutory exceptions. See 28 U.S.C. ยง 2254(d)(1)-(8). Since the Dissent concedes that \"no party has addressed the presumption of correctness,\" the presumption has not been rebutted and this court must adopt it. Moreover, this court neither adopts nor raises this presumption anew. To the contrary, we emphasize and rely on both the state and district courts' fact finding that the petitioner's grant of media rights to Andrews's son did not affect her representation at all.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The mobile home was Jimmy Don's separate property, but until Jimmy Don's disappearance, Betty Lou and Jimmy Don resided in the mobile home together. After Jimmy Don disappeared, Betty Lou continued to reside in the mobile home.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. According to Randell Roberts's affidavit, after Beets was arrested, he and his brother \"consulted with Mr. Andrews with respect to [their] further involvement in either of [the fire or the life] insurance matters. It was agreed that we would withdraw from further involvement in either matter . . . .\" Additionally, Randell Roberts noted that \"in deciding to withdraw from these matters my brother and I knew that we might be called to testify on behalf of Ms. Beets during her trial. We did not think that it would be appropriate for us to continue to represent her in the other matters if we were needed to testify on her behalf.\" As noted above, Bruce Roberts did testify.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The majority comments that \"Andrews testified at the federal habeas hearing that this contract was signed after negotiations fell through to obtain his fee from Beets's children.\" Beets, F.3d at * 5. This is technically true; the contract was not signed until after the trial began, and Andrews did note that he and one of Beets's daughters \"discussed finances prior to trial. It didn't come through.\" This, however, does not support the notion that the media rights contract was a last-second alternative to a fee. As noted above, the record clearly indicates that Andrews contemplated obtaining the media rights long before the trial started.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Specifically, during his examination of Beets, the following colloquy took place: Andrews: Whose suggestion was it that we try to collect retirement and insurance money? Beets: I don't know that anybody suggested it. Andrews: Was it some two years later? Beets: Yes, it was about two years later. Andrews: Was it a lawyer [who] suggested it? Beets: I came to you. Andrews: Did I send you . . . to some other lawyer? Beets: I talked to Randy Roberts in your office. Andrews: Okay. Did you ever push me to just, \"Let's get that money. Let's get that money and the whole bit.\" Did you ever do that? Beets: No, I didn't expect to get any of it. Additionally, near the Conclusion of his examination of Beets, Andrews inquired whether Beets sought the settlement from the city \"on my [Andrews's] recommendation?\" Beets replied yes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Similarly, the American Bar Association's Model Code of Professional Responsibility and Model Rules of Professional Conduct prohibit (and continue to forbid) a lawyer from obtaining media rights to his client's case. See Model Rules of Professional Conduct Rule 1.8(d) (mandating that \"prior to the Conclusion of representation of a client, a lawyer shall not make or negotiate an agreement giving the lawyer literary or media rights to a portrayal or account based in substantial part on information relating to the representation\"); Model Code of Professional Responsibility EC 5-4 (mirroring the language of the Texas rule).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. See also Laws. Man. on Prof. Conduct, supra, at 51:702 (stating that the purpose of the prohibition is to \"avoid the conflict of interest that would arise if the course of action that would further the client's cause would at the same time diminish the value of the lawyer's publication rights\"); Schuwerk and Sutton, supra, at 134 (noting that a lawyer who is the beneficiary of a media rights contract \"may be tempted to take various actions in the representation of the client based on their effect upon the value of the publication rights.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The Texas standards of professional conduct in effect at the time of Beets's trial frowned upon an individual's acting as counsel in a case when he may also be called upon to serve as a witness. Specifically, the rule provided that: If, after undertaking employment in contemplated or pending litigation, a lawyer learns or it is obvious that he . . . ought to be called as a witness on behalf of his client, he shall withdraw from the conduct of the trial and . . . shall not continue representation in the trial. State Bar Rules, art. X, ยง 9, DR 5-102 (1984). The Rule provided for certain exceptions as well. See Texas State Bar Rules, art. X, ยง 9, DR 5-101(B) (1984). The rationale behind this rule is somewhat different from the reasons animating the prohibition against media rights contracts. Thus, while \"the dual role [of advocate and witness] may be detrimental to the client's interests because the lawyer may be more impeachable on grounds of bias,\" it is also recognized that: The most cogent rationale for the advocate-witness rule rests on protection of the fact-finding process. [The] adversary system works best when the roles of the Judge, of the attorneys, and of the witnesses are clearly defined. Any mixing of those roles inevitably diminishes the effectiveness of the entire system. Schuwerk \u0026 Sutton, supra, at 317-18 (internal quotations omitted). Other commentators agree, noting that: The rationales [for rules limiting a lawyer by prohibiting media contracts and limiting a lawyer from acting as a witness] are simple. First, the attorney has built-in bias which must be argued to the finder of fact. Second, it is assumed that lawyers as advocates would bend the facts for the client or that the jury would give the lawyer's testimony too much credence. Third, the lawyer-witness role may inhibit effective cross-examination. Hall, supra, ยง 12.10, at 412 (footnotes omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Specifically the district court stated: The possibility exists that the media rights contract motivated Andrews at a subconscious level to remain in the case when he should have withdrawn and testified for [Beets]. To that limited extent, the two conflicts are intertwined. However, this Court has determined that the witness/advocate conflict is a separate conflict which did in fact adversely affect Andrews'[s] performance. This is sufficient under Cuyler without a detailed analysis of Andrews'[s] possible motivation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. I recognize that the ultimate question whether a conflict of interest existed here is a mixed question of law and fact, see Strickland, 466 U.S. at 698 (citing Cuyler, 446 U.S. at 342), but its fact-bound components, such as whether Andrews's failure to withdraw and testify was caused by the media rights contract, should be addressed in the first instance by the district court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. To say that the inquiry whether an actual conflict exists contemplates an objective evaluation of the situation in which counsel is placed, i.e., that counsel's subjective perceptions cannot control the outcome of that inquiry, is supported by the Court's Conclusion that the question whether a conflict exists is a mixed question of law and fact. See Cuyler, 446 U.S. at 342.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Until the panel's decision (which echoes in the majority opinion), there had been no question that the conflict inquiry is objective in the ordinary civil context. For example, in situations where a law firm is alleged to have a conflict of interest stemming from serial representation, whether the attorneys in that firm recognized or even knew about the conflict is not controlling. Instead, if an objective standard is met, i.e. if the \"prior representations are substantially related to the present case,\" then \"the court will irrebuttably presume that relevant confidential information was disclosed during the former period of representation.\" In re American Airlines, 972 F.2d 605, 614 (5th Cir. 1992), cert. denied, 122 L. Ed. 2d 659, 113 S. Ct. 1262 (1993). In such cases, there is little doubt that a law firm could not avoid disqualification by protesting that it neither believed nor realized that it had a conflict of interest. See In re Martin, 817 F.2d 175, 182 (1st Cir. 1987) (noting that in examining whether an actual conflict of interest exists, \"sincerity or protestations of good faith, no matter how genuine, will not be enough. The test must be more [of] an objective one.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Circuit courts have frequently applied this principle. Thus, as the First, Second, and Third Circuits have noted: [a defendant first] must demonstrate that some plausible alternative defense strategy or tactic might have been pursued. He need not show that the defense would necessarily have been successful if it had been used, but that it possessed sufficient substance to be a viable alternative. Second, he must establish that the alternative defense was inherently in conflict with or not undertaken due to the attorney's other loyalties or interests. Winkler, 7 F.3d at 309 (quoting Gambino, 864 F.2d at 1070 (alteration in original) (emphasis added)); accord Fahey, 769 F.2d at 836; see also Foxworth v. Wainwright, 516 F.2d 1072, 1077 n.7 (5th Cir. 1975) (noting, before Cuyler or Strickland, that \"if an actual, significant, conflict is found . . . the degree of prejudice is not to be considered.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. There had been some question in this court about the other aspect of the test articulated in Cuyler ; that is, whether a petitioner was required to show that an actual conflict of interest actually affected his representation. In Baty v. Balkcom, 661 F.2d 391, 395 (5th Cir. Unit B Nov. 1981), cert. denied, 456 U.S. 1011 (1982), we stated our belief that \"a requirement of proof of adverse effect of a conflict of interest on counsel, in addition to proof of an actual conflict, was not the intent of the [Supreme] Court in Cuyler.\" Baty, 661 F.2d at 397 n.13. After the Supreme Court's decision in Strickland, we revisited that determination, holding that \"proof of some adverse effect is required before prejudice will be presumed from a showing that the attorney had an actual conflict of interest.\" Nealy v. Cabana, 782 F.2d 1362, 1365 (5th Cir.), cert. denied, 479 U.S. 819 (1986). In none of those cases, however, did we suggest a different standard for determining the first prong of the Cuyler inquiry -- whether there was an actual conflict.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. For cases applying Cuyler, see Garcia v. Bunnell, 33 F.3d 1193, 1198 n.4 (9th Cir. 1994) (applying the Cuyler standard to conflict created by attorney accepting job with prosecution office prior to trial, but noting that \"it is not logically necessary that the approach of [Cuyler ] also apply to conflicts between a defendant's and the attorney's own personal interests; however, we conclude that precedent so requires\"), cert. denied, 131 L. Ed. 2d 229, 115 S. Ct. 1374 (1995); Winkler v. Keane, 7 F.3d 304, 307 (2d Cir. 1993) (applying Cuyler to conflict created by attorney working on contingency fee in criminal case), cert. denied, 128 L. Ed. 2d 79, 114 S. Ct. 1407 (1994); United States v. Sayan, 296 U.S. App. D.C. 319, 968 F.2d 55, 64-65 (D.C. Cir. 1992) (upholding application of Cuyler 's adverse effect test to alleged conflict created by lawyer's fear of antagonizing Judge); United States v. Michaud, 925 F.2d 37, 40 (1st Cir. 1991) (analyzing conflict of interest stemming from attorney's association with prosecuting IRS under Cuyler framework); United States v. Horton, 845 F.2d 1414, 1418-21 (7th Cir. 1988) (applying Cuyler to conflict generated by defense attorney's candidacy for U.S. Attorney); United States v. Andrews, 790 F.2d 803, 811 (10th Cir. 1986) (finding that Cuyler applies in situations involving \"counsel's ability to represent his client fairly, loyally or impartially\"), cert. denied, 481 U.S. 1018 (1987); Roach v. Martin, 757 F.2d 1463, 1479 (4th Cir.) (applying Cuyler when alleged conflict of interest was rooted in fact that defense attorney was under investigation by state bar grievance committee), cert. denied, 474 U.S. 865 (1985); Ware v. King, 694 F.2d 89, 92 (5th Cir. 1982) (per curiam) (using Cuyler framework to analyze claim of conflict of interest stemming from separate civil and criminal lawsuits pending between defense counsel and prosecutor), cert. denied, 461 U.S. 930, 77 L. Ed. 2d 302, 103 S. Ct. 2092 (1983); United States v. Knight, 680 F.2d 470, 471 (6th Cir. 1982) (per curiam) (undertaking Cuyler analysis in evaluating claim of conflict of interest stemming from attorneys' knowledge that they were under investigation for stealing documents during trial), cert. denied, 459 U.S. 1102 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. For example, Model Rule 1.8(a) restricts an attorney from entering into business transactions with a client. Similarly Rule 1.8(d) prohibits an attorney from acquiring media rights from a client prior to the Conclusion of the representation of that client. Rule 1.8(f) severely restricts the ability of an attorney to receive compensation from someone other than his client, and Rule 1.5(d)(2) prohibits attorneys from entering into contingent fee arrangements in criminal cases. See also State Bar Rules, art. X, ยง 9, DR 5-101(A) (Texas Code of Professional Responsibility) (1984) (\"[A] lawyer shall not accept employment if the exercise of his professional judgment on behalf of his client will be or reasonably may be affected by his own financial, business, property, or personal interests.\"); Hazard \u0026 Hodes, supra, ยง 1.8:101 (noting that many of the transactions prohibited in Model Rule 1.8 \"involve transactions in which the lawyer's own self-interest threaten to adversely affect the quality of the representation to be provided\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Strickland itself was a claim for failure to investigate, and in adopting its test, the Court noted that Strickland 's standard \"required no special amplification in order to define counsel's duty to investigate.\" Strickland, 466 U.S. at 690.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. In differentiating between conflicts that merit the more stringent test of Strickland and conflicts that warrant the Cuyler methodology, courts may, as instructed to do in Strickland when determining the reasonableness of attorney conduct, receive some guidance from prevailing norms of professional responsibility. Ineffective assistance claims rooted in the failure to investigate or to devote proper attention to a case have rightfully been treated under the uncontroversial standards of competence and diligence. See Strickland, 466 U.S. at 690; Zackson, 6 F.3d at 921; Model Rules of Professional Conduct Rule 1.1. (\"A lawyer shall provide competent representation to a client. Competent representation requires the legal knowledge, skill, thoroughness and preparation reasonably necessary for the representation.\"); Model Rules of Professional Conduct Rule 1.3 (\"A lawyer shall act with reasonable diligence and promptness in representing a client.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The majority states that \"the Dissent has agreed that a witness/advocate conflict alone is not the sort that even under their approach should be governed by a Cuyler inquiry.\" Beets, F.3d at * 43. To the contrary, a witness/advocate \"conflict\" having its source in a media rights contract, as may be the case here, is exactly the kind of conflict that should be governed by Cuyler.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. For examples of these cases see Wood, 450 U.S. at 271-72 (applying Cuyler to a case in which a defense attorney was paid by a third party with a possibly conflicting interest); Winkler, 7 F.3d at 308 (using Cuyler in a case where a criminal defense attorney was paid on a contingency fee basis); Marrera, 768 F.2d at 207 \u0026 n.6 (employing Cuyler 's framework to a conflict based on a lawyer's financial interest in media rights); Hearst, 638 F.2d at 1193 (same); Acevedo, 891 F.2d at 610-11 (employing the Cuyler test to a situation in which an attorney may be involved in the criminal conduct that his client is alleged to have committed).\u003c/span\u003e\n\n",
    "body_length": 174879,
    "citedas": [
      "65 F.3d 1258"
    ],
    "attorneys": "ATTORNEYS FOR APPELLANT: FOR: COLLINS: Dan Morales, AG, William C. Zapalac, AAG, Austin, TX. ATTORNEYS FOR APPELLEE: FOR: BETTY LOU BEETS: Robert L. McGlasson, Texas Resource Cntr., Austin, TX. Joe Marqulies, John H. Blume, So. Carolina Resource Center, Columbia, S.C.",
    "category": [
      "36",
      "75"
    ],
    "judges": "Before Politz, Chief Judge, King, Garwood, Jolly, Higginbotham, Davis, Jones, Smith, Duhe, Wiener, Barksdale, Emilio M. Garza, and DeMOSS, Circuit Judges.*fn*",
    "citation_count": 156
  }
}
