{
  "id": "1KFaR2YBTlTomsSB3POG",
  "document": {
    "title": "People v. Sanders",
    "full_title": "THE PEOPLE AND v. SHELDON SANDERS AND . IN RE SHELDON SANDERS ON HABEAS CORPUS",
    "jurisdiction": "California Court of Appeal",
    "date": "1990-05-29T00:00:00.000Z",
    "docket": "Nos. B030989, B037473",
    "body": "A jury convicted appellant of second degree murder (Pen. Code, §§ 187, 189\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e) and found true the firearm use allegation (§§ 12022.5, 1203.06, subd. (a)(1).) Probation was denied and he was sentenced to state prison for a total term of 17 years to life. Appellant appeals on various grounds and also petitions for habeas corpus on the ground that he was denied his constitutional right to the effective assistance of counsel at trial. The proceedings have been consolidated for decision. We deny the petition and affirm the judgment.\n\nProcedural and Factual Background\n\nTwo families are entwined in these events, the Gregory and Sanders families. In 1985, when these matters occurred, Kelvin Sanders was married to, but estranged from, Raynetta Gregory Sanders. On occasion he would spend the night with her at the Gregory family residence, 2009 N. Slater Street in Compton.\n\nOn the morning of July 11, 1985, Kelvin Sanders was at the Gregory residence, having spent the night there. At around 10 a.m. appellant, Kelvin's brother, arrived to pick him up. Appellant was driving his sister's car, a burgundy BMW.\n\nAs Kelvin joined appellant in the car, two of Raynetta's younger brothers, Norman and David Gregory, approached the BMW and punched appellant. Each hit him once. When appellant, in retaliation, tried to run them down with his car, they threw rocks at the BMW, cracking its windshield. As appellant was leaving he said to Norman and David, \"We'll be back. We're going to get you, motherfuckers.\"\n\nAbout five minutes later another Sanders brother, Calvin, arrived at the Gregory residence looking for Kelvin. Learning Kelvin had departed with appellant, Calvin left.\n\nApproximately 20 minutes later Raynetta received two short telephone calls from Kelvin who said she should get out of the house. She dressed her children and went next door.\n\nAbout 20 minutes after the phone calls various witnesses heard what sounded like a gunshot. David, Terrell, and Norman Gregory and their friends Darryl Anderson and William Thomas all ran to the inside front door of the Gregory home. They all saw\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e appellant in front of the house standing with a rifle. Raynetta, after she heard what sounded like a cherry bomb ran outside, looked towards her house, and saw appellant with a rifle.\n\nWith all five young men crowded around him, Norman Gregory opened the front door.\n\nAppellant said, \"Come out now, motherfuckers.\"\n\nNorman replied, \"Put the gun down. Let's go head up.\"\n\nAppellant walked towards the Gregory front door, raised the rifle, pointed it at the door and fired. The gunshot fatally struck Norman Gregory in the back of the neck and exited his left jaw.\n\nAppellant ran to the burgundy BMW, in which Kelvin and perhaps a third person were sitting, and left.\n\nWhen the police arrived, before the ambulance, Norman was bleeding profusely. Some witnesses initially told the police that it was Xavier\n\nSanders, appellant's brother, who had shot Norman, and one witness at first told them he wasn't sure who the shooter was.\n\nThe defenses were alibi, that the victim was shot from inside the residence, and that if shot from outside, Xavier Sanders was the shooter.\n\nContentions on Appeal\n\nAppellant contends:\n\n1. CALJIC jury instruction No. 2.11.5 prejudiced appellant by creating the impression that the jury should not consider appellant's defense.\n\n2. The prosecutor's comments appealing to juror passion and prejudice were misconduct requiring reversal.\n\n3. The trial court erred in considering the \"victim impact statement\" contained in the probation report when sentencing appellant.\n\n4. Appellant was denied the effective assistance of counsel when Mr. Jefferson failed to produce testimony from appellant's brother that he, not appellant, was the actual shooter, and again when Ms. Abramson declined to move for a new trial on that basis.\n\n5. The trial court was under a sua sponte duty to order either a new trial or further factual hearings once it learned of Xavier's confession.\n\nDiscussion\n\n1. CALJIC jury instruction No. 2.11.5 prejudiced appellant by creating the impression that the jury should not consider appellant's defense.\n\nOver appellant's objection the trial court instructed the jury that, \"There has been evidence in this case indicating that a person other than defendant was or may have been involved in the crime for which the defendant is on trial. [para.] You must not discuss or give any consideration as to why the other person is not being prosecuted in this trial or whether he has been or will be prosecuted.\" (CALJIC No. 2.11.5 (4th ed. 1979).)\n\nAppellant argues that there was no evidence more than one person \"was involved in the crime\" and that therefore \"the instruction inferred [ sic ] that the jury should . . . not discuss [] . . . why appellant . . . was being prosecuted for the death of Norman Gregory.\" In other words, appellant\n\nmaintains, even if the jury believed appellant was not the person with the rifle or if they believed the victim was shot by some other person from inside the house, this instruction directed them to still convict appellant.\n\nWe disagree both with appellant's assumption and with his interpretation.\n\nA trial court has a duty to instruct a jury \"on the general principles of law relevant to the issues raised by the evidence.\" (People v. St. Martin (1970) 1 Cal. 3d 524, 531 [83 Cal. Rptr. 166, 463 P.2d 390].) There was evidence that a person other than the shooter may have been involved in the crime. E.g., Kelvin Sanders was with appellant at the Gregory residence when appellant said \" We'll be back. We're going to get you. . . .\" (Italics added.) Then, at the time of the shooting many witnesses saw one or two other people in the burgundy BMW, the car appellant used. One witness, David Gregory, thought the other person in the car was Kelvin Gregory. Thus, there was an evidentiary predicate for the instruction.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nContrary to appellant's interpretation, the instruction did not impinge upon any of appellant's defenses. It merely directed the jury not to be distracted from its task of determining appellant's guilt or innocence by considering whether some uncharged person might, to some degree, be culpable.\n\nWe find no error in the giving of this instruction.\n\n2. The prosecutor's comments appealing to juror passion and prejudice were misconduct requiring reversal.\n\nAppellant cites the following examples of prejudicial prosecutorial argument: \"There is a four inch gap spurting blood\"; \". . . four-inch hole in his cheek\"; \"Again Norman is shot; he is laying down; there is a four inch gap in his neck. The ambulance never seems to get there.\"; \". . . 4 inch gap, spurting blood . . . .\"\n\nInitially, we note that appellant made no objection to any of these prosecutorial comments and is therefore precluded from claiming error on appeal. (Evid. Code, § 353; People v. Green (1980) 27 Cal. 3d 1, 27 [164 Cal. Rptr. 1, 609 P.2d 468].) The reason appellant, which is to say trial counsel, made no objection to these during-argument comments is no doubt because they are not objectionable. During argument counsel may\n\n\"comment on the credibility of a witness in light of all the evidence presented.\" (People v. Prysock (1982) 127 Cal. App. 3d 972, 997 [180 Cal. Rptr. 15].) That is what the prosecutor, by these relatively bland comments, was attempting to do.\n\nDefense counsel had impeached prosecution witnesses by their inconsistent statements to the police. The prosecutor attempted to explain the inconsistencies by describing the circumstances: the witness's brother or friend had just been shot through the neck and jaw, was motionless on the ground, bleeding profusely, and no ambulance had yet arrived.\n\nAs the prosecutor himself explained in argument, \"I did not mean to prejudice the case or prejudice the defendant in any way when I bring up this four-inch gap. I'm not trying to appeal to your sympathy. The reason it's important is so you understand why witnesses might have made mistakes shortly after when the ambulance isn't even there. You shouldn't convict Sheldon Sanders because of a four-inch gap, but one of the things you have to consider, is it possible someone can really make a mistake when their brother has a four-inch gap, spurting blood and there is no ambulance that seems to be coming? That it is something you should consider.\"\n\nThe prosecutor's comments were proper.\n\n3. The trial court erred in considering the \"victim impact statement\" contained in the probation report when sentencing appellant.\n\nIn accordance with California Rules of Court, rule 419, the probation report, which the trial judge read before imposing sentence, contained statements by members of the victim's family about the victim, appellant, and the crime. Appellant claims it was error for the report to contain these statements.\n\nAppellant relies on Booth v. Maryland (1987) 482 U.S. 496 [96 L.Ed.2d 440, 107 S.Ct. 2529]. Booth is distinguishable since it holds that the Eighth Amendment is violated when \"victim impact\" evidence is presented to a jury during the sentencing phase of a capital murder trial. None of the three emphasized factors were present here. Not only did Booth not disapprove the use of \"victim impact\" information by judges for sentencing purposes (id. at p. 507, fn. 10 [96 L.Ed.2d at p. 451]) but it condoned their use as trial evidence in appropriate circumstances, other than the sentencing phase of a capital case. (Ibid.)\n\nAppellant's reliance upon People v. Levitt (1984) 156 Cal. App. 3d 500 [203 Cal. Rptr. 276] is also misplaced. There the trial judge, in imposing an upper and consecutive term, expressly relied upon the effects of the victim's death upon his wife and unborn child.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nIn the instant case there was no such express reliance. To the contrary, the trial judge demonstrated exemplary objectivity and balance. She stated, \"I read the probation report which speaks in detail of the effect of this tragic incident on the victim's family, and I think it's very obvious to this court that there are two families here who have been touched greatly by this, who have been affected greatly by this unfortunate incident. [para.] I have to say that I understand both sides of the family. I don't think there is anyone sitting here who is feeling that, one, we're going to get somebody, or two, we're not going to get anyone. I think we all understand there has been a tremendous tragedy no matter which side of this courtroom you're sitting on.\"\n\nWe find no sentencing error.\n\n4. Appellant was denied the effective assistance of counsel when Mr. Jefferson\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e failed to produce testimony from appellant's brother that he, not appellant, was the actual shooter, and again when Ms. Abramson\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e declined to move for a new trial on that basis.\n\nAppellant's contention of ineffective representation by his trial counsel, Mr. Jefferson, is based upon matters outside the record on appeal and which, therefore, we may not consider. (Loving \u0026 Evans v. Blick (1949) 33 Cal. 2d 603, 613-615 [204 P.2d 23]; Pulver v. Avco Financial Services (1986) 182 Cal. App. 3d 622, 631-632 [227 Cal. Rptr. 491]; 9 Witkin, Cal. Procedure (3d ed. 1985) Appeal, § 250, pp. 256-257.) In his petition for habeas corpus appellant makes the identical contention, a contention we consider later in this opinion.\n\nAppellant also contends that other privately retained counsel, Ms. Abramson, ineffectively represented him at the sentencing hearing by failing to make a motion for new trial.\n\nAppellant does not claim that Ms. Abramson, who obtained four continuances, inadequately investigated possible grounds for such a motion. Rather, he states \"[f]or reasons not completely clear from the record, Ms.\n\nAbramson declined to make a new trial motion. . . .\" But as our Supreme Court has observed \"'In some cases . . . the record on appeal sheds no light on why counsel acted or failed to act in the manner challenged. In such circumstances, unless counsel was asked for an explanation and failed to provide one, or unless there simply could be no satisfactory explanation, these cases are affirmed on appeal.'\" (People v. Farmer (1989) 47 Cal. 3d 888, 916 [254 Cal. Rptr. 508, 765 P.2d 940], quoting People v. Pope (1979) 23 Cal. 3d 412, 426 [152 Cal. Rptr. 732, 590 P.2d 859, 2 A.L.R.4th 1].)\n\nIn fact Ms. Abramson did tell the trial court why she had decided not to make a new trial motion. She stated, \"I don't feel the law is such that a motion for new trial based on incompetency of counsel would lie.\" Of course, counsel has no duty \"to make motions which simply clutter up the record with no benefit to his individual client.\" (In re Lower (1979) 100 Cal. App. 3d 144, 149, fn. 3 [161 Cal. Rptr. 24].)\n\nInstead Ms. Abramson, in August 1988, filed with the trial court a petition for habeas corpus. The petition was denied.\n\nWe find appellant's contention without merit.\n\n5. The trial court was under a sua sponte duty to order either a new trial or further factual hearings once it learned of Xavier's confession.\n\nAppellant argues that when Ms. Abramson informed the court that appellant's brother, Xavier Sanders, had confessed to shooting the victim, the court on its own motion should have ordered a new trial.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Penal Code section 1181 does not confer such authority upon the trial court. It provides that \"[w]hen a verdict has been rendered or a finding made against the defendant, the court may, upon his application, grant a new trial. . . .\" Thus, appellant not having made a motion for new trial, the court was without authority to grant one. (People v. Rothrock (1936) 8 Cal. 2d 21, 24 [63 P.2d 807]; People v. Lewis (1977) 75 Cal. App. 3d 513, 520 [142 Cal. Rptr. 218]; People v. Thompson (1970) 10 Cal. App. 3d 129, 135 [88 Cal. Rptr. 753].)\n\nAlternatively, appellant urges that the trial court \"at the very least [should have] order[ed] an evidentiary hearing in support of a sua sponte new trial motion.\" But holding an evidentiary hearing would not have supplied authority absent before the hearing. No purpose would have been\n\nserved by such a hearing, and appellant fails to cite any authority in support of it. Moreover, the trial court having no reason to doubt that appellant was being competently represented by experienced counsel, Ms. Abramson, it would have been officious and inappropriate for the court to have abandoned its impartial function in favor of an adversary one.\n\nWe find no error.\n\nThe Habeas Corpus Proceeding\n\nIn his habeas corpus petition appellant summarizes his denial-of-effective-assistance-of-trial-counsel claim as follows: \"Prior to commencement of Petitioner's second trial\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e on the murder charge for which he is now incarcerated, his trial counsel, Phillip Jefferson, was repeatedly told by Petitioner's mother, Regina Sanders, and by Petitioner himself, that Petitioner's brother, Xavier Sanders, not Petitioner, fired the shot that resulted in the death of the victim. Mr. Jefferson also knew or should have known that contained in the police reports in his possession were early statements from some of the eyewitnesses identifying Xavier Sanders, by his nickname 'Zuba,' as the shooter.\n\n\"Mr. Jefferson failed to investigate or exploit the issue of Xavier's guilt, refused to interview Xavier, and refused to call Xavier to testify at Petitioner's trial even though he was told by Petitioner's mother that Xavier was willing to testify truthfully to his own culpability.\n\n\"Xavier Sanders at all times before and during Petitioner's trial was ready, willing and able to testify that he was the perpetrator of the acts resulting in the death of the victim.\n\n\"Petitioner contends that counsel's failings herein were not for any strategic or tactical reasons, but were because of inadvertance or ineffectiveness. These actions individually and cumulatively resulted in withdrawing a potentially meritorious defense that went to the very heart of the prosecution's case and prejudiced Petitioner in that it is reasonably probable that a more favorable result would have occurred but for counsel's failings.\"\n\nAfter consolidating appellant's appeal and habeas corpus petition we issued an order of reference to the Los Angeles County Superior Court for the purpose of taking evidence and making findings of fact relative to appellant's allegations of counsel incompetency. The reference hearing was\n\nassigned to Superior Court Judge Madge S. Watai. Judge Watai had presided over the second trial and thereafter had received, considered, and ruled upon appellant's petition for writ of habeas corpus and/or coram nobis. She appointed Attorney Rowan Klein to represent appellant at the evidentiary hearing. At appellant's request Judge Watai also appointed an investigator and an expert witness, Attorney Paul Fitzgerald, to assist Mr. Klein.\n\nThe reference hearing was held on October 27, 1989. Six witnesses testified: Xavier Sanders, who was represented by counsel; Mark Bledstein, appellant's attorney at the first trial; Leslie Abramson, appellant's attorney at the sentencing hearing; Regina Sanders, appellant's mother; Edward J. Sanchez, appellant's investigator; and Paul Fitzgerald, an attorney and expert witness.\n\nXavier Sanders testified that he, appellant, and Kelvin Sanders drove his sister's BMW to the Gregory home and that he took the rifle out of the car trunk. When asked questions about what he then did he refused to answer, asserting his privilege against self-incrimination.\n\nMark Bledstein testified that before the first trial Xavier Sanders told him that he had fired the rifle which killed Norman Gregory.\n\nAs Judge Watai summarized it, Leslie Abramson testified:\n\n\"Attorney Leslie Abramson was retained by the Sanders family to represent Petitioner in his quest for a new trial.\n\n\"Testified that file received from attorney Philip Jefferson consisted of preliminary hearing transcript and police reports only. There were no investigator's report or notes.\n\n\"That in response to her inquiry, Philip Jefferson stated that he did not need transcript from first trial because he could use the police reports to impeach the witnesses.\n\n\"In response to her inquiry, Mr. Jefferson stated that he was aware that Xavier Sanders said that he shot Norman Gregory, but that he did not use Xavier because he felt that he could prove that Xavier was the shooter by using the police reports containing statements of the witnesses.\n\n\"That he, Jefferson, felt that he was representing the family.\n\n\"That she, Leslie Abramson, witnessed Xavier Sanders sign and acknowledge his declaration attached to the Petition for Writ of Habeas Corpus.\"\n\nAppellant's mother, Regina Sanders, testified that Mr. Jefferson refused to speak to Xavier Sanders and when Xavier appeared at the trial court-room told him to leave.\n\nEdward Sanchez authenticated two exhibits, a tape of a recorded interview of Xavier Sanders by Rowan Klein, and the transcript of that recording.\n\nPaul Fitzgerald, as described by Judge Watai, testified.\n\n\"That Philip Jefferson should have filed a formal discovery motion;\n\n\"That Jefferson should have obtained a transcript of the first trial for impeachment purposes and for evidentiary information;\n\n\"That Jefferson should have hired a private investigator to interview witnesses and identify witnesses;\n\n\"That he should have had an expert on ballistics, expert on eyewitness identification and a forensic pathologist;\n\n\"That he should not have used defense of 'shot from inside the house' because it turned out to be not a viable defense when prosecution rebutted with an expert;\n\n\"That Jefferson should have used defense of mistaken identification;\n\n\"That Xavier Sanders should have been called to testify and upon his exercise of his right against self-incrimination, his statements to others would be admissible as a declaration against penal interest;\n\n\"That in his opinion, there is a likelihood that a result more favorable to Sheldon would have followed if above action had occurred.\"\n\nStandard of review: denial of effective assistance of counsel\n\nA claim of denial of effective assistance of counsel has two components. \"First, [appellant] must show that counsel's performance was deficient; specifically, he must establish that counsel's representation fell below an objective standard of reasonableness under prevailing professional norms. Second, he must establish prejudice. He must show that there is a reasonable probability that, but for counsel's unprofessional errors, the result would have been different. A reasonable probability is a probability sufficient to undermine confidence in the outcome [citations]. Defendant\n\nhas the burden of proving an ineffective assistance claim by a preponderance of the evidence [citation].\" (People v. Plager (1987) 196 Cal. App. 3d 1537, 1542-1543 [242 Cal. Rptr. 624].)\n\nCounsel, to be effective, must investigate all factual and legal defenses. If counsel's failure to do so causes the withdrawal of a potentially meritorious defense, a defendant has been denied effective assistance of counsel. (People v. Pope (1979) 23 Cal. 3d 412, 424-425 [152 Cal. Rptr. 732, 590 P.2d 859, 2 A.L.R.4th 1].)\n\nBut in reviewing defense counsel's trial tactics courts must be cautious. \"It is all too tempting for a defendant to second guess counsel's assistance after conviction or adverse sentence, and it is all too easy for a court, examining counsel's defense after it has proved unsuccessful, to conclude that a particular act or omission of counsel was unreasonable.\" (Strickland v. Washington (1984) 466 U.S. 668, 689 [80 L.Ed.2d 674, 694, 104 S.Ct. 2052].)\n\nStandard of review: referee's findings and conclusions\n\nOur standards in reviewing the findings of a reference hearing referee are settled. \"A referee's legal conclusions are subject to independent review. [Citation.] As to findings of fact, they 'are, of course, not binding on this court, and we may reach a different conclusion on an independent examination of the evidence produced at the hearing [s]he conducts even where the evidence is conflicting. [Citation.] However, where the findings are supported by \"ample, credible evidence\" [citation] or \"substantial evidence\" [citation] they are entitled to great weight [citations] because of the referee's opportunity to observe the demeanor of the witnesses and weigh their statements in connection with their manner on the stand . . . .' [Citations.] Finally, a referee's resolution of mixed law-fact questions is generally subject to independent review as predominantly questions of law -- especially so when constitutional rights are implicated. [Citation.] Such questions include the ultimate issue, whether assistance was effective, and its components, whether counsel's performance was inadequate and whether such inadequacy prejudiced the defense. [Citation.]\" (People v. Ledesma (1987) 43 Cal. 3d 171, 219 [233 Cal. Rptr. 404, 729 P.2d 839].)\n\nDiscussion\n\nWe have read the reference hearing transcript, considered the exhibits, and of course, studied the record on appeal with its 1422 pages of transcript, and conclude that the findings of the reference hearing referee are supported by substantial, credible evidence. We adopt them:\n\n\"Findings\n\n\"1. Court finds that the incompetency of counsel allegations are speculative in that the evidentiary hearing did not produce tangible evidence that:\n\n\"a. Critical impeachment was omitted due to lack of trial transcript;\n\n\"b. Critical evidence was not discovered because of lack of an investigator;\n\n\"c. Witnesses were called to testify without first being interviewed;\n\n\"d. There were grounds to attack the warrants;\n\n\"e. That the prosecution withheld evidence because no formal discovery filed;\n\n\"f. That lack of photographs in file was prejudicial to Petitioner;\n\n\"g. That the lack of experts was detrimental to the Petitioner.\n\n\"2. Court further finds that Xavier Sanders, if called, would have exercised his right against self-incrimination and would have been declared unavailable.\n\n\"Further Petitioner's argument that Xavier's statement would be admissible as a declaration against penal interest is not necessarily meritorious. His statement that Sheldon and Kelvin was [ sic ] with him at the Gregory residence along with other evidence would implicate Petitioner as a principal in the crime and negate his alibi defense. His declaration that he shot at the car and then shot in the air would not be against his penal interest. (As in the case of People vs. Chapman, 50 Cal. App. 3d 872, there is also a question of trustworthiness to be considered.\n\n\"3. Court further finds, upon an independent review of the records that attorney Philip Jefferson pursued alternative defenses but they were not incompatible defenses:\n\n\"a. That defendant was mistakenly identified and substantiated this with an alibi witness.\n\n\"b. Or that Norman was shot by someone inside the house based on the nature of the wound.\n\n\"4. Court further finds that an expert on eye witness identification would not have been very effective in view of identification by family members.\n\n\"5. Court finds further upon review of the transcripts that Philip Jefferson cross-examined prosecution witnesses extensively and effectively with a clear direction of his defenses.\n\n\"6. Court does not find that there is a likelihood that a result more favorable to Petitioner would have followed.\"\n\nResponse to Dissent\n\nThe dissent thinks \"it important to retell the story in a somewhat different fashion.\"\n\nWe think it more important not to misstate or distort the record, sins repeatedly committed by the dissent. For example, it states trial counsel Philip Jefferson \"had left the state,\" an assertion without basis in the record. It describes Mr. Jefferson's state bar status, an irrelevancy,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e again without evidentiary support in the record. It omits the inculpatory colloquy between the victim and his murderer. It creates the impression that eyewitness Darryl Anderson, when first interviewed by the police, said the shooter was \"Zuba\" (i.e., Xavier), when in fact he identified the shooter as \"Kake,\" appellant. It states as a fact that the person who best knew both appellant and his brother Xavier, Raynetta Sanders, \"originally told the police the shooter was Xavier not the petitioner.\" This is a \"fact\" which the dissent creates in violation of all appellate standards of review. Ms. Sanders testified that appellant was the shooter and that she told the Compton police officer that appellant was the shooter. The dissent utterly censors her testimony and instead transforms into \"fact\" the contrary testimony of an officer who chased the crying and hysterical Ms. Sanders for a block, immediately after she saw her brother shot and dying from a four-inch hole in his head, who interviewed her for three to five minutes, claimed to have taken but destroyed handwritten notes, and to have obtained from Ms. Sanders the full, accurate license number of the BMW getaway car, although his department's files contained a computer printout with that license number!\n\nIt omits that Ms. Sanders not only positively identified appellant as the shooter but described how he was dressed, down to his white Fila boatmoc shoes. It omits that she was equally detailed in describing Xavier, who remained in the BMW on the passenger side wearing a beige button-down-the-front shirt.\n\nThe dissent also omits from its retelling Terrell Gregory's testimony that about 25 minutes before the shooting he overheard one of Kelvin's phone conversations to Raynetta and heard appellant, also on the phone with Kelvin, say: \"I'll get you back. I'm going to get revenge. It's not over.\" And he then heard Kelvin yell: \"Kake [appellant] get off the phone.\"\n\nIt includes that eyewitness William Thomas told the police the shooter was \"Kake\" (appellant) but omits his corroborative description of appellant, 5 feet 7 to 8 inches tall and weighing between 100-125 pounds (Xavier, as described by Ms. Sanders, was 6 feet 2 inches tall and weighed about 180 pounds). It includes that William Thomas later told the police \"he was not sure\" but omits his testimony that, in fact, he was sure and only told the police he wasn't because he didn't want to get involved. It includes the half-truth that expert witness Mr. Fitzgerald at first testified there was no plausible explanation for not offering \"Xavier's confession\" and omits the full truth that he then testified it \" would be a reasonable tactical decision not to present that evidence\" if the defense attorney had determined it was untrue.\n\nFailure to Secure Transcript of First Trial\n\nOne of the legs supporting the dissent's conclusion of ineffective assistance of trial counsel is that \"Jefferson (trial counsel) failed to secure a transcript of the first trial.\"\n\nThe impression given by the wording of this claim is that the first trial transcript was just sitting around someplace, like on the desk of Mr. Bledstein, appellant's lawyer at the first trial, and that Mr. Jefferson was too lazy, or too indifferent, or too incompetent to even ask for it. Of course, as the dissent fails to state, Mr. Jefferson didn't \"secure a transcript of the first trial\" because there was no transcript to secure. It hadn't been prepared and didn't exist. (See fn. 10.) Mr. Jefferson would have had to privately order one from the court reporter, or request the trial judge to do so, which request may well have been denied.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nThe dissent totally ignores even the existence of this decision, whether or not to privately order the transcript of the first trial. Known to\n\nevery experienced criminal defense attorney, if not to the dissent, are the delicate advantages and disadvantages of such an order. First, there is the expense, hundreds if not thousands of dollars, depending upon its length, borne by the client, or in this case by his family. Second, there is delay. Reporters spend their days in court, reporting ongoing trials, and have only evenings and weekends to dictate for transcription already concluded trials. All reporters are backlogged. Months of delay are common. Third, ordering a transcript for the defense means a copy will be available for the prosecution. Fourth, such an order risks alerting and arousing the prosecution from what might otherwise be bureaucratic \"business-as-usual\" case handling. Fifth, an assessment of need. Here there was little or none. The first trial was brief, lasting only three or four days, and appellant, other family members, and Mr. Bledstein were all percipient observers available to brief Mr. Jefferson. Additionally, Mr. Jefferson had all the police reports and witness statements plus the transcript of the preliminary hearing.\n\nThe record is bereft of reason to question Mr. Jefferson's decision not to order a transcript of the first trial.\n\nThe dissent, knowing it must identify prejudice, not merely dereliction, strains to find some. First it looks to trial inconsistency and states: \"Thus he (Mr. Jefferson) could not take advantage of inconsistent statements between the testimony of the five eyewitnesses at the first trial and their testimony at the second trial.\"\n\nWhat inconsistent statements?\n\nSince a transcript of the first trial was later prepared and introduced at the evidentiary hearing, (as was, of course, one of the second trial) and studied by appellant's third attorney, privately retained criminal defense specialist, Ms. Leslie Abramson, fourth attorney, criminal defense specialist Mr. Rowan Klein, and fifth attorney, defense witness at the evidentiary hearing, Mr. Paul Fitzgerald, it is notable that the dissent fails to specify a single such inconsistent statement.\n\nSecond, still straining to find prejudice, the dissent squints at physical evidence. It states: \"Nor did the case file reflect Jefferson informed himself about physical evidence used in the first trial.\"\n\nOne might more sensibly ask why the 52-page dissent fails to reflect the basis for its assumption that case files of criminal defense attorneys memorialize such information. Or why the dissent fails to reflect what this physical evidence was. Or how not informing himself about it, assuming he did not, had any bearing on the second trial.\n\nThis balloon of dissent speculation is punctured by reality. The only physical evidence at the first trial was a set of photographs and an autopsy report. The autopsy report was also an exhibit at the second trial and, as demonstrated by the 33 pages of cross- and recross-examination of its author, Mr. Jefferson was minutely familiar with it. As to the photographs, it would take but a moment to look at them. And as the 1,422-page trial record repeatedly indicates, no prosecution exhibit was admitted, let alone shown to a witness, without Mr. Jefferson's prior scrutiny.\n\nThird, in its final effort at discovering prejudice, the dissent states: \"A transcript would also have informed Jefferson about the court's prior rulings, instructions given and the prosecution's theory of the case through opening and closing statements.\"\n\nOf course, the dissent fails to specify a single \"prior ruling\" that, had Mr. Jefferson known of, would have been helpful. Nor a single instruction. Nor a single theory of the case.\n\nThe transparent triviality of its argument, more befitting a first-year law school student aflush with issue spotting passion, is laid bare by the fact that Judge LaFont presided over the first trial and Judge Watai over the second. Not only are trial rulings without binding effect but when made by a different trial judge fail to provide even predictive assistance. The same, of course, is true of jury instructions. As to becoming informed \"of the prosecution's theory of the case\" -- just what is the dissent talking about? Was there a question, an alternative, a doubt, a mystery about \"the prosecution theory?\" What was the prosecution going to do, claim that appellant poisoned the deceased?\n\nIf the dissent has discovered some other possible \"prosecution theory of the case,\" it has failed to share its discovery with us.\n\nFailure to Hire a Private Investigator, Ballistics Expert, etc.\n\nThe dissent mentions, although without much enthusiasm, that \"Jefferson allegedly failed to hire a private investigator to interview witnesses and gather evidence from the scene; failed to hire a ballistic expert; and, failed to familiarize himself with crime scene photos and other physical evidence.\"\n\nThis argument may be expeditiously and mercifully put to rest.\n\nFirst, as the dissent concedes, the record simply fails to establish that Jefferson failed to hire a private investigator or ballistics\n\nexpert. (As the dissent puts it, \"Jefferson's absence made it impossible to discover what he actually did or did not do.\")\n\nSecond, even if no such experts were hired (and, of course, there is no presumptive duty to hire them), the dissent fails to establish prejudice.\n\nThird, the record affirmatively demonstrates that Mr. Jefferson had interviewed his witnesses (e.g., this cross-examination of defense witness Calvin Sanders: \"Q. Mr. Sanders, before you took the stand yesterday, who did you talk to about your testimony in this case? [para.] A. Mr. Jefferson and my family. [para.] Q. Okay. You went over pretty much what you would say with Mr. Jefferson; is that correct? [para.] A. Yes, sir.\"), had investigated prosecution witnesses (e.g., David Gregory's possible bias against appellant as elicited by this cross-examination of him: \"Q. When he [appellant] was at your niece's birthday party, did you threaten him and make him leave the niece's birthday party; is that correct? [para.] A. Yes.\"), and had inspected the scene (among the 24 trial exhibits presented by Mr. Jefferson many were photographs and/or diagrams of the scene).\n\nConflict of Interest\n\nThe dissent concludes that Mr. Jefferson was involved in a conflict of interest. The first basis for its conclusion is a snippet from a brief telephone conversation between Mr. Jefferson and appellant's newly hired lawyer, Ms. Abramson, who was then engaged in trying to prove Mr. Jefferson's representation of appellant was inadequate and entitled appellant to a new trial. According to Ms. Abramson's recollection (the dissent fails to mention whether her files reflect any contemporaneous note-taking) Mr. Jefferson said he was representing \"the family.\" The other basis, the dissent states, is \"Xavier's statement he was shooed away from the courthouse\" by Mr. Jefferson.\n\nThe dissent evades, apparently intentionally, the possibility Mr. Jefferson might have had a legitimate reason for shooing Xavier away from the courthouse. Intentionally evades because the dissent refers to the prosecution's question about Xavier's \"confession\" being perjurious, a question asked of defense expert Mr. Fitzgerald, but instead of then giving Mr. Fitzgerald's answer to that question it instead summarizes an earlier answer, given before the subject of perjury was broached. Thus, reading from the dissent one is utterly misled into believing the matter was then, and is now, closed. This is the distorted dissent version: \"The prosecution speculated the reason Mr. Jefferson excluded Xavier's testimony was because it was perjurious, or in the alternative, because Mr. Jefferson anticipated Xavier would take the Fifth Amendment in the second trial as well. The\n\ncourt-appointed criminal law expert, Mr. Fitzgerald, testified there was no plausible explanation whatever not to offer as evidence the best defense available to one's client -- someone else's confession to the shooting.\"\n\nIn fact, the matter was not and is not closed. This is the prosecutor's question and this is Mr. Fitzgerald's answer to that question:\n\n\"Q. Along those lines, what if he determined that wasn't true about Xavier and that he was dealing with perjury?\n\n\"A. Then it would be -- that would be a reasonable tactical decision not to present that evidence, and I think the lawyer is duty bound not to present it if he determines that there is a very reasonable likelihood this is perjured testimony.\"\n\nHaving taken its evasive tack, the dissent fails to consider what reasons Mr. Jefferson might have had for telling Xavier to leave the courthouse. For example, if Xavier remained for jurors to casually observe or for the prosecution, noticing him present, to formally identify for the jury, much damage to appellant's \"mistaken identity\" defense might have resulted. Although witnesses, such as Ms. Sanders, used words to contrast appellant's height of 5'9\" with Xavier's 6'2\", and appellant's slight 130 pounds with Xavier's sturdy 180 pounds, the impact of having appellant and Xavier stand before the jury, side by side, could have been devastating.\n\nThis consideration, just one of many, may have prompted Mr. Jefferson's conduct and is ignored by the dissent.\n\nWe postpone for later discussion a consideration of why Mr. Jefferson may have chosen not to call Xavier as a witness.\n\nConcerning the other basis, the proposition borders on the absurd. Mr. Jefferson, who, unlike appellant's first attorney, Mr. Bledstein, never represented Xavier, never received funds from Xavier, never was willing to interview Xavier, and didn't permit Xavier to observe his brother's trial was at the same time supposedly representing Xavier's interest in derogation of appellant's interest.\n\nThe contradictions of this dissent proposition do not end there. Xavier is portrayed by the dissent as always willing and eager to tell the truth and take the consequences. This avowed posture is absolutely congruent with the posture of the rest of the family. The family fired Mr. Bledstein because he didn't call Xavier and Kelvin Sanders as witnesses at the first trial. The family hired Mr. Jefferson so that Xavier and Kelvin would be called as\n\nwitnesses at the second trial. The family told Mr. Jefferson that Xavier, not appellant, was the shooter and that they wanted the truth brought out at the trial.\n\nThere simply was nothing to create a conflict about.\n\nFinally, again omitted by the dissent, in the words of appellant's expert criminal defense witness, Mr. Fitzgerald, on cross-examination:\n\n\"Q. And you are not aware of any pressure by the people who retained Mr. Jefferson to exonerate Xavier at the expense of Sheldon or do anything?\n\n\"A. [Fitzgerald] No. I think I was aware of some pressure to the contrary, or at least I am unclear. But at least certainly there was no pressure to withhold testimony about Xavier.\n\n\"Q. To the detriment of Sheldon?\n\n\"A. [Fitzgerald] No, right. You're quite correct.\"\n\nFailure to interview Xavier, obtain a statement from him, and call him as a witness.\n\nThe related alleged failings of Mr. Jefferson which the dissent finds \"egregious\" are his failure to interview Xavier, to obtain a statement from him, and to call him as a witness.\n\nThe dissent argues that without interviewing Xavier, Mr. Jefferson's decision not to call him as a witness could not have been an informed one.\n\nWe disagree. Mr. Jefferson, without interviewing Xavier, knew that Xavier claimed to have done the shooting. In Mrs. Sanders's declaration she stated, \"Numerous times before the second trial, I told Mr. Jefferson the truth about Xavier's involvement and that we wanted him to put Xavier on the stand.\" Further, Ms. Abramson (appellant's third lawyer) testified that she \"asked him [Mr. Jefferson] if he knew that Xavier Sanders was the shooter. He said yes, he knew that. He had been told, that is what he said.\"\n\nSimilarly without merit is the belabored point that Mr. Jefferson should have attempted to obtain a written statement from Xavier or, failing that, searched for witnesses who could testify to his declarations against penal interest (i.e., that he had told them he was the shooter).\n\nThere are several observations to make. First, Mr. Jefferson was not the first of appellant's lawyers not to obtain (or at least to attempt to use) a written statement from Xavier. Mr. Bledstein, a criminal defense specialist for 15 years, the lawyer who defended appellant at his first trial, did not offer any such statement after Xavier asserted his privilege against self-incrimination and became unavailable. Nor did Mr. Bledstein call a witness to testify to Xavier's declaration against interest. This despite the fact that he had available Xavier's mother and father both of whom, according to Mrs. Sanders's declaration, could have so testified.\n\nThat Mr. Bledstein also chose not to introduce Xavier's extrajudicial statements suggests neither coincidence nor dereliction but purpose.\n\nSecond, there is little doubt Mr. Jefferson could have, and knew he could have, obtained a statement from Xavier. What such a statement might have said and what its value might have been is another matter. To illustrate this dubious matter we briefly compare the three statements Xavier did make: his June 21, 1988, declaration prepared by appellant's third attorney, Ms. Abramson (No. 1 statement), the transcription of his June 30, 1989, interview by appellant's fourth attorney, Mr. Rowan Klein (No. 2 statement), and the transcript of his October 27, 1989, abortive testimony at the evidentiary hearing (No. 3 statement).\n\nNo. 1 statement: \"On my own I had decided to just go to the Gregory home and break the windows out of one of their cars. I intended to do it with a bumper jack. . . . [para.] I opened the trunk to get the bumper jack, saw the gun and decided to shoot out the windows on one of the Gregory cars instead.\"\n\nNo. 2 statement: \"Then I got in the car and then him [appellant] and Ke[l]vin jumped in the car.\n\n\"Q. And before you got in the car, was there any discussion about doing something?\n\n\"A. No. There wasn't none. I had a gun in the car, though, ready. . . .\n\n\"Q. Was there any discussion about calling the police?\n\n\"A. On the way there I said I was gonna call the cops and police and have them come out and arrest that boy.\n\n\"Q. And did you stop and call before you went over there?\n\n\"A. No.\n\n\"Q. Did anybody say to stop and call as you were driving over there?\n\n\"A. Ke[l]vin and Shelly [appellant] said 'I thought you was gonna call the police' and I said no, I'm was gonna [ sic ] shoot their car window out.\"\n\nNo. 3 statement:\n\n\"Q. Why did you go to the Gregory home?\n\nWhy did you drive to the Gregory home?\n\n\"A. Just drove there.\n\n\"Q. What's the reason for it?\n\n\"A. It's just -- there was no reason. It's just --\n\n\"Q. Were you mad?\n\n\"A. No, I wasn't mad.\n\n\"Q. Did you go there with the intent to use your rifle?\n\n\"A. No, I didn't.\n\n\"Q. Did you go there to beat somebody up?\n\n\"A. No, I didn't.\n\n\"Q. Weren't you mad that your brother had been hit by one of the Gregory's?\n\n\"A. No, I wasn't.\n\n\"Q. Were you pretty calm?\n\n\"A. Yes.\"\n\nPutting aside the irreconcilable inconsistencies between these three statements, two of them under oath, and assuming that some such statement might have been admitted at appellant's trial or alternatively and even more doubtfully, that if called Xavier would actually have testified at appellant's second trial (although he refused to do so at the first trial and again at the evidentiary hearing, after there giving only token testimony) -- we now consider some of the factors which may have affected Mr. Jefferson's decision to neither call Xavier as a witness nor introduce his extrajudicial statements.\n\nThe essence of Xavier's statements is this: he drove to the victim's house with appellant and Kelvin; he got out of the car but appellant and Kelvin remained inside; he opened the car trunk and removed a rifle; he walked towards the Gregory driveway; he fired one shot hitting the window of a car parked in that driveway; he fired a second shot up in the air towards the doorway; he returned to the car and drove the three of them away.\n\nThe fundamental question is: would any competent attorney have sought admittance of Xavier's \"statement\"? If the answer is yes and \"there simply could be no satisfactory explanation\" (People v. Farmer, supra, 47 Cal. 3d 888, 916) for a failure to do so, and prejudice is shown, then appellant has been denied effective assistance of counsel. But it is appellant's burden, by a preponderance of the evidence (People v. Plager, supra, 196 Cal. App. 3d 1537, 1543), to demonstrate this fact.\n\nConversely, if there could be a satisfactory explanation for not seeking admittance of Xavier's statement, then appellant has not met his burden of proof and his petition should be denied.\n\nThus, the only way to answer this fundamental question is to consider whether or not there is a \"satisfactory explanation\" for not seeking admittance of Xavier's \"statement.\" We now consider such possible explanations.\n\nAbandonment of Alibi\n\nXavier's account pinned appellant to the scene at the time of the murder and obliterated appellant's alibi. Mr. Jefferson would have had to abandon a complete alibi defense supported by three witnesses: Michael Henderson, Calvin Sanders, and Calvin Sanders, Jr.\n\nAbandonment of Inside-shot Theory\n\nXavier's account eliminated the inside-shot theory, another complete defense. This defense was based upon the victim facing the shooter at the time of the fatal shot (a fact testified to by every percipient prosecution witness) but the victim being shot in back of the neck. It was further supported by the testimony of some witnesses that three shots were fired but only two rifle casings recovered.\n\nRecently Manufactured Evidence Impeachment\n\nThe prosecutor would have called appellant's first trial alibi witnesses, Mr. Henderson, Mr. Sanders (appellant's father), and Kelvin Sanders. If in the teeth of Xavier's story they maintained that appellant was with them and not at the murder scene, then Xavier's confession is destroyed. So is appellant's fate. If, on the other hand, they retract their alibi, surely being forced to admit it was unsuccessful at the first trial, they inevitably expose the willingness of appellant's family to commit perjury for him.\n\nThe unsuccessfulness of the alibi at the first trial, in combination with the inevitable revelation that Xavier did not choose to testify at the first trial, creates the damning odor of recently manufactured evidence.\n\nGeneration of Absolute-Identification Evidence\n\nXavier being absent from the second trial, the eyewitness merely identified appellant as the shooter. With Xavier present and testifying he was the shooter, there would have been a drum beat parade with every eyewitness positively identifying appellant and positively eliminating Xavier as the shooter. All the initial semantic confusion of \"Zuba\" and \"Kake,\" significant impeachment at the second trial, would disappear like a puff of smoke in a tornado.\n\nThe Dogs That Did Not Bark\n\nTo offer Xavier's \"I was with appellant and Kelvin when I did the shooting\" version is to irresistibly cause jurors to ask themselves: why isn't Kelvin testifying to this? Why didn't Kelvin testify to this at the first trial? And, jury instructions notwithstanding, why isn't appellant testifying to his own innocence if Xavier is telling the truth?\n\nXavier's \"Confession\" Is Not Credible Because It Is Not Inculpatory\n\nIf you know your confession can convict you it is, for that reason, against your penal interest and credible. If you know your confession cannot convict you it is, for that reason, not against your penal interest and not credible.\n\nFor example, if on January 1, 1990, Charlie Fessup was in New York with a bishop, a rabbi, and a minister, all televised in an all-day prayer session, his confession to a January 1, 1990, noontime stabbing in Los Angeles is not against his penal interest and is not credible. Charlie Fessup knows his confession cannot convict him because contrary evidence refutes it.\n\nFor the same reason, Xavier's \"confession\" was not against his penal interest and was not credible because he knew -- and the jury would be so informed -- that it could never result in his conviction. He had available five eyewitnesses who had twice testified that he was innocent and that appellant was guilty. Further, he had a trump card: retraction. \"I was only trying to help my little brother\" -- who could fail to understand and believe him?\n\nThus, another's confession, always triumphant on Perry Mason, had bleak prospects for appellant.\n\nXavier Guilty and Appellant Guilty\n\nNot only would Xavier's version destroy all of appellant's other defenses, but even if believed it might still result in appellant's conviction.\n\nIf the jury believed that Xavier fired the fatal shot but that appellant abetted him to do so, then appellant will be convicted.\n\nThere is substantial evidence that could constitute such abetting: appellant and the victim did not get along; the victim punched appellant without provocation; appellant tried to run his car over the victim; when he was unsuccessful appellant said, \" We'll be back. We're going to get you\n\nmotherfuckers\"; appellant, over the phone, about 25 minutes before the shooting said, \"I'll get you back. I'm going to get revenge. It's not over\"; appellant promptly returned to the scene with his two brothers; the victim was shot to death. (Italics added.)\n\nXavier's Confession Is Inconsistent With the Evidence\n\nXavier, in his various statements, asserted he got out of the car, walked to the rear, opened the trunk, and removed the rifle.\n\nEvery witness who saw the driver exit testified he did so carrying a gun. No witness testified the driver went to the trunk, etc.\n\nXavier stated he walked towards the driveway, shot a car window, shot in the general direction of the house, and left. According to Xavier's version he was mute. He never even saw let alone talked to anyone in the Gregory doorway.\n\nMultiple witnesses described the driver as walking towards the driveway and saying such things as: \"Come out now motherfuckers. Come out now.\" Or: \"Where are all you guys now. I'll kill you motherfuckers.\" (Italics added.)\n\nA Duty Not to Introduce Perjured Evidence\n\nMr. Jefferson, who had the benefit of confidentially interviewing appellant, and certainly of talking to Kelvin Sanders, not only decided to call neither as a witness but may have determined that Xavier's account was false. Having so determined, as Mr. Fitzgerald testified, he was \"duty bound not to present it.\"\n\nAs the United States Supreme Court has recently stated, \"the right to counsel includes no right to have a lawyer who will cooperate with planned perjury. A lawyer who would so cooperate would be at risk of prosecution for suborning perjury. . . .\" (Nix v. Whiteside (1986) 475 U.S. 157, 173 [89 L.Ed.2d 123, 139, 106 S.Ct. 988].)\n\nConsidering these nine explanations, we conclude that appellant has not met his burden of proof.\n\nMore importantly, after extraordinary care to hear and weigh every error claimed by petitioner, we are satisfied that justice has been done.\n\nThe petition is denied and the judgment is affirmed.\n\nDisposition\n\nThe petition is denied and the judgment is affirmed.\n\nJOHNSON, J.\n\nI respectfully yet strongly dissent. This is not one of the typical cases where the issue on appeal is whether a guilty man should be let free because he was convicted through illegally obtained evidence. Nor is it a case where the error asserted on appeal would only serve to reduce the prosecution's evidence of appellant's guilt to something less than proof beyond a reasonable doubt. No, this is one of those rather rare cases where if the alleged error was committed it goes to the core issue of the defendant's innocence of the crime for which he was convicted. Innocence, not just in the sense the prosecution failed to prove him guilty. But innocence in the full sense of the term -- he did not commit that crime, someone else did.\n\nI am not certain the full flavor of this case is captured in the majority's statement of facts. Following what I acknowledge are accepted and appropriate standards, the majority tells the story of the murder with the appellant unequivocally cast in the role of the murderer. In this unusual case, however, I do think it important to retell the story in a somewhat different fashion, incorporating some of the defense evidence as well as the People's evidence in the chronology. This will make it easier to evaluate whether petitioner's counsel rendered ineffective assistance and, if so, whether that ineffective assistance prejudiced appellant's opportunity for a different outcome in this second trial.\n\nOn the morning of July 11, 1985, Kelvin Sanders was at the home of his estranged wife, Raynetta (Gregory) Sanders. At approximately 10 a.m., petitioner, Kelvin's brother, arrived to pick up Kelvin. Petitioner drove a burgundy BMW which belonged to his sister Sheree but which Xavier, another brother, often drove.\n\nAs Kelvin and petitioner prepared to leave in the BMW, two of Raynetta's younger brothers, Norman and David Gregory, both beat petitioner with their fists without apparent provocation. Petitioner then drove the BMW in a way allegedly designed to hit Norman and David, although it did not. Norman and David picked up some rocks, threw them at the car and cracked the windshield.\n\nA few minutes later, another Sanders brother, Calvin, Jr., came to the Gregory house to pick up Kelvin. Upon learning petitioner had already picked up Kelvin, Calvin, Jr., left.\n\nShortly thereafter, Raynetta received two telephone calls in quick succession from Kelvin, each lasting a few minutes. Apparently at his suggestion, she dressed her children and went next door. Raynetta estimated one-half hour passed from the time petitioner left the Gregory residence and the time\n\nshe went next door. Approximately 20 minutes later Raynetta heard a loud \"bang\" outside and ran out of her neighbor's house and into the street.\n\nFrom within the Gregory house, Norman, David and Terrell Gregory, along with their friends, William Thomas and Darryl Anderson, ran to the front door. All five of them crowded around the doorway. The wooden front door was open and they looked out through a door composed of heavy iron mesh screen and thick steel bars.\n\nIn the street outside the Gregory house they saw someone with a rifle. The witnesses in the doorway differed whether the man fired two or three shots. But they agreed the shot fired at the house hit one of them, Norman Gregory. Norman died a few days later as a result of that gunshot wound.\n\nWhen interviewed by the police two of the four survivors who had watched through the screen door -- Terrell Gregory and Darryl Anderson -- identified the man holding the rifle as \"Zuba,\" a nickname for petitioner's brother, Xavier. Another, David Gregory, testified at the preliminary hearing he wasn't sure whether he saw Xavier. The fourth, William Thomas, first told the police the shooter was \"Kake,\" a nickname for petitioner, but later told police he was not sure.\n\nMeantime, Raynetta Sanders had an unobstructed view of the shooter from the street outside her neighbor's property and was sister-in-law to both petitioner and Xavier, so presumably knew them best. Ms. Sanders also originally told the police the shooter was Xavier, not the petitioner.\n\nThus, three of the five eyewitnesses, including the one with the best view and knowledge of the Sanders brothers, identified Xavier, not petitioner, as the man with the rifle who fired the shot that killed Norman Gregory. A fourth first said it was petitioner then said he was not sure, and the fifth was not sure who it was. (By the time of trial, however, all five of these witnesses had changed their stories and identified petitioner as the shooter.)\n\nPetitioner was arrested at his parents' home on July 12, 1985. Xavier retained Attorney Mark Bledstein to represent Xavier on the matter of turning himself in to the police. Although told by both Xavier and Kelvin Sanders that Xavier, not petitioner, had fired the fatal shot, Bledstein advised Xavier to assert his Fifth Amendment rights and make no statement to police.\n\nAfter Xavier's release from custody, Bledstein assumed representation of petitioner. While in custody on another matter, Xavier was subpoenaed to petitioner's first trial. Xavier indicated his willingness to testify truthfully\n\nbut upon advice of counsel instead asserted his Fifth Amendment rights and was not allowed to testify. The first trial resulted in a hung jury and a mistrial was declared.\n\nPetitioner's parents then retained Attorney Philip Jefferson to represent petitioner at the second trial. Prior to this trial, Regina Sanders, petitioner's mother, told Jefferson that Xavier, not petitioner, was responsible for the shooting. Xavier himself came to Jefferson's office prepared to explain the details of his responsibility for the shooting but the lawyer refused to talk to him. Later Xavier actually came to the courtroom during petitioner's second trial prepared to testify he had fired the fatal shot but Jefferson instructed him to leave.\n\nThe jury never had the opportunity to hear Xavier's testimony he was the shooter or any of his several out-of-court declarations admitting this fact. In the absence of that evidence, the jurors convicted petitioner of second degree murder.\n\nThe Sanders family then retained Attorney Leslie Abramson to review the record for a possible statutory motion for a new trial based on incompetence of counsel. Abramson determined Jefferson had failed to do many significant things a conscientious defense attorney would have done. Nonetheless, she concluded a statutory motion would not lie based solely on the record. Abramson instead opted to file a petition for habeas corpus based on Jefferson's failure to present evidence of Xavier's confession as the shooter. However, Abramson stated to the referee, \"Based on knowing these three [Sanders brothers], the information that I got from Xavier and my own conversations with my client, I firmly believe that Xavier Sanders, who has a prior record, including possession of a weapon, is the brother who did this shooting.\"\n\nThe trial court (also the referee in the later habeas corpus hearing which is the subject of this opinion) then sentenced petitioner to 17 years to life.\n\nThe petition for habeas corpus was filed based on two independent grounds -- ineffective assistance of counsel at the second trial and newly discovered evidence. The petition was accompanied by Xavier's declaration, signed under penalty of perjury, he was the shooter, as well as petitioner's mother's declaration Xavier confessed to her he was the shooter.\n\nAfter petitioner's appeal and petition were consolidated, this court issued an order of reference for an evidentiary hearing before the referee. The referee appointed Rowan Klein to represent petitioner; a private investigator to assist Klein; and a criminal law expert witness, Mr. Fitzgerald. Other\n\nwitnesses at the hearing included Xavier Sanders, who was represented by counsel; Mark Bledstein, petitioner's counsel at the first trial; Leslie Abramson, petitioner's attorney at the sentencing hearing, and Regina Sanders, the mother of both petitioner and Xavier.\n\nMost significantly Philip Jefferson, the trial counsel whose acts and omissions were in dispute, was unavailable for this habeas corpus hearing. He had left the state after accepting inactive status when the State Bar recommended him for disbarment due to a 10-year pattern of misconduct as an attorney.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nBefore the evidentiary hearing, the lawyer, Rowan Klein, and the investigator interviewed Xavier. In this taped conversation, Xavier again admitted he fired the rifle. Then once again during Xavier's testimony at the evidentiary hearing, he relayed most of the information found in these interviews, statements and declarations but when asked if he fired the gun, he refused to answer asserting his privilege against self-incrimination.\n\nAfter reading the declarations and hearing the testimony at the hearing, the referee made the findings related in the majority opinion and denied the habeas corpus petition.\n\nI. Standard of Review of Ineffective-assistance-of-counsel Claim\n\nThe standards for measuring competency of counsel were enunciated by our Supreme Court in People v. Pope (1979) 23 Cal. 3d 412 [152 Cal. Rptr. 732, 590 P.2d 859, 2 A.L.R.4th 1]. The court instructed that defense counsel in a criminal case \"must perform certain basic duties.\" (Id. at p. 424.) Among them are a duty of \"'diligence and active participation in the full and effective preparation of his client's case' . . .\" and a \"'\"duty to investigate carefully all defenses of fact and of law that may be available to the defendant . . . .\"'\" (Id. at pp. 424-425.)\n\nThe duty to investigate was further elaborated on in People v. Frierson (1979) 25 Cal. 3d 142 [158 Cal. Rptr. 281, 599 P.2d 587]. In commenting on defense counsel's failure to investigate an otherwise obvious diminished capacity defense the court stated, \"By his inaction, deliberate or otherwise, counsel deprived himself of the reasonable bases upon which to reach informed tactical and strategic trial decisions. . . . [para.] . . . [E]ven tactical decisions may demonstrate incompetence if made without the benefit of 'substantial factual inquiry.'\" (Id. at p. 163, original italics.) The court went on to explain: \"'Although counsel's decision not to raise the defense . . . was made for \"tactical\" and \"strategic\" reasons sufficient in counsel's judgment to support it, in the circumstances of this case the failure of counsel to avail himself of information relevant to the defense removed all rational support from that decision. . . . By failing to make any effort at all to follow the lead afforded by information in his possession counsel precluded himself from making a rational decision on the question . . . . [para.] Moreover, the possible defense so withheld must be termed a \"crucial\" one -- especially in view of the insubstantiality of the defense actually offered. [Citations.]'\" (Id. at pp. 162-163, original italics, citing In re Saunders (1970) 2 Cal. 3d 1033, 1048-1049 [88 Cal. Rptr. 633, 472 P.2d 921], italics added.)\n\nLater in People v. Shaw (1984) 35 Cal. 3d 535 [198 Cal. Rptr. 788, 674 P.2d 759], the Supreme Court stated, \"'defendant is denied the effective assistance of counsel if, by reason of counsel's failure to perform the obligations imposed upon him, defendant is deprived of an adjudication of a crucial or potentially meritorious defense.' . . . 'A crucial defense is not one which, if presented, \"would result inexorably in a defendant's acquittal.\" [Citations.]'\" (Id. at p. 541, original italics, citing People v. Pope, supra, 23 Cal. 3d at p. 425, fn. 15.)\n\nII. Standard of Review of Referee's Findings\n\n\"Although the referee's findings of fact, if supported by credible evidence, are entitled to great weight, [a reviewing court] may reach an independent conclusion after [a] review of the record. [Citation.]\" (People v. Shaw, supra, 35 Cal. 3d at p. 541.) In this case, as will be explained in detail in succeeding sections, the referee's findings are seriously flawed in several respects. Because Mr. Jefferson was not present at the evidentiary hearing he was not available to offer any explanations whatever as to his acts or omissions. According to a private investigator's declaration, Mr. Jefferson promptly left the jurisdiction after accepting inactive status when the State Bar recommended disbarment for a 10-year pattern of misconduct. As a result of his absence, most of the testimony concerning Mr. Jefferson's effectiveness was pure speculation. Most unfortunately, the trial court acting as referee itself indulged in speculation in finding Xavier would have taken the Fifth Amendment at the second trial and been considered unavailable. This is pure supposition, especially in view of the fact Xavier voluntarily showed up at the second trial prepared to \"tell the truth.\"\n\nIII. Petitioner's Trial Counsel Failed to Provide Effective Assistance of Counsel in Several Respects During the Second Trial\n\nMr. Jefferson is charged with failing to properly prepare for trial in many different and significant respects with varying effects on the outcome of the trial. For example, Jefferson failed to secure a transcript of the first trial. Thus he could not take advantage of inconsistent statements between the testimony of the five eyewitnesses at the first trial and their testimony at the second trial. This despite the critical nature of the eyewitness testimony and the fact the pretrial identifications had been so shaky. Nor did the case file reflect Jefferson informed himself about physical evidence used in the first trial. A transcript would also have informed Jefferson about the court's\n\nprior rulings, instructions given, and the prosecution's theory of the case through opening and closing statements.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nJefferson also allegedly failed to hire a private investigator to interview witnesses and gather evidence from the scene; failed to hire a ballistics expert; and failed to familiarize himself with crime scene photos and other physical evidence. These issues could not be fully resolved at the evidentiary hearing as Jefferson's absence made it impossible to discover what he actually did or did not do. However, in response I note the record shows the\n\nexpert witness testified, without objection or contradiction, that his review of the files indicated Jefferson failed to hire an investigator. This same expert likewise testified this failure was prejudicial.\n\nThe most egregious omissions, however, revolve around Jefferson's failure to properly investigate and make proper use of Xavier Sanders's admission it was he, rather than petitioner, who fired the fatal shot. As a consequence, his decision not to call Xavier as a witness at the second trial was not an informed decision. Xavier's mother told Jefferson Xavier had confessed to her it was he, not petitioner, who fired the fatal shot. Yet Jefferson did nothing affirmative to follow up on that lead. Then when Xavier himself came to Jefferson's office, the lawyer told Xavier he did not want to hear anything he had to say.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Most significantly, he made no effort to obtain a signed statement from Xavier to the effect he was the shooter. That alone represented ineffective assistance of counsel since any reasonably competent lawyer would have sought to obtain a witness statement of some sort from a person who said it was he rather than the lawyer's client who committed the crime. Such a statement could be used either in connection with the witness's testimony at trial or in lieu of that testimony should the witness invoke the Fifth Amendment. As further evidence of ineffective assistance of counsel, when Xavier appeared in court during the second trial claiming he was ready to testify truthfully, Jefferson ordered him to leave. Xavier was left with the impression Jefferson wanted to protect Xavier from potential criminal liability in the event the district attorney discovered his presence and ordered him to testify.\n\nMr. Jefferson was not available at the evidentiary hearing to explain why he failed to use the one witness who could most help his client or why he failed to obtain or attempt to obtain a written or taped statement from this witness. The prosecution speculated the reason Mr. Jefferson excluded Xavier's testimony was because it was perjurious, or, in the alternative, because Mr. Jefferson anticipated Xavier would take the Fifth Amendment in the second trial as well. The court-appointed criminal law expert, Mr. Fitzgerald, testified there was no plausible explanation whatever not to offer as evidence the best defense available to one's client -- someone else's confession to the shooting.\n\nThe evidentiary hearing was ordered for the purpose of resolving the issue of Jefferson's motives and decision making processes in deciding not to use Xavier's confession as a defense. This the hearing could not do because Jefferson was not present. Nonetheless, the hearing did establish Jefferson\n\nrendered ineffective assistance of counsel in at least four different ways in his handling of Xavier Sanders's possible testimony it was he rather than petitioner who fired the fatal shot.\n\nFirst, Jefferson failed to fulfill his duty to investigate the defense Xavier rather than his client was the shooter. According to the evidence in this record Jefferson did not interview Xavier about his statement to his mother that he fired the shot. He did not probe Xavier about his sincerity in offering to testify at the second trial that he, not his brother, had fired the shot. And, he made no effort to find out if Xavier had confessed these same facts to other people whose testimony might be used at trial in the event Xavier ultimately decided to invoke the Fifth Amendment. Accordingly, whatever decision Jefferson was to make about calling Xavier as a witness was not an informed decision as required by case law. (People v. Ledesma (1987) 43 Cal. 3d 171, 222 [233 Cal. Rptr. 404, 729 P.2d 839]; People v. Shaw, supra, 35 Cal. 3d at pp. 541-542; People v. Frierson, supra, 25 Cal. 3d at pp. 162-163.)\n\nSecond, Jefferson failed to do what any competent lawyer would do when a witness indicates directly or indirectly that he and not the lawyer's client is guilty. He did not even attempt to obtain a statement from Xavier confirming what Xavier represented he was willing to say about his guilt and petitioner's innocence. Had he done so he may very well have obtained a confession similar to the written declaration accompanying the habeas corpus petition or the taped interview Xavier voluntarily gave to the lawyer the court appointed to investigate this matter in connection with the habeas corpus hearing. (See People v. Shaw, supra, 35 Cal. 3d at pp. 541-542 [defendant deprived of effective counsel when attorney failed to investigate and call witnesses to corroborate alibi defense]; In re Hall (1981) 30 Cal. 3d 408, 427-429 [179 Cal. Rptr. 223, 637 P.2d 690] [defendant denied effective counsel when attorney failed to investigate information indicating killer was another person and failing to investigate and call witnesses to corroborate alibi].) (The incriminating contents of these posttrial statements are discussed at pp. 394-399, post.) This would have given Jefferson powerful evidence of petitioner's innocence which could have been introduced as a declaration against interest even if Xavier ultimately elected to invoke the Fifth Amendment at trial.\n\nThird, Jefferson failed to even attempt to use the defense. The expert's conclusion there could be no strategic or tactical reason not to use an available and extremely powerful defense in a client's case seems obvious. The job of a defense counsel is presumably to defend, and Xavier's testimony (or his declaration, if necessary) he was the shooter, was the best defense\n\navailable to petitioner in this case. Indeed, this may have been petitioner's only viable defense.\n\nThe defenses used in the second trial were mistaken identification; shot from inside the house by someone else; and alibi. The alibi witnesses simply were not credible. All three -- father, Calvin, Sr., brother Calvin, Jr., and friend, Mr. Henderson -- had an extraordinarily poor sense of time. In addition, much of the testimony was contradictory as to how they spent their morning hours together the day of the shooting. The \"shot from inside the house\" defense was even less effective. With demonstrations on trajectory and proof on the absence of gun powder or stipling inside the house, the state's ballistics experts destroyed any potential credibility in that defense. In fact, these two defenses were so embarrassingly weak it is understandable the jury was unconvinced of petitioner's innocence.\n\nThe \"mistaken identification\" defense had merit, but according to the expert Fitzgerald, it is rarely a successful defense when the accused has a motive. It would have been a viable, and in all probability a successful, defense if Xavier's admission he was the shooter had come before the jury either out of his own mouth or out of the mouths of others he had confessed to. Accordingly, Jefferson's failure to call Xavier as a witness to give the \"mistaken identification\" defense the most powerful possible support is yet another independent ground for finding he rendered petitioner ineffective assistance of counsel.\n\nThere is still a fourth independent ground for finding Jefferson rendered ineffective assistance of counsel. When asked by Abramson why Jefferson did not want to use Xavier as a witness, Jefferson replied he did not want to get Xavier involved. When challenged as to whether he was representing someone other than just petitioner, Jefferson replied \"Well, I felt I was representing the family.\" This statement together with Xavier's statement he was \"shooed away\" from the courthouse when he voluntarily showed up to testify, is very troublesome. They provide strong evidence Jefferson was involved in a conflict of interest. He was attempting to protect everyone in the family while not being a zealous advocate for the one member of this family who was his client.\n\nThis alone is enough of a showing to justify a finding of ineffective assistance of counsel. (Holloway v. Arkansas (1978) 435 U.S. 475, 489-490 [55 L.Ed.2d 426, 438, 98 S.Ct. 1173] [\"Joint representation of conflicting interests is suspect because of what it tends to prevent the attorney from doing.\"]; Glasser v. United States (1942) 315 U.S. 60 [86 L.Ed. 680, 62 S.Ct. 457].) Here Jefferson's apparent perception he was representing the \"whole family\" not just petitioner prevented him from risking Xavier's freedom by\n\ncalling Xavier to the stand in order to protect Jefferson's only true client from a criminal conviction. A lawyer whose judgment is clouded by conflict and thus gives up even a possible defense is not giving his client effective assistance of counsel. Jefferson went further, however, by giving up perhaps the most powerful of defenses -- \"It was me, not the defendant, who did it.\"\n\nThe majority adds yet a different speculation to explain Jefferson's inaction on Xavier's admissions of guilt. They conjecture the reason Jefferson did not investigate Xavier's admission of guilt nor attempt to obtain signed or taped statements of this admission nor call him as a witness was because he \"knew\" Xavier was lying. \"Knowing\" this and possessed of high ethical standards Jefferson refused to use Xavier's admission because as a lawyer he is not to use perjurious testimony.\n\nOf course, once again this is mere speculation. Jefferson was not present to testify about his supposed knowledge this was perjurious testimony and his supposed ethical inhibitions against using perjured testimony because he had left the state after being found guilty of a 10-year pattern of misconduct as a lawyer.\n\nThis speculation is one of several additional factual \"findings\" the majority makes about Jefferson's state of mind beyond the factual findings the trial court made. These additional \"findings\" are controverted by Jefferson's performance as a lawyer. On April 20, 1990, Jefferson was \"disbarred from the practice of law in California by order of the Supreme Court of California.\" (See appendix to dissent, letter from Charlotte Blackford, Cal. State Bar, dated June 12, 1990.)\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e This disbarment is based on findings and recommendations of the State Bar Court which inter alia found: \"[Jefferson] has pursued a course of conduct demonstrating a complete indifference to his legal and ethical duties, to the great detriment of his clients.\" (See appendix to dissent, In the Matter of: Philip Jefferson, case 83-0-11184, State Bar Court, Mar. 5, 1989, post at p. 424, italics added.) The State Bar Court findings of a \"course of conduct\" are based, in turn, on specific instances of \"complete indifference\" and \"great detriment\" to clients stretching from 1979 through at least 1987. In most of these specific instances Jefferson was retained by clients and then did nothing to investigate their cases.\n\nThis evidence of Jefferson's pattern of past misconduct is relevant and admissible to refute the majority's \"findings\" on several grounds. First,\n\nthese prior acts of misconduct are admissible to attack Jefferson's credibility as an out-of-court declarant (Evid. Code, § 210; 3 Witkin, Cal. Evidence (3d ed. 1986) Introduction of Evidence at Trial, § 1998; People v. Harris (1989) 47 Cal. 3d 1047, 1081 [255 Cal. Rptr. 352, 767 P.2d 619] [holding Prop. 8 repealed Evid. Code, §§ 786-790].)\n\nSecondly, Jefferson's disciplinary record is admissible\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e and highly probative on the issues of motive, knowledge, and intent which form the core of the majority's \"findings\" about what and why Jefferson failed to investigate Xavier's statements admitting guilt and exonerating petitioner. Here the majority \"finds\" Jefferson's intent and motive in not investigating or using this exculpatory evidence was his desire to avoid presenting what he \"knew\" to be perjurious testimony. However, his disciplinary record documents a \"course of conduct\" wholly inconsistent with this finding about Jefferson's knowledge, intent and motives. Instead this \"course of conduct\" reveals a lawyer motivated by laziness and indifference to clients whose intent was to do as little as possible in each case. This laziness and indifference is a more likely explanation for Jefferson's failure to investigate and use Xavier's confession than is any notion Xavier's confession was false, Jefferson had investigated and found out it was false, and was too ethical to use perjured testimony.\n\nJefferson's disciplinary record and the State Bar Court findings also belie any of the majority's \"findings\" that his several failures -- the failure to obtain a transcript of the first trial, his failure to conduct tests or use expert witnesses, as well as his failure to investigate and use Xavier's confessions -- were based on calculated tactical choices. To find this lawyer made such decisions with the intent of maximizing his client's tactical position is wholly inconsistent with the intent and motives manifest in the specific acts, the \"course of conduct,\" and findings documented in the State Bar's disciplinary record appended to this dissent. There is every reason to believe Jefferson failed to properly investigate and prepare this defense not as a matter of calculated tactical choice but in \"complete indifference to his legal and ethical duties, to the great detriment of his [client, the petitioner in this case].\" (See appendix to dissent, In the Matter of: Philip Jefferson, case 83-0-11184, State Bar Court, post, at p. 424.)\n\nIn responding to the majority's \"findings\" about Jefferson's abhorrence at using allegedly perjured testimony, for instance, it is equally possible to\n\nspeculate Jefferson knew Xavier's admission was true -- or at least that it might be true -- but felt he was representing the entire Sanders family. Given the fact the first trial against petitioner had ended with a six to six jury deadlock, Jefferson may have been convinced he could obtain an acquittal of petitioner at the second trial without exposing Xavier to risk of criminal prosecution. If he had succeeded without Xavier's testimony the entire Sanders brood would have gotten off scot-free and he would have served his \"client,\" the family, very well. On the other hand, if Jefferson used Xavier's full admission at petitioner's trial, he risked seeing two Sanders brothers go to prison. His \"client,\" the family, would not have been too pleased with that result.\n\nI grant this is pure speculation about Jefferson's knowledge, understandings, motivations, and the like. But it is no more speculative than the majority's conjecture Jefferson \"knew\" Xavier was lying and because of his high ethical standards would not participate in the investigation of or presentation of perjured testimony. It is not critical or even relevant which of these speculations -- or any of the several other speculations the trial court or the majority offers to justify denial of habeas corpus -- is the \"better\" speculation. The key point, once again, is they are all mere speculations about what people would have done, might have known, could have thought, etc. In a world of hard evidence and sound reason, one speculation is no better than another. With the possible exception of some exotic field of mathematics of which I am not aware, there are no degrees of zero.\n\nIV. The Referee's Finding That Xavier Would Not Have Testified at the Second Trial That He, Rather Than Petitioner, Fired the Fatal Shot Is Supported Only by Speculation and Not by Substantial Evidence\n\nThe referee attempted to excuse Jefferson's failure to call Xavier as a witness by making a factual \"finding\" that, if called, Xavier would have invoked his privilege against self-incrimination and refused to testify at the second trial. This, likewise, is pure speculation, not a factual \"finding.\"\n\nIt is undisputed Jefferson never talked to Xavier about his testimony or whether Xavier would take the Fifth Amendment at trial. Thus, he breached his duty to investigate all reasonable defenses and was guilty of ineffective assistance of counsel on that ground alone. Moreover, without taking these minimal steps required by his duty to investigate all reasonable defenses, Jefferson had no basis for concluding Xavier would refuse to testify and deciding to forego his appearance for that reason. This is especially true because Xavier voluntarily showed up at the second trial wanting to tell his story.\n\nThe only evidence in the record bearing on Xavier's willingness to testify at the second trial supports a finding he indeed would have testified. That evidence reveals he asserted his right against self-incrimination at the first trial only because petitioner's counsel at that trial -- who was Xavier's own former counsel -- told him to come to the trial and take the Fifth Amendment. As Xavier told Klein and the investigator in the taped interview, \". . . Then [Bledstein] came down and he say you gonna take the fifth amendment. And I said for what? He said for your brother's case and I said alright [ sic ], so I just took the fifth amendment [ sic ].\"\n\nBut Xavier had confessed to his mother it was he, not petitioner, who had fired the fatal shot. So at the time of the second trial on his own motion, or perhaps at his mother's urging, Xavier voluntarily went to Jefferson to tell this lawyer it was he rather than his brother who did it. Before Xavier could say anything, however, Jefferson said, \"that if I'm the one that did it they don't need me near the court or my testimony, because they might grab me or somethin'.\"\n\nUndaunted, Xavier came to court to testify in petitioner's trial it was he not petitioner who fired the shot that killed the victim. \"We was in a lawyer's chamber outside of the courtroom, we was sittin' in there and [Jefferson] came, he said oh no, you don't need to be here, go on and get away.\"\n\nWhen the investigating attorney, Klein, asked Xavier the next question at the taped interview: \"So you were willing to testify in court that you did the shooting?\" Xavier's answer: \"Right. . . .\"\n\nShortly thereafter, Klein explained what would have been the situation at the second trial: \"So, . . . if you went to court, at a minimum the judge would talk to you and tell you if you wanna talk to a lawyer, you can, and if you can't afford one you can have one, and that you don't have to say anything that would get you in any trouble. Did you understand that?\" Xavier's answer: \"Yes, I understand.\"\n\nKlein then followed up with the crucial question: \"And you were still gonna say that you did it?\"\n\nXavier's answer: \"Right.\"\n\nWhat a person would have done on a given occasion if given the chance is always a matter of speculation. But if there are degrees of speculation, it is an even more problematic conjecture when the only evidence in the record on what the person would have done on that occasion is the person's\n\ntestimony saying he would have done one thing and the speculator concludes he would have done the opposite.\n\nThe only indication in the record the referee could have used to speculate Xavier would have invoked the Fifth Amendment if he had been called at the second trial is the fact he asserted that right when asked certain critical questions at the habeas corpus hearing. But what Xavier did at the habeas corpus hearing is not proof of what he would have done years earlier at petitioner's trial. Since at the time of the habeas corpus proceeding Xavier's brother, the petitioner, already was convicted and in jail the counsel advising Xavier might have been concerned Xavier would supply evidence supporting an accessory charge against himself without convincing this referee his brother should be released. Thus, there was a risk both brothers could end up in prison, even though only Xavier was guilty. (This, too, is only speculation. But that merely illustrates my point. The referee entered into a \"never never land\" of conjecture and surmise and pure guesswork when she ventured to \"find\" what Xavier would have done if Jefferson had called him to testify at petitioner's second trial.)\n\nV. Assuming Xavier Had Refused to Testify at the Second Trial, His Several Out-of-court Admissions Would Have Been Admissible at That Trial\n\nLet us assume, however, one can \"find\" Xavier would have asserted his right against self-incrimination at the second trial because he asserted that right to refuse answering some questions at the habeas corpus hearing. If so, then by the same logic one is inexorably led to the conclusion that if Jefferson had asked him before the second trial Xavier would have supplied a sworn written statement and a taped interview acknowledging he rather than petitioner fired the fatal shot. For, while it is true Xavier invoked the Fifth Amendment to certain questions at the habeas corpus hearing it is equally true that before this hearing he willingly furnished a sworn declaration and gave an attorney and his investigator a taped interview. In these statements, Xavier confessed he fired the fatal shot and petitioner did not.\n\nThus, assuming the referee was correct in speculating Xavier would have invoked the Fifth Amendment if called at the trial, the same logic demonstrates that except for his ineffective representation Jefferson would have had several of Xavier's confessions available at the trial -- the one to his mother, a sworn declaration he had signed, and a taped interview. (In addition, if he had conducted any sort of investigation Jefferson may well have uncovered other witnesses to whom Xavier had admitted he rather than petitioner was the shooter.) Those statements, in turn, could have been introduced as evidence if Xavier indeed became unavailable as a witness by\n\nasserting his right not to incriminate himself. Since he would then be unavailable, these out-of-court declarations would have become admissible as declarations against penal interest. (Evid. Code, § 1230; 1 Jefferson, Cal. Evidence Benchbook, (2d ed. 1982) Declarations Against Interest, § 6; 2 Johnson, Cal. Trial Guide, supra, § 40.35[2], at pp. 40-110-40-112.)\n\nThe majority disagrees these declarations would have been admissible. The opinion accepts the referee's finding that the claim \"Xavier's statement would be admissible as a declaration against penal interest is not necessarily meritorious. . . . His declaration that he shot at the car and then shot in the air would not be against his penal interest. As in the case of People v. Chapman (citation omitted), there is also a question of trustworthiness to be considered.\"\n\nThis \"finding\" is in error on the facts and on the law. The instant case falls within the well-established principle allowing third party admissions of guilt into evidence to prove the defendant's innocence. (People v. Spriggs (1964) 60 Cal. 2d 868, 875 [36 Cal. Rptr. 841, 389 P.2d 377] [wife's admission that drugs were hers was admissible to prove drugs were not defendant's], expressly overruling People v. Hall (1892) 94 Cal. 595 [30 P. 7] and its progeny, which had disallowed such evidence.) As our Supreme Court said in Spriggs, \"[A] person's interest against being criminally implicated gives reasonable assurance of the veracity of his statement against that interest.\" (60 Cal. 2d at p. 874.) The Spriggs rationale won the day when the drafters of the California Evidence Code and the Legislature enacted section 1230 which permits such testimony. (See 1 Witkin, Cal. Evidence, supra, The Hearsay Rule, §§ 688, 694; People v. Frutos (1984) 158 Cal. App. 3d 979, 986 [205 Cal. Rptr. 204] [third party's hearsay admission of participation in crime admissible under Evid. Code, § 1230]; People v. Smith (1970) 13 Cal. App. 3d 897, 903 [91 Cal. Rptr. 786, 52 A.L.R.3d 875] [third party's admission of guilt admissible under Evid. Code, § 1230 where third party later invokes privilege against self-incrimination].)\n\nEven if the referee's characterization of the content of Xavier's out-of-court declarations had been accurate those statements still would have been admissible as declarations against penal interest. The California Evidence Code requires the declarant's statement to have \"so far subjected him to the risk of . . . criminal liability, . . . that a reasonable man in his position would not have made the statement unless he believed it to be true.\" (Evid. Code, § 1230.) That is all it requires. The Evidence Code does not require that the declarant have admitted to each and every element of the most serious charge which might be leveled against him. The only question is whether what he did admit to would subject him to the risk of criminal liability. Even accepting the referee's characterization that Xavier only said\n\nhe fired \"at the car and in the air\" Xavier would have admitted to more than enough to guarantee he would be subjected to criminal liability for the death of Norman Gregory.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nXavier said far more, however, than he \"shot a gun at the car and in the air.\" Indeed he told his mother he fired the shot which killed Norman Gregory, and Jefferson was aware of this fact when he declined to call Xavier and told him to get out of the courthouse. The mother could have testified to that statement once Xavier's unavailability was established by his invocation of the Fifth Amendment.\n\nXavier's tape-recorded (and transcribed) statement to Klein, the lawyer, and to the investigator was even more incriminatory. After telling them he shot at the car he said \". . . and then I shot one in the air, but I shot one towards the house, but I didn't hear nobody holler, so I didn't know if I hit anybody.\" (Italics added.) Later on, he said he fired two shots. \"I fired one in the car and one in the air towards the house.\" (Italics added.) Still later Xavier told them the earlier reference to a shot \"in the air\" referred to \"the one I fired towards the house, that they sayin' it went through the door.\" So the referee's \"finding\" Xavier only admitted to shooting at the car and in the air is not consistent with the evidence. Three times during the taped interview Xavier admitted to firing at the house and specifically admitted firing the shot other evidence shows was fatal to the victim.\n\nLater in this same statement Xavier admitted he personally destroyed the rifle, which would be admissible against him as evidence of a guilty conscience. He further specifically stated he, and not petitioner, committed the crime for which petitioner was convicted. \"I'll do the time, ain't no sense of him goin' when I did it and everybody's keep sayin' he's the one that did it.\" Altogether, this is as close to an out-and-out confession of guilt as one could reasonably expect.\n\nAny single one of these admissions in the taped interview would be sufficiently incriminating to satisfy the foundational requirement for a declaration against penal interest that it \"so far subjected him to the risk of\n\nFurthermore, if a trial court had excluded the mother's testimony or Xavier's other declarations at the second trial on grounds of \"untrustworthiness\"\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e pursuant to People v. Chapman (1975) 50 Cal. App. 3d 872 [123 Cal. Rptr. 862], that ruling would have been reversible error. People v. Chapman is easily distinguished.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e In that case, there was evidence before the trial court to the effect the declarant, a juvenile, had expressly agreed with the defendant, an adult, to \"take the rap\" for a murder. The existence of this agreement combined with evidence the defendant had threatened the juvenile with serious bodily injury unless he \"took the rap\" and the further fact the juvenile \"could not suffer any real detriment to his own interests,\" that is, any further punishment as a result of accepting full blame, persuaded the court the juvenile's proffered \"confession\" was \"untrustworthy\" and should be excluded.\n\nHere Xavier is an adult not a juvenile. Indeed he is older than petitioner and faced the same punishment for the crime he admitted as did petitioner. Moreover, unlike Chapman there was no evidence of any agreement\n\nbetween Xavier and appellant that Xavier would \"take the rap\" for a crime petitioner committed. Nor is there evidence the younger brother threatened his older brother with great bodily injury unless he accepted the blame for the shooting.\n\nConceivably, evidence of this sort exists and might have been produced at the trial. But the referee could not support a \"finding\" to this effect on speculation such evidence would be forthcoming. Nor could the referee's finding be supported by the speculation all older brothers would agree to take their younger brother's place in prison. Not too many people -- brothers or not -- consider it \"a far, far better thing that I do, than I have ever done\" to falsely confess to another's crime and \"a far, far better rest, that I go to, than I have ever known\" to serve the real criminal's time in prison. No, as the majority concedes, the law requires the referee's findings to be supported by \"substantial evidence \" not wild speculation.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIn the absence of evidence it is difficult to differentiate this pair of brothers and this crime from any other pair of brothers and a crime both of them could have committed but only one did. (For that matter, it is difficult to differentiate a pair of brothers from a pair of friends as far as motive and opportunity to collude are concerned.) Accordingly, unless we are ready to enunciate a blanket rule to the effect one brother's declaration against penal interest is always inadmissible in his other brother's trial there is no reason to single out petitioner and deny him the opportunity to introduce Xavier's\n\nseveral admissions and confessions in this case. As discussed above, (see fn. 9, ante,) a blanket rule would be inconsistent with the California Evidence Code and perhaps unconstitutional as well. Thus, Xavier's statements would have been admissible in petitioner's defense had Jefferson collected them and presented them at the second trial.\n\nChapman cannot be read to create a requirement that declarations against penal interest in general -- or third party confessions of guilt in particular -- must be corroborated by other evidence to be admissible. The comparable provision of the Federal Rules of Evidence Evidence contains such a requirement (see pp. 404-408, post) but Evidence Code section 1230 does not. Nonetheless, I do think it noteworthy that here unlike Chapman, the declarant's statements do not stand alone. There is other evidence in the record to corroborate his out-of-court admissions of guilt.\n\nTerrell Gregory (brother of the victim) told the police at the scene and again six days later the shooter was Zuba (nickname for Xavier). About an hour prior to the shooting Terrell was outside sitting on a car and observed petitioner being beaten by David and the victim, Norman Gregory. Presumably Terrrll would remember petitioner's face an hour later.\n\nDarryl Anderson (neighbor from across the street) initially told investigating police the shooter was Kake (nickname for petitioner). But the very next day he told police Zuba (Xavier) was the shooter. (The majority in footnote 9 claims I create the impression in this dissent that this witness initially identified Xavier as the shooter. I do not. What I do point out, and deem significant, is the fact this witness wavered in his pretrial identification. A jury could believe he was right the second time rather than the first.)\n\nWilliam Thomas (neighbor from down the street) initially identified the shooter as Kake but six days later told police he was not sure who the shooter was. (The majority accepts Thomas's later explanation at trial he only told the police he wasn't sure because he didn't want to get involved. But a jury would not have to accept this explanation as true after hearing an admission by Xavier that he, not petitioner, fired the fatal shot.)\n\nDavid Gregory (brother of the victim) was standing next to the victim when the victim was shot. David is the only person who consistently identified petitioner as the shooter.\n\nThese four witnesses were inside the house at the time of the shooting and observed the shooter, if at all, through an iron mesh, steel bar door.\n\nBecause Kelvin Sanders was married to Raynetta (Gregory) Sanders, much emphasis is placed on the fact witnesses are related to and presumably know each other well. The one person who knew the Sanders brothers best was Raynetta. During her marriage to Kelvin, they lived together for several months at the Sanders residence. Of all the witnesses she is in the best position to distinguish between Xavier and petitioner. At the scene, Ms. Sanders identified Xavier as the shooter, giving the police his full, complete name. Ms. Sanders's statements to the police at the scene are doubly significant because she is the only eyewitness who was outside and had a clear view of the shooter unobstructed by any mesh and bar door or bodies crowding around the doorway. While the record reflects she was upset and possibly hysterical when interviewed by the police, the reports also indicate she was coherent. She relayed details of the day's events including the fight in the morning between petitioner and her brothers as well as the substance of telephone conversations with Kelvin after the fight and before the shooting.\n\nThe majority seeks to cast doubt on Ms. Sanders's identification of Xavier as the shooter on the day of the shooting. As a matter of fact, during her trial testimony Ms. Sanders denied she had even talked to the officer at that time. She had to concede, however, there was information in the police report, such as her correct date of birth, which must have come from her. Admittedly, as the majority in an almost unprecedented argument implies, it is conceivable the investigating officer could have lied or been otherwise mistaken about interviewing Ms. Sanders or about what she said in describing the events of the day and identifying the perpetrator as Xavier. There is no apparent reason for the officer to manufacture the fact or content of this interview. In any event, the police officer's testimony at the very least creates a jury issue whether Ms. Sanders initially and while still in an excited state identified Xavier rather than petitioner as the one who fired the fatal shot.\n\nThe majority likewise seeks to diminish the reliability of Ms. Sanders's initial on scene identification by emphasizing she was crying and hysterical from witnessing her brother shot and dying from a four-inch hole in his head. This may be a good argument to a jury. It does not -- or should not -- carry much water with an appellate court. What the majority is describing is the quintessence of an \"excited utterance\" or \"spontaneous declaration\" which common law jurisprudence and the California Legislature have long recognized to carry a special badge of reliability. (Evid. Code, § 1240; 1 Witkin, Cal. Evidence, supra, § 714 et seq., 2 Johnson, Cal. Trial Guide, supra, § 40.39.) That special badge derives from the fact the witness is so excited her normal ability to lie or distort is suspended. In essence, the event\n\nspeaks through the witness, uncensored and unembellished. \"'The basis for this circumstantial probability of trustworthiness is \"that in the stress of nervous excitement the reflective faculties may be stilled and the utterance may become the unreflecting and sincere expression of one's actual impressions and belief.\"'\" (People v. Poggi (1988) 45 Cal. 3d 306, 318 [246 Cal. Rptr. 886, 753 P.2d 1082] quoting Showalter v. Western Pacific R.R. Co. (1940) 16 Cal. 2d 460, 468 [106 P.2d 895].)\n\nBecause of this special reliability the officer's testimony about Ms. Sanders's statement to him that day would have qualified for admission as an exception to the hearsay rule. (People v. Poggi, supra, 45 Cal. 3d 306 [declarant's statements admissible as spontaneous declaration even though made 30 minutes after the crime and in response to questions from a police officer].) Meanwhile, other out-of-court statements Ms. Sanders later made when she had enough time to calculate her words would not carry that same badge of reliability. Consequently, barring some unique circumstance bringing them under another hearsay exception any later statements would have been inadmissible had she not appeared as a witness at the trial.\n\nAt the very least this evidence that several eyewitnesses identified Xavier as the shooter early in the investigation should corroborate Xavier's presence at the scene as well as the possibility of Xavier as the shooter. This testimony is more than enough to bolster Xavier's several out-of-court admissions. The majority opinion seems to assume corroboration is required for Xavier's declaration against penal interest to be admissible, which it is not. Furthermore, the majority appears to assume corroboration must consist of undisputed evidence supporting the declaration. That is not necessary either. If corroboration were an essential prerequisite of admissibility, it would be enough there was admissible evidence -- no matter how strongly controverted by contrary evidence -- that supported the declaration. Here there is such admissible evidence, in the form of prior inconsistent statements\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e and at least one statement that could have come in as an excited utterance (spontaneous declaration) as well. All of this admissible evidence pointed in the same direction as the declarations against penal interest -- Xavier fired the fatal shot. Had the jury heard Xavier's out-of-court admissions it would have been free to choose the eyewitnesses' prior inconsistent\n\nstatements and excited utterance along with Xavier's statements in preference to the eyewitnesses' trial testimony.\n\nA declaration against penal interest does not become inadmissible because the prosecution introduced contrary evidence at the trial. The majority implies Xavier's statements would not have been admissible at petitioner's second trial because prosecution witnesses testified at that trial it was petitioner, not Xavier, who filed the fatal shot. Does this mean Xavier would not have been allowed to testify in person at the trial to confess his own guilt and exonerate petitioner? Would his testimony to this effect be inadmissible because others testified the shooter was petitioner not Xavier? Obviously not. The existence of contrary evidence only goes to the weight of Xavier's testimony not its admissibility.\n\nFor the same reason, Xavier's out-of-court statements would have been admissible as declarations against penal interest despite the presence of contrary evidence. These admissions still subjected him to a risk of criminal liability, all the more so because he admitted to acts such as bringing the gun and destroying it which exposed him to prosecution as an accessory even if the jury convicted his brother as the shooter.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nIn this case, we have a compelling argument for admission of Xavier's several declarations against penal interest under California law. Not only are all the foundational requirements met for a declaration against interest, but the declaration is bolstered by corroborating evidence in the record of the trial. Accordingly, there is not a shred of doubt under California law Xavier's several statements that he, not petitioner, fired the fatal shot would be admissible as declarations against penal interest at any trial where he invoked his privilege against self-incrimination.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nVI. The Admissibility of Xavier's Out-of-court Declarations Is Guaranteed by the United States Constitution and Supported by Federal Decisions Interpreting the More Stringent Provisions of the Federal Rules of Evidence\n\nThe admissibility of Xavier's several admissions of guilt does not depend solely upon California Evidence Code section 1230 either. Their admissibility is further guaranteed by the United States Constitution. The United States Supreme Court has held that, under some circumstances, the refusal to admit hearsay admissions of guilt by a third party violates the criminal defendant's right to due process regardless of the state's rules of evidence. In Chambers v. Mississippi, supra, 410 U.S. 284, the state trial court barred three witnesses from testifying a third party confessed to the murder for which the defendant was charged. (Id. at p. 298 [35 L.Ed.2d at p. 310].) Although the state's rules of evidence barred the testimony as hearsay, the Supreme Court nonetheless held fundamental rules of due process mandated the testimony's admission as declarations against penal interest. (Id. at p. 302 [35 L.Ed.2d at p. 313].)\n\n\"Few rights are more fundamental than that of an accused to present witnesses in his own defense. . . . Although perhaps no rule of evidence has been more respected or more frequently applied in jury trials than that applicable to the exclusion of hearsay, exceptions tailored to allow the introduction of evidence which in fact is likely to be trustworthy have long existed. The testimony rejected by the trial court here bore persuasive assurances of trustworthiness and thus was well within the basic rationale of the exception for declarations against interest. That testimony also was critical to [the defendant's] defense. In these circumstances, where constitutional rights directly affecting the ascertainment of guilt are implicated, the hearsay rule may not be applied mechanistically to defeat the ends of justice.\" (410 U.S. at p. 302 [35 L.Ed.2d at pp. 312-313].)\n\nThe majority opinion in the instant case further argues Xavier's confessions do not qualify as declarations against penal interest because he might\n\nhave reneged after the statements had been introduced at petitioner's trial. But once again this possibility does not make a third party confession inadmissible. Indeed in Chambers itself the declarant had already reneged on his confession before the trial. Yet the United States Supreme Court held these declarations were admissible as a matter of constitutional right. (410 U.S. at p. 302.)\n\nSubsequent to the Supreme Court's decision in Chambers, the Federal Rules of Evidence adopted rule 804 which permits the admission of a declarant's hearsay statements against penal interest if the declarant's testimony is unavailable at trial. Unlike the California statute, the federal rule contains the more stringent requirement that \"[a] statement tending to expose the declarant to criminal liability and offered to exculpate the accused is not admissible unless corroborating circumstances clearly indicate the trustworthiness of the statement.\" (Fed. Rules Evid., rule 804(b)(3), 28 U.S.C.)\n\nDespite this more stringent requirement, federal courts have admitted exculpatory statements where the circumstances are less corroborative and the declarant's exposure to possible penal consequences far less pronounced than those found here. In United States v. Lopez (10th Cir. 1985) 777 F.2d 543, the defendant was convicted of possessing cocaine with an intent to distribute. On appeal, the court of appeals held the district court erroneously excluded the testimony of an attorney that a third party made inculpatory statements to him which exculpated the defendant. (Id. at pp. 552, 554.) The corroborating evidence was the fact the defendant's fingerprints were not found on the containers holding the cocaine while the declarant's finger-prints were. (Id. at p. 554; see United States v. Thomas (5th Cir. 1978) 571 F.2d 285, 290; United States v. Barrett (1st Cir. 1976) 539 F.2d 244, 253.)\n\nIn United States v. Barrett, supra, 539 F.2d 244, the more stringent federal provision was construed to require admission of a declaration much less incriminating or credible than Xavier's several admissions. In that case the declarant made an offhand comment during a poker game that he and two others were going to have some trouble from people in California concerning a theft of postal stamps. (Id. at p. 249.) When asked whether he meant the appellant or someone else, the poker player said no, it was someone else not the defendant who was involved. The district court excluded the testimony of another player in the game relating the declarant's statement.\n\nOn appeal, the prosecution argued the declarant's statements were not sufficiently against his penal interests to be admissible. The court of appeals disagreed, stating: \"Although the remarks did not amount to a clear confession\n\nto a crime . . ., we do not understand the hearsay exception to be limited to direct confessions. . . . A reasonable person would have realized that remarks of the sort attributed to [the declarant] strongly implied his personal participation in the stamp crimes and hence would tend to subject him to criminal liability. Though by no means conclusive, the statement would be important evidence against [the declarant] were he himself on trial for the stamp crimes. We cannot say, therefore, that it did not pose the sort of threat to [the declarant's] interest that the hearsay exception contemplates.\" (539 F.2d at p. 251.)\n\nThe court went on to hold statements exculpating the defendant need not be against the declarant's interests to be admissible. \"The district court seemed to suggest that in order for exculpatory remarks such as [the declarant's] to be admissible as against interest, the innocence of the accused must itself be prejudicial to the declarant. On the present facts, we read the first part of rule 804(b)(3) more broadly, and conclude that so much of [the declarant's] remarks [exculpating the appellant] . . . should here be considered as part of the statement against [the declarant's] interest.\" (539 F.2d at p. 252.)\n\nIt is noteworthy the circuit court of appeals ruled this offhand comment was admissible as a declaration against penal interest even though the only corroboration came from a prosecution witness who testified the appellant was less involved than his codefendants in the planning and execution of the postal theft.\n\nHere, unlike the single conversation with the lawyer in Lopez and the offhand comment during a social poker game in Barrett, Xavier admitted his guilt and completely exonerated petitioner not once but several times, including in the form of a taped statement and a declaration under penalty of perjury. The possible penal consequences of making these statements were far more apparent when Xavier was submitting to a formal taped interview and executing a declaration under penalty of perjury than they would have been to the declarants in Lopez or Barrett. Xavier's statements also were more definitive in confessing his own guilt and especially in exonerating petitioner than the declarations found admissible in either Lopez or Barrett. Moreover, although unnecessary under California law, the evidence of corroboration here is at least as ample as that present in either Lopez or Barrett. As pointed out earlier, several witnesses initially identified Xavier as the person who fired the gun (see p. 400, ante).\n\nSince third party admissions of guilt of this nature are admissible under the more stringent Federal Rules of Evidence, a fortiori, they are admissible under the more lenient standard of the California Evidence Code.\n\nVII. If Petitioner's Trial Counsel Failed to Investigate and Use Xavier's Statements Because He Believed Them Inadmissible as Declarations Against Interest, This Erroneous Legal Conclusion Provided Further Grounds for Finding Ineffective Assistance of Counsel\n\nThe record of the habeas corpus hearing in this case suggests the referee may have speculated defendant's trial lawyer, Jefferson, had concluded Xavier's statements would have been inadmissible at the second trial were he to have invoked his Fifth Amendment rights. This belief, in turn, would explain Jefferson's own failure to call Xavier at least if we also honor the speculation Jefferson thought Xavier would take the Fifth Amendment. However, given the clear admissibility of third party admissions as discussed above, Jefferson's belief that Xavier's statements would have been inadmissible furnishes yet another ground for finding petitioner lacked effective assistance of counsel. Any self-incriminating statements Jefferson had bothered to collect from Xavier or from other witnesses to whom Xavier had unburdened himself would have been admissible as declarations against penal interest. If Jefferson failed to ask Xavier for such statements and failed to investigate to find whether he had admitted his guilt to others because Jefferson considered such statements inadmissible at trial that erroneous legal position would itself evidence a fatal absence of competence.\n\nIn summary, petitioner was denied effective assistance of counsel from Jefferson in several vital respects related to Xavier's possible testimony. First, Jefferson failed to investigate and make an informed decision about using Xavier as a witness. Second, he failed to attempt to obtain a signed statement from Xavier admitting he fired the fatal shot that could be used in connection with Xavier's testimony (or invocation of the right against self-incrimination) at trial. Third, Jefferson failed to call Xavier as a witness and thus test his self-proclaimed willingness to testify at the second trial that he, not petitioner, fired the fatal shot. Had he called Xavier to the stand, Jefferson would either have obtained Xavier's testimony or would have established the predicate for introducing Xavier's out-of-court declarations admitting his guilt. Fourth, if as the evidence suggests, Jefferson failed to take these steps because he felt he was representing the Sanders family and did not want to expose his client's brother to criminal prosecution in order to save his client, then Jefferson was bound up in an actual or perceived conflict of interest. Whether actual or perceived, this meant petitioner was denied his right to conflict-free representation. (People v. Mroczko (1983) 35 Cal. 3d 86, 105 [197 Cal. Rptr. 52, 672 P.2d 835] [defendant denied effective assistance of counsel if attorney has possible conflict]; People v. Cook (1975) 13 Cal. 3d 663, 670 [119 Cal. Rptr. 500, 532 P.2d 148].) And finally, if Jefferson failed to take these steps because he erroneously believed Xavier's\n\nstatements would be inadmissible as declarations against interest, he demonstrated a woeful misunderstanding of the law which, in turn, denied petitioner the best evidence available to support a powerful defense.\n\nVIII. If Xavier's Testimony or Out-of-court Admissions Had Been Introduced at the Second Trial or Were Introduced at a New Trial, It Is Probable the Outcome Would Be More Favorable to Petitioner\n\nNotwithstanding the referee's contrary finding, I have to agree with the expert witness, Fitzgerald, that had Xavier's admission been in evidence at the second trial, it is likely petitioner would have had a more favorable result. This is all the case law requires. (Strickland v. Washington (1984) 466 U.S. 668, 694 [80 L.Ed.2d 674, 694, 104 S.Ct. 2052]; People v. Ledesma, supra, 43 Cal. 3d at p. 218 [\"A reasonable probability is a probability sufficient to undermine confidence in the outcome.\"]; People v. Shaw, supra, 35 Cal. 3d at p. 542; People v. Frierson, supra, 25 Cal. 3d at pp. 165-166.)\n\nI am equally convinced that if a third trial were held it is probable petitioner would experience a more favorable result through the introduction of Xavier's own testimony or, failing that, through the introduction of his written declaration and taped oral admissions. (This assumes, of course, the People would elect to try petitioner a third time for this crime rather than using Xavier's confessions to prosecute him for the first time.)\n\nCan anyone seriously question the devastating impact of a witness testifying \"the defendant didn't do it, I did it\"? Or even indulging the referee's speculation that Xavier would have asserted the Fifth Amendment at the second trial, who could deny the striking effect of a witness testifying \"my son told me he not the defendant fired the fatal shot\" following immediately on the heels of this other son's invocation of the right against self-incrimination. Had Jefferson properly performed his duties as a lawyer the mother's testimony would have been further buttressed by a signed statement or other out-of-court declaration he had obtained from Xavier. The fact the jury already would have heard the confessing son was on the scene and had initially been identified as the perpetrator by most of the eyewitnesses shortly after the homicide would only give further credence to the out-of-court confessions and thus increase the chances the jury would reach a verdict favorable to the defendant.\n\nThe majority treats the prosecution's eyewitness testimony at the trial as sacrosanct. Somehow Xavier's admission of guilt and exoneration of petitioner could not incriminate him -- and presumably he knew this when he made these statements -- because what he said was inconsistent with the\n\neyewitness descriptions at trial. But contrary evidence -- no matter how overwhelming -- does not render a self-incriminatory statement inadmissible. Even if this eyewitness testimony had been steadfast from the date of the murder to the present and even if the witnesses' motives were unassailable, that would not disqualify Xavier's out-of-court statements from admission as declarations against interest.\n\nIn any event, the eyewitness testimony in this case was not steadfast before the trial. Nor were the motives of the witnesses unassailable. Indeed had Xavier's admissions of guilt and exoneration of petitioner come before the jury it is entirely possible the jurors would have believed this evidence over the contrary testimony of the victim's family and neighbors. Remember half the members of the earlier jury had not found this eyewitness testimony sufficiently convincing to convict petitioner. Why it proved unpersuasive is not part of this record. Perhaps it was because the majority of these eyewitnesses had wavered in their pretrial identifications of the shooter. Perhaps it was because some jurors at the first trial were concerned the witnesses were angrier at petitioner than his brother. This could have led the witnesses to talk it over after some had initially identified Xavier as the shooter and decide to name the petitioner as the shooter at the trial. Or perhaps some jurors at the first trial discredited the eyewitness testimony thinking these witnesses decided to pin the blame on petitioner because they felt that whoever pulled the trigger it was really petitioner's mission of revenge which led to the tragic shooting of their brother and neighbor.\n\nIf six jurors at the first trial had enough doubts about petitioner's guilt to vote acquittal without hearing Xavier's in-court confession or out-of-court admissions, how can we say no juror at the second trial could have voted to acquit petitioner if they had heard this evidence?\n\nIndeed, this case closely resembles the facts in In re Hall, supra, 30 Cal. 3d 408, where the Supreme Court reached the same conclusion as I urge here. There, the defendant's attorney failed to investigate or present evidence that a third party murdered the victim. (Id. at pp. 421, 428.) In finding the attorney acted incompetently, the Supreme Court noted: \"Representation of an accused murderer is a mammoth responsibility. When [the attorney] received information suggesting that his client was falsely accused of this most serious of crimes and that the guilty party was intimidating witnesses, he should have recognized his heightened obligation to investigate the case, to pursue reluctant witnesses, and to redouble efforts to overcome the unusual obstacles placed in the path of developing the apparent truth. Instead, he incompetently delegated his duty to others, and in effect deprived his client of a constitutionally guaranteed opportunity to prove his innocence. Through the dedicated efforts of family, friends, new\n\ncounsel and many others in a common crusade for justice, petitioner has, after three years in prison, fully and convincingly demonstrated his right to receive that opportunity anew.\" (Id. at p. 434.)\n\nThe same things can be said about any third trial that might take place were this petition granted. Once again petitioner could anticipate the probability of a more favorable result. Xavier would either testify or take the Fifth Amendment. If Xavier elected to assert his right against self-incrimination then his two posttrial confessions -- one written under penalty of perjury and the other recorded on tape -- would be admitted. So would his mother's testimony he had confessed to her it was he rather than petitioner who fired the fatal shot. And to reinforce Xavier's out-of-court admissions there would be all the testimony revealing the majority of eyewitnesses initially identified Xavier rather than petitioner as the man who fired the shot which killed the victim.\n\nFor all these reasons, I am firmly convinced petitioner is entitled to a new trial.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Indeed, on this record at least, it is not out of the question that after reversal of petitioner's conviction Xavier Sanders could be tried for this crime rather than retrying petitioner. In an effort to justify the trial counsel's behavior and thereby save the present conviction, the trial court and the majority opinion spin a diaphanous web composed entirely of what the California Supreme Court labels \"compound conjecture\" and call it findings. Unfortunately, unless a higher court intervenes this \"compound conjecture\" will be enough to condemn the brother who proclaims his innocence -- and could well be innocent -- to spend his best years in prison while the brother who admits the crime remains free. I have trouble finding the justice in that.\n\nHomicide is the most heinous of crimes. It is crucial the courts convict and punish the culprit. But it is also imperative we take extraordinary pains to insure the person we convict and punish indeed was the culprit. I unhappily conclude we have not done so in this case.\n\nAppendix\n\nDOUBLE CLICK TO VIEW ILLUSTRATION\n\nDOUBLE CLICK TO VIEW ILLUSTRATION\n\nDOUBLE CLICK TO VIEW ILLUSTRATION\n\nEnclosed is a copy of the discipline record you requested on an attorney. Provided below is a list of abbreviations most used in the supplemental records and a short glossary of terms. If you have further question on how to interpret the records you may contact Jennifer at 415/561-8200 X7443.\n\nAbbreviations\n\nBM: Bar Miscellaneous Number (equal to a case number)\n\nCt: Court\n\nhrg: hearing\n\nhrr: hearing, report and recommendation\n\nPC: Penal Code\n\nPRE, PREx or Prof. Resp. Exam: Professional Responsibility Exam\n\nProb: Probation\n\nRD: Review Department\n\nrec: recommendation\n\nrpt: report\n\nSBCt: State Bar Court\n\nS Ct: Supreme Court\n\nsusp: suspension\n\nVol: Voluntary\n\nGLOSSARY\n\nNotice to show Cause: A form of summons or order of notice in which the attorney is ordered to appear and show cause why judgment should not be brought against him.\n\nRule 955: The member must notify all clients and counsel of his/her status and effective date; return all paper or property to clients within the court appointed time and show proof thereof.\n\nRule 960: The attorney agrees to enroll as an inactive member upon submitting his/her resignation so perpetuation of testimonies can take place before the Supreme Court accepts the resignation with charges pending.\n\nWrit of Review: Request for an attorneys recommended discipline to come before the Supreme Court of California for oral argument to be heard as to why the attorney feel discipline should not be imposed.\n\nNote: For specific information with regard to any of the disciplinary actions taken or decisions filed on the public record, please call the State Bar Court Clerks office in Los Angeles at 213/689-6200.\n\nTHE STATE BAR OFFICE OF STATE BAR COURT\n\nOF CALIFORNIA Director, STUART A. FORSYTH\n\nCOURT CLERK'S OFFICE, 818 WEST SEVENTH (213) 689-6200\n\nSTREET, SUITE 201, LOS ANGELES,\n\nCALIFORNIA 90017-3432\n\nPERSONAL AND CONFIDENTIAL\n\nNOTICE ACCOMPANYING SERVICE OF HEARING PANEL DECISION IN CASE NUMBER 83-O-11184 (88-O-187 LA) IN THE MATTER OF Philip Jefferson, Esq.\n\n(ENTRY OF DEFAULT)\n\nEnclosed is the hearing panel's Decision which was filed in the above-entitled matter.\n\nAccording to the records of the State Bar Court, a copy of the Notice of Entry of Default was previously mailed to you pursuant either Rule 552.1(c) or to Rule 555 of the Rules of Procedure of the State Bar pertaining to nonappearance. Rule 555.1, a copy of which is attached, provides that \"A member whose default has been entered . . . may seek relief from default . . . on the grounds of the member's mistake, inadvertence, surprise or excusable neglect. Those grounds shall be interpreted and applied in the same manner as in civil matters arising under section 473, Code of Civil Procedure.\" Your attention is specifically directed to Rule 555.1(b) which provides that \"Any motion seeking relief from default, shall be filed no later than seventy-five (75) days after entry of the member's default.\"\n\nDECLARATION OF SERVICE\n\nI, the undersigned, over the age of 18 years, whose business and place of employment is 818 West Seventh Street, Los Angeles, California, declare that I am not a party to the within action; that in the City and County of Los Angeles, on the date shown below, I deposited a true copy of the above Notice of Entry of Default, Hearing Panel Decision, and Rules of Procedure 552.1, 555 and 555.1 in a sealed envelope as follows:\n\nIn a facility regularly maintained by the United States Postal Service with postage thereon fully prepaid addressed to:\n\nPhilip Jefferson, Esq., 2614 South Western Avenue, Los Angeles, CA 90018\n\nPatsy Cobb, A/L., State Bar of California, 333 S. Beaudry Street, 9th Floor, Los Angeles,\n\n\u003cspan class=\"fn\"\u003e1. Unless otherwise noted all statutory references are to the Penal Code.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Norman Gregory did not testify. He was shot and killed by the second gunshot.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The court also gave CALJIC No. 17.31 (4th ed. 1979) which instructed the jury to disregard inapplicable instructions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Even in those unusual circumstances the error was held to be harmless. (Id. at pp. 516-517.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Mr. Philip Jefferson represented appellant at trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Ms. Leslie H. Abramson represented appellant at his sentence hearing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. We need not comment upon the precipitous prospect of judicial action based only upon such hearsay representations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The jury in appellant's first trial was unable to reach a verdict. Appellant was represented by Attorney Mark Bledstein.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The claimed relevancy is the need to prove Mr. Jefferson's unavailability at the October 27, 1989, habeas corpus evidentiary hearing. On page 39 of that hearing's transcript the parties stipulated to Mr. Jefferson's unavailability, a fact ignored by the dissent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. An indigent defendant is presumptively entitled to a free trial transcript (People v. Hosner (1975) 15 Cal. 3d 60 [123 Cal. Rptr. 381, 538 P.2d 1141]). Appellant, always represented by private counsel, makes no indigency claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The majority opinion contends the record does not reflect the background of Jefferson's absence from the hearing. It does. True, the trial court ruled this evidence inadmissible. But petitioner's counsel wisely made an offer of proof which stated he possessed admissible evidence of the recommendation for disbarment, the reasons for the recommendation, and the fact Jefferson had thereafter accepted inactive status and left the state. The prosecution did not controvert the truth of this offer of proof only the relevance of the evidence. This evidence was admissible and should have been admitted to prove Jefferson's unavailability since that unavailability was a prerequisite to the introduction of much of the evidence at the hearing, especially that relating his out-of-court statements about his previously existing state of mind. (Evid. Code, § 1251, subd. (a); 1 Witkin, Cal. Evidence (3d ed. 1986) The Hearsay Rule, § 739, pp. 719-720; 2 Johnson, Cal. Trial Guide (1986) § 40.43[2][a], pp. 40-193 - 40-194.) The majority points out the parties stipulated to Jefferson's unavailability. This stipulation did not necessarily foreclose petitioner from introducing independent evidence as to the trial lawyer's unavailability and the reasons for it. In any event, this evidence was admissible for other reasons and as to other issues in the case. (See pp. 392-393, post.) Subsequent to the habeas corpus hearing the State Bar proceeded to disbar Jefferson. I have attached as an appendix to this modification the State Bar's record of the disbarment and Jefferson's disciplinary record leading up the disbarment. These documents support and amplify petitioner's offer of proof at the habeas corpus hearing. (See appendix to dissent.) I have taken judicial notice of these disciplinary documents pursuant to Evidence Code section 452. (Younger v. Solomon (1974) 38 Cal. App. 3d 289, 299 [113 Cal. Rptr. 113].) This evidence has become still more relevant because of the speculations the majority opinion attempts to use to justify Jefferson's failure to investigate and use Xavier's admissions in petitioner's defense. As will be discussed later in this dissent, the majority in effect employs a tautology. The opinion argues Jefferson was not incompetent because a competent and ethical lawyer would not have done what he did unless he had good reason. To state it as a syllogism: A competent and ethical attorney does not fail to investigate and use a valid third party confession. Jefferson is a competent and ethical attorney. Consequently, the third party confession must have been invalid. Or in other words, Jefferson was competent because he was competent. Thus, at its heart the majority's argument is based on assumptions about Jefferson's character -- his competence and ethical behavior. This places Jefferson's competence and ethical standards in issue and makes evidence bearing on those attributes of his character independently admissible. One cannot assume a person's good character and make speculative inferences based on that assumed good character and then reject evidence demonstrating the assumption is erroneous and indeed the person has bad character. (See, e.g., Pugh v. See's Candies, Inc. (1988) 203 Cal. App. 3d 743, 756-757 [250 Cal. Rptr. 195]; Evid. Code, § 1100; 1 Witkin, Cal. Evidence, supra, Circumstantial Evidence, § 329, at pp. 301-302; 3 Johnson, Cal. Trial Guide, supra, § 50.01[4], at pp. 50-5 - 50-6.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The majority devotes five full pages to an attempted refutation of this one paragraph mention that Jefferson should have obtained a transcript of the first trial. In this, perhaps the majority doth protest too much. Upon reflection, this one of Jefferson's many failures may be a worse default than I originally felt. The more I reread this section of the majority opinion the more I am convinced it is. Originally I cited the failure to obtain a transcript of the first trial primarily to evidence Jefferson's generally lackadaisical approach to his defense of petitioner at the second trial. This failure coupled with others further refutes the assumption so vital to the majority's speculations, the assumption that Jefferson was a competent and highly ethical attorney who would not have failed to pursue a potentially valid third party confession but would have refused to pursue one he knew to be perjurious. At the risk of producing a five-page footnote to rebut a five-page critique over what I regard as one of Jefferson's less critical but quite revelatory failures as defense counsel, I will make a few observations. First, the transcript could have been obtained. The expert witness, Fitzgerald, had no trouble obtaining the transcript and reviewing it for the habeas corpus hearing. Second, this witness, an experienced trial counsel whom the prosecution stipulated was an expert in criminal defense, testified unequivocally that in order to render effective representation at the second trial Jefferson should have obtained a transcript of the first trial. \"(W)here the second attorney differs from the first attorney and wasn't present at the first trial, I think it's absolutely imperative that the lawyer obtain the transcript of the first trial.\" (Italics added.) The importance of this step is further underscored by the fact the opportunity to have a transcript of the first trial is deemed so critical it is guaranteed as a matter of constitutional right. (Britt v. North Carolina (1971) 404 U.S. 226 [30 L.Ed.2d 400, 92 S.Ct. 431]; People v. Hosner (1975) 15 Cal. 3d 60 [123 Cal. Rptr. 381, 538 P.2d 1141] [denial of transcript of first trial is per se reversible error]; People v. Bigelow (1984) 37 Cal. 3d 731 [209 Cal. Rptr. 328, 691 P.2d 994, 64 A.L.R.4th 723].) There may be some legitimate dispute whether Jefferson's incompetence in failing to obtain a transcript so prejudiced petitioner's actual defense at the second trial that we can say but for this particular incompetence petitioner would have had a more favorable outcome. The California Supreme Court, however, has recognized this is such an impossible task for an appellate court to undertake we must presume prejudice. \"Even if an appellate court were to undertake the extraordinary burden of reviewing the records of both trials, the court would only be able to hypothesize what use at the latter trial could have been made of the transcript of the former trial. While the assessment of the prejudicial effect of error always requires some speculation by the reviewing court as to how an average jury would have decided the case in the absence of error, an entirely new level of compound conjecture would be entailed in a court's first speculating what evidence might have been impeached, and how, and only then speculating how the trier of fact would have reacted to the speculated efforts at impeachment.\" (People v. Hosner, supra, 15 Cal. 3d 60, 70. Italics added.) In any event and at a minimum, there is little doubt Jefferson demonstrated incompetence when he failed to secure a transcript of the first trial. And there is little doubt this provides evidence of Jefferson's lackadaisical attitude toward the preparation and presentation of petitioner's defense at the second trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The majority opinion contends Jefferson interviewed Xavier in confidence and thereafter chose not to use his testimony. However, the record does not support this factual assertion. Instead it supports the conclusion Jefferson refused to talk with Xavier.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Although this disbarment is not part of the record on appeal, it relates to \"findings\" in the majority opinion which likewise were not part of the record. Jefferson's disciplinary record is appended because it bears on the majority's supplementary \"findings\" about Jefferson's conduct, intent and motives not because it bears on the trial court's findings. As to those supplementary \"findings\" this disciplinary record is both timely and cogent evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Evidence of specific acts of misconduct is admissible if it bears on issues of motive, knowledge or intent. (Evid. Code, § 1101, subd. (b); People v. Williams (1988) 44 Cal. 3d 883, 904 [245 Cal. Rptr. 336, 751 P.2d 395]; People v. Beamon (1973) 8 Cal. 3d 625, 632 [105 Cal. Rptr. 681, 504 P.2d 905]; Andrews v. City and County of San Francisco (1988) 205 Cal. App. 3d 938 [252 Cal. Rptr. 716].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. All evidence in the case proves there was one shooter and one shooter only. If Xavier admits as he did that he owned the gun, took the gun out of the trunk of the car, and then fired the gun, this is very strong circumstantial evidence the bullets shot by the only gun fired that day killed the victim. Even at the evidentiary hearing, Xavier willingly testified he owned the gun, placed it in the trunk of the BMW, drove to the Gregory residence, there taking the gun from the trunk. Xavier further testified neither petitioner nor Kelvin knew of the rifle in the car and he saw neither petitioner nor Kelvin fire a gun. In other words, Xavier testified to most of the information contained in his declaration with the exception of admitting on the stand he fired the rifle. When asked this particular question then and only then did he invoke his Fifth Amendment rights against self-incrimination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. A leading commentator on California evidence law correctly points out Evidence Code section 1230, unlike some other hearsay exceptions, contains no separate requirement of \"trustworthiness.\" (1 Jefferson, Cal. Evidence Benchbook, supra, at pp. 268-269.) Jefferson criticizes Chapman for this error in its analysis. \"The Chapman holding is correct but its reasoning is unsound. There is no requirement set forth in Evid. § 1230 for the declaration-against-interest exception to the hearsay rule that the trial judge must make a finding that the statement is trustworthy as a prerequisite to admissibility. What Chapman should have said was that the circumstances were such that the proponent of [the declarant's] statement failed to satisfy the trial judge as to the requirement set forth in Evid. § 1230 'that a reasonable man in his position would not have made the statement unless he believed it to be true.' The evidence of a motive to falsify because of threats would certainly justify a trial judge in finding that a reasonable man would make the statement which the proponent sought to have introduced even though he believed the statement to be untrue.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The instant case likewise is distinguishable from People v. Blankenship (1985) 167 Cal. App. 3d 840 [213 Cal. Rptr. 666], another decision excluding a third party admission of guilt. In that case, the purported admission was made to the defendant. So the defendant -- and only the defendant -- was in a position to testify that the third person had in fact confessed to these crimes. \"As the proposed testimony was to come from defendant himself it was highly suspect both because defendant had a motive to falsify and because accurate details concerning the crime could be explained by defendant's own knowledge and guilt rather than [the declarant's].\" (Id. at p. 849.) Here we have Xavier's signed statement under oath, his confession to his mother, his admission to his own first counsel, Bledstein, his testimony at the habeas corpus hearing, and his apparent eagerness to make the same admission to his brother's defense counsel. Consequently, in sharp contrast with Blankenship, there was no reason to doubt the veracity of the several witnesses in a position to testify as to whether the declarant said anything and what he actually said.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. It is also possible to speculate Xavier's several confessions are part of an elaborate plot concocted by the Sanders family to save both brothers from conviction for this crime. A possible scenario for this speculation might run along the following lines. After petitioner's conviction is reversed Xavier's confessions are used to win acquittal for petitioner at his retrial. Xavier then reneges on his confessions and petitioner confesses his own guilt to win acquittal of his brother at Xavier's trial. At this stage, the confessing petitioner cannot be retried because of double jeopardy. This scenario does not work, of course, if Xavier instead of petitioner is tried first after reversal of petitioner's conviction. Petitioner would still have the possibility of his own retrial hanging over his head during Xavier's trial and would nearly guarantee a return trip to prison by confessing guilt -- honestly or dishonestly -- at Xavier's trial. But the real point is all of this is mere speculation. There is no evidence in this record establishing any collusion among members of the Sanders family to have Xavier falsely admit his guilt as a step toward saving both his brother and himself from criminal responsibility for this homicide. In the absence of such evidence, we cannot say the speculative possibility of such collusion among family members can support a blanket exception to Evidence Code section 1230 that declarations against penal interest are inadmissible if they were made by a brother -- or perhaps any relative -- of the defendant. To do so would represent judicial activism of the rankest sort since nothing in the language of section 1230 suggests any such exception. Indeed an exception of this nature might be unconstitutional. In Chambers v. Mississippi (1973) 410 U.S. 284, 301-302, footnote 21 [35 L.Ed.2d 297, 312, 93 S.Ct. 1038], the United States Supreme Court expressly rejected the state's argument the possibility two defendants might collude to avoid successful prosecution of either was enough to justify a rule disallowing third party confessions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Under California law, prior inconsistent statements are admissible to prove the truth of the matter the declarant asserted not merely to impeach the declarant's testimony on the witness stand. In other words, a prior inconsistent statement is substantive evidence and by itself can support a finding or judgment which is the direct opposite of the witness's trial testimony. (See Cal. Law Revision Com. com., Deering's Ann. Evid. Code, § 1235 (1986 ed.) pp. 389-390; 1 Witkin, Cal. Evidence, supra, § 701, at pp. 686-687; 2 Johnson, Cal. Trial Guide, supra, § 40.36[2], at pp. 40-123 - 40-124.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. At one point the majority spins the charming little fable of \"Charlie Fessup and the Three Clergy.\" As a parable designed to teach a lesson, however, it should have been saved for a different case. In the case before this court, Xavier was in Los Angeles at the scene of the crime, not in New York. So were \"the bishop, the rabbi, and the minister\" and two of them initially told the police Xavier was the culprit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The majority opinion argues Xavier's several statements would be inadmissible as declarations against interest because they were able to identify some inconsistencies in isolated portions of those statements. I do not intend to bother to reconstruct the entire statements and compare where these statements are consistent and where they are inconsistent. Nor will I bother contrasting the relevance of the consistent portions with the relevance of the inconsistent portions. None of this analysis bears on the admissibility of these statements as declarations against interest. Consistency is not a hobgoblin for declarations against interest. There is no foundational requirement that all of a declarant's statements be consistent -- or even equally incriminating -- for one or more of them to be admissible. A jury is free to believe the most incriminating portions of each statement and reject the less incriminating portions. Consequently, the person making several such statements is subjecting himself to possible penal consequences for the most incriminating version of his involvement which can be constructed from the combined statements. Each of Xavier's statements mentioned in the majority's \"inconsistency\" argument satisfies the applicable foundational requirement that the statement incriminate him. Combining the more incriminating portions of each creates a full scale confession of guilt. Accordingly, all are admissible. Even if there were a doubt about some, clearly the most incriminating ones must be admissible. It would make no more sense to exclude Xavier's several statements as declarations against penal interest because of some inconsistencies among them than it would to exclude several confessions a defendant might have given law enforcement because there were some inconsistencies among those confessions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. After dealing with the issues the majority raises in its \"Response to Dissent,\" I note there remains a detritus of ad hominem comments directed at the dissent. These remarks are uncharacteristic and unworthy of members of this division. Regarding them as an aberration not a trend, I decline to respond in kind.\u003c/span\u003e\n\n",
    "body_length": 148306,
    "citedas": [
      "221 Cal. App. 3d 350",
      "271 Cal. Rptr. 534"
    ],
    "attorneys": "R. Charles Johnson for Defendant and Appellant and for Petitioner. Rowan K. Klein as Amicus Curiae on behalf of Defendant and Appellant and for Petitioner. John K. Van de Kamp, Attorney General, Steve White, Chief Assistant Attorney General, Linda C. Johnson, Roy C. Preminger and Sharon R. Wooden, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "36",
      "78"
    ],
    "judges": "Opinion by Woods (Fred), J., with Lillie, P. J., concurring. Separate dissenting opinion by Johnson, J.",
    "citation_count": 0
  }
}
