{
  "id": "I4H6PWYBTlTomsSBTohx",
  "document": {
    "title": "In re Cendant Corp. Litigation",
    "full_title": "IN RE: CENDANT CORPORATION LITIGATION JOANNE A. ABOFF FAMILY TRUST, U/A DATED 2/11/92 IN NO. 00-2520 BETTY DUNCAN IN NO. 00-2683 TERE THROENLE IN NO. 00-2708 JANICE G. DAVIDSON; ROBERT M. DAVIDSON, IN HIS CAPACITY AS TRUSTEE OF ROBERT M. DAVIDSON CHARITABLE REMAINDER UNITRUST, AND AS CO-TRUSTEE OF ELIZABETH A. DAVIDSON IRREVOCABLE TRUST, EMILIE A. DAVIDSON IRREVOCABLE TRUST, JOHN R. DAVIDSON IRREVOCABLE TRUST, EMILIE A. DAVIDSON CHARITABLE REMAINDER UNITRUST AND JOHN R. DAVIDSON CHARITABLE REMAINDER UNITRUST IN NO. 00-2709 FAYE SCHONBRUNN IN NO. 00-2733 ANN MARK IN NO. 00-2734 NEW YORK CITY PENSION FUNDS IN NO. 00-2769 NEW YORK CITY PENSION FUNDS IN NO. 00-3653",
    "jurisdiction": "Third Circuit",
    "date": "2001-08-28T00:00:00.000Z",
    "docket": "No. 00-2520,, 00-2683,, 00-2708,, 00-2709,, 00-2733,, 00-2734,, 00-2769,, 00-3653",
    "body": "Argued: May 22, 2001\n\nOPINION OF THE COURT\n\nI. INTRODUCTION \u0026 SUMMARY\n\nThese are consolidated appeals from the District Court's approval of a $3.2 billion settlement of a securities fraud class action brought against Cendant Corporation and its auditors, Ernst \u0026 Young, and the Court's award of $262 million in fees to counsel for the plaintiff class. Both the settlement and the fee award are challenged in these appeals. The enormous size of both the settlement and the fee award presages a new generation of \"mega cases\" that will test our previously developed jurisprudence.\n\nThis case is governed by the Private Securities Litigation Reform Act of 1995 (PSLRA or Reform Act). Under the Reform Act, one of a district court's first tasks is to select a lead plaintiff. Once the lead plaintiff has been appointed, the statute provides that the lead plaintiff \"shall, subject to the approval of the court, select and retain counsel to represent the class.\" The District Court, after appointing a lead plaintiff, declined to approve its choice of counsel, instead choosing to select lead counsel by means of an auction. The most important question presented by these appeals is whether this decision was compatible with the PSLRA. Closely intertwined, and also of great importance, are issues involving the proper procedures for selecting a lead plaintiff and for awarding counsel fees in cases governed by the Reform Act.\n\nBefore we can reach these issues, however, we must decide whether the District Court abused its discretion in approving the settlement and the plan for allocation of damages, to which objections were interposed. Some objectors argue forcefully that the settlement was inadequate under the nine-factor test that this Court developed for reviewing the fairness, reasonableness, and adequacy of class action settlements in Girsh v. Jepson, 521 F.2d 153 (3d Cir. 1975). Noting that the class's case was exceptionally strong because Cendant (the main defendant) virtually conceded liability and because some of the plaintiffs' claims (i.e., those presented underS 11 of the Securities Act of 1933) were strict liability claims, these objectors contend that, notwithstanding the threat of bankruptcy if the settlement was too high, a considerably higher figure could have been extracted under these favorable liability circumstances without running the risk that Cendant would seek bankruptcy protection. In their submission, the class should have received a fuller recovery of its alleged $8.8 billion loss.\n\nThese objections are weighty, but other Girsh factors counsel strongly in favor of approving the Cendant settlement--the reaction of the class, the stage of the proceedings, the risk of establishing damages, the range of reasonableness in light of the possible recovery and the litigation risks, and, though to a lesser degree, the complexity of the litigation. Although we think that the question of the fairness of the settlement under the Girsh factors is closer than the District Court made it out to be, our application of those factors supports the conclusion that the District Court did not abuse its discretion in approving the Cendant settlement.\n\nThe issue is even clearer with respect to the settlement between the class and Ernst \u0026 Young (E\u0026Y), against which the case was far more difficult. As with Cendant's settlement, the reaction of the class, the risk of establishing damages, and the range of reasonableness of the recovery weigh in favor of approving the E\u0026Y settlement. These factors are augmented by two other Girsh factors that weigh strongly in favor of the E\u0026Y settlement: the complexity of litigation and the risk of establishing liability. Because the ability to withstand a greater judgment is the only Girsh factor that cuts against approving the E\u0026Y settlement, we conclude that the District Court did not abuse its discretion in approving it.\n\nOne objector also argues that the District Court should not have approved the settlement because the entities that comprise the lead plaintiff were too conflicted to represent the class adequately. The bases for this claim are two-fold. First, the institutional investors that make up the lead plaintiff continued to hold Cendant stock during the litigation and settlement process, and thus, the objector submits, had very different motives from other investors who had sold their stock. Second, the lead plaintiff negotiated as part of the settlement certain corporate governance changes that will benefit only those class members that continue to hold Cendant stock. We are unpersuaded by the first argument because it is clear that Congress, in passing the PSLRA, for better or for worse, anticipated and implicitly approved the notion that entities that continued to hold stock in the defendant corporation would serve as lead plaintiffs notwithstanding the existence of many class members who did not. With respect to the second argument, there is no evidence that the lead plaintiff gave up anything of value to the class members to induce Cendant to agree to the corporate governance changes. We therefore hold that the District Court did not abuse its discretion in approving the settlement.\n\nWe then turn to the objections regarding the allocation of the settlement fund. One objector contends that the claims under S 11 of the Securities Act of 1933, which only a subset of the class possesses, are legally stronger than the other claims held by class members, i.e., claims under S 10(b) of the Securities Exchange Act of 1934. Based on this disparity, the objector argues that the S 11 claimants should receive a larger share of the settlement proceeds. We conclude, however, that the S 11 claims here are not necessarily legally stronger than the S 10(b) claims, and that, at any rate, the basis for measuring the different legal strengths of the claims involved is too speculative to support the objector's contention. We thus hold that the District Court did not abuse its discretion in approving a settlement allocation that treated all claims more or less equally.\n\nHaving determined that the settlement may stand, we must examine the District Court's award of counsel fees. Because the Reform Act establishes a detailed and integrated process for choosing a lead plaintiff, selecting lead counsel, and approving counsel's fee, we discuss these issues sequentially. In this case, the District Court selected as lead plaintiff a group made up of three pension funds (the CalPERS Group or Lead Plaintiff). Following the dictates of the Reform Act, the court first identified that Group, which is made up of three huge government pension funds, as being the movant with the largest financial interest in the relief sought by the class. The court then made a preliminary determination that the CalPERS Group satisfied Federal Rule of Civil Procedure 23's typicality and adequacy requirements, which, under the PSLRA, made it the presumptive lead plaintiff. The District Court ultimately appointed the CalPERS Group as lead plaintiff because it determined that no member of the plaintiff class had succeeded in rebutting the statutory presumption. We find no fault with the court's decisions on this score.\n\nThe Lead Plaintiff then asked the District Court to appoint as lead counsel two firms with which it had previously negotiated a Retainer Agreement, Bernstein, Litowitz, Berger, \u0026 Grossmann of New York City, and Barrack, Rodos \u0026 Bacine of Philadelphia. The court declined initially to approve the Lead Plaintiff 's choice, deciding instead to select lead counsel via an auction, but giving the CalPERS Group's chosen counsel the option to match what the court determined to be the lowest qualified bid. Those firms exercised this option and were appointed as lead counsel. Following the settlement of the case, and consonant with the results of the auction, Lead Counsel petitioned for and was awarded a sum of $262 million in counsel fees, even though that amount was at least $76 million higher than that provided for under the Retainer Agreement.\n\nWe conclude that the court's decision to hold an auction to select lead counsel was inconsistent with the Reform Act, which is designed to infuse lead plaintiffs with the responsibility (and motivation) to drive a hard bargain with prospective lead counsel and to give deference to their stewardship. Although we believe that there are situations under which the PSLRA would permit a court to employ the auction technique, this was not one of them. Here, inasmuch as the Lead Plaintiff conducted its counsel search with faithful observance to the letter and spirit of the Reform Act, it was improper for the District Court to supplant the CalPERS Group's statutorily-conferred right to select and retain lead counsel by deciding to hold an auction. In sum, we hold that the District Court erred in using an auction to appoint lead counsel; rather it should have done so pursuant to the terms of the Retainer Agreement.\n\nBecause the District Court's process resulted in the firms chosen by the Lead Plaintiff being appointed lead counsel anyway, this error was harmless (with regard to the selection of lead counsel). However, because the terms of the Retainer Agreement required the prior approval of the pension funds comprising the CalPERS Group, and that prior approval was not obtained, the fee request here was improper. The fee award must therefore be set aside and this matter remanded to the District Court with instructions to dismiss the fee application and to decline to accept any further applications that are submitted without the prior approval of the Funds.\n\nIt goes without saying that the principal focus after remand will be the counsel fee application which will be resubmitted. The parties have extensively briefed and argued the fee award issue, understanding that if the award is set aside the District Court will need guidance on remand. Having this need in mind--along with the fact that this case, in its various facets, has been before this Court seven times now--we will set forth the standards that the court should follow in evaluating a properly-submitted fee request in Reform Act cases so as to help bring this now protracted matter to a close. Although in general the court should use the same seven-factor test that our cases have developed for reviewing fee requests in other class action contexts, review in PSLRA cases must be modified to take into account the changes wrought by the Reform Act. The biggest change, we believe, is that courts should afford a presumption of reasonableness to fee requests submitted pursuant to an agreement between a properly-selected lead plaintiff and properly-selected lead counsel.\n\nThis is not to say, however, that this presumption cannot be overcome. There is an arguable tension between the general schema of the PSLRA on the one hand and its overarching provision that requires the court to insure that counsel fees not exceed a reasonable amount, see 15 U.S.C. S 78u-4(a)(6), on the other. We hold that the presumption will be rebutted when a district court finds the fee to be (prima facie) clearly excessive.\n\nFor the past decade, counsel fees in securities litigation have generally been fixed on a percentage basis rather than by the so-called lodestar method. Consistent with that approach, we have held that, when the percentage fee is challenged, the Court's obligation to award a reasonable fee will be best exercised by application of the factors described in Gunter v. Ridgewood Energy Corp., 223 F.3d 190 (3d Cir. 2000). Gunter itself allows for the possibility of a lodestar cross-check, see id. at 200, even though the lodestar approach is no longer favored. We conclude that, in determining whether the retainer agreement between the Lead Plaintiff and Lead Counsel is clearly excessive, the court should first use the Gunter factors to evaluate it, for the lodestar cross-check is quite time consuming. But if the court cannot otherwise come to a resolution, it can consider a lodestar cross-check.\n\nIn determining whether the presumption of reasonableness of a properly submitted fee request has been rebutted here, the District Court will have to consider the powerful arguments of the objectors that: (1) this was a simple case in terms of liability; (2) the settlement was achieved without a great deal of work by lead counsel; and (3) both the fee award of $262 million under the auction and (potentially up to) $187 million under the Retainer Agreement are staggering in their size, and, on the basis of the evidence in the record, may represent compensation at an astonishing hourly rate (as well as an extraordinarily high lodestar \"multiplier\").\n\nWe conclude by explaining that, if the court's deliberations were to confirm that the fee agreed to by a lead plaintiff and lead counsel was clearly excessive, the court will need to set a reasonable fee according to the standards our previous cases have set down for class actions not governed by the PSLRA.\n\nII. FACTS \u0026 PROCEDURAL HISTORY\n\nA. Background\n\nCendant Corporation, the main defendant, was formed by a December 17, 1997 merger of CUC International, Inc. (CUC) and HFS Incorporated (HFS). Pursuant to a Registration Statement and Joint Proxy Statement/Prospectus, HFS shareholders tendered their shares in exchange for CUC shares. HFS was then merged into CUC and the combined company was renamed Cendant. Cendant is currently one of the world's largest consumer and business service companies; among its more well-known businesses are Avis, Century 21, and the Ramada and Howard Johnson hotel franchise chains.\n\nOn March 31, 1998, Cendant filed its Form 10-K Annual Report with the SEC, which included the company's 1997 financial statements. Two weeks later, after the close of trading on April 15, 1998, Cendant announced that it had discovered \"accounting irregularities\" in certain units of the former CUC. The notice stated that Cendant expected to restate its annual and quarterly financial statements for 1997 and possibly for earlier periods as well; it also stated that Cendant had retained the law firm Willkie Farr \u0026 Gallagher (Willkie Farr) to conduct an investigation into its past financial statements and the allegations of fraud made by some Cendant employees. The next day, Cendant's stock fell 47%, from $35-5/8 to $19-1/16 per share, triggering several class action lawsuits on behalf of investors who purchased CUC or Cendant stock during 1997.\n\nOn July 14, 1998, Cendant announced that it would also restate CUC's annual and quarterly financial statements for 1995 and 1996. Following this announcement, Cendant's stock fell by another 9%, to $15-11/16 per share. On August 28, 1998, Cendant filed Willkie Farr's report of its investigation, with the SEC. The report revealed that Cendant would restate its 1995, 1996, and 1997 financial statements by approximately $500 million. On August 31, 1998, the first trading day after Cendant's disclosure of the Willkie Farr report, Cendant's stock fell another 11%, to $11-5/8. The disclosure of the report triggered several more lawsuits arising from purchases of CUC securities during the broader period of alleged fraud. All told, Cendant shareholders lost more than $20 billion in market capitalization.\n\nBetween April and August 1998, at least sixty-four putative securities fraud class action lawsuits were filed nationwide as a result of the above disclosures. Generally speaking, the lawsuits alleged that, from 1995 to 1998, CUC/Cendant had issued a series of materially false and misleading statements in the form of quarterly reports, annual reports, registration statements, prospectuses, and press releases, and that these statements artificially inflated CUC/Cendant's stock price. The lawsuits named as defendants Cendant, its officers and directors, and other parties--including E\u0026Y, which had acted as CUC's independent public accountant from 1983 until the time of the creation of Cendant. E\u0026Y had also performed a post-merger audit of the financial statements of Cendant Membership Services, a wholly-owned subsidiary of Cendant, for the year ending December 31, 1997. The lawsuits alleged that E\u0026Y had issued unqualified reviews and audit opinions certifying CUC's quarterly and annual reports, and that E\u0026Y had failed to adhere to Generally Accepted Auditing Standards and thus lacked any reasonable basis for its opinions and reports.\n\nCendant eventually filed a cross-claim against E\u0026Y, detailing allegations that E\u0026Y became aware of the fraud long before it was made public but chose to conceal and facilitate it, thereby continuing to garner millions of dollars in fees. Alternatively, Cendant alleged that E\u0026Y was negligent in failing to discover the fraud earlier. E\u0026Y strenuously denied all the allegations made in the amended cross-claim, pointing out that Cendant had not provided any evidence or documentation to back up the allegations.\n\nBy order of the Judicial Panel on Multidistrict Litigation, all cases relating to Cendant's accounting irregularities were transferred to the United States District Court for the District of New Jersey. On May 29, 1998, the District Court consolidated all of them under the caption In re Cendant Corporation Litigation.\n\nB. The Appointment of Lead Plaintiff and Lead Counsel\n\nAfter consolidation, two of the District Court's first responsibilities were to appoint a lead plaintiff and lead counsel to represent the putative class. The PSLRA lays out detailed procedures for courts to follow in making these decisions, directing them to appoint \"the most adequate plaintiff \" as the lead plaintiff, and instructing them to \"adopt a presumption\" that the most adequate plaintiff is the movant that \"has the largest financial interest in the relief sought by the class\" and \"otherwise satisfies the requirements of Rule 23 of the Federal Rules of Civil Procedure.\" 15 U.S.C. S 78u-4(a)(3)(B)(i) \u0026 (iii)(I).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The presumption \"may be rebutted only upon proof by a member of the purported plaintiff class that the presumptively most adequate plaintiff will not fairly and adequately protect the interests of the class or is subject to unique defenses that render such plaintiff incapable of adequately representing the class.\" Id.S 78u-4(a)(3)(B)(iii)(II). With regard to the selection of lead counsel, the statute provides that \"[t]he most adequate plaintiff shall, subject to the approval of the court, select and retain counsel to represent the class.\" Id. S 78u-4(a)(3)(B)(v).\n\nFifteen individuals and groups filed motions to serve as lead plaintiff, and the District Court held a hearing on August 4, 1998. It soon became clear that the CalPERS Group--a consortium of the three largest publicly-managed pension funds in the United States: the California Public Employees' Retirement System (CalPERS), the New York City Pension Funds (NYCPF), and the New York State Common Retirement Fund (NYSCRF)--had, by far,\"the largest financial interest in the relief sought by the class.\" According to the District Court, the members of the CalPERS Group alleged combined losses in excess of $89 million, while the largest amount alleged by any other movant was $10.6 million. See In re Cendant Corp. Litig., 182 F.R.D. 144, 147 (D.N.J. 1998). This fact, in conjunction with the District Court's express finding that it satisfied Rule 23's \"adequacy\" and \"typicality\" requirements, see id. at 147-48, rendered the CalPERS Group the presumptive lead plaintiff.\n\nTwo competing movants, the Joanne A. Aboff Family Trust (Aboff) and Douglas Wilson, offered three reasons why the presumption had been rebutted, but the District Court rejected their claims. Aboff and Wilson: (1) contended that they were better suited to be lead plaintiff than the CalPERS Group because they had negotiated a lower fee schedule with their lawyers; (2) argued that the CalPERS Group could not fairly and adequately protect the interests of the class because one of the Group's chosen counsel had made substantial campaign contributions to the sole trustee of one of the funds that make up the CalPERS Group, thereby creating an appearance of impropriety; and (3) suggested that the District Court should select lead plaintiff \"through a process of competitive bidding.\" Id. at 148-49. The District Court concluded that the CalPERS Group could not fairly and adequately represent the interests of the holders of convertible Cendant derivative securities known as PRIDES, see id. at 149-50, and severed the PRIDES claims from the main action.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The court eventually appointed the CalPERS Group as lead plaintiff of the main Cendant action. See id. at 149.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe court then turned to selection of lead counsel. The CalPERS Group had filed a motion seeking to have Barrack, Rodos \u0026 Bacine (BRB) and Bernstein Litowitz Berger \u0026 Grossman LLP (BLBG) appointed lead counsel pursuant to a Retainer Agreement that it had negotiated with them, which dictated not only the formula for determining attorneys fees but also included a Plan for Monitoring Litigation, a section outlining a Theory of Recovery, and a part captioned Consultation Regarding Settlement Negotiations.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The District Court, however, decided to select lead counsel via auction. The court acknowledged that the PSLRA provides that \"[t]he most adequate plaintiff shall, subject to the approval of the court, select and retain counsel to represent the class.\" 15 U.S.C. S 78u-4(a)(3)(B)(v); see Cendant Corp. Litig., 182 F.R.D. at 150 (quoting this language from the Reform Act). But it reasoned that \"the Court's approval is subject to its discretionary judgment that lead plaintiff 's choice of representative best suits the needs of the class,\" and concluded that \"mechanisms\" other than the lead plaintiff 's choice were available to assist the court in making that determination. Id. at 150. The court pointed to the \"emerging trend\" of using auctions \"to simulate the free market in the selection of class counsel,\" and stated that it would hold an auction to select lead counsel and to determine its fee. Id. at 150-51. Recognizing that the Reform Act confers upon the Lead Plaintiff the \"opportunity\" to \"select and retain\" lead counsel, the District Court ruled that counsel chosen by the CalPERS Group would have the chance to match what the court determined to be the lowest qualified bid. Id. at 151. Later, the District Court made clear that any winning bidder would have to agree to comply with all provisions of the Retainer Agreement that the CalPERS Group had negotiated with its chosen counsel (except, of course, the fee grid).\n\nThe District Court solicited input about how the auction should be conducted and held a hearing on August 19, 1998. The court eventually required that bids be submitted pursuant to a grid it had designed,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e and received nine bids to serve as lead counsel in the main Cendant action.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The District Court rejected the bid by counsel for appellant Aboff, which would have generated fees of 1-2% of the total settlement depending on the size of the settlement and the timing of the recovery, characterizing it as unrealistic and \"quasi-philanthropic,\" and stating that \"[u]nless the eventual monetary recovery in this case is in the billions, such an apparently `cheap' fee does not make professional sense.\"\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e In contrast, the court expressly found that counsel proposed by the Lead Plaintiff was qualified and that its proposed fee scale was \"realistic,\" but also concluded that another qualified bidder had submitted a lower \"realistic\" bid. Counsel chosen by the Lead Plaintiff exercised its power to meet this lower bid, and was thus appointed lead counsel.\n\nC. Class Certification, the Filing of the Amended Complaint, and the Reaching of a Settlement\n\nAfter a case management conference, the newly-appointed Lead Plaintiff filed its Amended and Consolidated Class Action Complaint (the Complaint or Amended Complaint) along with a motion for class certification on December 14, 1998. The Complaint defined the class represented as\n\n[a]ll persons and entities who purchased or otherwise acquired publicly traded securities . . . either of Cendant or CUC during the period beginning May 31, 1995 through and including August 28, 1998 and who were injured thereby, including all persons or entities who exchanged shares of HFS common stock for shares of CUC stock pursuant to the Registration Statement . . . . Excluded from the Class are: (i) defendants; (ii) members of the family of each individual defendant; (iii) any entity in which any defendant has a controlling interest; (iv) officers and directors of Cendant and its subsidiaries and affiliates; and (iv) [sic] the legal representatives, heirs, successors or assigns of any such excluded party.\n\nThe Amended Complaint alleged claims under bothS 10(b) of the Securities Exchange Act of 1934 [hereinafter \"S 10(b) claims\"] and S 11 of the Securities Act of 1933 [hereinafter \"S 11 claims\"], as well as numerous other claims that are not relevant for the purposes of our discussion and decision. The Complaint set out S 10(b) claims for all class members, but presented S 11 claims only for those class members who received Cendant stock via the HFS merger. CUC, however, acquired via merger fourteen other companies during the class period. As with the HFS merger, these other mergers involved the filing of registration statements with the SEC during the class period, and thus these mergers also gave rise toS 11 claims (as well as claims under S 12 of the Securities Act of 1933) for those who received CUC stock via these mergers.\n\nOn January 27, 1999, the District Court granted Lead Plaintiff 's motion for class certification, defining the certified class as including \"all purchasers or acquirers of Cendant Corporation or CUC International, Inc. publicly traded securities between May 31, 1995 and August 28, 1998 who were injured thereby.\" Several of the defendants then filed motions to dismiss. In an order issued July 27, 1999, the District Court denied all of them except E\u0026Y's motion to dismiss S 10(b) claims against it that were related to stock purchases made after April 15, 1998. See In re Cendant Corp. Litig., 60 F. Supp. 2d 354 (D.N.J. 1999). On August 6, 1999, the court approved the form of the notice of the class action to be sent to potential class members and ordered its dissemination. The District Court required Lead Plaintiff to mail notice to all record holders of Cendant and CUC stock and to all brokers in the transfer records, and to publish notice of the class action on three different days in The Wall Street Journal, The New York Times (National Edition), and the Dow Jones Business Newswire. In all, the Class Administrator sent 261,224 notices.\n\nBoth the individually mailed and published notices included the definition of the Class as stated in the Complaint, and warned potential class members that if they failed to follow the specific procedures for opting out of the Class, they would be deemed class members and would be bound by any settlement or judgment. The notice stated that any class member who wanted to opt out had to file a written request for exclusion postmarked by December 27, 1999, which served as the final opt-out date.\n\nOn December 7, 1999, almost three weeks before the final opt-out date, Cendant announced a proposed settlement that would require it to pay $2.85 billion to the class members, and ten days later the parties announced that a proposed settlement had been reached between E\u0026Y and the Lead Plaintiff (collectively, \"the Settlement\"). On December 27, 1999, the opt-out period closed pursuant to the class notice. Out of over 100,000 class members, only 234 opted out before the deadline. See In re Cendant Corp. Sec. Litig., 109 F. Supp. 2d 235, 257 (D.N.J. 2000). On March 17, 2000, Cendant and the Lead Plaintiff submitted settlement documents to the District Court, including a Plan of Allocation for the distribution of settlement proceeds among class members.\n\nD. The Terms of the Settlement and the Plan of Allocation\n\nThe defendants' obligations under the Settlement consist of three primary elements:\n\n1) Cash Payment: Cendant agreed to pay $2,851,500,000 and E\u0026Y agreed to pay $335,000,000 into the settlement pool, which brings the total settlement money to approximately $3.2 billion. Interest will accrue on this money until it is paid out to the Class.\n\n2) 50% of any recovery from E\u0026Y: Cendant and the individual defendants from HFS Inc. are currently suing E\u0026Y over E\u0026Y's role in the fraud. Fifty percent of any net recovery from this action will go to the Class.\n\n3) Corporate governance changes: Cendant will institute corporate governance changes, including putting a majority of independent directors on its Board of Directors; placing only independent directors on the Board's Audit, Nominating, and Compensation Committees; de-classifying the Board and providing for the annual election of all directors; and precluding the repricing of any employee stock option after its grant, except with the approval of a majority of voting shareholders.\n\nIn exchange for these undertakings, the Class has agreed to release Cendant, E\u0026Y, the HFS individual defendants, and the CUC individual defendants from all claims that \"are based upon, are related to, arise from or are connected with any facts, circumstances, statements, omissions, events or other matters raised or referred to in the pleadings in the Litigation or which could have been asserted against Cendant, the HFS Individual Defendants and the other Released Parties by the Lead Plaintiffs and any Class Member.\" Stipulation of Settlement with Cendant Corp. and Certain Other Defs. at 12.\n\nThe Settlement also contains a Plan of Allocation, which will be used to allocate the settlement money among the class members. The specifics of the Plan of Allocation are somewhat complex because it involves calculating the\"true value\" of Cendant/CUC stock for any given day during the class period. To get the \"true value\" of Cendant stock on any given day, one has to remove from the actual price the artificial inflation that Cendant's fraud caused in the price, a process made trickier by the fact that, unlike many other frauds, the fraudulent statements made by Cendant were not in the form of a surprising announcement that caused the stock to rise a certain amount which would provide a fair indication of how much the fraud affected the price. Instead, Cendant's fraud consisted of releasing financial statements that met the market's expectations, while the truth was that Cendant was falling far short of these expectations.\n\nCendant did, however, make several announcements revealing the fraud that caused the price of its stock to plummet, namely, the three announcements made on April 15, July 14, and August 28, 1998. The Plan of Allocation works backwards from these price drops to develop an equation for determining the true, non-artificially-inflated value of Cendant stock for any day during the class period. This \"true value\" is then compared to the actual price of Cendant/CUC stock on that day to determine how much that day's purchasers of Cendant/CUC stock overspent. The Plan uses this amount of overpayment to determine the class members' damages.\n\nThe Plan of Allocation also allows class members who had received their stock in CUC's merger with HFS to receive as damages the greater of (1) their damages calculated under S 10(b) as determined by the Plan, or (2) their damages as calculated under S 11, which would give them the difference between what they paid for the Cendant stock (i.e., the value of the HFS securities that they traded in to get the Cendant stock) and the value of the Cendant stock as of the day the lawsuit was brought (April 16, 1998, the date the first lawsuit was filed). This S 11 provision draws upon the text of the 1933 Act, described in the margin.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nLead Plaintiff 's damages expert used the Plan of Allocation's damage determination method to calculate the total damages suffered by the Class from the Cendant fraud as $8.8 billion. At oral argument on this appeal and in a supplemental affidavit, Lead Plaintiff represented that the Claims Administrator had received over 118,000 proofs of claim from class members, for a total of $4.9 billion claimed losses. The $3.185 billion cash payment in the Settlement thus represents approximately a 36% recovery rate on the Class's total losses and a 64% recovery rate on the actually claimed losses. Of the $4.9 billion claimed losses, approximately $2.1 billion are losses claimed by class members who acquired Cendant stock in the HFS merger deal.\n\nE. Preliminary Settlement Approval, the Settlement Notice, the Attorneys Fees Request, and the Fairness Hearing\n\nOn March 29, 2000, the District Court granted preliminary approval to the proposed settlement and enjoined all actions or claims that were contemplated by it. In early April, pursuant to the order containing the settlement approval, the Class Administrator mailed 478,000 notices of the Settlement and proof of claim form packages [hereinafter \"the Settlement Notice\"] to potential class members, and also published notices in The Wall Street Journal and The New York Times. The Settlement Notice summarized the course of the litigation and the terms of the Settlement, including Lead Plaintiff 's Plan of Allocation of the settlement funds. It also informed the class members that Lead Counsel intended to submit an application for attorneys fees totaling 8.275% of the total settlement fund and for reimbursement of expenses in the amount of $15,855,000. The Notice stated that the District Court would conduct a fairness hearing on June 28, 2000, and contained information about how class members could go about objecting to the Settlement. It provided that any class member could appear at the fairness hearing to object to the Settlement. Class members were also allowed simply to state an objection to the Settlement in writing, although, as we discuss below in Part III.A.2, there is some dispute over how clear the Settlement Notice was on this point.\n\nPrior to the fairness hearing, Lead Counsel petitioned the District Court for an award of $262,468,857 in attorneys fees and $14,623,806 in expenses. Lead Counsel noted that its fee request \"adhere[d] precisely to the parameters in the lowest qualified bid proposal\" established by the court's auction.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e At the hearing on the request to approve the Settlement and for counsel fees, six parties raised objections to the substantive provisions of the Settlement. Three were class members (Betty Duncan, Ann Mark, and Tere Throenle); two were not class members (Martin Deutch, a derivative plaintiff, and the State Board of Administration of Florida, which opted out of the Class); and one was a party whose class status is unclear (the Davidsons).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Four class members filed objections to the fee request: NYCPF (a member of the CalPERS Group); Aboff; Faye Schonbrunn; and Throenle.\n\nAugust 15, 2000, the District Court formally approved the Settlement, entering two opinions and orders approving the Settlement and Plan of Allocation and rejecting all of the objectors' objections. See In re Cendant Corp. Sec. Litig., 109 F. Supp. 2d 235 (D.N.J. 2000); In re Cendant Corp. Sec. Litig., 109 F. Supp. 2d 273 (D.N.J. 2000). On August 16, 2000, the District Court filed an opinion and order awarding Lead Counsel approximately $262 million in attorneys fees pursuant to the schedule that had been pre-set via the auction. See In re Cendant Corp. Sec. Litig., 109 F. Supp. 2d 285 (D.N.J. 2000). Several of the objectors appealed these rulings.\n\nF. The Appeals and the Issues Presented by Each Appeal\n\nThis opinion addresses three appeals from the District Court's approval of the Settlement and the Plan of Allocation, and four appeals from its award of counsel fees.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e These appeals were consolidated for argument. On appeal, the objectors to the Settlement and the Plan of Allocation are:\n\nTere Throenle (00-2708): Throenle challenges the overall fairness to the Class of the Cendant part of the Settlement, and contends that the Lead Plaintiff suffered from a conflict of interest that prevented it from fairly representing all class members because it continued to hold Cendant stock during and after the settlement negotiations.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nBetty Duncan (00-2683): Duncan challenges the overall fairness to the Class of the E\u0026Y part of the Settlement.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nAnn Mark (00-2734): Mark claims that the proposed allocation of the settlement money among the Class is unfair because class members with S 11 claims should have received more than class members with S 10(b) claims.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe Davidsons (00-2709): The Davidsons contend that the District Court erred by not making explicit Fed.R.Civ.P. 23 findings when certifying the Class; that the notice given to the Class was insufficient; that there are intra-class conflicts arising from the disparate treatment of class members under the terms of the Settlement; and that the Plan of Allocation is flawed.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nObjector Deutch's contentions are addressed in a separate opinion by this panel. See In re Cendant Corp. Sec. Litig. (Deutch), No. 00-2684 (3d Cir. Aug. 28, 2001). Objector State Board of Administration of Florida did not appeal.\n\nThe objectors to the court's award of counsel fees are:\n\nNYCPF (00-2769; 00-3653): NYCPF argues that the District Court's decision to select lead counsel by means of an auction was inconsistent with the PSLRA, and contends that the Retainer Agreement negotiated between the Lead Plaintiff and Lead Counsel remains in effect. It also contends that the fee award approved by the District Court constitutes an excessively high percentage of the recovery given the circumstances.\n\nAboff (00-2520): Aboff argues that the fee award was \"grossly excessive,\" and also claims that the notices that were sent to class members did not contain sufficient information so as to allow them to evaluate the reasonableness of the fee request.\n\nThroenle (00-2708): Throenle contends that the fee request was improper and excessive.\n\nFaye Schonbrunn (00-2733): Schonbrunn argues that the District Court ignored this Court's jurisprudence governing fee requests, and claims that the court's award was excessive.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nSecurities and Exchange Commission (SEC): The SEC appears as amicus curiae, contending that auctions are generally not consistent with the Reform Act.\n\nBarclays Global Investors, N.A. et al (the Barclays Group): The Barclays Group appears as amicus curiae, arguing that the auction in this case was improper because there was no reason to believe that the Lead Plaintiff lacked the capacity or willingness to negotiate vigorously in the counsel selection and retention process.\n\nThe District Court had jurisdiction pursuant to 15 U.S.C. SS 77v \u0026 78aa and 28 U.S.C. S 1331, and we have jurisdiction under 28 U.S.C. S 1291.\n\nIII. THE FAIRNESS OF THE SETTLEMENT AND THE PLAN OF ALLOCATION\n\nThe objectors' arguments as to the fairness and adequacy of the Settlement fit into two basic categories. First, they argue that the District Court erred in applying the nine-factor test that we developed in Girsh v. Jepson , 521 F.2d 153 (3d Cir. 1975), for determining whether a settlement is fair, reasonable, and adequate under Federal Rule of Civil Procedure 23(e). Second, they contend that the District Court erred in approving the Settlement because there were serious intra-class conflicts that caused the Lead Plaintiff to represent the Class inadequately in negotiating the Settlement. See, e.g., Amchem Prods., Inc. v. Windsor, 521 U.S. 591 (1997). We review the District Court's approval of a class action settlement, including its determination that the settlement was fair, reasonable, and adequate, for abuse of discretion. See In re General Motors Corp. Pick-Up Truck Fuel Tank Prods. Liability Litig., 55 F.3d 768, 782 (3d Cir. 1995) [hereinafter \"GM Trucks\"].\n\nA. Approval of the Settlement: The Application of the Girsh factors\n\nRule 23(e) sets out the basic charter for a court's analysis of the fairness of a class action settlement. It provides: \"A class action shall not be dismissed or compromised without the approval of the court, and notice of the proposed dismissal or compromise shall be given to all members of the class in such manner as the court directs.\" We have interpreted this rule to require courts to \" `independently and objectively analyze the evidence and circumstances before it in order to determine whether the settlement is in the best interest of those whose claims will be extinguished.' \" GM Trucks, 55 F.3d at 785 (quoting 2 Herbert Newberg \u0026 Alba Conte, Newberg on Class Actions S 11.41). Under Rule 23(e), the District Court acts as a fiduciary guarding the rights of absent class members and must determine that the proffered settlement is\"fair, reasonable, and adequate.\" Id.\n\nIn approving the Settlement, the District Court applied the nine-factor test this Court developed in Girsh, which provides the analytic structure for determining whether a class action settlement is fair, reasonable, and adequate under Rule 23(e). See id. The nine Girsh factors are:\n\n(1) the complexity, expense and likely duration of the litigation;\n\n(2) the reaction of the class to the settlement;\n\n(3) the stage of the proceedings and the amount of discovery completed;\n\n(4) the risks of establishing liability;\n\n(5) the risks of establishing damages;\n\n(6) the risks of maintaining the class action through the trial;\n\n(7) the ability of the defendants to withstand a greater judgment;\n\n(8) the range of reasonableness of the settlement fund in light of the best possible recovery; and\n\n(9) the range of reasonableness of the settlement fund in light of all the attendant risks of litigation. See Girsh, 521 F.2d at 157.\n\nThe proponents of a settlement bear the burden of proving that these factors weigh in favor of approval. See GM Trucks, 55 F.3d at 785.\n\nObjectors Throenle and Duncan submit that the District Court abused its discretion in its application of the Girsh test to this settlement. In particular, Throenle argues that a correct application of the Girsh factors weighed against the settlement with Cendant, and Duncan raises a similar argument as to the settlement with E\u0026Y.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Because there is substantial overlap between Throenle's and Duncan's arguments, we will consider these arguments together, noting any differences where relevant.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e In our review of the District Court's application of the Girsh factors, we will first consider the strength of each side's arguments on each factor, and then, based on the totality of the factors, determine whether the District Court abused its discretion in finding overall that the Girsh factors weighed in favor of the Settlement.\n\n1. The First Girsh Factor: Complexity, Expense \u0026 Likely Duration of Litigation\n\nThis factor captures \"the probable costs, in both time and money, of continued litigation.\" GM Trucks , 55 F.3d at 812 (internal quotation marks and citation omitted). The District Court found that this case would involve complex and protracted discovery, extensive trial preparation, and difficult legal and factual issues, and that this factor therefore weighed in favor of approval of the Settlement. The court focused on a number of specific variables that increased the case's complexity: the number of defendants; the complex accounting issues involved with respect to damages; the need for expert review and testimony; the fact that Cendant and E\u0026Y were blaming each other for the accounting errors; and the possibility of unknown novel legal issues raised by the PSLRA. The court also found that litigation would likely be drawn out, with an extended discovery period necessary and a trial date that would likely not occur until 2002. See In re Cendant Corp. Sec. Litig., 109 F. Supp. 2d at 256-57.\n\nThe objectors counter with a number of arguments. Throenle's best argument is that the liability aspect of the case against Cendant is simple--Cendant basically admits that its employees had the requisite scienter forS 10(b) liability, and there is strict liability for Cendant on the S 11 claims--so that the only truly contested issue is damages. She adds that the District Court's denial of the defendants' motions to dismiss means that the plaintiffs have surmounted the most formidable barrier posed by the PSLRA, namely, the heightened pleading standards put in place by the Act. As to the complexity of the case against E\u0026Y, Duncan argues that we will not know enough about this issue until the parties engage in more discovery to determine E\u0026Y's involvement. She asserts that if the three Cendant employees who pled guilty to fraud implicate E\u0026Y in their testimony, see supra n.18, the plaintiffs' case against E\u0026Y will be uncomplicated.\n\nWe find Throenle's objections with respect to the Cendant portion of the Settlement to have considerable merit. We agree with Throenle's contention that Cendant's basic liability does not present a difficult or complex issue. Cendant has indicated that, insofar as liability is concerned, it would argue at trial that it is not responsible for any illegal actions taken by its employees because these acts were not done to benefit Cendant. However, because (as we explain below) we are skeptical of the viability of this defense for Cendant, see infra Part III.A.4, the fact that Cendant would likely raise it increases only minimally the complexity and likely duration of the litigation. We are thus dubious that this case, insofar as it involves Cendant's liability, presents numerous complex legal and factual issues that would result in substantial costs of time and money. But this does not necessarily militate against an attractive settlement, a point we address later.\n\nThe issue of damages against Cendant is different in character, for it involves technical accounting issues and hence can be quite complex. Thus, we agree that this factor weighs in favor of settlement insofar as the damages determination is concerned. We note in this regard that the damages determination formula developed by the Lead Plaintiff 's damages expert is complicated and difficult to follow; if Cendant constructed its own damages determination formula (as we presume it would), the damages issue could appreciably lengthen and complicate this litigation. Still, we think that, compared to a case in which basic liability is contested, the damages issues involved here would increase only moderately the time and expense required to litigate.\n\nRegarding Duncan's arguments on the complexity of determining E\u0026Y's liability, we note that E\u0026Y has consistently and strenuously denied any fault for this fraud, and as we have explained, see supra n.18, there does not seem to be good reason to think that the three convicted Cendant employees will implicate E\u0026Y. E\u0026Y points out that the fraud was perpetrated at Cendant facilities by Cendant employees, and no evidence has surfaced in the investigations following the fraud that E\u0026Y employees participated in or even knew about the fraud. E\u0026Y also emphasizes the fact that the Willkie Farr report describes numerous instances in which Cendant employees admitted concealing or falsifying information to prevent E\u0026Y from discovering the truth. We agree with E\u0026Y that establishing liability and damages against it would involve fairly complex and protracted litigation.\n\nIn sum, while the complexity and duration of litigation factor does not weigh as heavily in favor of settlement as the District Court concluded, we do think it does weigh somewhat in favor of the Cendant part of the Settlement, and strongly in favor of the E\u0026Y part of the Settlement.\n\n2. The Second Girsh Factor: The Reaction of the Class\n\nThe District Court found that this factor cut strongly in favor of the Settlement, as the number of objectors was quite small in light of the number of notices sent and claims filed. The claims administrator sent 478,000 notices of the Settlement to potential class members, and also published notices in The Wall Street Journal and The New York Times. Over 30,000 settlement claims were filed as of June 12, 2000 (more than two weeks before the fairness hearing), and almost 120,000 claims were filed by May 15, 2001. Yet only four class members objected to the Settlement (Throenle, Duncan, the Davidsons, and Mark, who objected only to the Plan of Allocation), and only two non-class members objected as well (Deutch and the State Board Administration of Florida). As the District Court noted, none of the objectors was an institutional investor (although the Davidsons had very large holdings), and only 234 class members opted out of the Class; the court took the latter number \"as an extremely favorable indicator of class reaction.\" 109 F. Supp. 2d at 257.\n\nThroenle argues that the low number of objectors is attributable to the confusing notice to the Class; she contends that the notice implied that objectors had to appear personally before the court to lodge objections. Throenle also asserts that she had difficulty obtaining relevant documents from the clerk's office before the objection deadline, and that \"[s]uch a fundamental deprivation of due process very likely hindered[other] objectors.\" Throenle Br. at 47. Duncan submits that the number of objectors and opt-outs is \"meaningless\" because the opt-out and objection-filing deadlines occurred before the three arrested Cendant employees pled guilty.\n\nThe District Court correctly found that this factor weighed strongly in favor of the Settlement. The vast disparity between the number of potential class members who received notice of the Settlement and the number of objectors creates a strong presumption that this factor weighs in favor of the Settlement, and the objectors' arguments otherwise are not convincing. Although it is true that the Settlement Notice could have been clearer on how to object to the Settlement, the District Court pointed out that the notice provided the address and phone numbers for Lead Plaintiff 's counsel in the event that class members had questions about any matter in the notice. See 109 F. Supp. 2d at 255. A confused class member who wanted to make an objection could have easily called class counsel and clarified the process by which to make it. Throenle's assertion about her difficulty in obtaining documents from the clerk's office is troubling, but the fact is that she did receive the relevant documents in time and no other class member has complained of this problem. Furthermore, Duncan's contention that more people would have objected had the objection deadline date occurred after the three Cendant employees pled guilty to fraud is purely speculative; nothing in these employees' statements to investigators implicates E\u0026Y, and in fact the statements reflect that they tried to conceal the fraud from E\u0026Y. We therefore conclude that this factor cuts strongly in favor of the Settlement.\n\n3. The Third Girsh Factor: The Stage of Proceedings\n\nThis factor \"captures the degree of case development that class counsel have accomplished prior to settlement. Through this lens, courts can determine whether counsel had an adequate appreciation of the merits of the case before negotiating.\" GM Trucks, 55 F.3d at 813. In considering this factor, the District Court took note of the formal and informal discovery in which Lead Counsel had engaged, and then concluded that \"[t]he record reveals, and the Court finds, that the parties understood the merits of the class action and could fairly, safely and appropriately decide to settle the action with Cendant and E\u0026Y. Counsel conducted extensive discovery, retained and used experts, and litigated pre-trial motions.\" 109 F. Supp. 2d at 259 (internal quotation marks and citation omitted). The court then described in detail the \"extensive discovery\" undertaken by the Lead Counsel, which included analysis of Cendant's public filings, review of the Willkie Farr Report, review of various documents produced by Cendant during informal and formal discovery, and interviews with various Cendant and E\u0026Y employees. See id. at 258-59. The court also noted that, in preparation for settlement negotiations, Lead Plaintiff had retained the investment firm Lazard Freres and damages expert Forensic Economics, Inc., to assist it in determining damages. See id. at 258.\n\nBoth Throenle and Duncan argue that there was insufficient discovery. In particular, they point to the fact that no depositions were taken and that Lead Counsel mainly engaged in only informal discovery. Duncan in particular argues that the early stage of discovery means that the Settlement was not negotiated \"under a real and credible threat of litigation.\" Duncan's Opening Br. at 52.\n\nThe objectors are correct that the Settlement was reached early in the litigation, with discovery itself at an early stage.\n\nHowever, the merits of the liability case against Cendant were fairly clear. With respect to the S 11 claims, Cendant has admitted that its financial statements contained materially false information, and Cendant has strict liability for its registration statements that incorporated these financial statements. As for the S 10(b) claims, Cendant employees have basically admitted committing fraud, so Cendant was going to be on the hook for a substantial amount, if not all, of the Class's S 10(b) damages at all events. In its argument on the fourth Girsh factor (the risk of establishing liability), Lead Plaintiff relies on the fact that Cendant has advanced the defense that it should not be held liable for the Class's damages that were caused by the illegal acts of its various officers, because these acts were not done for the benefit of the corporation. As we explain below, see infra Part III.A.4, on the record before us we do not think that Cendant would have much chance of success with this defense. While it is not clear whether Lead Plaintiff had an \"adequate appreciation\" of the merit of this defense, its viability turns more on legal considerations than on factual development, see id., so it does not substantially affect Throenle and Duncan's claim that more discovery was needed.\n\nGiven the foregoing, it is unclear what depositions and interrogatories (with the requisite motions to compel) would have added to the liability considerations. It is true that the extent of the Class's damages was not clear-cut, but Lead Plaintiff retained its own damages expert to calculate the Class's damages and also reviewed a damages report prepared by the National Economic Research Association, Inc., which Cendant hired as its damages expert. The issue of damages appears to have been headed for resolution as a battle of the experts at trial. While Federal Rule of Civil Procedure 26 expert witness discovery might have been helpful on the damages issue, it is not clear what it would have added to the settlement calculus.\n\nTherefore, although this litigation was settled at an early stage, because of the nature of the case Lead Plaintiff had an excellent idea of the merits of its case against Cendant insofar as liability was concerned at the time of the Settlement. Lead Plaintiff also underwent a sufficient process for determining the Class's damages before the Settlement. Because of this, Lead Plaintiff was able to form an \"adequate appreciation of the merits of the case [against Cendant] before negotiating.\" GM Trucks , 55 F.3d at 813. We thus conclude that this factor cuts strongly in favor of the settlement with Cendant.\n\nBecause the case against E\u0026Y was strongly contested and much more complex, it is correspondingly more difficult to ascertain the merits of the case against E\u0026Y because of the early settlement. However, Duncan's conjecture about what evidence of E\u0026Y's involvement in the fraud may turn up from further discovery is undermined by the results of the investigation of the three former Cendant employees charged with criminal fraud, which indicates that they concealed the fraud from E\u0026Y. See supra n.18. Therefore, although we note the possibility that further discovery might have illuminated the merits of the case against E\u0026Y, we temper this with the observation that it seems unlikely that evidence of E\u0026Y's further involvement in the fraud would come to light. For these reasons, we conclude that the stage of proceedings factor is neutral as to the settlement with E\u0026Y.\n\n4. The Fourth Girsh Factor: The Risks of Establishing Liability\n\nA court considers this factor in order to \"examine what the potential rewards (or downside) of litigation might have been had class counsel decided to litigate the claims rather than settle them.\" GM Trucks, 55 F.3d at 814. The District Court concluded that the risks of establishing liability varied with the particular defendant. As to Cendant, the court concluded that liability was easily established, but that things got more complex for the S 10(b) claims when the proportionality of liability was considered:\"the jury might have found that Cendant bore only a small proportion of the responsibility for the damages suffered by the Class.\" 109 F. Supp. 2d at 260 (internal quotation marks omitted) (citing the PSLRA's provisions on proportionate liability, which provide that a defendant is jointly and severally liable on a S 10(b) claim only if the defendant knowingly committed the fraud; otherwise the defendant is only liable for the percentage of his responsibility for the fraud, see S15 U.S.C. 78u-4(f)\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e). Proportionality of liability is only an issue as to the S 10(b) claims; if Cendant were to lose on the S 11 claims at trial, it would be jointly and severally liable on these claims. See 15 U.S.C. S 77k(f).\n\nAs to E\u0026Y, the court reasoned that the level of scienter required by S 10(b), E\u0026Y's potential due diligence defenses under Section 11, and the fact that there was no evidence that E\u0026Y knew about the fraud while it was being committed meant that Lead Plaintiff faced significant obstacles in establishing E\u0026Y's liability. The court concluded that this factor weighed strongly in favor of settlement in E\u0026Y's case, less so for Cendant, and\"overall [this factor] weighs in favor of settlement.\" 109 F. Supp. 2d at 261.\n\nThroenle concentrates her argument on the District Court's conclusion that the risk of establishing liability with Cendant increases when the PSLRA's proportionate liability provisions are factored into the equation. She counters that, although the PSLRA limited defendants' joint and several liability in S 10(b) actions, defendants who are found to have knowingly committed S 10(b) violations are still jointly and severally liable for the fraud damages under the PSLRA. See 15 U.S.C. S 78u-4(f)(2). She thus argues that, because Cendant would be charged with knowing whatever its employees knew and its employees knowingly committed the fraud, Cendant would be jointly and severally liable, not proportionately liable, on the S 10(b) claims. On this basis, Throenle submits that the proportionate liability provisions of the PSLRA really do not pose a risk to establishing Cendant's liability.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nLead Plaintiff counters Throenle's argument by pointing to Rochez Brothers, Inc. v. Rhoades, 527 F.2d 880 (3d Cir. 1975), in which we set out a two-part test for determining when the fraud of an officer of a corporation is imputed to the corporation: the fraud is imputed \"when the officer's fraudulent conduct was (1) in the course of his employment, and (2) for the benefit of the corporation.\" Id. at 884. Lead Plaintiff notes that Cendant argued in the District Court that it was not liable for the illegal acts of its officers because these acts were not for Cendant's benefit, and that Cendant used just this defense to defeat a summary judgment motion on S 10(b) claims by an opt-out plaintiff in this very case. See In re Cendant Corp. Sec. Litig., 109 F. Supp. 2d 225, 232-34 (D.N.J. 2000) [hereinafter \"Yeager v. Cendant\" or\"Yeager\"]. The court denied the plaintiff 's summary judgment motion in Yeager because of the possibility that \"a reasonable trier of fact could conclude that the true motive of the wrongdoers was the preservation of their employment, salaries, emoluments, and reputations, as well as their liberty, at the expense of the corporation's well-being.\" Id. at 233 (internal quotation marks and brackets omitted). Lead Plaintiff contends that the possibility that Cendant could establish this defense to limit its liability posed a risk of establishing liability, so that the District Court correctly concluded that this factor weighed in favor of the Settlement.\n\nWe do not agree with the District Court that there was a significant risk of establishing joint and several liability against Cendant in this case. Rochez Brothers makes clear that a corporate officer's fraud is imputed to the corporation \"even if the officer's conduct was unauthorized, effected for his own benefit but clothed with apparent authority of the corporation, or contrary to instructions.\" 527 F.2d at 884. The reason for this is that \"a corporation can speak and act only through its agents and so must be accountable for any acts committed by one of its agents within his actual or apparent scope of authority and while transacting corporate business.\" Id. Based on the record before us, it would not seem difficult for the plaintiffs to establish that the high-ranking CUC officers who published the false financial statements in CUC's name were acting within the apparent scope of their authority and were transacting corporate business, whether or not they were feathering their own nest.\n\nIn sum, we agree that there would be little risk in establishing Cendant's joint and several liability on the S 10(b) claims. As to the risk of establishing E\u0026Y's liability, we agree with the District Court's analysis that a number of factors make this factor weigh strongly in favor of approval of the E\u0026Y portion of the Settlement: the lack of any evidence that E\u0026Y knew about the fraud; E\u0026Y's due diligence defenses on the S 11 claims; the complexity of the case against E\u0026Y; and the prospect of fierce litigation. Overall, then, the risks of establishing liability factor cuts substantially in favor of approval of the E\u0026Y portion of the Settlement, but cuts against approval of the Cendant portion of the Settlement.\n\n5. The Fifth Girsh Factor: The Risks of Establishing Damages\n\nLike the fourth factor, \"this inquiry attempts to measure the expected value of litigating the action rather than settling it at the current time.\" GM Trucks , 55 F.3d at 816. Lead Plaintiff presented evidence to the District Court that the total amount of damages to class members ranges between $8.5 and $8.8 billion. Lead Plaintiff cautioned, however, that establishing damages at trial would lead to a \"battle of experts,\" with each side presenting its figures to the jury and with no guarantee whom the jury would believe. The District Court accepted this argument, as well as E\u0026Y's statement that it was prepared to prove at trial that the decline in Cendant's stock following the announcements of the fraud was largely due to factors and conduct in which E\u0026Y was not involved. The court thus found that this factor weighed in favor of settlement.\n\nThroenle and Duncan do not offer persuasive arguments regarding this factor, and we find the District Court's reasoning on this factor sound. As we set forth in the margin, the damages determination proffered by Lead Plaintiff 's expert is complex and hard to follow, freighted with involved calculations and conceptually difficult issues.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Were a jury confronted with competing expert opinions of corresponding complexity, there is no compelling reason to think that it would accept Lead Plaintiff 's determination rather than Cendant's, which would posit a much lower figure for the Class's damages. This risk in establishing damages means that this factor weighs in favor of approval of the Settlement.\n\n6. The Sixth Girsh Factor: The Risks of Maintaining the Class Action Through Trial\n\nThe District Court found that this factor slightly weighed in favor of settlement because, \"[u]nder Federal Rule of Civil Procedure 23(a), a district court `may decertify or modify a class at any time during the litigation if it proves to be unmanageable,' \" and proceeding to trial would always entail the risk, even if slight, of decertification. In re Cendant Corp. Sec. Litig., 109 F. Supp. 2d at 262 (quoting In re Prudential Ins. Co. of Am. Sales Practices Litig., 148 F.3d 283, 321 (3d Cir. 1998)). The objectors argue that this factor is really neutral. In our view the risk of decertification appears to be extremely slight; hence we agree with the objectors.\n\n7. The Seventh Girsh Factor: The Ability of the Defendants to Withstand a Greater Judgment\n\nThere is a dispute among the parties as to what this factor means, i.e., whether it concerns the ability of the defendants to withstand a judgment for the $8.8 billion maximum damages sought by the Class, as Lead Plaintiff and E\u0026Y argue, or whether it focuses on the ability of the defendants to withstand a settlement or a judgment for any amount higher than the $3.2 billion for which they are settling, as the objectors contend. The District Court took note of this dispute, but appears not to have taken a position on it, as it found that there was insufficient financial data to determine what the defendants could afford to pay.\n\nLead Plaintiff and E\u0026Y reason that the use of the term \"judgment\" rather than \"settlement\" in the formulation of this Girsh factor supports their contention that it concerns only the possible judgment at trial for the full amount of damages sought rather than other possible larger settlements. This reasoning is not terribly persuasive, because Girsh uses the phrase \"the ability of the defendants to withstand a greater judgment,\" 521 F.2d at 157 (emphasis supplied), and the comparative term \"greater\" implies a comparison with the current settlement. If this factor was intended to reference the ability of the defendants to withstand a judgment for what the plaintiffs claim as their damages, then it would presumably be stated in those terms (e.g., \"the ability of the defendants to withstand a judgment for what the plaintiffs claim\") rather than as \"the ability of the defendants to withstand a greater judgment.\" Furthermore, because both a settlement and a judgment take money out of Cendant's pocket, distinguishing the two in the context of this factor makes little sense from a practical point of view.\n\nWe think a better interpretation of this factor is that it is concerned with whether the defendants could withstand a judgment for an amount significantly greater than the Settlement. Our case law supports this view. See In re Prudential, 148 F.3d at 321-22 (finding no error in the district court's analysis of this factor that considered whether the defendant could withstand a judgment for an amount greater than the proposed settlement); GM Trucks, 55 F.3d at 818 (same). Thus, our consideration here is whether Cendant could withstand a judgment for an amount significantly greater than $2.85 billion, and whether E\u0026Y could withstand a judgment for an amount significantly greater than $335 million. The District Court concluded that, although the defendants failed to produce financial information that showed that they could not pay a judgment greater than what the Settlement provided, this was not enough to reject the Settlement because the other factors cut clearly in favor of settlement. However, the District Court went on to find that\n\nat least as far as Cendant is concerned, objective benchmarks support Lead Counsel and Cendant's stance that sustaining a larger judgment, and possibly even a larger settlement, might prove fatal. Particularly, the significant percentage of Cendant's market capitalization that will be paid to the class--approximately 25-30%. Even more striking is that Lead Plaintiffs' total damages calculation [i.e. the $8.8 billion] represents approximately 80-95% of [Cendant's] market capitalization (depending on market close)--a figure difficult for this Court to imagine Cendant paying without seeking shelter in our bankruptcy laws. 109 F. Supp. 2d at 263.\n\nThus, while the District Court did not find that Cendant could not pay more than the $2.85 billion it contributed to the Settlement, it did find that if this case went to trial and Cendant was held liable for an amount close to $8.8 billion, it would probably declare bankruptcy. Regarding E\u0026Y's ability to withstand a greater judgment, the court did not have any of E\u0026Y's financial information before it, so it could not ascertain whether E\u0026Y could pay more than its $335 million share of the Settlement. The court then determined that, because of the lack of financial information, this factor weighed neither for nor against the Settlement.\n\nThroenle and Duncan argue that the District Court erred when it found that this factor was neutral, because both Cendant and E\u0026Y are able to pay greater amounts than they would under the Settlement. Throenle contends that Cendant's announcement after the Settlement was reached that it was resuming its share repurchasing activity shows that Cendant has the ability to pay significantly more than $2.85 billion. Duncan points to E\u0026Y's post-settlement sale of its consulting business to Cap Gemini for $11 billion as evidence of the need to get more information as to E\u0026Y's ability to pay more.\n\nWe agree with the objectors' contentions that the defendants could afford to pay more than they did under the Settlement. This does not end our analysis of this factor, however. The District Court was surely right that somewhere between Cendant's settlement payout ($2.85 billion) and the potential judgment ($8.8 billion), Cendant would likely be tipped into declaring bankruptcy. It is not clear on the record where this point would occur--it is probably not clear even to Cendant's directors at this point --but it is very likely that bankruptcy would have been a risk if Cendant were faced with a substantially higher judgment. There is inevitably a measure of speculation involved in this determination, especially given the lack of record development on this issue, so even though we think that it is likely that both Cendant and E\u0026Y could have paid substantially more than they did under the Settlement, we must remain cognizant that the possibility of bankruptcy is quite real when the settlement or judgment numbers sufficiently increase. At the same time, the proponents of a settlement bear the burden of proving that the Girsh factors weigh in favor of approval. See GM Trucks, 55 F.3d at 785.\n\nGiven these observations, we disagree with the District Court that the ability to withstand a greater judgment factor is neutral with regard to the Settlement. Rather, we think that this factor cuts against approval of the Settlement, albeit only moderately, because of the built-in limitations of this kind of analysis and the lurking possibility of bankruptcy for Cendant (and perhaps E\u0026Y as well) if faced with a judgment near $8.8 billion.\n\n8. The Final Girsh Factors: The Range of Reasonableness of the Settlement Fund in Light of the Best Possible Recovery \u0026 in Light of Litigation Risks\n\nThe District Court began its analysis of these factors by noting that the maximum amount of total damages against all defendants is approximately $8.5 billion (later amended to $8.8 billion), so that the total settlement amount of nearly $3.2 billion from all defendants represents a 36-37% recovery rate by the plaintiff Class. \"This far exceeds recovery rates of any case cited by the parties.\" In re Cendant Corp. Sec. Litig., 109 F. Supp. 2d at 263 (citing cases and a volume describing a range of recoveries from 1.6% to 14% for securities class action settlements \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e).\n\nBecause Cendant paid the bulk of the $3.2 billion settlement, the court considered the proportionate fairness of the E\u0026Y settlement separately. E\u0026Y was only potentially liable for $6.2 billion in damages (i.e., the damages sustained by pre-April 15, 1998 purchasers), and, if E\u0026Y and Cendant bear equal responsibility for these damages,\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e then E\u0026Y's settlement payment of $335 million represented 9.25% of the damages for which it was responsible. The court found that this was in line with the range of recoveries referenced above, and that it was well above the norm for recoveries against accounting firms in securities litigation.\n\nThe objectors' arguments about these factors challenge the District Court's calculations, contending that the Class's damages were $13 to 20 billion rather than $8.8 billion, so that the recovery rate for the Settlement would be much lower than the District Court concluded. These arguments are flawed, however, because they calculate the Class's damages by using the drop in Cendant's market capitalization after the fraud was revealed. A stock's drop in market capitalization is not a proper measure of damages in securities cases under the statutory scheme laid out in S 10(b) or S 11. See 15 U.S.C.S 77k(e) (S 11 damages) \u0026 S 78u-4(e) (S 10(b) damages). Thus, the objectors' arguments are unavailing.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nFurthermore, we find the District Court's conclusion that these factors weigh in favor of the Settlement to be persuasive. The fact that the recovery rate for the Class here apparently exceeds the recovery rates in other securities class action settlements tends to support the reasonableness of the Settlement even though the Class faced low litigation risks in its claims against Cendant (because of the relative ease of establishing Cendant's liability). The lower recovery rate of E\u0026Y's portion of the Settlement is justified by the greater litigation risks the Class faced in establishing E\u0026Y's liability. For these reasons, we conclude that these factors weigh in favor of approval of the Settlement.\n\n9. Summing Up the Girsh Factors\n\nInsofar as the Cendant portion of the Settlement is concerned, we conclude that the second (reaction of the class), third (stage of the proceedings), fifth (risk of establishing damages), eighth and ninth (range of reasonableness in light of the best possible recovery and of litigation risks) Girsh factors all weigh strongly in favor of approval of the settlement with Cendant. The first factor (complexity of litigation) weighs moderately in favor of approval, while the seventh factor (ability to withstand a greater judgment) weighs moderately against approval and the fourth factor (risk of establishing liability) weighs more heavily against approval of the settlement with Cendant. Finally, the sixth factor (risk of maintaining the class action) is effectively neutral.\n\nAs to the E\u0026Y portion of the Settlement, we conclude that the first (complexity of litigation), second (reaction of the class), fourth (risk of establishing liability), fifth (risk of establishing damages), eighth and ninth (range of reasonableness in light of the best possible recovery and of litigation risks) Girsh factors all weigh strongly in favor of approval of the Settlement. The third factor (stage of the proceedings) and the sixth factor (risk of maintaining the class action) are neutral, while the seventh factor (ability to withstand a greater judgment) weighs moderately against the E\u0026Y portion of the Settlement.\n\nGiven this analysis, we conclude that the District Court did not abuse its discretion in finding that the Girsh factors overall weighed in favor of approving the Settlement and that therefore the Settlement was fair, reasonable, and adequate. As should be clear from our analysis, we think that this question with respect to the Cendant portion of the Settlement is closer than the District Court made it out to be. In particular, the lack of any serious risk of establishing Cendant's liability and its probable ability to pay substantially more in settlement raise concerns in our minds concerning the fairness and adequacy of this Settlement. However, a quick reference to the preceding discussion of the Girsh factors makes clear that the balance clearly weighed in favor of approval of the Cendant settlement. As to E\u0026Y, there can be no question as to the propriety of the approval. Furthermore, under our standard of review applicable here we accord deference to the District Court's exercise of discretion, and can set aside its decision only if there was an abuse of that discretion, which is absent here. For these reasons, we hold that the District Court did not abuse its discretion in concluding that the Settlement was fair, reasonable, and adequate based on its application of the Girsh factors.\n\nB. Intra-class Conflicts\n\nThroenle and Mark have presented objections to the Settlement that fall under the general rubric of intra-class conflicts. Throenle presents two related arguments for setting aside the District Court's order approving the Settlement, while Mark attacks the Plan of Allocation.\n\n1. Throenle's Arguments\n\na. The Lead Plaintiff 's Alleged Conflicts of Interest\n\nThroenle first argues that the members of the CalPERS Group (who comprise Lead Plaintiff) were too conflicted to serve adequately in that capacity because they continued to hold huge amounts of Cendant stock during the Settlement negotiations, rendering them more concerned with protecting their interests in Cendant's future prospects than with achieving maximum recovery for the Class from Cendant. Throenle's argument is based on the general assertion that a lead plaintiff who retains a substantial investment in a defendant corporation cannot adequately represent a class in a lawsuit against that corporation because this lead plaintiff will naturally be conflicted between trying to get maximum recovery for the class and trying to protect its ongoing investment in the corporation, e.g., by settling cheap or by securing corporate governance changes in lieu of cash, both of which are alleged here. Because of this, she argues that we should set aside the Settlement.\n\nThroenle's thesis is attractive. The problem with it is that Congress seems to have rejected it when it enacted the lead plaintiff provisions of the PSLRA. The Reform Act establishes a presumption that the class member\"most capable of adequately representing the interests of class members\" is the shareholder with the largest financial stake in the recovery sought by the class. 15 U.S.C.S 78u-4(a)(3)(B)(i) \u0026 (iii)(I). The plaintiff with the largest stake in a given securities class action will almost invariably be a large institutional investor, and the PSLRA's legislative history expressly states that Congress anticipated and intended that such investors would serve as lead plaintiffs. See S. Rep. No. 104-98, at 11 (1995), reprinted in 1995 U.S.C.C.A.N. 679, 690 (\"The Committee intends to increase the likelihood that institutional investors will serve as lead plaintiffs by requiring the court to presume that the member of the purported class with the largest financial stake in the relief is the `most adequate plaintiff.' \"). We presume that Congress was aware that an institutional investor with enormous stakes in a company is highly unlikely to divest all of its holdings in that company, even after a securities class action is filed in which it is a class member.\n\nBy establishing a preference in favor of having such investors serve as lead plaintiffs, Congress must have thought that the situation present here does not inherently create an unacceptable conflict of interest. See id. (\"The Committee believes that an institutional investor acting as lead plaintiff can, consistent with its fiduciary obligations, balance the interests of the class with the long-term interests of the company and its public investors.\"). For this reason, the simple fact that the institutional investors who comprise Lead Plaintiff retained Cendant stock while the Settlement was negotiated is not nearly enough, standing alone, to support Throenle's claim that Lead Plaintiff was so conflicted that the Settlement should be overturned. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nThroenle appears implicitly to acknowledge this point, because she also argues that there is specific evidence that Lead Plaintiff did not adequately represent the Class's interests in this case, and that this evidence rebuts the PSLRA's presumption that the CalPERS Group was the most adequate plaintiff. See 15 U.S.C. S 78u-4(a)(3)(B)(iii)(II) (providing that the presumption that the largest shareholder is the most adequate plaintiff \"may be rebutted only upon proof by a member of the purported plaintiff class that the presumptively most adequate plaintiff. . . will not fairly and adequately protect the interests of the class\"). Throenle points to two factors as evidence that Lead Plaintiff did not adequately protect the Class's interests. The first is that while some people originally placed the Class's total damages at $13-20 billion, Cendant only paid $2.85 billion, which is too low a percentage of the Class's total damages. Her second piece of evidence is that Liberty Media Co. agreed to invest $400 million in Cendant soon after the announcement of the Settlement; because Lead Plaintiff must have known about this impending deal\"[t]his obviously gave the Lead Plaintiffs--to the extent they retained substantial Cendant holdings--a tremendous incentive to settle cheap.\" Throenle's Opening Br. at 31.\n\nThroenle does not clearly explain how she concluded that the Class's damages were $13-20 billion; apparently it is derived from Cendant's loss of market capitalization caused by the announcement of the fraud. As we noted above in our Girsh factor analysis, however, loss in market capitalization is not a proper measure of damages inS 10(b) or S 11 cases. See 15 U.S.C. S 78u-4(e) (S 10(b) damages) \u0026 S 77k(e) (S 11 damages); supra Part III.A.8. Thus, Throenle's argument based on this $13-20 billion figure has no legitimate basis and we reject it for that reason.\n\nSimilarly, Throenle's accusations about the Cendant-Liberty Media deal are based upon speculation; she offers no evidence that Lead Plaintiff knew about this impending deal or that it affected the settlement calculations, except for the fact that the deal was announced soon after the Settlement was announced (nine days later). Furthermore, even if this speculation were correct, Throenle's argument on its own is not persuasive. It is unclear how this impending deal, if Lead Plaintiff knew of it, \"obviously gave Lead Plaintiff . . . a tremendous incentive to settle cheap,\" as Throenle contends. Why would an upcoming infusion of cash investment in Cendant impel Lead Plaintiff to settle this litigation cheaply? Lead Plaintiff would have such an incentive only if: (1) Liberty Media made the deal contingent upon Cendant achieving a favorable settlement of this case; (2) Lead Plaintiff became aware that Liberty Media had taken this position; and (3) Lead Plaintiff determined that the Liberty Media deal was worth more to it (as a current shareholder of Cendant) than a larger settlement was worth to it (as a class member). As with her other charges, Throenle offers no evidence that any of these suppositions are true. For these reasons, we reject Throenle's assertion that Lead Plaintiff was in conflict with the interests of the class members so that the Settlement should be overturned.\n\nb. The Corporate Governance Changes\n\nThroenle also argues that the corporate governance changes that Lead Plaintiff obtained from Cendant as part of the Settlement benefitted only institutional investors who continued to hold large blocks of Cendant stock, and not the Class as a whole, so that the District Court abused its discretion in approving a settlement that provided an individual benefit to certain class members at the expense of more recovery for the Class overall.\n\nThe corporate governance changes that Lead Plaintiff negotiated include Cendant's agreement to: (1) ensure that a majority of its Board of Directors would be independent directors; (2) place only independent directors on the Board's Audit, Nominating, and Compensation Committees; (3) de-classify the Board and provide for the annual election of all directors; and (4) preclude the repricing of any employee stock option after its grant, except with the approval of a majority of voting shareholders. Although these corporate governance changes were not negotiated until after the monetary portion of the Settlement was agreed upon, Lead Plaintiff did make it known to Cendant at the beginning of the negotiation process that it was going to ask for corporate governance changes. Obviously, these changes benefit only current and future Cendant shareholders, as they are meant to reduce the chance of future fraud by limiting the control of Cendant's internal officers and directors. The Lead Plaintiff, however, was appointed to represent the interests of the Class, which is defined as all persons who purchased Cendant stock between May 31, 1995 and August 28, 1998, many of whom have long since sold their shares.\n\nOn the basis of these facts, which are essentially undisputed, Throenle argues that the inclusion of the corporate governance changes in the Settlement warrants overturning the Settlement. She acknowledges that she has no evidence that Lead Plaintiff gave up something in the negotiations (presumably up-front dollars) in order to get the corporate governance changes. Throenle's argument is thus based upon the common sense premise that \"you don't get something for nothing.\" Throenle contends that the only thing of value that Lead Plaintiff had to offer Cendant for the governance changes was its acceptance of less money for the Class. Therefore, Throenle maintains, Lead Plaintiff sold out the interests of the class members (by accepting less money than it could have gotten) in order to get something of value for itself and for other current and future Cendant shareholders. Under this view, Lead Plaintiff breached its duty to the Class in negotiating these corporate governance changes, and the District Court abused its discretion in approving the Settlement given this conflict.\n\nThroenle's argument here has an intuitive pull, but ultimately it is unpersuasive for two reasons. First, the received wisdom of the street does not necessarily have force in this Court as a matter of law. The truth of the maxim \"you don't get something for nothing\" is not something that we can judicially notice. We need evidence, and there is no affirmative evidence backing up Throenle's claims, although there is some evidence against them. Lead Plaintiff strenuously denies that it took any less monetary recovery to get the corporate governance changes. Apparently, the corporate governance changes were not negotiated until after the monetary recovery was determined, and Lead Counsel who negotiated the Settlement made declarations to the District Court stating that Cendant was explicitly told that the money it paid into the Settlement would not be decreased in any way as an exchange for implementing the corporate governance changes.\n\nCendant's general counsel confirmed this declaration, and stated that Cendant did not request or receive any concessions, economic or otherwise, in exchange for adopting the corporate governance changes. Thus, Lead Plaintiff submits that we should leave intact the District Court's factual finding that \"Throenle's objection regarding the corporate governance changes has no substance. There has not been the slightest indication that the cash portion of the settlement was related to, dependent upon, or intertwined with the governance proposals.\" 109 F. Supp. 2d at 252.\n\nSecond, Cendant had another possible motivation for agreeing to the corporate governance changes: corporations that have admitted to fraudulent activity can have a hard time attracting and keeping investors unless they make some affirmative efforts to ensure that such fraud will not occur again. It is entirely plausible that Cendant agreed to the corporate governance changes as a way to show investors that it was addressing the situation that allowed the fraud to occur in the first place, thus trying to make itself more attractive. This possibility counters Throenle's \"you don't get something for nothing\" argument, because, under this scenario, Cendant gave up the corporate changes in order to encourage continued investment, particularly from institutional investors.\n\nIn sum, the lawyers involved in negotiating the Settlement have provided affidavits and declarations to the effect that there was no settlement-money-for-corporate-governance-changes exchange, and Throenle offers no evidence otherwise. We are satisfied that the District Court's factual finding that there was no evidence of such an exchange is not clearly erroneous, and we reject Throenle's arguments based on the supposed existence of such an exchange. For all the foregoing reasons, we conclude that Throenle's conflict of interest arguments are not a sufficient basis for concluding that the District Court abused its discretion in approving the Settlement. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\n2. Mark's Arguments\n\nMark attacks the Settlement's Plan of Allocation, arguing that class members who had S 11 claims under the Amended Complaint (i.e., class members who received Cendant stock via the HFS merger) should be allocated higher settlement payments than class members with only S 10(b) claims, because S 11 claims and damages are far easier to prove than S 10(b) claims and damages. She then asserts that Lead Plaintiff did not press for a greater recovery for S 11 claimants because it used the greater strength of the S 11 claims to recover more for the Class's S 10(b) claims.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Mark therefore argues that the District Court abused its discretion in approving the Plan of Allocation, and she asks us to vacate that part of the Settlement. She also asks us to appoint her lead plaintiff, and her counsel as lead counsel, for a subclass composed of the class members with S 11 claims.\n\nMark cites three basic legal differences betweenS 10(b) and S 11 claims that affect their relative legal difficulty. First, S 11 claims are strict liability claims (all one needs to establish on the part of the defendant is an untrue statement of material fact in a registration statement) while S 10(b) claims require proof of scienter on the part of the defendant. Second, this difference in the required mental state means that S 11 claims are less fact intensive than S 10(b) claims, with the result that a S 11 claim is much more likely to survive a defendant's motion for summary judgment. Third, there is no proportionate liability under S 11 claims, while there is under S 10(b) if the defendant acted only with recklessness, not knowledge. According to Mark, these three differences make the plaintiff 's task of proving her case easier with a S 11 claim than with a S 10(b) claim, thus making the former a more valuable type of claim.\n\nMark contends that the conflict between the class members with S 11 claims and those without such claims was exacerbated here because Lead Plaintiff used the stronger S 11 claims as leverage to get more recovery for the S 10(b) claims. More specifically, Mark points to the fact that, early in the litigation, Lead Plaintiff agreed to defer a motion for partial summary judgment on its S 11 claims in return for Cendant's agreement to permit informal discovery on the S 10(b) claims. Thus, Mark argues that, in return for benefit for the S 10(b) claims (discovery), Lead Plaintiff sacrificed leverage for the S 11 claims--the summary judgment motion--which she submits could have resulted in an early determination of liability against Cendant.\n\nFinally, Mark points to two other Cendant cases as evidence that S 11 claims against Cendant are easier to prevail on and thus should result in a higher recovery percentage than the 36% this Settlement provides: the PRIDES settlement, In re Cendant Corp. PRIDES Litig., 51 F. Supp. 2d 537 (D.N.J. 1999), and the Yeager litigation, Yeager v. Cendant, 109 F. Supp. 2d 225 (D.N.J. 2000). Mark contends that these cases show that \"an unconflicted Plaintiff with a particularly strong S 11 Claim\" against Cendant can recover close to 100% of her damages, much higher than the 36% return this Settlement garnered. Under the terms of the PRIDES settlement, members of the class received almost 100% of their damages claims. In Yeager, the district court granted partial summary judgment in favor of the plaintiff on the issue of liability on his S 11 claims, while denying summary judgment on S 10(b) liability because there was a genuine issue of material fact as to Cendant's scienter.\n\nMark's arguments are not without force. However, there are several considerations that convince us that the District Court did not abuse its discretion in approving the Plan of Allocation. First, the difference in the liability standards between S 11 and S 10(b) claims ultimately does not make a substantial difference in this case, as it is basically undisputed that Cendant's employees committed fraud, so the necessary scienter for the S 10(b) claims has been admitted. It is true that there is a possible issue of proportionate liability that arises with the S 10(b) claims, because Cendant has stated that it would raise the defense that the scienter of its employees cannot be attributed to Cendant itself. However, as we noted previously, see supra Part III.A.4, based on the record before us we think that Cendant would have a very difficult time making out this defense.\n\nSecond, the real difficulty in the trial of this case would have been establishing damages, a process which both S 10(b) and S 11 claimants would have to undergo equally and which almost certainly would devolve into a\"battle of the experts.\" Although S 11 claimants could at the outset calculate their damages rather simply (by subtracting the price of the stock at the time the lawsuit was brought from the amount that they paid for the stock, see 15 U.S.C. S 77k(e)), the defendant can counter this calculation by showing that any or all of this difference in stock price was caused by something other than the fraud, see id . Thus, on a S 11 claim there would still be a \"battle of the damage experts;\" the only difference between a S 11 and a S 10(b) damage determination in this case is that, on aS 11 claim, the defendant would bear the burden of disproving the plaintiff 's straightforward subtraction calculation. In fact, in Yeager, the district court denied Yeager summary judgment on his S 11 claim in part because the court found that there was a genuine issue of material fact as to the amount of Yeager's S 11 damages. See Yeager, 109 F. Supp. 2d at 229. Furthermore, the informal discovery that Lead Plaintiff obtained in return for deferring the summary judgment motion produced information relevant to determining the Class's damages, which was beneficial to both the S 11 and S 10(b) claims.\n\nFinally, it is also important to note that the S 10(b) damages available to the class members in this case are generally greater than the S 11 damages available, so that in this respect the S 10(b) claims are potentially stronger than the S 11 claims.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e At all events and for all these reasons, we are chary of holding that the respective legal strengths of the S 10(b) and S 11 claims involved here should have been factored into the fairness of the settlement determination. This would be a speculative enterprise at best, and the differences in strength of these claims are not so great as to make the outcome of this process clear.\n\nFurthermore, the PRIDES settlement and the Yeager litigation are distinguishable. The PRIDES settlement involved a paper payout rather than a cash payout (i.e., the plaintiffs got new Cendant stock for their old stock), see Cendant PRIDES, 51 F. Supp. 2d at 540, while the case at bar involves a cash payout.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Second, PRIDES was a \"claims made\" settlement, with unclaimed settlement funds reverting back to Cendant, see id. at 541; here all the settlement cash (and interest) will go to the Class. This point is important because it means that unmade claims in this Settlement will increase the percentage return for each class member, while unmade claims in the PRIDES settlement did not increase each class member's return but instead decreased the amount that Cendant had to pay out. Put another way, giving 36% recovery to 100% of the class in a standard settlement like the case at bar is equivalent (in terms of money paid out by the defendant) to giving 100% recovery in a claims made settlement if only 36% of the class actually makes claims (assuming that each claim is for the same amount).\n\nThus, the \"claims made\" nature of the PRIDES settlement meant that Cendant could agree to a settlement in that case that gave a much higher percentage recovery to all potential class members, because it knew that it only had to pay out to those class members who actually made claims, which was certain to be a subset of the entire class. Not only does this mean that PRIDES is not\"really\" a settlement for 100% recovery (because less than 100% of the potential claimants will make a claim, thus lowering the amount Cendant must pay out), it also means that the settlement in this case is not \"really\" a settlement for 36% recovery (because less than 100% of the potential claimants will make a claim, thus raising the amount each claimant will receive). More specifically, at the time of oral argument in this case, $4.962 billion in claims had been submitted to the Claims Administrator, which translates into a 67% recovery for each class member--almost double the original 36% recovery figure.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nAs for Yeager, that case was not a class action (the plaintiff had opted out of this Class) and was for far less in damages, so any comparisons between Yeager and this case are flawed at best. Furthermore, as we note above, the district court partially denied Yeager summary judgment on his S 11 claims because there was a genuine issue of material fact as to the amount of damages.\n\nFor the foregoing reasons, we reject Mark's arguments and conclude that the District Court did not abuse its discretion by approving a settlement that treatedS 10(b) and S 11 claims more or less equally.\n\nC. The Davidsons' Objections\n\nFor the reasons set forth supra at note 10, it is not clear at this juncture whether the Davidsons are members of the Class. If this Court, in its en banc sitting in November, 2001, decides that the Davidsons are included in the Class, we would be required to pass on the issues they raise in this appeal. Given the proliferation of appeals in this case (this being the seventh appeal in the Cendant proceedings see supra n.11), and the importance of bringing this matter to a close as soon as the issues presently unsettled are resolved, we think it prudent to address those issues now. Because these objections do not warrant extensive treatment, we will dispose of them in relatively short order.\n\n1. Class Certification Findings\n\nThe Davidsons first argue that the District Court erred by failing to make explicit findings that all of Federal Rule of Civil Procedure 23's requirements were met when certifying the Class. They argue further that the court erred by not making those findings again at the settlement stage. In the Davidsons' submission, if the court had made the Rule 23 findings, it never would have certified the Class as it now stands; rather it would have at least certified a subclass for merger claimants like them. In particular, the Davidsons argue that, if it had done its job properly, the court would have (or should have) found that Rule 23(a)'s requirements of typicality and adequate representation were not met by the Class as it was defined and by the Lead Plaintiffs' representation. In their Reply Brief, the Davidsons add the argument that Rule 23(a)'s commonality requirement was not met as well.\n\nHowever, the Davidsons neglected to raise these arguments in a timely fashion, failing to raise them until the settlement approval stage. We thus conclude that they waived these arguments by not raising them earlier. See Joel A. v. Giuliani, 218 F.3d 132, 140 (2d Cir. 2000) (holding that objectors to a class action settlement who argued, at the settlement approval stage, that the Rule 23 requirements were not met for them in their subclass were untimely with their objection, and thus the objection was waived).\n\n2. Notice of the Settlement\n\nThe Davidsons contend that the Settlement Notice given to the class members was insufficient, in that it did not give them sufficient information to make an informed decision whether to opt out before the opt-out deadline. They argue that the relevant terms of the Settlement Agreement--the Plan of Allocation and the scope of the claims against Cendant that were released--were not disclosed before the opt-out period ended. This defect, they assert, made the notice that was sent to the Class insufficient. The Davidsons submit that the court either should have sent out another notice with this particular information about the terms of the Settlement before the opt-out deadline, or should have extended the opt-out deadline (or provided for a new opt-out period) beyond the time that the terms of the Settlement were released. The Davidsons argue that the reaching of a settlement in effect made this class action a settlement class action, so that the notice requirements for a settlement class action set forth in GM Trucks , 55 F.3d 768, 792 (3d Cir. 1995), apply here. We disagree.\n\nThis was not a settlement class action but a previously certified class action that settled. The Davidsons have provided no authority for their contention that if settlement is reached before the opt-out period has run the specific terms of the settlement must be sent to the class before the end of the opt-out period, or that reaching a settlement requires a new opt-out period. We do not think the requirements of Rule 23 mandate these measures, and thus reject the Davidsons' arguments.\n\n3. Intra-Class Conflicts\n\nThe Davidsons press an interesting argument based on the conflicts that allegedly arose within the Class when the Settlement precluded the S 11 claims and 1933 Act S 12 claims\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e [hereinafter \"S 12 claims\"] of class members who acquired CUC shares via non-HFS mergers with CUC, even though the Settlement did not provide any recovery for these S 11 and S 12 claims. The Davidsons contend that the District Court abused its discretion and that the Lead Plaintiff breached its duty to the Class when they accepted and approved a settlement with such terms. Relatedly, the Davidsons contend that an intra-class conflict arose because the Settlement gave HFS merger claimants a choice between calculating their recoveries as S 10(b) or S 11 damages, while non-HFS merger claimants were given no such choice.\n\nAs we understand it, the premises of the Davidsons' argument are that:\n\n(1) The Amended Complaint did not include any S 11 and S 12 claims against Cendant for class members who received Cendant stock from any merger other than the HFS merger;\n\n(2) The Davidsons and other merger partners of Cendant/CUC during the class period have potential S 11 and S 12 claims against Cendant;\n\n(3) These potential S 11 and S 12 claims against Cendant could produce greater damages than a corresponding S 10(b) claim against Cendant;\n\n(4) The Settlement does not allow the Davidsons or other non-HFS merger class members to recover on their S 11 or S 12 claims; under the Plan of Allocation, they are limited to recovering under S 10(b) for their losses; and\n\n(5) The Settlement precludes non-HFS merger class members like the Davidsons from bringing their S 11 and S 12 claims against Cendant in the future.\n\nOn the basis of the foregoing, the Davidsons reason that the Settlement was unfair because: (i) it prevented non-HFS merger class members from recovering on their S 11 and S 12 claims while precluding these class members from bringing those claims in the future, and (ii) it treated the HFS merger claimants specially, by allowing them to recover the higher of their damages calculated underS 10(b) and under S 11, while denying the non-HFS merger class members the same opportunity.\n\nAgain, we disagree. If the Davidsons are arguing that their S 11 and S 12 claims should have been included in the Amended Complaint in the first place, they waived this claim by not bringing it earlier. See Joel A. v. Giuliani, 218 F.3d 132, 140 (2d Cir. 2000). Furthermore, regarding the claim that an intra-class conflict arose from the special treatment given the HFS claimants, we reject a fundamental premise of the Davidsons' above argument, namely (3): that the Davidsons' S 11 claims could produce greater damages than their corresponding S 10(b) claims.\n\nThe Davidsons' S 11 claims would have to be determined under the relevant section of the 1933 Securities Act by using the date of the filing of this lawsuit. See supra n.8. However, using that date, the Davidsons' potentialS 11 damages as we calculate them are less than the S 10(b) damages that they are allotted under the Plan of Allocation. Thus, the Davidsons are not prejudiced by being limited to only S 10(b) damages under the terms of the Settlement--those damages are greater than any S 11 damages they would have received under the Plan of Allocation--so there is no unfairness or intra-class conflict here.\n\n4. Alleged Flaws in the Plan of Allocation\n\nThe Davidsons submit that the District Court abused its discretion in approving the Settlement's Plan of Allocation because the Plan \"was based upon clearly erroneous premises.\" They contend that the Plan does not correctly determine out-of-pocket damages for the S 10(b) claims because it does not correctly define the \"true value\" of Cendant stock when it was purchased by the class members, as it uses figures that \"pool\" Cendant's finances with companies that Cendant merged with. Concomitantly, the Davidsons argue that the Lead Plaintiff did not establish a proper evidentiary basis for the Plan's method of determining damages.\n\nIt is clear from the record that the District Court was faced with competing expert opinions on the proper way to determine and allocate damages. The record shows that the court carefully considered the expert advice, and then chose to accept the plan submitted by the Lead Plaintiff 's damages expert over the plan submitted by the Davidsons' expert. This kind of decision is intensely fact-based, falling within the purview of the District Court's discretion. The District Court properly based its decision on evidence offered by the Lead Plaintiff, which provided more than a sufficient evidentiary basis for its decision. See, e.g., Bradford Cornell \u0026 R. Gregory Morgan, Using Finance Theory to Measure Damages in Fraud on the Market Cases, 37 U.C.L.A. L. Rev. 883 (1990) (presenting the damages study on which the Plan of Allocation was based); In re California Micro Devices Securities Litig., 965 F. Supp. 1327 (N.D. Cal. 1997) (using the same method of allocating maximum artificial inflation over the class period, developed by David L. Ross of Lexicon, Inc., as was used here). We therefore find no abuse of the court's discretion in its decision to accept the Plan of Allocation.\n\nAccordingly, the Davidsons' objections are rejected.\n\nIV. COUNSEL SELECTION AND COUNSEL FEES\n\nWe turn to the issues involving the selection of lead counsel and the determination of its fee. The Reform Act establishes detailed and interrelated procedures for choosing a lead plaintiff and selecting lead counsel. We first address the District Court's appointment of the CalPERS Group as lead plaintiff, and then its choice to use an auction to select lead counsel. With respect to legal questions--including whether the District Court applied the correct standards in selecting the lead plaintiff and when, if ever, a court may hold an auction to select lead counsel in cases governed by the PSLRA--we review de novo. See Brytus v. Spang \u0026 Co., 203 F.3d 238, 244 (3d Cir. 2000). If the court committed no legal errors, we review its award of attorneys fees for abuse of discretion. See id.\n\nA. Introduction: Attorney-Client Tension in the Class Action Context\n\nLawyers operate under ethical rules that require them to serve only their clients' interests. When a representation involves a single client, the ability to select, retain, and monitor counsel gives clients reason to be confident that their lawyers will live up to this obligation. The power to select counsel lets clients choose lawyers with whom they are comfortable and in whose ability and integrity they have confidence. The power to negotiate the terms under which counsel is retained confers upon clients the ability to craft fee agreements that promise to hold down lawyers' fees and that work to align their lawyers' economic interests with their own. And the power to monitor lawyers' performance and to communicate concerns allows clients to police their lawyers' conduct and thus prevent shirking. This regime has served the American legal system well for a very long time.\n\n1. The Problem With Class Actions\n\nMost of the safeguards we have described vanish in the class action context, where \"the client\" is a sizeable, often far-flung, group. Logistical and coordination problems invariably preclude class members from meeting and agreeing on anything, and, at all events, most class members generally lack the economic incentive or sophistication to take an active role. There is simply no way for \"the class\" to select, retain, or monitor counsel.\n\nAlthough class counsel has an ethical duty of undivided loyalty to the interests of the class, reason for concern remains. This is in large measure because a rational, self-interested client seeks to maximize net recovery; he or she wants the representation to terminate when his or her gross recovery minus his or her counsel's fee is largest. In contrast, at least in theory and often in practice, a rational, self-interested lawyer looks to maximize his or her net fee, and thus wants the representation to end at the moment where the difference between his or her fees and costs--which include not only the money that the lawyer spends in advancing his or her client's cause but also the opportunities for other work that the lawyer gives up by pursuing it--is greatest. These two points rarely converge. As a result, there is often a conflict between the economic interests of clients and their lawyers, and this fact creates reason to fear that class counsel will be highly imperfect agents for the class.\n\nBecause of this conflict (and because \"the class\" cannot counteract its effects via counsel selection, retention, and monitoring), an agent must be located to oversee the relationship between the class and its lawyers. Traditionally, that agent has been the court. Although some courts have played an active role with regard to selecting lead counsel in securities cases, most have traditionally appointed the person who filed the first suit as lead plaintiff, and generally selected that person's lawyer to serve as lead counsel (assuming, of course, that the lawyer possessed sufficient competence and experience). See, e.g., H.R. Conf. Rep. 104-369, at 33 (1995), reprinted in 1995 U.S.C.C.A.N. 730, 732. In addition, time and institutional constraints have generally prevented courts from actively monitoring the performance of lead counsel during the pendency of litigation.\n\nUnder such a regime, it was essential for courts to scrutinize fee requests to protect the interests of absent class members. Lead plaintiffs were often unsophisticated investors who held small claims, and, according to some reports, they were sometimes paid \"bounties\" by lead counsel in exchange for their \"services.\" See id. In such situations, it was unlikely that the lead plaintiff had undertaken a meaningful counsel selection process; indeed it was suspected that lead counsel generally selected the lead plaintiff rather than vice versa. See id. at 32-33, reprinted in 1995 U.S.C.C.A.N. 730, 731-32; S. Rep. No. 104-98, at 6 (1995), reprinted in 1995 U.S.C.C.A.N. 679, 685. Moreover, there was generally little reason to believe that the lead plaintiff had the incentive or inclination to engage in aggressive or effective bargaining over lead counsel's fee, or that a typical lead plaintiff could be counted on to engage in meaningful monitoring of lead counsel's performance.\n\n2. The Evolution of Judicial Review of Counsel Fees In Class Actions\n\nCourts have developed several means of reviewing the reasonableness of fee requests. At the dawn of the class action era, the most frequently used device was the lodestar method, which was developed by this Court in Lindy Brothers Builders, Inc. of Philadelphia v. American Radiator \u0026 Standard Sanitary Corp., 487 F.2d 161 (3d Cir. 1973). Under that approach, the court assesses the number of hours that lead counsel reasonably worked, decides the reasonable hourly rate for the lawyers' services, and determines counsel's fee by multiplying the number of hours reasonably worked by the reasonable hourly rate.\n\nThe Supreme Court has developed an elaborate jurisprudence covering the proper application of the lodestar method, which remains the governing approach for cases governed by fee-shifting statutes. See, e.g., Hensley v. Eckerhart, 461 U.S. 424 (1983); Blum v. Stenson, 465 U.S. 886 (1984); Webb v. Board of Educ. of Dyer County, 471 U.S. 234 (1985); City of Riverside v. Rivera, 477 U.S. 561 (1986); Pennsylvania v. Delaware Valley Citizens' Counsel for Clean Air, 483 U.S. 711 (1987); Blanchard v. Bergeron, 489 U.S. 87 (1989); Farrar v. Hobby, 506 U.S. 103 (1992).\n\nOver time, criticism mounted against using the lodestar method, especially in \"common fund\" cases such as this one. The \"common-fund doctrine . . . allows a person who maintains a lawsuit that results in the creation, preservation, or increase of a fund in which others have a common interest[ ] to be reimbursed from that fund for litigation expenses incurred.\" Report of the Third Circuit Task Force, Court Awarded Attorney Fees, 108 F.R.D. 237, 241 (1985) [hereinafter \"1985 Task Force Report\"]. In common fund cases the fees paid to class counsel come directly out of the recovery of the class, as opposed to statutory fee-shifting cases where the plaintiffs' recovery and counsel's fees are distinct. In those situations, every additional dollar given to class counsel means one less dollar for the class, regardless how a total settlement package is formally structured. Cf. GM Trucks , 55 F.3d at 821 (\"[P]rivate agreements to structure artificially separated fee and settlement arrangements cannot transform what is in economic reality a common fund situation into a statutory fee shifting case.\")\n\nAs the 1985 Task Force Report recognized, using the lodestar method in the common fund context creates numerous problems. First, because the lodestar compensates lawyers based on hours worked rather than results achieved, there is a risk that it will cause lawyers to work excessive hours, inflate their hourly rate, or decline beneficial settlement offers that are made early in litigation. See 1985 Task Force Report, 108 F.R.D. at 247-48. Second, requiring courts to decide how many hours a lawyer \"reasonably\" worked in pursuing a given matter requires an enormous investment of judicial time. See id. at 246. Third, though creating the illusion of mathematical precision, the lodestar method can be quite subjective and can produce wildly varying awards in otherwise similar cases. See id. at 246-47.\n\nIn light of these criticisms, the 1985 Task Force Report recommended a different device for setting attorneys fees in common fund class actions: the percentage-of-recovery method. See id. at 255. This Court has generally accepted that recommendation. See, e.g., In re Prudential Ins. Co. of Am. Sales Practices Litig., 148 F.3d 283, 333-34 (3d Cir. 1998). Under the percentage-of-recovery approach, a court charged with determining whether a particular fee is \"reasonable\" first calculates the percentage of the total recovery that the proposal would allocate to attorneys fees by dividing the amount of the requested fee by the total amount paid out by the defendant; it then inquires whether that percentage is appropriate based on the circumstances of the case. In making that decision, this Court has directed district courts to consider numerous factors, as well as recommending that they employ a lodestar\"cross-check.\" See, e.g., In re Cendant Corp. PRIDES Litig., 243 F.3d 722, 733-35 (3d Cir. 2001).\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nThe 1985 Task Force Report also identified another problem with the traditional approach: the fact that fees and their method of calculation were generally not set until the conclusion of litigation. This reality was troubling for a several reasons. First, it required the court to assess the reasonableness and efficacy of counsel's efforts in hindsight, with all of the risks of distortion and bias associated with this kind of decision-making. Second, it meant that attorneys had to litigate an entire case before finding out what hours or actions the court would consider \"reasonable.\" Third, waiting until the end to set fee terms eliminated any potential for those terms to align the incentives of the class and its lawyers during the pendency of the litigation. The Task Force Report recommended that courts \"attempt to establish a percentage fee arrangement agreeable to the Bench and to plaintiff 's counsel . . . at the earliest practicable moment.\" 108 F.R.D. at 255. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nThe 1985 Task Force Report recognized that it would be problematic to have the presiding judge set a fee award at the outset of a case. See id. at 256. One cannot develop a fee scale without making an assessment of the likelihood of success and the size of the recovery. But requiring the court to make (and act upon) an assessment of the strength of a plaintiff class's case early in litigation was thought to be in tension with the need for judges to be objective. Although the Task Force Report proposed a process for up-front fee negotiation through a court-appointed, non-judicial representative, it does not appear to have been taken up by any court.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nThe Task Force Report's recommendations contained no suggestions for changes in the areas of counsel selection and counsel monitoring. The first major attempt to address counsel selection as well as fees came in Judge Vaughn R. Walker's application of the auction technique in In re Oracle Securities Litigation, 131 F.R.D. 688 (N.D. Cal. 1990), which has since been used in a number of cases that are listed in the margin.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e The basic concept is simple: the judge solicits bids from law firms to serve as lead counsel and selects the lowest bidder that the court determines will adequately represent the class. In theory, an auction will mimic a market transaction and result in reasonable quality, low-cost representation for the class.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nThe auction method offers several potential advantages. First, unlike all of the methods previously discussed, it deals with counsel selection in addition to counsel retention. When an auction is used, counsel are no longer \"selected\" by the race-to-the-courthouse method, and this means that courts can exercise greater control over counsel quality. Second, auctions may lead to lower-priced representation. Under the traditional method, lead counsel (who has already been appointed) tries to get as much as it can from the court in terms of fees. Under the auction method, in contrast, prospective lead counsel compete to submit the lowest reasonable bid.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Third, assuming a sufficiently large number of bidders, an auction will likely better approximate a market transaction than having a judge set attorneys fees after the fact. Fourth, auctions may provide a way for new firms to enter the market for plaintiff-side securities class action lawyers, thus rendering the overall market more competitive.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Fifth, the auction method may require a smaller investment of judicial time than the time-consuming lodestar method, and could minimize the dangers of hindsight biases associated with the traditional, after-the-fact approach to determining fees. This Court has recognized the potential benefits of the auction method, commending it to district courts in this circuit for their consideration as one potential approach to the problems in this area. See Gunter v. Ridgewood Energy Corp., 223 F.3d 190, 201 n.6 (3d Cir. 2000). \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nAuctions may not be a panacea, however. One persistent criticism is that courts generally identify the\"lowest\" bid submitted by an \"adequate\" bidder and appoint that bidder as lead counsel, without performing the cost/quality weighing in the way that a real client would.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e Another fear is that because auctions do not reward the attorneys who discover legal violations, they may reduce lawyers' incentives to seek out and disclose illegality (because unless they are selected as lead counsel, they may not be compensated for the time they spent doing so).\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Moreover, bids in large, potentially high-recovery, cases are likely to be quite complex and it may be difficult for courts to assess their relative costs to the class. This risk is especially strong in cases where the bids consist of a complicated set of alternate fees that vary depending on the size of the recovery and the stage of the proceedings at which the recovery is obtained. In such situations, a court cannot assess which bid is the cheapest without first assessing the likely amount of recovery.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e Additionally, if there are too few bidders, the degree to which an auction will actually simulate the market is questionable.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Finally, there is a risk that auctions could result in a \"winner's curse,\" systematically selecting bidders who overestimate the odds or amount of a likely recovery. Such a \"winning\" bidder might then find itself litigating an unprofitable case, which may then give it an incentive to settle early and cheaply.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nNo consensus has yet emerged about the relative efficacy of the auction technique, although Judge Walker and Judge Milton I. Shadur of the United States District Court for the Northern District of Illinois have made a powerful case for it, both in terms of policy and tangible (fee-saving) results.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Despite significant differences, it is critical to realize that the traditional approach, the procedure suggested by the 1985 Task Force Report, and the auction method all share two critical traits. First, none of them addresses the inability of the class, a typical lead plaintiff, or the court to monitor lead counsel in an adequate manner. Second, and perhaps more significantly, all three methods rely on the court (or an agent hand-picked by the court) to serve as the class's agent vis-a-vis its counsel. This is less true under the auction method, but even then the court must decide which bidders are \"qualified,\" assess which bids are \"adequate,\" and determine which of the adequate bids submitted by qualified bidders is the \"lowest.\" Another option would be to assign responsibility to a different type of agent. In 1995, two scholars recommended that Congress do just that.\n\n3. The PSLRA\n\nIn Let the Money Do the Monitoring: How Institutional Investors Can Reduce Agency Costs in Securities Class Actions, Professors Elliott J. Weiss and John S. Beckerman argued that institutional investors are well suited to select, retain, and monitor lead counsel in securities class actions. See 104 Yale L.J. 2053 (1995). Their article explained how then-current practices deterred institutional investors from taking a more active role, and recommended legislation to encourage them to serve as lead plaintiffs.\n\nThe Weiss and Beckerman proposal had three parts. First, to ensure that institutional investors found out about pending class actions, they argued that courts should require that meaningful notices be sent out soon after the filing of a complaint. See id. at 2108. Second, \"because the named plaintiff or group of plaintiffs with the largest financial stake in the outcome of an action has the greatest economic incentive to monitor class counsel's performance effectively,\" Weiss and Beckerman suggested that courts \"adopt a presumption that that plaintiff or group will `most adequately' represent class members' interests.\" Id. at 2105. They recommended that \"[c]courts . . . provide other putative plaintiffs with an opportunity to rebut this presumption, but should allow them to do so only by demonstrating that the presumptively `most adequate' plaintiff has a significant disqualifying conflict of interest or is subject to unique defenses that would render it incapable of adequately representing the class.\" Id. at 2105-06. Weiss and Beckerman further suggested that only putative class members should be permitted to file adequacy and typicality objections against the presumptive lead plaintiff, and recommended that even those parties be entitled to discovery \"only where they can demonstrate some reasonable basis for believing that a presumptively adequate plaintiff would not be capable of representing the class adequately.\" Id. at 2109.\n\nThird, once such a lead plaintiff was selected, Weiss and Beckerman submitted that courts should \"[a]ppoint as lead counsel the attorney for the `most adequate plaintiff ' \" and should defer to that plaintiff 's discretion in setting attorneys fees, noting that institutional investors are \"experienced and sophisticated consumers of legal services.\" Id. at 2105-06. Weiss and Beckerman speculated that if institutional investors frequently served as lead plaintiffs, plaintiff-side securities law firms would grow increasingly concerned about their long-term reputations with such investors and thus might have less incentive to shirk in particular cases. See id. at 2106-07. The authors acknowledged that fee structures negotiated by institutional lead plaintiffs might \"differ substantially from the fee structure that courts currently employ,\" but suggested that courts \"might well feel confident in assuming that a fee arrangement an institutional investor had negotiated with its lawyers before initiating a class action maximized those lawyers' incentives to represent diligently the class's interests, reflected the deal a fully informed client would negotiate, and thus presumptively was reasonable.\" Id. at 2105.\n\nSoon after Weiss and Beckerman's article was published, Congress enacted the PSLRA. The statute establishes a detailed and integrated procedure for selecting a lead plaintiff and for choosing and retaining lead counsel in securities class actions that is unquestionably based on Weiss and Beckerman's proposal. Compare 15 U.S.C. S 78u-4(a)(3), with Weiss \u0026 Beckerman, 104 Yale L.J. at 2105-09. See generally S. Rep. No. 104-98, at 11 n.32 (1995), reprinted in 1995 U.S.C.C.A.N. 679, 690 n.32 (stating that Weiss and Beckerman's article \"provided the basis for the `most adequate Plaintiff ' provision\").\n\nB. The Reform Act's Procedures; Selection of the CalPERS Group As Lead Plaintiff\n\nThe Reform Act establishes a two-step process for appointing a lead plaintiff: the court first identifies the presumptive lead plaintiff, and then determines whether any member of the putative class has rebutted the presumption. See 15 U.S.C. S 78u-4(a)(3)(B)(iii)(I) \u0026 (II). We begin by describing the manner in which courts charged with appointing a lead plaintiff should proceed under the PSLRA. We then measure the actions taken by the District Court against these standards.\n\n1. Legal Standards\n\na. Identifying the Presumptive Lead Plaintiff\n\nIn appointing a lead plaintiff, the court's first duty is to identify the movant that is presumptively entitled to that status. The process begins with the identification of the movant with \"the largest financial interest in the relief sought by the class.\" 15 U.S.C. S 78u-4(a)(3)(B)(iii)(I)(bb). In many cases (such as this one, see supra Part II.B), this determination will be relatively easy, but in others it may prove difficult. The Reform Act provides no formula for courts to follow in making this assessment, but we agree with the many district courts that have held that courts should consider, among other things: (1) the number of shares that the movant purchased during the putative class period; (2) the total net funds expended by the plaintiffs during the class period; and (3) the approximate losses suffered by the plaintiffs. See Lax v. First Merch. Acceptance Corp., No. 97 C 2715, 1997 WL 461036, at *5 (N.D. Ill. Aug. 11, 1997); see also In re Nice Sys. Sec. Litig. , 188 F.R.D. 206, 217 (D.N.J. 1999) (citing Lax for this proposition); In re Olsten Corp. Sec. Litig., 3 F. Supp. 2d 286, 295 (E.D.N.Y. 1998) (same).\n\nAny time the question appears genuinely contestable, we think that a district court would be well within its discretion in requiring that competing movants submit documentation as to their holdings in the defendant company or companies and in seeking further information if it deems the original submissions to be an inadequate basis for an informed decision. Once the court has identified the movant with \"the largest financial interest in the relief sought by the class,\" it should then turn to the question whether that movant \"otherwise satisfies the requirements of Rule 23 of the Federal Rules of Civil Procedure,\" and is thus the presumptively most adequate plaintiff. 15 U.S.C. S 78u-4(a)(3)(B)(iii)(I)(cc). This latter requirement casts into stark relief a serious ambiguity contained in the Reform Act's mechanism for selecting a lead plaintiff.\n\nThe section of the PSLRA that governs the appointment of the lead plaintiff is captioned \"Rebuttable Presumption.\" The first subsection, captioned \"[i]n general,\" provides that \"the court shall adopt a presumption that the most adequate plaintiff . . . is the person or group of persons that\": (1) filed the complaint or made a motion to serve as the lead plaintiff; (2) \"in the determination of the court, has the largest financial interest in the relief sought by the class;\" and (3) \"otherwise satisfies the requirements of Rule 23 of the Federal Rules of Civil Procedure.\" Id. S 78u-4(a)(3)(B)(iii)(I). The next subsection, captioned\"[r]ebuttal evidence,\" declares that the presumption established by the previous subsection \"may be rebutted only upon proof by a member of the purported plaintiff class that the presumptively most adequate plaintiff -- (aa) will not fairly and adequately protect the interests of the class; or (bb) is subject to unique defenses that render such plaintiff incapable of adequately representing the class.\" Id. S 78u-4(a)(3)(B)(iii)(II).\n\nThe draftmanship of this section is inartful and hence problematic. The first subsection states that a movant is not entitled to the lead plaintiff presumption unless it \"otherwise satisfies\" Rule 23. The two provisions of that Rule that are relevant to this issue are 23(a)(3) and 23(a)(4). The former requires that a party seeking to represent a class have \"claims or defenses [that] are typical of the claims or defenses of the class\" [hereinafter\"the typicality requirement\"]. The latter mandates that a representative party be able to \"fairly and adequately protect the interests of the class\" [hereinafter \"the adequacy requirement\"]. Read in isolation, the provision of the Reform Act that deals with triggering the presumption (i.e., 15 U.S.C. S 78u-4(a)(3)(B)(iii)(I)(cc)) seems quite clear that a court must ensure that a movant satisfies both the typicality and adequacy requirements of Rule 23 before conferring upon that movant the status of presumptive lead plaintiff.\n\nThis conclusion, however, is in some tension with the second subsection (i.e., 15 U.S.C. S 78u-4(a)(3)(B)(iii)(II)), which seems to establish that the only way to rebut the presumption is to show that the presumptive lead plaintiff does not satisfy the typicality and/or adequacy requirements. The statute thus simultaneously appears to make \"typicality\" and \"adequacy\" both part of the threshold identification of the presumptive lead plaintiff and the sole means of rebutting the lead plaintiff presumption. Put another way, if the requirements of the first subsection are met, the statute can be read to say that the requirements of the second subsection are moot. To say the least, it is difficult to believe that Congress intended such an incongruity.\n\nThe overall structure and legislative history of the statute suggest that in appointing a lead plaintiff a district court should engage in the following analysis. The initial inquiry (i.e., the determination of whether the movant with the largest interest in the case \"otherwise satisfies\" Rule 23) should be confined to determining whether the movant has made a prima facie showing of typicality and adequacy. The initial clause of the statute, which governs triggering the presumption, refers to determinations made by \"the court,\" 15 U.S.C. S 78u-4(a)(3)(B)(iii)(I), but the second, which deals with rebutting it, speaks of \"proof by a member of the purported plaintiff class,\" id. S 78u-4(a)(3)(B)(iii)(II). This phrasing suggests that the threshold determination of whether the movant with the largest financial losses satisfies the typicality and adequacy requirements should be a product of the court's independent judgment, and that arguments by members of the purported plaintiff class as to why it does not should be considered only in the context of assessing whether the presumption has been rebutted.\n\nMoreover, both the statutory structure and the legislative history suggest that the court's initial inquiry as to whether the movant with the largest losses satisfies the typicality and adequacy requirements need not be extensive. The first subsection (the one that deals with triggering the lead plaintiff presumption) requires that a movant \"otherwise satisf[y]\" Rule 23, but the second (which covers rebutting it) requires \"proof \" that the presumptively most adequate plaintiff does not. The provision as a whole would make little sense if we interpreted the first subsection as requiring that a movant \"prove\" that it satisfied Rule 23 in order to get the benefit of the lead plaintiff presumption, because that would create a situation in which the only way to rebut the presumption would be to \"disprove\" something that the presumptively most adequate plaintiff had already \"proved.\" But if, in contrast, the first subsection requires only a prima facie showing that the movant with the largest losses satisfies Rule 23, the two subsections are reasonably harmonious.\n\nLastly, this reading is consistent with the legislative history. In explaining why institutional investors would make desirable lead plaintiffs, the Conference Committee Report opines that \"[i]nstitutional investors and other class members with large amounts at stake will represent the interests of the plaintiff class more effectively than class members with small amounts at stake. The claims of both types of class members generally will be typical.\" H.R. Conf. Rep. 104-327, at 34 (1995), reprinted in 1995 U.S.C.C.A.N. 730, 737. The terms of this language reflect the view that institutional investors and others with large losses will, more often than not, satisfy the typicality and adequacy requirements. Thus, although the language of the first subsection does not permit courts simply to \"presume\" that the movant with \"the largest financial interest in the relief sought by the class\" satisfies the typicality and adequacy requirements, both the structure of the section as a whole and the legislative history support the view that the court's initial inquiry should be confined to determining whether such movants have stated a prima facie case of typicality and adequacy. See, e.g., Gluck v. Cellstar Corp. , 976 F. Supp. 542, 546 (N.D. Tex. 1997) (stating that in determining whether a movant is entitled to presumptive lead status, \"[a] comprehensive reading of the statute reveals that [the movant] need only make a preliminary showing that it satisfies [the typicality and adequacy] requirements\"); In re Olsten Corp. Sec. Litig., 3 F. Supp. 2d 286, 296 (E.D.N.Y. 1998) (same); In re Advanced Tissue Sci. Sec. Litig., 184 F.R.D. 346, 349 (S.D. Cal. 1998) (same); In re Milestone Sci. Sec. Litig., 183 F.R.D. 404, 414 (D.N.J. 1998) (same).\n\nIn conducting the initial inquiry as to whether the movant with the largest losses satisfies the typicality and adequacy requirements, the court may and should consider the pleadings that have been filed, the movant's application, and any other information that the court requires to be submitted. In keeping with the statutory text, however, the court generally will not consider at this stage any arguments by other members of the putative class; rather, such allegations should be dealt with in terms of assessing whether the lead plaintiff presumption has been rebutted rather than in terms of deciding whether it has been triggered.\n\nWhen making these determinations, courts should apply traditional Rule 23 principles. Thus, in inquiring whether the movant has preliminarily satisfied the typicality requirement, they should consider whether the circumstances of the movant with the largest losses\"are markedly different or the legal theory upon which the claims [of that movant] are based differ[ ] from that upon which the claims of other class members will perforce be based.\" Hassine v. Jeffes, 846 F.2d 169, 177 (3d Cir. 1988) (internal quotation marks and citation omitted); see also Georgine v. Windsor, 83 F.3d 610, 631 (3d Cir. 1996) (same).\n\nIn assessing whether the movant satisfies Rule 23's adequacy requirement, courts should consider whether it \"has the ability and incentive to represent the claims of the class vigorously, [whether it] has obtained adequate counsel, and [whether] there is [a] conflict between [the movant's] claims and those asserted on behalf of the class.\" Hassine, 846 F.2d at 179; see also Georgine, 83 F.3d at 630 (stating that the adequacy of representation inquiry involves consideration of both whether \"the interests of the named plaintiffs [are] sufficiently aligned with those of the absentees\" and whether \"class counsel [is] qualified and [will] serve the interests of the entire class\"); GM Trucks, 55 F.3d at 800 (same).\n\nIn making the initial adequacy assessment in this context, courts should also consider two additional factors. Because one of a lead plaintiff 's most important functions is to \"select and retain\" lead counsel, see 15 U.S.C. S 78u-4(a)(3)(B)(v), one of the best ways for a court to ensure that it will fairly and adequately represent the interests of the class is to inquire whether the movant has demonstrated a willingness and ability to select competent class counsel and to negotiate a reasonable retainer agreement with that counsel, see, e.g., In re Quintus Sec. Litig. , No. C-00-4263, slip op. at 9 (N.D. Cal. Apr. 12, 2001).\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e Thus, a court might conclude that the movant with the largest losses could not surmount the threshold adequacy inquiry if it lacked legal experience or sophistication, intended to select as lead counsel a firm that was plainly incapable of undertaking the representation, or had negotiated a clearly unreasonable fee agreement with its chosen counsel, see, e.g., Raftery v. Mercury Fin. Co., No. 97 C 624, 1997 WL 529553, at *2 (N.D. Ill. Aug. 15, 1997) (refusing to recognize a movant as the presumptive lead plaintiff because the court was of the view that the retainer agreement between it and its chosen counsel, which \"capped\" counsel's fees at 33 1/3% of the class's total recovery, was \"not the result of hard bargaining\").\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e We stress, however, that the question at this stage is not whether the court would\"approve\" that movant's choice of counsel or the terms of its retainer agreement or whether another movant may have chosen better lawyers or negotiated a better fee agreement; rather, the question is whether the choices made by the movant with the largest losses are so deficient as to demonstrate that it will not fairly and adequately represent the interests of the class, thus disqualifying it from serving as lead plaintiff at all.\n\nThe second additional factor that the court should consider in making the threshold adequacy determination will arise only when the movant with the largest interest in the relief sought by the class is a group rather than an individual person or entity. The PSLRA explicitly permits a \"group of persons\" to serve as lead plaintiff. See 15 U.S.C. S 78u-4(a)(3)(B)(iii)(I); see also id.S 78u-4(a)(3)(B)(i) (providing that the court \"shall appoint as lead plaintiff the member or members of the purported plaintiff class that the court determines to be the most capable of adequately representing the interests of class members\") (emphasis added). But the goal of the Reform Act's lead plaintiff provision is to locate a person or entity whose sophistication and interest in the litigation are sufficient to permit that person or entity to function as an active agent for the class, see, e.g., H.R. Conf. Rep. No. 104-369, at 32 (1995) reprinted in 1995 U.S.C.C.A.N. 730, 731; S. Rep. No. 104-98, at 10 (1995), reprinted in 1995 U.S.C.C.A.N. 679, 689; Weiss \u0026 Beckerman, 104 Yale L.J. at 2105--06, and a group is not entitled to presumptive lead plaintiff status unless it \"otherwise satisfies\" Rule 23, which in turn requires that it be able to \"fairly and adequately protect the interests of the class.\" If the court determines that the way in which a group seeking to become lead plaintiff was formed or the manner in which it is constituted would preclude it from fulfilling the tasks assigned to a lead plaintiff, the court should disqualify that movant on the grounds that it will not fairly and adequately represent the interests of the class.\n\nWe note at this juncture that we disagree with those courts that have held that the statute invariably precludes a group of \"unrelated individuals\" from serving as a lead plaintiff. See, e.g., Sakhrani v. Brightpoint, Inc., 78 F. Supp. 2d 845, 853 (S.D. Ind. 1999); In re Telxon Corp. Sec. Litig., 67 F. Supp. 2d 803, 811-16 (N.D. Ohio 1999); In re Donnkenny Inc. Sec. Litig., 171 F.R.D. 156, 157-58 (S.D.N.Y. 1997). The statute contains no requirement mandating that the members of a proper group be\"related\" in some manner; it requires only that any such group \"fairly and adequately protect the interests of the class.\" We do not intimate that the extent of the prior relationships and/or connection between the members of a movant group should not properly enter into the calculus of whether that group would \"fairly and adequately protect the interests of the class,\" but it is this test, not one of relatedness, with which courts should be concerned.\n\nIf, for example, a court were to determine that the movant \"group\" with the largest losses had been created by the efforts of lawyers hoping to ensure their eventual appointment as lead counsel, it could well conclude, based on this history, that the members of that \"group\" could not be counted on to monitor counsel in a sufficient manner. See, e.g., In re Razorfish, Inc. Sec. Litig., No. 00 CV 9474 JSR, 2001 WL 476504, at *3 (S.D.N.Y. May 4, 2001) (refusing to appoint as lead plaintiff a group that, in the court's view, was \"simply an artifice cobbled together by cooperating counsel for the obvious purpose of creating a large enough grouping of investors to qualify as`lead plaintiff,' which can then select the equally artificial grouping of counsel as `lead counsel' \").\n\nCourts must also inquire whether a movant group is too large to represent the class in an adequate manner. At some point, a group becomes too large for its members to operate effectively as a single unit. See, e.g., Chill v. Green Tree Fin. Corp., 181 F.R.D. 398, 408-09 (D. Minn. 1998) (\"[T]he larger [the size of a proposed lead plaintiff group], the greater the dilution of the control that [the members of that group] can maintain over the conduct of the putative class action.\") (internal quotation marks and citation omitted). When that happens, the PSLRA's goal of having an engaged lead plaintiff actively supervise the conduct of the litigation and the actions of class counsel will be impossible to achieve, and the court should conclude that such a movant does not satisfy the adequacy requirement. See, e.g., In re Advanced Tissue Sci. Sec. Litig. , 184 F.R.D. 346, 352 (S.D. Cal. 1998) (refusing to appoint a group consisting of \"over 250 unrelated investors\" because of the court's determination that doing so would be \"inconsistent with the goal of restoring control over lawsuits to plaintiffs instead of counsel\"); Chill, 181 F.R.D. at 408 (declining to confer presumptive lead plaintiff status upon a\"group\" with almost 300 members because doing so \"would threaten the interests of the class, would subvert the intent of Congress, and would be too unwieldy to allow for the just, speedy and inexpensive determination of this action\").\n\nLike many of the district courts that have considered this question, we do not establish a hard-and-fast rule; instead, we note only that a kind of \"rule of reason prevails.\" See, e.g., Advanced Tissue, 184 F.R.D. at 352; Chill, 181 F.R.D. at 409. We do, however, agree with the Securities and Exchange Commission that courts should generally presume that groups with more than five members are too large to work effectively. See Brief for the Securities and Exchange Commission as Amicus Curiae at 17 n.13.\n\nWe do not intimate that other reasons could not justify a court's decision that the Rule 23's adequacy of representation requirement is not satisfied. If (for any reason) the court determines that the movant with the largest losses cannot make a threshold showing of typicality or adequacy, then the court should explain its reasoning on the record (so that appellate courts will have an adequate basis for review) and disqualify that movant from serving as lead plaintiff. The court should then identify the movant with the next largest loss, consider whether that movant satisfies Rule 23's requirements, and repeat this process until a presumptive lead plaintiff is identified. See, e.g., Raftery, 1997 WL 529553, at *2-4, 7 (identifying a presumptive lead plaintiff after disqualifying two movants with larger losses, one on grounds of atypicality and one on grounds of inadequacy).\n\nb. Determining Whether the Presumption Has Been Rebutted\n\nOnce a presumptive lead plaintiff is located, the court should then turn to the question whether the presumption has been rebutted. The Reform Act is quite specific on this point, providing that the presumption \"may be rebutted only upon proof by a member of the purported plaintiff class that the presumptively most adequate plaintiff -- (aa) will not fairly and adequately protect the interests of the class; or (bb) is subject to unique defenses that render such plaintiff incapable of adequately representing the class.\" 15 U.S.C. S 78u-4(a)(3)(B)(iii)(II) (emphasis added). This language makes two things clear. First, only class members may seek to rebut the presumption, and the court should not permit or consider any arguments by defendants or non-class members. See, e.g., Gluck v. Cellstar Corp., 976 F. Supp. 542, 550 (N.D. Tex. 1997) (\"The statute is clear that only potential plaintiffs may be heard regarding the appointment of a Lead Plaintiff.\"). Second, once the presumption is triggered, the question is not whether another movant might do a better job of protecting the interests of the class than the presumptive lead plaintiff; instead, the question is whether anyone can prove that the presumptive lead plaintiff will not do a \"fair[ ] and adequate[ ]\" job. We do not suggest that this is a low standard, but merely stress that the inquiry is not a relative one.\n\nIf no class member succeeds in rebutting the presumption, then the district court should appoint the presumptive lead plaintiff as the lead plaintiff. If the presumption has been rebutted, the court must begin the process anew (i.e., identifying which of the remaining movants has the highest financial interest in the class's recovery, assessing whether that movant satisfies the threshold typicality and adequacy requirements, and determining whether the presumption has been rebutted) until a lead plaintiff is selected.\n\n2. Application of the Standards Here\n\nUnder these standards, we believe that the District Court correctly identified the CalPERS Group as the presumptively most adequate plaintiff. The Group filed a motion to serve as lead plaintiff, and no party has questioned that of all the movants it has the largest financial interest in the relief sought by the Class. The District Court expressly found that the CalPERS Group satisfied Rule 23(a)'s typicality requirement. See In re Cendant Corp. Litig., 182 F.R.D. 144, 149-50 (D.N.J. 1998). Although we have expressed concerns about certain potential conflicts of interest that might have undermined the CalPERS Group's position, we have concluded that they do not carry the day. See supra Part III.B.1(a).\n\nThe District Court also found no obvious reason to doubt that a group composed of the three largest pension funds in the United States could adequately protect the class's interests. The CalPERS Group's members are legally sophisticated entities, their chosen counsel are well-qualified, and the Retainer Agreement that they negotiated was not plainly unreasonable. Moreover, although it is a group, there is no indication that the CalPERS Group was artificially created by its lawyers, and the fact that it contains three members offers no obvious reason to doubt that its members could operate effectively as a single unit. We therefore find no abuse of discretion in the District Court's determination that the CalPERS Group was the presumptive lead plaintiff.\n\nWe also conclude that the District Court was correct in holding that the CalPERS Group's presumptive lead plaintiff status had not been rebutted. Appellant Aboff and Douglas Wilson (who is not before us on appeal) offered three reasons why the statutory presumption in favor of the CalPERS Group had been rebutted. First, Aboff and Wilson represented that \"they had negotiated a reduced fee schedule with their attorneys.\" Id. at 148. As we stressed above, the question at this stage is not whether Aboff and Wilson would have done a better job of securing high-quality, low-cost counsel than the CalPERS Group; the question is whether the former have put forward\"proof \" that the latter would \"not fairly and adequately represent the class.\" Had Aboff and Wilson shown that: (1) their fee agreement was substantially lower than that negotiated by the CalPERS Group; (2) their chosen counsel were as qualified or more qualified than those chosen by the presumptive lead plaintiff; and (3) the CalPERS Group had no adequate explanation for why it made the choice that it did, then the presumption may have been rebutted. But this would only happen if the facts suggested that the CalPERS Group had performed inadequately in an objective sense. But Aboff and Wilson did not make this showing simply by alleging that they negotiated a lower fee; hence we hold that the District Court did not abuse its discretion in rejecting this argument.\n\nAboff and Wilson's second contention was that the presumption had been rebutted because \"considerations other than the interests of the class might have influenced the CalPERS group when it retained its attorneys.\" Id. at 148. Specifically, they alleged that \"counsel for the CalPERS group had made substantial contributions to the campaign of the New York State Comptroller, who, as sole trustee of the [NYS]CRF [a member of the CalPERS Group], has substantial influence over the decisions of the fund,\" and they argued that this \"created an appearance of impropriety because the contributions may have played a role in the selection of the group's counsel--a practice known as `pay-to-play.' \" Id. at 148-49. We likewise find no abuse of discretion in the District Court's decision to reject this argument.\n\nLest we be misunderstood, we observe that actual proof of pay-to-play would constitute strong (and, quite probably, dispositive) evidence that the presumption had been rebutted. A movant that was willing to base its choice of class counsel on political contributions instead of professional considerations would, it seems to us, have quite clearly demonstrated that it would \"not fairly and adequately protect the interests of the class.\" Thus, had Aboff and Wilson backed up their claims, the District Court would have likely been justified in holding that the presumption had been rebutted and disqualifying the CalPERS Group from serving as lead plaintiff.\n\nThe problem for Aboff and Wilson is that the District Court expressly found that they had not provided evidence in support of their pay-to-play allegations, see id. at 149, and we have no basis upon which to disagree. When pressed by the District Court, Aboff and Wilson admitted that they had no evidence that the contributions, themselves legal, had influenced the CalPERS Group's selection process.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e Allegations of impropriety are not proof of wrongdoing. If they were, then any class member (or lawyer seeking to be appointed lead counsel) could disable any presumptive lead plaintiff by making unsupported allegations of impropriety. We therefore hold that the District Court did not abuse its discretion in rejecting Aboff and Wilson's pay-to-play arguments.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nAboff and Wilson's last submission was that the court \"should select lead plaintiff through a process of competitive bidding.\" Id. at 149. The District Court refused, noting that \"the PSLRA permits no such thing.\" Id. We agree. See supra Part IV.B.1 (discussing the procedures that the Reform Act establishes for selecting a lead plaintiff). We therefore hold that the District Court was correct to appoint the CalPERS Group as lead plaintiff.\n\nC. The Auction\n\nWe turn now to NYCPF 's objection to the District Court's decision to employ an auction to select lead counsel. We first address Lead Counsel's argument that NYCPF is not entitled to object to the auction. Concluding that it is, we then consider whether the PSLRA ever permits a district court to select lead counsel via competitive bidding. Finding that it does (though only under very specific circumstances), we analyze whether the District Court's decision to hold an auction here was justified.\n\n1. May NYCPF Validly Object to the Auction?\n\nThe only party that objects to the District Court's decision to select lead counsel via an auction is NYCPF; the other two members of the CalPERS Group, CalPERS and NYSCRF, have not appeared before us to argue this issue. Lead Counsel offers a litany of related reasons why NYCPF may not validly press its arguments before us, but, at bottom, its submissions reduce to two claims: (1) NYCPF lacks standing; and (2) NYCPF has waived the right to object to the auction.\n\nLead Counsel's first contention appears to be that NYCPF lacks standing to object to the auction in its capacity as a member of the CalPERS Group. Lead Counsel notes that in the Retainer Agreement executed between them and lead counsel, the members of the CalPERS Group \"agree[d] to prosecute this litigation together and on an equal basis.\" Lead Counsel submits that the Retainer Agreement is governed by New Jersey law and contends that, under that law, the language quoted above establishes the CalPERS Group as a joint venture. See Lead Counsel's Opening Br. at 47. And, asserts Lead Counsel, because New Jersey's default partnership rules provide that decisions of a partnership are made by majority vote, NYCPF cannot object on behalf of the CalPERS Group without the approval of at least one of its partners.\n\nWe disagree. We do not decide whether Lead Counsel is correct about the legal effect of the Retainer Agreement, though we note that NYCPF vigorously contests Lead Counsel's submissions. See NYCPF 's Reply Br. at 14. Instead, we conclude that NYCPF has standing to challenge the District Court's decision to hold an auction in its capacity as a class member. The Reform Act's lead plaintiff provisions are intended to benefit the plaintiff class. It follows that a district court's deviation from the PSLRA model has the potential to harm every member of the class. We therefore hold that, regardless of whether it may object as a member of the CalPERS Group (a question that we do not decide), NYCPF has standing to object in its capacity as a class member.\n\nLead Counsel's second contention is that NYCPF has waived any right to object to the auction. There is no question that NYCPF raised these arguments before the District Court, see In re Cendant Corp. Sec. Litig., 109 F. Supp. 2d 285, 303-04 (D.N.J. 2000)--the dispute is whether it did so too late. The District Court announced that it would conduct an auction on August 4, 1998, but NYCPF did not object at that time. On August 17, 1998, the CalPERS Group sent a letter to the court about the upcoming auction, and although the letter stated that the CalPERS Group had the right to \"select\" lead counsel, it never expressly contested the District Court's decision to hold an auction. The District Court held a hearing on August 19, 1998 for the purpose of soliciting input as to how the auction should be conducted, but, although a representative for NYCPF attended that hearing, it did not object to the auction at that time either. In fact, there does not appear to be any evidence that NYCPF objected to the District Court's decision to hold an auction until after the Settlement had been reached and it was clear that the court-ordered grid would produce a higher fee award than the Retainer Agreement. See id. at 304. \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e Based on this delay, Lead Counsel suggests that we deem NYCPF 's objections to have been waived.\n\nThis argument has a certain appeal, but we conclude that it is foreclosed by In re Cendant Corp. PRIDES Litigation, 243 F.3d 722 (3d Cir. 2001), in which we held that certain class members had standing to object to an attorneys fees award. At least in theory, the PRIDES settlement fund was large enough to provide a 100% recovery to all class members, and the attorneys fees award was not to come out of that fund. Moreover, the settlement was structured so that any unclaimed portions of the settlement or reduction in fees would revert to Cendant, rather than be distributed to the class members. As a result, lead counsel argued that the objecting class members lacked standing to object to the fee award because they could not show that they were \"aggrieved\" by it. Despite the force of this argument, we held that the objectors possessed standing. See id. at 728.\n\nOur reasoning in Cendant PRIDES was twofold. First, we observed that the agency problems inherent in the class action fee awards context counseled in favor of construing standing extremely broadly. See id. at 728-29. And even in cases like Cendant PRIDES where the fee award did not directly reduce the class's recovery, we suggested that lead counsel who seek an \"excessive\" fee may have breached their fiduciary duties to the class, thus entitling the class to recover any excess from its lawyers. See id. at 729.\n\nSecond, we emphasized the critical importance of searching judicial review of fee awards in class actions, because of the inherent conflict of interest between lead counsel and the class and because judges have an independent obligation to avoid \"potential public misunderstandings\" over the size of fee awards. Id. (internal quotation marks and citation omitted). And in so stating, we stressed that \"[o]ur interest and supervisory role is pervasive and extends not only to the final fee award but also to the manner by which class counsel is selected and the manner by which attorneys fee conditions are established.\" Id. at 731 (emphasis added). \"Because of the possible injury to [the objector] and other class members from the fee award . . . , and, more importantly, because of our overarching interest in class action fee awards,\" we held that the objector had standing to appeal the fee award. Id. at 732.\n\nCendant PRIDES strongly counsels against declining to hear NYCPF 's objections to the auction. In that case we were willing to employ a quite broad conception of standing --a fundamental and non-waivable prerequisite for a federal court even to have jurisdiction, see, e.g., Lujan v. Defenders of Wildlife, 504 U.S. 555, 560 (1992)--to ensure that we would be able to consider the propriety of a class action fee award in view of the public interest and perception issues. Here, in contrast, Lead Counsel does not submit that NYCPF has failed to allege a constitutionally sufficient \"injury in fact\"; instead, it contends that we should employ the equitable doctrine of waiver to decline to consider its claim. It would be incongruous indeed if the vital importance of searching judicial review of class action fee awards were sufficient to warrant an expansive conception of standing, but insufficient for a court to decline to invoke its equitable power not to consider certain claims. For that reason, we reject Lead Counsel's argument that we should not consider NYCPF 's objections to the auction, and turn to the question whether the District Court's decision to hold an auction was consistent with the PSLRA.\n\n2. Does the Reform Act Ever Permit an Auction?\n\nThe statutory section most directly on point provides that \"[t]he most adequate plaintiff shall, subject to the approval of the court, select and retain counsel to represent the class.\" 15 U.S.C. S 78u-4(a)(3)(B)(v). This language makes two things clear. First, the lead plaintiff 's right to select and retain counsel is not absolute--the court retains the power and the duty to supervise counsel selection and counsel retention. But second, and just as importantly, the power to \"select and retain\" lead counsel belongs, at least in the first instance, to the lead plaintiff, and the court's role is confined to deciding whether to \"approv[e]\" that choice. Because a court-ordered auction involves the court rather than the lead plaintiff choosing lead counsel and determining the financial terms of its retention, this latter determination strongly implies that an auction is not generally permissible in a Reform Act case, at least as a matter of first resort.\n\nThis conclusion gains support when we examine the overall structure of the PSLRA's lead plaintiff section. The Reform Act contains detailed procedures for choosing the lead plaintiff, see supra Part IV.B.1, indicating that Congress attached great importance to ensuring that the right person or group is selected. The only powers expressly given to the lead plaintiff, however, are to \"select and retain\" counsel. If those powers are seriously limited, it would seem odd for Congress to have established such a specific means for choosing the lead plaintiff. But if the powers to \"select and retain\" lead counsel carry a great deal of discretion and responsibility, it makes perfect sense that Congress attached great significance to the identity of the person or group that would be making those choices.\n\nAdding support to our view that auctions are not generally permitted is the fact that the Reform Act's lead plaintiff provisions were clearly modeled after the Weiss and Beckerman proposal. The statutory language is almost identical to that suggested in Weiss and Beckerman's article, compare 15 U.S.C. S 78u-4(a)(3), with Weiss \u0026 Beckerman, 104 Yale L.J. at 2105-09, and this view is confirmed by the Senate Report, see S. Rep. No. 104-98, at 11 n.32 (1995), reprinted in 1995 U.S.C.C.A.N. 679, 690 n.32. The entire thrust of Weiss and Beckerman's argument was that large investors would do a better job at counsel selection, retention, and monitoring than judges have traditionally done, and their proposal sought to encourage such investors to serve as lead plaintiff for that purpose. This goal would be significantly undermined were we to interpret the Reform Act as permitting courts to take decisions involving counsel selection and retention away from the lead plaintiff by ordering an auction.\n\nLastly, our belief that the PSLRA does not allow an auction in the ordinary case is well supported in the Reform Act's legislative history. Both the Conference Committee Report and the Senate Report state that the purpose of the legislation was to encourage institutional investors to serve as lead plaintiff, predicting that their involvement would significantly benefit absent class members. See H.R. Conf. Rep. No. 104-369, at 34 (1995), reprinted in 1995 U.S.C.C.A.N. 730, 733; S. Rep. No. 104-98, at 11 (1995), reprinted in 1995 U.S.C.C.A.N. 679, 690. Both Reports begin by acknowledging that lead counsel have historically chosen the lead plaintiff rather than vice versa, and by outlining the significant problems created by that phenomenon. See H.R. Conf. Rep. No. 104-369, at 32-33 (1995), reprinted in 1995 U.S.C.C.A.N. 730, 731-32; S. Rep. No. 104-98, at 11 (1995), reprinted in 1995 U.S.C.C.A.N. 679, 690. Later, both Reports contain a brief discussion of the lead plaintiff 's power to choose lead counsel:\n\n[The] lead plaintiff provision solves the dilemma of who will serve as class counsel. Subject to court approval, the most adequate plaintiff retains class counsel. As a result, the Conference Committee expects that the plaintiff will choose counsel rather than, as is true today, counsel choosing the plaintiff. The Conference Committee does not intend to disturb the court's discretion under existing law to approve or disapprove lead plaintiff 's choice of counsel when necessary to protect the interests of the plaintiff class. H.R. Conf. Rep. No. 104-369, at 35 (1995), reprinted in 1995 U.S.C.C.A.N. 730, 734; S. Rep. No. 104-98, at 11-12 (1995), reprinted in 1995 U.S.C.C.A.N. 679, 690.\n\nThe second sentence of the above-quoted language emphasizes that the choice belongs to the lead plaintiff, and the third is significant for two reasons. First, it confirms that the court's role is generally limited to \"approv[ing] or disapprov[ing] lead plaintiff 's choice of counsel;\" and that it is not the court's responsibility to make that choice itself. Second, it indicates that the court should generally employ a deferential standard in reviewing the lead plaintiff 's choices. It is not enough that the lead plaintiff selected counsel or negotiated a retainer agreement that is different than what the court would have done; the question is whether judicial intervention is \"necessary to protect the interests of the plaintiff class.\"\n\nWe respect the arguments advanced by Judge Shadur--a jurist of extraordinary distinction, who, as we noted supra n.44, is one of the primary judicial advocates in favor of the auction method--as to why auctions are not inconsistent with the Reform Act, but we ultimately find them unpersuasive. Judge Shadur notes that the PSLRA provides that a movant's status as presumptive lead plaintiff may be overcome if it can be shown that the movant will not fairly and adequately represent the class, and observes that the statute makes the lead plaintiff 's right to select and retain counsel \"subject to the approval of the court.\" See In re Bank One S'holders Class Actions, 96 F. Supp. 2d 780, 784 (N.D. Ill. 2000) (quoting 15 U.S.C. S 78u-4(a)(3)(B)(iii)(II)(aa) \u0026 (B)(v)); see also In re Comdisco Sec. Litig. , 141 F. Supp. 2d 951, 953 (N.D. Ill. 2000) (quoting this discussion from Bank One). Based on these two provisions, Judge Shadur writes:\n\nSuppose for instance a plaintiff in such a presumptive status has agreed that its own lawyers, if acting as class counsel, are to receive one-third of any class recovery. Suppose further that another highly reputable law firm that has appeared of record for another putative plaintiff or plaintiffs, having demonstrated excellent credentials in earlier securities class action litigation and being clearly capable of handling the complexities of the current lawsuit, is willing to handle the case for half of that percentage fee --or to provide even a greater contrast, is willing to work for that lesser percentage and also to impose a cap on the firm's total fee payment. In that circumstance the presumptive lead plaintiff could certainly bind itself contractually to pay one-third of its share of the class recovery to its own lawyer, but any court would be remiss if it were to foist that one-third contingency arrangement on all of the other class members who had not themselves chosen that law firm to be their advocate. . . .\n\nIn this Court's view, if the presumptive lead plaintiffs were to insist on their class counsel handling the action on the hypothesized materially less favorable contractual basis, that insistence would effectively rebut the presumption that the putative class representatives, despite the amounts that they have at stake personally, were indeed the \"most adequate plaintiffs\"--that is, the class members \"most capable of adequately representing the interests of class members\" (Subsection (a)(3)(B)(i)). If on the other hand the presumptive class representative were willing to be represented by the most favorable qualified bidder among the lawyers submitting bids, with that bidder either supplanting the presumptive lead plaintiff 's original choice of counsel or working together with that original counsel (but with the total lawyers' fees to be circumscribed by the low bidder's proposal), the presumption would clearly remain unrebutted and the presumptive most adequate plaintiffs would properly be appointed as lead plaintiffs. Bank One, 96 F. Supp. 2d at 784.\n\nAs should be clear from our discussion of the proper means of appointing a lead plaintiff, see supra Part IV.B.1, we concur with the first portion of Judge Shadur's analysis. In a situation like the one he describes, we think it quite clear that the presumptive lead plaintiff 's actions (especially if it could offer no persuasive reason for preferring the first, more expensive firm, to the second, equally-qualified but less expensive one) would demonstrate that it would not fairly and adequately represent the interests of the class. This, of course, would require the court to disqualify that movant from serving as the lead plaintiff and to locate another movant that could serve in that capacity. It would not, in our view, require the court to appoint the movant whose lawyer had offered to work for half as much as the lawyers for the first movant.\n\nAs the foregoing makes clear, we part company with Judge Shadur insofar as he argues that his hypothetical shows that the Reform Act necessarily permits an auction. Judge Shadur's view appears to be that any movant who is unwilling to be represented by the firm or firms that a court determines to be the lowest qualified bidder in a court-conducted auction has necessarily shown that it will not fairly and adequately represent the interests of the class. We disagree for two reasons. First, this approach is in considerable tension with the text of the PSLRA. As we explained above, the Reform Act makes clear that it is the lead plaintiff 's job to \"select and retain\" lead counsel and it is the court's duty to decide whether to \"approve\" that choice. But under Judge Shadur's approach, a presumptive lead plaintiff 's only option is to assent to the counsel and the fee terms that were chosen by the court via a court-ordered auction (because otherwise the movant will be disqualified from serving as lead plaintiff on the grounds that it will not fairly and adequately represent the interests of the class). Judge Shadur's reading of the statute in effect confers upon the court the right to \"select and retain\" counsel and limits the lead plaintiff to deciding whether to acquiesce in those choices, thus eliminating any discretion on the part of the lead plaintiff. We simply do not think that such a result is consistent with the statutory text.\n\nMoreover, we do not agree that the fact that a presumptive lead plaintiff refuses to accede to the counsel or fee terms set via an auction demonstrates that it will not fairly and adequately represent the interests of the absent class members. As we explained earlier, the Reform Act's lead plaintiff provisions (which include the section that confers on the lead plaintiff the rights to select and retain lead counsel) were based on Weiss and Beckerman's article. A central thrust of Weiss and Beckerman's argument was that institutional investors would likely do a better job than courts at selecting, retaining, and monitoring counsel than courts have traditionally done. See 104 Yale L.J. at 2105-07. Whether we (or Judge Shadur) would agree with this proposition is irrelevant; what is clear is that Congress did. And if institutional investors are as good or better than courts at balancing quality and cost in selecting class counsel, then it follows that the fact that those investors may choose different lawyers and negotiate different fee arrangements than the court does not demonstrate that those investors will not fairly and adequately represent the interests of the class. We therefore respectfully disagree with Judge Shadur that the use of court-ordered auctions can be squared with the PSLRA in the ordinary case.\n\nInstead, we think that the Reform Act evidences a strong presumption in favor of approving a properly-selected lead plaintiff 's decisions as to counsel selection and counsel retention. When a properly-appointed lead plaintiff asks the court to approve its choice of lead counsel and of a retainer agreement, the question is not whether the court believes that the lead plaintiff could have made a better choice or gotten a better deal. Such a standard would eviscerate the Reform Act's underlying assumption that, at least in the typical case, a properly-selected lead plaintiff is likely to do as good or better job than the court at these tasks. Because of this, we think that the court's inquiry is appropriately limited to whether the lead plaintiff 's selection and agreement with counsel are reasonable on their own terms.\n\nIn making this determination, courts should consider: (1) the quantum of legal experience and sophistication possessed by the lead plaintiff; (2) the manner in which the lead plaintiff chose what law firms to consider; (3) the process by which the lead plaintiff selected its final choice; (4) the qualifications and experience of counsel selected by the lead plaintiff; and (5) the evidence that the retainer agreement negotiated by the lead plaintiff was (or was not) the product of serious negotiations between the lead plaintiff and the prospective lead counsel. See, e.g., In re Nice Sys. Sec. Litig., 188 F.R.D. 206, 223 (D.N.J. 1999) (\"Not only should the proposed counsel fees be the result of hard-bargaining, but the initial selection of counsel should be the result of independent decision-making by the lead plaintiff.\").\n\nWe do not mean for this list to be exhaustive, or to intimate that district courts are required to give each of these factors equal weight in a particular case; at bottom, the ultimate inquiry is always whether the lead plaintiff 's choices were the result of a good faith selection and negotiation process and were arrived at via meaningful arms-length bargaining. Whenever it is shown that they were not, it is the court's obligation to disapprove the lead plaintiff 's choices. See, e.g., Sherleigh Assocs. LLC v. Widmere-Durable Holdings, Inc., 184 F.R.D. 688, 692-93 \u0026 n.1 (S.D. Fla. 1999) (rejecting a lead plaintiff 's choice of a \"consortium of ten law firms\" on the grounds that it was \"not in the best interests of the class members\").\n\nAlthough we think, for reasons explained above, that an auction is impermissible in most Reform Act cases, we do not rule out the possibility that it could be validly used. If the court determines that the lead plaintiff 's initial choice of counsel or negotiation of a retainer agreement is inadequate, it should clearly state why (for both the benefit of the lead plaintiff and for the record) and should direct the lead plaintiff to undertake an acceptable selection process. If the lead plaintiff 's response demonstrates that it is unwilling or unable to do so, then the court will, of necessity, be required to take a more active role.\n\nAt that point, a court will have several options. If a litigant were to have repeatedly undertaken a flawed process of selecting and retaining lead counsel, that may be enough to show that it will not fairly and adequately protect the interests of the class. In such a situation, the court would be justified in disqualifying that litigant from serving as lead plaintiff, selecting a new lead plaintiff, and directing that newly-appointed lead plaintiff to undertake an acceptable search.\n\nOn the other hand, it is possible that the court could conclude that, perhaps due to the nature of the case at hand, none of the possible lead plaintiffs is capable of fulfilling the model contemplated by the Reform Act, i.e., a sophisticated investor who has suffered sizeable losses and can be counted on to serve the interests of the class in an aggressive manner. In such a situation, it would be permissible for a court to conclude that its obligation to protect the interests of the plaintiff class makes it necessary for the court to assume direct control over counsel selection and counsel retention, and, were the court to so conclude, an auction would be one permissible means by which the court could select and retain counsel on behalf of the class.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e We stress, however, that it is not sufficient justification for an auction in a case governed by the Reform Act that the court prefers a process of counsel selection or counsel retention that it, rather than the lead plaintiff, controls, nor is it enough that the court thinks that an auction is an inherently superior mechanism for determining a reasonable fee.\n\n3. Was the Auction in this Case Permissible?\n\nWe now analyze whether, under these precepts, the District Court's decision to conduct an auction was justified. We begin by rejecting the contention that the court's willingness to permit counsel chosen by Lead Plaintiff to match what the District Court determined to be the lowest qualified bid fully protected the CalPERS Group's right to \"select and retain\" lead counsel. First, because the court's order gave the matching power to the Group's choice of counsel rather than to the Group itself, this approach did not, in fact, preserve the Group's ability to \"select\" lead counsel. Moreover, because the court's order meant that Lead Plaintiff 's choice would be honored only if it was made pursuant to fee terms set by the District Court, the court's approach also undermined the CalPERS Group's ability to \"retain\" counsel.\n\nIn its written opinion, the District Court gave several reasons for holding an auction. First, it noted that the PSLRA makes Lead Plaintiff 's decision \"subject to the approval of the court.\" The court stressed that\"given the opportunity, absent class members would try to secure the most qualified representation at the lowest cost,\" and then observed that, at the end of the case, it would be required to ensure that the \"[t]otal attorneys's fees and expenses\" that it awarded to lead counsel did \"not exceed a reasonable percentage of the amount of any damages and prejudgment interest actually paid to the class.\" In re Cendant Corp. Litig., 182 F.R.D. 144, 150 (D.N.J. 1998). The court concluded that holding an auction would aid it in making this determination and in protecting the class's interests because it would simulate the market, thus providing a \"benchmark of reasonableness.\" Id. at 150-52. Second, the District Court stated that holding an auction would have the \"salutary\" effect of \"remov[ing] any speculative doubt\" about Aboff and Wilson's pay-to-play allegations. Id. at 152.\n\nThese reasons are not sufficient justification for holding an auction. The first (i.e., a generalized desire to hold down costs by \"simulating\" the market) would apply in every case, and thus cannot be enough to justify a procedure that we have concluded may only be used rarely. Further, there is no need to \"simulate\" the market in cases where a properly-selected lead plaintiff conducts a good-faith counsel selection process because in such cases--at least under the theory supporting the PSLRA--the fee agreed to by the lead plaintiff is the market fee.\n\nNor do we think that the laudable desire to dispel mere allegations of impropriety as to one member of the CalPERS Group is enough to justify holding an auction. Were it sufficient, then any disgruntled class member (or lawyer seeking to be appointed lead counsel) could disable the lead plaintiff from exercising its statutorily-conferred power by making unsupported allegations of impropriety.\n\nIt could also be argued that two of the District Court's statements during the August 4 and August 19, 1998, hearings support its decision to hold an auction. To begin with, we doubt that any of these musings could properly be seen as \"findings\" sufficient to justify the court's actions. But even if they could, we find these proffered reasons simply inadequate. During the August 4 hearing, the District Court suggested that institutional investors may not do a good job of selecting lead counsel because\"at times familiarity or a long time association between a client and a lawyer . . . may limit arms length bargaining.\" These \"concerns\" cannot justify the court's decision to hold an auction because there was simply no evidence of \"familiarity or a long time association\" between any member of the CalPERS Group and either of the firms that the Group proposed retaining, nor was there any evidence of or finding by the District Court that arms-length bargaining had not, in fact, taken place.\n\nWe are similarly unable to conclude that the auction was justified based on the District Court's statement during the August 19 hearing that \"one can make the argument. . . that because of [their] economic power that at times [large investors] get a little complacent economically and therefore . . . they are not as cost effective as they should be.\" First, as a generic supposition, this intuition is directly at odds with the principles that animated the Reform Act. Second, the court never made findings that the CalPERS Group had been \"complacent economically\" or had demonstrated that it would not be \"as cost effective as [it] should be.\"\n\nAt oral argument before this Court, Lead Counsel offered two additional arguments in favor of the District Court's decision to conduct an auction. Lead Counsel's first contention was that at the time of its decision to hold an auction on August 4, the court knew nothing about the process by which the CalPERS Group had selected and retained its choice of counsel. As a consequence, Lead Counsel submits that the District Court could not be confident at that time that Lead Plaintiff had conducted a thorough and good faith counsel search, and argues that this uncertainty (combined with Aboff 's and Wilson's pay-to-play allegations) justified the court's decision to hold an auction. Lead Counsel's second argument was that the entire litigation landscape had changed between the time Lead Plaintiff and Lead Counsel entered into the Retainer Agreement and the time of the August 4 hearing. This is because on July 14, 1998, shortly after the Retainer Agreement became effective on June 23, Cendant announced that it would be restating three years of CUC's financial statements instead of just one. Lead Counsel submits that Cendant's July 14 announcement fundamentally altered the dynamics of this case, and contends that this development justified the Court's August 4 decision to hold an auction.\n\nWe find these arguments unpersuasive. First, we note that the District Court never gave them as reasons for holding an auction. Second, though Lead Plaintiff does not appear to have submitted much information about the thoroughness and integrity of the process by which it selected and retained counsel prior to the District Court's decision to conduct an auction (although Lead Counsel did describe it to the court as \"the best fee ever negotiated in advance\" and \"the hardest bargain ever driven in a securities class action case,\" 109 F. Supp. 2d at 291-93), it is also true that the District Court did not order Lead Plaintiff to provide such information or give any indication that it was concerned about the process by which Lead Plaintiff selected counsel and negotiated the Retainer Agreement. Although we have no doubt that a court may (and should) require that a lead plaintiff provide information about the process it used to select and retain counsel before deciding whether to \"approv[e]\" that choice, see 15 U.S.C. S 78u-4(a)(3)(B)(v), Lead Plaintiff cannot be faulted for not producing the information that the statute does not expressly require and that the court did not seek. Cf. Laborers Local 1298 Pension Fund v. Campbell Soup Co., No. CIV.A. 00-152 (JEI), 2000 WL 486956, at *4 (D.N.J. Apr. 24, 2000) (giving the lead plaintiff advance notice of the questions the court will want answered before deciding whether to approve its choice of lead counsel); Proceedings of the 2001 Third Circuit Task Force on the Selection of Class Counsel, Statement of Vaughn R. Walker, at 22 (Appendix A), available at http://www.ca3.uscourts.gov/ classcounsel/Witness%20Statements/vwalker.pdf (providing questionnaire that Judge Walker has distributed to lead plaintiff candidates regarding their method of selecting and retaining their chosen counsel).\n\nThird, although a fundamental and unexpected change in the litigation landscape would probably be the sort of thing that would justify a district court's decision to decline to approve a proposed retainer agreement (or to order that a previously approved retainer agreement be renegotiated), the proper remedy would be to instruct the lead plaintiff to renegotiate an adequate agreement rather than to order an auction immediately.\n\nFor the foregoing reasons, we hold that the District Court abused its discretion by conducting an auction because its decision to do so was founded upon an erroneous understanding of the legal standards undergirding the propriety of conducting an auction under the PSLRA. With regard to counsel selection, however, this error was harmless because the counsel selected via the auction process were the same as those whom the Lead Plaintiff sought to have appointed in the first place.\n\nD. Counsel Fees\n\nHaving determined that the District Court should not have held an auction, we face the question of what happens next. The fact that BRB and BLBG were appointed Lead Counsel after exercising their option to meet what the court determined to be the lowest reasonable auction bid makes our task considerably easier than it would have been had the District Court appointed different firms to serve as lead counsel. Cognizant of the unusual situation in which we find ourselves, we conclude that the District Court was correct to appoint BRB and BLBG as Lead Counsel, but hold that it should have done so pursuant to the Retainer Agreement negotiated between them and Lead Plaintiff. In appointing BRB and BLBG Lead Counsel (albeit for reasons that we have found to be erroneous) the District Court obviously determined that the firms were qualified to serve as counsel for the class. To our knowledge, no one has questioned that conclusion, and it is difficult to see how anyone could do so.\n\nThe matter of the Retainer Agreement is somewhat more complicated, but we think it should be deemed to be in force. That the District Court would have approved all of its provisions except for its fee provisions is evidenced by the fact that the court required that all bidders consent to those provisions as a condition precedent to participating in the auction. And the fact that the court would have found the Retainer Agreement's fee provisions to be reasonable had it employed the correct legal standard is attested to by the fact that the court deemed the bid that BRB and BLBG submitted in connection with the auction to have been \"realistic in the context of likely results.\" Although this bid was not the same as the fee provisions contained in the Retainer Agreement, see In re Cendant Corp. Sec. Litig., 109 F. Supp. 2d 285, 291 n.3 (D.N.J. 2000), Lead Counsel has represented to us that it contained only \"minor modifications,\" which were made \"because the litigation `milestones' of the court's fee grid did not precisely match the `milestones' of the agreement.\" Lead Counsel's Br. at 17 n.7.\n\nBesides Aboff 's and Wilson's pay-to-play allegations (which the District Court rejected based on insufficient proof--a finding with which we have no quarrel), no party has come forward with supportable allegations that Lead Plaintiff did not select and retain BRB and BLBG through a sufficiently sophisticated and sincere search. We therefore hold that the District Court should have appointed BRB and BLBG Lead Counsel pursuant to the Retainer Agreement, and we also conclude that that Agreement is currently in force.\n\nIn light of this conclusion, we think that the District Court erred in considering and ruling upon Lead Counsel's fee application. The Retainer Agreement states that Lead Counsel \"will not submit any fee application to the Court without the prior approval of The Funds,\" but there is insufficient evidence that either CalPERS or NYSCRF gave their \"prior approval.\"\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e Lead Counsel originally relied on the fact that neither CalPERS nor NYSCRF objected to its fee request, but acquiescence (which is the most that a failure to object shows) is not the same thing as\"prior approval.\"\n\nLead Counsel also points to an off-the-record conference conducted by the District Court on May 22, 2001, which was apparently attended by representatives for Lead Counsel, NYCPF, and NYSCRF. NYSCRF was represented by its General Counsel, Randall Treece, and Lead Plaintiff asserts that Treece had been given CalPERS's proxy by its General Counsel, Kayla Gillan. Lead Counsel maintains that at the May 22 conference, the court \"made clear that . . . the result of the auction process had superseded the fee provisions of the retainer agreement, and that class counsel had a right to rely on the fee grid set by the court and was entitled to seek a fee in that amount.\" At this point, according to Lead Counsel, Treece \"thanked the court for its guidance and stated that [NYS]CRF and CalPERS would accept the court's view.\"\n\nWe need not decide whether this version of events, if true, would demonstrate that NYSCRF and CalPERS gave their \"prior approval\" to Lead Counsel's fee request. The facts remain that NYCPF disputes Lead Counsel's account; neither Treece nor anyone else from NYSCRF or CalPERS has confirmed it or stated that Lead Counsel has accurately stated their views; and the fact that this conference was held off the record makes it impossible for us to assess what really happened.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e Because Lead Counsel has submitted insufficient evidence that its fee request was submitted with \"the prior approval of The Funds\" and because the fee request was submitted pursuant to the fee grid arrived at via the auction rather than that contained in the Retainer Agreement, we hold that the request was improper under the Retainer Agreement and that the District Court should not have considered it. We will therefore set aside the District Court's fee award and remand this case with instructions to dismiss the fee application and to decline to accept any further applications that are submitted without the prior approval of the Funds.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nOur conclusion that the current fee request is improper under the Retainer Agreement makes it unnecessary for us to engage in a substantive review of the fee award approved by the District Court. But this is the seventh appeal in the Cendant proceedings, see supra n.11, and, with others still in progress, we think it necessary to say a few words about the standards that should guide the District Court's discretion in considering fee requests under the PSLRA that will be the principal focus on remand so as to help bring this now protracted matter to a close.\n\nThe Reform Act confers on the lead plaintiff the power to \"retain\" lead counsel, 15 U.S.C. S 78u-4(a)(3)(B)(v), but it also requires that the court ensure that the \"[t]otal attorneys' fees and expenses awarded . . . to counsel for the plaintiff class . . . not exceed a reasonable percentage of the amount of any damages and prejudgment interest actually paid to the class.\" Id. S 78u-4(a)(6). This latter provision makes clear that the court has an independent obligation to ensure the reasonableness of any fee request. The issue is the scope of this obligation.\n\nFederal Rule of Civil Procedure 23(e) provides that no class action \"shall . . . be dismissed or compromised without the approval of the court,\" but the detailed standards set forth for reviewing attorneys fees in this Court's earlier cases are not contained in any statute or rule. Rather, they were developed because of recognition that in the class action context there is no way for\"the class\" to select, retain, or monitor its lawyers in the way that an individual client would, and because of doubts that a typical lead plaintiff in the non-PSLRA context is a terribly good agent for the class. In the ordinary case, the court is the only disinterested agent capable of protecting the class from its lawyers and its primary means of doing so is by scrutinizing the lawyers' proposed fee. In such a context, searching judicial review of fee requests is both necessary and appropriate to ensure that the interests of absent class members are not compromised. See supra Part IV.A.1 \u0026 2.\n\nThe Reform Act shifts the underpinnings of our class action attorneys fees jurisprudence in the securities area. As a preliminary matter, the PSLRA sets out a detailed procedure for choosing lead plaintiffs, the whole point of this process being to locate a lead plaintiff that will be an effective agent for the class. The properly-selected lead plaintiff is then charged with selecting and retaining lead counsel (subject to court approval). This regime is far different from the traditional case in which counsel is often \"selected\" and \"retained\" based on the fact that it filed the first suit. Consequently, courts have far more reason at the outset to think that counsel selection and retention were done in the best interests of the class in a typical Reform Act case than they do in other class action contexts, at least when the procedures of counsel selection employed by the lead plaintiff were adequate.\n\nThe same holds true of the monitoring of class counsel. In the typical class action, there is little reason to think that the lead plaintiff has the incentive or ability to monitor lead counsel's performance, but there is good reason to think that a lead plaintiff that has been properly selected under the PSLRA would possess both. In this context, the lead plaintiff is in the best position, under the PSLRA's scheme, to determine (at least initially) what its lead counsel's fee should be. Our jurisprudence must take account of that change.\n\nWe therefore believe that, under the PSLRA, courts should accord a presumption of reasonableness to any fee request submitted pursuant to a retainer agreement that was entered into between a properly-selected lead plaintiff and a properly-selected lead counsel. See Weiss \u0026 Beckerman, 104 Yale L.J. at 2105 (\"[A] court might well feel confident in assuming that a fee arrangement an institutional investor had negotiated with its lawyers before initiating a class action maximized those lawyers' incentives to represent diligently the class's interests, reflected the deal a fully informed client would negotiate, and thus presumptively was reasonable.\"). This presumption will ensure that the lead plaintiff, not the court, functions as the class's primary agent vis-a-vis its lawyers. Further, by rendering ex ante fee agreements more reliable, it will assist those agreements in aligning the interests of the class and its lawyers during the pendency of the litigation.\n\nSaying that there is a presumption necessarily assumes that it can be overcome in some cases, however. First, the presumption of reasonableness would likely be abrogated entirely were the court to find that the assumptions underlying the original retainer agreement had been materially altered by significant and unusual factual and/or legal developments that could not reasonably have been foreseen at the time of the original agreement. If such developments occurred early enough in the litigation, the court might wish to inform the lead plaintiff and lead counsel of its concerns and direct them to renegotiate the fee agreement. If, however, the changes were to come to light late in the day, and if the lead plaintiff and the lead counsel were unable to agree to a revised fee schedule to account for that change, the court could be justified in holding that the presumption of reasonableness had been abrogated and to review the fee request using the traditional standards.\n\nWe stress, however, that not just any factual or legal development would suffice to justify a court's decision that the presumption of reasonableness had been rebutted on grounds of changed circumstances. Uncertainties are part of any ex ante negotiation and it should be presumed that the lead plaintiff and the lead counsel took the possibility of uncertainty into account in negotiating their agreement. Thus, only unusual and unforeseeable changes, i.e., those that could not have been adequately taken into account in the negotiations, could justify a court's decision to find the presumption abrogated.\n\nEven if the presumption of reasonableness is not undermined by changed circumstances, however, courts must still consider whether it has been rebutted. As we have noted above, there is an arguable tension between the presumption of reasonableness accorded the arrangement between the Lead Plaintiff and properly selected counsel and the duty imposed on the Court by the Reform Act, 18 U.S.C. S 78u-4, to insure \"[t]hat total attorneys' fees and expenses awarded by the court to counsel for the plaintiff class shall not exceed a reasonable percentage of the amount of any damages and prejudgment interest actually paid to the class.\" We resolve this tension by holding that the presumption may be rebutted by a prima facie showing that the (properly submitted) retained agreement fee is clearly excessive. In terms of the policy of the Reform Act, we do not believe that candidates for lead plaintiff designation will be deterred by the understanding that their retainer fee arrangement with Lead Counsel will be subject to judicial review for clear excessiveness.\n\nIn making this clear excessiveness inquiry, district courts should be primarily guided by the factors set forth in Gunter v. Ridgewood Energy Corp., 223 F.3d 190, 195 n.1 (3d Cir. 2000), in which we set forth standards for evaluating whether the percentage fee, which essentially had supplanted the lodestar on our class action counsel fee jurisprudence, was excessive. Under Gunter, the Court should examine:\n\n(1) the size of the fund created and the number of persons benefitted; (2) the presence or absence of substantial objections by members of the class to the settlement terms and/or fees requested by counsel; (3) the skill and efficiency of the attorneys involved; (4) the complexity and duration of the litigation; (5) the risk of nonpayment; (6) the amount of time devoted to the case by plaintiffs' counsel; and (7) the awards in similar cases. Gunter v. Ridgewood Energy Corp., 223 F.3d 190, 195 n.1 (3d Cir. 2000).\n\nBut, as our cases have recognized, factors (1), (3), and (7) \"should receive less weight\" in mega-fund cases such as this one. See, e.g., In re Prudential Ins. Co. of Am. Sales Practices Litig., 148 F.3d 283, 339 (3d Cir. 1998).\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\n\nGunter review will, however, need to be modified to take into account some of the changed circumstances brought about by the PSLRA. First, the aim in this context is not to assess whether the fee request is reasonable; instead, the goal is to determine whether the presumption of reasonableness has been rebutted. As a consequence, the discussions of these factors that have appeared in our prior cases will not necessarily apply in cases governed by the Reform Act. Second, courts should employ a deferential standard of review in assessing factor (3) (\"the skill and efficiency of the attorneys\") because the PSLRA assumes that properly-selected lead plaintiffs are at least as able to answer those questions as courts. Lastly, factor (7) (\"the awards in similar cases\") may be of limited use, at least in the first generation of Reform Act cases. As we have explained, the PSLRA shifts the entire backdrop against which our fee jurisprudence has developed, and, as a consequence, non-PSLRA cases may not be sufficiently \"similar\" to provide a meaningful basis for comparison.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\n\nGunter acknowledges a possible role for the lodestar in this calculus, by noting the possible utility of a lodestar cross-check. See 223 F.3d at 200. We note in this regard that the Reform Act does not rule out the use of the lodestar. The Conference Committee Report states:\n\nThe Conference Committee limits the award of attorney's fees and costs to counsel for a class in new section 27(a)(6) of the 1933 Act and new section 21D(a)(6) of the 1934 Act to a reasonable percentage of the amount of recovery awarded to the class. By not fixing the percentage of fees and costs counsel may receive, the Conference Committee intends to give the court flexibility in determining what is reasonable on a case-by-case basis. The Conference Committee does not intend to prohibit use of the lodestar approach as a means of calculating attorney's fees. The provision focuses on the final amount of fees awarded, not the means by which such fees are calculated. H.R. Conf. Rep. 104-369, *36.\n\nSeveral of our cases have \"recommended\" that district courts compare the results at which they arrive via the percentage-of-recovery method with an abbreviated calculation of the lodestar amount. See, e.g., GM Trucks, 55 F.3d at 822; Prudential, 148 F.3d at 333; Gunter, 223 F.3d at 199; Cendant PRIDES, 243 F.3d at 742. \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e The goal of this practice is to ensure that the proposed fee award does not result in counsel being paid a rate vastly in excess of what any lawyer could reasonably charge per hour, thus avoiding a \"windfall\" to lead counsel. The lodestar cross-check, however, is very time consuming. Thus, while the Court should in the first instance test the presumption, if challenged, by the Gunter factors, it may, if necessary, utilize the lodestar cross-check.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\n\nAlthough the foregoing discussion suggests that, in view of a presumption, whatever fee is re-submitted by Lead Counsel pursuant to the Retainer Agreement on remand has a \"leg up\" for approval, we cannot blind ourselves to the reality that both the fee award of $262 million under the auction and (potentially up to) $187 million under the Retainer Agreement are staggering in their size, and, on the basis of the evidence in the record, may represent compensation at an astonishing hourly rate (as well as an extraordinarily high lodestar \"multiplier,\" see supra n.57). Objectors contend that the lodestar figure is approximately $8,000,000, which would mean that the multiplier would be 45.75 if lead counsel were to receive the court awarded fee, and approximately 24 if it were to receive the negotiated fee. Lead counsel counter that the $8,000,000 figure was preliminary and that the final figure will be much higher, from 50% to 100%. Even so, the multiplier would still be extremely high.\n\nAt all events, this was a simple case in terms of liability with respect to Cendant, and the case was settled at a very early stage, after little formal discovery. Thus the possibility of rebuttal of the presumption of reasonableness must be seriously considered by the District Court on remand. If the Gunter factors (and possible lodestar cross-check) were to confirm that the fee agreed to by a lead plaintiff and lead counsel was clearly excessive, the court would need to set a reasonable fee according to the standards our previous cases have set down for class actions not governed by the PSLRA. If the District Court does consider the lodestar, it might think of it as a floor and the fee under the retainer agreement as a ceiling. In such event, it should explain on the record its reasons for selecting a fee award at or between these two figures.\n\nV. CONCLUSION\n\nFor the reasons stated above, the District Court's orders approving the Settlement and the Plan of Allocation will be affirmed. We hold that the District Court was correct to appoint the CalPERS Group as lead plaintiff but that it erred in holding an auction to select and retain lead counsel. The latter error was harmless with respect to the identity of Lead Counsel, but not with respect to the determination of its fee. Because we believe that, absent the error, the court would have properly appointed BRB and BLBG as lead counsel pursuant to the Retainer Agreement entered into between the firms and the CalPERS Group, we hold that the Agreement remains in force. Consequently, the fee award will be vacated and the case remanded with instructions to the District Court to dismiss the fee request as improper under the Retainer Agreement and to decline to consider any further fee requests that are not submitted with the \"prior approval of the Funds.\" In considering any such fee requests, the Court will be guided by our discussion herein. Parties to bear their own costs.\n\n\u003cspan class=\"fn\"\u003e1. The Reform Act inserted identical amendments into the Securities Act of 1933 and the Securities Exchange Act of 1934. All citations are to the Exchange Act provisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The court based this conclusion on the fact that all members of the CalPERS Group had sizeable holdings in Merrill Lynch, a defendant with respect to the claims involving PRIDES. See id. at 149. The court eventually appointed a different lead plaintiff and lead counsel in the PRIDES action. See id. at 149-50.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Although the District Court and some of the parties refer to members of the CalPERS Group as \"co-Lead Plaintiffs,\" we agree with the Securities and Exchange Commission that \"[t]here is one lead plaintiff under the Reform Act: an individual, an institution or a properly-constituted group.\" Brief for the Securities and Exchange Commission as Amicus Curiae, at 11 n.8 (emphasis added). The statute always speaks of the lead plaintiff in the singular, requiring that the court appoint \"as lead plaintiff the member or members of the purported plaintiff class that the court determines to be most capable of adequately representing the interests of class members\" and stating that the presumptively \"most adequate plaintiff . . . is the person or group of persons\" that satisfies the statute's three threshold requirements. 15 U.S.C. S 78u-4(a)(3)(B)(i) \u0026 (iii) (emphasis added). The biggest consequence of this distinction is that only one \"entity\" is entitled to speak for the class: the lead plaintiff. In cases where a group serves as lead plaintiff, it is for the group's members to decide how the group will make decisions, but it is the group--not its constituent members--that speaks for the class. A fortiori, we use the singular \"Lead Plaintiff \" throughout this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The Retainer Agreement declares that the members of the CalPERS Group \"have agreed to proceed together to seek a Co-Lead Plaintiff position,\" and states that the funds, if selected as Lead Plaintiff, will \"seek the appointment of BRB and BLBG as Co-Lead Counsel to the Class.\" The Agreement provides that Lead Counsel will \"receive fees, as awarded by the Court, from the proceeds of any judgment or settlement,\" and that Lead Counsel \"will advance all costs and out-of-pocket expenses.\" The Retainer Agreement contains four sections set off by roman numerals. The first deals with attorneys fees, providing: I. Attorneys Fees. The fee will be a function of both the timing and size of the recovery but, unless agreed to by the Funds, will, in no event exceed the following: A. Initiation of action through to commencement of discovery: 1. Recovery of $0 to $400 million - fee of 5%; 2. Additional recoveries above $400 million - fee of 3%. B. Commencement of discovery through to conclusion of all fact and expert discovery: 1. Recovery of $0 to $100 million - fee of 17.5%; 2. Additional recoveries of above $100 million to $300 million - fee of 10%; 3. Additional recoveries of above $300 million to $500 million - fee of 7.5%; 4. Additional recoveries of above $500 million- fee of 5%. C. Proceedings after conclusion of all discovery, including motions for summary judgment, if any, through and including trial and post-trial proceedings: 1. Recovery of $0 to $150 million - fee of 20%; 2. Additional recoveries above $150 million to $400 million - fee of 12.5%; 3. Additional recoveries above $400 million - fee of 7.5% In any event, we [i.e., BRB and BLBG] will not submit any fee application to the Court without the prior approval of The Funds, and all fee applications would, of course, be subject to final approval of the Court. Travel, meals and lodging expenses shall be reasonable and subject to the approval of Co-Lead Plaintiffs prior to reimbursement. Section II is captioned \"Plan for Monitoring Litigation,\" and requires Lead Counsel to: (1) provide the CalPERS Group with \"all significant pleadings\" at least 24 hours before filing; (2) make monthly status reports, including statements as to time expended and expenses incurred; (3) promptly advise the CalPERS Group of\"any significant developments in the case, including settlement discussions\"; and (4) schedule periodic meetings to discuss \"case developments\" and \"joint strategies in the prosecution of the case.\" Section III is captioned \"Theory of Recovery,\" and declares that the goal of the case was \"to maximize the recovery obtained from sources outside the corporation . . . without unduly penalizing Cendant or its long-term shareholders.\" Lead Counsel agreed \"to vigorously represent your collective interests, and the interests of the Class, to maximize the recovery for the Class of Cendant securities purchasers in this case, while being cognizant of the interests of the long-term holders of Cendant securities.\" Section IV is captioned \"Consultation Regarding Settlement Negotiations,\" and it requires Lead Counsel to \"consult with\" and obtain approval from the CalPERS Group before entering into a final settlement agreement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The grid for the main Cendant action required that counsel submit a fee in terms of a percentage of the total class recovery. Movants were directed to propose fees depending on the phase at which the litigation was resolved (the horizontal axis) and the size of the eventual recovery (the vertical axis). The phases of litigation listed on the grid were: from pleadings through adjudication of any motion to dismiss; during discovery through adjudication of a summary judgment motion; after adjudication through a trial verdict; and post-trial. The sizes of recovery listed on the grid were: first 100 million; second 100 million; third 100 million; next 50 million; next 50 million; next 50 million; next 50 million; and over 500 million.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The court required that the bids be submitted under seal. This Court recently held that the District Court abused its discretion by imposing such a confidentiality order. See In re Cendant Corp., No. 99-5485, at 23 (3d Cir. Aug. 8, 2001).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The case did, of course, settle for an amount well into the billions, reflecting the perspicacity of Mr. Sirota, Aboff 's counsel. We need not decide whether Mr. Sirota could have negotiated such a large settlement because we are satisfied that, from the perspective of the District Court at the time, its decision in selecting counsel was not an abuse of discretion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Title 15 U.S.C. S 77k (the codification of S 11 of the 1933 Act) actually provides for three ways of determining S 11 damages: (1) the difference between the amount paid for the stock and the stock's price the day the lawsuit was brought (the method used above); (2) the difference between the amount paid for the stock and the amount received for it when it was sold, if it was sold before the lawsuit was brought; and (3) the difference between the amount paid for the stock and the amount received for it when it was sold, if it was sold after the lawsuit was brought but before judgment, only if such damages are less than the damages as calculated under (1). See 15 U.S.C. S 77k(e). Only (1) is relevant to this case, however. Regarding option (2), if the class members sold their stock before April 16, 1998 (the day the lawsuit was brought) they would have no damages--the fraud was not revealed until after trading ended on April 15, 1998, so the stock price before April 16 was at least as artificially inflated by the fraud at the sale of the stock as it was at the purchase. Regarding option (3), because the price of Cendant stock continued to decline after the day the lawsuit was filed as more fraud was revealed, this option would result in greater damages than those calculated under (1) and thus cannot be used under the provisions of 15 U.S.C. S 77k(e).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In contrast, had the District Court not held the auction and appointed Lead Counsel pursuant to the Retainer Agreement that it had negotiated with the CalPERS Group, see supra n.4 and accompanying text, the maximum allowable fee--\"unless agreed to by The Funds\"-- would have been approximately $187 million.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Janice and Robert Davidson, for themselves and as trustees of trusts for the benefit of their children (collectively, the Davidsons), have participated in this appeal as objectors to the Settlement. The procedural history of their claims presents a special situation. On June 20, 2000, in response to a motion by the Davidsons for clarification of the class definition specifying that they were not class members or, in the alternative, an extension of time for them to opt out of the Class, the District Court issued an order that: (1) ruled that the Davidsons were covered by the class definition and thus were included in the Class; (2) refused the Davidsons' request for an extension of time to opt out of the Class; and (3) enjoined the Davidsons from arbitrating their claims in California, an action which they had initiated on December 17, 1998. See In re Cendant Corp. Sec. Litig., 194 F.R.D. 158 (D.N.J. 2000). The Davidsons appealed this order. On May 9, 2001, two weeks before oral argument in the present appeal, a panel of this Court filed an opinion affirming in part and reversing in part the District Court's June 20, 2000 Order. In particular, the panel majority generally affirmed the court's Order but left the extent of the scope of the matters to be arbitrated to the arbitrator. However, the full Court has since voted to rehear the Davidsons' appeal en banc, thereby vacating the panel opinion, so at this time it is not clear whether the Davidsons will be held to be class members, whether they will be given an extended time to opt out of the Class, or whether they will be permitted to pursue their claims in arbitration. If any of these possibilities comes to pass, the Davidsons' objections in this appeal will be mooted. However, for reasons set forth infra at Part III.C, we will take up the Davidsons' objections in this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. This is the seventh appeal from this case that this Court has heard so far. The preceding six are: In re Cendant Corp., No. 99-5485 (3d Cir. Aug. 8, 2001); In re Cendant Corp. Litigation , 2001 WL 487903, No. 00-2185, (3d Cir. May 9, 2001) (this is the Davidsons' appeal that gave rise to the since-vacated opinion and is now pending an en banc hearing, see supra n.10); In re Cendant Corp. PRIDES Litigation, 243 F.3d 722 (3d Cir. 2001); In re Cendant Corp. PRIDES Litigation, 235 F.3d 176 (3d Cir. 2000); In re Cendant Corp. PRIDES Litigation, 234 F.3d 166 (3d Cir. 2000); In re Cendant Corp. PRIDES Litigation, 233 F.3d 188 (3d Cir. 2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Throenle purchased 100 shares of Cendant stock during the class period and lost approximately $600.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Duncan bought an unspecified number of CUC notes and claims a loss of $1,294.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Mark exchanged 100 shares of HFS for 240 shares of CUC in the HFS merger and also purchased 400 Cendant shares in the open market during the class period.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The Davidsons held a substantial amount of CUC stock stemming from the merger of their company into CUC, although it is not clear from the record or the briefs exactly how many shares they held or how large their losses were.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. For the most part, Schronbrunn's arguments are duplicative of, or subsumed by, those made by other objectors. Accordingly, we will not identify them separately.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Throenle does raise some points against the settlement with E\u0026Y as well, but the bulk of her argument centers on the Cendant settlement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Duncan raises another argument that we dispose of summarily. GM Trucks held that a district court reviewing a proposed class action settlement should make a preliminary determination, under which a presumption of fairness for the settlement is established if the court finds that: (1) the negotiations occurred at arms length; (2) there was sufficient discovery; (3) the proponents of the settlement are experienced in similar litigation; and (4) only a small fraction of the class objected. See GM Trucks, 55 F.3d at 785. Duncan contends that the District Court should not have accorded the Settlement a threshold presumption of fairness because there was insufficient discovery directed to uncovering E\u0026Y's involvement in the fraud, which, she submits, compels the conclusion that the Lead Plaintiff 's negotiations with E\u0026Y were not at arms-length. More specifically, Duncan argues that there is a strong possibility that three Cendant former employees who have pled guilty to federal criminal charges arising from this fraud may eventually give testimony implicating E\u0026Y more fully in this fraud. (The three former employees are Cosmo Corigliano, the former chief financial officer; Anne Pember, a former senior vice president and controller; and Casper Sabatino, a former vice president of accounting and financial reporting. Duncan refers to these three as \"the three felons.\") Duncan asserts that \"this Court can reasonably conclude that the testimony of the three felons will ultimately establish the fraudulent intent by E\u0026Y.\" Duncan's Opening Br. at 40. We reject this argument for two reasons. First, Duncan uses the wrong standard of review. She says that this Court \"can reasonably conclude\" that more discovery will lead to more information against E\u0026Y; the question, however, is not what this Court can reasonably conclude, but whether the District Court abused its discretion in finding otherwise. See GM Trucks, 55 F.3d at 782, 785. Second, E\u0026Y points out in its brief that Sabatino told investigators that he and others at Cendant took steps to deceive E\u0026Y as to the existence of the fraud. This is corroborated by the Willkie Farr Report on the Cendant fraud, which states that Cendant officials tried to conceal the fraud from E\u0026Y. Indeed, the SEC also filed a complaint against Corigliano, Pember, and Sabatino on the date of their guilty pleas which accused them of lying to E\u0026Y and of withholding material information from E\u0026Y. These factors support the conclusion that E\u0026Y was not an active participant in the fraud but was itself deceived by Cendant officials, rendering Duncan's contentions that the Corigliano, Pember, and Sabatino testimony will reveal E\u0026Y's fraud an exercise in optimism. In sum, Duncan's arguments here are built on pure speculation that relies almost exclusively on the naked allegations made in Cendant's complaint against E\u0026Y. See supra Part II.A. Moreover, Duncan's \"wait and see\" approach to the E\u0026Y settlement (i.e., waiting for further discovery to develop) would likely mean a substantial delay to the Class in receiving settlement money even though there is no evidence that, given time, more information implicating E\u0026Y would come to light. Therefore, we reject Duncan's arguments that there was insufficient discovery regarding E\u0026Y's involvement, and we thus conclude that it was not an abuse of discretion for the District Court to give an initial presumption of fairness to the Settlement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. 15 U.S.C. S 78u-4(f) provides, in pertinent part: (f) Proportionate liability (2) Liability for damages (A) Joint and several liability Any covered person against whom a final judgment is entered in a private action shall be liable for damages jointly and severally only if the trier of fact specifically determines that such covered person knowingly committed a violation of the securities laws. (B) Proportionate liability (i) In general Except as provided in subparagraph (A), a covered person against whom a final judgment is entered in a private action shall be liable solely for the portion of the judgment that corresponds to the percentage of responsibility of that covered person, as determined under paragraph (3). Paragraph 3 of S 78u-4(f) provides in pertinent part that the factfinder should make findings as to \"the percentage of responsibility of [the defendant], measured as a percentage of the total fault of all persons who caused or contributed to the loss incurred by the plaintiff.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Duncan's argument on this factor is that further discovery would turn up evidence establishing E\u0026Y's liability. As we have noted above, this claim is not only speculative, but also undermined by the evidence in the record. Thus, we agree with the District Court's conclusion that the risk of establishing E\u0026Y's liability is substantial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. For example, as we stated in the Facts \u0026 Procedural History section, the damages determination involves calculating the\"true value\" of Cendant/CUC stock for any given day during the class period, i.e., the value that the stock would have had if the fraud had not been committed, which requires a complex and conceptually difficult damages determination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The District Court cited the following: Denise Martin et al., National Economic Research Association, Inc., Recent Trends IV: What Explains Filings and Settlements in Shareholder Class Actions 10-11 (1996) (securities settlements range from 9%-14% of claimed damages); In re Prudential Sec., Inc. L.P. Litig., MDL No. 1005, 1995 WL 798907 (S.D.N.Y. Nov. 20, 1995) (approving settlement of between 1.6% and 5% of claimed damages); In re Crazy Eddie Sec. Litig., 824 F. Supp. 320 (E.D.N.Y. 1993) (settlement of between 6% and 10% of damages); In re Michael Milken \u0026 Assocs. Sec. Litig., 150 F.R.D. 57 (S.D.N.Y. 1993) (7.5%).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. This is of course a highly questionable proposition insofar as the S 10(b) claims were concerned, as it appears from the record that Cendant would likely bear a much higher proportionate responsibility than E\u0026Y for the fraud.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The reason why a drop in market capitalization is an inaccurate determiner of damages can be clarified by the following example. Suppose that Samantha Shareholder bought one share of Cendant stock at $20. The stock then rose to $25, but when the fraud was announced it dropped to $15, whereupon Shareholder sold. Shareholder's damages are $5 because that is the difference between what she paid for the stock and what she sold it for after the fraud was revealed ($20 - $15); these are her \"out-of-pocket\" damages. See Sowell v. Butcher \u0026 Singer, Inc., 926 F.2d 289, 297 (3d Cir. 1991) (\"The proper measure of damages to reflect the loss proximately caused by the defendants' deceit is the out-of-pocket rule. That rule is the traditional measure of damages in a Rule 10b-5 action.\") (internal quotation marks and citation omitted). If we used the drop in market capitalization to determine Shareholder's damages, however, we would conclude that she had damages of $10 ($25 - $15), which is greater than her out-of-pocket loss and is thus not a proper measure of her damages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Although we have held that the fact that the members of the CalPERS Group continued to hold Cendant stock does not warrant overturning the Settlement, we call attention to an issue of potential intra-class conflicts with which district courts will need to grapple in future cases at the class certification stage. See In re Party City Securities Litigation, 189 F.R.D. 91, 108-10 (D.N.J. 1999) (noting the possibility of a significant conflict in many securities class actions between the interests of individuals and institutions that purchased and then sold stock in the defendant firm--\"Sell Plaintiffs\"--and those who bought and continue to hold such stock--\"Hold Plaintiffs\"). In economic terms, the potential conflict may be demonstrated as follows. The motivation of a rational Sell Plaintiff is simple: he wants to secure the largest possible recovery. The rational Hold Plaintiff, however, is in a more complicated situation; her goal is to reach a settlement that will maximize the combined value of her share of the settlement and the stock that she continues to hold in the defendant firm. Consequently, though a rational Sell Plaintiff would be perfectly willing to push the defendant firm one dollar short of declaring bankruptcy, a rational Hold Plaintiff rarely would be so willing because the increased value of her share of the settlement fund would almost certainly be offset by a corresponding decrease in the value of her stock. Thus, there will often be a significant conflict between the interests of Sell Plaintiffs and Hold Plaintiffs, particularly in cases where the class's expected damages are very large. We acknowledge that settlements among market participants are not always a function of rational behavior, as economists assume. Indeed, most settlements are probably based on intuition--although market factors doubtless inform the exercise of the parties' judgment. What is important to realize, however, is that this issue is one of class configuration. It is not merely a problem with the identity of the lead plaintiff, because it is equally problematic to have a Sell Plaintiff represent a class that includes Hold Plaintiffs as it is to have a Hold Plaintiff represent a class that includes Sell Plaintiffs. Properly understood, the issue is whether the conflict between the interests of Sell Plaintiffs and Hold Plaintiffs in a particular case is sufficiently severe so as to prevent a putative class from satisfying Rule 23's requirements for class certification, regardless whether the problem is seen as one of commonality, see Fed. R. Civ. P. 23(a)(2) (providing that a class action may be maintained only if \"there are questions of law or fact common to the class\"), typicality, see Fed. R. Civ. P. 23(a)(3) (permitting class certification only if \"the claims or defenses of the representative parties are typical of the claims or defenses of the class\"), adequacy of representation, see Fed. R. Civ. P. 23(a)(4) (stating that a class may be certified only if \"the representative parties will fairly and adequately protect the interests of the class\"), or predominance, see Fed. R. Civ. P. 23(b)(3) (allowing for class certification if \"the court finds that the questions of law or fact common to the members of the class predominate over any questions affecting only individual members\"). Because here no party on appeal objects to class certification based on conflicts between Sell Plaintiffs and Hold Plaintiffs, we need not decide whether this matter should have been certified as two separate classes or as a single class with sub-classes. We do, however, call these issues to the attention of district courts for future cases, and note that the use of separate classes or sub-classes is not inconsistent with the Reform Act because that statute deals with the identification of a lead plaintiff, and not with the proper means for defining a class in the first place.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Throenle makes two other arguments which can be dealt with summarily. First, she argues that the Settlement Notice was inadequate because it omitted information that the PSLRA requires in such notices, in 15 U.S.C. S 78u-4(a)(7)(B)(ii). That statute provides, in relevant part: \"Disagreement on amount of damages: If the parties do not agree on the average amount of damages per share that would be recoverable if the plaintiff prevailed on each claim alleged under this chapter, a statement from each settling party concerning the issue or issues on which the parties disagree\" must be included in the notice of a settlement. Throenle appears to interpret this as a requirement that, if the parties do not agree on damages, the notice of a settlement must include a statement from each settling party concerning every issue on which the parties disagree. The District Court rejected this argument, holding that (7)(B)(ii) clearly only requires a statement on the damages issues on which the parties disagree. The District Court was correct. Quite obviously, the phrase \"the issue or issues on which the parties disagree\" in (7)(B)(ii) refers only to damages issues, not to every disputed issue involved in the class action. The court found that the Settlement Notice contained a statement of the damages issues on which the parties disagree and that this statement was sufficient; this finding was supported. Throenle also argues that several of the statements contained in the Settlement Notice were misleading or incomplete; these arguments are patently without merit and we reject them without further discussion. Second, Throenle argues that the District Court erred in approving the part of the Settlement in which \"Lead Plaintiffs have traded their solid case against E\u0026Y\" for a 50% interest in any recovery that Cendant gets in its cross-claim against E\u0026Y, because: (1) \"Lead Plaintiffs cannot cede their responsibility for prosecuting a class action against one defendant in a case to another defendant in the case,\" as this violates the \"spirit\" of Rule 23; and (2) \"Cendant's case against E\u0026Y is much weaker than the case brought against E\u0026Y by the class.\" Throenle's Opening Br. at 57-58. Throenle's argument here involves a mischaracterization of the terms of the Settlement. Under the Settlement, E\u0026Y paid the Class $335 million in return for the Class releasing its claims against E\u0026Y; this is the extent of what the Class is getting from E\u0026Y. Independent of any of the Class's claims, Cendant has asserted certain cross-claims against E\u0026Y. In addition to its $2.85 billion payment, Cendant agreed to give 50% of any recovery of these claims against E\u0026Y to the Class. Cendant is prosecuting not the Class's claims against E\u0026Y but its own cross-claims, so Cendant is not in any way taking over the role of Lead Plaintiff. Consequently, the relative strength of Cendant's claims against E\u0026Y as compared to the Class's claims against E\u0026Y is immaterial to the fairness of this settlement provision; the Class did not give up any part of its claims against E\u0026Y for this 50% of Cendant's recovery, but only gave up some portion of its claims against Cendant in return for this 50% from Cendant (and given that Cendant paid the Class $2.85 billion, it is not clear that the Class gave up very much for this 50% recovery). Therefore, we reject Throenle's argument that the District Court abused its discretion in approving this portion of the Settlement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. As we noted above, the Plan of Allocation allowed class members with S 11 claims to calculate their damages either under a statutory S 11 calculation or under the plan's S 10(b) calculation, whichever was higher. This is because any S 11 claim can also be treated as a S 10(b) claim, so anyone with a S 11 claim also has a S 10(b) claim (of course, the converse is not true). However, certain class members had both a S 11 claim and an independent S 10(b) claim; that is, they received shares in the HFS merger (the S 11 claim), and they also bought shares on the open market (the S 10(b) claim). The Lead Plaintiff had both S 11 claims and independent S 10(b) claims, as did Mark.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The reason for this is that S 11 damages and S 10(b) damages are calculated under the Plan of Allocation using different days as the \"selling date,\" i.e., the date on which the class member is deemed to have sold her Cendant stock for damage determination purposes. As we described, supra n.8, S 11 damages are determined by using as a selling date the date lawsuits were first filed (April 16, 1998). Section 10(b) damages, however, are determined using the earlier of (1) the date the class member actually sold her stock or (2) the last day of the class period, i.e., August 28, 1998. Thus, because a class member would have no damages if she sold before April 16, 1998 (the fraud was not revealed until after trading on April 15, 1998, so sales before then got the full benefit of the fraudulently inflated price of Cendant's stock), damages on the S 10(b) claims are determined using a date between April 16, 1998 and August 28, 1998. Because Cendant stock declined steadily between April 16 and August 28, 1998, the calculations ofS 10(b) damages under the Plan of Allocation (which may use a post-April 16 date as the selling date) are generally more than S 11 damage calculations under the plan (using April 16 as the selling date).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Mark argues that, although the PRIDES settlement involved a \"paper for paper\" exchange, a PRIDES plaintiff who sold her new Cendant stock within the first ten days that she was able to received almost 100% of her damages claimed, so that the PRIDES settlement effectively involved a nearly 100% cash payout. However, at the time when the PRIDES settlement was reached, there was no guarantee that the class members would garner such a steadily high return over the first few days during which they would be able to sell their stock. There was about a nine-month delay between the settlement approval and the date when the class members could sell their new shares in the market, and much could have happened to Cendant and its stock during that interim that could have affected the amount of return that the PRIDES plaintiffs received. Thus, the PRIDES \"paper for paper\" exchange involved a sizeable risk, at the time the settlement was entered into, of a payout substantially less than 100% of the class's damages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The deadline to submit claims to the Claims Administrator was October 31, 2000.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Section 12 of the Securities Act of 1933 provides for civil liability for anyone who offers or sells a security \"by means of a prospectus or oral communication, which includes an untrue statement of material fact or omits to state a material fact necessary in order to make the statements, in light of the circumstances under which they were made, not misleading . . . .\" 15 U.S.C. S 77l.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. For a sampling of the literature assessing the desirability and efficacy of using the percentage-of-recovery method in common fund cases, see, for example, Reagan W. Silber \u0026 Frank E. Goodrich, Common Funds and Common Problems: Fee Objections and Class Counsel's Response, 17 Rev. Litig. 525 (1998) (arguing in favor of the use of the percentage-of-recovery method in common fund cases, and contending that the percentage allocated to counsel fees should not decrease simply because the size of the fund increases); William J. Lynk, The Courts and the Plaintiffs' Bar: Awarding the Attorney's Fees in Class Action Litigation, 23 J. Legal Stud. 185 (1994) (employing economic analysis to consider the similarities and differences between the lodestar and percentage-of-recovery methods, and surveying case law in an effort to determine which method better explains the actual size of class counsel fee awards); Jonathan R. Macey \u0026 Geoffrey P. Miller, The Plaintiffs' Attorney's Role in Class Action and Derivative Litigation: Economic Analysis and Recommendations for Reform, 58 U. Chi. L. Rev. 1, 48-61 (1991) (analyzing and critiquing both methods, arguing that the percentage-of-recovery method, though preferable to the lodestar, is deeply flawed as well); Monique LaPointe, Note, Attorney's Fees in Common Fund Actions, 59 Fordham L. Rev. 843 (1991) (assessing both methods and arguing that the most important thing for courts to do is to pick one or the other in order to facilitate case management and promote predictability).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The Task Force members disagreed among themselves as to how early was appropriate. Some pushed for as early a time as possible, suggesting after the pleadings have been filed but before discovery was significantly underway. Other (judicial) members of the Task Force preferred a later point to allow them to have a\"feel\" for how the case had developed. See id. at 255 n.62. The members of the Task Force also disagreed as to whether a \"time limit should be imposed on the court's ability to shift from one fee regime to another.\" Id. at 257. Some of the judicial members of the Task Force thought that no such limit should apply so as to preserve the court's ability to protect the best interests of the class. See id. Other members of the Task Force believed that giving the court that degree of discretion would \"destroy[ ] the predictability\" that advance negotiation is intended to achieve. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. The Task Force Report recommended that \"the court appoint a non-judicial representative--who typically will be an attorney--for the then putative fund beneficiaries, who will negotiate the agreement in the usual marketplace manner and submit the proposal for the court's approval.\" Id. The Report contemplated that the court's review of the agreement negotiated between court-appointed intermediary and counsel would be \"completely independent and thorough,\" and that the court would have the power to \"accept, reject, or revise the arrangement, either providing exact terms or merely establishing ranges and retaining the ultimate authority to revise the agreement if later circumstances warrant.\" Id. at 257.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. We have located eleven cases besides this one and Oracle where a district court selected class counsel by means of an auction. Two were antitrust cases. See In re Amino Acid Lysine Antitrust Litig., 918 F. Supp. 1190 (N.D. Ill. 1996) (Shadur, J.); In re Auction Houses Antitrust Litig., 197 F.R.D. 71 (S.D.N.Y. 2000) (Kaplan, J.). One was a securities class action not governed by the PSLRA. See In re Wells Fargo Sec. Litig., 156 F.R.D. 223 (N.D. Cal. 1994) (Walker, J.). And eight were securities class actions governed by the Reform Act. See Raftery v. Mercury Fin. Co., No. 97 C 624, 1997 WL 529553 (N.D. Ill. 1997) (Lefkow, J.); Sherleigh Assoc. LLC v. Windmere-Durable Holdings, Inc., 184 F.R.D. 688 (S.D. Fla. 1999) (Lenard, J.); Wenderhold v. Cylink Corp., 188 F.R.D. 577 (N.D. Cal. 1999) (Walker, J.); In re Lucent Tech., Inc. Sec. Litig., 194 F.R.D. 137 (D.N.J. 2000) (Lechner, J.); In re Bank One S'holders Class Actions, 96 F. Supp. 2d 780 (N.D. Ill. 2000) (Shadur, J.); In re Comdisco Sec. Litig., 141 F. Supp. 2d 951 (N.D. Ill. 2001) (Shadur, J.); In re Quintus Sec. Litig., No. C-00-4263 (N.D. Cal., April 12, 2001) (Walker, J.); see also In re Network Assocs., Inc. Sec. Litig., 76 F. Supp. 2d 1017 (N.D. Cal. 1999) (Alsup, J.) (directing the lead plaintiff to undertake an auction process).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. On January 30, 2001, the opinion author, acting as Chief Circuit Judge and Presiding Officer of the Third Circuit Judicial Council, announced the formation of a Task Force on the Selection of Class Counsel whose primary duty is to assess the propriety and efficacy of the use of the auction method in its various applications, and to formulate recommendations for the bench, bar, and public. The Press Release containing this announcement is available at: http://www.ca3.uscourts.gov/classcounsel/taskforce.pdf. Other press releases relating to the 2001 Task Force, a list of questions that it is addressing, witness statements, and transcripts of the proceedings so far are all available at: http://www.ca3.uscourts.gov/classcounsel/ public.htm. The 2001 Task Force's preliminary report will be made public in October 2001, and its final report is scheduled for release sometime during the Spring of 2002. Judge Ambro, named in January as a member of the 2001 Task Force, later became a member of this panel through the Court's random assignment process. Judge Becker informed counsel for all parties of this fact during a conference call that was held prior to oral argument, and no party objected to Judge Ambro's continued involvement in this matter. During this call, Judge Becker also \"explained that everything that is before the Task Force -- written presentations, case law, and transcripts of oral presentations, et alia, ha[d] been placed on the Third Circuit website (www.ca3.uscourts.gov), available through a link entitled `Class Counsel Information.' \" In re Cendant Corp. Litig., No. 00-2520 (3d Cir., May 15, 2001) (unpublished order). Lastly, Judge Becker stressed that \"the function of the Task Force is limited to making general recommendations to the bench and bar at large (throughout the nation)\" and that its recommendations would have \"no precedential effect in any circuit.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. See, e.g., Proceedings of the 2001 Third Circuit Task Force on the Selection of Class Counsel [hereinafter \"2001 Task Force Proceedings\"], Statement of the Committee on Federal Courts of the Association of the Bar of the City of New York, at 4-5, available at http://www.ca3.uscourts.gov/classcounsel/Witness%20Statements/ struve.pdf [hereinafter \"NYC Bar Association\"]; 2001 Task Force Proceedings, Statement of John C. Coffee, Jr., at 2, available at http://www.ca3.uscourts.gov/classcounsel/Witness%20Statements/ johncoffee.pdf [hereinafter \"Coffee\"]; 2001 Task Force Proceedings, Statement of Richard B. Drubel, at 4-5, available at http://www.ca3.uscourts.gov/classcounsel/Witness%20Statements/ Richard_Drubel.pdf [hereinafter \"Drubel\"]; see also discussion, infra at n.44 (describing Judge Milton I. Shadur's belief that his use of the auction technique has saved class members in cases before him millions of dollars in counsel fees).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. See, e.g., Coffee at 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. In Gunter this Court noted the auction technique \"appears to have worked well,\" and identified the decision now here on review, among others, as cases where it had been used. See id. at 201 n.6. Gunter was an antitrust case, hence questions involving the compatibility of the auction procedure with the Reform Act were not before the Court. Moreover, this type of citation to a district court opinion, offered to open eyes to a range of possibilities, was not even dicta, and, at all events, does not preclude a subsequent panel from reviewing the merits of a district court's decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. See, e.g., 2001 Task Force Proceedings, Statement of Lucian Ayre Bebchuk, at 6-8, available at http://www.ca3.uscourts.gov/ classcounsel/Witness%20Statements/Bebchuk.Statement.pdf [hereinafter \"Bebchuk\"]; Task Force Proceedings, Statement of Jill E. Fisch, at 3-4, available at http://www.ca3.uscourts.gov/classcounsel/ Witness%20Statements/fisch.pdf. [hereinafter\"Fisch\"].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. See, e.g., Fisch at 7; NYC Bar Association at 3; Coffee at 3. But see In re Bank One S'holders Class Actions, 96 F. Supp. 2d 780, 789 n.13 (N.D. Ill. 2000) (ordering a lead plaintiff to ensure that the lawyers who prepared the consolidated class action complaint--but were not selected as lead counsel via a court-ordered auction--were compensated for their time).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. See, e.g., Fisch at 2; NYC Bar Association at 5.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. See, e.g., Coffee at 3; Fisch at 6-7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. See, e.g., Coffee at 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Along with Judge Walker (who, as we noted in the text, originated the use of the auction method in federal court), Judge Shadur has been a leading proponent of the auction method. Judge Shadur held one of the first lead counsel auctions in In re Amino Acid Lysine Antitrust Litigation, 918 F. Supp. 1190 (N.D. Ill. 1996), and has since used the technique in two other cases as well. See In re Bank One S'holders Class Actions, 96 F. Supp. 2d 780 (N.D. Ill. 2000); In re Comdisco Sec. Litig., 141 F. Supp. 2d 951 (N.D. Ill., Apr. 12, 2001). In these opinions, Judge Shadur cogently explains why courts have a basic obligation to protect the pecuniary interests of absent class members, persuasively outlines why courts cannot fulfill this duty by relying on decisions made by lead plaintiffs, and powerfully argues in favor of the auction method as the only way to minimize the agency costs that plague relationships between absent class members and class counsel. Judge Shadur believes that his use of the auction technique has saved class members in cases before him millions of dollars in counsel fees. See, e.g., Bank One, 96 F. Supp. 2d at 785 n.5 (claiming that the Lysine auction saved the class between $5 and 10 million in attorneys fees). In his recent opinion in In re Comdisco Sec. Litig., No. 01 C2110, 01 C 874, 2001 WL 722097 (N.D. Ill. June 27, 2001), Judge Shadur noted that the two prior cases in which he has used the auction technique resulted in attorneys fees of approximately 6% of the class's total recovery, and he contrasted this with a recent case from the Eastern District of Pennsylvania in which counsel was awarded 25% of the total recovery. See id. at *5. Based on this, Judge Shadur calculated that his use of the auction method saved plaintiff class members $10 million or more in counsel fees in each of the cases where he has employed it. See id. Although Judge Shadur's analysis seems quite persuasive, some have argued that his auctions have resulted in lower overall recoveries as well as lower counsel fees and have thus cost rather than saved class members money, see, e.g., John C. Coffee, Jr., Securities: Class Actions , Nat'l L.J., Sept. 14, 1998, at B6 (criticizing the Lysine auction on this basis). We need not engage in a dialogue with Judge Walker and Judge Shadur over the merits and demerits of the auction method in class actions generally at this time, however, because before us is a question of statutory interpretation (of the Reform Act) rather than one of judicial policy. As we explain infra at Part IV.C, we think that lead counsel auctions are generally (and that the auction in this case was) inconsistent with the statutory scheme embodied in the Reform Act. It will be left to later opinions of this Court, to the 2001 Task Force, and perhaps to the Congress, to wrestle with the forceful policy arguments in favor of the auction method that Judge Walker and Judge Shadur have advanced.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. In Quintus, Judge Walker found that a movant for the lead plaintiff position did not otherwise satisfy Rule 23 because he had not \"demonstrated that he is able effectively to select and retain lead counsel.\" Id. at 30. In a sworn declaration, the movant stated that he had made his choice of counsel \"based on his broker's advice and after conversations with lawyers at the firm,\" that he had \"discussed and considered a variety of fee structures with his counsel and ha[d] developed an understanding of how fees are customarily charged in litigation of this type,\" and that he had \"negotiated an agreement with counsel . . . that [he] believe[d] [would] maximize recovery for the class.\" Id. Judge Walker found this insufficient to support a conclusion that the movant satisfied Rule 23's adequacy requirement, noting that the declaration gave \"no specifics\" about the process by which the movant had selected and negotiated with his chosen counsel. Judge Walker was most concerned about a statement that one of the movant's chosen lawyers had made at the hearing held to consider the appointment of lead plaintiff. The lawyer had informed the court\"that the fee negotiated by [the movant] paid expenses out of the class's recovery, rather than out of counsel's portion of the recovery,\" but then explained that \"counsel, of their own accord, had decided to sweeten the terms of the agreement and allow expenses to be deducted from counsel's share of the recovery; pending approval by [the movant] who did not know about this concession.\" Id. at 31. Though finding \"counsel's benevolence towards the class . . . commendable,\" Judge Walker could not \"conclude that [the movant] negotiated anything close to a competitive fee in light of counsel's willingness to modify the fee, without being asked, to require counsel to pay all litigation expenses.\" Id. \"Benevolence of counsel,\" Judge Walker wrote, \"is no substitute for hard bargaining.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. After its disqualification of the movant with the largest financial interest on the grounds outlined above, the court decided to select the lead plaintiff and lead counsel by means of an auction. See id. at *3. We do not ally ourselves with this latter decision, which, for reasons stated infra at Part IV.C.2, we think would be inappropriate in the typical Reform Act case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. At oral argument before this Court, Aboff argued that it had been unable to back up its allegations because the District Court had denied it discovery. The Reform Act is quite clear on this score: an objecting class member is entitled to discovery \"only if the plaintiff first demonstrates a reasonable basis for a finding that the presumptively most adequate plaintiff is incapable of adequately representing the class.\" 15 U.S.C. S 78u-4(a)(3)(B)(iv). Under this standard, it is doubtful that Aboff would have been entitled to discovery (if indeed it asked).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Although we have held that the District Court was correct to reject Aboff and Wilson's pay-to-play allegations based on a lack of evidence and to appoint the CalPERS Group as lead plaintiff, we call attention to a situation that Congress may not have contemplated when it enacted the PSLRA. Congress clearly anticipated that pension funds would seek to serve as lead plaintiffs; indeed, that likelihood was seen as a specific benefit of the legislation. See H.R. Conf. Rep. No. 104-369, at 34 (1995), reprinted in 1995 U.S.C.C.A.N. 730, 733. What is unclear, however, is whether Congress considered a particular risk that seems unique to publicly-managed pension funds. The concern is that an informal quid pro quo could develop in which law firms specializing in securities class actions would contribute to the campaign coffers of the elected officials who oversee those funds, and that, in exchange (and in the hopes of getting more contributions), those officials would use their control over the funds to select those firms to serve as lead counsel for cases in which the funds are the lead plaintiff. In such a situation, there would also be reason to fear that the lead plaintiff would be complacent and unwilling to object to an excessive fee request, thus defeating the Reform Act's goal of lead plaintiff-controlled, rather than lead counsel-controlled, litigation. Were such a scenario to occur, the elected official's conduct--besides representing a breach of fiduciary duty to the pensioners--would threaten the best interests of the class members. Though we stress that there is no evidence of such impropriety in this case, Congress does not appear to have considered this risk when it enacted the Reform Act and may wish to revise the PSLRA to account for it. In the absence of any such amendment, district courts should be particularly attuned to the risk of pay-to-play. In cases where a court determines that a publicly-managed fund is the presumptively most adequate plaintiff, the court could properly require that the fund disclose any campaign contributions by the fund's choice of counsel to any elected officials possessing direct oversight and authority over the fund. If any such contributions have been made, the court could also require that the fund submit a sworn declaration describing the process by which it selected counsel and attesting to the degree to which the selection process was or was not influenced by any elected officials. Courts must also, however, take care to prevent the use of discovery to harass presumptive lead plaintiffs, something that the Reform Act was meant to guard against. The statute is clear that\"discovery relating to whether a member . . . of the purported plaintiff class is the most adequate plaintiff may be conducted by a plaintiff only if the plaintiff [seeking discovery] first demonstrates a reasonable basis for finding that the presumptively most adequate plaintiff is incapable of adequately representing the class.\" 15 U.S.C. S 78u-4(a)(3)(B)(iv) (emphasis added). We reiterate that evidence of campaign contributions, standing alone, does not create \"a reasonable basis\" sufficient to justify party-conducted discovery, though it would certainly (as noted earlier) be enough for the court, on its own initiative, to seek further information from the presumptive lead plaintiff.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Under the Retainer Agreement (and absent the express consent of the CalPERS Group), the maximum counsel fee would have been approximately $187 million--over $76 million dollars less than that produced by the court-ordered auction grid. See supra nn.4 \u0026 9.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Our position here is in substantial accord with that advanced by the Securities and Exchange Commission. See Brief for the Securities and Exchange Commission as Amicus Curiae at 20-23.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. As noted earlier, we need not and do not decide whether \"prior approval of The Funds\" means all of the Funds or a majority of the Funds. See supra Part IV.C.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Moreover, it is unclear whether a failure to object just after the court emphatically stated what it was going to do would even qualify as acquiescence, much less \"approval.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. This disposition makes it technically unnecessary for us to decide whether Aboff is correct that the Settlement Notice was defective with regard to Lead Counsel's request for attorneys fees or whether Throenle is correct that the fee request was improper as matter of law. At all events, we conclude that both arguments are meritless.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. Following the lead of the 1985 Task Force Report, several of this Court's cases have stated that, ordinarily, the percentage of a recovery devoted to attorneys fees should decrease as the size of the overall settlement or recovery increases. See 1985 Task Force Report, 108 F.R.D. at 256; Prudential, 148 F.3d at 339; In re Cendant Corp. PRIDES Litig., 243 F.3d 722, 736 (3d Cir. 2001). In Prudential, we explained that \"[t]he basis for this inverse relationship is the belief that in many instances the increase in recovery is merely a factor of the size of the class and has no direct relationship to the efforts of counsel.\" 148 F.3d at 339 (internal quotation marks and citation omitted). This position, however, has been criticized by respected courts and commentators, who contend that such a fee scale often gives counsel an incentive to settle cases too early and too cheaply. See, e.g., In re Auction Houses Antitrust Litig., 197 F.R.D. 71, 80-81, 84 n.55 (S.D.N.Y. 2000) (outlining the advantages and problems with the use of decreasing and increasing fee scales, and ultimately concluding that an increasing fee scale was more appropriate in that particular case); 2001 Task Force Proceedings, Statement of Samuel Issacharoff, at 7, available at http://www.ca3.uscourts.gov/classcounsel/Witness%20Statements/ samissac.pdf (arguing that a decreasing percentage scale simply gives counsel an incentive to settle cheap). We need not decide at this time whether the deference that courts owe to fee scales negotiated by a properly-selected lead plaintiff would mandate deference to that plaintiff 's decision to employ a rising-percentage fee scale in a particular case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. In re Cendant Corp. PRIDES Litig., 243 F.3d 722 (3d Cir. 2001), is not to the contrary. That case, like this one, was governed by the PSLRA, but we nevertheless applied full-strength Gunter review rather than the version we have described here. In Cendant PRIDES, as here, the district court had employed an auction to select and retain lead counsel, see id. at 735 n.18, but that decision was not challenged on appeal in Cendant PRIDES. Once the use of an auction was accepted, Cendant PRIDES ceased to be a typical PSLRA case because the assumptions underlying the Reform Act model that we outlined above had broken down. As we have explained, see supra Part IV.A.2, the auction method, like the traditional approach, relies on the court to serve as the class's agent with regard to selecting and retaining lead counsel. In such a context, the full Gunter review that we mandated in Cendant PRIDES makes sense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Arguably Cendant PRIDES, which, as noted above, see supra, n. 56, was not decided as a Reform Act case, may have, by implication, elevated the lodestar cross-check from being a \"recommendation\" to a requirement. There the District Court had not performed a lodestar cross-check, and by our calculations the fees that it ultimately awarded were between 7 and 10 times the lodestar amount. See 243 F.3d at 742. We wrote that \"[i]n allowing such a high multiplier . . . without even calculating it, much less explaining how it [was] justified, the District Court strayed from all responsible discretionary parameters\" in granting the fee award. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. We note that even PSLRA sponsored fee agreements between Lead Plaintiff and Lead Counsel will typically require an accounting of hours spent, as the agreement in the present case does.\u003c/span\u003e\n\n",
    "body_length": 261512,
    "citedas": [
      "264 F.3d 201"
    ],
    "attorneys": "Howard B. Sirota, Esquire (argued)Sirota \u0026 Sirota110 Wall StreetNew York, NY 10005Counsel for Appellant Joanne A. Aboff Family TrustEdward W. Cochran, Esquire (argued)Cochran \u0026 Cochran2872 Broxton RoadShaker Heights, OH 44120Frank H. Tomlinson, EsquirePritchard, McCall \u0026 Jones505 North 20th Street, Suite 800Birmingham, AL 35203Paul S. Rothstein, Esquire626 Northeast First StreetGainesville, FL 32601Counsel for Appellant Betty DuncanC. Benjamin Nutley, Esquire (argued)Kendrick \u0026 Nutley468 North Camden Drive, Suite 200Beverly Hills, CA 90210Richard Galex, EsquireGalex, Tortoreti \u0026 Tomes150 Tices LaneEast Brunswick, NJ 08816Counsel for Appellant Tere ThroenleGerald W. Palmer, Esquire (argued)Ricky L. Shackelford, EsquireEugenia L. Castruccio, EsquireJones, Day, Reavis \u0026 Pogue555 West Fifth Street, Suite 4600Los Angeles, CA 90013Counsel for Appellants Robert and Janice DavidsonLawrence W. Schonbrun, Esquire (argued)Law Office of Lawrence W. Schonbrun86 Eucalyptus RoadBerkeley, CA 94705Counsel for Appellant Faye SchonbrunnJohn Halebian, Esquire (argued)Wechsler, Harwood, Halebian \u0026 Feffer488 Madison Avenue, 8th FloorNew York, NY 10022Kenneth A. Elan, EsquireLaw Offices of Kenneth A. Elan217 BroadwayNew York, NY 10007Counsel for Appellant Ann MarkMichael D. Hess, EsquireLeonard J. Koerner, EsquireLorna B. Goodman, EsquireElizabeth S. Natrella, Esquire (argued)Leslie Conason, EsquireCorporation Counsel of the City of New YorkNew York City Law Department100 Church StreetNew York, NY 10007Counsel for Appellants New York City Pension FundsMax W. Berger, EsquireDaniel L. Berger, Esquire (argued)Jeffrey N. Leibell, EsquireBernstein, Litowitz, Berger, \u0026 Grossman, Llp1285 Avenue of the Americas, 33rd FloorNew York, NY 10019Leonard Barrack, EsquireGerald J. Rodos, EsquireJeffrey W. Golan, EsquireBarrack, Rodos, \u0026 Bacine3300 Two Commerce Square2001 Market StreetPhiladelphia, PA 19103Counsel for Appellees California Public Employees' Retirement System,New York State Common Retirement Fund and The New York City PensionFundsArthur R. Miller, Esquire (argued)228 Harvard Law SchoolLangdell WestAreeda Hall 2251565 Massachusetts AvenueCambridge, MA 02138Counsel for Appellees Barrack, Rodos, \u0026 Bacine and Bernstein, Litowitz,Berger \u0026 Grossmann, LlpAlan N. Salpeter, Esquire (argued)Michele Odorizzi, EsquireCaryn L. Jacobs, EsquireMayer, Brown \u0026 Platt190 South LaSalle StreetChicago, IL 60603-3441Douglas S. Eakley, EsquirePeter L. Skolnik, EsquireLowenstein, Sandler, PC65 Livingston AvenueRoseland, NJ 07068Kathryn A. Oberly, EsquireRobert G. Cohen, EsquireWilliam P. Hammer, Jr., EsquireErnst \u0026 Young, Llp787 Seventh AvenueNew York, NY 10019-6018Counsel for Appellee Ernst \u0026 Young, LlpCarl Greenberg, EsquireMichael M. Rosenbaum, EsquireBudd, Larner, Gross, Rosenbaum, Greenberg \u0026 Sade150 John F. Kennedy Parkway CN 1000Short Hills, NJ 07078-0999Samuel Kadet, EsquireSkadden, Arps, Slate, Meagher \u0026 FlomFour Times SquareNew York, NY 10036Counsel for Appellee Cendant CorporationHerbert J. Stern, EsquireStern, Greenberg \u0026 Kilcullen75 Livingston AvenueRoseland, NH 07068Counsel for Appellee James E. BuckmanDavid M. Becker, Esquire General CounselMeyer Eisenberg, Esquire Deputy General CounselEric Summergrad, Esquire Deputy SolicitorLuis DE LA Torre, Esquire (argued) Special CounselNathan A. Forrester, Esquire Senior CounselSecurities and Exchange Commission450 Fifth Street, N.W.Washington, DC 20549-0606Counsel for Amicus Curiae Securities and Exchange CommissionJoseph A. Grundfest, EsquireThe William A. Franke Professor of Law and BusinessStanford Law SchoolCrown Quadrangle559 Nathan Abbott WayStanford, CA 94305-8610Melanie M. Piech, EsquireLieff, Cabraser, Heimann \u0026 Bernstein, Llp275 Battery Street, 30th FloorSan Francisco, CA 94111Counsel for Amicus Curiae Barclays Global Investors, N.A., FranklinResources, Inc., New Hampshire Retirement System and Public Employees'Retirement Association of Colorado",
    "category": [],
    "judges": "Before: Becker, Chief Judge, Sloviter and Ambro, Circuit Judges.",
    "citation_count": 465
  }
}
