{
  "id": "qM_5YWYBTlTomsSBtES3",
  "document": {
    "title": "Olsen v. State",
    "full_title": "MARTIN J. OLSEN (DEFENDANT), v. THE STATE OF WYOMING (PLAINTIFF).",
    "jurisdiction": "Wyoming Supreme Court",
    "date": "2003-04-14T00:00:00.000Z",
    "docket": "No. 98-62",
    "body": "[¶1] In accordance with Wyo. Stat. Ann. § 6-2-103(a) (Michie 1997), this is an appeal from convictions of capital murder charged under Wyo. Stat. Ann. §6-2-101(a) (Michie 1997) and sentences of death imposed under Wyo. Stat. Ann. § 6-2-102 (Michie 1997), following a jury trial and sentencing proceedings. Martin J. Olsen (Olsen) was charged with and convicted of murdering three victims during a robbery at a bar in Worland, Wyoming. On appeal, with respect to his capital murder convictions and sentences, he enumerates twenty-five errors under the various headings of constitutional issues, instruction issues addressing the sentencing phase, additional issues addressing the sentencing phase, trial phase issues, and punishment issues. The statements of the issues submitted by Olsen and the State are attached as Appendix A to this opinion. In addition to considering the specific errors enumerated by Olsen, this court has also considered the punishment. Wyo. Stat. Ann. § 6-2-103(c) (Michie 1997). With regard to the sentences, this court has considered (1) whether the jury imposed the sentences of death under the influence of passion, prejudice or any other arbitrary factor and (2) whether the jury's finding of aggravating circumstances and mitigating circumstances is supported by the evidence. Wyo. Stat. Ann. § 6-2-103(d)(i) and (ii) (Michie 1997).\n\n[¶2] We find no constitutional errors and find no errors in the guilt phase of Olsen's trial. Therefore, we affirm Olsen's convictions of capital/first degree murder and robbery. We do find error, however, in the sentencing phase of Olsen's trial in the following matters: (1) insufficient evidence to support the jury's finding of the aggravating circumstance that the murders were especially atrocious or cruel, being unnecessarily torturous to the victims; (2) insufficient evidence to support the jury's finding of the aggravating circumstance that Olsen knowingly created a great risk of death to two or more persons; (3) improper jury instructions on the law of mitigating circumstances, the decision-making process, the mitigating circumstance of duress, Olsen's parole status if he received life sentences, and the verdict form; and (4) the introduction of victim impact evidence and a plea of mercy. Consequently, we set aside Olsen's sentence of death and remand for a new sentencing hearing to be conducted with a new jury impaneled for that purpose. Wyo. Stat. Ann. § 6-2-103(e)(iii) (Michie 1997).\n\n[¶3] From this court's study of death penalty jurisprudence, this court acutely appreciates that a capital case, by its very nature, requires of a reviewing court the most meticulous and thoughtful consideration and deliberation of the issues presented. In fulfilling that requirement in this case, the members of this court have had divergent views concerning the resolution of some of the many difficult issues presented and have expended substantial amounts of time working through those divergent views to achieve agreement on the resolution and the reasoning supporting the resolution of these issues. In light of the requirement of meticulous and thoughtful consideration and deliberation, the working through of divergent views to achieve agreement on resolution of issues, the unique set of appellate responsibilities conferred by the legislature upon this court, the errors enumerated in this appeal, the parties' extensive briefing of the issues underlying these enumerated errors, and the caution that the punishment of death is different, Furman v. Georgia, 408 U.S. 238, 306, 92 S.Ct. 2726, 2760, 33 L.Ed.2d 346 (1972) (Stewart, J., concurring), this court has taken considerable time to reach its decision in this case and in another capital case submitted for review after this one and which is also decided today. See Harlow v. State, 2003 WY 47. Although the time to reach decision has been considerable, it has been necessary and unavoidable for the reasons stated.\n\nFACTS\n\nI. The Murders\n\n[¶4] On the night of January 20, 1997, sometime between 11:00 p.m. and midnight, Olsen entered the Little Chief Bar in Worland. He instructed two patrons to lie down on the floor and robbed the bar. After having the bartender also lay face down on the floor, he shot all three in the back of the head, firing a fourth shot seconds later when it appeared that one victim was not dead. He left the bar, went to a convenience store and pumped gas into his pickup. He chatted with the store clerk until asked if he knew why the police were active in the area. At this question, he became agitated, left, and went home and packed. Before he left his home, he confessed the murders to his mother and then fled in his vehicle. After he left, his mother called the police, told them Olsen was involved, and within a few hours, Olsen was apprehended. He was advised of his rights, and spent much of the rest of the day confessing the murders to police. Several of these confessions were recorded on audiotape and videotape.\n\nII. Events Leading Up To and Subsequent To the Murders\n\n[¶5] At approximately 4:15 p.m. on the day of the murder, Olsen's mother contacted him at RJ's Saloon where he had been drinking and requested he return home. Olsen left the bar, went home, had dinner, and left home again at 6:30 p.m. to play dart games for a dart league team. Between 7:00 p.m. and 9:00 p.m., Olsen and three others played darts at the American Legion where he consumed five or six beers. The group moved on to the Rendezvous for an hour and drank at least two more beers. By 10:00 p.m., Olsen was back at RJ's playing pool and continuing to drink. He was seen leaving RJ's around 11:30 p.m. A few minutes before midnight, Olsen pumped gas into his truck at a convenience store, paid for snacks and a coke with a fifty-dollar bill, and conducted a friendly conversation with the store clerk for several minutes, telling her that he was going to Colorado where the temperature was 56 degrees. A register receipt from that store indicated the purchase occurred at 11:54 p.m. The clerk could smell alcohol on his breath, but did not notice any drunken behavior, until, after seeing numerous police cars driving by during the evening, she asked Olsen if he knew what the cops were doing. The clerk testified that at that point, Olsen \"couldn't say 56 degrees\" and he then went to the door, apparently agitated, turned around, said \"Yes, I have been drinking,\" and walked out the door. Olsen went home at a few minutes after midnight, parked in the alley, and entered a doorway that opened directly to his room and locked the door that opened to the rest of the house.\n\n[¶6] Testifying as a wi tness for the State, Olsen's mother described the following events. Hearing him return and lock his door, his mother became concerned, and knocked on his bedroom door. He joined her in another part of the house, and the two talked until about 12:35 a.m. She returned to bed, but became aware that Olsen was packing, and arose to confront him. She saw a gun and, at that point, Olsen confessed to her he had killed three people, claiming that years earlier, while in the Marine Corps, he had accumulated a $70,000 gambling debt and still owed $17,000. He claimed that over the years, he had been constantly harassed for the money and, several years before, his fiancé had been killed because of the debt. He further claimed that he believed he had seen the man sent to collect the gambling debt in town and followed him into the Little Chief Bar, shot him, and shot what he described as two innocent people. Olsen told his mother that this man was involved in the death of his fiancé and Olsen believed that the man would try to kill Olsen's ex-wife and daughter. Olsen finished packing, loaded his truck with his belongings and the murder weapon, returned to his mother and talked about his options of either running or turning himself in. Olsen told her his third option was to kill her and his father. When she responded that he would not do that, he said there was a fourth option to which Mrs. Olsen did not respond. Olsen told his mother he was going to Colorado, and left. He called her a few minutes later on his cell phone, reporting that the police had apparently found the bodies of his victims. Mrs. Olsen, a police dispatcher, then contacted police and turned in her son.\n\n[¶7] The State's direct examination of Mrs. Olsen at trial disclosed that in 1990 she had learned that her son had been engaged to a girl who had died in a car accident. She had run a driver's license check on Olsen's fiancé that indicated that the license had expired and not been renewed. In her continued direct examination, Mrs. Olsen disclosed that on the night of the murders she believed Olsen was intoxicated, agitated, and was slurring his speech. She also disclosed during her direct examination, that in March of 1993, Olsen suffered an aneurysm that she believed changed his disposition. On the night of the murders, Olsen had taken a relatively new drug to control seizures. Apparently, Olsen's heavy drinking after his aneurysm ruptured had caused him to suffer seizures.\n\n[¶8] A customer discovered the three bodies at the Little Chief Bar at 12:05 a.m. and reported the discovery to the police. The police were investigating the crime when Mrs. Olsen reported to police that her son had confessed committing the crime to her. Worland police issued a teletype identifying Olsen as the suspect in the triple homicide and describing his vehicle. Instead of heading to Colorado, as he had told his mother, Olsen traveled east. At 4:20 a.m., he was spotted as he drove through Buffalo, Wyoming. The officer followed him for a considerable distance as other officers positioned themselves for an arrest, and did not notice erratic driving by Olsen, but did notice Olsen was driving slowly and drifting onto the shoulder of the highway, both of which are indicators of drunk driving. Olsen was stopped and arrested without incident. A gun, later identified as the murder weapon, was in plain view in Olsen's vehicle. The arresting officer read Olsen his Miranda rights, placed him in the back of the patrol car and waited at the arrest site for the arrival of an agent from the Wyoming Division of Criminal Investigation (DCI). During the half-hour wait, he and Olsen engaged in a conversation that the officer recorded on an audiocassette. Olsen repeated his gambling debt story and stated he had shot three people in the head.\n\n[¶9] Olsen was taken to Buffalo and interrogated by DCI Agent Kevin Hughes during the drive. That recorded interview was conducted at 5:10 a.m. and Olsen again repeated his gambling debt story. During a recorded interview conducted at 7:05 a.m. at the Buffalo judicial center, Olsen claimed that he did not remember confessing to his mother or telling the gambling debt story, continued to admit that he had shot three people in the back of the head, but now explained that his motive for killing them was fright and intoxication. During a recorded interview conducted at 8:40 a.m., Olsen detailed his actions before the robbery, stating that he had parked on the side street of the Little Chief Bar, had locked his vehicle to prevent the stealing of his cell phone, entered the bar and observed the two customers and one bartender, proceeded directly to the restroom and, after using it, returned to the bar with his gun drawn. He placed the two male customers on the floor on their stomachs. He ordered the bartender to place money in a sack and then placed her on the floor next to the two customers. He then shot each of them in the back of the head, firing three shots. He claimed that he had not planned the robbery, did not remember the actual shootings, and had no motive for the murders other than drunkenness. Agent Hughes testified that, on the afternoon of the January 21, he returned Olsen to Worland. During that drive, Olsen provided more details in an unrecorded conversation. Olsen told Hughes that when he ordered the bartender to give him all the money, she \"bitched at him, and said, 'you are not going to get away with this.'\" Other than this statement, none of the three victims resisted him in any way. Hughes testified that Olsen told him during this unrecorded statement that the bartender's words scared him as he realized that the people could identify him, and he shot them. Olsen also told Hughes that he needed money because he was two months behind on his child support and because the rings were going out in his pickup. Olsen stated that after the robbery and before entering the convenience store, he had placed part of the robbery money in his wallet and part of it in the sun visor of his vehicle and used a $50 bill to pay for gasoline, coke and snacks at the store.\n\n[¶10] The arresting officer, a certified Intoximeter operator, gave Olsen two Intoximeter tests, one at 7:33 a.m. which read .063 alcohol concentration, and another at 7:34 which read .061 alcohol concentration. Olsen consented to blood and urine tests that were conducted at 9:00 a.m. on the morning of January 21. Olsen's truck was towed to Buffalo and searched after a warrant issued later that morning. Olsen was videotaped between 11:00 a.m. and 1:30 p.m. on the day of January 21 identifying the money stolen and other items found in his truck. Later that afternoon, Olsen requested a lawyer, and the interrogations ceased.\n\n[¶11] Counsel was appointed to defend Olsen, and charges were filed. The State filed notice that it would seek the death penalty. Pretrial rulings permitted the state prosecutor to have the assistance of a United States attorney at trial. Hearings were held on Olsen's motion to suppress his statements to police and the evidence seized from his truck on grounds that he was too intoxicated to have voluntarily consented to the search. That motion was denied. Olsen also moved to suppress statements made on the afternoon of January 21 following equivocal statements about needing an attorney. That motion was also denied when the trial court found that all questioning ceased after Olsen explicitly requested an attorney. Before trial, Olsen's mental health was examined by doctors, including a Dr. Gummow, who indicated that Olsen suffered from brain damage. The State filed a pretrial motion demanding to know whether Olsen would be changing his plea of not guilty to a plea of not guilty by reason of mental defect. During the hearing on the motion, defense counsel did not change the plea but reserved the right to do so should an expected final report indicate the necessity. Ultimately, Olsen did not change his plea.\n\nIII. Prosecution's Case\n\n[¶12] Appointed defense counsel filed numerous pretrial motions concerning both the guilt and sentencing phases of the trial, and several hearings were conducted in July and August. Defense counsel secured a continuing objection to the denial of its motions. Pretrial rulings rejected the idea of separate juries for the bifurcated proceeding, and on August 25, 1997, voir dire began that incorporated death qualification of the panel. Voir dire lasted four days. Voir dire ended when defense counsel agreed to fewer peremptory challenges; the trial court did not record the parties' peremptory challenges.\n\n[¶13] At trial, other than the witnesses who testified about Olsen's actions before the murders, the prosecution presented the testimony of investigating officers at the crime scene; Olsen's mother about her son's actions and statements that night; a witness claiming to have seen Olsen observing the Little Chief Bar days before the robbery; and Olsen's recorded interviews with the arresting officer and DCI agents. Forensic evidence established that all three victims had been found in a prone, face-down position and shot at least once in the back of the head. All had died from gunshot wounds. There were indications that one victim had attempted to get up and was shot a second time, meaning that Olsen had fired a total of four shots. Another victim had a foot imprint on his back, indicating that Olsen may have braced himself during the shootings. Diagrams of the bar were displayed, and the prosecution later argued that they showed that Olsen had threaded his way through tables and chairs to reach the victims, although before doing so he was standing by a sliding glass door exit. The bartender's teenage daughter had been asleep in the home attached to her mother's work establishment and testified that she heard three loud noises in rapid succession followed by a fourth noise a few seconds later between 11:15 p.m. and midnight. The murder weapon, money from the robbery, and receipts dated between January 6th and 8th were recovered from Olsen's vehicle after his arrest. The bartender, Emma McCoid, was thirty-six years old when she died. The customers killed that night were Kyle Baumstarck, twenty-six years old, and Arthur Taylor, forty-seven years old.\n\nIV. Defense Case\n\n[¶14] During his voir dire opening statements, defense counsel told the prospective juror panel that Olsen admitted his guilt, and the single issue before them was whether he had committed first degree murder or second degree murder. Defense counsel explained that intoxication was a defense to first degree murder, and he intended to show that Olsen did not premeditate the murders. In pretrial rulings, the trial court indicated that it intended to qualify forty-five prospective jurors and permit each side fifteen peremptories. On August 29, thirty-five jurors had been qualified and both sides agreed to forego additional voir dire and exercise ten peremptory challenges. Olsen is on record as approving this strategy.\n\n[¶15] Through cross-examination of State witnesses, the defense established that Olsen had been drinking heavily the day of the robbery and murders, and, despite his many confessions, did not admit planning either the robbery or the murders. It was established that after Olsen left the last bar before the crime, he had nothing else to drink, showing that his intoxication level remained high almost eight hours since he had last had a drink. He had consistently claimed that his only motive was fright and intoxication. After the State rested, the defense moved for judgment of acquittal which the trial court denied.\n\n[¶16] The defense presented witnesses who testified that on the night of the crime Olsen's eyes were strange and he was very intoxicated. The defense introduced dart game score sheets, which the State conceded in closing arguments indicated that Olsen did not play very well that night. Other witnesses testified they had observed Olsen drinking far more than what prosecution witnesses had observed; and another defense witness testified to seeing Olsen driving erratically on the night of the crime. The defense presented a forensic toxicologist, extrapolating that, based on Olsen's level of intoxication over seven hours after his last drink, his level of intoxication at the time of the crime could have been as high as .37 and was probably no lower than .106. This expert explained the correlation between levels of intoxication and effect on cognitive ability. Before the defense presented its final witness, Olsen, the trial judge, and counsel met out of the presence of the jury and recorded Olsen's waiving his right to testify. At that time, defense counsel placed on the record Olsen's concern that Dr. Gummow had not been called to testify during the defense's case-in-chief and his statement that he agreed with the decision not to call her during the guilt phase of his trial.\n\n[¶17] The last defense witness, Olsen's mother, testified to establish that on the days he had been observed watching the Little Chief Bar, he was in Colorado. The defense rested, and the State did not offer any rebuttal evidence. Before closing arguments and out of the presence of the jury, Olsen, counsel, and the trial judge met to record defense objections to a number of jury instructions.\n\nV. Closing Arguments\n\n[¶18] The instructions were read to the jury and included instructions on first degree murder, felony murder, second degree murder, aggravated robbery, simple robbery, and larceny. The State delivered its closing argument, explaining the verdict form and the lesser included offenses. In its theory of the case, the State argued to the jury that the issue really is, \"was it done on purpose, purposely, the act done intentionally or deliberately, and not accidentally.\" The State argued that, in the time period immediately preceding the robbery and during the robbery, Olsen's actions were a series of deliberate acts that proved the robbery and murders were premeditated, and not the result of a \"drunken, drug-crazed, brain-damaged guy.\" It also argued that the manner in which Olsen carried out the murders proved premeditation, rather than accident. In addressing the defense's forensic toxicology evidence, the State pointed out that the defens e expert had not personally observed Olsen's behavior that night, and the observations of those who had personally observed it did not support the expert's conclusions that Olsen did not know what he was doing that night or was incapable of forming intent. The State argued that Olsen's gambling debt story and other actions when confronted by his mother and police were not indicative of intoxication or alcoholic amnesia, but showed that Olsen remembered what had happened that night and consciously decided to deal with it and provide an explanation for his behavior.\n\n[¶19] In its closing argument, the defense contended that the eyewitness testimony established that Olsen was intoxicated on the night of the crime. Regarding the eyewitness who claimed to have seen Olsen suspiciously observing the Little Chief Bar days before the robbery, the defense pointed out that his story was inconsistent between his police interview and his testimony, pointed out that the vehicles he described Olsen sitting in did not exist, argued that the motel and pawn shop receipts and Mrs. Olsen's testimony established that Olsen was in Colorado on the dates he was allegedly seen, and argued that the witness had not seen Olsen. Moving to the forensic toxicologist's testimony concerning the effect of alcohol on a person, defense counsel noted that Olsen's actions and statements that night were consistent with someone who behaved as though very intoxicated and whose behavior changed with sobriety. Under the defense's theory, Olsen told his gambling debt story while very intoxicated and, after sobering for many hours, forgot about it in a manner consistent with the expert's testimony. The defense also pointed out that the jury had been instructed that intoxication can negate specific intent, and because the unrefuted expert testimony established Olsen's intoxication level, the State had not proved Olsen's intent beyond a reasonable doubt. The defense ended by asking the jury for a verdict of second degree murder.\n\n[¶20] In a very brief rebuttal, the State reminded the jury that the defense's expert made assumptions which did not preclude them from deciding that Olsen formed the specific intent to kill. The State also reminded the jury that later that same night when Olsen was just as intoxicated, Olsen considered killing his parents and made the decision that he would not do so.\n\n[¶21] The trial judge then had three names selected from the jury to serve as alternates. The remaining jurors retired to deliberate, ultimately returning a verdict finding Olsen guilty of three counts of premeditated, first degree murder, three counts of first degree felony murder, and one count of aggravated robbery. The jury was polled, confirmed their verdict, and was then excused for the weekend with instructions to return the following Monday prepared for sequestration.\n\nVI. Sentencing Phase\n\n[¶22] The sentencing phase began with an opening instruction to the jurors, explaining their duty in a death penalty sentencing hearing. In its opening statement, the State touched upon the gravity of the jury's task, and then discussed the five statutory aggravating circumstances it would prove beyond a reasonable doubt:\n\n1) Olsen knowingly created a great risk of death to two or more people;\n\n2) the murders were committed for the purpose of avoiding or preventing a lawful arrest;\n\n3) the murders were especially atrocious or cruel, being unnecessarily torturous to the victims;\n\n4) Olsen poses a substantial and continuing threat of future dangerousness or is likely to commit continued acts of criminal violence; and\n\n5) Olsen committed first degree murder while engaged in committing a robbery.\n\nThe State informed the jury that the law required it to consider the nature of the crime and the individual characteristics of Olsen and arrive at a moral decision of whether the penalty should be life imprisonment or death.\n\n[¶23] In its opening statement, the defense also spoke to the jury concerning the moral aspect of its decision. Previewing its mitigating evidence, defense counsel discussed Olsen's brain malformation that had existed since birth, and how, during the malformation's development, it had deprived areas of Olsen's brain of blood. Defense counsel stated that an expert neurologist, a neuropsychologist, and a psychiatrist would discuss the brain malformation and its various effects such as causing Olsen's intellectual level to decline during school, and altering his behavior in his late teens until the aneurysm ruptured in 1993. The defense evidence would show that after the rupture, the brain injury and Olsen's alcoholism and depression prevented him from having the capacity to conform his conduct to the requirements of the law. Defense counsel stated that he would present other statutory mitigating circumstances for the jury's consideration.\n\n[¶24] During the State's case-in-chief of the sentencing phase, witnesses described Olsen's previous misconduct involving guns. Olsen's former brother-in-law testified that in 1996 Olsen had stolen several items from him, including a rifle and a handgun that was identified as the murder weapon. A former bartender testified that in 1995, Olsen showed her a handgun and pointed it at her. She became angry and ordered him to put it away and leave the bar, which he did. She did not report the incident to po lice and admitted that she did not like Olsen because he had made sexual advances to her. Another witness testified that in 1990, he and Olsen had become involved in a physical altercation. Olsen got in his car and pointed a handgun at him but put the weapon down when the witness told him to. The witness pulled Olsen from the car and struck him a couple of times. Olsen then got back in his car and left. The witness did not report the incident to police and volunteered the information shortly before jury selection.\n\n[¶25] The sheriff of Sheridan County testified that Olsen had been arrested for impersonating a federal officer and possession of a handgun without a permit in May of 1991. Olsen was playing pool in a bar wearing a large gun in a shoulder holster and had told a bartender that he was a federal agent and, later, a DCI agent. The manager called police, and Olsen was arrested. The next witness testified that, six years earlier, he and Olsen belonged to a shooting club whose members would shoot pistols on Wednesday afternoons. On at least two occasions after Olsen became upset at missing shots, and when others teased him, he threatened to shoot them. Those threatened confiscated his gun. Everyone involved had drunk about a six-pack of beer each, and the gun was never pointed at anyone. The witness considered Olsen a loyal, but strange, friend who had very few friends. Another witness testified that six years earlier an intoxicated Olsen disrupted a party after a wedding by fighting with the witness. Olsen was asked to leave because he was wearing a gun in a holster and made remarks that he could shoot somebody at any time. He did not remove the gun during the fight, and it was taken away from him.\n\n[¶26] During testimony, the trial court learned that a juror's father had died and released that juror from sequestration. The trial court proposed to select a juror from one of the alternates at the end of the sentencing phase. The defense objected because the alternate had not been part of the guilt phase deliberations and objected to the court's proposed method of selection. The court released the juror from sequestration, denied Olsen's motion for a mistrial, and following closing arguments, selected an alternate juror by a lottery system,.\n\n[¶27] Testimony resumed, and the State called DCI agent, Hughes. He testified that in unrecorded conversations with Olsen, Olsen told him that, after the robbery and murders, he planned to kill any officer who tried to stop him, but when he saw five or six converge on him, he surrendered. In Hughes' opinion, it was an irrational and ridiculous statement from a suspect who was otherwise cooperative. Hughes testified that Olsen stated later that same day, that he did not remember making that statement and, on numerous occasions, Olsen claimed that he did not remember saying something that he had said a little while previously. Hughes believed Olsen was sincere in his belief that he did not remember.\n\n[¶28] The State next called the director for the Victims of Violence Center who read a statement from the mother of victim Emma McCoid, identified photographs of the three victims, and then read a statement about victim Art Taylor prepared by his ex-wife. Victim Kyle Baumstarck's mother then read a statement that she had prepared.\n\n[¶29] The State called a Marine officer to testify that Olsen had been court-martialed while in the Marines and escaped from the brig. Defense cross-examination revealed that the brig was not guarded, and, although the Marines had brigs which operated like a jail, Olsen was not placed in one. The next State witness testified that Olsen was never at the brig, but confined to a barracks, and Olsen's escape consisted of him going out of his bedroom window to a hotel where he met a girl, and was found watching TV.\n\n[¶30] Because of scheduling problems, the court allowed the defense to interrupt the State's case-in-chief on two occasions. Defense counsel called Olsen's father who testified that he left when Olsen was three when he and Olsen's mother divorced; he saw Olsen twice after the divorce; had his parental rights terminated when Olsen was eight years old; and had no further contact with his son until Olsen was twenty-two. Olsen's mother remarried, and Olsen and his sister were adopted by his stepfather. His family now also included one half-sister, who is afflicted with cerebral palsy, and three stepsiblings. Olsen's stepfather described Olsen as a happy, good child, never in legal trouble, who once saved his sister's life, but became an alcoholic after joining the Marines. Later, after Olsen suffered the aneurysm, he observed him to stammer, slur his speech and saw a change in his demeanor. Although medical doctors advised Olsen against drinking, Olsen's alcoholism actually worsened, and one time he was drinking so heavily he suffered a seizure and required medical attention. His stepfather witnessed that he was very depressed, was impulsive, self-destructive and violent, and his marriage ended in an acrimonious divorce. On cross-examination, the State pointed out that the stepfather had previously stated to DCI agents that, as a child, Olsen was a perfectionist, frequently frustrated. He did not remember stating that Olsen's temper disappeared after the ruptured aneurysm.\n\n[¶31] Olsen's grandfather described Olsen's close relationship with his grandparents and the care he gave them when they were ill. Next, the defense called the mitigation specialist, Mary Goody, who read an affidavit from a friend who served with Olsen in the Marines, and who was now a campus police officer. The friend described Olsen as a heavy drinker, immature, self-destructive, unstable and often depressed. He believed that Olsen had personality and mental health issues that caused problems from which this friend and others tried to protect Olsen. He described Olsen as a loyal friend. Another friend who served in the Marines with Olsen beginning in 1988 agreed that he was a good, loyal friend, often unstable and depressed, and when drinking, was irrational, impulsive and would act without thinking. This friend described several instances when Olsen's self-destructive behavior was outrageous, such as throwing his car keys after an accident, and breaking the windshield and kicking out lights and the fender of his own car after receiving a traffic ticket.\n\n[¶32] The defense presented several experts. Dr. Charles McMahon, a neurology expert, had performed an MRI scan and an electroencephalogram on Olsen and examined other CT and MRI scans and medical reports performed on Olsen since 1993. These computer-generated medical diagnostic images indicated an arteriovenous malformation (AVM), a congenital, organic condition, abnormal because it causes Steal's Syndrome by draining blood from an artery to a vein without supplying any useful part of the brain that the blood vessel would normally supply. Dr. McMahon testified that AVM can impair cognitive functions of the brain if the adjacent area of the brain cannot function properly because it has been deprived of blood. He produced medical reports showing that Olsen's AVM rupture and hemorrhaging basically caused a stroke, and the jury was shown the 1993 CT scans depicting brain injury.\n\n[¶33] The evidence revealed that, immediately after the rupture, Olsen was comatose and required a surgical procedure to remove the AVM. He was hospitalized for several weeks, suffered extensive loss of the right side of his body, could not speak and had emotional control problems in the hospital. Before rehabilitation was cut short by lack of insurance, Olsen received speech, physical, and occupational therapies and was seen by a psychiatrist and a psychologist. He was not allowed to drive or be alone with his daughter. The hemorrhaging and AVM permanently injured Olsen's brain. The part of his brain that was injured, the corpus callosum, is the structure that carries messages from one hemisphere to the other.\n\n[¶34] As part of his neurological examination, Dr. McMahon tested Olsen for concrete thinking abilities and determined that Olsen performed deficiently because of permanent injuries to the brain. The State's cross-examination revealed the possibility that Olsen's deficient performance was due to chronic alcoholism. Dr. McMahon believes that an I.Q. greater than seventy is normal intelligence but did not test Olsen's intelligence. He stated that an AVM can be diagnosed before rupture because it causes mental deficits before bursting.\n\n[¶35] The next defense expert, Dr. Linda Gummow, a psychologist specializing in neuropsychology, with publications on stroke, cognitive rehabilitation, and the effects of injury on behavior, gave Olsen neuropsychological examinations in February and August of 1997. Reviewing other tests, Dr. Gummow learned that Olsen suffered a steady decline in overall ability beginning in his early elementary years, a gradual decline through his high school years with a sharper decline after the AVM rupture. School records indicated that Olsen had no behavioral problems, was a cooperative, motivated and good student and did not have any legal difficulties. Gummow determined that the decline was primarily due to the AVM brain injury becoming symptomatic as the brain was injured from abnormal circulation and oxygen deprivation over a period of years. She also identified external factors such as Olsen's moving from Portland, Oregon, to Worland as contributing to the decline. Test scores in August improved, and Gummow attributed this to alcoholism recovery. She determined that Olsen suffered from severe depression and anxiety, attributable to the brain injury and alcohol.\n\n[¶36] Dr. Gummow testified that Olsen's first problems involving the legal system occurred in the military. The Marine Corps identified him as an alcoholic with a death wish. At that time, his personality and demeanor began to change from cheerful and witty to the beginnings of a loner with bad judgment and unpredictably physically violent. She believed that external factors and the increasingly symptomatic AVM caused the change.\n\n[¶37] After the rupture, Olsen's alcoholism, reckless behavior, numerous accidents, and mood swings continued. After the rupture, no further reports that Olsen was a witty, cheerful, and bright person were found. Instead, Olsen was observed to be a quiet, reserved person, difficult to communicate with and viewed by some people as scary. She found reports that Olsen did not understand that he generated fear and did not always remember his actions. Alcohol began to dominate his life, affecting him in ways already impacted by the AVM and its rupture.\n\n[¶38] Dr. Gummow testified that individuals with brain injuries are more prone to accidents. Olsen was in numerous car accidents, rollovers, broadside accidents, and industrial accidents. Dr. Gummow listed a number of stresses Olsen was experiencing at the time of the crime. Because of these and the brain injury that was affecting him throughout, it was her opinion that he was suffering from extreme mental or emotional disturbance. She also classified the brain injury itself as a mental or emotional disturbance that impacted judgment and caused impulsivity and explosive anger. She testified she believed that on the night of the murders, he realized the criminality of what he was doing, but duress caused him to be unable to conform his conduct to the requirements of the law. She also believed that Olsen was no longer dangerous because alcohol had been removed from his life.\n\n[¶39] Upon cross-examination, the State established that Olsen's reading and math scores had not changed since the military, indicated individual scores that did not show a trend of decline, and pointed to scores that were high for anti-social behavior, anger, passive -aggressiveness, and some type of borderline schizophrenia. Olsen had admitted to Dr. Gummow that he remembered shooting the victims. Dr. Gummow did not know if Olsen could have conformed his conduct to the requirements of the law if he had seen a police officer before the shootings. She did not base her opinion on the facts of this case, although she believed some are consistent with her opinion. Concerning her opinion that Olsen exhibited features of hemispheric disconnection syndrome, an inability to integrate experience with emotion, inability to plan and synthesize cognitive information, and inability to plan and organize, Dr. Gummow conceded that she had not considered Olsen's prior misconduct with weapons. The State also questioned Dr. Gummow as to whether she had rendered other opinions in court cases without having relevant facts.\n\n[¶40] Upon redirect, Dr. Gummow provided further information regarding other court cases, clarifying that a judge had decided differently about another defendant's competency to stand trial. She stated that Olsen does not have an anti-social personality, and discounted the notion that Olsen's memory of the events of that night indicates that he is lying when he does not remember some parts of it.\n\n[¶41] The defense's next expert witness, Dr. William S. Logan, a medical doctor and a forensic psychiatrist, examined Olsen in June of 1997. Dr. Logan testified that he reviewed Olsen's history and found that he had an astounding number of accidents, heavy alcohol consumption, and shortly after suffering the AVM rupture, began engaging in reckless, impulsive behavior. Dr. Logan described the many different ways that Olsen's life deteriorated after the AVM rupture. He concurred with Dr. Gummow's opinion that Olsen's brain injury caused his thinking to be divorced from his emotions; becoming overwhelmed emotionally and unable to coordinate that with problem-solving. He stated that Olsen has neither an anti-social personality nor a narcissistic personality.\n\n[¶42] In Dr. Logan's opinion, there was no question that Olsen had planned the robbery of the Little Chief Bar; however, drinking, depression, and the head injury caused him to be under the influence of extreme me ntal or emotional disturbance at the time of the homicides. He agreed with Dr. Gummow that Olsen knew that what he was doing on the night of the murders was wrong, agreed that at one level, Olsen had control of his behavior that night, but did not have control of his behavior in terms of using some kind of judgment or in reacting in a more rational way to his desperation. Dr. Logan believed Olsen presented no future danger. Olsen's former employer testified that he was a good employee. Olsen made a statement in allocution, and the defense's final witness was Olsen's mother, who made a plea for his life.\n\n[¶43] In rebuttal, the State presented its own forensic psychiatrist, Dr. Breck LeBegue. The defense objected to his expert testimony because he had not examined Olsen. This expert testified that the most reliable test of how brain-damaged someone is following an AVM rupture is comparing demonstrated abilities before and demonstrated abilities afterwards, and opined that poor performance on a test cannot alone lead to a diagnosis of brain abnormality. On defense counsel's cross-examination, Dr. LeBegue stated that he was not board certified in neuropsychology, but conceded that, as a psychologist, he administered tests to evaluate and conceded that a number of tests listed by defense were standard neuropsychological tests.\n\n[¶44] Next, the State presented Dr. Marcus Einhorn, a psychologist. The defense objected to his expert testimony because he was not board-certified in neuropsychology. This expert testified only to the fact that poor performance on the Halstead Reitan battery test might not be attributable to brain damage. On cross-examination, the defense simply asked if he were testifying about one test and asked nothing further.\n\n[¶45] The State then called Dr. Stephen Golding, a forensic psychologist. The defense objected to him because he was not an expert in neuropsychology. He testified that a \"gap,\" i.e., whether a mental deficit impacted abilities at a particularly relevant point in time, cannot be determined simply by testing; one must have direct observation. The defense did not cross-examine.\n\n[¶46] At the conclusion of the evidence, the defense made numerous objections to the court's rejection of its proposed jury instructions and verdict form, and objected to the jury instructions and verdict form that were given by the trial court.\n\n[¶47] In closing argument, the prosecutor stated:\n\nNothing is a fact in this case unless you decide it is. Just because somebody said something does not make it a fact. . . . You can reject anything anyone said if you don't believe that they were credible. . . . [N]ow for the first time the defense has a burden of proof as to the mitigating circumstances. They have to prove that something is more likely than not or more probable than not, or 51 percent on each mitigating circumstance. Hold them to that burden of proving that something is mitigating. Just because somebody says it is, doesn't mean it's proven. You need to consider the evidence, all of the evidence . . . in mitigation. You have to consider it, you have to think about it, you have to discuss it.\n\nExplaining that the jury must consider mitigating circumstances and aggravating circumstances to arrive at a reasoned moral judgment, the prosecutor cautioned the jury that non-statutory aggravating evidence can only be considered in rebutting mitigating evidence.\n\n[¶48] The prosecutor argued that these murders were no accident or mistake because the evidence showed that Olsen placed the gun directly against a skull and shot, and because defendant left a footprint on the back of one victim as he positioned himself to shoot another victim. The State argued that defendant's motive was to kill witnesses to avoid going to jail, and argued that Olsen made decisions and choices based on a selfish and violent character, rather than due to any inabilities caused by brain damage. The prosecutor then listed every decision it contended Olsen made on the night of the murders. The prosecutor argued that defense experts' opinions on Olsen's decision making that night were not credible because the defense experts did not rely on the decisions actually made by Olsen. The prosecutor claimed that Olsen demonstrated his ability to function at the time in question by planning a robbery, deliberately murdering witnesses, leaving the crime scene, and then purchasing, rather than stealing, gas, which proved he could conform his actions to the law, then packing, and fleeing. The prosecutor argued that the jury could reasonably conclude that Olsen was functioning because he made too many decisions, and he remembered making those decisions.\n\n[¶49] The prosecution pointed out that defense experts had admitted that Olsen knew his actions were wrong and argued that credible forensic experts would not have ignored Olsen's behavior on that day. The prosecutor argued that testing Olsen a month after the murders while jailed was unreliable, inappropriate testing that had produced unreliable results. The prosecutor contended that the defense experts were over dramatizing the fact that Olsen was accident-prone and those experts had manipulated the testing to show that his test scores trended in a decline, claiming that Olsen's scores were college-level. The State also contended that the facts disproved AVM brain damage because Olsen's condition improved while denied alcohol in jail. The State concluded by arguing that \"this case is too terrible, too tragic, for any lesser penalty than the maximum. . . . There is absolutely no mitigating this.\"\n\n[¶50] Defense counsel stated that the person before the jury today was a different man from what he had once been and this second Olsen \"lost [his values]. . . . He committed one of the most atrocious acts that we can conceive of\" but was worth saving. Defense counsel explained that mitigating circumstances are the circumstances about his character that would serve to lessen his sentence. He argued that by imposing three life sentences on Olsen, the jury was assured that he would never be released from prison and that a death sentence is never required; the defense had presented mitigating evidence that demanded those life sentences, and it was the appropriate moral response. Defense counsel then described what Olsen's life would be like if imprisoned for life.\n\n[¶51] The defense pointed out that it had not used the experts to say that Olsen was insane or to try to excuse or to justify what he did, but these experts did testify that mitigating circumstances existed and the death penalty was not warranted. He argued that the State was wrong that the experts had ignored facts from that evening or that the experts could not be believed. All of Olsen's actions on the night of the murders were explained to be the result of the combined effect of his brain injury, alcoholism, and depression that left Olsen unable to conform his behavior to the requirements of the law. Defense counsel listed the mitigating circumstances that were unrefutedly established by the evidence:\n\n1. Unrefuted that he is loved by his family.\n\n2. Unrefuted that he is a loving father.\n\n3. Unrefuted about AVM.\n\n4. Unrefuted that his intelligence has declined to low average.\n\n5. Unrefuted that he is a model prisoner, unrefuted that he is not future dangerous.\n\n6. Unrefuted that he is loyal to his friends.\n\n7. Unrefuted that he had a high level of alcohol in his system at the time of the offense.\n\n8. Unrefuted that he is young.\n\n9. Unrefuted that he saved his sister's life.\n\n10. Unrefuted that his capacity to conform his conduct to the requirements of the law was substantially impaired.\n\n11. Unrefuted that he was under the influence of extreme or emotional disturbance.\n\n12. Unrefuted that he cooperated and confessed and has the ability to be constructive in prison.\n\n13. Unrefuted that he was self-destructive and suffering from marital problems and depressed.\n\n14. Unrefuted that this was only a robbery, not other crimes.\n\n15. Debatable whether he had a significant criminal history, but nothing as a youth and no felony convictions.\n\nExplaining that mitigating evidence means that the jury does not have to impose death, defense counsel provided the jury with this definition:\n\nIt all boils down to after you look at the mitigation, after you look at the aggravation, to this very simple question that Mr. Green asked of Dr. Logan. I have the exact wording of that because I have the page of this transcript so I can go to it. It all boils down to this very simple question, this very simple answer. The question by Mr. Green:\n\n\"Q: But your considerations might also not have any bearing at all on what really happened that night; would you agree with that?\" Logan's answer:\n\n\"A: Well, I don't think he would have robbed that store if he wasn't depressed, and if he wasn't drinking, and if he hadn't had the head injury. But if you remove all three of those things, I don't think he would have been there that night.\"\n\nLadies and gentlemen, that's mitigation. It doesn't excuse it, it doesn't justify it, but certainly, ladies and gentlemen, it argues very strongly in favor of a life sentence.\n\n[¶52] In the State's rebuttal, it argued that many of these unrefuted mitigating facts did not lessen Olsen's blame for the murders. Concerning the expert testimony that he did not have the capacity to conform his conduct to the requirements of the law, the prosecutor argued that the real test was Olsen's \"demonstrated capability\" based upon what he did and not upon expert testimony.\n\n[¶53] The jury was instructed on five statutory aggravating factors, including\n\n1) Olsen created a great risk of death to two or more persons;\n\n2) the murders were committed for the purpose of avoiding or preventing a lawful arrest;\n\n3) the murders were especially atrocious or cruel, being unnecessarily torturous to the victims;\n\n4) Olsen posed a substantial and continuing threat of future dangerousness or was likely to commit continued acts of criminal violence; and\n\n5) Olsen killed another human being purposely and with premeditated malice and while engaged in the commission of a robbery.\n\nThe trial court instructed the jury that\n\natrocious means outrageously wicked and vile; cruel means designed to inflict a high degree of pain with utter indifference to, or even enjoyment of, the suffering of others. What is intended to be included in this circumstance are those murders where the actual commission of the crime was accompanied by such additional acts of serious physical or mental abuse of the victims as to set it apart from the normal first degree murder; that is, a particularly consciousless [sic] or pitiless crime which is unnecessarily torturous to the victims.\n\nTorture may mean extreme mental anguish or distress. In finding mental anguish or distress you may consider the victims' uncertainty as to his or her ultimate fate immediately prior to their deaths.\n\nThe jury was also instructed on twenty-one mitigating factors and told it could unanimously find that a mitigating circumstance existed; could unanimously find that a mitigating circumstance did not exist; or an individual juror could find that a mitigating circumstance existed. The jury was also instructed that either the jury unanimously or a juror individually could write in a mitigating circumstance found to exist which was not listed on the verdict form.\n\n[¶54] During deliberations, the jury asked whether Olsen would ever have a chance for parole for any possible reason or reasons if sentenced to three life terms. The court instructed the jury that executive clemency would exist for Olsen. Defense counsel objected to the instruction and requested that the jury be instructed as to the laws of parole, that in Wyoming, one serving a life sentence is not eligible for parole. The trial court overruled the objection.\n\n[¶55] The jury returned a verdict finding that, for each victim, the following statutory aggravating circumstances existed beyond a reasonable doubt:\n\n1) Olsen created a great risk of death to two or more persons;\n\n2) the murders were committed for the purpose of avoiding or preventing a lawful arrest;\n\n3) the murders were especially atrocious or cruel, being unnecessarily torturous to the victims;\n\n4) Olsen killed another human being purposely and with premeditated malice and while engaged in the commission of a robbery.\n\n[¶56] The jury found that no mitigating circumstances were unanimously found to exist by a preponderance of the evidence. Individual jurors did find that two of the listed mitigating circumstances existed, and individual jurors wrote in six other mitigating circumstances found to exist that were not listed on the verdict form. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The jury sentenced Olsen to death for each of the three murders. After resolving numerous post-trial motions, the trial court entered a judgment and sentence of death. This direct appeal followed.\n\nDISCUSSION\n\nI. Standard of Review\n\n[¶57] The qualitative difference between a death sentence and all other punishments requires a correspondingly higher level of reliability. Johnson v. Mississippi, 486 U.S. 578, 584, 108 S.Ct. 1981, 1986, 100 L.Ed.2d 575 (1988); see also Engberg v. Meyer, 820 P.2d 70, 86 (Wyo. 1991). Capital sentencing determinations are therefore subject to our heightened scrutiny of all issues under the usual standards of review. See Engberg, 820 P.2d at 86. The rigorous review of all alleged trial and structural error properly lies with the particular state's court of highest authority because later proceedings are limited to review of constitutional error. See Kyles v. Whitley, 514 U.S. 419, 422, 115 S. Ct. 1555, 1560, 131 L. Ed. 2d 490 (1995); and id. at 457, 115 S. Ct. at 1577 (Scalia, J., dissenting). We are r equired to make an independent review as provided in Wyo. Stat. Ann. § 6-2-103 (Michie 1997) (emphasis added):\n\n(a) The judgment of conviction and sentence of death is subject to automatic review by the Supreme Court of Wyoming within one hundred twenty (120) days after certification by the sentencing court of the entire record, unless the time is extended for an additional period not to exceed sixty (60) days by the supreme court for good cause shown. Such review by the supreme court shall have priority over all other cases.\n\n(b) Within ten (10) days after receiving the transcript, the clerk of the trial court shall transmit the entire record and transcript to the supreme court of Wyoming together with a notice prepared by the clerk and a report prepared by the trial judge. The notice shall set forth the title and docket number of the case, the name of the defendant and the name and address of his attorney, a statement of the judgment, the crime and punishment prescribed. The report shall be in the form of a standard questionnaire prepared and supplied by the supreme court of Wyoming.\n\n(c) The Supreme Court of Wyoming shall consider the punishment as well as any errors enumerated by way of appeal.\n\n(d) With regard to the sentence, the court shall determine if:\n\n(i) The sentence of death was imposed under the influence of passion, prejudice or any other arbitrary factor;\n\n(ii) The evidence supports the jury's or judge's finding of an aggravating circumstance as enumerated in W.S. 6-2-102 and mitigating circumstances.\n\n(iii) Repealed by Laws 1989, ch. 171, § 2. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\n(e) In addition to its authority regarding correction of errors, the court, with regard to review of death sentences, may:\n\n(i) Affirm the sentence of death;\n\n(ii) Set the sentence aside and impose a sentence of life imprisonment; or\n\n(iii) Set the sentence aside and remand the case for resentencing.\n\nII. Guilt Phase\n\nA. Special Prosecutor\n\n[¶58] In his first issue concerning the guilt phase of his trial, Olsen contends that the State's use of a federal prosecutor as a special prosecutor in his state trial confused and impermissibly influenced the jury. He contends that the jury was led to believe that the United States government had a special interest in prosecuting and executing him, resulting in an unfair trial against him. He also contends that the federal prosecutor's involvement violated the prohibition in Wyo. Const. Art. 6, § 19 against federal officials simultaneously holding a state position to which salary, fees or perquisites are attached. The State contends that neither the record nor the law supports these claims.\n\n[¶59] Before trial, Olsen's counsel filed a motion to disqualify the special prosecutor, claiming his due process rights would be violated by the prosecutorial overmatch of his counsel and raising the state constitutional issue. The trial court denied his motion and permitted his continuing objection to the participation of the special prosecutor. This issue presents a question of law. Questions of law are reviewed de novo, and rulings in accordance with the law are affirmed. Witt v. State, 892 P.2d 132, 137 (Wyo. 1995).\n\n[¶60] Article 6, § 19 of the Wyoming Constitution plainly and unambiguously declares:\n\nNo member of congress from this state, nor any person holding or exercising any office or appointment of trust or profit under the United States, shall at the same time hold or exercise any office in this state to which a salary, fees or perquisites shall be attached. The legislature may by law declare what offices are incompatible.\n\nThe legislature has authorized, by Wyo. Stat. Ann. § 18-3-302(c) (Michie 1997), the government's hiring an assistant prosecutor:\n\n(c) Nothing in this section shall be construed to prevent the county commissioners of any county or consolidation of counties from employing one (1) or more attorneys to appear and prosecute or defend or assist the county and prosecuting attorney in behalf of the people of the state or such county or consolidation of counties in any action or proceeding, whether civil or criminal. In such case, the nature and necessity of the employment shall appear in the record of the board or boards. Nothing in this section shall be construed to prevent the board of county commissioners of a county which has consolidated from independently employing one (1) or more attorneys to serve their respective counties.\n\nOlsen contends that documentation showed that the special prosecutor continued his official federal office in violation of the constitutional provision, incurred fees as a special prosecutor, and received the perquisite of experience in a death penalty trial. He asserts that because this constitutional provision bars a federal prosecutor from serving as a special prosecutor in a state court trial, his sentence should be vacated and either a life sentence imposed or a remand for a new sentencing occur. The State disputes all of these claims and argues that the temporary special prosecutor is not a state officer within the meaning of the constitutional provision according to a five -part test set out in Pfister v. Niobrara County, 557 P.2d 735, 742 (Wyo. 1976), and he must be considered a public employee.\n\n[¶61] In State v. Jefferis, 26 Wyo. 115, 123, 178 P. 909, 910 (Wyo. 1919), this court interpreted this constitutional provision as declaring, \"in effect, that an office of profit in this state and an office or appointment of trust or profit under the United States are incompatible.\" Jefferis considered the case of a state judge who joined the United States Army for a few months in 1918. At the end of that period, he returned and resumed his duties as a judge and submitted a request for pay. The state auditor denied his pay request, and the question presented to the court was whether the elected office of judge had been vacated so as to deprive him of the right to the claimed salary. In answering this question, this court had to consider the effect of Article 6, § 19, and agreed with the Pennsylvania construction that the Constitution makes these offices incompatible, but it does not prescribe a penalty or a forfeiture. Id. at 135-36, 178 P. at 915 (citing DeTurk v. Commw., 129 Pa. 151, 18 A. 757 (1889)). Because this provision and others had not abrogated the applicable common-law rule, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e we determined that the provision itself would not prohibit payment of the salary.\n\n[¶62] Jefferis' determination that this provision does not prescribe a penalty or forfeiture is applicable to this case and satisfies us that Olsen is incorrect in claiming that his conviction is reversible because a federal prosecutor acted as a state prosecutor in a state trial. He does not direct us to any common-law rule or any authority requiring reversal because of the dual role played by this particular prosecutor. Olsen does contend, however, that because the jury was told of the assistant's capacity as a United States Assistant Attorney in order to determine whether any jurors knew him or had dealings with him, the federal prosecutor's presence and this information impermissibly influenced the jury by suggesting the federal government had an interest in seeking the death penalty for him. He claims that informing the jury of the federal government's involvement in the case was prejudicial error warranting reversal of his conviction.\n\n[¶63] We review whether the sentence of death was imposed under the influence of passion, prejudice, or any other arbitrary factor. § 6-2-103(d)(i). Olsen offers no authority that the special prosecutor's introduction as a United States Attorney and presence prejudiced him, and our research indicates that error, including constitutional error, has been limited to the use of special prosecutors with a financial or personal interest in the prosecution. See State v. Eldridge, 951 S.W.2d 775, 780-83 (Tenn. Cr. App. 1997)(collecting cases). We find no such error here.\n\nB. Prospective Jurors\n\n[¶64] Olsen contends that two prospective jurors were improperly excused from the jury in violation of the constitutional standard set by the United States Supreme Court in Wainwright v. Witt, 469 U.S. 412, 420, 105 S.Ct. 844, 850, 83 L.Ed.2d 841 (1985). The proper standard for determining when a prospective juror may be excluded for cause because of his or her views on capital punishment is whether the juror's views would \"prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.\" Id. at 424, 105 S.Ct. at 852 (quoting Adams v. Texas, 448 U.S. 38, 45, 100 S.Ct. 2521, 2526, 65 L.Ed.2d 581 (1980)). The Witt standard is codified in Wyo. Stat. Ann. § 7-11-105(a)(iii) (Michie 1997) (emphasis added):\n\n§ 7-11-105. General grounds for challenging jurors.\n\n(a) The following is good cause for challenge to any person called as a juror in a criminal case:\n\n(i) That he was a member of the grand jury which found the indictment;\n\n(ii) That he has formed or expressed an opinion as to the guilt or innocence of the accused, or is biased or prejudiced for or against the accused;\n\n(iii) In a case in which the death penalty may be imposed, he states that his views on capital punishment would prevent or substantially impair performance of his duties as a juror in accordance with his oath or affirmation and the instructions of the court;\n\n(iv) That he is a relation within the fifth degree to the person alleged to be injured, or attempted to be injured, by the offense charged or to the person on whose complaint the prosecution was instituted, or to the defendant;\n\n(v) That he has served on a petit jury which was sworn in the same cause against the same defendant, and which jury either rendered a verdict which was set aside, or was discharged after hearing the evidence;\n\n(vi) That he has served as a juror in a civil case brought against the defendant for the same act;\n\n(vii) That he has been subpoenaed as a witness in the case.\n\n(b) The same challenges for cause shall be allowed in criminal prosecutions that are allowed to parties in civil cases.\n\nWitt limits the State's power to exclude jurors based on their views of capital punishment; however, the Witt standard does not permit jurors unable to act impartially in accordance with the statutory scheme. Witt, 469 U.S. at 422-24, 105 S.Ct. at 851-52. We review a trial court's factual determination that a juror is in violation of that standard under an abuse of discretion standard. Kerns v. State, 920 P.2d 632, 635 (Wyo. 1996).\n\n[¶65] In this case, the State's voir dire of prospective juror Phyllis Roseberry revealed that she personally opposed the death penalty. The prosecutor then limited himself to questions such as whether this opinion would change if a family member were killed. Roseberry explained that she distinguished between killing someone in defense of herself or others and killing as a punishment. She stated that she could not think of any circumstances where she could vote for the death penalty, and the State then challenged her for cause. Explaining to her that the law allowed the death penalty and eliciting her responses that she would follow the law, defense counsel asked if she:\n\nQ: . . . fit in that category of people who may oppose the death penalty but would follow the Court's instructions regarding the imposition of the death penalty?\n\nA: . . . I would not follow -- I would not want to follow the Judge's instructions on that. . . . I would feel more strongly about telling you I don't believe in voting for the death penalty.\n\nQ: Right. You may not want to follow the Judge's instructions, the fact is you would follow the Judge's instructions; isn't that a fact?\n\nA: If I was in that circumstance and that was the law I would do whatever the law said.\n\nDefense counsel then opposed the challenge for cause, and the trial court conducted voir dire by first reading an instruction explaining the law for determining when a defendant was eligible for the death penalty. In response to Mrs. Roseberry's question about whether the death penalty was mandatory, the trial court instructed her that a defendant becomes eligible for the death penalty when an aggravating circumstance is found, but that the death penalty is never mandatory. Upon learning that the death penalty is never mandatory, Mrs. Roseberry responded:\n\nA: Eligible, but not mandatory.\n\nCourt: Right, that's correct.\n\nA: I can tell you if it got to that stage my position would be life imprisonment. . . .\n\nCourt: Could you ever vote for the death penalty in a proper case where the aggravating circumstances have been proved beyond a reasonable doubt? Would you vote --could you vote for the death penalty?\n\nA: If it's discretionary that you could also vote for life imprisonment, no.\n\nCourt: So are you saying that as a result of your beliefs that you could not bring yourself to consider the imposition of the death penalty under any circumstances?\n\nA: If there's another option, that's right. Court: Okay. Counsel, the Court believes that from the juror's responses here that she demonstrates to this court's satisfaction that her views would prevent or substantially impair the performance of her duties as a juror in accordance with the oath and her instructions.\n\nMrs. Roseberry was then excused by the court, and defense counsel objected.\n\n[¶66] The record shows that defense counsel's apparent rehabilitation of Mrs. Roseberry was revealed to be nothing more than her agreement that she would vote for the death penalty if mandatory under the law. When the trial court's further questioning caused her to realize that jury instructions permitted the discretionary option of imposing a life sentence instead of a death sentence, she responded that she would never impose a death sentence. Although the trial court did not specifically ask if she would not follow her oath and the court's instructions, it did establish that she would not follow the law under any circumstances. This voir dire was sufficient for the trial court to apply the Witt standard to her responses and conclude that she should be excluded for cause. The Witt standard was correctly applied for this juror, and we find no abuse of discretion in the trial court's determination that this prospective juror had established cause for exclusion.\n\n[¶67] Olsen contends that a prospective juror, Ms. Starbuck, was also improperly excluded. Ms. Starbuck stated on her juror questionnaire that she did believe in the death penalty; however, when questioned during voir dire she was reluctant to serve on a death penalty case. The State reserved its decision, and defense counsel asked her if she could follow the court's instructions. She responded, \"I don't know that I could\"; \"I would rather not\"; and \"I just don't know.\" In response to the State's question whether her feelings about the death penalty would impair her ability to be fair and impartial, she responded, \"probably would.\" The trial court then took up voir dire and asked Ms. Starbuck if after hearing all the evidence and instructions, she would be willing to consider the imposition of the death penalty in a proper case, or in this case. She answered that she would not want to have to. The trial court then asked if she would vote for the death penalty in a proper case if the case has proved the aggravating circumstance, and she responded that she did not think so. Finally, the court asked if her beliefs would prevent her from imposing the death penalty under any circumstances, and she responded affirmatively. The court found that her responses satisfied it that her views would prevent or substantially impair the performance of her duties as a juror in accordance with her instructions and oath and excused the juror. Defense counsel objected to the exclusion on grounds that her questionnaire indicated she did not have views about imposing the death penalty and the trial court had improperly elicited answers that she could not vote for the death penalty in this particular case.\n\n[¶68] The record shows that Ms. Starbuck was inconsistent concerning her views about the death penalty, but indicates the trial court's questioning clarified that Ms. Starbuck did oppose the death penalty and would not be able to properly follow the court's instructions. The record does not indicate that Ms. Starbuck believed the cour t had asked her how she would vote on this particular case. The trial court properly applied the Witt standard and did not abuse its discretion in excusing this juror.\n\nC. Ineffective Assistance of Trial Counsel\n\n[¶69] Olsen contends that his trial counsel failed to provide effective assistance of trial counsel in three areas:\n\n1) when counsel admitted guilt and never gave the jury the opportunity to consider the defense of mental illness during the guilt phase;\n\n2) when counsel failed to impeach Division of Criminal Investigation Agent Kevin Hughes; and\n\n3) when counsel failed to pursue a change of venue even when faced with waiving peremptory challenges in order to impanel a jury.\n\n1. Counsel's Admission of Guilt\n\n[¶70] During voir dire of the jury panel, defense counsel told the entire venire of prospective jurors:\n\nLadies and gentlemen, before we start I'm going to tell you, I'm going to admit to you, that the issue in this case will not involve who did the shootings. That won't be the issue. We admit, ladies and gentlemen, that Martin Olsen shot all three of the individuals concerned in this case; Emma McCoid, Kyle Baumstarck, Art Taylor. That he did that on the evening of January the 20th, we admit that, that he shot them. They were facedown and he shot them in the back of the head. That he took money from that establishment and he left. He was ultimately captured near Buffalo. We admit all those facts, ladies and gentlemen, they are facts. They are there. He's confessed to it, many of you pointed that out in the questionnaires, that he's confessed to it. He's not only confessed to police officers he's confessed to his mother.\n\nSo before we start, I wanted to get that on the table. That won't be an issue. Okay. Do all of you understand then what I just told you? Do all of you understand that? What will be an issue in this particular case, ladies and gentlemen, is the degree of guilt. That's why we're here.\n\nLater, counsel explained that he would use an intoxication defense to establish that Olsen could not have formed the requisite intent for first degree murder and was admitting to second degree murder. Olsen's specific contention on appeal is that counsel conceded his guilt without pursuing the affirmative defense allowed under Wyo. Stat. Ann. § 7-11-305(a) (Michie 1997), a plea of not guilty by reason of mental illness or deficiency. Wyo. Stat. Ann. § 7-11-304(a) (Michie 1997) defines this defense as:\n\nA person is not responsible for criminal conduct if at the time of the criminal conduct, as a result of mental illness or deficiency, he lacked substantial capacity either to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of law. As used in this section, the terms mental illness or deficiency mean only those severely abnormal mental conditions that grossly and demonstrably impair a person's perception or understanding of reality and that are not attributable primarily to self-induced intoxication as defined by W.S. 6-1-202(b).\n\nOlsen contends that Dr. Gummow's testimony during the sentencing phase that Olsen could not conform his conduct to the law permitted this affirmative defense to the crime charged and should have been presented during the guilt phase of the trial. A hearing was held on the State's motion for demand for notice of defense of mental illness or deficiency, and defense counsel informed the court that, based on two examinations, the defense did not anticipate changing the plea from not guilty to not guilty by reason of mental deficiency. The State contends that the hearing and a third examination show Olsen's defense counsel actively explored this potential defense by three expert examinations and reasonably concluded that the statutory definition of this affirmative defense was not established for presentation during the guilt phase. Quoting from the testimony of the three experts, the State asserts that we can determine that the evidence did not meet the statutory definition of this affirmative defense and defense counsel's tactical decision was reasonable.\n\n[¶71] Because neither the record nor this appeal suggest otherwise, we assume that Olsen consented to a trial strategy of admitting during voir dire to shooting the victims either to avoid the death penalty through convictions for second degree murder or to reduce culpability in the sentencing phase. Before trial, defense counsel arranged three psychiatric examinations for Olsen by a neuropsychologist, a neurologist, and a psychiatrist. None of the three testified during the guilt phase, but all three did testify during the sentencing phase on various issues concerning mitigating circumstances, including whether Olsen could have conformed his conduct to the requirements of the law. The testimony was sufficient to allow the jury to decide whether Olsen's mental state on the night of the robbery and murders should mitigate against the death penalty.\n\n[¶72] In the guilt phase, the defense admitted Olsen shot the victims but contended that Olsen's intoxication prevented him from forming specific intent to commit first degree murder, and argued the jury should convict for second degree murder. Olsen now contends that Dr. Gummow's testimony provided for this additional, compatible defense and contends that it was compatible with all other defenses. Before the defense rested, however, the record shows that Olsen agreed with defense counsel's decision not to have Dr. Gummow testify during the guilt phase.\n\nA criminal defendant's right to the assistance of counsel is guaranteed by the Sixth Amendment to the Constitution of the United States, made applicable to the states through the Fourteenth Amendment, and is guaranteed by the Wyoming Constitution in Article 1, Section 10. Dickeson v. State, 843 P.2d 606, 608-09 (Wyo. 1992).\n\nWe have adopted the standard for determining whether a defendant received effective assistance of counsel from Strickland v. Washington, 466 U.S. 668, 687, 104 S.Ct. 2052, 2064, 80 L.Ed.2d 674 (1984):\n\nFirst, the defendant must show that counsel's performance was deficient. This requires showing that counsel made errors so serious that counsel was not functioning as the \"counsel\" guaranteed the defendant by the Sixth Amendment. Second, the defendant must show that the deficient performance prejudiced the defense. This requires showing that counsel's errors were so serious as to deprive the defendant of a fair trial, a trial whose result is reliable. Unless a defendant makes both showings, it cannot be said that the conviction or death sentence resulted from a breakdown in the adversary process that renders the result unreliable. Dickeson, 843 P.2d at 609 (quoting Strickland, 466 U.S. at 687, 104 S. Ct. at 2604). Miller v. State, 942 P.2d 1108, 1109 (Wyo. 1997).\n\n[¶73] Olsen does not refer us to any decision from any jurisdiction holding that an attorney must submit multiple, compatible defenses or risk error for ineffective assistance. It has been held, however, that in a capital case the decision to present evidence of mental illness is within the sound strategic judgment of counsel. People v. Rodriguez, 914 P.2d 230, 297 (Colo. 1997); see also People v. Welch, 976 P.2d 754, 787 (Cal. 1999). Olsen also does not refer us to any authority holding that the failure to advance an additional, plausible defense at the guilt phase of a capital murder trial is professionally incompetent, establishing ineffective assistance of counsel.\n\nWe do not evaluate the efforts of counsel from a perspective of hindsight but, rather, we endeavor to reconstruct the circumstances surrounding counsel's challenged conduct and evaluate the professional efforts from the perspective of counsel at the time. \"We invoke a strong presumption that counsel rendered adequate and reasonable assistance making all decisions within the bounds of reasonable professional judgment.\" Gist [v. State], 737 P.2d [336,] at 342 [(Wyo.1987)] (citations omitted). The burden is upon the defendant to overcome this presumption that, in light of the circumstances, the challenged action or failure of the attorney might be considered sound trial strategy. Dudley v. State, 951 P.2d 1176, 1181 (Wyo. 1998).\n\n[¶74] Olsen has failed to meet his burden of demonstrating that his trial counsel was deficient when he considered having Dr. Gummow testify at the guilt phase, but deliberately chose to present her testimony at sentencing, and counsel secured Olsen's approval of this strategy; therefore, we cannot conclude that there was ineffective assistance of counsel.\n\n[¶75] Our independent review requires that we examine whether trial counsel's admission of guilt to the shootings violates the rule that \"the admission by counsel of his client's guilt to the jury[] represents a paradigmatic example of the sort of breakdown in the adversarial process that triggers a presumption of prejudice.\" United States v. Williamson, 53 F.3d 1500, 1511 (10th Cir. 1995). Wyoming recognizes that there are cases of deficient performances where prejudice is presumed. Herdt v. State, 816 P.2d 1299, 1301-02 (Wyo. 1991). Williamson's holding is based on the following rationale:\n\nThe Sixth Amendment provides \"[i]n all criminal prosecutions, the accused shall . . . have the assistance of counsel for his defence.\" U.S. Const. amend. VI. While a defendant must ordinarily prove deficient performance by counsel coupled with a showing of prejudice in order to prevail on an ineffective assistance of counsel claim, Strickland v. Washington, 466 U.S. 668, 687, 104 S.Ct. 2052, 2064, 80 L.Ed.2d 674 (1984), there is a narrow class of cases where the particular circumstances \"are so likely to prejudice the accused that the cost of litigating their effect in a particular case is unjustified.\" United States v. Cronic, 466 U.S. 648, 658, 104 S.Ct. 2039, 2046, 80 L.Ed.2d 657 (1984) (footnote omitted). If a defendant can prove such circumstances actually existed, prejudice will be presumed. Id. at 659-62, 104 S.Ct. at 2047-49. There is no question but that the sort of conduct alleged here, i.e., the admission by counsel of his client's guilt to the jury, represents a paradigmatic example of the sort of breakdown in the adversarial process that triggers a presumption of prejudice. See, e.g., United States v. Swanson, 943 F.2d 1070, 1074 (9th Cir. 1991); Jones v. State, 110 Nev. 730, 877 P.2d 1052, 1056-57 (1994) (quoting Brown v. Rice, 693 F.Supp. 381, 396 (W.D.N.C.1988), cert. denied, 495 U.S. 953, 110 S.Ct. 2220, 109 L.Ed.2d 545 (1990)). Whether such an admission actually occurred is necessarily fact-intensive. The focus must be on whether, in light of the entire record, the attorney remained a legal advocate of the defendant who acted with \"'undivided allegiance and faithful, devoted service'\" to the defendant. See Osborn v. Shillinger, 861 F.2d 612, 624 (10th Cir. 1988)(quoting Von Moltke v. Gillies, 332 U.S. 708, 725, 68 S.Ct. 316, 324, 92 L.Ed. 309 (1948)). Williamson, 53 F.3d at 1510-11.\n\nUsually, concession of guilt issues involves a failure of defense counsel to secure the client's consent to employ this particular strategy because:\n\nWhen counsel concedes a client's guilt during the guilt-innocence phase of trial in spite of the client's earlier plea of not guilty and without the defendant's consent, counsel provides ineffective assistance of counsel regardless of the weight of evidence against the defendant or the wisdom of counsel's \"honest approach\" strategy. Francis v. Spraggins, 720 F.2d 1190 (11th Cir.1983); Wiley v, Sowers, 647 F.2d 642 (6th Cir. 1981); State v. Harbison, 315 N.C. 175, 337 S.E.2d 504 (N.C. 1985). The gravity of the consequences of a decision to plead guilty or to admit one's guilt demands that the decision remain in the defendant's hand. An attorney cannot deprive his or her client of the right to have the issue of guilt or innocence presented to the jury as an adversarial issue on which the state bears the burden of proof without committing ineffective assistance of counsel. \"The adversarial process protected by the Sixth Amendment requires that the accused have 'counsel acting in the role of an advocate'. The right to the effective assistance of counsel is thus the right of the accused to require the prosecution's case to survive the crucible of meaningful adversarial testing.\" U.S. v. Cronic, 466 U.S. 648, 656, 104 S.Ct. 2039, 2045, 80 L.Ed.2d 657 (1984). A lawyer may make a tactical determination of how to run a trial, but the due process clause does not permit the attorney to enter a guilty plea or admit facts that amount to a guilty plea without the client's consent. Jones v. State, 877 P.2d 1052, 1056 (Nev. 1994) (quoting Brown v. Rice, 693 F.Supp. 381, 396 (W.D.N.C.1988), rev'd on other grounds, Brown v. Dixon, 891 F.2d 490 (4th Cir. 1989)) (some citations omitted). See Grainey v. State, 997 P.2d 1035, 1040 (Wyo. 2000).\n\n[¶76] The Eighth Circuit has considered similar facts and concluded that admitting the act but denying the requisite mental state by an intoxication defense to first degree murder charges is not the functional equivalent of a guilty plea. Nielson v. Hopkins, 58 F.3d 1331, 1335 (8 th Cir. 1995); Parker v. Lockhart, 907 F.2d 859, 861 (8 th Cir. 1990). We agree with that analysis and find that the concession here was, tactically, a reasonable attempt to avoid a first degree murder conviction in light of Olsen's several confessions that he had shot the victims. We find no error.\n\n2. Impeachment Evidence\n\n[¶77] Olsen contends that defense counsel failed to impeach testimony about an alleged confession with evidence that was presented to defense counsel and made a part of the record seriously damaging the credibility of one of the law enforcement agents. He contends that the substance of the impeachment evidence would have placed serious doubt on the law enforcement agent's testimony of an alleged confession by Olsen. The State contends that because Olsen confessed a number of times to several different witnesses, officers, and agents, no question was presented as to whether he had admitted guilt.\n\n[¶78] The record shows that after defense counsel learned from a newspaper article that Agent Hughes had resigned his position following an investigation, the defense subpoenaed the personnel records of Agent Hughes, and DCI moved to quash that subpoena. The trial court held a hearing on the State's motion to quash the subpoena and reviewed the records in camera. The trial court denied the State's motion and permitted the defense a copy of an internal investigative report critical of the agent. Because the State had not yet decided whether Hughes would be a witness at trial, the State requested that the use of the sensitive material be limited for the time being to the hearing on the motion to suppress. The court agreed and reflected that agreement in its order. At the motions hearing, Hughes was cross-examined about Olsen's unrecorded statements and claimed that Olsen later confirmed those statements on tape after reaching Worland. The tape is not part of the record. The rest of the cross-examination focused on whether Hughes had made that recording after Olsen requested an attorney, and no mention is made of the report on Hughes.\n\n[¶79] At trial, tapes of Olsen's various statements to police were played for the jury. Taped statements were made to the arresting officer, to Hughes on the drive from the arrest scene to Buffalo, and several times at the Buffalo detention center. In all of these recorded conversations, Olsen consistently maintained that he did not know why he had shot the victims. Hughes then drove Olsen back to Worland and testified about an untaped conversation that he had with Olsen during that drive. In his recount of Olsen's statements during that conversation, Hughes provided evidence that Olsen picked the Little Chief Bar because it was out of the way; that the bartender \"bitched at him\" and told him that he would not get away with it; and that Olsen said he had committed the murders because he got scared that the patrons would identify him and so he shot them. The testimony constitutes evidence supporting premeditated first degree murder as well as the aggravating circumstance that Olsen murdered the victims to eliminate witnesses to the crime and avoid or prevent his arrest.\n\n[¶80] During cross-examination at trial, the agent was not questioned about the report although he confirmed that he was alone with Olsen when the statements were made and conceded that the unrecorded statements contradicted the many recorded statements made by Olsen. Although the defense subpoenaed several people who had made statements in the Hughes' investigation, none were called as witnesses. The State contends that it was a reasonable tactical decision not to attack the agent because Olsen had confessed so many times. Betzle v. State, 847 P.2d 1010, 1025 (Wyo. 1993).\n\n[¶81] Olsen, however, never confessed to these specific facts to anyone except Hughes, and these specific facts eliminated the plausibility of Olsen's intoxication theory negating specific intent and provided sufficient evidence that his dominant motive was eliminating witnesses and was thus guilty of the aggravating circumstance of murder to prevent or avoid a lawful arrest. Our independent examination of the inve stigation report on Hughes indicates that it would have impeached Hughes' credibility and veracity, and the record does not detail the reasons for defense counsel's failure to use the report as impeachment. After Olsen's conviction, appellate counsel did not request an evidentiary hearing to ascertain defense counsel's reasoning. An ineffectiveness claim should not be brought on appeal where the trial record is insufficient to determine the claim. Arner v. State, 872 P.2d 100, 104 (Wyo. 1994); Calene v. State, 846 P.2d 679, 692 (Wyo. 1993). Despite the lack of record, we do not find that the assumption that counsel's performance was deficient leads to the conclusion that the defense was prejudiced. To show that deficient performance prejudiced his defense, the defendant must demonstrate that, when the totality of the circumstances is considered, there is a reasonable probability that, but for counsel's deficient performance, the result of the proceeding would have been different. A reasonable probability is a probability sufficient to undermine confidence in the outcome of the trial. Frias v. State, 722 P.2d 135, 146 (Wyo. 1986).\n\n[¶82] Although Olsen's defense theory was that he was too intoxicated to have formed specific intent, he admitted to facts showing that he planned the robbery and committed premeditated first degree murder for the purpose of eliminating witnesses. Hughes' testimony notwithstanding, Olsen's admitted actions represent evidence that was more than sufficient to support the jury's finding of guilt in both the guilt and sentencing phases. We find no error.\n\n3. Change of Venue\n\n[¶83] Defense counsel filed a change of venue motion because of prejudicial pretrial publicity, but the motion was denied subject to renewal. After four days of voir dire, defense counsel agreed to waive five peremptory challenges after qualifying thirty-five jurors. Originally, forty-five jurors were to be qualified, and each side would have fifteen peremptory challenges. Olsen contends that the length of voir dire and the inability to qualify forty-five jurors should have induced defense counsel to renew his motion for a change of venue. The State contends that defense counsel indicated he was satisfied with the thirty-five jurors already selected, nothing in the record indicates that counsel could not qualify additional jurors, and Olsen told the court that he agreed with counsel's decision.\n\n[¶84] In determining whether a change of venue should be granted because of publicity,\n\nthe nature and extent of the publicity must be considered; [and] the difficulty or ease in selecting a jury must be considered along with the amount of prejudice which actually appears during voir dire examination. Murry v. State, 713 P.2d 202, 208 (Wyo. 1986).\n\nOlsen does not refer us to any part of the record or any publicity indicating that the lengthy voir dire was primarily attributable to jurors prejudiced by publicity. See Harvey v. State, 835 P.2d 1074, 1080 (Wyo. 1992). Our review of the record indicates that the length of voir dire was primarily attributable to the amount of time defense counsel devoted to individually questioning prospective jurors about their death penalty and intoxication defense views, rather than a concern with prejudicial publicity that would have warranted renewing the motion for a change of venue. Jury selection was lengthy and careful. Nothing in the record supports the contention that defense counsel was frustrated in its attempts to seat a fair and impartial jury, and the record does not show any prospective juror comments or responses that warranted renewing the change of venue motion. Defense counsel is not required to make a motion without a basis. See Murry, 713 P.2d at 212. We find no error.\n\nD. Sufficiency of the Evidence of Premeditation\n\n[¶85] Under the defense theory of the case, the sole issue for determination at trial was whether Olsen had committed premeditated first degree murder or second degree murder. Olsen presented an intoxication defense to negate the specific intent element of premeditated first degree murder. He contends that the State's evidence was insufficient to establish premeditation.\n\n[¶86] To determine whether sufficient evidence of a crime exists, we examine all the evidence in the light most favorable to the State. Lovato v. State, 901 P.2d 1132, 1133 (Wyo. 1995). Our standard of review in first degree murder cases, with special attention to the distinction between first and second degree murder, is not whether the evidence is sufficient for us, but whether, when viewed favorably to the state, it was enough on which a jury could form a reasonable inference of guilt beyond a reasonable doubt. Id. In evaluating evidence of premeditation, we use the following analytical framework:\n\nEvidence sufficient to sustain a finding of premeditation and deliberation \"falls into three basic categories: (1) facts about * * * what defendant did prior to the actual killing which show that the defendant was engaged in activity directed toward, and explicable as intended to result in, the killing--what may be characterized as 'planning' activity; (2) facts about the defendant's prior relationship and/or conduct with the victim from which the jury could reasonably infer a 'motive' to kill the victim, which inference of motive, together with facts of type (1) or (3) would * * * support an inference that the killing was the result of 'a pre-existing reflection' and 'careful thought and weighing of considerations' rather than 'mere unconsidered or rash impulse hastily executed'; (3) facts about the nature of the killing from which the jury could infer that the manner of killing was so particular and exacting that the defendant must have intentionally killed according to a 'preconceived design' to take the victim's life in a particular way for a 'reason' which the jury can reasonably infer from facts of type (1) or (2).\" Verdicts of first degree murder typically are sustained when there is evidence of all three types and otherwise require at least extremely strong evidence of (1) or evidence of (2) in conjunction with either (1) or (3). Bouwkamp v. State, 833 P.2d 486, 494-95 (Wyo. 1992) (citations and emphasis omitted).\n\n[¶87] The State presented evidence characterized as planning activity by showing that Olsen's initial confessions claimed that he had shot a man who had followed him into the Little Chief Bar trying to collect a gambling debt and two innocent witnesses, and then later changed his story and confessed to planning a robbery that ended with the murder of witnesses. The second element is satisfied by the evidence of robbery as robbery is sufficient motive to justify an inference of premeditation. Bouwkamp, 833 P.2d at 496. Finally, we consider the last category of evidence, \"nature of the killing from which the jury could infer that the manner of killing was so particular and exacting that the defendant must have intentionally killed according to a 'preconceived design.'\" In Lovato, we determined that the murder there took place in an exacting manner from which the jury could infer it was premeditated when the evidence showed that Lovato fired a volley of shots from a point of relative safety, then fired more shots into the deceased, and then, gangland style, fired another shot or two, at point blank range into the victim's head. Lovato, 901 P.2d at 1134. Here, Olsen walked into the bar and went into the restroom to see if any customers were inside. He returned to the bar area, ordered the two male customers to the floor, robbed the bar, and then ordered the bartender to lay down on the floor. Stepping on the back of one victim, he fired three shots from close range into the backs of the victims' heads. He fired one shot at point blank range into the back of the bartender's head. We find these murders took place in an exacting manner from which the jury could infer premeditation. Applying Bouwkamp's analysis, there is sufficient evidence of the categories of motive and the nature of the killings to establish premeditation.\n\nE. Summary\n\n[¶88] In summary, with respect to the several issues raised by Olsen pertaining to his trial, we find no error in the State's use of a special prosecutor, trial defense counsel's performance, and the sufficiency of the evidence of premeditation. Additionally, we find no error in the trial court's excusing two prospective jurors for cause.\n\nIII. Sentencing Phase\n\nA. Constitutionality of Wyoming's Death Penalty Statute\n\n[¶89] In his first issue relating to the sentencing phase of his trial, Olsen contends that Wyoming's death penalty statute is ambiguous and, therefore, unconstitutional. His precise concern is its lack of guidance in determining the effect of aggravating and mitigating circumstances in deciding between a death sentence and a life sentence. The State contends that the statute complies with the mandates of the pertinent decisions of the United States Supreme Court (the Court).\n\n1. Background of Federal Precedent\n\n[¶90] In 1972, the Court declared all death penalty statutes unconstitutional as constituting cruel and unusual punishment in violation of the Eighth and Fourteenth Amendments. Furman v. Georgia, 408 U.S. 238, 92 S.Ct. 2726, 33 L.Ed.2d 346 (1972). The basis for that conclusion was explained through five concurring opinions. Four years later, when new statutory schemes from various states were presented to the Court, several plurality decisions pinpointed the precise deficiency of the previous statutes to be the untrammeled discretion permitted juries in deciding whether to impose or withhold the death penalty. In those opinions, the Court upheld Georgia, Florida, and Texas' new statutory schemes and struck down two other states' statutes, namely, North Carolina's scheme which mandated the death sentence, and Louisiana's statutory scheme which required a sentencer to consider lesser offenses even when not a scintilla of evidence supported that lesser charge. Gregg v. Georgia, 428 U.S. 153, 96 S.Ct. 2909, 49 L.Ed.2d 859 (1976); Proffitt v. Florida, 428 U.S. 242, 96 S.Ct. 2960, 49 L.Ed.2d 913 (1976); Jurek v. Texas, 428 U.S. 262, 96 S.Ct. 2950, 49 L.Ed.2d 929 (1976); Woodson v. North Carolina, 428 U.S. 280, 96 S.Ct. 2978, 49 L.Ed.2d 944 (1976); Roberts v. Louisiana, 428 U.S. 325, 96 S.Ct. 3001, 49 L.Ed.2d 974 (1976). In 1977, we considered the constitutionality of Wyoming's death penalty statute. In declaring it unconstitutional because it mandated the death penalty, we noted that\n\n[t]o constitutionally exact a death penalty the statute must contain standards provided by the legislature controlling the exercise of the discretion of the sentencing authority, which are totally lacking in our statute. The lessons of Gregg v. Georgia, Roberts v. Louisiana, Jurek v. Texas, Proffitt v. Florida, and Woodson v. North Carolina demonstrate that to successfully withstand attack upon constitutional grounds there must be provided in the statute standards to guide and control the exercise of discretion by the sentencing authority in its determination of the propriety of the application of the death sentence, or the alternative of a term of life imprisonment. There must further be provided a procedure by which the fact finder can consider and examine any and all aggravating and mitigating circumstances and the character and situation of the individual defendant, upon which the final determination is made. A proper record of the findings which are used as the basis for the infliction of this penalty must be preserved to enable a reviewing court to determine the reasonableness and the propriety of the application of such sentence. The Wyoming statute under scrutiny does not meet these requirements. Kennedy v. State, 559 P.2d 1014, 1016 (Wyo. 1977) (citations omitted).\n\n[¶91] In the following years, thirty-eight states passed death penalty statutes and, as various issues came before the Court, the conceptual basis of aggravating and mitigating circumstances' role in a jury's reasoned moral response was further defined, evolving into the principle that a capital sentencing scheme must \"genuinely narrow the class of persons eligible for the death penalty and must reasonably justify the imposition of a more severe sentence on the defendant compared to others found guilty of murder.\" Engberg, 820 P.2d at 90 (quoting Zant v. Stephens, 462 U.S. 862, 877, 103 S.Ct. 2733, 2742, 77 L.Ed.2d 235 (1983)).\n\nBesides its mandate that a statute limit the jury's discretion, the Court required the admission of all relevant mitigating evidence:\n\nThere is no perfect procedure for deciding in which cases governmental authority should be used to impose death. But a statute that prevents the sentencer in all capital cases from giving independent mitigating weight to aspects of the defendant's character and record and to circumstances of the offense proffered in mitigation creates the risk that the death penalty will be imposed in spite of factors which may call for a less severe penalty. When the choice is between life and death, that risk is unacceptable and incompatible with the commands of the Eighth and Fourteenth Amendments. Lockett v. Ohio, 438 U.S. 586, 605, 98 S.Ct. 2954, 2965, 57 L.Ed.2d 973 (1978). The Court emphasized that a sentence of death is not a fact-finding exercise, but, instead, must reflect an ethical judgment about the \"moral guilt\" of the defendant and the reasoned moral response of the sentencer. Penry v. Lynaugh, 492 U.S. 302, 328, 327-28, 109 S.Ct. 2934, 2951, 106 L.Ed.2d 256 (1989); see Enmund v. Florida, 458 U.S. 782, 800-01, 102 S.Ct. 3368, 3378, 43 L.Ed.2d 1140 (1982).\n\n[¶92] In 1994, the Court explained these complementary doctrines of its capital punishment jurisprudence in Tuilaepa v. California, 512 U.S. 967, 114 S.Ct. 2630, 129 L.Ed.2d 750 (1994). The Court explained that its decisions require that a jury's discretion in sentencing defendants to death must be genuinely narrowed; however, once that is accomplished, the jury must be allowed the widest possible discretion to not choose death. To accomplish these constitutional requirements, there are two different aspects of the capital decision-making process: the eligibility decision and the selection decision. Id. at 971, 114 S.Ct. at 2634. A defendant is eligible for the death penalty in a homicide case when the trier of fact finds one aggravating circumstance or its equivalent at either the guilt or sentencing phase. Id. at 972, 114 S.Ct. at 2634. Aggravating circumstances must meet two requirements: the circumstance may not apply to every defendant convicted of murder; it must apply only to a subclass of defendants convicted of murder (genuine narrowing), and the circumstance must not be unconstitutionally vague. Id., 114 S.Ct. at 2635.\n\n[¶93] The selection decision determines whether an eligible defendant should receive the death penalty and requires an individualized determination on the basis of the character of the individual and the circumstances of the crime. Id. The individualized determination requirement is met when the jury can consider relevant mitigating evidence of the character and record of the defendant and the circumstances of the crime. Id. The eligibility decision requires an answer to the factual question of \"what was the rationale for imposing a sentence of death\" while the selection decision does not necessarily have to answer a factual question, but can be open-ended in assessing the defendant's culpability. Id. at 973, 114 S.Ct. at 2635. The Court observed that the objectives of the eligibility and selection inquiries can be in some tension but the principle common to both decisions is that the State must ensure that the process is neutral and principled so as to guard against bias or caprice in the sentencing decision. Id. This is the controlling objective when examining eligibility and selection factors for vagueness and the reason why neither can be too vague. Id.\n\n[¶94] It is on the issue of invalid aggravating circumstances that the Court began to develop decisions based on whether it considered a particular statutory scheme as weighing or nonweighing. The Court has declared that, on review, the distinction between weighing and nonweighing schemes is not one of \"semantics,\" but is one of \"critical importance.\" Stringer v. Black, 503 U.S. 222, 231-32, 112 S.Ct. 1130, 1137, 117 L.Ed.2d 367 (1992); Hopkinson v. State, 664 P.2d 43, 60 (Wyo. 1983) (Hopkinson II) (\"The scales must not be tipped by impermissible factors leaving us in a quandary as to what the jury would have done had impermissible factors not been present.\"); see also Hopkinson v. State, 632 P.2d 79, 170-72 (Wyo. 1981) (Hopkinson I). In a \"weighing\" state, where the aggravating and mitigating factors are balanced against each other, it is constitutional error for the sentencer to give weight to an unconstitutionally vague aggravating factor, even if there are other valid aggravating factors. Richmond v. Lewis, 506 U.S. 40, 46, 113 S.Ct. 528, 534, 121 L.Ed.2d 411 (1992). In a \"nonweighing\" state, aggravating circumstances serve only to make a defendant eligible for the death penalty and not to determine punishment, and the invalidation of one aggravating circumstance does not necessarily require the appellate court to vacate a death sentence and remand to a jury. Zant, 462 U.S. at 890, 103 S.Ct. at 2749-50.\n\n[¶95] Because weighing states require sentencers to balance aggravating circumstances against mitigating circumstances, one invalid aggravating circumstance requires the reviewing court to either remand the case for a new sentencing determination, reweigh the evidence itself, or conduct harmless error analysis to decide if, beyond a reasonable doubt, the sentence would have been the same despite the invalid aggravating circumstance. By contrast, in nonweighing states\n\nthe jury must find the existence of one aggravating factor before imposing the death penalty, but aggravating factors as such have no specific function in the jury's decision whether a defendant who has been found to be eligible for the death penalty should receive it under all the circumstances of the case. Instead, . . . , \"in making the decision as to the penalty, the factfinder takes into consideration all circumstances before it from both the guilt-innocence and the sentence phases of the trial. These circumstances relate both to the offense and the defendant.\" Stringer, 503 U.S. at 229-30, 112 S.Ct. at 1136 (quoting Zant, 462 U.S. at 872, 103 S.Ct. at 2740).\n\nIf the reviewing court concludes that the sentencer found at least one valid aggravating circumstance and that the invalid factor did not affect the sentencer's determination in imposing the death penalty, the sentence may stand despite an invalid aggravating circumstance. Stringer, at 232, 112 S.Ct. at 1137; Zant, at 881, 103 S.Ct. at 2745. The Court said:\n\nAssuming a determination by the state appellate court that the invalid factor would not have made a difference to the jury's determination, there is no constitutional violation resulting from the introduction of the invalid factor in an earlier stage of the proceedings. But when the sentencing body is told to weigh an invalid factor in its decision, a reviewing court may not assume it would have made no difference if the thumb had been removed from death's side of the scale. When the weighing process itself has been skewed, only constitutional harmless-error analysis or reweighing at the trial or appellate level suffices to guarantee that the defendant received an individualized sentence. This clear principle emerges not from any single case . . . but from our long line of authority setting forth the dual constitutional criteria of precise and individualized sentencing. Stringer, at 232, 112 S.Ct. at 1137.\n\nIn this particular case, both Olsen and the State describe Wyoming's current statute as a weighing statute; however, while Olsen contends this statutory language unconstitutionally fails to properly channel the sentencer's discretion and allows arbitrary imposition of the death penalty, the State argues that the weighing/nonweighing distinction is important only to this court's reviewing process.\n\n2. Weighing/Nonweighing Distinction\n\n[¶96] We have not considered the death penalty statute since it was amended in 1989, although we held the previous version was constitutional in Hopkinson I, 632 P.2d at 152. Hopkinson I considered a statute that instructed that aggravating circumstances proved beyond a reasonable doubt must outweigh any and all mitigating circumstances. If this conclusion is reached, the defendant can be sentenced to death. Id. at 153. Specifically, at that time the statute required the jury to determine \"[w]hether sufficient mitigating circumstances exist . . . which outweigh the aggravating circumstances found to exist.\" Wyo. Stat. Ann. § 6-2-102(d)(i)(B) (Michie 1977). The 1989 amendment to the statute removed the weighing language and now reads, in pertinent part:\n\nThe jury shall consider aggravating and mitigating circumstances unanimously found to exist, and each individual juror may also consider any mitigating circumstances found by that juror to exist. § 6-2-102(d)(ii).\n\nBoth parties contend that Wyoming's statute should be considered \"weighing\" although it does not use that specific term. Both contend it is weighing because the statute limits the jury's consideration to statutorily-defined aggravating factors by the express language in § 6-2-102(d)(ii), which states that the jury must unanimously determine whether the defendant should be sentenced to death or life imprisonment based upon the consideration of aggravating and mitigating circumstances found to exist. The State argues that \"consider\" is a synonym of \"weigh\" and the jury's discretion is \"channeled.\" The defense contends that the statute is too unclear to be constitutional because it does not give the jury guidance or direction \"on how the aggravators and mitigators\" should be \"considered.\" The defense claims this \"nonweighing\" element causes the statute to be ambiguous, the court cannot determine legislative intent, and the statute must be declared unconstitutionally vague. Using dictionary definitions, the State contends that the statutory language, \"consider aggravating and mitigating circumstances,\" is a directive that the jury is to weigh them in some fashion and affords it discretion to evaluate this evidence in whatever manner it chooses.\n\n[¶97] Our earlier discussion of the differences between weighing and nonweighing statutory language indicates that Wyoming's statutory language does not impose a nonweighing scheme. Olsen contends that eliminating the directive \"outweigh\" requires finding the statute too ambiguous to be constitutional. Proffitt specifically addressed the issue of whether a statute is constitutional when it gives no guidance as to how the mitigating and aggravating circumstances should be weighed in any specific case. The Court responded:\n\nWhile these questions and decisions may be hard, they require no more line drawing than is commonly required of a factfinder in a lawsuit. For example, juries ha ve traditionally evaluated the validity of defenses such as insanity or reduced capacity, both of which involve the same considerations as some of the above-mentioned mitigating circumstances. While the various factors to be considered by the sentencing authorities do not have numerical weights assigned to them, the requirements of Furman are satisfied when the sentencing authority's discretion is guided and channeled by requiring examination of specific factors that argue in favor of or against imposition of the death penalty, thus eliminating total arbitrariness and capriciousness in its imposition.\n\nThe directions given to judge and jury by the Florida statute are sufficiently clear and precise to enable the various aggravating circumstances to be weighed against the mitigating ones. As a result, the trial court's sentencing discretion is guided and channeled by a system that focuses on the circumstances of each individual homicide and individual defendant in deciding whether the death penalty is to be imposed. Proffitt, 428 U.S. at 257-58, 96 S.Ct. at 2969.\n\n[¶98] The Florida scheme considered in Proffitt, however, specifically instructed the jury to determine if the aggravating circumstances \"outweighed\" the mitigating circumstances before imposing the death penalty. Olsen complains that the Wyoming statute fails to include this directive while limiting the jury's deliberations to discrete statutory aggravating circumstances. He contends a statute that contains components of both a weighing and a nonweighing statute is unconstitutionally vague for failing to comply with federal requirements that the sentencing jury's discretion be properly channeled.\n\n[¶99] In Richmond v. Lewis, the Court ruled that Arizona was a \"weighing\" state despite the absence of the term. Richmond, 506 U.S. at 47, 113 S.Ct. at 534-35. The provision in question stated:\n\nIn determining whether to impose a sentence of death . . . the court shall take into account the aggravating and mitigating circumstances included in . . . this section and shall impose a sentence of death if the court finds one or more of the aggravating circumstances . . . and that there are no mitigating circumstances sufficiently substantial to call for leniency. Id.\n\nAs previously discussed, when an invalid aggravating factor is used in a weighing state, the reviewing court must either reweigh, remand, or conduct a harmless error review. The Court ruled that the Arizona Supreme Court's failure to reweigh required that the judgment be reversed and remanded. Id. at 52, 113 S.Ct. at 537.\n\n[¶100] In Williams v. Calderon, 52 F.3d 1465 (9th Cir. 1995), Richmond was interpreted to mean that the United States Supreme Court's weighing/non-weighing distinction does not turn simply on whether the word \"weighing\" appears in a state's statute. Id. at 1477. The Ninth Circuit Court of Appeals said:\n\nInstead, the distinction can be understood functionally in one of two ways. First, when a jury \"is specifically instructed to weigh statutory aggravating and mitigating circumstances,\" and its decision is tied to the outcome, the decisional process necessarily becomes infected by the improper consideration. In states where no such procedure is mandated, the factor need not infect the process; the jury is under no obligation to weigh the factor as part of its calculus. Second, when a jury is limited to the consideration of discrete aggravating factors, consideration of an invalid factor may allow consideration of something--the circumstances supporting the factor--that could not have otherwise been considered. In contrast, when a jury is permitted to consider any evidence it deems relevant in aggravation, the consideration of an invalid factor adds only an improper label--the state's \"aggravating factor\" imprimatur--to underlying circumstances which could have been taken into account anyway.\n\nConsequently, the Supreme Court's weighing/ nonweighing distinction may involve both procedural and substantive components. Procedurally, is the sentencer restricted to a \"weighing\" of aggravation against mitigation? Substantively, is the sentencer prevented from considering evidence in aggravation other than discrete, statutorily-defined factors? Our review of federal and state court decisions reveals that where both constraints are present, the regimes involved are uniformly treated as weighing; where neither is present, the regimes are uniformly treated as non-weighing; and where one but not the other is present, disagreement has arisen. Id. at 1477-78 (citations and footnotes omitted).\n\n[¶101] The Williams approach has been adopted by the Washington State Supreme Court, and we too apply its approach and conclude that we agree with both parties that the Wyoming statute constitutes a weighing statute. State v. Brown, 940 P.2d 546, 592 (Wash. 1997). We reach this conclusion despite the absence of weighing language because the Wyoming statute permits the sentencer to consider only those aggravating circumstances enumerated in the statute and does not permit the jury to consider non-statutory aggravating evidence as aggravating circumstances. Our conclusion necessarily raises the issue of whether the jury must be instructed to determine if the aggravating circumstances outweigh mitigating circumstances before the death penalty is imposed. The State contends that it is obvious the jury is going to weigh all those circumstances found to exist in some fashion; however, in our later discussion of mitigation, we conclude that the State's concession does require the jury to be instructed using the term \"outweigh.\"\n\n[¶102] Our conclusion that the statute must be considered a weighing statute does not require that we find that the Court's constitutional precedent mandates that the statute, itself, direct the jury to find that aggravating circumstances outweigh mitigating circumstances or be unconstitutional. In reviewing Georgia's nonweighing scheme, the Court, as it had in Proffitt, held that the Constitution does not require a state to adopt specific standards for instructing the jury in its consideration of aggravating and mitigating circumstances. Zant, 462 U.S. at 890, 103 S.Ct. at 2750. We conclude that federal precedent does not require that we find unconstitutional a statute containing elements of both weighing and nonweighing statutes, so long as Wyoming's death penalty statute genuinely narrows the class of defendants eligible for the death penalty and provides for an individualized determination and appellate review.\n\n3. Summary\n\n[¶103] Changing the statutory term from \"weigh\" to \"consider\" did not transform the statutory scheme from weighing to nonweighing, and we hold that Wyoming's death penalty statute is a constitutional, weighing statute. We reach this conclusion despite the absence of weighing language because the Wyoming statute permits the sentencer to consider only those aggravating circumstances enumerated in the statute and does not permit the jury to consider non-statutory aggravating evidence as aggravating circumstances. Because the statute requires that the sentencing jury consider those aggravating circumstances and all relevant mitigating evidence to reach a decision of death or life imprisonment, the jury should be instructed that it must find that any aggravating circumstance found to exist beyond a reasonable doubt must outweigh all mitigating circumstances.\n\nB. Statutory Interpretation\n\n[¶104] In his next several issues, Olsen contends that, under Wyoming's death penalty statutory scheme, the trial court improperly applied certain aggravating circumstances; improperly admitted non-statutory aggravating evidence although the statutory language prohibits it; and did not properly instruct the jury on the process for consideration of aggravating and mitigating circumstances that is specified by the statutory language. Criminal statutes are to be construed strictly, and we have approved this understanding of that rule:\n\n\"The canon in favor of strict construction [of criminal statutes] is not an inexorable command to override common sense and evident statutory purpose. * * * Nor does it demand that a statute be given the 'narrowest meaning'; it is satisfied if the words are given their fair meaning in accord with the manifest intent of the lawmakers.\" Dover v. State 664 P.2d 536, 540 (Wyo. 1983) (quoting United States v. Moore, 423 U.S. 122, 145, 96 S.Ct. 335, 347, 46 L.Ed.2d 333 (1975)).\n\n[¶105] Ordinarily, this rule of statutory interpretation requires that we give effect to the legislative intent of a statute as perceived from its plain language. However, our early decisions recognized that, in providing for the death penalty as a sentence, the Wyoming Legislature was restrained by constitutional provisions and guarantees. Hopkinson II, 664 P.2d at 51. We found that the most important reason for holding the statutory scheme constitutional to be the fact that these constitutional provisions and guarantees were incorporated into the death penalty sentence as a condition of its availability. Id. at 54. The primary purpose behind those constitutional requirements is the Court's mandate that a constitutional death penalty statutory scheme provide standards establishing a meaningful basis for distinguishing the few cases in which it is imposed from the many cases in which it is not. Furman, 408 U.S. at 313, 92 S.Ct. at 2764 (White, J., concurring). When constitutional jurisprudence has sought to limit either the availability or the extent of state action, we have applied strict construction to the particular statute. See Adoption of BGH, 930 P.2d 371, 377 (Wyo. 1996); Simms v. Oedekoven, 839 P.2d 381, 385 (Wyo. 1992). Because the availability of the death penalty is constitutionally limited, it is appropriate to strictly construe the statute against application of the death penalty. This task is made easier by a readily discernible effort on the part of the Wyoming Legislature to distinguish the most culpable of homicides from all other homicides in applying the death penalty statute. Through the narrow language of statutorily enumerated aggravating circumstances, the legislature has chosen to restrict the pool of defendants eligible for the death penalty and evidenced a plain intent that it apply to few first degree premeditated murders.\n\nC. Aggravating Circumstances\n\n[¶106] The Wyoming Legislature has statutorily enumerated aggravating circumstances to \"narrow the class of persons eligible for the death penalty\" and \"channel\" the discretion of the sentencing authority. Engberg, 820 P.2d at 90; Zant, 462 U.S. at 877. The legislature's use of enumerated aggravating circumstances satisfies the Court's command that because \"there is a required threshold below which the death penalty cannot be imposed,\" rational criteria \"narrow the decisionmaker's judgment as to whether the circumstances of a particular defendant's case meet the threshold.\" McCleskey v. Kemp, 481 U.S. 279, 305, 107 S.Ct. 1756, 1774, 95 L.Ed.2d 262 (1987).\n\n[¶107] The Court, however, has made clear that statutory aggravating circumstances that enable the sentencer to distinguish those who deserve capital punishment from those who do not are insufficient; the narrowing device \"must provide a principled basis\" for making this distinction. Arave v. Creech, 507 U.S. 463, 474, 113 S.Ct. 1534, 1542, 123 L.Ed.2d 188 (1993). \"If the sentencer fairly could conclude that an aggravating circumstance applies to every defendant eligible for the death penalty, the circumstance is constitutionally infirm.\" Id. (emphasis in original). An aggravating circumstance that is so vague as to leave the sentencer without sufficient guidance for determining the presence or absence of the factor is invalid. Espinosa v. Florida, 505 U.S. 1079, 1081, 112 S.Ct. 2926, 2928, 120 L.Ed.2d 854 (1992); Walton v. Arizona, 497 U.S. 639, 654, 110 S.Ct. 3047, 3057, 111 L.Ed.2d 511 (1990). \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e \"A limiting instruction can be used to give content to a statutory factor that 'is itself too vague to provide any guidance to the sentencer' only if the limiting instruction's own 'definitions are constitutionally sufficient,' that is, only if the limiting instruction itself 'provides some guidance to the sentencer.'\" Shell v. Mississippi, 498 U.S. 1, 3, 111 S.Ct. 313, 314, 112 L.Ed.2d 1 (1990) (quoting Walton, 497 U.S. at 654, 110 S.Ct. at 3057).\n\n[¶108] As amended in 1989, Wyoming's death penalty statute provides that: § 6-2-102. Presentence hearing for murder in the first degree; mitigating and aggravating circumstances; effect of error in hearing.\n\n(a) Upon conviction of a person for murder in the first degree the judge shall conduct a separate sentencing hearing to determine whether the defendant should be sentenced to death or life imprisonment. The hearing shall be conducted before the judge alone if:\n\n(i) The defendant was convicted by a judge sitting without a jury;\n\n(ii) The defendant has pled guilty; or\n\n(iii) The defendant waives a jury with respect to the sentence.\n\n(b) In all other cases the sentencing hearing shall be conducted before the jury which determined the defendant's guilt or, if the judge for good cause shown discharges that jury, with a new jury impaneled for that purpose.\n\n(c) The judge or jury shall hear evidence as to any matter that the court deems relevant to a determination of the sentence, and shall include matters relating to any of the aggravating or mitigating circumstances enumerated in subsections (h) and (j) of this section. Any evidence which the court deems to have probative value may be received regardless of its admissibility under the exclusionary rules of evidence, provided the defendant is accorded a fair opportunity to rebut any hearsay statements, and provided further that only such evidence in aggravation as the state has made known to the defendant or his counsel prior to his trial shall be admissible.\n\n(d) Upon conclusion of the evidence and arguments the judge shall give the jury appropriate instructions, including instructions as to any aggravating or mitigating circumstances, as defined in subsections (h) and (j) of this section, or proceed as provided by paragraph (iii) of this subsection:\n\n(i) After hearing all the evidence, the jury shall deliberate and render a sentence based upon the following:\n\n(A) Whether one (1) or more aggravating circumstances exist beyond a reasonable doubt as set forth in subsection (h) of this section;\n\n(B) Whether, by a preponderance of the evidence, mitigating circumstances exist as set forth in subsection (j) of this section; and\n\n(C) The mere number of aggravating or mitigating circumstances found shall have no independent significance.\n\n(ii) Based upon the considerations in paragraph (i) of this subsection, the jury shall unanimously determine whether the defendant should be sentenced to death or life imprisonment. The jury shall consider aggravating and mitigating circumstances unanimously found to exist, and each individual juror may also consider any mitigating circumstances found by that juror to exist;\n\n(iii) In non-jury cases, the judge shall determine if any aggravating or mitigating circumstances exist and impose sentence within the limits prescribed by law, based upon the considerations enumerated in subparagraphs (A), (B) and (C) of paragraph (i) of this subsection.\n\n(e) The death penalty shall not be imposed unless at least one (1) of the aggravating circumstances set forth in subsection (h) of this section is found. In non-jury cases the judge shall make such designation. If the jury cannot, within a reasonable time, agree on the punishment to be imposed, the judge shall impose a life sentence. The jury, if its verdict is a sentence of death, shall designate in writing signed by the foreman of the jury:\n\n(i) The aggravating circumstance or circums tances which it unanimously found beyond a reasonable doubt;\n\n(ii) The mitigating circumstance or circumstances which it unanimously found by a preponderance of the evidence; and\n\n(iii) The mitigating circumstance or circumstances which any individual juror found by a preponderance of the evidence. (f) Unless the jury trying the case recommends the death sentence in its verdict, the judge shall not sentence the defendant to death but shall sentence the defendant to life imprisonment as provided by law. Where a recommendation of death is made, the court shall sentence the defendant to death.\n\n(g) If the trial court is reversed on appeal because of error only in the presentence hearing, the new trial which may be ordered shall apply only to the issue of punishment.\n\n(h) Aggravating circumstances are limited to the following:\n\n(i) The murder was committed by a person:\n\n(A) Confined in a jail or correctional facility;\n\n(B) On parole or on probation for a felony;\n\n(C) After escaping detention or incarceration; or\n\n(D) Released on bail pending appeal of his conviction.\n\n(ii) The defendant was previously convicted of another murder in the first degree or a felony involving the use or threat of violence to the person;\n\n(iii) The defendant knowingly created a great risk of death to two (2) or more persons;\n\n(iv) The murder was committed while the defendant was engaged, or was an accomplice, in the commission of, or an attempt to commit, or flight after committing or attempting to commit, any aircraft piracy or the unlawful throwing, placing or discharging of a destructive device or bomb;\n\n(v) The murder was committed for the purpose of avoiding or preventing a lawful arrest or effecting an escape from custody;\n\n(vi) The murder was committed for compensation, the collection of insurance benefits or other similar pecuniary gain;\n\n(vii) The murder was especially atrocious or cruel, being unnecessarily torturous to the victim;\n\n(viii) The murder of a judicial officer, former judicial officer, district attorney, former district attorney, defending attorney, peace officer, juror or witness, during or because of the exercise of his official duty;\n\n(ix) The defendant knew or reasonably should have known the victim was less than seventeen (17) years of age or older than sixty-five (65) years of age;\n\n(x) The defendant knew or reasonably should have known the victim was especially vulnerable due to significant mental or physical disability;\n\n(xi) The defendant poses a substantial and continuing threat of future dangerousness or is likely to commit continued acts of criminal violence;\n\n(xii) The defendant killed another human being purposely and with premeditated malice and while engaged in, or as an accomplice in the commission of, or an attempt to commit, or flight after committing or attempting to commit, any robbery, sexual assault, arson, burglary or kidnapping.\n\n(j) Mitigating circumstances shall include the following:\n\n(i) The defendant has no significant history of prior criminal activity;\n\n(ii) The murder was committed while the defendant was under the influence of extreme mental or emotional disturbance;\n\n(iii) The victim was a participant in the defendant's conduct or consented to the act;\n\n(iv) The defendant was an accomplice in a murder committed by another person and his participation in the homicidal act was relatively minor;\n\n(v) The defendant acted under extreme duress or under the substantial domination of another person;\n\n(vi) The capacity of the defendant to appreciate the criminality of his conduct or to conform his conduct to the requirements of law was substantially impaired;\n\n(vii) The age of the defendant at the time of the crime;\n\n(viii) Any other fact or circumstance of the defendant's character or prior record or matter surrounding his offense which serves to mitigate his culpability. Wyo. Stat. Ann. § 6-2-102 (Michie 1997).\n\n[¶109] Olsen contends that three of the four aggravating factors of which he was convicted were, as a matter of law, improperly applied to the facts of his case. The aggravating factors submitted to the jury were: (1) Olsen created a great risk of death to two or more persons; (2) the murders were committed for the purpose of avoiding or preventing a lawful arrest; (3) the murders were especially atrocious or cruel, being unnecessarily torturous to the victims; (4) Olsen posed a substantial and continuing threat of future dangerousness or was likely to commit continued acts of criminal violence; (5) Olsen killed another human being purposely and with premeditated malice and while engaged in the commission of a robbery.\n\nThe trial court instructed the jury that atrocious means outrageously wicked and vile; cruel means designed to inflict a high degree of pain with utter indifference to, or even enjoyment of, the suffering of others. What is intended to be included in this circumstance are those murders where the actual commission of the crime was accompanied by such additional acts of serious physical or mental abuse of the victims as to set it apart from the normal first degree murder; that is, a particularly consciousless [sic] or pitiless crime which is unnecessarily torturous to the victims.\n\nTorture may mean extreme mental anguish or distress. In finding mental anguish or distress you may consider the victims' uncertainty as to his or her ultimate fate immediately prior to their deaths.\n\n1. Atrocious or Cruel Aggravating Circumstance\n\n[¶110] The first aggravating circumstance which Olsen complains was improperly applied states the \"murder was especially atrocious or cruel, being unnecessarily torturous to the victim.\" Part of extensive 1989 amendments to the statute, this aggravating circumstance previously read, \"especially heinous, atrocious or cruel,\" and survived a vagueness challenge in Hopkinson I when we held that the statutory language provided the jury adequate guidance when imposing the death penalty. Hopkinson I, 632 P.2d at 153-54. That decision focused on the \"especially heinous\" portion of the statute's wording and found that the murder to be so classified must demonstrate that the consciencelessness of the defendant is not only an outrage but also a dangerous and unrestrainable threat to society. It found Florida's interpretation instructive:\n\nThat court has recognized that while it is arguable \"that all killings are atrocious, * * * [s]till, we believe that the Legislature intended something 'especially' heinous, atrocious or cruel when it authorized the death penalty for first degree murder.\" As a consequence the court has indicated that the eighth statutory provision is directed only at \"the conscienceless or pitiless crime which is unnecessarily torturous to the victim.\" We cannot say that the provision, as so construed, provides inadequate guidance to those charged with the duty of recommending or imposing sentences in capital cases.\" Hopkinson I, 632 P.2d at 154 (quoting Proffitt, 428 U.S. at 255-56, 96 S.Ct. at 2968) (citations omitted).\n\nIn further support, Hopkinson I concluded that the \"especially heinous\" aspect of the term was intended to achieve the proper state purpose of protecting society by sanctioning the death penalty to those individuals who not only may, but probably will, kill again. Id. The Hopkinson II jury was instructed:\n\nOne of the aggravating circumstances set forth in this case is that the murder was especially heinous, atrocious, or cruel. To assist you in your evalution of this aggravating circumstance, heinous means extremely wicked or shockingly evil; atrocious means outrageously wicked and vile; cruel means designed to inflict a high degree of pain with utter indifference to, or even enjoyment of, the suffering of others. What is intended to be included in this circumstance are those capital crimes where the actual commission of the murder was accompanied by such additional acts as to set the crime apart from the no rmal murder; that is, a consciousless [sic] or pityless [sic] crime which is unnecessarily torturous to the victim. Hopkinson II, 664 P.2d at 72.\n\n[¶111] A similar narrowing construction had been approved in Proffitt, 428 U.S. at 255-56, 96 S.Ct. at 2968. Later, however, the Court invalidated the use of vaguely defined aggravating factors as violative of the Eight Amendment, including the \"especially heinous, atrocious, or cruel\" aggravating circumstance, and the \"outrageously or wantonly vile, horrible or inhuman\" aggravating circumstance. Maynard v. Cartwright, 486 U.S. 356, 363-64, 108 S.Ct. 1853 1859, 100 L.Ed.2d 372 (1988); Godfrey v. Georgia, 446 U.S. 420, 428-29, 100 S.Ct. 1759, 1764-65, 64 L.Ed.2d 398 (1980). Maynard stated that, although not specifically limited to this construction, if the \"especially heinous, atrocious, or cruel\" aggravating circumstance were limited to murders involving \"some kind of torture or physical abuse,\" it would be constitutionally acceptable. Maynard, 486 U.S. at 365, 108 S.Ct. at 1859. The next year, the 1989 amendment to Wyoming's death penalty statute eliminated the use of heinous and limited those first degree murders deserving the death penalty to those \"especially atrocious and cruel, being unnecessarily torturous to the victim.\" Despite this specific history indicating the legislature intended to limit this aggravating circumstance as discussed in Maynard, Olsen contends that it is unconstitutionally vague and improperly applied to him. The State contends that the trial court properly limited this circumstance by the instruction defining the terms of the aggravating circumstance, thus curing any vagueness issue, and that this aggravating circumstance applies to execution-type slayings.\n\n[¶112] \"Claims of vagueness directed at aggravating circumstances defined in capital punishment statutes are analyzed under the Eighth Amendment and characteristically assert that the challenged provision fails adequately to inform juries what they must find to impose the death penalty and as a result leaves them and appellate courts with the kind of open-ended discretion held invalid in Furman v. Georgia.\" Maynard, 486 U.S. at 361-62, 108 S.Ct. at 1858.\n\n[¶113] The State's view receives some support from decisions of the Court assessing and approving Arizona's limitation of its \"especially heinous, atrocious, or cruel\" factor by equating \"cruel\" with infliction of \"mental anguish or physical abuse.\" Walton, 497 U.S. at 654-55, 110 S. Ct. at 3057-58. In Shell v. Mississippi, however, the Court ruled that the following instruction limiting \"especially heinous, atrocious or cruel\" was constitutionally insufficient:\n\nThe word heinous means extremely wicked or shockingly evil; atrocious means outrageously wicked and vile; and cruel means designed to inflict a high degree of pain with indifference to, or even enjoyment of, the suffering of others. Shell, 498 U.S. at 2, 111 S.Ct. at 313.\n\nIn a brief per curiam decision, the Court summarily ruled that this attempt to narrow the construction of a facially invalid aggravating circumstance violated Maynard and Godfrey. Id. at 3, 111 S.Ct. at 314. The distinction between Shell and Walton apparently rests not only upon Arizona's limitation of its \"especially heinous, atrocious, or cruel\" factor by defining that \"a crime is committed in an especially cruel manner when the perpetrator inflicts mental anguish or physical abuse before the victim's death,\" and that \"mental anguish includes a victim's uncertainty as to his ultimate fate,\" but also upon the Arizona Supreme Court's willingness to limit its application. Walton, 497 U.S. at 654-55, 110 S.Ct. at 3057-58.\n\n[¶114] The facts of Walton establishing substantial mental anguish before the victim's death were that Petitioner Walton and his two co-defendants, Robert Hoover and Sharold Ramsey, went to a bar in Tucson, Arizona, on the night of March 2, 1986, intending to rob someone at gunpoint. They encountered Thomas Powell, a young Marine, in the bar parking lot. After robbing him, they forced him into his car and he was driven out to a remote area of the desert. Id. at 644, 110 S.Ct. at 3052.\n\nPowell could not be certain of his fate, but as the city lights grew dim behind him, his fears for his life must have multiplied. He was so clearly terrified by the time they stopped that Sharold Ramsey tried to reassure him that they would not hurt him. But even if Powell took temporary refuge in her assurances, he soon realized that they meant to kill him. The defendant and Hoover forced Powell to lie face down on the ground outside the car while they argued over his fate. Although they had agreed to tie him up, the defendant, armed only with a gun but no rope to tie him, marched Powell off into the darkness, telling his companions to turn up the radio. The implication was clear to Powell, who was so upset that he urinated on himself and begged the defendant not to kill him. This evidences that Powell suffered great mental anguish both during the car ride when his fate was uncertain and in his final march into the desert when his fate had become certain. State v. Walton, 769 P.2d 1017, 1033 (Ariz. 1989).\n\nPowell was shot and left for dead; however, he survived another six days alone in the desert.\n\n[¶115] In Walton, the Arizona Supreme Court demonstrated that it limits the cruelty circumstance to situations where the suffering of the victim was intended by or foreseeable to the killer because, on direct appeal, it rejected the State's argument that the six days that Powell suffered after being shot constituted cruelty within the meaning of the statute when the evidence showed that the killer intended to kill the victim immediately. The court was further assured that Arizona appropriately applied its narrowing construction based upon those facts of Walton which did establish intentional infliction of substantial mental anguish.\n\n[¶116] The limiting instruction submitted to Olsen's jury is structurally similar to aspects of the instructions submitted in Hopkinson and Walton in that it defines some terms of the aggravating circumstance \"especially atrocious and cruel, being unnecessarily torturous to the victim.\" It is dissimilar because both Hopkinson and Walton defined terms of the aggravating circumstance \"especially heinous, atrocious or cruel.\" For the limiting instruction submitted to the Olsen jury to be proper, it must be decided that the change to the statutory language in the 1989 amendment did not change in meaning. The legislative intent of the change, however, was to change the meaning of this particular aggravating circumstance. First, it eliminated the use of \"heinous\" and limited those first degree murders deserving the death penalty to those \"especially atrocious and cruel, being unnecessarily torturous to the victim.\" Plainly the second phrase describes the first phrase and is deliberately joined to mean that the murder was \"especially atrocious and cruel\" because it was \"unnecessarily torturous to the victim.\" This change evidences an apparent legislative intent to establish torture as a core element of this particular aggravating factor. This interpretation finds support when we consider, as we must, that in Maynard, published the year before the amendment, the Court approved a limited application of the aggravating circumstance to murders involving \"some kind of torture or serious physical abuse.\" Each term of this aggravating circumstance does not establish separate, aggravating factors having an independent core meaning as the Olsen jury was instructed. Strictly construed, the standard set by this aggravating fact will be met by those murders which are accompanied by intentionally inflicted torture, either physical or mental, distinguishable from the usual, the ordinary, the normal sort of homicide in the typical murder case. See Hopkinson II, 664 P.2d at 73.\n\n[¶117] Having determined that this term plainly limits itself to murders involving intentionally inflicted torture as was described in Hopkinson II, we do not find that the term is facially invalid for vagueness under our limiting construction. Olsen's jury, however, was improperly instructed that each word of the term \"especially atrocious or cruel, being unnecessarily torturous to the victim\" established separate, aggravating factors having an independent core meaning other than torture. Under our interpretation of the state statute, this instruction is improper and reversible error. Clemons v. Mississippi, 494 U.S. 738, 747, 110 S.Ct. 1441, 1447-48, 108 L.Ed.2d 725 (1990) (state's interpretation of its own law controls). In this case, there was no evidence of physical torture, and Olsen's jury was presented with argument that conviction was appropriate under this aggravating circumstance because \"uncertainty as to his or her ultimate fate\" constituted mental torture. Our task is to determine whether the evi dence shows that this mental torture was intentionally inflicted to an extreme degree.\n\n[¶118] Our standard of review for whether sufficient evidence supports a jury's finding of an aggravating circumstance is the same that is used in determining sufficiency of evidence of guilt. Hopkinson II, 664 P.2d at 57-58.\n\n[T]he critical inquiry on review of the sufficiency of the evidence to support a criminal conviction must be not simply to determine whether the jury was properly instructed, but to determine whether the record evidence could reasonably support a finding of guilt beyond a reasonable doubt. But this inquiry does not require a court to \"ask itself whether it believes that the evidence at the trial established guilty beyond a reasonable doubt.\" Instead, the relevant question is whether, after viewing the evidence in the light most favorable to the prosecution, any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt. Id. (citations and emphasis omitted).\n\n[¶119] Relying upon Olsen's statements, the State describes the murders as establishing that mental anguish was caused by Olsen's having the victims lay down on the floor and wait to be shot, and that the mental anguish must have increased for at least two of the victims after the first victim was shot. This set of facts does not establish any intentional infliction of mental torture that proves beyond a reasonable doubt the murders were \"especially atrocious or cruel, being unnecessarily torturous to the victim.\" The facts of Hopkinson II establish the extreme degree of physical torture contemplated by the statutory language. In that case, the evidence was that, before death, the murder victim, while tied down, received over 140 burns on his body, including his eyes; five knife cuts on his neck and breasts; a bullet wound; bludgeoning; and extreme physical torture that could only have been intentionally inflicted over several hours. The facts of Walton discussed earlier establish the extreme degree of mental torture contemplated by Wyoming's statutory language. In comparison, the evidence of this case establishes a degree of mental anguish that, while significant, is not sufficient to be atrocious by proof beyond a reasonable doubt. Were we to decide otherwise, we would not be upholding the clear legislative intent to limit Wyoming's death penalty to the most culpable of murderers.\n\n2. Great Risk of Death Aggravating Circumstance\n\n[¶120] We next consider Olsen's challenge to the aggravating circumstance that he \"knowingly created a great risk of death to two or more persons.\" We have upheld application of this factor in Engberg v. State, 686 P.2d 541(Wyo. 1984), finding:\n\nThe testimony in this case further demonstrated beyond a reasonable doubt that Engberg seriously endangered the lives of Kay Otto and other persons present in the parking lot at the time of the robbery and murder, as well as that of his victim, Vernon Rogers. In shooting errantly at persons in parked vehicles in the lot, Engberg manifested an utter disregard for lives of innocent persons. This evidence demonstrated beyond a reasonable doubt that Engberg knowingly created a great risk of death to two or more persons. Id. at 557.\n\n[¶121] The State did not present any evidence or suggest that there were other bystanders involved who were threatened with grave harm as Olsen shot his intended victims. In applying this aggravating circumstance to Olsen, the State argued its basis was the harm inflicted upon the victims of his crime in a multiple homicide. The State defends its application by referring us to decisions in the jurisdictions of Oklahoma, Louisiana, and Mississippi, providing an interpretation that \"where there is more than one victim, where they are in the same building, room, or place, and within the same time frame, their killing may be said to have created a great risk of death to two or more persons.\" In contrast, Arizona has limited similar language to \"those factual situations where a grave risk of death has been created which threatens persons other than the intended victims.\" Arizona v. Tison, 633 P.2d 335, 351 (Ariz. 1981).\n\n[¶122] The State's contention that the legislature intended the death penalty to apply to multiple homicide comports neither with the plain language of the statutory circumstance because the legislature could easily have included \"multiple homicide\" language, nor with an intent to restrict use of the death penalty to the most culpable of murderers. States that have included multiple homicide as an aggravating circumstance do so in addition to the inclusion of the aggravating circumstance of creating a great risk of death to others, and they use explicit, plain language. Ariz. Rev. Stat. Ann. § 13-703(F)(8) (2001); \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Cal. Penal Code § 190.2(a)(3) (1999); \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Colo. Rev. Stat. Ann. § 16-11-103(5)(l) (2000); \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Idaho Code § 19-2515(h)(2) (1997). \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\n[¶123] Strictly construing the Wyoming statute, we do not find that the statutory language of this aggravating circumstance evidences a legislative intent that all multiple homicides will be subject to the death penalty. Instead, we find that the use of the terms \"risk\" and \"persons\" was given its proper application in Engberg's factual situation of placing bystanders in a parking lot at great risk of death by errant shooting. The State concedes that bystanders' lives other than the intended victims were not directly endangered during Olsen's crimes. It was reversible error to submit an instruction on this aggravating factor to the jury.\n\n3. Purpose of Avoiding or Preventing a Lawful Arrest Aggravating Circumstance\n\n[¶124] Olsen was charged with committing the murders \"for the purpose of avoiding or preventing a lawful arrest or effecting an escape from custody.\" In applying this aggravating circumstance to Olsen, the State contended the evidence showed that after the bartender told him that he would not get away with his crime, Olsen realized the witnesses in the bar could identify him and he then executed them. Olsen contends that application of the aggravator under these circumstances permits it to be valid in any homicide case, because in virtually every homicide there is a witness silenced, and an arrest thus potentially prevented. He points out that such application would call into question the constitutional validity of the aggravator because \"[t]here [would be] no principled way to distinguish this case, in which the death penalty is imposed, from the many cases in which it was not,\" citing Godfrey, 446 U.S. at 433, 100 S.Ct. at 1767. He urges that no evidence establishes and this court cannot find that the dominant motive for the murder was the elimination of witnesses. He contends that the aggravating circumstance is properly limited to those cases where it is the dominant motive, as illustrated by those situations involving an imminent arrest or those cases where the victim of the murder is a witness to an earlier independent crime.\n\n[¶125] Hopkinson II and Hopkinson III considered the application of this factor. This court found the evidence established that the victim was an accomplice murdered because he was to testify before a grand jury about Hopkinson's role in an earlier multiple murder. Hopkinson v. State, 696 P.2d 54, 70 (Wyo. 1985) (Hopkinson III); Hopkinson II, 664 P.2d at 58-59. The State contends that limiting this factor to witnesses in an ongoing investigation as in Hopkinson would make this aggravating circumstance practically indistinguishable from the aggravating circumstance in § 6-2-102(h)(viii). \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\n[¶126] Again, our task is to strictly construe the plain language of this aggravating circumstance, giving it a constitutional construction if possible, and giving effect to legislative intent. We have already determined that it is the legislative intent to limit application of the death penalty to the most culpable of crimes. Plainly, the legislature intended that the death penalty apply to those murders motivated to avoid or prevent a lawful arrest or effect an escape from custody although the murders also occurred during commission of a robbery, the aggravating circumstance articulated in § 6-2-102(h)(xii). \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\n[¶127] The evidence supports finding that the only motive for the execution-type killings after the victims had cooperated and the robbery was accomplished was as Olsen admitted, namely, to eliminate identification witnesses. The statutory language is exactly similar to Florida's statutory language which has been held to encompass application of this provision to the murder of a witness to a crime. Riley v. State, 366 So.2d 19, 22 n.4 (Fla. 1978). Riley established that the mere fact of a death is not enough to invoke this factor when the victim is not a law enforcement official. Id. at 22. In a later decision, when confronted with evidence that use of a silencer on a gun suggested a motivation to avoid arrest and detection, Florida rejected that argument, holding that motive would not be assumed and requiring that the evidence must clearly show that the dominant or only motive for the murder was the elimination of witnesses. Menendez v. State, 368 So.2d 1278, 1282 (Fla. 1979). Florida has consistently found that \"[s]tanding alone, the fact that the victim could identify the murderer does not prove beyond a reasonable doubt that the elimination of a witness was a dominant motive for the killing.\" Bruno v. State, 574 So.2d 76, 81-82 (Fla. 1991); see also Floyd v. State, 497 So.2d 1211, 1214-15 (Fla. 1986); Bates v. State, 465 So. 2d 490, 492 (Fla.1985). We hold that these rules should apply for this aggravating circumstance under Wyoming's statute. Olsen's concern that in virtually every homicide there is a witness silenced, and an arrest thus potentially prevented, does not arise when the State is required to prove beyond a reasonable doubt that the dominant motive is to eliminate witnesses to a crime.\n\n[¶128] In this case, sufficient evidence supports finding that this aggravating circumstance existed. Olsen stated that none of the victims resisted him during the robbery and the robbery was accomplished before he shot them. Olsen stated that he shot the victims because they could identify him. This evidence established that Olsen's dominant motive for the murders was to eliminate the witnesses to his crime of robbery and established for the jury beyond a reasonable doubt the aggravating circumstance of murder to avoid or prevent a lawful arrest.\n\n4. Premeditated Felony Murder Aggravating Circumstance\n\n[¶129] Olsen contends that after he was convicted of premeditated first degree murder and felony murder, the premeditation and robbery elements of those crimes were used to establish the \"premeditated felony murder\" aggravating circumstance in violation of Engberg. The State contends that Engberg is distinguishable because it is limited to those cases where an underlying felony is used to convict a defendant of felony murder only; in this case, Olsen was also convicted of premeditated first degree murder, thus Engberg does not apply. We agree with the State.\n\n[¶130] Engberg's rationale is that when an element of felony murder is itself listed as an aggravating factor, the Furman/Gregg constitutional requirement of narrowing the class of persons to be sentenced to death is not met. Engberg, 820 P.2d at 90. Engberg defined aggravation as:\n\n\"Any circumstance attending the commission of a crime or tort which increases its guilt or enormity or adds to its injurious consequences, but which is above and beyond the essential constituents of the crime or tort itself.\" Id. (quoting Black's Law Dictionary 60 (5th ed. 1979)).\n\nIn Engberg, the robbery established an essential element of the crime of felony murder and of two aggravating circumstances: the murder was committed while the defendant was engaged in the commission of a felony, and the murder was committed for pecuniary gain. Id. at 89. Engberg's holding was very specific:\n\nWe now hold that where an underlying felony is used to convict a defendant of felony murder only, elements of the underlying felony may not again be used as an aggravating factor in the sentencing phase. Id. at 92.\n\nOlsen was convicted of both felony murder and premeditated first degree murder, and Engberg does not apply. We disagree with Olsen's claim that permitting this aggravating factor does not narrow the class of persons to be sentenced to death. Once Olsen was convicted of premeditated first degree murder, this aggravating circumstance constitutionally submitted the question of whether he was eligible for the death penalty on the basis that he was engaged in the commission of a robbery. The trial court did not err in instructing the jury to consider this aggravating circumstance.\n\n5. Summary\n\n[¶131] We have invalidated two of the four aggravating circumstances for which Olsen was convicted. Although he was properly convicted of two aggravating circumstances, his sentence cannot be affirmed. \"An automatic rule of affirmance in a weighing state [is] invalid under Lockett v. Ohio, 438 U.S. 586, 98 S.Ct. 2954, 57 L.Ed.2d 973 (1978), and Eddings v. Oklahoma, 455 U.S. 104, 102 S.Ct. 869, 71 L.Ed.2d 1 (1982), for it would not give defendants the individualized treatment that would result from actual reweighing of the mix of mitigating factors and aggravating circumstances.\" Clemons, 494 U.S. at 752, 110 S.Ct. at 1450.\n\n[¶132] We vacate the sentence of death and remand for a new sentencing hearing.\n\nD. Mitigating Circumstances\n\n[¶133] Olsen advises that his second argument, that the statute is unconstitutional, applies only if Wyoming is a nonweighing state. Having determined that Wyoming is a weighing state, we will not further consider this issue. However, Olsen submits two challenges to the instructions the jury received on mitigating circumstances, and we now turn to them.\n\n1. Law of Mitigating Circumstances\n\n[¶134] Olsen's sentencing jury was instructed to consider whether twenty-one specifically listed mitigating circumstances existed by a preponderance of the evidence. Although the existence of a number of these mitigating circumstances was unrefuted, and would reasonably be expected to have been considered in the jury's weighing process, the jury did not unanimously find that any of these spe cifically listed mitigating circumstances existed. Olsen contends that improper instructions precluded the jury from considering relevant mitigating evidence in its consideration of an appropriate penalty. The federal standard for determining whether jury instructions satisfy these principles is \"whether there is a reasonable likelihood that the jury has applied the challenged instruction in a way that prevents the consideration of constitutionally relevant evidence.\" Boyde v. California, 494 U.S. 370, 380, 110 S.Ct. 1190, 1198, 108 L.Ed.2d 316 (1990). To determine this issue, we apply our well-established standard of review:\n\n[A] trial court has a duty to instruct the jury on the general principles of law applicable to the case before it. A trial court is given wide latitude in instructing the jury, and we will not find reversible error as long as the instructions given to the jury correctly state the law and adequately cover the relevant issues. Baier v. State, 891 P.2d 754, 756 (Wyo.1995).\n\nWhen determining whether the charge to the jury properly expressed the issues actually raised by the evidence, we look at the charge in its entirety, reading all of the instructions together. Vigil v. State, 859 P.2d 659, 663 (Wyo. 1993); Baier, 891 P.2d at 756; Hatheway v. State, 623 P.2d 741, 743 (Wyo. 1981). Jury instructions should inform the jury about the applicable law so the jury may apply that law to its findings on the material factual issues. Compton v. State, 931 P.2d 936, 939 (Wyo. 1997). \"It is critical that instructions correctly articulate Wyoming law because it is from the instructions that a jury decides if someone is to be found guilty or not guilty.\" Oien v. State, 797 P.2d 544, 548 (Wyo. 1990). Brett v. State, 961 P.2d 385, 389 (Wyo. 1998).\n\n\"The general rule in reviewing questions involving instructions is that the trial judge is afforded latitude to tailor the instructions to the facts of the case, and reversible error will not be found as long as the instructions when viewed as a whole and in the context of the entire trial fairly and adequately cover the issues.\" Brown v. State, 817 P.2d 429, 438 (Wyo.1991) (quoting Scadden v. State, 732 P.2d 1036, 1053 (Wyo. 1987)). The standard of review for a requested-but-refused jury instruction is established by Oien v. State, 797 P.2d 544 (Wyo. 1990) and Thom v. State, 792 P.2d 192 (Wyo.1990). \"The refusal to allow an instruction requested by the defendant when due process requires the defendant's instruction be given is reversible error per se.\" Oien, 797 P.2d at 549. \"[A] defendant has the right to have instructions on his theory of the case or his theory of defense presented to the jury if the instructions sufficiently inform the jury of the theory or defense and if competent evidence exists which supports the law expressed in the instructions.\" Thom, 792 P.2d at 195. Evidence is competent if a reasonable jury would conclude that it supports the defendant's position, even if, in the opinion of the court, the evidence is weak, inconclusive, or unworthy of belief. Goodman v. State, 573 P.2d 400, 409 (Wyo.1977). In determining whether evidence is competent to support an instruction on a defense theory of the case, evidence is to be viewed in a light favorable to the defendant and taken as true. Chavez-Becerra v. State, 924 P.2d 63, 67 (Wyo.1996). Swartz v. State, 971 P.2d 137, 140 (Wyo. 1998).\n\n[¶135] The specific instructions that Olsen challenges are Instruction No. 12, which instructed the jury that it \"may consider whether a defendant has established the existence of any mitigating factors,\" and Instruction No. 13, which instructed that the jury \"may consider any fact or circumstance of Martin Olsen's character or prior record or matter surrounding his offense which serves to mitigate his culpability.\" Olsen challenges the discretionary language presented by the term \"may,\" contending that the statutory language and constitutional principles require mandatory language such as \"shall.\" The State contends that the mandatory consideration was apparent from Instruction No. 3 which defined a mitigating factor as \"any aspect of a defendant's character or background, or any circumstance of the offense, which might indicate, or tend to indicate, that the defendant should not be sentenced to death;\" Instruction No. 10 which instructed that if the jury found the existence of at least one aggravating factor beyond a reasonable doubt, it \"must consider any mitigating evidence;\" and the verdict form which included instructions that the jury consider any mitigating factor that it unanimously or individually found to exist. Olsen contends that the jury's failure to find any of the mitigating factors specifically listed on the verdict form despite the fact that each was established upon reasonable testimony, and many were unrefuted, or did not involve credibility, establishes the inadequacies of Instruction Nos. 12 and 13. The State replies that the completed verdict form where the jury determined that no specifically listed mitigating factor was unanimously agreed upon, but individual jurors found some of the specifically listed factors and wrote in others, proves the jury understood the instructions and did consider the mitigating evidence and the mitigating circumstances proposed by Olsen.\n\n[¶136] The State's response is similar to statements made by the Court in Buchanan v. Angelone, 522 U.S. 269, 118 S.Ct. 757, 139 L.E.2d 702 (1998). In Buchanan, the issue was whether the Eighth Amendment required States to instruct juries on the concept of mitigation or adopt specific standards for instructing juries on mitigating circumstances. We disagree with the State that Buchanan resolves this issue, because, here, Olsen has presented the issue of whether, considering the jury instructions as a whole, the jury instructions properly complied with the Eighth Amendment requirement that the sentencer may not be precluded from considering, and may not refuse to consider, any constitutionally relevant mitigating evidence. Penry v. Lynaugh, 492 U.S. 302, 317-18, 109 S.Ct. 2934, 2946-47, 106 L.Ed.2d 256 (1989); Eddings, 455 U.S. at 113-14, 102 S.Ct. at 876-77; Lockett, 438 U.S. at 604-05, 98 S.Ct. at 2964-65. Additionally, Wyoming's death penalty statute specifies the process for consideration by a sentencing jury. The State tells us that process required by the statute for considering mitigating circumstances is\n\nthe distinction between mitigating evidence and mitigating circumstances must be noted. Mitigating circumstances are aspects of a defendant's character or the crime which show, although he is qualified for the death penalty, that it should not be imposed. On the other hand, mitigating evidence is all relevant proof which a defendant might offer in an attempt to establish the existence of mitigating circumstances. In evaluating mitigating evidence, to determine whether mitigating circumstances exist, Wyoming juries are logically required to make two findings: 1) that the proposed character trait of the defendant or his crime has been proven to exist and 2) that those proven characteristics have mitigating value and reduce the defendant's culpability. Once a jury so determines that mitigating circumstances exist, it is then required to decide whether those circumstances are such that a death sentence is not appropriate.\n\n[¶137] Similarly, the Court has said that mitigating evidence is always relevant to the sentencer to determine the appropriate sentence. A jury's unanimous decision that mitigating circumstances do not exist does not make the evidence irrelevant. McKoy v. North Carolina, 494 U.S. 433, 440, 110 S.Ct. 1227, 1232, 108 L.Ed.2d 369 (1990).\n\nThe mitigating circumstances not unanimously found to be present by the jury did not become \"irrelevant\" to mitigation merely because one or more jurors either did not believe that the circumstance had been proved as a factual matter, or did not think that the circumstance, though proved, mitigated the offense. Id. at 440-41, 110 S.Ct. at 1232.\n\nImposing the death penalty must be \"directly related to the personal culpability of the criminal defendant,\" and must \"reflect a reasoned moral response to the defendant's background, character, and crime.\" California v. Brown, 479 U.S. 538, 545, 107 S.Ct. 837, 841, 93 L.Ed.2d 934 (1987) (O'Connor, J., concurring). Consequently, a judge's instructions during sentencing phase proceedings may not preclude the jury \"from considering, as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentenc e less than death.\" Lockett, 438 U.S. at 604, 98 S.Ct. at 2964-65. \"[I]t is not enough simply to allow the defendant to present mitigating evidence to the sentencer. The sentencer must also be able to consider and give effect to that evidence in imposing sentence.\" Penry, 492 U.S. at 319, 109 S.Ct. at 2947.\n\n[¶138] It appears that the closest description of the process the State asserts the jury was to engage in is found in Instruction No. 14, which states in pertinent part:\n\nAfter you have completed your findings as to the existence or absence of any aggravating or mitigating factors, you will then engage in a decision process. In determining whether a sentence of death is appropriate, all of you may consider any aggravating factors that you unanimously found to exist -- and each of you may consider any mitigating factors that you individually find to exist.\n\nIf you unanimously conclude that the aggravating factors found to exist are sufficient to justify a sentence of death, you may consider whether any mitigating factors exist before you impose a sentence of death. Keep in mind, however, that regardless of your findings with respect to aggravating and mitigating factors, you are never required to impose a death sentence.\n\nThe precise statutory language concerning the jury's process of considering aggravating and mitigating circumstances is:\n\n(d) Upon conclusion of the evidence and arguments the judge shall give the jury appropriate instructions, including instructions as to any aggravating and mitigating circumstances,\n\n. . . :\n\n(i)After hearing all the evidence, the jury shall deliberate and render a sentence based upon the following:\n\n(A) Whether one (1) or more aggravating circumstances exist beyond a reasonable doubt as set forth in subsection (h) of this section;\n\n(B) Whether, by a preponderance of the evidence, mitigating circumstances exist as set forth in subsection (j) of this section; and\n\n(C) The mere number of aggravating or mitigating circumstances found shall have no independent significance.\n\n(ii)Based upon the considerations in paragraph (i) of this subsection, the jury shall unanimously determine whether the defendant should be sentenced to death or life imprisonment. The jury shall consider aggravating and mitigating circumstances unanimously found to exist, and each individual juror may also consider any mitigating circumstances found by that juror to exist[.] § 6-2-102(d).\n\nAs can be seen, the instruction uses substantially the same wording as the statute; however, the trial court apparently attached no significance to the statutory phrase \"the jury shall consider aggravating and mitigating circumstances\" and this phrase is noticeably absent from the instruction. We realize that instructing the jury that it \"shall\" consider aggravating factors may confuse a jury or impermissibly suggest that a death penalty is required. If the trial court's purpose in using \"may\" as many times as it did in this instruction and in Instruction Nos. 12 and 13 was to convey to the jury that it was not required to impose the death penalty, we find that purpose served by the last sentence of Instruction No. 14.\n\n[¶139] The statutory phrase \"the jury shall consider aggravating and mitigating circumstances\" is significant under Wyoming's death penalty statutory scheme. This phrase describes the process intended to distinguish between a penalty of life imprisonment and death. Having unanimously found those aggravating circumstances that exist beyond a reasonable doubt and those mitigating circumstances that exist by a preponderance of the evidence, it is the jury's duty to engage in a process to determine which of the two penalties, life imprisonment or death, is justified and appropriate in a particular case. That the statute intends this consideration to be a \"mental balancing process,\" \"a reasoned judgment,\" and a consideration of the \"substantiality and persuasiveness\" of all of the circumstances is clear from its prohibition that the mere numbers of each are not to be considered. See People v. Brown, 726 P.2d 516, 532-33 (Cal. 1985) (citing State v. McDougall, 301 S.E.2d 308, 326 (N.C. 1983); State v. Dixon, 283 So. 2d 1, 10 (Fla. 1973); State v. Wood, 648 P.2d 71, 83 (Utah 1982)). Olsen's proposed Jury Instruction No. 6 in part accurately describes the process intended by this phrase:\n\nA consideration of circumstances and factors is a thoughtful process that is not totally objective, it requires each juror to respond in human terms to sentencing evidence in assessing the appropriate penalty for this defendant. You must decide how compelling or persuasive the totality of the mitigating factors are when compared against the totality of the aggravating factors. You cannot be governed or influenced by mere sentiment of passion or prejudice, however, you may consider mercy, and decline to impose the death penalty after a thoughtful consideration of this evidence.\n\nAfter reviewing instructions from other states as well as Olsen's proposed instruction, we believe a more accurate instruction would be:\n\nThe weighing of aggravating and mitigating circumstances does not mean a mere mechanical counting of factors on each side of an imaginary scale, or the arbitrary assignment of weights to any of them. You are free to assign whatever moral or sympathetic value you deem appropriate to each and all of the various factors you are permitted to consider.\n\nIn weighing the various circumstances you determine under the relevant evidence which penalty is justified and appropriate by considering the totality of the aggravating circumstances with the totality of the mitigating circumstances. In reaching a reasoned, moral judgment about which penalty is justified and appropriate, you must decide how compelling or persuasive the totality of the mitigating factors are when compared against the totality of the aggravating factors. You cannot be governed or influenced by sentiment, passion or prejudice, however, you may consider mercy, and decline to impose the death penalty after a thoughtful consideration of the evidence. To return a judgment of death, each of you must be persuaded that the aggravating circumstances are so substantial in comparison with the mitigating circumstances that it warrants death instead of a life sentence. See California Jury Instructions, Criminal §8.88 at 517-18 (6 th ed. 1996).\n\n[¶140] In examining all of the other submitted jury instructions, we see that Olsen's jury received inconsistent instruction in the steps of the statutory process it is to engage in and no useful instruction in how it is to engage in this statutory process. We recommend that the trial court instruct on the principles just set forth.\n\n[¶141] We also do not find that the jury was appropriately instructed on the definitions of \"aggravating\" and \"mitigating.\" In Instruction No. 3, these terms are defined as:\n\nAn aggravating factor is a specified fact or circumstance which might indicate, or tend to indicate, that the defendant should be sentenced to death. A mitigating factor is any aspect of a defendant's character or background, or any circumstance of the offense which might indicate or tend to indicate that the defendant should not be sentenced to death.\n\nA more useful instruction would be:\n\nAn aggravating factor is a specified circumstance attending the commission of a crime which increases its guilt or enormity, or adds to its injurious consequences which is above and beyond the elements of the crime itself. A mitigating circumstance is any fact, condition or event which does not justify or excuse the crime in question, but may be considered as an extenuating circumstance in determining the appropriateness of the death penalty. See California Jury Instructions, supra, at 517.\n\n[¶142] We hold that the jury instructions about mitigating circumstances do not correctly state the law mandated by § 6-2-102(d), and this failure is reversible error. Upon remand for resentencing, jury instructions should reflect the intended statutory process and clarify the jury's decision process in comparing the totality of aggravating and mitigating circumstances.\n\n2. Burden of Proof\n\n[¶143] The statutory language mandates that the jury determine the existence of aggravating and mitigating circumstances before determining the appropriate punishment. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The statute's language that aggravating circumstances be proved beyond a reasonable doubt and mitigating circumstances be proved by a preponderance of the evidence references burdens assigned to factual issues. The Court has held that states are free to structure and shape consideration of mitigating evidence \"in an effort to achieve a more rational and equitable administration of the death penalty.\" Boyde, 494 U.S. at 377, 110 S.Ct. at 1196. The Court has also held that burdening the defendant with the preponderance of the evidence standard does not violate constitutional principles, so long as a state's burden to prove the existence of aggravating circumstances is not lessened. Walton, 497 U.S. at 649-50, 110 S.Ct. at 3055. Here, the statute does not expressly assign the burden to the defendant, and Olsen contends the district court erred in assigning the burden to him in jury instructions.\n\n[¶144] The statute does not expressly read that it is the State which is to prove the existence of aggravating circumstances or that it is the defendant who is to prove the existence of mitigating circumstances; nevertheless, we assume that the legislature intended that the respective burdens be assigned to each. Generally, the defendant is assigned the burden of coming forward with evidence in his behalf because he is in the best position to do so. Walton established that a statute which assigns the preponderance of the evidence standard to the defendant's mitigating evidence does not violate the constitution. We conclude that the legislature intended to assign those burdens as it would in the guilt phase. The State bears the burden of proving an aggravating circumstance beyond a reasonable doubt and the defendant has the burden of producing proof of mitigating circumstances as he would with an affirmative defense. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\n[¶145] In the next step outlined in § 6-2-102(d)(ii), the jury is to \"consider aggravating and mitigating circumstances.\" As previously determined, the legislature intended for the jury to engage in a statutory process of identifying the circumstances proved to exist and then deliberate whether the totality of the aggravating circumstances are so substantial in comparison to the totality of mitigating circumstances as to warrant the death penalty. This language can only be read to require that in the sentencing phase of a capital trial the burden of proof necessary for a verdict of death over life imprisonment is on the State. See State v. Brown, 607 P.2d 261, 272 (Utah 1980) (Stewart, J., concurring) (quoting State v. Pierre, 572 P.2d 1338, 1347-48 (1977)). If the jury is to be instructed to \"weigh,\" the defendant must produce proof of mitigating circumstances; however, just as in affirmative defenses, the burden of negating this mitigating evidence by proof beyond a reasonable doubt remains with the State. Duckett v. State, 966 P.2d 941, 947-48 (Wyo. 1998).\n\n3. Failure to Instruct on Mitigating Circumstance of Duress\n\n[¶146] In his seventh issue, Olsen contends that the trial court erred in failing to instruct the jury that he was under extreme duress as permitted in § 6-2-102(j)(v) which states, \"[t]he defendant acted under extreme duress or under the substantial domination of another person.\" Olsen contends that Dr. Gummow testified on both direct and cross-examination that it was her opinion that Olsen was acting under duress at the time of the crimes.\n\nWhen an instruction has been offered presenting the defendant's theory of the case, or defense, that instruction or a similar instruction must be presented to the jury if it is supported by competent evidence. Stapleman [v. State], 680 P.2d [73] at 75 [(Wyo. 1984)] (citing Goodman v. State, 573 P.2d 400, 408 (Wyo.1977); Blakely v. State, 474 P.2d 127 (Wyo.1970)). We look to the record to determine if competent evidence presented at trial required an instruction presenting the defendant's theory. Stapleman, 680 P.2d at 75. In reviewing the record for competent evidence, we view the evidence in a light as favorable to the accused as is justifiable. Id.; Eatherton v. State, 761 P.2d 91, 95 (Wyo.1988). The instruction must be given if a jury could reasonably conclude the evidence supports the defendant's position, even if the court deems the evidence to be weak or unworthy of belief. Stagner v. State, 842 P.2d 520, 523 (Wyo.1992). Brett, 961 P.2d at 389.\n\nBecause the law requires the trial court to accurately instruct the jury on the applicable law that is supported by evidence, Olsen asserts the failure to instruct his jury on this statutory mitigating circumstance was reversible error. Dr. Gummow's testimony provided sufficient evidence to permit an instruction on this mitigating circumstance, and it was error to refuse the instruction.\n\n4. Adequacy of the Verdict Form\n\n[¶147] Wyoming's death penalty statute imposes a process on the jury deliberations to permit consideration of the defendant's individuality and appellate review. It requires a verdict form stating the aggravating circumstances found to exist beyond a reasonable doubt, the mitigating circumstances found to exist by a preponderance of the evidence, and the ultimate sentence that should inform how the jury considered those existing circumstances.\n\n[¶148] In this case, the jury did not unanimously find that any mitigating circumstances existed by a preponderance of the evidence. Our review of the evidence indicates that many of these mitigating circumstances were proved by a preponderance of the evidence and were uncontradicted by the State. The purpose of mitigating evidence should be clear to a sentencing jury, namely, that this is the selection stage of the process ensuring the constitutionally required consideration of the individual characteristics of the defendant. In the appellate review process, it must be apparent that the jury, through the verdict form, considered any constitutionally relevant mitigating evidence. In the selection phase, the sentencer may not be precluded from considering, and may not refuse to consider, any constitutionally relevant mitigating evidence. The failure of this jury to unanimously find that any of these uncontradicted mitigating circumstances existed strongly indicates that when the the jury considered the evidence, it may have failed to consider those mitigating circumstances proved by a preponderance. Had the jury unanimously found the existence of the specifically listed mitigating circumstances set forth on the verdict form and still imposed the penalty of death, our appellate review could satisfactorily conclude that jury consideration occurred and appropriately determined death.\n\n[¶149] In a previous argument, the State informed us that the statutory language of § 6-2-102(d) requires that the jury must engage in a two -step process when making its sentencing decision: The jury must determine if the mitigating evidence supporting the mitigating circumstance has proved that circumstance by a preponderance of the evidence; and if so, it must then decide whether the proven mitigating circumstance requires sentencing the defendant to a life sentence, rather than to a death sentence. We agree that these are the two questions posed; however, the format of this verdict form does not provide for a two -step decisionmaking process. Parts I and II of the verdict form require the jury to mark each aggravating and mitigating circumstance found to exist and decide the first question. Part III of the verdict form entitled \"SENTENCE\" states:\n\nInstructions: Your verdict as to the appropriate sentence in this case shall be based on your findings, as set forth in Parts I and II of this verdict form. With respect to aggravating factors, your deliberations are confined to those which you have marked with an \"X\" in Column \"A\" of Part I. You may not impose the death penalty unless you have unanimously found that at least one aggravating circumstance has been proved beyond a reasonable doubt. With respect to mitigating factors, you must consider those unanimously found to exist and marked with an \"X\" in Column \"A\" of Part II.\n\nEach of you may also consider any mitigating circumstance which you individually found to exist, as indicted [sic] with an \"X\" in Column \"C\" of Part II. The mere number of aggravating or mitigating circumstances found shall have no independent significance. While your sentence should reflect your individual assessments as to the significance of aggravating and mitigating circumstances on this case, you must be unanimous in your decision to assess the death penalty.\n\nVERDICT:\n\nCOUNT I\n\nWe, the jury, having been duly empaneled and sworn to try the above cause, and having made the above findings with respect to aggravating and mitigating circumstances in accordance with the instructions of the court, do hereby impose the following as the appropriate sentence in this case: (Mark one)\n\n______________________ LIFE IMPRISONMENT\n\n______________________ DEATH PENALTY\n\n****\n\nPart III of the verdict form does not provide for consideration and determination of the second step of the decision-making process. According to the statutory language, and the State's earlier argument, after the jury determines the existence of aggravating circumstances and mitigating circumstances, the jury should be instructed to consider the totality of the aggravating circumstances with the totality of the mitigating circumstances. If the jury finds that no aggravating circumstance has been proved beyond a reasonable doubt, the jury should find that the sentence is life imprisonment. If the jury finds that at least one aggravating circumstance has been proved beyond a reasonable doubt, but the mitigating circumstances outweigh the aggravating circumstances, the jury should find that the sentence is life imprisonment. If the jury finds that at least one aggravating circumstance has been proved beyond a reasonable doubt, and that the aggravating circumstance(s) outweigh the mitigating circumstances, the jury should find that the sentence is death. The jury is never required to impose a sentence of death.\n\n5. Summary\n\n[¶150] The State has the burden of proving aggravating circumstances beyond a reasonable doubt, and a defendant has the burden of proving mitigating circumstances by a preponderance of the evidence. Jury instructions should properly describe the jury's decision-making process and properly reflect the State's burden of proof. Equally important, an adequate verdict form should accurately reflect the State's burden of proving aggravating circumstances and rebutting mitigating circumstances. Finally, the evidence supported a jury instruction on the mitigating circumstance of duress. We conclude that Olsen's jury was not properly instructed on the law of mitigating circumstances as intended by Wyoming's death penalty statute. We vacate the sentence of death and remand for a new sentencing hearing.\n\nE. Role of Victim Impact and Mercy Plea Evidence\n\n1. Admissibility of Victim Impact Evidence\n\n[¶151] Four months before trial, Olsen's counsel filed three motions addressing the subject of the prosecution's introduction of victim impact evidence, which is evidence relating to the personal characteristics of the victim and the emotional impact of the crime on the victim's family. Payne v. Tennessee, 501 U.S. 808, 817, 111 S. Ct. 2597, 2604, 115 L. Ed. 2d 720 (1991). In the first motion, Olsen asked the court not to allow the introduction of such evidence. He asserted that victim impact evidence is aggravating evidence which is not explicitly listed among and is not directly or indirectly related to the twelve aggravating circumstances enumerated in § 6-2-102(h); the strict capital sentencing procedure set forth by the legislature in § 6-2-102 is binding on the sentencing authority (in this case, the jury); that procedure contains no explicit provision allowing the jury to consider any non-statutory aggravating circumstance; and admission of such evidence at the sentencing phase would violate his right to due process and fundamental fairness as guaranteed under the Fifth, Sixth, and Fourteenth Amendments of the United States Constitution and Sections 6 and 10 of Article 1 of the Wyoming Constitution and would risk the arbitrary and capricious imposition of the death sentence contrary to the Eighth Amendment of the United States Constitution and Sections 14 and 15 of Article 1 of the Wyoming Constitution.\n\n[¶152] In the second motion, Olsen asked the court not to allow the introduction of victim impact evidence under the authority of Rule 32(c)(1) of the Wyoming Rules of Criminal Procedure and Wyo. Stat. Ann. § 7-21-101 through 103, the general victim impact statutes, because they apply to victim impact evidence submitted to the court, when acting as the sentencing authority, not to the jury, as the sentencing authority as in this case, and because the procedural rule conflicts with § 6-2-102(h), the explicit capital sentencing procedure.\n\n[¶153] In the third motion, Olsen asked the court to review before trial all victim impact evidence that the prosecution intended to introduce at the capital sentencing proceeding in order to ensure that such evidence as the court might allow was within constitutional and statutory limitations, was of probative value, and was not out-weighed by its unfairly prejudicial or inflammatory nature.\n\n[¶154] In responses filed several months later, the prosecution asked the court to deny each of Olsen's three motions. Relying on the Payne decision, the prosecution stated that Olsen's federal constitutional arguments were untenable, leaving for the court's determination only whether Wyoming law permitted the capital sentencing jury's consideration of victim impact evidence. Although the prosecution recognized that the specific question whether under Wyoming law victim impact evidence was admissible in the sentencing phase of a capital trial was one of first impression in Wyoming, the prosecution asserted that such evidence was likely admissible under the authority of § 6-2-102(c), a provision of the capital sentencing scheme, and § 7-21-101 through 103, the general victim impact statute. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e In particular, the prosecution pointed to the first sentence of § 6-2-102(c), which reads:\n\nThe judge or jury shall hear evidence as to any matter that the court deems relevant to a determination of the sentence, and shall include matters relating to any of the aggravating or mitigating circumstances enumerated in subsections (h) and (j) of this section. (emphasis added.)\n\nAccording to the prosecution's argument, the emphasized language in subsection (c) is sufficiently \"open-ended\" to allow the jury to consider evidence as to any matter in addition to the statutorily enumerated aggravating and mitigating circumstances. Thus, \"any matter\" arguably is broad enough to embrace the matter of victim impact, according to the prosecution.\n\n[¶155] A few days before the court's hearing on Olsen's three motions, Olsen submitted additional briefing in further support of his motions. At the court's hearing on Olsen's three motions, the court heard further argument from Olsen's counsel and the prosecution on the question before ruling. Ruling on the three motions, the court denied Olsen's two motions which sought to prevent the prosecution's introduction of victim impact evidence and granted Olsen's motion which sought the court's review of the evidence before its introduction. Announcing its rulings, the court said:\n\nThe court had great concern concerning these motions dealing with the victim impact in this matter. The court is cognizant of the Supreme Court case of Payne v. Tennessee, and has recognized that the trend appears to be that the decider of the penalty is entitled to certain evidence which should come for [sic] that body, be it the court or the jury for determination of whether the death penalty should or should not be imposed.\n\nThe court is concerned in this particular case absent of Wyoming statutes specifically requiring those kinds of things to be given to a jury in a death penalty case; however, it would appear that the trend in this country is that the decider should be entitled to have certain evidence before it.\n\nIn that regard pursuant to the holding in Payne v. Tennessee, the court is going to allow certain victim impact statements, but those are going to be limited. That is 1) evidence about the victim and 2) about the impact of the murder on the victim's family which the court believes is relevant to the jury in this case.\n\nThe court will not allow any family members for characterization or opinions about the crime, or the Defendant, or the appropriate sentencing. The court believes that those, of course, would violate the Defendant's right under the Eighth Amendment.\n\nThe court is also going to ask that these statements be in written form prior to testimony so that the court can have a judicial review of those items prior to the time such statements or testimony is given to a jury in the death penalty phase, if the case should go that far.\n\n[¶156] After the guilt phase of the trial and before the start of the sentencing phase, Olsen's counsel renewed the objection to the prosecution's introduction of the victim impact evidence; the court allowed Olsen to have a continuing objection. Olsen also objected to having a witness read the victim impact statements before the jury, expressing the belief that such a reading would inject a factor of emotionalism into the proceeding. Olsen's counsel requested that the court read the statements to the jury; the court denied that request, ruling that the victim who prepared the statement would read it. Olsen's counsel requested, and the court granted, a continuing objection to the ruling.\n\n[¶157] During the State's case-in-chief in the sentencing phase, the prosecution introduced into evidence three victim impact statements. Jan Rosenbach, director of the Victims of Violence Center in Worland, read to the jury the statements of Dolly Sorenson, victim Emma McCoid's mother, and June Marx, victim Arthur Taylor's ex-wife. Beverly Baumstarck, mother of victim Kyle Baumstarck, read her statement to the jury. Copies of these statements are attached as Appendix B to this opinion. The prosecution also introduced into evidence, over Olsen's objection, a photograph of each victim.\n\n[¶158] During the State's closing argument, the prosecutor commented on the matter of victim impact:\n\nThe harm, the circumstances of the crime, the immensity, the total enormity of the evil done here is incalculable. I cannot put it into words, the rippled effect of what this man did. He not only ruined this family, the Taylor family, he ruined, severely impacted, I'm not going to say ruined because they are tough people, he impacted the Baumstarck family, he impacted the McCoid family.\n\nDuring rebuttal closing argument, the prosecutor made a final comment on the matter of victim impact:\n\nKyle and Art and Emma were loved as well and loved back too. They don't get to do that anymore.\n\n[¶159] Raising the victim impact issue on appeal, Olsen presents essentially the same arguments as he did below. He contends that the trial court's ruling allowing the prosecution's introduction of victim impact evidence during the capital sentencing phase of the trial was erroneous for three reasons. First, Payne did not automatically re-write Wyoming's death penalty statute to authorize the introduction of such evidence. Payne held only that the Eighth Amendment of the United States Constitution did not bar such evidence if a state chose to authorize its introduction. In Payne's wake, the Wyoming legislature, unlike the legislatures of several states, did not amend the death penalty statute to explicitly authorize such evidence in the sentencing phase. Second, the language used by the legislature in the death penalty statute and the historical development of that statute demonstrate that such evidence must play no part in the sentencing phase of a capital case. And, third, neither Wyoming's general victim impact statute, § 7-21-101 through 103, nor the case law interpreting it authorize such evidence for capital sentencing purposes.\n\n[¶160] The State counters Olsen's position with essentially the same arguments it presented below. The State agrees with Olsen that Payne left it to a state to determine whether to authorize such evidence in the sentencing phase. The State claims, however, that Payne never indicated that a state had to make that determination by way of a statute. According to the State, that determination could be accomplished by either legislation, court rule, or judicial decision. The State claims that, in Payne's wake, the Wyoming legislature did not have to amend the pertinent statutes to explicitly authorize such evidence. Explaining this claim, the State reasons: in Booth v. Maryland, 482 U.S. 496, 107 S. Ct. 2529, 96 L. Ed. 2d 440 (1987), the Court held that the Eighth Amendment of the United States Constitution barred victim impact evidence in the sentencing phase of a capital case; before the Court overruled Booth in Payne in 1991, the Wyoming legislature enacted the present versions of Wyoming's death penalty statute and general victim impact statute; when the legislature enacted these statutes, it is presumed to have known that Booth barred victim impact evidence and, therefore, the reach of these statutes was constitutionally limited; in 1991, when Payne overruled Booth, the constitutional limitation on the reach of those statutes was removed; therefore, only if the legislature had intended to codify the Booth limitation in the wake of Payne would the legislature have to amend these statutes.\n\n[¶161] The State contends also that, in light of dicta in Payne that victim impact is a matter relevant to the capital sentencing authority's determination of the punishment to be imposed, language in a subsection of Wyoming's death penalty statute, § 6-2-102(c), can be read to authorize the sentencing authority's consideration of victim impact in determining punishment. The first sentence of § 6-2-102(c) reads (emphasis added):\n\nThe judge or jury shall hear evidence as to any matter that the court deems relevant to a determination of the sentence, and shall include matters relating to any of the aggravating or mitigating circumstances enumerated in subsections (h) and (j) of this section.\n\n[¶162] The State contends that the emphasized language in subsection (c) authorizes a trial court in any given capital case to decide what \"matters,\" in addition to \"matters relating to any of the\" explicitly statutorily enumerated aggravating and mitigating circumstances, are deemed relevant to a determination of the punishment. Further, the State implicitly contends that a trial court in any given capital case could decide, as the justices in the Payne majority did, that victim impact is just such a \"matter\" relevant to the punishment determination and allow evidence as to that \"matter\" to be introduced.\n\n[¶163] Taking another tack, the State also claims that the import of Wyoming's general victim impact statute, § 7-2-101 through 103, is that victim impact testimony is relevant to any sentencing decision and must be considered in a capital case when the sentencing decision is committed to the trial court instead of a jury.\n\n[¶164] We have carefully reviewed and considered the trial court's decision and the parties' respective arguments. As shall be explained, we hold that existing Wyoming law does not authorize the introduction of evidence of victim impact during the sentencing phase of a capital case.\n\n[¶165] We have previously identified the division of the government's powers among the three departments in the criminal law area. Billis v. State, 800 P.2d 401, 415 (Wyo. 1990). In Billis, we recognized that \"[i]n its exercise of the legislative power, the legislative department has the exclusive power to determine and declare what acts shall constitute crimes and to prescribe punishments for those crimes.\" Id. In Booth, the Court held that Maryland's statute explicitly authorizing the admissibility of victim impact statements in the capital sentencing phase violated the Eighth Amendment of the United States Constitution. Booth, 482 U.S. at 509, 107 S. Ct. at 2536. The dissenting justices, who four years later would be among the majority in Payne, wrote that the legislature's judgment to allow a capital sentencing jury to consider victim impact evidence\n\nis entitled to particular deference; determinations of appropriate sentencing considerations are peculiarly questions of legislative policy, . . . and the Court should recognize that in a democratic society legislatures, not courts, are constituted to respond to the will and consequently the moral values of the people. Id. at 515, 107 S. Ct. at 2539 (White, J., dissenting, joine d by Rehnquist, C.J., O'Connor, and Scalia, J.J.) (citations and quotation marks omitted).\n\n[¶166] In Payne, Chief Justice Rehnquist, writing for the majority, observed that \"Congress and most of the States have, in recent years, enacted similar legislation to enable the sentencing authority to consider information about the harm caused by the crime committed by the defendant.\" Payne, 501 U.S. at 821, 111 S. Ct. at 2606. In her concurring opinion in Payne, Justice O'Connor likewise noted that \"[m]ost States have enacted legislation enabling judges and juries to consider victim impact evidence.\" Id. at 831, 111 S. Ct. at 2612 (White and Kennedy, J.J., joining). Similarly, Justice Scalia in his concurring opinion in that case stated that the Eighth Amendment \"permits the people to decide (within the limits of other constitutional guarantees) what is a crime and what constitutes aggravation and mitigation of a crime.\" Id. at 833, 111 S. Ct. at 2613 (O'Connor and Kennedy, J.J., joining). Interestingly, Justice Scalia's concurring opinion may lead one to conclude that the Payne majority had characterized victim impact evidence as \"relevant aggravating evidence.\" Id. (\"The Court correctly observes the injustice of requiring the exclusion of relevant aggravating evidence during capital sentencing, while requiring the admission of all relevant mitigating evidence.\")\n\n[¶167] In light of the above and foregoing recognition that determinations of appropriate sentencing considerations are \"peculiarly questions of legislative policy,\" we must reject the State's presumption that a determination whether victim impact evidence should be permitted in capital sentencing proceedings could be accomplished by means other than legislative enactment. We reject the presumption that such a determination may be accomplished through court rule or judicial decision. If the long march of death penalty jurisprudence means anything, it is that it is the legislature's obligation to carefully structure a statutory procedure which achieves the twin goals of individualized sentencing and channeled discretion in the sentencing authority and which avoids arbitrary and capricious action by that sentencing authority. Obviously, at the heart of that statutory procedure lies those matters which are deemed relevant to a determination of the sentence. Those matters can only be identified and authorized by the legislative representatives of the people, not by the courts.\n\n[¶168] We turn now to the question whether the Wyoming legislature in either the death penalty statute or the general victim impact statute has made a determination that victim impact is a matter relevant to a determination of the sentence of death or life imprisonment. As we begin our analysis of this question, we must keep in mind several well-recognized imperatives. We begin with the recognition so well expressed by Justice Stewart thirty years ago:\n\nThe penalty of death differs from all other forms of criminal punishment, not in degree but in kind. It is unique in its total irrevocability. It is unique in its rejection of rehabilitation of the convict as a basic purpose of criminal justice. And it is unique, finally, in its absolute renunciation of all that is embodied in our concept of humanity. Furman, 408 U.S. at 306, 92 S.Ct. at 2760 (Stewart, J., concurring).\n\nAnother well-recognized imperative is that we strictly construe penal statutes. Meerscheidt v. State, 931 P.2d 220, 224 (Wyo. 1997). Penal statutes \"cannot be enlarged by implication or extended by inference or construction.\" Smith v. State, 902 P.2d 1271, 1284 (Wyo. 1995). \"[A]mbiguity in a criminal statute should be resolved in favor of lenity.\" ALJ v. State, 836 P.2d 307, 310 (Wyo. 1992). We also recognize the presumption that the legislature enacts legislation with full knowledge of existing law and with reference to other statutes and decisions of the courts. Such legislation should, therefore, be construed in a way that creates a consistency and harmony within the existing law. Capwell v. State, 686 P.2d 1148, 1152 (Wyo. 1984).\n\nMoreover, we have recognized that where a general statute and a specific statute speak to the same concern, precedence is given to the terms of the more specific statute. Id. at 1153 (quoting Simpson v. United States, 435 U.S. 6, 15, 98 S.Ct. 909, 914, 55 L.Ed.2d 70 (1978)).\n\n[¶169] With these several imperatives in mind, we now look at both the capital sentencing statute, § 6-2-102, and the general victim impact statement statutes, § 7-21-101 through 103. The capital sentencing statute has been the law in substantially the same form since 1977. 1977 Wyo. Sess. Laws ch. 122, § 1; 1982 Wyo. Sess. Laws ch. 75, § 3; 1983 Wyo. Sess. Laws ch. 171, § 1; 1989 Wyo. Sess. Laws ch. 171, § 1; and 1999 Wyo. Sess. Laws ch. 134, § 1; 2001 Wyo. Sess. Laws ch. 96, § 2, ch. 98, § 1. More pertinently, the particular broad language in the first sentence of § 6-2-102(c) upon which the State relies appeared in the statute in 1977 and has remained there ever since. On the other hand, the general victim impact statement statute became law in 1990. 1990 Wyo. Sess. Laws ch. 112, § 1. The Wyoming legislature enacted the general victim impact statement statute with full knowledge of the existing capital sentencing statute and the Booth decision of 1987 which had held victim impact evidence inadmissible in capital sentencing. Although the victim impact statement is the specific subject of the general victim impact statement statute, the capital sentencing statute addresses the specific subject of the capital sentencing procedure which differs in kind from all other forms of criminal punishment; that penalty is truly unique. The general victim impact statement statute does contain language which suggests it may be applicable in a death penalty case. In that regard, the word \"crime\" in the statute carries the broad definition of a felony, i.e., \"crimes which may be punished by death or by imprisonment for more than one (1) year.\" Wyo. Stat. Ann. § 7-21-101(a)(i) (Michie 1997); Wyo. Stat. Ann. § 6-10-101 (Michie 1997). Further, the word \"victim\" includes \"a family member of . . . a homicide victim.\" § 7-21-101(a)(iii). This language notwithstanding, the statute also contains other language which suggests the statute applies only in non-capital sentencing cases. In that regard, a crime victim submits the written statement to the department of corrections and the statement is appended to the defendant's presentence report. Wyo. Stat. Ann. § 7-21-103(a)(ii) (Michie 1997); in capital sentencing, however, there is no presentence report. Instead, there is a full blown trial before the sentencing authority, at the conclusion of which the range of sentencing options is extremely narrow: life imprisonment or death. Further, the statement \"submitted to the court . . . shall be among the factors considered by the court in determining the sentence to be imposed upon the defendant . . . .\" § 7-21-103(b) (emphasis added). In capital sentencing, however, a jury, not a court, may be the sentencing authority, as in the instant case. § 6-2-102(b), (c), (d), and (e).\n\n[¶170] In the final analysis, we must conclude that the general victim impact statement statute is inapplicable to a capital sentencing case. The legislature has seen fit to set forth the capital sentencing procedure in a specific statute, recognizing that the imposition of the death penalty is unique and differs in kind from all other forms of punishment. That specific statute is comprehensive in the detailed procedures that must be carefully followed and in those special considerations which the sentencing authority, whether judge or jury, must take into account in determining the sentence. The general statute must give way to the special.\n\n[¶171] We now turn to that special capital sentencing statute to see whether the legislature has there made a decision that victim impact is a matter relevant to a determination of the sentence of death or life imprisonment. As previously noted, the State relies on the first sentence of § 6-2-102(c) as the authority for the sentencing authority's consideration of victim impact in determining punishment in a capital case. That sentence reads:\n\nThe judge or jury shall hear evidence as to any matter that the court deems relevant to a determination of the sentence, and shall include matters relating to any of the aggravating or mitigating circumstances enumerated in subsections (h) and (j) of this section. § 6-2-102(c) (emphasis added).\n\nAs noted a few lines ago, the emphasized language has been in the statute since 1977, long before \"victim impact\" evidence made its appearance in United States Supreme Court jurisprudence. Such evidence \"was still unheard of when Lockett was decided.\" Payne, 501 U.S. at 858, 111 S. Ct. at 2626 (Stevens, J., dissenting) (as Justice Stevens recognized, \"this type of evidence made its first appearance [in Supreme Court jurisprudence] in 1987 in Booth . . . .\"). In Wyoming jurisprudence, victim impact evidence made its first appearance in 1990 in the general victim impact statement statute discussed previously. Thus, from a historical perspective, we cannot accept the notion that the legislature in 1977 intended the emphasized language on which the State relies to carry the concept of victim impact.\n\n[¶172] Obviously, the words \"victim impact\" are missing from the statutory provision. Instead, we have only the \"empty-vessel\" words \"any matter that the court deems relevant to a determination of the sentence.\" The State's proposition is that, by using these \"empty-vessel\" words, the legislature intended for trial court judges to exercise discretion from one capital case to another as to what \"matter\" would fill the vessel. It might be \"victim impact\" one day and some other \"matter\" the next. But, as we know from experience, trial court judges might differ from court to court and from capital case to capital case in their respective relevancy determinations. For example, not all judges agree that victim impact is relevant to a determination of the sentence in a capital case. Booth and Payne were not unanimous decisions. In State v. Carter, 888 P.3d 629, 651-53 (Utah 1995), the Utah justices held that victim impact evidence was neither relevant nor of probative force in capital sentencing. In Commonwealth v. Fisher, 681 A.2d 130, 145-47 (Pa. 1996), guided by the fundamental principle of statutory construction that penal provisions must be strictly construed, the Pennsylvania justices held that \"[t]he imposition of capital punishment may not rest on a mere supposition that the Legislature intended victim impact evidence to be considered by a jury, but only upon the clear and unambiguous language of the death penalty statute.\" Id. at 146. The possibility of differing relevancy determinations on the most important decision we as a law-abiding society call upon courts and juries to make runs against the grain of the goal of channeled exercise of discretion in death penalty sentencing.\n\n[¶173] Moreover, the State would have us read § 102(c) in isolation from other provisions of the death penalty statute. This we may not do. Capshaw v. State, 10 P.3d 560, 564 (Wyo. 2000); Demeulenaere v. State, 995 P.2d 132, 135 (Wyo. 2000). We must read every subsection of a statute in context of all others in order to ascertain the meaning of the whole statute. Keller v. Merrick, 955 P.2d 876, 879 (Wyo. 1998). General provisions and specific provisions in a statute should stand together, if possible; but a specific provision in conflict with a general provision in another part of a statute must govern, unless the statute as a whole clearly shows a contrary intention, and must be given effect, even though the general provision is sufficiently broad to include the subject to which the specific provision relates. Edelman v. Edelman, 68 Wyo. 30, 48-49, 228 P.2d 408, 414 (1951). Section 102(c) may not be read in isolation from § 102(d)(i) and (ii) which specifically command that the jury shall render a sentence based upon only the existence of aggravating circumstances and mitigating circumstances, with no mention of \"any other matter that the court deems relevant to a determination of the sentence.\" Thus, § 102(d)(i) and (ii) are specific about the basis of the sentence and must be given effect over § 102(c)'s generality, even though the latter provision is broad enough to include the subject of the basis of the sentencing authority's determination of the sentence. Had the legislature intended to include \"any matter the court deemed relevant to a determination of the sentence\" as a basis for the sentence determination, it easily could have included such language within § 102(d)(i) and (ii). The American Law Institute did just that in § 210.6(2) of its proposed official draft in 1962:\n\nIn the [capital sentencing] proceeding, evidence may be presented as to any matter that the Court deems relevant to sentence, including but not limited to the nature and circumstances of the crime, the defendant's character, background, history, mental and physical condition and any of the aggravating or mitigating circumstances enumerated in subsections (3) and (4) of this Section. . . .\n\nThe Court, in exercising its discretion as to sentence, and the jury, in determining upon its verdict, shall take into account the aggravating and mitigating circumstances enumerated in Subsections (3) and (4) and any other facts that it deems relevant . . . . Model Penal Code § 210.6 (Proposed Official Draft 1962, and changes of July 30, 1962) (emphasis added) (as quoted in the appendix to McGautha v. California, 402 U.S. 183, 222-224, 91 S. Ct. 1454, 1475, 28 L. Ed 2d 711 (1971)).\n\n[¶174] It is interesting that, in the aftermath of Payne, a number of state legislatures amended their capital sentencing statutes to explicitly authorize the admission of victim impact evidence. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e For example, as noted in Commonweath v. Fisher, the Pennsylvania legislature amended its statute to read in pertinent part:\n\n(2) In the sentencing hearing, evidence concerning the victim and the impact that the death of the victim has had on the family of the victim is admissible. Additionally, evidence may be presented as to any other matter that the court deems relevant and admissible on the question of the sentence to be imposed. Evidence shall include matters relating to any of the aggravating or mitigating circumstances specified in subsections (d) and (e), and information concerning the victim and the impact that the death of the victim has had on the family of the victim. Evidence of aggravating circumstances shall be limited to those circumstances specified in subsection (d). 42 Pa. C.S.A. §9711(a)(2) (enacted October 11, 1995, to be effective sixty days thereafter) (as quoted in Fisher, 681 A.2d at 149 n.2) (Cappy, J., concurring).\n\nThe Florida legislature likewise amended its capital sentencing statute in 1992 by adding a subsection, which reads:\n\nOnce the prosecution has provided evidence of the existence of one or more aggravating circumstances as described in subsection (5), the prosecution may introduce, and subsequently argue, victim impact evidence. Such evidence shall be designed to demonstrate the victim's uniqueness as an individual human being and the resultant loss to the community's members by the victim's death. Characterizations and opinions about the crime, the defendant, and the appropriate sentence shall not be permitted as a part of victim impact evidence. Fla. Stat. Ann. § 921.141(7) (West 2001).\n\nEven the United States Congress made victim impact evidence a subject of statute, as 18 U.S.C. 3593(a) provides that in a death penalty case the prosecution shall give notice that it is seeking a death sentence based upon certain aggravating factors which\n\nmay include factors concerning the effect of the offense on the victim and the victim's family, and may include oral testimony, a victim impact statement that identifies the victim of the offense and the extent and scope of the injury and loss suffered by the victim and the victim's family, and any other relevant information. 18 U.S.C. § 3593(c) (Lexis 2001).\n\nThe federal statute goes on to provide that\n\n[a]t the sentencing hearing, information may be presented as to any matter relevant to the sentence . . . . The government may present any information relevant to an aggravating factor for which notice has been provided under subsection (a). Id. (In United States v. McVeigh, 944 F. Supp. 1478, 1491 (D. Colo. 1996), Chief Judge Richard Matsch said of victim impact evidence that it \"is the most problematic of all of the aggravating factors and may present the greatest difficulty in determining the nature and scope of the 'information' to be considered. Congress expressly provided for victim impact consideration in the Death Penalty Statute but it did not put any limits on what can be considered.\") See also United States v. Barnette, 211 F.3d 803, 817 (4 th Cir. 2000) (The Federal Death Penalty Act allows victim impact evidence as a non-statutory aggravating factor.) In the final analysis, we must conclude that the Wyoming Legislature has not made the decision in § 102(c) that victim impact is a matter relevant to a determination of the sentence of life imprisonment or death.\n\n[¶175] Because the Wyoming Legislature has not provided in either § 7-21-101 through 103 or § 6-2-102(c) that victim impact is a matter relevant to a determination of the sentence in the sentencing phase of a capital case, we hold that the trial court erred in its ruling which allowed the prosecution to introduce victim impact evidence in the sentencing phase of this capital case.\n\n[¶176] In Harlow, decided today, after holding that the trial court had erred in admitting victim impact evidence, we undertook a harmless error analysis. Harlow, 2003 WY 47, ¶43. We noted the discussion in Grossman v. Florida, 525 So.2d 833, 842-45 (Fla. 1988) on the question whether the erroneous introduction of victim impact evidence is subject to harmless error analysis. Id. We believe that discussion is sound and agree with the Florida Court's conclusion that harmless error analysis on a case-by-case basis is appropriate. In the instant case, however, that analysis is unnecessary because we are reversing and remanding for re-sentencing based on other errors. At that re-sentencing trial, victim impact evidence shall be inadmissible.\n\n2. Exclusion of Mitigating Evidence of Plea for Mercy\n\n[¶177] Olsen planned to have four witnesses testify about their knowledge of his character and their belief that a sentence of life imprisonment was appropriate. Two were friends from the Marines, one of whom is now a police officer, the others, his biological father and his adoptive father. After a hearing was held on the State's motion in limine to preclude pleas for Olsen's life by his family, friends or associates, the trial court ruled it would allow one witness, presumably his mother, to make a plea for his life. Olsen's mother testified and identified various photos of him as a child and a mother's day gift that he had given her as a child. In concluding her testimony, defense counsel asked her, \"Do you want Marty to die?\" She responded, \"No. I think we've suffered enough.\"\n\n[¶178] Olsen contends the trial court erred in precluding relevant mitigating evidence about his character by other witnesses. He asserts that his witnesses' opinion of the appropriate punishment for him in light of their unique knowledge of his character is relevant mitigating evidence. The State contends that a plea for a capital defendant's life is not admissible evidence because it does not pertain to that defendant's background, character, record, or the specific circumstances of the offense.\n\n[¶179] To be constitutional, a capital sentencing scheme must allow the sentencing authority to consider any relevant mitigating evidence regarding the defendant's character and background and the circumstances of the offense. Boyde, 494 U.S. at 377, 110 S.Ct. at 1196. Wyoming's statute defines a number of mitigating circumstances and includes a \"catch-all\" mitigating circumstances category permitting \"[a]ny other fact or circumstance of the defendant's character or prior record or matter surrounding his offense which serves to mitigate his culpability.\" § 6-2-102(j)(viii). The plain language of this subsection indicates that this list is only a guide and not exclusive, signifying that in the sentencing phase of a death penalty trial the trial court has broad discretion to allow any evidence relevant to mitigating circumstances, and that, generally, a trial court will be within its discretion in admitting all mitigating evidence relating to the individual defendant.\n\n[¶180] Character is generally considered the sum of those attributes and features that make up and distinguish an individual. Merriam Websters Collegiate Dictionary 191 (10 th ed. 2000). The question before us is whether a witness's opinion as to whether the defendant should receive the death penalty is relevant mitigating evidence of the defendant's character. Olsen does not provide direct authority on the issue, and we found only two decisions addressing the issue. In State v. Moore, 585 A.2d 864, 894 (N.J. 1991), that court determined that\n\n[a] witness's opinion on what punishment is appropriate reveals only the witness's own state of mind. It cannot reveal defendant's character beyond whatever may be inferred from admitted testimony on the witness's love for him.\n\nThat decision recognized, however, that although a trial court has the discretion to exclude a witness's opinion on an appropriate punishment, it is uniquely natural and human for some witnesses, especially close family members, to wish to plead for mercy. Given the impermissible inferences that might arise if a close relative did not plead for mercy while testifying, it was within the trial court's discretion to permit the testimony of one such as defendant's mother, as long as it was not cumulative. Id.\n\nGeorgia approaches the issue differently and applies the following rule:\n\nalthough a defendant may present witnesses who know and care for him and are willing on that basis to ask for mercy on his behalf, a defendant may not present witnesses to testify merely to their religious or philosophical attitudes about the death penalty. Nor is a defendant entitled to present the opinion of a witness about what verdict the jury \"ought\" to reach. Childs v. State, 357 S.E.2d 48, 60 (Ga. 1987) (citations omitted); State v. Torrence, 406 S.E.2d 315, 318 (S.C. 1991); see also Barnes v. State, 496 S.E.2d 674, 688-89 (Ga. 1998).\n\n[¶181] By limiting mitigating evidence to that which is relevant to a defendant's character, it appears that Wyoming's statute intended to prohibit pleas for the defendant's life, pleas for mercy, and a witness's opinion about the appropriate sentence. Like victim impact evidence, such pleas and opinion are not evidence relevant under Wyoming's death penalty statutory scheme. However, we agree with the New Jersey court that, where a trial court determines that impermissible inferences would arise if family or friends were not to make a plea for mercy, it should permit the testimony unless unduly cumulative under the constitutional rule that evidence must not unfairly prejudice the defendant in a death penalty proceeding. Gregg, 428 U.S. at 204, 96 S.Ct. at 2939. In this case, Olsen contends that limiting his witnesses' testimony did prejudice him, and although it does not appear that permitting all four witnesses to make pleas based upon their unique experiences would have been unduly cumulative, the trial court did not abuse its discretion in limiting Olsen to his mother's testimony.\n\n[¶182] Denying a defendant's request to present pleas for mercy must be distinguished from the role of mercy in a death penalty proceeding. The United States Supreme Court has long recognized that the purpose of a sentencing jury's consideration of mitigating circumstances is not to justify or excuse, but to grant discretion to consider those circumstances which in fairness or mercy may be considered as extenuating or reducing a defendant's degree of moral culpability or blameworthiness. California v. Brown, 479 U.S. at 542-43, 107 S.Ct. at 840. In California v. Brown, the Court decided that instructing the jury not to be swayed by \"mere sentiment, conjecture, sympathy, passion, prejudice, public opinion or public feeling\" did not inhibit the jury's consideration of mercy or sympathy based upon the evidence produced during the sentencing phase. Id. The task for a trial court is to \"determine whether the jury instructions, taken as a whole, and considered in combination with the prosecutor's closing argument, adequately informed the jury of its responsibility to consider all of the mitigating evidence introduced by the respondent.\" Id. at 546, 107 S.Ct. at 841-42 (O'Connor, J., concurring). The task of appellate review is to ensure a reliable decision has resulted. Id. at 543, 107 S.Ct. at 840.\n\nF. Jury Instructions\n\n1. Comment on Right to Silence in Psychiatric Evaluation Instruction\n\n[¶183] In pretrial rulings, the trial court ruled that the State was not entitled to a mental and/or medical examination to rebut mitigating evidence and the trial court would issue an instruction to cure any comment on Olsen's right to silence. During the motion hearing, Olsen objected to the proposed instruction on the grounds that the instruction itself was an improper comment on the right to silence. The jury was instructed:\n\nThe law does not allow the State a psychological or psychiatric evaluation of the Defendant.\n\n[¶184] On appeal, Olsen renews his contention that the instruction was an improper comment on his right to silence and served to impeach the credibility of the defense experts in violation of Tortolito v. State, 901 P.2d 387, 390 (Wyo. 1995). The State contends that the instruction was not a comment on the right to silence but intended to serve the purpose of eliminating the possibility that the jury would attribute to Olsen the failure of the State's experts to conduct an examination to Olsen.\n\n[¶185] A line of United States Supreme Court cases has held that a capital defendant's Fifth Amendment right against compelled self-incrimination precludes the State from subjecting him to a psychiatric examination concerning future dangerousness without first informing the defendant that he has a right to remain silent and that anything he says can be used against him at a sentencing proceeding. Ochoa v. State, 848 P.2d 1359, 1365 (Wyo. 1993); Powell v. Texas, 492 U.S. 680, 681, 109 S.Ct. 3146, 3147-48, 106 L.Ed.2d 551 (1989) (citing Estelle v. Smith, 451 U.S. 454, 461-69, 101 S.Ct. 1866, 1872-76, 68 L.Ed.2d 359 (1981)); see also Satterwhite v. Texas, 486 U.S. 249, 108 S.Ct. 1792, 100 L.Ed.2d 284 (1988). The United States Supreme Court has found a violation of a defendant's Sixth Amendment right to counsel in this same situation. Ochoa, 848 P.2d at 1365; Powell, 492 U.S. at 681, 109 S.Ct. at 3148. The questioned instruction correctly states the law in a limited fashion, and we presume that the trial court's intent in informing the jury of the law was to protect against the jury's drawing improper inferences.\n\n[¶186] We do not agree with Olsen's contention that the instruction violates Tortolito's prohibition against using the constitutional right of silence as evidence of guilt. Olsen's guilt had been adjudicated, and this sentencing instruction did not reference his silence or imply that a State examination would have revealed evidence contrary to that provided by the defense's experts. We find no error.\n\n2. Consideration of Counsel's Argument in Sentencing Decision\n\n[¶187] In Instruction No. 21, the trial court instructed the jury to consider argument from counsel in reaching its decision. Olsen contends that this court has held that argument from counsel is not evidence and error occurred in instructing the jury. Apparently, the jury instruction conference was not recorded and objections to instructions were placed on the record after conclusion of the conference. Both parties agree that this issue must be reviewed under plain error.\n\n[¶188] Instruction No. 21 states:\n\nBoth the defendant and the State may present argument as to the significance of any factors and or evidence presented in the trial or sentencing phase. You may consider said arguments in reaching a reasoned decision as to finding whether an aggravating factor or mitigating factor exists or in the significance attached to said mitigating or aggravating factor.\n\nThe State contends that this instruction is not plain error because it does not violate a clear and unequivocal rule of law. In the State's view, the entire purpose of closing argument is to explain the evidence and to offer ways of viewing the significance of the evidence. Considering the instructions as a whole, the jury was instructed several times not to consider argument as evidence, and in the State's opinion, this remedied any error and cleared up any confusion that may have existed in the jurors' minds. We agree with the State's position that giving this instruction did not create reversible error.\n\n3. Instruction in Response to Jury Question About Parole\n\n[¶189] After a short time deliberating during the sentencing phase, the jury sent a note to the court asking:\n\nIf sentenced to three life terms would the Defendant ever have a chance for parole for any possible reason or reasons?\n\nDespite defense counsel's objections, the district court answered this question with this supplemental instruction:\n\nUnder the laws of the State of Wyoming, the governor has the power to grant reprieves, commutation and pardons after conviction for all offenses except treason and cases of impeachment. This means that the governor has the power to commute each life sentence to a term of years. If the governor were to commute each life sentence to a term of years then and only then could the parole board consider the possibility of parole for the person serving the life sentence.\n\nOlsen contends that his due process rights under the Eighth and Fourteenth Amendments were violated when the court committed two errors by submitting this instruction: 1) the response to the question placed information before the jury which he had no opportunity to explain or deny; and 2) it failed to inform the jury that an inmate serving a life sentence is ineligible for parole under Wyoming law. In pretrial motions and instructions, the defense had proposed instructing the jury that Olsen could not be paroled while serving a life sentence. The State contends that the trial court did instruct the jury that a person could not be paroled from a life sentence in this instruction when it stated \"[i]f the governor were to commute each life sentence to a term of years.\"\n\n[¶190] A defendant is sentenced either \"to death or life imprisonment\" under § 6-2-102(a). Before 1996, § 7-13-402(a) read:\n\n§ 7-13-402. General powers and duties of board; eligibility for parole; immunity.\n\n(a) The board may grant a parole to any person imprisoned in any institution under sentence, except a life sentence, ordered by any district court of this state, provided the person has served the minimum term pronounced by the trial court less good time, if any, granted under rules promulgated pursuant to W.S. 7-13-420. Wyo. Stat. Ann. § 7-13-402(a) (Michie 1995) (emphasis added).\n\nIn 1994, the Wyoming Constitution was amended to read:\n\nNotwithstanding Article 4, Section 5 of this Constitution, the legislature may by law create a penalty of life imprisonment without parole for specified crimes which sentence shall not be subject to commutation by the governor. The legislature may in addition limit commutation of a death sentence to a sentence of life imprisonment without parole which sentence shall not be subject to further commutation. In no event shall the inherent power of the governor to grant a pardon be limited or curtailed. Wyo. Const. Art. 3, § 53.\n\nIn 1996, the Legislature created § 6-10-301 stating:\n\n§ 6-10-301. Life imprisonment without parole.\n\n(a) Pursuant to article 3, section 53 of the Wyoming constitution, a sentence of life imprisonment without parole is created for specified crimes designated in the Wyoming Criminal Code of 1982.\n\n(b) A person sentenced to life imprisonment without parole shall not be eligible for parole and shall remain imprisoned under the jurisdiction of the department of corrections during the remainder of his life unless pardoned by the governor.\n\n(c) A sentence specifically designated as a sentence of life imprisonment without parole is not subject to commutation by the governor. A sentence of life or life imprisonment which is not specifically designated as a sentence of life imprisonment without parole is subject to commutation by the governor. A person sentenced to life or life imprisonment is not eligible for parole unless the governor has commuted the person's sentence to a term of years. 1996 Wyo. Sess. Laws. ch. 73, § 1 (emphasis added).\n\n[¶191] Section 7-13-402(a) was amended from \"except a life sentence\" to \"except a sentence of life imprisonment without parole or a life sentence . . . .\" 1996 Wyo. Sess. Laws. ch. 73, § 2. At the time of the crime, the only statutes imposing \"life imprisonment without parole\" were the sexual assault statute, Wyo. Stat. Ann. § 6-2-306(d) (LexisNexis 2001), and the indecent liberties with a minor statute, Wyo. Stat. Ann. § 14-3-105(b) (LexisNexis 2001). \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\n[¶192] The United States Supreme Court has held that it is not unconstitutional for a court to tell the jury about the possibility of executive clemency. California v. Ramos, 463 U.S. 992, 1009, 103 S.Ct. 3446, 3457, 77 L.Ed.2d 1171, 1186 (1983). Despite the State's assurance that this instruction does inform the jury that Olsen would not be eligible for parole, it does not. It explains executive clemency to them, but we agree with Olsen that the instruction is insufficient under Simmons v. South Carolina, 512 U.S. 154, 114 S.Ct. 2187, 129 L.Ed.2d 133 (1994), because it did not inform the jury of Olsen's immediate statutory ineligibility for parole. Id. at 171, 114 S. Ct. at 2197-98.\n\n[¶193] Just as in Olsen's case, future dangerousness was an issue in Simmons; however, the trial court refused to instruct the jury that defendant was statutorily ineligible for parole should it elect to impose a life term in prison rather than the death penalty. The plurality opinion reversing the judgment observed that \"[t]he Due Process Clause does not allow the execution of a person 'on the basis of information which he had no opportunity to deny or explain.'\" Id. at 161, 114 S.Ct. at 2192. It held that in a capital penalty trial, when the prosecution puts the issue of defendant's future dangerousness in issue and the defendant is legally ineligible for parole, it is a denial of due process to reject the defendant's request to instruct the jury on a natural question raised by the issue of future dangerousness, that is, whether defendant is legally eligible for parole should the jury elect to impose a term of life in prison. Id. at 168-69, 114 S.Ct. at 2196. Justice O'Connor, writing for herself and two other justices, concurred in the judgment, indicating that in a case of statutory ineligibility for parole, when future dangerousness had been put in issue, due process requires that the jury be informed, either through argument or instruction, of the defendant's statutory ineligibility for parole. Id. at 2200-01.\n\n[¶194] Accordingly, Olsen's jury should have been instructed that, under the statute, a sentence of life imprisonment means that he would not be eligible for parole.\n\nG. Sentencing Phase Jurors\n\n[¶195] Olsen makes three separate claims relating to the jury that determined his sentence. Before trial, the trial court denied motions to allow a second jury to be impaneled for the sentencing phase of the trial or, in the alternative, to conduct voir dire before beginning the sentencing phase. Olsen contends that the trial court abused its discretion as good cause existed to grant the motions. After the guilt phase, and after one day into the sentencing phase, a juror was excused and replaced with an alternate for the sentencing phase of trial. Olsen contends that the trial court erred in denying a mistrial and claims that the procedure used to select the alternate juror was contrary to W.R.Cr.P. 24(e), and violated his right to a fair trial.\n\n1. Second Jury\n\n[¶196] Under Wyoming's death penalty statute, the sentencing hearing is to be conducted before the jury that determined the defendant's guilt. Upon a showing of good cause, the judge can discharge that jury and impanel a second jury. § 6-2-102(b). The trial court has an affirmative duty to ensure that a jury of competent, fair, and impartial persons is impaneled; however, the conduct of voir dire and the impaneling of a jury are functions committed to the discretion of the trial court, and we do not reverse the exercise of discretion by a trial court absent clear abuse. Russell v. State, 851 P.2d 1274, 1278 (Wyo. 1993).\n\nJudicial discretion is a composite of many things, among which are conclusions drawn from objective criteria; it means a sound judgment exercised with regard to what is right under the circumstances and without doing so arbitrarily or capriciously. Vaughn v. State, 962 P.2d 149, 151 (Wyo. 1998).\n\n[¶197] Olsen contends that good cause was shown by advising the trial court that the death qualification voir dire process in a capital case produced preconceived notions by the jurors that prejudiced him in the guilt phase. Specifically, he claims that knowing that death is being sought frames the minds of the jurors around the theory that he should not live because the crime of which he stands accused is so atrocious. The State contends that federal and state decisions have concluded that \"death qualification\" does not violate a defendant's constitutional right to an impartial jury. The State cites to Witherspoon v. Illinois, 391 U.S. 510, 88 S.Ct. 1770, 20 L.Ed.2d 776 (1968); Engberg v. State, 686 P.2d 541 (Wyo. 1994); and Collins v. State, 589 P.2d 1283 (Wyo. 1979).\n\n[¶198] Olsen's contention is a general attack on the validity of a single jury in a death penalty case. Whether a bifurcated death penalty trial should be conducted by a single jury is a matter of legislative policy, and the plain language of the statute permits a single jury absent a specific showing of good cause. The trial court did not abuse its discretion in denying the pretrial motions, and our review of the record does not indicate that defense counsel was unable to draw a fair and impartial jury. Defense counsel conducted an extensive voir dire of both the entire panel and numerous individuals in chambers, thoroughly questioning the panel, and we can only conclude that the jury was fair and impartial.\n\n2. Replacement Juror\n\n[¶199] We also find that there were no grounds for a mistrial. The decision to grant a mistrial rests within the sound discretion of the district court and will not be reversed unless an abuse of that discretion is shown to have prejudiced the defendant. Craver v. State, 942 P.2d 1110, 1115 (Wyo. 1997). A juror was released from sequestration after the court learned that his father had died. An alternate juror was selected by a lottery system at the end of the presentation of evidence in the sentencing phase. Alternates had heard all of the evidence during the guilt phase of the trial, had heard the one day of evidence presented during the sentencing phase of the trial, and had been sequestered along with the rest of the jurors. Defense counsel immediately requested a mistrial, arguing that because the alternate juror was not privy to the deliberations during the guilt phase of the trial, Olsen would be deprived of due process of law.\n\n[¶200] Olsen contends that the portion of § 6-2-102(b) stating that \"the sentencing hearing shall be conducted before the jury which determined the defendant's guilt\" does not permit substituting an alternate juror after a determination of guilt, but before the penalty deliberations. The State contends that, alternate jurors, including those selected for a bifurcated, death penalty trial, are essential constituents of a trial jury. See Parks v. State, 600 P.2d 1053 (Wyo. 1979). Pointing to W.R.Cr.P. 24(e) and W.R.Cr.P. 2, the State contends that any procedural conflict within the statute is governed by the Wyoming Rules of Criminal Procedure. See Hopkinson v. State, 704 P.2d 1323, 1329 (Wyo. 1985) (Hopkinson IV).\n\n[¶201] W.R.Cr.P. 24(e) provides the method for selecting alternate jurors:\n\n(e) Alternate jurors. -- The court may direct that not more than six jurors in addition to the regular jury be called and impanelled to sit as alternate jurors. Alternate jurors in the order in which they are called shall replace jurors who, prior to the time the jury retires to consider its verdict, become or are found to be unable or disqualified to perform their duties. Alternate jurors shall be drawn in the same manner, shall have the same qualifications, shall be subject to the same examination and challenges, shall take the same oath and shall have the same functions, powers, facilities and privileges as the regular jurors. An alternative juror who does not replace a regular juror shall be discharged after the jury retires to consider its verdict.\n\nW.R.Cr.P. 2 provides:\n\nThese rules are intended to provide for the just determination of every criminal proceeding. They shall be construed to secure simplicity in procedure, fairness in administration and the elimination of unjustifiable expense and delay.\n\nThe State contends that reading these rules together, and in light of the purpose served by alternate jurors as set forth in Parks, it seems clear that the term \"verdict\" used in Rule 24(e) must be read in a broad sense to refer to a final jury decision on any matter specifically committed to it. Not only must it be read to refer to a determination of the defendant's guilt of a crime, but also to a jury's separate determination of a matter of the sort typically involved in bifurcated proceedings -- such as a defendant's habitual criminal status or the propriety of the death penalty. We agree with the State that this was precisely the intent of the statute and, pursuant to such a view, a capital case jury may be said to retire to consider its verdict twice, once for the guilt phase and once for the sentencing phase, and alternate jurors are authorized to serve in sentencing phase deliberations even if they did not serve during the guilt phase, so long as the replacement is made before the jury retires to begin sentencing phase deliberations. The legislative intent of the statutory phrase \"the jury which determined defendant's guilt\" includes properly substituted alternates, and we find no error in denying the motion for a mistrial.\n\n3. Selection of Alternate Juror\n\n[¶202] The sentencing phase of Olsen's trial began on September 8, 1997. On September 9, 1997, the trial court was informed that the father of one of the jurors had died. The trial court excused the juror from service and, following the conclusion of evidence, replaced him with one of the alternate jurors as required by W.R.Cr.P. 24. To accomplish this, the trial court placed the names of the alternate jurors in the clerk's drum and the clerk picked a name out of the drum, just as it had when selecting the three alternates after the guilt phase of the trial.\n\n[¶203] Olsen objected to this method of selecting the replacement juror. Olsen contends the procedure used to select the alternate juror was contrary to W.R.Cr.P. 24 and violated his right to a fair trial. These contentions require interpretation of W.R.Cr.P. 24. Interpretation of procedural rules is a question of law, which we review de novo. See Witt v. State, 892 P.2d 132, 137 (Wyo. 1995); Vanasse v. Ramsey, 847 P.2d 993, 999 (Wyo. 1993) (court rules have the force and effect of a statute and are to be construed in the same manner).\n\n[¶204] W.R.Cr.P. 24(e) provides the method for selecting alternate jurors:\n\n(e) Alternate jurors. -- The court may direct that not more than six jurors in addition to the regular jury be called and impanelled to sit as alternate jurors. Alternate jurors in the order in which they are called shall replace jurors who, prior to the time the jury retires to consider its verdict, become or are found to be unable or disqualified to perform their duties. Alternate jurors shall be drawn in the same manner, shall have the same qualifications, shall be subject to the same examination and challenges, shall take the same oath and shall have the same functions, powers, facilities and privileges as the regular jurors. An alternate juror who does not replace a regular juror shall be discharged after the jury retires to consider its verdict. Each side is entitled to one peremptory challenge in addition to those otherwise allowed by law if one or two alternate jurors are to be impanelled, two peremptory challenges if three or four alternate jurors are to be impanelled, and three peremptory challenges if five or six alternate jurors are to be impanelled. The additional peremptory challenges may be used against an alternate juror only, and the other peremptory challenges allowed by these rules may not be used against an alternate juror.\n\n[¶205] Olsen maintains the trial court failed to follow Rule 24 in three ways. First, he claims that because the trial court did not choose the alternate jurors until the end of the guilt phase of the trial, he was not able to exercise his right to use his peremptory challenges on the alternate jurors. In a second, related argument, Olsen claims the lottery system the trial court used to select the alternate jurors denied him the opportunity to use his peremptory challenges on the alternate jurors. Finally, Olsen argues the trial court violated the rule when it failed to replace the excused juror with the \"alternate juror who was first called.\" Review of the record and the rule convinces us the trial court did not err in its handling of the selection of alternate jurors or replacement of the excused juror.\n\n[¶206] W.R.Cr.P. 24 allows the trial court to direct that not more than six jurors be called to sit as alternate jurors. In the case at bar, the trial court directed that three alternate jurors would be seated, in addition to the twelve regular jurors mandated by the rule. Although the trial court was prepared to allow the parties fifteen peremptory challenges, the State and Olsen agreed to limit themselves to ten peremptory challenges each. Defense counsel explained that he had determined the remaining members of the jury pool contained at least six undesirable jurors and he would prefer to keep the jury pool at thirty-five rather than trying to distill ten more potential jurors from the pool. Olsen does not challenge the trial court's decision to seat three alternate jurors.\n\n[¶207] At the end of the guilt phase of the trial, but before deliberation, the trial court directed the court clerk to select three names from the clerk's drum. Those three individuals became the alternate jurors. Understandably, the trial court waited until the guilt phase was completed and the jury was about to deliberate before selecting the alternate jurors. In order to obtain the most attentive panel of jurors, it is certainly prudent to delay the selection of alternates until all of the evidence has been heard. Human nature instructs us that the jurors might be less attentive if they knew they were alternates at the beginning of the trial.\n\n[¶208] The rule requires the trial court to provide two additional peremptory challenges to each party when three alternate jurors are to be impanelled. W.R.Cr.P. 24(e). Olsen relies on the language in the rule which provides that additional \"challenges may be used against an alternate juror only\" to argue that the trial court should have selected the alternate jurors before the evidentiary portion of the trial commenced so he could use his allotted peremptory challenges on the three alternate jurors. However, simple math illustrates that the rule could not be applied as Olsen contends.\n\n[¶209] The trial court told the parties it would allow three alternates to serve on the jury. W.R.Cr.P. 24(e) allows each party two additional peremptory challenges when three alternates are to be impanelled for a total of four peremptory challenges. If the rule required the trial court to permit peremptory challenges of the alternate jurors after they were selected, as Olsen suggests, all three alternate jurors could be eliminated before the four peremptory challenges were exhausted. The trial court did not inhibit Olsen's ability to use his peremptory challenges in accordance with W.R.Cr.P. 24 when it selected the alternate jurors just prior to deliberation on the guilt phase of the trial.\n\n[¶210] In his next claim of error, Olsen contends \"[a]lternate jurors in the order in which they are called shall replace [disqualified] jurors\" means the trial court was required to replace the excused juror with the first alternate juror called when the three alternates were selected before deliberation on the guilt phase. Once again, we find the trial court acted prudently when it waited until a replacement juror was needed before it determined which juror would be selected for that duty. In order to ensure an attentive alternate juror panel, we hold that the trial court properly determined the rule allowed it to select the replacement juror when an alternate juror was needed, and not before. The replacement juror sitting on the panel for the sentencing phase was, in fact, the first juror selected from the clerk's drum when the trial court found it necessary to use one of the alternate jurors. The trial court properly drew the alternate juror \"in the same manner . . . as the regular jurors.\" W.R.Cr. P. 24(e).\n\nH. Lethal Injection is Cruel and Unusual Punishment\n\n[¶211] Wyo. Stat. Ann. § 7-13-904 (Michie 1997) mandates that the punishment of death be administered by a continuous intravenous injection of a lethal quantity of chemicals. In a pretrial motion, Olsen requested the trial court to strike the State's request for the death penalty, claiming lethal injection is unconstitutional because it constitutes cruel and unusual punishment. Olsen also requested an evidentiary hearing to allow him the opportunity to question persons who witnessed Wyoming's last execution by lethal injection. The trial court ruled that this court has held that lethal injection does not constitute cruel and unusual punishment and denied the motion for an evidentiary hearing.\n\n[¶212] On appeal, Olsen contends that the trial court erred in denying an evidentiary hearing on the matter where he would have presented expert testimony establishing it as cruel and unusual punishment. He gives several examples of the manner in which lethal injection executions were carried out and which caused lengthy delays before death occurred and caused convulsions and apparent pain. The State contends Olsen asked to question witnesses at that execution and to learn the specific procedures used. Because this court had affirmed denials of similar requests made before the last execution, the State contends the trial court properly denied the motions. The State also contends that Olsen is making the argument that if lethal injection is carried out incorrectly, that injection method could be painful, but that this assertion is contrary to authority.\n\n[¶213] Capital punishment in and of itself does not violate the prohibition against cruel and unusual punishment. The assertion that execution by lethal injection, as provided for in § 7-13-904(a), constitutes cruel and unusual punishment was rejected by this court as contrary to pertinent authority. Hopkinson v. State, 798 P.2d 1186, 1187 (Wyo. 1990) (Hopkinson V). Olsen's assertions that his examples show that lethal injection is cruel and unusual punishment do not constitute the required examination of objective factors necessary to reach such a conclusion. See Stanford v. Kentucky, 492 U.S. 361, 368-69, 109 S.Ct. 2969, 2974-75, 106 L.Ed.2d 306 (1989); McCleskey v. Kemp, 481 U.S. 279, 300, 107 S.Ct. 1756, 1771, 95 L.Ed.2d 262 (1987). We find the court did not err in denying Olsen's motions.\n\nI. Repeal of Statutory Proportionality Review\n\n[¶214] The statutory provision in the death penalty statute requiring this court to conduct a proportionality review was repealed by the legislature in 1989. 1989 Wyo. Sess. Laws, Ch. 171, § 2. Although Olsen raises no issue concerning the repeal, we will address whether we are constitutionally required to conduct such a review.\n\n[¶215] In Hopkinson II, we considered the issue whether Wyoming's death penalty statutes were unconstitutional because of the review procedures granted to this court. Hopkinson II, 664 P.2d at 50. In resolving the issue we noted\n\nthat the Wyoming Legislature in providing for the death penalty as a sentence in the case of first degree murder was \"restrained by [federal] constitutional provisions and guarantees.\" This necessitated incorporating into the death penalty sentence constitutional restraints as a condition to its availability. Id. at 51.\n\nWe said:\n\nWhen this court is presented with a constitutionally based challenge to a statute, it presumes the statute constitutional. Any doubt must be resolved in favor of constitutionality. Before we strike it down we must find that it clearly violates some constitutional principle, state or federal. The Supreme Court of the United States has said that, even when a serious doubt of constitutionality is present, courts should \"ascertain whether a construction of the statute is fairly possible by which the question may be avoided.\" Crowell v. Benson, 285 U.S. 22, 62, 52 S.Ct. 285, 296, 76 L.Ed. 598 (1932).\n\nThe most important reason for holding that §§ 6-4-102(g) and 6-4-103 are constitutional is that they are an important and necessary part of the total sentencing structure. In that regard, the opinion of Justices Stewart, Powell and Stevens in Gregg v. Georgia, supra, 428 U.S. at 198, 96 S.Ct. at 2937, in announcing the judgment of the Court said:\n\n\"As an important additional safeguard against arbitrariness and caprice, the Georgia statutory scheme provides for automatic appeal of all death sentences to the State's Supreme Court. That court is required by statute to review each sentence of death and determine whether it was imposed under the influence of passion or prejudice, whether the evidence supports the jury's finding of a statutory aggravating circumstance, and whether the sentence is disproportionate compared to those sentences imposed in similar cases. § 27-2537(c) (Supp. 1975).\n\nIn short, Georgia's new sentencing procedures require as a prerequisite to the imposition of the death penalty, specific jury findings as to the circumstances of the crime or the character of the defendant. Moreover, to guard further against a situation comparable to that presented in Furman [v. Georgia, 408 U.S. 238, 92 S.Ct. 2726, 33 L.Ed.2d 346 (1972)], the Supreme Court of Georgia compares each death sentence with the sentences imposed on similarly situated defendants to ensure that the sentence of death in a particular case is not disproportionate. On their face these procedures seem to satisfy the concerns of Furman. No longer should there be 'no meaningful basis for distinguishing the few cases in which [the death penalty] is imposed from the many cases in which it is not.' 408 U.S., at 313 [92 S.Ct. at 2764] (WHITE, J., concurring).\"\n\nAgain, 428 U.S. at page 204, 96 S.Ct. at 2939, the Court explained:\n\n\"Finally, the Georgia statute has an additional provision designed to assure that the death penalty will not be imposed on a capriciously selected group of convicted defendants. The new sentencing procedures require that the State Supreme Court review every death sentence to determine whether it was imposed under the influence of passion, prejudice, or any other arbitrary factor, whether the evidence supports the findings of a statutory aggravating circumstance, and \"[w]hether the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\" § 27-2537(c)(3) (Supp.1975). * * *\"\n\nThen at page 206, 96 S.Ct. at 2940, the Court went on to say:\n\n\"The provision for appellate review in the Georgia capital-sentencing system serves as a check against the random or arbitrary imposition of the death penalty. In particular, the proportionality review substantially eliminates the possibility that a person will be sentenced to die by the action of an aberrant jury. If a time comes when juries generally do not impose the death sentence in a certain kind of murder case, the appellate review procedures assure that no defendant convicted under such circumstances will suffer a sentence of death.\"\n\nFinally, at page 207, 96 S.Ct. at 2941, the Court said:\n\n\"* * * In addition, the review function of the Supreme Court of Georgia affords additional assurance that the concerns that prompted our decision in Furman are not present to any significant degree in the Georgia procedure applied here.\"\n\nThe concurring opinion of Justice White, with whom Chief Justice Burger and Justice Rehnquist joined, also stressed the state supreme court review of the death penalty as \"[a]n important aspect of the new Georgia legislative scheme * * *.\"\n\nIn Proffitt v. Florida, supra, 428 U.S. 242, 96 S.Ct. 2960, 49 L.Ed.2d 913, the Court, in approving the Florida death penalty statutes, called attention to the provision § 921.141(4), F.S.A., by stating that this automatic review provision is designed to assure that the death penalty will not be imposed on a capriciously selected group of convicted defendants. While the provision is not structured in the same fashion as that of Georgia, it was held by the United States Supreme Court that the manner in which the Florida Supreme Court reviews each death sentence does ensure similar results in similar cases, citing State v. Dixon, 283 So.2d 1, 10 (Fla., 1973).\n\nThe certiorari petition in Proffitt asserted that such a skimpy provision made the role of the state supreme court necessarily subjective and unpredictable. The United States Supreme Court responded to that by stating:\n\n\"* * * While it may be true that that court has not chosen to formulate a rigid objective test as its standard of review for all cases, it does not follow that the appellate review process is ineffective or arbitrary. In fact, it is apparent that the Florida court has undertaken responsibly to perform its function of death sentence review with a maximum of rationality and consistency. For example, it has several times compared the circumstances of a case under review with those of previous cases in which it has assessed the imposition of death sentences. By following this procedure the Florida court has in effect adopted the type of proportionality review mandated by the Georgia statute. And any suggestion that the Florida court engages in only cursory or rubber-stamp review of death penalty cases is totally controverted by the fact that it has vacated over one-third of the death sentences that have come before it. * * *\" Id., 428 U.S. at 258-259, 96 S.Ct. at 2969.\n\nWe conclude and hold that the action of the Wyoming State Legislature in specifying the nature of our review does not purport to take away any of our powers or jurisdiction. The judicial function of making the requisite determinations on review are [sic] left to this court. It would be something else if the legislature enacted a statute whereby the legislature would review the trial proceedings; it then would be exercising powers properly belonging to the courts. We consider the challenged statutory sections to be a proper exercise of legislative power to provide for the sentencing of convicted first degree murders. This does not mean that under the Wyoming Rules of Criminal Procedure we could not conduct the same review as that directed by the legislature. If we disregarded the legislative directions, we would still be required to conduct a review within the standards set out in Gregg and Proffitt, as did the Supreme Court of Florida. Hopkinson II, 664 P.2d at 54-56 (some citations and footnotes omitted).\n\n[¶216] In 1984, the United States Supreme Court decided that a statutorily mandated proportionality review was not a constitutional requirement. Pulley v. Harris, 465 U.S. 37, 45, 50-51, 104 S.Ct. 871, 876, 879, 79 L.Ed.2d 29 (1984). Proportionality review had previously been approved by the Court as a safeguard against discriminatory, wanton and freakish imposition of the death penalty; however, the Court determined that no decision mandated the review. Id. at 45, 104 S.Ct. at 876-77. If a sentencing scheme provided safeguards that adequately directed and limited the jury's discretion, it would be constitutional without a proportionality review. Id. at 50-51, 104 S.Ct. at 879.\n\n[¶217] Pulley reviewed the safeguards of the California sentencing scheme at issue and determined the safeguards in place served to assure thoughtful and affective appellate review, focusing upon the circumstances present in each particular case. Id. at 53, 104 S.Ct. at 881. The Court found this determination was proved by the fact the California Supreme Court had reduced a death sentence to life imprisonment in another case where the evidence did not support the findings of special circumstances. Id.\n\n[¶218] Accordingly, the Wyoming Legislature's repeal of this statutory provision does not render the Wyoming death penalty unconstitutional. As we made clear in Hopkinson, however, this court reviews death sentences independently of the legislative mandate. As seen in Pulley, the Court continues to consider a state supreme court's willingness to set aside death sentences when warranted as an important indication that the constitutional safeguards are in place and effective. Our review of each death sentence must be sufficient to permit vacating an arbitrary, unjust death sentence if warranted.\n\nIV. Appellate Review\n\n[¶219] A constitutional death penalty sentencing scheme must ensure the availability of meaningful judicial review as a final safeguard that improves the reliability of the sentencing process. Throughout this opinion, we have applied the final safeguard provided in § 6-2-103:\n\n(c) The Supreme Court of Wyoming shall consider the punishment as well as any errors enumerated by way of appeal.\n\n(d) With regard to the sentence, the court shall determine if:\n\n(i) The sentence of death was imposed under the influence of passion, prejudice or any other arbitrary factor;\n\n(ii) The evidence supports the jury's or judge's finding of an aggravating circumstance as enumerated in W.S. § 6-2-102 and mitigating circumstances.\n\n(iii) Repealed by Laws 1989, ch. 171, § 2.\n\n(e) In addition to its authority regarding correction of errors, the court, with regard to review of death sentences, may:\n\n(i) Affirm the sentence of death;\n\n(ii) Set the sentence aside and impose a sentence of life imprisonment; or\n\n(iii) Set the sentence aside and remand the case for resentencing. Wyo. Stat. Ann. § 6-2-103 (Michie 1997).\n\n[¶220] We have determined that prejudicial errors occurred when the jury considered improper aggravating circumstances; the jury was not properly instructed on the statutorily required decision-making process, the law of mitigating circumstances and the mitigating circumstance of duress; the jury was not provided an adequate verdict form; and victim impact evidence was improperly admitted.\n\n[¶221] In Hopkinson I this court remanded for a new sentencing hearing because this court determined it would not decide whether a different result would have occurred if the improper aggravating circumstances had not been present during the weighing process. Hopkinson I, 632 P.2d at 171. We vacate Olsen's sentence of death and remand for a new penalty hearing on this basis and because of the errors discussed above.\n\nAPPENDIX A\n\nAppellant's Statement of the Issues\n\nConstitutional Issues:\n\nArgument I\n\nThe Wyoming death penalty statute is unconstitutional.\n\nArgument 2\n\nSection 6-2-102 of the Wyoming statutes is unconstitutionally restrictive on the use of mitigating circumstances during the penalty phase.\n\nInstruction Issues Addressing the Penalty Phase:\n\nArgument 3\n\nDue to improper instruction, the jury refused to consider Appellant's mitigating evidence.\n\nArgument 4\n\nThe court's response to the jury's question about executive clemency violated Appellant's due process rights as it was incomplete and provided the jury with information which Appellant had no opportunity to deny or explain.\n\nArgument 5\n\nIt was an improper comment on Appellant's right to remain silent when the jury was instructed that the law did not allow the state a psychological or psychiatric evaluation of Appellant.\n\nArgument 6\n\nContrary to the Wyoming death penalty statute, the trial court instructed the jury the defendant bore the burden of proving mitigating factors.\n\nArgument 7\n\nThe absence of statutory mitigating factors in the jury instructions prevented the jury's consideration of constitutionally relevant evidence.\n\nArgument 8\n\nIt was plain error for the trial court to instruct the jury to consider argument from counsel in reaching its decision in the penalty phase.\n\nArgument 9\n\nThe verdict form was substantively and procedurally defective denying Appellant his due process right to a fair determination of his sentence.\n\nAdditional issues addressing the penalty phase:\n\nArgument 10\n\nThe trial court impermissibly allowed introduction of victim impact statements at Appellant's capital sentencing\n\nArgument 11\n\nApplication of the \"atrocious and cruel\" aggravator is improper in this case.\n\nArgument 12\n\nApplication of \"preventing a lawful arrest\" aggravator is improper.\n\nArgument 13\n\nApplication of \"risk of death to two or more\" aggravator is improper.\n\nArgument 14\n\nApplication of the \"premeditated felony murder\" aggravator impermissibly allowed elements of the homicide to be used to establish an aggravating circumstance.\n\nArgument 15\n\nReversal required because invalid aggravator(s) used to sentence Appellant to death.\n\nArgument 16\n\nThe district court improperly excluded mitigating evidence of Appellant's character.\n\nArgument 17\n\nThe victim impact statements admitted at Appellant's capital sentencing violated the Sixth, Eighth, and Fourteenth Amendments to the United States Constitution.\n\nJury issues:\n\nArgument 18\n\nAppellant's due process right to an impartial jury was denied when the trial court dismissed two jurors for cause over defense counsel's objection.\n\nArgument 19\n\nThe trial court erred when it allowed a jury other than one allowed by statute to decide the Appellant's sentence in the penalty phase.\n\nArgument 20\n\nThe procedure used by the district court to select the alternate juror was contrary to Rule 24, W.R.Cr.P., and denied Appellant his right to a fair trial.\n\nArgument 21\n\nThe trial court abused its discretion when it denied Appellant's motions for a second jury to decide punishment or in the alternative to conduct voir dire directly before the penalty phase.\n\nTrial phase issues:\n\nArgument 22\n\nThe district court violated the Wyoming constitution by allowing an assistant United States attorney to function as special prosecutor.\n\nArgument 23\n\nThe evidence was insufficient to sustain a conviction for premeditated first degree murder.\n\nArgument 24\n\nAppellant was denied effective assistance of counsel as guaranteed by the Sixth Amendment of the United States Constitution and Article I Section 10 of the Wyoming Constitution.\n\nPunishment issues:\n\nArgument 25\n\nLethal injection, Wyoming's method of execution, is cruel and unusual punishment.\n\nAppellee's Statement of the Issues\n\nI. Whether the trial court properly dismissed two jurors for cause?\n\nII. Whether Appellant's penalty phase jury was properly selected?\n\nIII. Whether the Wyoming Constitution was violated by allowing an assistant United States Attorney to function as a special prosecutor?\n\nIV. Whether the evidence was sufficient to sustain Appellant's conviction of premeditated first degree murder?\n\nV. Whether Appellant received effective assistance of counsel?\n\nVI. Whether Wyo. Stat. § 6-2-102 is unconstitutional?\n\nVII. Whether the jury relied upon improper aggravating circumstances to sentence Appellant to death?\n\nVIII. Whether the jury was properly instructed regarding mitigating evidence?\n\nIX. Whether the trial court abused its discretion when it precluded Appellant's witnesses from pleading for his life?\n\nX. Whether the trial court properly allowed victim impact statements to be read during the penalty phase?\n\nXI. Whether the giving of penalty phase Jury Instruction No. 25 constituted an improper comment on Appellant's exercise of his right to silence?\n\nXII. Whether the trial court properly instructed the jury it could consider argument from counsel relating to the significance of evidence in reaching its decision in the penalty phase of trial?\n\nXIII. Whether the trial court properly answered the jury's question regarding the possibility of parole on a life sentence?\n\nXIV. Whether the sentencing phase verdict form was substantively defective or was the timing of its submission to the jury was procedurally improper?\n\nXV. Whether lethal injection is cruel and unusual punishment?\n\nAPPENDIX B\n\n[Prosecutor]: Could you state your full name and occupation?\n\nA: Jan Rosenbach, I'm the director for the Victims of Violence Center here in Worland.\n\nQ: And as part of your duties, have you been in contact with the victims in this particular case?\n\nA: Yes, I have.\n\nQ: And are you familiar with the mother of Emma Lou McCoid?\n\nA: Yes, I am.\n\nQ: Could you tell the jury who that person is, please?\n\nA: Dolly Sorrensen is Emma Lou's mother, and she lives in Basin.\n\nQ: Okay. And did she prepare a statement?\n\nA: Yes, she did.\n\nQ: Have you discussed it with her?\n\nA: Yes, her and I have talked about her reading this, and she finds it difficult to do so.\n\nQ: And so do you have that statement with you now?\n\nA: Yes, I do.\n\nQ: Could you read the statement for the jury, please?\n\nA: Certainly. \"I am the mother of Emma Lou McCoid. Unless you are a parent of someone who has been taken away, you will not know the pain I feel inside my heart. There is an empty spot in my heart and life that will never be filled again.\n\nEach of my children held a part of my heart and had his or her own place special to them. With Emma's untimely and uncalled for death, there is just a pain of loss and a pain of unanswered questions. A pain for her children,\" excuse me, \"a pain for her children, for myself, for her family and for her in her last minutes of life.\n\nAs her mother I can find comfort in the memories of special things a mother remembers and holds in her heart, but there should have been time to make more memories and share more things. My daughter was young with the hopes of years ahead of her to enjoy her life, her children, her family, and just to be here among us going about her daily activities. This was her right, and it all ended when this person took my daughter from us. He can't take the memories from me.\n\nIt is hard to realize that there is no getting her back for one last look, hug, laugh, or any of the things we shared. Just as I miss my child, Emma's children miss their mother, and they are left with a great emptiness. Emma will not know her grandchildren, because of the act of this one person.\n\nI treasure our good times shared and will help her children and grandchildren to come to realize how she loved them and would have loved them. My loss could fill pages, but nothing will bring my baby girl, Emma McCoid, back to us.\n\nIt is very difficult to express my feelings this way, because it is not easy to sort out all my feelings. I will always be her mother no matter where she is and what separates us from each other, but I had every reason to expect that we would be together right here until it would be my own time to leave the world at God's calling.\n\nI expected to enjoy many more times with her, to make more memories, and to watch as she grew older, finished raising her own children, and watch her with her own grandchildren. This is the way it should be right now.\n\nEverything changed that night in January. The shock to my body and my heart when I got the news of her death was overwhelming, and then I have to learn that this young man killed her for no reason, made it too much to bear.\n\nEmma was my daughter and part of me as much as my arms and legs are. I nursed her, watched her grown, and shared the good times and the bad times. Now this part of me is gone and there's an empty ache there. You can only know - you can only know how it hurts if you have had to bury one of your own children. The feelings are beyond explaining, because they are around each day.\n\nI had her and all my memories and all the things a mother holds in her own heart about each of her children. This has all had a terrific impact on me. I have trouble sleeping and sometimes I just don't know what to do with how I feel. It isn't like I lost her to cancer, or in a way that a person can see some reasoning. Sincerely, Dolly Sorrensen.\"\n\nQ: Ms. Rosenbach, did you also - were you also involved in a statement from -regarding Mr. Taylor?\n\nA: Yes, I received -\n\nQ: Do you have it with you?\n\nA: Yes, I do.\n\nQ: Could you tell the jury where that came from, please?\n\nA: This came from June Marx. June Marx was Art Taylor's ex-wife.\n\nQ: Could you read the statement, please?\n\nA: Yes. \"You asked me to tell you who Art Taylor was. That was an astronomical task. Many tries in this essence escapes me. I could send you photos, and you could see him, work shirt and jeans, the inevitable cap, a grin that made his eyes light up, and made you feel like smiling back. When I met him, he was 26 years old, and I told Momma, that's the guy I'm going to marry.\n\nMarry him I did on June 1, 1976. There were four, too short years before alcohol drove us apart. Loving him, I couldn't watch the addiction destroy him. So I divorced my friend, lover, business partner, and the most special man I ever met. He was 26, no children of his own when he embraced five children and their mother to help them grow. Honest, fair, and hard-working. He taught by example and with love.\n\nHe took my sons and made them into men. He took them hunting and fishing, he showed them how to fix a sagging fence, build a foundation, and how to relax after a day's work. He made them face mistakes and he celebrated their successes. Art hired on at Lucky Mac in March of 1976, and in July he became the head shovel mechanic. He had no heavy equipment experience before he hired on, but he stuck with his supervisor, Ted Hailey, and learned all he could, and upon Ted's retirement, Art took his place.\n\nHe was broke and driving an old '67 pickup when he came to Wyoming, but always dreamed of his own business and success. He fell down many, many times, but he got up and started over one more time than he fell. He loved country music, and he loved to dance. He had a fine voice and was rarely refused as a dance partner. He could win hearts and friends anywhere.\n\nArt served in Viet Nam, and though he thought it was a no-win war, he said, \"I had to go, I live here.\" He rarely talked of his experience there, but you knew he had deep feelings regarding that time. He went to the airport with my 18-year-old when he joined the Navy, and he had tears in his eyes, \"Be a man, son,\" and he hugged a son he raised, but never fathered.\n\nOver the years Art and I remained friends, and for many of those years, I remained June Taylor. I did so because no one else measured up. He was so much of what I needed in my life, and I couldn't bring myself to change for less. No, he wasn't a saint, he was a man, faults and all. I had to go when I left him, but I left a lot of myself there with him. We talked of getting back together, but there was still the same old problem, Black Velvet.\n\nWho was Art Taylor, the love of my life, the most sentimental poet ever, and I kept letters to prove it. One of the hardest working people I've ever known. A father who had no children, but he made several young people stronger because of his example. Art was the son of two wonderful, aging people who are deprived of his help when they can no longer do for themselves. His mom calls me, because we can cry together, laugh together, and rejoice that we had him for a while.\n\nWhen I think of all the losses that occurred on January 20 th , I want to weep for the shattered dreams, the dreams of his folks, my children, and others whose life Art had touched. Sincerely, June Taylor Marx.\"\n\nQ: Could you state your name, please?\n\nA: Beverly Baumstarck.\n\nQ: And could you tell the jury your relationship with Kyle Baumstarck?\n\nA: Kyle's mother.\n\nQ: Could you read your statement, please?\n\nA: \"Kyle was a caring, loving, giving person. He was the second of my four children. Wes, Kyle, and Sandy were born in less than two and a half years, and Melinda was born three and a half years after Sandy. He was the most quiet of all, and content to play alone or do what the others wanted. Kyle and Sandy were only 11 months apart in age and went through all 12 years of school together. They were kind of like twins. School was hard for him, but he liked going to be with the other kids. He didn't cause any problems in school and was liked by all, specially teachers.\n\nAfter graduating from high school, he attended classes at Job Corp in Rapid City, South Dakota. He was liked by everyone, and he cam home with several certificates for volunteer work and other accomplishments. Kyle's father passed away just at the time he completed his one -year training in Rapid City. He was content to stay on the farm with me for over a year and work in Linton before getting on with his own life. During that time he, along with the other children, helped me move into town. Since he was living with me, he made many more trips and carried more boxes than anyone else. I don't know what I would have done without him.\n\nShortly after I moved to town my dad passed away, then he went to stay with his grandmother and work near her farm for two years until she was comfortable being alone. He wasn't sure what he wanted to do, so he came back home again and worked for a rancher near Linton. During that time, I moved to Bismarck, and he was my right hand again. He went to Job Corp in Minot in 1994 for additional training for another year before moving to Denver for a year.\n\nDuring that year only Melinda and I saw him once. I was so happy he was back with the family in December. Little did we know it would not last long. I had planned on taking my vacation in June and planned on seeing both of my sons in Worland. He liked kids and was looking forward to getting married and having a family someday. He always had patience and enjoyed spending time with his younger cousins. He would stop to visit aunts and uncles whenever he could.\n\nI miss Kyle very much and will for the rest of my life. I can just see him walk through the door and hear his cheerful, \"Hi, Mom.\" I will also miss having another daughter-in-law and grandchildren. Wes lost his only brother, and Sandy and Melinda now have only one brother. Wes' wife, Christy, had little time to spend with Kyle, she was just getting to know him.\n\nA parent should not have to bury a child, especially for such a senseless reason. Sincerely.\"\n\n\u003cspan class=\"fn\"\u003e1. Chief Justice at time of oral argument\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The verdict form does not specify how many individual jurors believed a mitigating circumstance existed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Before it was repealed, this section read: \"The sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\" Engberg v. State, 686 P.2d 541, 556 (Wyo. 1984). Engberg noted that a proportionality review is not constitutionally mandated as decided in Pulley v. Harris, 465 U.S. 37, 104 S.Ct. 871, 79 L. Ed.2d 29 (1984), but is statutorily mandated. Engberg at 554.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The applicable common-law rule required acceptance of a resignation by proper authority before it is effective to divest an incumbent of public office. Jefferis, 26 Wyo. at 136, 178 P. at 915.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Arizona's procedure which had required the trial judge to find whether statutory factors existed that qualified a defendant for capital punishment was declared constitutional in Walton. That ruling was placed in doubt by the United States Supreme Court's opinion in Apprendi v. New Jersey, 530 U.S. 466, 490, 120 S.Ct. 2348, 2362, 147 L.Ed.2d 435 (2000), which ruled that factual findings that increase the maximum penalty must be considered an element of the offense and determined by a jury. Walton was overruled in Ring v. Arizona, 536 U.S. 584, 122 S.Ct. 2428, 153 L.Ed.2d 556 (2002), when the United States Supreme Court held that Arizona's sentencing procedure was unconstitutional because it allowed the trial judge to make the factual determination that at least one aggravating factor existed that permitted imposition of the death penalty. Id. at 2443.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. \"8. The defendant has been convicted of one or more other homicides, as defined in § 13-1101, whic h were committed during the commission of the offense.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. \"(3) The defendant, in this proceeding, has been convicted of more than one offense of murder in the first or second degree.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. \"(l) The defendant unlawfully and intentionally, knowingly, or with universal malice manifesting extreme indifference to the value of human life generally, killed two or more persons during the commission of the same criminal episode.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. \"(2) At the time the murder was committed the defendant also committed another murder.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. § 6-2-102(h)(viii) provides: The murder of a judicial officer, former judicial officer, district attorney, former district attorney, defending attorney, peace officer, juror or witness, during or because of the exercise of his official duty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. § 6-2-102(h)(xii) provides: The defendant killed another human being purposely and with premeditated malice and while engaged in, or as an accomplice in the commission of, or an attempt to commit, or flight after committing or attempting to commit, any robbery, sexual assault, arson, burglary or kidnapping.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The State defines \"mitigating evidence\" and \"mitigating circumstances\" differently. The Olsen jury was given instructions and a verdict form using the term aggravating and mitigating \"factor.\" A mitigating \"factor\" was defined as \"any aspect of a defendant's character or background, or any circumstance of the offense, which might indicate, or tend to indicate, that the defendant should not be sentenced to death.\" An aggravating \"factor\" was defined as \"a specified fact or circumstance which might indicate, or tend to indicate, that the defendant should be sentenced to death.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. However, just as with affirmative defenses, the ultimate burden of negating such defenses by proof beyond a reasonable doubt remains with the State. The decision in Martin was based on a specific legislative enactment. In upholding the authority of a state to place the burden on the defendant to prove an affirmative defense by a preponderance of the evidence, the United States Supreme Court recognized \"a majority of the States have now assumed the burden of disproving affirmative defenses,\" and only Ohio and South Carolina require the defendant to prove an affirmative defense. Martin [v. Ohio], 480 U.S. [228] at 232, 236, 107 S.Ct. 1098 [94 L.Ed.2d 267 (1987)]. As early as 1889, in Trumble v. Territory, 3 Wyo. 280, 21 P. 1081, 1083 (1889), we rejected the proposition that the defendant carries the burden of proving the charged conduct was justifiable or excusable. In Scheikofsky, following Trumble, we found the instructions as a whole were sufficient to place the burden of disproving self-defense beyond a reasonable doubt on the State, but stated \"[t]he inclusion of the specific statement of the burden of proof would have been preferable * * *.\" Scheikofsky [v. State], 636 P.2d [1107] at 1112 [(Wyo. 1981)]. In Small [v. State], 689 P.2d [420]at 423 [(Wyo. 1984)], we clearly stated: \"When self-defense is properly raised the jury should be specifically instructed that the state has the burden to prove absence of self-defense beyond a reasonable doubt.\" The fact that this case involved a charge of aggravated assault rather than homicide, and defense of others rather than self-defense, does not change the burden of proof. The reason for instruction as to the burden of proof when self-defense is raised is equally applicable to the defense of others. As an initial proposition, the burden is on the defendant charged with aggravated assault to establish a prima facie case on every element of his alleged legal justification. See Amin [v. State], 811 P.2d [255] at 260-61 [(Wyo. 1991)]; Ramos v. State, 806 P.2d 822, 826 (Wyo.1991); and Leeper [v. State], 589 P.2d [379] at 383 [(Wyo. 1979)]. However, once the defendant does so, the court must give instruction on the State's burden to negate this defense beyond a reasonable doubt. See State v. Acosta, 123 N.M. 273, 939 P.2d 1081, 1087, cert. granted, 123 N.M. 215, 937 P.2d 76, cert. quashed, 124 N.M. 312, 950 P.2d 285 (1997) (error in failure to instruct on state's burden of proof when self defense or defense of others properly raised; element of aggravated battery is \"unlawfulness\" of act). . . . Defense of others as justification for the infliction of harm on another is applicable not only to an actual assailant, but also to those acting in concert with the assailant to the extent the defensive force used is necessary and reasonable. The defendant has the burden of showing the facts necessary for each element of his legal justification for his actions when charged with aggravated assault. Once a prima facie case is demonstrated, the State must prove the absence of legal justification beyond a reasonable doubt. Here, the district court failed to instruct the jury on the defense submitted by Duckett. We, therefore, reverse and remand for a new trial. Duckett v. State, 966 P.2d 941, 947-48 (Wyo. 1998) (footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Wyo. Stat. Ann. § 7-21-103 (Michie 1997) states: § 7-21-103. Submission of victim impact statement to sentencing court. (a) Prior to imposition of sentence or any correction or reduction of sentence in a felony case, an identifiable victim of the crime may submit a victim impact statement to the court: (i) By appearing, with or without counsel, to present an oral victim impact statement at the sentencing hearing or at any subsequent hearing for correction or reduction of sentence; or (ii) By submitting a written victim impact statement to the department of corrections, which shall be appended to the presentence report of the defendant, or by submitting a written statement to the court in the case of any subsequent hearing for correction or reduction of sentence. (b) Any victim impact statement submitted to the court pursuant to this section shall be among the factors considered by the court in determining the sentence to be imposed upon the defendant or in determining whether there should be a correction or reduction of sentence. (c) Any failure to comply with the terms of this chapter shall not create a cause for appeal or reduction of sentence for the defendant, or a civil cause of action against any person by the defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. In addition to Pennsylvania and Florida, ten other states revised their death penalty statutes after Payne to provide for consideration of victim impact evidence during capital sentencing proceedings; Ark. Code Ann. § 5-4-602 (Michie Supp. 1995); Colo. Rev. Stat. Ann. § 16-11-103 (West Supp. 1996); La. Code Crim. Proc. Ann. art. 905.2 (West Supp. 1997); Mo. Ann. Stat. § 565.030 (Vernon Supp. 1997); Mont. Code Ann. § 46-18-302 (1995); N.J. Stat. Ann. § 2C:11-3 (West 1995); Okla. Rev. Stat. § 163.150 (Supp. 1996); S.D. Codified Laws Ann. § 23A-27A-2(2) (Supp. 1997); and Utah Code Ann. § 76-3-207 (Supp. 1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In 2001, § 6-2-101(b) was amended to include \"life imprisonment without parole.\" 2001 Wyo. Sess. Laws ch. 96, § 2. However, the amendment is not applicable to this case.\u003c/span\u003e\n\n",
    "body_length": 290235,
    "citedas": [
      "2003 WY 46",
      "67 P.3d 536"
    ],
    "attorneys": "Representing Appellant: Sylvia Lee Hackl, State Public Defender; Donna D. Domonkos, AssistantPublic Defender; Karl Linde, Assistant Public Defender; T. Alan Elrod,Assistant Public Defender; Marion Yoder, Senior Assistant Public Defender.Argument by Ms. Domonkos and Mr. Elrod. Representing Appellee: William U. Hill, Attorney General; Paul Rehurek, Deputy Attorney General;D. Michael Pauling, Senior Assistant Attorney General; Kimberly A. Baker-Musick, Assistant Attorney General. Argument by Ms. Baker-Musick.",
    "category": [
      "36",
      "78"
    ],
    "judges": "Before Golden, LEHMAN*fn1, Macy, Ret., and Taylor, Ret., JJ.",
    "citation_count": 37
  }
}
