{
  "id": "W4TOPmYBTlTomsSBq3N8",
  "document": {
    "title": "Hopwood v. Texas",
    "full_title": "CHERYL J. HOPWOOD, ET AL. VERSUS STATE OF TEXAS, ET AL. VERSUS THURGOOD MARSHALL LEGAL SOCIETY AND BLACK PRE-LAW ASSOCIATION, MOVANTS-APPELLANTS. DOUGLAS CARVELL, ET AL. VERSUS STATE OF TEXAS, ET AL. VERSUS THURGOOD MARSHALL LEGAL SOCIETY, AND BLACK PRE-LAW ASSOCIATION, MOVANTS-APPELLANTS. CHERYL J. HOPWOOD, ET AL. CHERYL J. HOPWOOD, ET AL. VERSUS STATE OF TEXAS, ET AL. . DOUGLAS CARVELL, ET AL. DOUGLAS CARVELL VERSUS STATE OF TEXAS, ET AL. .",
    "jurisdiction": "Fifth Circuit",
    "date": "1996-03-18T00:00:00.000Z",
    "docket": "No. 94-50569, No. 94-50664",
    "body": "JERRY E. SMITH, Circuit Judge:\n\nWith the best of intentions, in order to increase the enrollment of certain favored classes of minority students, the University of Texas School of Law (\"the law school\") discriminates in favor of those applicants by giving substantial racial preferences in its admissions program. The beneficiaries of this system are blacks and Mexican Americans, to the detriment of whites and non-preferred minorities. The question we decide today in No. 94-50664 is whether the Fourteenth Amendment permits the school to discriminate in this way.\n\nWe hold that it does not. The law school has presented no compelling justification, under the Fourteenth Amendment or Supreme Court precedent, that allows it to continue to elevate some races over others, even for the wholesome purpose of correcting perceived racial imbalance in the student body. \"Racial preferences appear to 'even the score' . . . only if one embraces the proposition that our society is appropriately viewed as divided into races, making it right that an inJustice rendered in the past to a black man should be compensated for by discriminating against a white.\" City of Richmond v. J.A. Croson Co., 488 U.S. 469, 528, 102 L. Ed. 2d 854, 109 S. Ct. 706 (1989) (Scalia, J., Concurring in the judgment).\n\nAs a result of its diligent efforts in this case, the district court concluded that the law school may continue to impose racial preferences. See Hopwood v. Texas, 861 F. Supp. 551 (W.D. Tex. 1994). In No. 94-50664, we reverse and remand, concluding that the law school may not use race as a factor in law school admissions. Further, we instruct the court to reconsider the issue of damages in accordance with the legal standards we now explain. In No. 94-50569, regarding the denial of intervention by two black student groups, we dismiss the appeal for want of jurisdiction.\n\nI.\n\nA.\n\nThe University of Texas School of Law is one of the nation's leading law schools, consistently ranking in the top twenty. See, e.g., America's Best Graduate Schools, U.S. NEWS \u0026 WORLD REPORT Mar. 20, 1995, at 84 (national survey ranking of seventeenth). Accordingly, admission to the law school is fiercely competitive, with over 4,000 applicants a year competing to be among the approximately 900 offered admission to achieve an entering class of about 500 students. Many of these applicants have some of the highest grades and test scores in the country.\n\nNumbers are therefore paramount for admission. In the early 1990's, the law school largely based its initial admissions decisions upon an applicant's so-called Texas Index (\"TI\") number, a composite of undergraduate grade point average (\"GPA\") and Law School Aptitude Test (\"LSAT\") score.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The law school used this number as a matter of administrative convenience in order to rank candidates and to predict, roughly, one's probability of success in law school. Moreover, the law school relied heavily upon such numbers to estimate the number of offers of admission it needed to make in order to fill its first-year class.\n\nOf course, the law school did not rely upon numbers alone. The admissions office necessarily exercised judgment in interpreting the individual scores of applicants, taking into consideration factors such as the strength of a student's undergraduate education, the difficulty of his major, and significant trends in his own grades and the undergraduate grades at his respective college (such as grade inflation). Admissions personnel also considered what qualities each applicant might bring to his law school class. Thus, the law school could consider an applicant's background, life experiences, and outlook. Not surprisingly, these hard-to-quantify factors were especially significant for marginal candidates.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nBecause of the large number of applicants and potential admissions factors, the TI's administrative usefulness was its ability to sort candidates. For the class entering in 1992 the admissions group at issue in this casethe law school placed the typical applicant in one of three categories according to his TI scores: \"presumptive admit,\" \"presumptive deny,\" or a middle \"discretionary zone.\" An applicant's TI category determined how extensive a review his application would receive.\n\nMost, but not all, applicants in the presumptive admit category received offers of admission with little review. Professor Stanley Johanson, the Chairman of the Admissions Committee, or Dean Laquita Hamilton, the Assistant Dean for Admissions, reviewed these files and downgraded only five to ten percent to the discretionary zone because of weaknesses in their applications, generally a non-competitive major or a weak undergraduate education.\n\nApplicants in the presumptive denial category also received little consideration. Similarly, these files would be reviewed by one or two professors, who could upgrade them if they believed that the TI score did not adequately reflect potential to compete at the law school. Otherwise, the applicant was rejected.\n\nApplications in the middle range were subjected to the most extensive scrutiny. For all applicants other than blacks and Mexican Americans, the files were bundled into stacks of thirty, which were given to admissions subcommittees consisting of three members of the full admissions committee. Each subcommittee member, in reviewing the thirty files, could cast a number of votes typically from nine to eleven\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e among the thirty files. Subject to the chairman's veto, if a candidate received two or three votes, he received an offer; if he garnered one vote, he was put on the waiting list; those with no votes were denied admission.\n\nBlacks and Mexican Americans were treated differently from other candidates, however. First, compared to whites and non-preferred minorities,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e the TI ranges that were used to place them into the three admissions categories were lowered to allow the law school to consider and admit more of them. In March 1992, for example, the presumptive TI admission score for resident whites and non-preferred minorities was 199.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Mexican Americans and blacks needed a TI of only 189 to be presumptively admitted.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The difference in the presumptive-deny ranges is even more striking. The presumptive denial score for \"nonminorities\" was 192; the same score for blacks and Mexican Americans was 179.\n\nWhile these cold numbers may speak little to those unfamiliar with the pool of applicants, the results demonstrate that the difference in the two ranges was dramatic. According to the law school, 1992 resident white applicants had a mean GPA of 3.53 and an LSAT of 164. Mexican Americans scored 3.27 and 158; blacks scored 3.25 and 157. The category of \"other minority\" achieved a 3.56 and 160.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThese disparate standards greatly affected a candidate's chance of admission. For example, by March 1992, because the presumptive denial score for whites was a TI of 192 or lower, and the presumptive admit TI for minorities was 189 or higher, a minority candidate with a TI of 189 or above almost certainly would be admitted, even though his score was considerably below\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e the level at which a white candidate almost certainly would be rejected. Out of the pool of resident applicants who fell within this range (189-192 inclusive), 100% of blacks and 90% of Mexican Americans, but only 6% of whites, were offered admission.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nThe stated purpose of this lowering of standards was to meet an \"aspiration\" of admitting a class consisting of 10% Mexican Americans and 5% blacks, proportions roughly comparable to the percentages of those races graduating from Texas colleges. The law school found meeting these \"goals\" difficult, however, because of uncertain acceptance rates and the variable quality of the applicant pool.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e In 1992, for example, the entering class contained 41 blacks and 55 Mexican Americans, respectively 8% and 10.7% of the class.\n\nIn addition to maintaining separate presumptive TI levels for minorities and whites, the law school ran a segregated application evaluation process. Upon receiving an application form, the school color-coded it according to race. If a candidate failed to designate his race, he was presumed to be in a nonpreferential category. Thus, race was always an overt part of the review of any applicant's file.\n\nThe law school reviewed minority candidates within the applicable discretionary range differently from whites. Instead of being evaluated and compared by one of the various discretionary zone subcommittees, black and Mexican American applicants' files were reviewed by a minority subcommittee of three, which would meet and discuss every minority candidate. Thus, each of these candidates' files could get extensive review and Discussion. And while the minority subcommittee reported summaries of files to the admissions committee as a whole, the minority subcommittee's decisions were \"virtually final.\"\n\nFinally, the law school maintained segregated waiting lists, dividing applicants by race and residence. Thus, even many of those minority applicants who were not admitted could be set aside in \"minority-only\" waiting lists. Such separate lists apparently helped the law school maintain a pool of potentially acceptable, but marginal, minority candidates.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nB.\n\nCheryl Hopwood, Douglas Carvell, Kenneth Elliott, and David Rogers (the \"plaintiffs\") applied for admission to the 1992 entering law school class. All four were white residents of Texas and were rejected.\n\nThe plaintiffs were considered as discretionary zone candidates.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Hopwood, with a GPA of 3.8 and an LSAT of 39 (equivalent to a three-digit LSAT of 160), had a TI of 199, a score barely within the presumptive-admit category for resident whites, which was 199 and up. She was dropped into the discretionary zone for resident whites (193 to 198), however, because Johanson decided her educational background overstated the strength of her GPA. Carvell, Elliott, and Rogers had TI's of 197, at the top end of that discretionary zone. Their applications were reviewed by admissions subcommittees, and each received one or no vote.\n\nII.\n\nThe plaintiffs sued primarily under the Equal Protection Clause of the Fourteenth Amendment; they also claimed derivative statutory violations of 42 U.S.C. §§ 1981 and 1983 and of title VI of the Civil Rights Act of 1964, 42 U.S.C. § 2000d (\"title VI\").\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The plaintiffs' central claim is that they were subjected to unconstitutional racial discrimination by the law school's evaluation of their admissions applications. They sought injunctive and declaratory relief and compensatory and punitive damages.\n\nAfter a bench trial, the district court held that the school had violated the plaintiffs' equal protection rights. 861 F. Supp. at 579. The plaintiffs' victory was pyrrhic at best, however, as the court refused to enjoin the law school from using race in admissions decisions or to grant damages beyond a one-dollar nominal award to each plaintiff. The district court, however, did grant declaratory relief and ordered that the plaintiffs be allowed to apply again without paying the requisite fee. Id. at 583.\n\nThe district court began by recognizing the proper constitutional standard under which to evaluate the admissions program: strict scrutiny. Id. at 568. As it was undisputed that the school had treated applicants disparately based upon the color of their skin, the court asked whether the law school process (1) served a compelling government interest and (2) was narrowly tailored to the achievement of that goal. Under the first prong of the test, the court held that two of the law school's five proffered reasons met constitutional muster: (1) \"obtaining the educational benefits that flow from a racially and ethnically diverse student body\" and (2) \"the objective of overcoming past effects of discrimination.\" Id. at 571.\n\nSignificantly, on the second justification, the court rejected the plaintiffs' argument that the analysis of past discrimination should be limited to that of the law school; instead, the court held that the State of Texas's \"institutions of higher education are inextricably linked to the primary and secondary schools in the system.\" Id.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Accordingly, the court found that Texas's long history of racially discriminatory practices in its primary and secondary schools in its not-too-distant past had the following present effects at UT law: \"the law school's lingering reputation in the minority community, particularly with prospective students, as a 'white' school; an underrepresentation of minorities in the student body; and some perception that the law school is a hostile environment for minorities.\" Id. at 572. The court also noted that \"were the Court to limit its review to the University of Texas, the Court would still find a 'strong evidentiary basis for concluding that remedial action is necessary.'\" Id. (citation omitted).\n\nThe court next evaluated whether the Texas program was narrowly tailored to further these goals. Id. at 573. Applying a four-factor test devised by the Supreme Court, the court held only part of the 1992 admissions scheme unconstitutional. Those parts that gave minorities a \"plus,\" that is, the component of the admissions program that treated candidates' TI scores differently based upon race, was upheld. Id. at 578.\n\nThe court held, however, that differential treatment was not allowed where candidates of different races were not compared at some point in the admission process. Thus, the court struck down the school's use of separate admissions committees for applications in the discretionary zone, id. at 578-79, and in dictum speculated that presumptive denial lines would not pass muster, as many white candidates would get no review, while similarly situated minorities would, id. at 576 n.71.\n\nThough it declared that the law school's 1992 admissions program violated the plaintiffs' equal protection rights, the court granted little relief. First, the court did not order that the plaintiffs be admitted to the law school. Instead, it used what it saw as analogous title VII caselaw on burden-shifting to hold that while the state had committed a constitutional violation, the plaintiffs had the ultimate burden of proving damages. Id. at 579-80. The court then found that the defendants had proffered a legitimate, non-discriminatory reason for denying the plaintiffs admission and that the plaintiffs had not met their burden of showing that they would have been admitted but for the unlawful system. Id. at 582.\n\nMoreover, the court held that the plaintiffs were not entitled to prospective injunctive relief, because \"of the law school's voluntary change to a procedure, which on paper and from the testimony, appears to remedy the defects the Court has found in the 1992 procedure.\" Id.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e To pass muster under the court's reasoning, the law school simply had to have one committee that at one time during the process reviewed all applications and did not establish separate TI numbers to define the presumptive denial categories. In other words, if the law school applied the same academic standards, but had commingled the minority review in the discretionary zone with the review of whites, its program would not have been struck down. The same admissions result would occur, but the process would be \"fair.\" Id.\n\nFinally, the court determined that the only appropriate relief was a declaratory judgment and an order allowing the plaintiffs to reapply to the school without charge. Id. at 582-83. No compensatory or punitive damages, the court reasoned, could be awarded where the plaintiffs had proven no harm. Moreover, the court reasoned that as the law school had promised to change its admissions program by abandoning the two-committee system, no prospective injunctive relief was justified.\n\nIII.\n\nThe central purpose of the Equal Protection Clause \"is to prevent the States from purposefully discriminating between individuals on the basis of race.\" Shaw v. Reno, 509 U.S. 630, 125 L. Ed. 2d 511, 113 S. Ct. 2816, 2824 (1993) (citing Washington v. Davis, 426 U.S. 229, 239, 48 L. Ed. 2d 597, 96 S. Ct. 2040 (1976)). It seeks ultimately to render the issue of race irrelevant in governmental decisionmaking. See Palmore v. Sidoti, 466 U.S. 429, 432, 80 L. Ed. 2d 421, 104 S. Ct. 1879 (1984) (\"A core purpose of the Fourteenth Amendment was to do away with all governmentally imposed discrimination.\")(footnote omitted).\n\nAccordingly, discrimination based upon race is highly suspect. \"Distinctions between citizens solely because of their ancestry are by their very nature odious to a free people whose institutions are founded upon the doctrine of equality,\" and \"racial discriminations are in most circumstances irrelevant and therefore prohibited . . . .\" Hirabayashi v. United States, 320 U.S. 81, 100, 87 L. Ed. 1774, 63 S. Ct. 1375 (1943). Hence, \"preferring members of any one group for no reason other than race or ethnic origin is discrimination for its own sake. This the Constitution forbids.\" Regents of Univ. of Cal. v. Bakke, 438 U.S. 265, 307, 57 L. Ed. 2d 750, 98 S. Ct. 2733 (1978) (opinion of Powell, J.); see also Loving v. Virginia, 388 U.S. 1, 11, 18 L. Ed. 2d 1010, 87 S. Ct. 1817 (1967); Brown v. Board of Educ., 347 U.S. 483, 493-94, 98 L. Ed. 873, 74 S. Ct. 686 (1954). These equal protection maxims apply to all races. Adarand Constructors v. Pena, 132 L. Ed. 2d 158, 115 S. Ct. 2097, 2111 (1995).\n\nIn order to preserve these principles, the Supreme Court recently has required that any governmental action that expressly distinguishes between persons on the basis of race be held to the most exacting scrutiny. See, e.g., id. at 2113; Loving, 388 U.S. at 11. Furthermore, there is now absolutely no doubt that courts are to employ strict scrutiny\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e when evaluating all racial classifications, including those characterized by their proponents as \"benign\" or \"remedial.\"\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nStrict scrutiny is necessary because the mere labeling of a classification by the government as \"benign\" or \"remedial\" is meaningless. As Justice O'Connor indicated in Croson :\n\nAbsent searching judicial inquiry into the justifications for such race-based measures, there is simply no way of determining what classifications are \"benign\" or \"remedial\" and what classifications are in fact motivated by illegitimate notions of racial inferiority or simple racial politics. Indeed, the purpose of strict scrutiny is to \"smoke out\" illegitimate uses of race by assuring that the legislative body is pursuing a goal important enough to warrant use of a highly suspect tool. The test also ensures that the means chosen \"fit\" this compelling goal so closely that there is little or no possibility that the motive for the classification was illegitimate racial prejudice or stereotype.\n\nId. at 493 (plurality opinion).\n\nUnder the strict scrutiny analysis, we ask two questions: (1) Does the racial classification serve a compelling government interest, and (2) is it narrowly tailored to the achievement of that goal? Adarand, 115 S. Ct. at 2111, 2117. As the Adarand Court emphasized, strict scrutiny ensures that \"courts will consistently give racial classifications . . . detailed examination both as to ends and as to means.\" Id.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nFinally, when evaluating the proffered governmental interest for the specific racial classification, to decide whether the program in question narrowly achieves that interest, we must recognize that \"the rights created by . . . the Fourteenth Amendment are, by its terms, guaranteed to the individual. The rights established are personal rights.\" Shelley v. Kraemer, 334 U.S. 1, 22, 92 L. Ed. 1161, 68 S. Ct. 836 (1948).\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Thus, the Court consistently has rejected arguments conferring benefits on a person based solely upon his membership in a specific class of persons.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nWith these general principles of equal protection in mind, we turn to the specific issue of whether the law school's consideration of race as a factor in admissions violates the Equal Protection Clause. The district court found both a compelling remedial and a non-remedial justification for the practice.\n\nFirst, the court approved of the non-remedial goal of having a diverse student body, reasoning that \"obtaining the educational benefits that flow from a racially and ethnically diverse student body remains a sufficiently compelling interest to support the use of racial classifications.\" 861 F. Supp. at 571. Second, the court determined that the use of racial classifications could be justified as a remedy for the \"present effects at the law school of past discrimination in both the University of Texas system and the Texas educational system as a whole.\" Id. at 573.\n\nA.\n\n1.\n\nJustice Powell's separate opinion in Bakke provided the original impetus for recognizing diversity as a compelling state interest in higher education. In that case, Allan Bakke, a white male, was denied admission to the Medical School of the University of California at Davis, a state-run institution. Claiming that the State had discriminated against him impermissibly because it operated two separate admissions programs for the medical school, he brought suit under the state constitution, title VI, and the Equal Protection Clause.\n\nUnder the medical school's admissions system, the white applicants, who comprised the majority of the prospective students, applied through the general admissions program. A special admissions program was reserved for members of \"minority groups\" or groups designated as \"economically and/or educationally disadvantaged.\" The university set aside sixteen of the one hundred positions in the entering class for candidates from the special program.\n\nThe California Supreme Court struck down the program on equal protection grounds, enjoined any consideration of race in the admissions process, and ordered that Bakke be admitted. The United States Supreme Court affirmed in part and reversed in part in an opinion announced by Justice Powell. 438 U.S. at 271-72 (opinion of Powell, J.). The Court reached no consensus on a justification for its result, however. Six Justices filed opinions, none of which garnered more than four votes (including the writer's). The two major opinions one four-Justice opinion by Justices Brennan, White, Marshall, and Blackmun and one by Justice Stevens in which Chief Justice Burger and Justices Stewart and Rehnquist joined reflected completely contrary views of the law.\n\nWhile Justice Powell found the program unconstitutional under the Equal Protection Clause and affirmed Bakke's admission, Justice Stevens declined to reach the constitutional issue and upheld Bakke's admission under title VI. Justice Powell also concluded that the California Supreme Court's proscription of the consideration of race in admissions could not be sustained. This became the judgment of the Court, as the four-Justice opinion by Justice Brennan opined that racial classifications designed to serve remedial purposes should receive only intermediate scrutiny. These Justices would have upheld the admissions program under this intermediate scrutiny, as it served the substantial and benign purpose of remedying past societal discrimination.\n\nHence, Justice Powell's opinion has appeared to represent the \"swing vote,\" and though, in significant part, see id. at 272 n. *, it was joined by no other Justice, it has played a prominent role in subsequent debates concerning the impact of Bakke.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e In the present case, the significance of Justice Powell's opinion is its Discussion of compelling state interests under the Equal Protection Clause. See id. at 305-15. Specifically, after Justice Powell recognized that the proper level of review for racial classifications is strict scrutiny, id. at 305-06, he rejected and accepted respective justifications for the school's program as \"substantial enough to support the use of a suspect classification,\" id. at 306. Notably, because the first step in reviewing an affirmative action program is a determination of the state's interests at stake,\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e it often is the determinative step. Justice Powell outlined the four state interests proffered by the Bakke defendants:\n\nThe special admissions program purports to serve the purposes of: (i) \"reducing the historic deficit of traditionally disfavored minorities in medical schools and in the medical profession,\"; (ii) countering the effects of societal discrimination; (iii) increasing the number of physicians who will practice in communities currently underserved; and (iv) obtaining the educational benefits that flow from an ethnically diverse student body.\n\nId. at 305-06 (emphasis added, citation and footnote omitted).\n\nJustice Powell reasoned that the second and third justifications--remedying societal discrimination and providing role models--were never appropriate.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e He determined that any remedial justification was limited to eliminating \"identified discrimination\" with \"disabling effects.\" Id. at 307 (citing the school desegregation cases). He specifically emphasized that a particularized finding of a constitutional or statutory violation must be present before a remedy is justified. He determined not only that such findings were not present in Bakke, but that the medical school was not even in a position to make such findings. Id. at 309.\n\nJustice Powell further reasoned that diversity is a sufficient justification for limited racial classification. Id. at 311-16. \"[The attainment of a diverse student body] clearly is a constitutionally permissible goal for an institution of higher education.\" Id. at 311. He argued that diversity of minorities' viewpoints furthered \"academic freedom,\" an interest under the Constitution. While acknowledging that \"academic freedom\" does not appear as a constitutional right, he argued that it had \"long . . . been viewed as a special concern of the First Amendment.\" Id. at 312.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nJustice Powell presented this \"special concern\" as in tension with the Fourteenth Amendment. \"Thus, in arguing that its universities must be accorded the right to select those students who will contribute the most to the 'robust exchange of ideas,' petitioner invokes a countervailing constitutional interest, that of the First Amendment.\" Id. at 313.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e The Justice then concluded that\n\nan otherwise qualified medical student with a particular background -- -- whether it be ethnic, geographic, culturally advantaged or disadvantaged -- -- may bring to a professional school of medicine experiences, outlooks, and ideas that enrich the training of its student body and better equip its graduates to render with understanding their vital service to humanity.\n\nId. at 314 (footnote omitted). Justice Powell therefore approved of a consideration of ethnicity as \"one element in a range of factors a university properly may consider in attaining the goal of a heterogeneous student body.\" Id.\n\nThe next step for Justice Powell was to decide whether the medical school's program was necessary to further the goal of diversity. He said it was not. As the program made race the only determining factor for a certain number of the open spots that had been set aside, it did not further full diversity but only a conception of that term limited to race.\n\nJustice Powell speculated that a program in which \"race or ethnic background may be deemed a 'plus' in a particular applicant's file, yet does not insulate the individual from comparison with all the other candidates for the available seats,\" might pass muster. Id. at 317. The Justice did not define what he meant by a \"plus,\" but he did write that a \"plus\" program would be one in which an\n\napplicant who loses out to another candidate receiving a 'plus' on the basis of ethnic background will not have been foreclosed from all consideration for that seat simply because he was not the right color or had the wrong surname. It would only mean that his combined qualifications, which may have included similar nonobjective factors, did not outweigh those of another applicant. His qualifications would have been weighted fairly and competitively, and he would have no basis to complaint of unequal treatment under the Fourteenth Amendment.\n\nId. at 318.\n\nUnder this conception of the Fourteenth Amendment, a program that considered a host of factors that include race would be constitutional, even if an applicant's race \"tipped the scales\" among qualified applicants. What a school could not do is to refuse to compare applicants of different races or establish a strict quota on the basis of race. In sum, Justice Powell found the school's program to be an unconstitutional \"quota\" system, but he intimated that the Constitution would allow schools to continue to use race in a wide-ranging manner.\n\n2.\n\nHere, the plaintiffs argue that diversity is not a compelling governmental interest under superseding Supreme Court precedent. Instead, they believe that the Court finally has recognized that only the remedial use of race is compelling. In the alternative, the plaintiffs assert that the district court misapplied Justice Powell's Bakke standard, as the law school program here uses race as a strong determinant rather than a mere \"plus\" factor and, in any case, the preference is not narrowly applied. The law school maintains, on the other hand, that Justice Powell's formulation in Bakke is law and must be followed at least in the context of higher education.\n\nWe agree with the plaintiffs that any consideration of race or ethnicity by the law school for the purpose of achieving a diverse student body is not a compelling interest under the Fourteenth Amendment. Justice Powell's argument in Bakke garnered only his own vote and has never represented the view of a majority of the Court in Bakke or any other case. Moreover, subsequent Supreme Court decisions regarding education state that non-remedial state interests will never justify racial classifications. Finally, the classification of persons on the basis of race for the purpose of diversity frustrates, rather than facilitates, the goals of equal protection.\n\nJustice Powell's view in Bakke is not binding precedent on this issue. While he announced the judgment, no other Justice joined in that part of the opinion discussing the diversity rationale. In Bakke, the word \"diversity\" is mentioned nowhere except in Justice Powell's single-Justice opinion. In fact, the four-Justice opinion, which would have upheld the special admissions program under intermediate scrutiny, implicitly rejected Justice Powell's position. See 438 U.S. at 326 n.1 (Brennan, White, Marshall, and Blackmun JJ., Concurring in the judgment in part and Dissenting) (\"We also agree with Mr. Justice POWELL that a plan like the \"Harvard\" plan . . . is constitutional under our approach, at least so long as the use of race to achieve an integrated student body is necessitated by the lingering effects of past discrimination. \") (emphasis added). Justice Stevens declined to discuss the constitutional issue. See id. at 412 (Stevens, J., Concurring in the judgment in part and Dissenting in part).\n\nThus, only one Justice concluded that race could be used solely for the reason of obtaining a heterogenous student body. As the Adarand Court states, the Bakke Court did not express a majority view and is questionable as binding precedent. 115 S. Ct. at 2109 (\"The Court's failure in Bakke. . . left unresolved the proper analysis for remedial race-based government action.\").\n\nSince Bakke, the Court has accepted the diversity rationale only once in its cases dealing with race. Significantly, however, in that case, Metro Broadcasting, Inc. v. Federal Communications Comm'n, 497 U.S. 547, 564-65, 111 L. Ed. 2d 445, 110 S. Ct. 2997 (1990), the five-Justice majority relied upon an intermediate scrutiny standard of review to uphold the federal program seeking diversity in the ownership of broadcasting facilities. In Adarand, 115 S. Ct. at 2112-13, the Court squarely rejected intermediate scrutiny as the standard of review for racial classifications, and Metro Broadcasting is now specifically overruled to the extent that it was in conflict with this holding. Id. at 2113. No case since Bakke has accepted diversity as a compelling state interest under a strict scrutiny analysis.\n\nIndeed, recent Supreme Court precedent shows that the diversity interest will not satisfy strict scrutiny. Foremost, the Court appears to have decided that there is essentially only one compelling state interest to justify racial classifications: remedying past wrongs. In Croson, 488 U.S. at 493 (plurality opinion), the Court flatly stated that \"unless [racial classifications] are strictly reserved for remedial settings, they may in fact promote notions of racial inferiority and lead to a politics of racial hostility.\" (emphasis added).\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nJustice O'Connor, in her Adarand -vindicated Dissent in Metro Broadcasting, joined by Justices Rehnquist, Scalia, and Kennedy, explained this position:\n\nModern equal protection has recognized only one [compelling state] interest: remedying the effects of racial discrimination. The interest in increasing the diversity of broadcast viewpoints is clearly not a compelling interest. It is simply too amorphous, too insubstantial, and too unrelated to any legitimate basis for employing racial classifications.\n\n497 U.S. at 612 (O'Connor, J., Dissenting). Indeed, the majority in Metro Broadcasting had not claimed otherwise and decided only that such an interest was \"important.\" Justice Thomas, who joined the Court after Metro Broadcasting was decided, roundly condemned \"benign\" discrimination in his recent Adarand opinion, in which he suggests that the diversity rationale is inadequate to meet strict scrutiny. See Adarand, 115 S. Ct. at 2119 (Thomas, J., Concurring in part and Concurring in judgment).\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nIn short, there has been no indication from the Supreme Court, other than Justice Powell's lonely opinion in Bakke, that the state's interest in diversity constitutes a compelling justification for governmental race-based discrimination. Subsequent Supreme Court caselaw strongly suggests, in fact, that it is not.\n\nWithin the general principles of the Fourteenth Amendment, the use of race in admissions for diversity in higher education contradicts, rather than furthers, the aims of equal protection. Diversity fosters, rather than minimizes, the use of race. It treats minorities as a group, rather than as individuals. It may further remedial purposes but, just as likely, may promote improper racial stereotypes, thus fueling racial hostility.\n\nThe use of race, in and of itself, to choose students simply achieves a student body that looks different. Such a criterion is no more rational on its own terms than would be choices based upon the physical size or blood type of applicants. Thus, the Supreme Court has long held that governmental actors cannot justify their decisions solely because of race. See, e.g., Croson, 488 U.S. at 496 (plurality opinion); Bakke, 438 U.S. at 307 (opinion of Powell, J.).\n\nAccordingly, we see the caselaw as sufficiently established that the use of ethnic diversity simply to achieve racial heterogeneity, even as part of the consideration of a number of factors, is unconstitutional. Were we to decide otherwise, we would contravene precedent that we are not authorized to challenge.\n\nWhile the use of race per se is proscribed, state-supported schools may reasonably consider a host of factors -- -- some of which may have some correlation with race -- -- in making admissions decisions. The federal courts have no warrant to intrude on those executive and legislative judgments unless the distinctions intrude on specific provisions of federal law or the Constitution. A university may properly favor one applicant over another because of his ability to play the cello, make a downfield tackle, or understand chaos theory. An admissions process may also consider an applicant's home state or relationship to school alumni. Law schools specifically may look at things such as unusual or substantial extracurricular activities in college, which may be atypical factors affecting undergraduate grades. Schools may even consider factors such as whether an applicant's parents attended college or the applicant's economic and social background.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nFor this reason, race often is said to be justified in the diversity context, not on its own terms, but as a proxy for other characteristics that institutions of higher education value but that do not raise similar constitutional concerns.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Unfortunately, this approach simply replicates the very harm that the Fourteenth Amendment was designed to eliminate.\n\nThe assumption is that a certain individual possesses characteristics by virtue of being a member of a certain racial group. This assumption, however, does not withstand scrutiny. \"The use of a racial characteristic to establish a presumption that the individual also possesses other, and socially relevant, characteristics, exemplifies, encourages, and legitimizes the mode of thought and behavior that underlies most prejudice and bigotry in modern America.\" Richard A. Posner, The DeFunis Case and the Constitutionality of Preferential Treatment of Racial Minorities, 1974 SUP. CT. REV. 12 (1974).\n\nTo believe that a person's race controls his point of view is to stereotype him. The Supreme Court, however, \"has remarked a number of times, in slightly different contexts, that it is incorrect and legally inappropriate to impute to women and minorities 'a different attitude about such issues as the federal budget, school prayer, voting, and foreign relations.'\" Michael S. Paulsen, Reverse Discrimination and Law School Faculty Hiring: The Undiscovered Opinion, 71 TEX. L. REV. 993, 1000 (1993) (quoting Roberts v. United States Jaycees, 468 U.S. 609, 627-28, 82 L. Ed. 2d 462, 104 S. Ct. 3244 (1984)). \"Social scientists may debate how peoples' thoughts and behavior reflect their background, but the Constitution provides that the government may not allocate benefits or burdens among individuals based on the assumption that race or ethnicity determines how they act or think.\" Metro Broadcasting, 497 U.S. at 602 (O'Connor, J., Dissenting).\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nInstead, individuals, with their own conceptions of life, further diversity of viewpoint. Plaintiff Hopwood is a fair example of an applicant with a unique background. She is the now-thirty-two-year-old wife of a member of the Armed Forces stationed in San Antonio and, more significantly, is raising a severely handicapped child. Her circumstance would bring a different perspective to the law school. The school might consider this an advantage to her in the application process, or it could decide that her family situation would be too much of a burden on her academic performance.\n\nWe do not opine on which way the law school should weigh Hopwood's qualifications; we only observe that \"diversity\" can take many forms. To foster such diversity, state universities and law schools and other governmental entities must scrutinize applicants individually, rather than resorting to the dangerous proxy of race.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nThe Court also has recognized that government's use of racial classifications serves to stigmatize. See, e.g., Brown v. Board of Educ., 347 U.S. 483, 494, 98 L. Ed. 873, 74 S. Ct. 686 (1954) (observing that classification on the basis of race \"generates a feeling of inferiority\"). While one might argue that the stigmatization resulting from so-called \"benign\" racial classifications is not as harmful as that arising from invidious ones,\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e the current Court has now retreated from the idea that so-called benign and invidious classifications may be distinguished.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e As the plurality in Croson warned, \"classifications based on race carry the danger of stigmatic harm. Unless they are reserved for remedial settings, they may in fact promote notions of racial inferiority and lead to the politics of racial hostility.\" 488 U.S. at 493.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nFinally, the use of race to achieve diversity undercuts the ultimate goal of the Fourteenth Amendment: the end of racially motivated state action. Justice Powell's conception of race as a \"plus\" factor would allow race always to be a potential factor in admissions decisionmaking. While Justice Blackmun recognized the tension inherent in using race-conscious remedies to achieve a race-neutral society, he nevertheless accepted it as necessary. Bakke, 438 U.S. at 405. Several Justices who, unlike Justices Powell and Blackmun, are still on the Court, have now renounced toleration of this tension, however. See Croson, 488 U.S. at 495 (plurality opinion of O'Connor, J.) (\"The Dissent's watered down version of equal protection review effectively assures that race will always be relevant in American life, and that the 'ultimate goal' of 'eliminating entirely from government decisionmaking such irrelevant factors as a human being's race . . . will never be achieved.\") (quoting Wygant, 476 U.S. at 320 (Stevens, J., Dissenting)).\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nIn sum, the use of race to achieve a diverse student body, whether as a proxy for permissible characteristics, simply cannot be a state interest compelling enough to meet the steep standard of strict scrutiny.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e These latter factors may, in fact, turn out to be substantially correlated with race, but the key is that race itself not be taken into account. Thus, that portion of the district court's opinion upholding the diversity rationale is reversibly flawed.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nB.\n\nWe now turn to the district court's determination that \"the remedial purpose of the law school's affirmative action program is a compelling government objective.\" 861 F. Supp. at 573. The plaintiffs argue that the court erred by finding that the law school could employ racial criteria to remedy the present effects of past discrimination in Texas's primary and secondary schools. The plaintiffs contend that the proper unit for analysis is the law school, and the state has shown no recognizable present effects of the law school's past discrimination. The law school, in response, notes Texas's well-documented history of discrimination in education and argues that its effects continue today at the law school, both in the level of educational attainment of the average minority applicant and in the school's reputation.\n\nIn contrast to its approach to the diversity rationale, a majority of the Supreme Court has held that a state actor may racially classify where it has a \"strong basis in the evidence for its Conclusion that remedial action was necessary.\" Croson, 488 U.S. at 500 (quoting Wygant, 476 U.S. at 277 (plurality opinion)). Generally, \"in order to justify an affirmative action program, the State must show there are 'present effects of past discrimination.'\" Hopwood v. Texas (\"Hopwood I \"),\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e 21 F.3d 603, 605 (5th Cir. 1994) (per curiam) (quoting Podberesky v. Kirwan, 956 F.2d 52, 57 (4th Cir. 1992), cert. denied, 131 L. Ed. 2d 1002, 115 S. Ct. 2001 (1995)); see also Wygant, 476 U.S. at 280 (opining that \"in order to remedy the effects of prior discrimination, it may be necessary to take race into account\") (opinion of Powell, J.).\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nBecause a state does not have a compelling state interest in remedying the present effects of past societal discrimination, however, we must examine the district court's legal determination that the relevant governmental entity is the system of education within the state as a whole. Moreover, we also must review the court's identification of what types of present effects of past discrimination, if proven, would be sufficient under strict scrutiny review. Finally, where the state actor puts forth a remedial justification for its racial classifications, the district court must make a \"factual determination\" as to whether remedial action is necessary. Wygant, 476 U.S. at 277-78. We review such factual rulings for clear error.\n\n1.\n\nThe Supreme Court has \"insisted upon some showing of prior discrimination by the governmental unit involved before allowing limited use of racial classifications in order to remedy such discrimination.\" Wygant, 476 U.S. at 274 (plurality opinion of Powell, J.) (citing Hazelwood School Dist. v. United States, 433 U.S. 299, 53 L. Ed. 2d 768, 97 S. Ct. 2736 (1977)).\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e In Wygant, the Court analyzed a collective bargaining agreement between a school board and a teacher's union that allowed the board to give minorities preferential treatment in the event of layoffs. A plurality rejected the theory that such a program was justified because it provided minority role models. Id. at 274-77 (plurality opinion). Such a claim was based upon remedying \"societal discrimination,\" a rationale the Court consistently has rejected as a basis for affirmative action. Accordingly, the state's use of remedial racial classifications is limited to the harm caused by a specific state actor.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nMoreover, the plurality in Wygant held that before a state actor properly could implement such a plan, it \"must ensure that . . . it has strong evidence that remedial action is warranted.\" Id. at 277. Accord id. at 289 (O'Connor, J., Concurring in part and Concurring in judgment). The plurality felt that \"in the absence of particularized findings, a court could uphold remedies that are ageless in their reach into the past, and timeless in their ability to affect the future.\" Id. at 276.\n\nThe Croson Court further discussed how to identify the relevant past discriminator. Writing for the Court, Justice O'Connor struck down a minority business set-aside program implemented by the City of Richmond and justified on remedial grounds. While the district court opined that sufficient evidence had been found by the city to believe that such a program was necessary to remedy the present effects of past discrimination in the construction industry, the Court held:\n\nLike the \"role model\" theory employed in Wygant, a generalized assertion that there had been past discrimination in an entire industry provides no guidance for a legislative body to determine the precise scope of the injury it seeks to remedy. It 'has no logical stopping point.' Wygant, 476 U.S. at 275 (plurality opinion). 'Relief' for such an ill-defined wrong could extend until the percentage of public contracts awarded to [minority businesses] in Richmond mirrored the percentage of minorities in the population as a whole.\n\n488 U.S. at 498.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e The Court refused to accept indicia of past discrimination in anything but \"the Richmond construction industry.\" Id. at 505.\n\nIn addition, in a passage of particular significance to the instant case, the Court analogized the employment contractor situation to that of higher education and noted that \"like claims that discrimination in primary and secondary schooling justifies a rigid racial preference in medical school admissions, an amorphous claim that there has been past discrimination in a particular industry cannot justify the use of an unyielding quota.\" Id. at 499. Such claims were based upon \"sheer speculation\" about how many minorities would be in the contracting business absent past discrimination. Id.\n\nApplying the teachings of Croson and Wygant, we conclude that the district court erred in expanding the remedial justification to reach all public education within the State of Texas. The Supreme Court repeatedly has warned that the use of racial remedies must be carefully limited, and a remedy reaching all education within a state addresses a putative injury that is vague and amorphous. It has \"no logical stopping point.\" Wygant, 476 U.S. at 275 (plurality opinion).\n\nThe district court's holding employs no viable limiting principle. If a state can \"remedy\" the present effects of past discrimination in its primary and secondary schools, it also would be allowed to award broad-based preferences in hiring, government contracts, licensing, and any other state activity that in some way is affected by the educational attainment of the applicants. This very argument was made in Croson and rejected:\n\nThe \"evidence\" relied upon by the Dissent, history of school desegregation in Richmond and numerous congressional reports, does little to define the scope of any injury to minority contractors in Richmond or the necessary remedy. The factors relied upon by the Dissent could justify a preference of any size or duration.\n\n488 U.S. at 505. The defendants' argument here is equally expansive.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nStrict scrutiny is meant to ensure that the purpose of a racial preference is remedial. Yet when one state actor begins to justify racial preferences based upon the actions of other state agencies, the remedial actor's competence to determine the existence and scope of the harmand the appropriate reach of the remedy is called into question. The school desegregation cases, for example, concentrate on school districts, singular government units and the use of interdistrict remedies is strictly limited. See Missouri v. Jenkins, 132 L. Ed. 2d 63, 115 S. Ct. 2038, 2048 (1995); Milliken v. Bradley, 418 U.S. 717, 745, 41 L. Ed. 2d 1069, 94 S. Ct. 3112 (1974) (\"Without an interdistrict violation and interdistrict effect, there is no constitutional wrong calling for an interdistrict remedy.\"). Thus, one justification for limiting the remedial powers of a state actor is that the specific agency involved is best able to measure the harm of its past discrimination.\n\nHere, however, the law school has no comparative advantage in measuring the present effects of discrimination in primary and secondary schools in Texas. Such a task becomes even more improbable where, as here, benefits are conferred on students who attended out-of-state or private schools for such education. Such boundless \"remedies\" raise a constitutional concern beyond mere competence. In this situation, an inference is raised that the program was the result of racial social engineering rather a desire to implement a remedy.\n\nNo one disputes that in the past, Texas state actors have discriminated against some minorities in public schools. In this sense, some lingering effects of such discrimination is not \"societal,\" if that term is meant to exclude all state action. But the very program at issue here shows how remedying such past wrongs may be expanded beyond any reasonable limits.\n\nEven if, arguendo, the state is the proper government unit to scrutinize, the law school's admissions program would not withstand our review. For the admissions scheme to pass constitutional muster, the State of Texas, through its legislature, would have to find that past segregation has present effects; it would have to determine the magnitude of those present effects; and it would need to limit carefully the \"plus\" given to applicants to remedy that harm. A broad program that sweeps in all minorities with a remedy that is in no way related to past harms cannot survive constitutional scrutiny. Obviously, none of those predicates has been satisfied here.\n\nWe further reject the proposition that the University of Texas System, rather than the law school, is the appropriate governmental unit for measuring a constitutional remedy. The law school operates as a functionally separate unit within the system. As with all law schools, it maintains its own separate admissions program. The law school hires faculty members that meet the unique requirements of a law school and has its own deans for administrative purposes. Thus, for much the same reason that we rejected the educational system as the proper measure generally ensuring that the legally-imposed racially discriminatory program is remedial we conclude that the University of Texas System is itself too expansive an entity to scrutinize for past discrimination.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nIn sum, for purposes of determining whether the law school's admissions system properly can act as a remedy for the present effects of past discrimination, we must identify the law school as the relevant alleged past discriminator. The fact that the law school ultimately may be subject to the directives of others, such as the board of regents, the university president, or the legislature, does not change the fact that the relevant putative discriminator in this case is still the law school. In order for any of these entities to direct a racial preference program at the law school, it must be because of past wrongs at that school.\n\n2.\n\nNext, the relevant governmental discriminator must prove that there are present effects of past discrimination of the type that justify the racial classifications at issue:\n\nTo have a present effect of past discrimination sufficient to justify the program, the party seeking to implement the program must, at a minimum, prove that the effect it proffers is caused by the past discrimination and that the effect is of sufficient magnitude to justify the program.\n\nPodberesky v. Kirwan, 38 F.3d 147, 153 (4th Cir. 1994), cert. denied, 131 L. Ed. 2d 1002, 115 S. Ct. 2001 (1995). Moreover, as part of showing that the alleged present effects of past discrimination in fact justify the racial preference program at issue, the law school must show that it adopted the program specifically to remedy the identified present effects of the past discrimination.\n\nHere, according to the district court: \"The evidence presented at trial indicates those effects include the law school's lingering reputation in the minority community, particularly with prospective students, as a \"white\" school; an underrepresentation of minorities in the student body; and some perception that the law school is a hostile environment for minorities.\" 861 F. Supp. at 572. Plaintiffs now argue that these three alleged effects are at most examples of societal discrimination, which the Supreme Court has found not to be a valid remedial basis. \"The effects must themselves be examined to see whether they were caused by the past discrimination and whether they are of a type that justifies the program.\" Podberesky, 38 F.3d at 154.\n\nAs a legal matter, the district court erred in concluding that the first and third effects it identified bad reputation and hostile environment were sufficient to sustain the use of race in the admissions process. The Fourth Circuit examined similar arguments in Podberesky, a recent case that struck down the use of race-based scholarships. The university in that case sought, in part, to justify a separate scholarship program based solely upon race because of the university's \"poor reputation within the African-American community\" and because \"the atmosphere on campus [was] perceived as being hostile to African-American students.\" Id. at 152.\n\nThe Podberesky court rejected the notion that either of these rationales could support the single-race scholarship program. The court reasoned that any poor reputation by the school \"is tied solely to knowledge of the University's discrimination before it admitted African-American students.\" Id. at 154. The court found that \"mere knowledge of historical fact is not the kind of present effect that can justify a race-exclusive remedy. If it were otherwise, as long as there are people who have access to history books, there will be programs such as this.\" Id.\n\nWe concur in the Fourth Circuit's observation that knowledge of historical fact simply cannot justify current racial classifications. Even if, as the defendants argue, the law school may have a bad reputation in the minority community, \"the case against race-based preferences does not rest on the sterile assumption that American society is untouched or unaffected by the tragic oppression of its past.\" Maryland Troopers Ass'n v. Evans, 993 F.2d 1072, 1079 (4th Cir. 1993). \"Rather, it is the very enormity of that tragedy that lends resolve to the desire to never repeat it, and find a legal order in which distinctions based on race shall have no place.\" Id. Moreover, we note that the law school's argument is even weaker than that of the university in Podberesky, as there is no dispute that the law school has never had an admissions policy that excluded Mexican Americans on the basis of race.\n\nThe Podberesky court rejected the hostile-environment claims by observing that the \"effects\" that is, racial tensions were the result of present societal discrimination. 38 F.3d at 155. There was simply no showing of action by the university that contributed to any racial tension. Similarly, one cannot conclude that the law school's past discrimination has created any current hostile environment for minorities. While the school once did practice de jure discrimination in denying admission to blacks, the Court in Sweatt v. Painter, 339 U.S. 629, 94 L. Ed. 1114, 70 S. Ct. 848 (1950), struck down the law school's program. Any other discrimination by the law school ended in the 1960's. Hopwood, 861 F. Supp. at 555.\n\nBy the late 1960's, the school had implemented its first program designed to recruit minorities, id. at 557, and it now engages in an extensive minority recruiting program that includes a significant amount of scholarship money. The vast majority of the faculty, staff, and students at the law school had absolutely nothing to do with any discrimination that the law school practiced in the past.\n\nIn such a case, one cannot conclude that a hostile environment is the present effect of past discrimination. Any racial tension at the law school is most certainly the result of present societal discrimination and, if anything, is contributed to, rather than alleviated by, the overt and prevalent consideration of race in admissions.\n\nEven if the law school's alleged current lingering reputation in the minority community and the perception that the school is a hostile environment for minorities were considered to be the present effects of past discrimination, rather than the result of societal discrimination, they could not constitute compelling state interests justifying the use of racial classifications in admissions. A bad reputation within the minority community is alleviated not by the consideration of race in admissions, but by school action designed directly to enhance its reputation in that community.\n\nMinority students who are aided by the law school's racial preferences have already made the decision to apply, despite the reputation. And, while prior knowledge that they will get a \"plus\" might make potential minorities more likely to apply, such an inducement does nothing, per se, to change any hostile environment. As we have noted, racial preferences, if anything, can compound the problem of a hostile environment.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nThe law school wisely concentrates only on the second effect the district court identified: underrepresentation of minorities because of past discrimination. The law school argues that we should consider the prior discrimination by the State of Texas and its educational system rather than of the law school. The school contends that this prior discrimination by the state had a direct effect on the educational attainment of the pool of minority applicants and that the discriminatory admissions program was implemented partially to discharge the school's duty of eliminating the vestiges of past segregation.\n\nAs we have noted, the district court accepted the law school's argument that past discrimination on the part of the Texas school system (including primary and secondary schools), reaching back perhaps as far as the education of the parents of today's students, justifies the current use of racial classifications.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e No one disputes that Texas has a history of racial discrimination in education. We have already discussed, however, that the Croson Court unequivocally restricted the proper scope of the remedial interest to the state actor that had previously discriminated. 488 U.S. at 499. The district court squarely found that \"in recent history, there is no evidence of overt officially sanctioned discrimination at the University of Texas.\" 861 F. Supp. at 572. As a result, past discrimination in education, other than at the law school, cannot justify the present consideration of race in law school admissions.\n\nThe law school now attempts to circumvent this result by claiming that its racial preference program is really a \"State of Texas\" plan rather than a law school program. Under the law school's reading of the facts, its program was the direct result of the state's negotiations with what was then the United States Department of Health, Education and Welfare's Office for Civil Rights (\"OCR\"). To bring the Texas public higher education system into compliance with title VI, the state adopted the so-called \"Texas Plan.\"\n\nIn light of our preceding Discussion on the relevant governmental unit, this argument is inapposite. Even if the law school were specifically ordered to adopt a racial preference program, its implementation at the law school would have to meet the requirements of strict scrutiny.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\n\nMoreover, these alleged actions in the 1980's are largely irrelevant for purposes of this appeal. There is no indication that the Texas Plan imposed a direct obligation upon the law school. To the contrary, the law school's admissions program was self-initiated. Moreover, the current admissions program was formulated primarily in the 1990's, and the district court did not hold otherwise. See 861 F. Supp. at 557 (\"Against this historical backdrop [including Texas's dealing with the OCR], the law school's commitment to affirmative action in the admissions process evolved.\"). Thus it is no more correct to say that the State of Texas implemented the program at issue than it is to assert that the Commonwealth of Virginia, not the City of Richmond, was responsible for the minority set-aside program in Croson.\n\nThe district court also sought to find a remedial justification for the use of race and, at the same time, attempted to distinguish Croson using United States v. Fordice, 505 U.S. 717, 120 L. Ed. 2d 575, 112 S. Ct. 2727 (1992). The court held that the law school had a compelling interest to \"desegregate\" the school through affirmative action. The reliance upon Fordice is misplaced, however. The district court held that Fordice 's mandate to schools \"to eliminate every vestige of racial segregation and discrimination\" made Croson inapplicable, 861 F. Supp. at 571, and reasoned that this mandate includes the effects of such prior practices or policies.\n\nFordice does not overrule Croson. The central holding of Fordice is that a state or one of its subdivisions must act to repudiate the continuing \"policies or practices\" of discrimination. 505 U.S. at 731-32.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e In other words, a state has an affirmative duty to remove policies, tied to the past, by which it continues to discriminate. The Fordice Court did not address, in any way, a state actor's duty to counter the present effects of past discrimination that it did not cause.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nIn sum, the law school has failed to show a compelling state interest in remedying the present effects of past discrimination sufficient to maintain the use of race in its admissions system. Accordingly, it is unnecessary for us to examine the district court's determination that the law school's admissions program was not narrowly tailored to meet the compelling interests that the district court erroneously perceived.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nIV.\n\nWhile the district court declared the admissions program unconstitutional, it granted the plaintiffs only limited relief. They had requested injunctive relief ordering that they be admitted to law school, compensatory and punitive damages, and prospective injunctive relief preventing the school from using race as a factor in admissions.\n\nA.\n\nWe must decide who bears the burden of proof on the damages issue. The district court refused to order the plaintiffs' admission (or award any compensatory damages), as it found that they had not met their burden of persuasion in attempting to show that they would have been admitted absent the unconstitutional system. 861 F. Supp. at 579-82.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e The law school now argues that the plaintiffs had the burden of persuasion on the issue of damages and that the district court's findings are not clearly erroneous.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e The plaintiffs maintain, as they did in the district court, that once they had shown a constitutional violation, the burden of persuasion shifted to the school to show that the denial of admission was not caused by that violation.\n\nThe well-established rule is that in order to collect money damages, plaintiffs must prove that they have been injured. Carey v. Piphus, 435 U.S. 247, 254-57, 55 L. Ed. 2d 252, 98 S. Ct. 1042 (1978). Several Supreme Court cases, however, allow for a transfer of burden upon proof of discrimination. See Mt. Healthy City Sch., Dist. Bd. of Educ. v. Doyle, 429 U.S. 274, 284, 50 L. Ed. 2d 471, 97 S. Ct. 568 (1977) ; City of Arlington Heights v. Metropolitan Housing Dev. Corp., 429 U.S. 252, 265-66, 50 L. Ed. 2d 450, 97 S. Ct. 555 (1977).\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\nIn Mt. Healthy, a discharged school teacher sued for reinstatement, claiming his termination was a result of comments he had made on a radio show, a violation of his First and Fourteenth Amendment rights. The Court devised a test of \"causation\" that placed the burden of proving no harm on the defendant:\n\nInitially, . . . the burden was properly placed upon the respondent to show that his conduct was constitutionally protected, and that this conduct was a \"substantial factor\" -- -- or to put it in other words, that it was a \"motivating factor\" in the Board's decision not to rehire him. Respondent having carried that burden, however, the District Court should have gone on to determine whether the Board had shown by a preponderance of the evidence that it would have reached the same decision as to the respondent's reemployment even in the absence of the protected conduct.\n\n429 U.S. at 287. In Arlington Heights, the Court applied a similar rule where the decision of a zoning board was challenged as racially discriminatory. See 429 U.S. at 270 n.21. In sum, these cases allow a defendant, who intended to discriminate or otherwise act unconstitutionally, to show that its action would have occurred regardless of that intent.\n\nCourts are split on whether the Mt. Healthy rubric applies in racial preference cases.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e We conclude that the Mt. Healthy methodology is appropriate in the instant case. The Mt. Healthy plaintiff, like the present plaintiffs, brought a constitutional challenge, and his injuries were analogous to the injuries alleged here. As we have said, the title VII burden-shifting scheme is designed to determine whether a violation of law has occurred.\n\nIn this case, there is no question that a constitutional violation has occurred (as the district court found) and that the plaintiffs were harmed thereby. See Adarand, 115 S. Ct. at 2105 (\"The injury in cases of this kind is that a 'discriminatory classification prevents the plaintiff from competing on an equal footing.'\") (citation omitted). The Mt. Healthy burden-shifting exercise simply gives the defendant law school a second chance of prevailing by showing that the violation was largely harmless.\n\nAs the district court held, to the contrary, that plaintiffs had the burden, it should revisit this issue in light of what we have said in both the liability and remedial portions of this opinion.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e In the event that the law school is unable to show (by a preponderance of the evidence) that a respective plaintiff would not have been admitted to the law school under a constitutional admissions system, the court is to award to that plaintiff any equitable and/or monetary relief it deems appropriate.\n\nObviously, if the school proves that a plaintiff would not have gained admittance to the law school under a race-blind system, that plaintiff would not be entitled to an injunction admitting him to the school. On the other hand, the law school's inability to establish a plaintiff's non-admission if that occurs on remand opens a panoply of potential relief, depending in part upon what course that plaintiff's career has taken since trial in mid-1994. It then would be up to the district court, in its able discretion, to decide whether money damages\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e can substitute for an order of immediate admission relief that would ring hollow for a plaintiff for whom an education at the law school now is of little or no benefit.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\n\nAdditionally, the district court erred in holding that plaintiffs did not prove that defendants had committed intentional discrimination under title VI. \"Intentional discrimination,\" as used in this context, means that a plaintiff must prove \"that the governmental actor, in adopting or employing the challenged practices or undertaking the challenged action, intended to treat similarly situated persons differently on the basis of race.\" Castaneda v. Pickard, 648 F.2d 989, 1000 (5th Cir. Unit A June 1981); see also Franklin v. Gwinnett County Pub. Sch., 503 U.S. 60, 117 L. Ed. 2d 208, 112 S. Ct. 1028 (1992); Guardians Ass'n v. Civil Serv. Comm'n, 463 U.S. 582, 77 L. Ed. 2d 866, 103 S. Ct. 3221 (1983). While we agree with the district court's Conclusion that the various defendants acted in good faith, there is no question that they intended to treat the plaintiffs differently on account of their race.\n\nB.\n\nThe plaintiffs argue that, because they proved a constitutional violation, and further violations were likely to result, the district court erred in denying them prospective injunctive relief. We review denials of this sort of relief for an abuse of discretion. See, e.g., Peaches Entertainment Corp. v. Entertainment Repertoire, 62 F.3d 690, 693 (5th Cir. 1995). The law school avers that the district court was well within its equitable discretion in denying relief, especially as the school had abandoned the practices that the district court had found were unconstitutionalto-wit, the use of separate admissions committees for whites and minorities.\n\nWe review denials of prospective injunctive relief as we would any other denial of permanent injunctive relief under FED. R. CIV. P. 65, keeping in mind, however, the questions of mootness, ripeness, and standing. See generally 11A CHARLES A. WRIGHT ET AL., FEDERAL PRACTICE AND PROCEDURE § 2942 (2d ed. 1995). That treatise notes that\n\nperhaps the most significant single component in the judicial decision whether to exercise equity jurisdiction and grant permanent injunctive relief is the court's discretion. Of course, in some situations the facts and relevant law may indicate that an injunction clearly should be granted or denied. However, in most cases the determination whether to issue an injunction involves a balancing of interests of the parties who might be affected by the court's decision -- -- the hardship on the plaintiff if relief is denied as compared to the defendant if relief is granted and the extent to which the latter hardship can be mitigated by requiring a security bond. Not surprisingly, therefore, the court's decision depends on the circumstances of each case.\n\nId. at 41-42. Accordingly, the usual practice upon reversal of a denial of injunctive relief is to remand for a reweighing of the equities. Id. § 2962, at 448; See, e.g., James v. Stockham Valves \u0026 Fittings Co., 559 F.2d 310, 354-55 (5th Cir. 1977). In other situations, the appellate court may order the district court to enter an injunction. See, e.g., Southeastern Promotions, Ltd. v. City of Mobile, 457 F.2d 340 (5th Cir. 1972).\n\nAccording to the district court, the school had abandoned the admissions procedure consisting of the separate minority subcommittee that was used in 1992, 1993, and 1994. The court reasoned that, as a new procedure was developed for 1995, a prospective injunction against the school was inappropriate. We conclude, however, that, while the district court may have been correct in deciding that the new procedure eliminates the constitutional flaws that the district court identified in the 1992 system, there is no indication that the new system will cure the additional constitutional defects we now have explained.\n\nThe new system utilizes a small \"administrative admissions group\" and does not use presumptive admission and denial scores. See Hopwood, 861 F. Supp. at 582 n.87. Most significantly, there is no indication that in employing the new plan, the law school will cease to consider race per se in making its admissions decisions. To the contrary, as the district court recognized, the law school continues to assert that overt racial preferences are necessary to the attainment of its goals. See Hopwood, 861 F. Supp. at 573-75.\n\nThe district court has already granted some equitable relief: It directed that the plaintiffs be permitted to re-apply to the law school without incurring further administrative costs. In accordance with this opinion, the plaintiffs are entitled to apply under a system of admissions that will not discriminate against anyone on the basis of race. Moreover, the plaintiffs have shown that it is likely that the law school will continue to take race into account in admissions unless it receives further judicial instruction to the effect that it may not do so for the purpose of (1) obtaining a diverse student body; (2) altering the school's reputation in the community; (3) combating the school's perceived hostile environment toward minorities; or (4) remedying the present effects of past discrimination by actors other than the law school.\n\nIt is not necessary, however, for us to order at this time that the law school be enjoined, as we are confident that the conscientious administration at the school, as well as its attorneys, will heed the directives contained in this opinion. If an injunction should be needed in the future, the district court, in its discretion, can consider its parameters without our assistance. Accordingly, we leave intact that court's refusal to enter an injunction.\n\nC.\n\nThe plaintiffs contend that the district court's application of the wrong standard causes it to deny punitive damages. The plaintiffs aver that the court applied an animus standard, when it should have asked whether the school acted with \"reckless indifference\" to their constitutional rights. They ask for a remand on this issue.\n\nIt is not apparent, from the record, what standard the district court applied in considering the punitive damages issue. The court did determine, however, that the law school had always acted in good faith. This is a difficult area of the law, in which the law school erred with the best of intentions. As a result, the plaintiffs have not met the federal standard for punitive damages as stated in Smith v. Wade, 461 U.S. 30, 56, 75 L. Ed. 2d 632, 103 S. Ct. 1625 (1983). Thus, we agree with the district court that punitive damages are not warranted. We note, however, that if the law school continues to operate a disguised or overt racial classification system in the future, its actors could be subject to actual and punitive damages.\n\nV.\n\nConsolidated with the appeal of the merits issues of this appeal is No. 94-50569, challenging the district court's denial of a motion to intervene. The proposed intervenors the Thurgood Marshall Legal Society and the Black Pre-Law Association (the \"associations\")ask this court, for the second time, for the right to intervene. On their first attempt, the associations moved to intervene prior to trial either as of right or by permission. The district court denied intervention, and we affirmed. See Hopwood v. Texas, 21 F.3d 603 (5th Cir. 1994) (per curiam) (\"Hopwood I \").\n\nNow, following the trial, the associations believe they can show that the law school has failed to assert one of their proposed defenses, a circumstance they contend establishes their right to intervene. We apply the law of the case doctrine and dismiss No. 94-50569 for want of jurisdiction.\n\nA.\n\nThe proposed intervenors are black student organizations at the University of Texas at Austin and its law school that, just prior to the trial of the merits appeal, sought to intervene, arguing that the law school would not effectively protect their interests in continuing racial preferences at the law school. The district court denied the proposed intervention on the ground that the law school and the two associations had the same objective: preservation of the status quo.\n\nOn expedited appeal, this court affirmed on the ground that the associations had failed to show that the law school had an interest different from theirs. We also commented that the two groups had failed to show \"a separate defense of the affirmative action plan that the State has failed to assert.\" Id. at 606. The panel implicitly considered and rejected, as one potential divergence of interests, the possibility that the law school would not raise a defense based upon the legality of the use of TI scores under title VI, as the associations argued that possibility as one basis for intervention.\n\nAfter their first motion to intervene was denied, the associations remained involved in the case. Throughout the course of the trial, they acted as amici curiae. And, at the close of trial but before judgment, the district court intimated that it would allow them to submit information for the record. Accordingly, the associations sought to introduce testimonial and documentary evidence supporting their arguments that (1) the TI by itself was an unlawful basis for admissions decisions under title VI and (2) that affirmative action at the university was constitutionally required. The plaintiffs opposed the introduction of evidence on these \"new defenses,\" and the district court agreed. The associations were allowed to submit amicus briefs and highlight evidence that was already in the record but were not allowed to raise new issues or supplement the record.\n\nShortly thereafter, the associations again sought to intervene under FED. R. CIV. P. 24(a)(2) (intervention as of right), claiming that the law school had failed to raise their two \"new defenses\" and, accordingly, that events now showed that that representation inadequately protected their interests. They sought to reopen the record to introduce evidence supporting these arguments.\n\nThe district court summarily refused this request. That order is the focus of this separate appeal, in which the associations present only the title VI defense and ask to be allowed to present such evidence only if we do not affirm the judgment.\n\nB.\n\nThere is no caselaw in this circuit that directly addresses how to review successive motions to intervene.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e The parties direct us to Hodgson v. United Mine Workers, 153 U.S. App. D.C. 407, 473 F.2d 118, 125-26 (D.C. Cir. 1972); United States Envt'l Protection Agency v. City of Green Forest, 921 F.2d 1394, 1401 (8th Cir. 1990), cert. denied, 502 U.S. 956 (1991); and Meek v. Metropolitan Dade County, 985 F.2d 1471, 1477 (11th Cir. 1993). These courts, which were examining whether the appeal from a successive motion was timely as per the appellate requirements, devised the general rule that a second motion would be treated as independent of the first if it was reached under materially changed circumstances.\n\nHere, the associations assume that their second intervention motion is separate and distinct from their earlier failed attempt, because the law school's failure to raise their proposed defense constitutes a changed circumstance.\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e Thus, they ask that we engage in de novo review of their motion.\n\nThe plaintiffs, however, note that this motion was entitled a \"renewed motion for intervention.\" The plaintiffs argue that the district court was reconsidering its previous denial order under its FED. R. CIV. P. 60(b) powers, and we should review merely for abuse of discretion.\n\nC.\n\nWhile the \"changed circumstances\" test may have meritan issue we do not decide today we do not find it applicable to this case. Instead, the \"law of the case\" doctrine militates against reconsideration of this motion. Normally, when a prior panel discusses an issue on the merits, a later panel cannot reach a contrary Conclusion under the preclusive principle of law of the case. See Williams v. City of New Orleans, 763 F.2d 667, 669 (5th Cir. 1985). There is no question that the Hopwood I panel addressed the intervention as a matter of right de novo, on the merits, including the potential that the law school would not raise every defense proposed by the associations.\n\nThe question of whether we can rely upon the law of the case doctrine, however, is clouded because of the \"anomalous\" rule that exists in this circuit concerning the procedural posture of these intervention cases. Under that rule, we have only provisional jurisdiction to review a district court's denial of a motion to intervene.\n\nIf we agree with the district court, our jurisdiction \"evaporates.\" Hence, the denial of leave to intervene when the party had a right to intervene is immediately appealable. On appeal, however, our rule \"requires a merit review of any claim of intervention in order for [us] to determine whether or not the district court's order is appealable.\" Weiser v. White, 505 F.2d 912, 916 (5th Cir. 1975). If the claim is without merit, then the order \"is not appealable, the appellate court has no jurisdiction, and the appeal should be dismissed.\" Id. Thus, despite the merits review, this is a dismissal for want of jurisdiction.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e\n\nOur anomalous rule complicates the analysis of the preclusive effects of the prior panel decision, because dismissals for lack of jurisdiction normally do not have preclusive effect. See, e.g., FED. R. CIV. P. 41(b). Accordingly, while appellate courts review denials of intervention motions on the merits, it is uncertain to what extent such a review has preclusive effect. Nonetheless, we recognize the possibility of issue preclusion on the question of jurisdiction itself.\n\nWhile a dismissal for lack of jurisdiction does not operate as an adjudication on the merits, \"this provision means only that the dismissal permits a second action on the same claim that corrects the deficiency found in the first action. The judgment remains effective to preclude relitigation of the precise issue of jurisdiction or venue that led to the initial dismissal.\" 7C WRIGHT ET AL., supra, § 4436, at 338.\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e Thus, a party is precluded from successively appealing the same intervention motion.\n\nHere, the record shows that the associations raised this same title VI argument before the Hopwood I panel in both their brief and at oral argument. That panel, reviewing de novo the merits of the associations' claims, denied intervention. Accordingly, the last panel implicitly addressed this issue, and we must respect its decision to deny intervention. The law of the case doctrine prevents merits review, and we dismiss No. 94-50569 for want of jurisdiction.\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nVI.\n\nIn summary, we hold that the University of Texas School of Law may not use race as a factor in deciding which applicants to admit in order to achieve a diverse student body, to combat the perceived effects of a hostile environment at the law school, to alleviate the law school's poor reputation in the minority community, or to eliminate any present effects of past discrimination by actors other than the law school. Because the law school has proffered these justifications for its use of race in admissions, the plaintiffs have satisfied their burden of showing that they were scrutinized under an unconstitutional admissions system. The plaintiffs are entitled to reapply under an admissions system that invokes none of these serious constitutional infirmities. We also direct the district court to reconsider the question of damages, and we conclude that the proposed intervenors properly were denied intervention.\n\nIn No. 94-50569, the appeal is DISMISSED for want of jurisdiction. In No. 94-50664, the judgment is REVERSED and REMANDED for further proceedings in accordance with this opinion.\n\nWIENER, Circuit Judge, specially Concurring.\n\n\"We Judge best when we Judge least, particularly in controversial matters of high public interest.\"\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e In this and every other appeal, we should decide only the case before us, and should do so on the narrowest possible basis. Mindful of this credo, I concur in part and, with respect, specially concur in part.\n\nThe sole substantive issue in this appeal is whether the admissions process employed by the law school for 1992 meets muster under the Equal Protection Clause of the Fourteenth Amendment. The law school offers alternative justifications for its race-based admissions process, each of which, it insists, is a compelling interest: (1) remedying the present effects of past discrimination (present effects) and (2) providing the educational benefits that can be obtained only when the student body is diverse (diversity).\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e As to present effects, I concur in the panel opinion's analysis: Irrespective of whether the law school or the University of Texas system as a whole is deemed the relevant governmental unit to be tested,\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e neither has established the existence of present effects of past discrimination sufficient to justify the use of a racial classification.\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e As to diversity, however, I respectfully disagree with the panel opinion's Conclusion that diversity can never be a compelling governmental interest in a public graduate school. Rather than attempt to decide that issue, I would take a considerably narrower path -- and, I believe, a more appropriate one -- to reach an equally narrow result: I would assume arguendo that diversity can be a compelling interest but conclude that the admissions process here under scrutiny was not narrowly tailored to achieve diversity.\n\nI\n\nTHE LAW\n\nA. EQUAL PROTECTION\n\nThe Equal Protection Clause provides that \"no State shall . . . deny to any person within its jurisdiction the equal protection of the laws.\"\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e Accordingly, \"all racial classifications, imposed by whatever federal, state, or local governmental actor, must be analyzed by a reviewing court under strict scrutiny.\"\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e Racial classifications will survive strict scrutiny \"only if they are narrowly tailored measures that further compelling governmental interests.\"\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e Thus, strict scrutiny comprises two inquiries of equal valence: the \"compelling interest\" inquiry and the \"narrow tailoring\" inquiry.\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e Moreover, these inquiries are conjunctive: To avoid constitutional nullity, a racial classification must satisfy both inquiries. Failure to satisfy either is fatal.\n\nB. RACIAL CLASSIFICATION\n\nNone dispute that the law school's admission process for 1992 employed a racial classification. Depending on an applicant's race, his request for admission was considered under one of three different (and, as explained in the panel opinion, often dispositive\u003cspan class=\"fnref\"\u003e71\u003c/span\u003e ) TI admission ranges: one for blacks only, a second for Mexican Americans only, and a third for all other races and nationalities, including non-Mexican Hispanic Americans. In short, each applicant for admission to the law school was classified by race, and his application was treated differently according into which of those three racial classifications it fell. Thus, the law school's 1992 admissions process, like all racial classifications by the government, is subject to strict scrutiny.\u003cspan class=\"fnref\"\u003e72\u003c/span\u003e\n\nC. STRICT SCRUTINY\n\nThe law school contends that it employs a racially stratified admissions process to obtain, inter alia, the educational benefits of a diverse student body. Translated into the constitutional idiom, the law school insists that achieving student body diversity in a public graduate school is a compelling governmental interest. The law school invokes the opinion of Justice Powell in Regents of the University of California v. Bakke\u003cspan class=\"fnref\"\u003e73\u003c/span\u003e to support that postulate. The panel opinion rejects that support, concluding that from its inception Bakke had little precedential value and now, post-Adarand, has none. My fellow panelists thus declare categorically that \"any consideration of race or ethnicity by the law school for the purposes of achieving a diverse student body is not a compelling interest under the Fourteenth Amendment.\"\u003cspan class=\"fnref\"\u003e74\u003c/span\u003e\n\nThis Conclusion may well be a defensible extension of recent Supreme Court precedent, an extension which in time may prove to be the Court's position. It admittedly has a simplifying appeal as an easily applied, bright-line rule proscribing any use of race as a determinant. Be that as it may, this position remains an extension of the law--one that, in my opinion, is both overly broad and unnecessary to the Disposition of this case. I am therefore unable to concur in the majority's analysis.\n\nMy decision not to embrace the ratio decidendi of the majority opinion results from three premises: First, if Bakke is to be declared dead, the Supreme Court, not a three-Judge panel of a circuit court, should make that pronouncement. Second, Justice O'Connor expressly states that Adarand is not the death knell of affirmative action -- to which I would add, especially not in the framework of achieving diversity in public graduate schools.\u003cspan class=\"fnref\"\u003e75\u003c/span\u003e Third, we have no need to decide the thornier issue of compelling interest, as the narrowly tailored inquiry of strict scrutiny presents a more surgical and -- it seems to me -- more principled way to decide the case before us.\u003cspan class=\"fnref\"\u003e76\u003c/span\u003e I am nevertheless reluctant to proceed with a narrowly tailored inquiry without pausing to respond briefly to the panel opinion's treatment of diversity in the context of the compelling interest inquiry\n\nD. IS DIVERSITY A COMPELLING INTEREST?\n\nAlong its path to a per se ban on any consideration of race in attempting to achieve student body diversity, the panel opinion holds (or strongly implies) that remedying vestigial effects of past discrimination is the only compelling interest that can ever justify racial classification.\u003cspan class=\"fnref\"\u003e77\u003c/span\u003e The main reason that I cannot go along with the panel opinion to that extent is that I do not read the applicable Supreme Court precedent as having held squarely and unequivocally either that remedying effects of past discrimination is the only compelling state interest that can ever justify racial classification, or conversely that achieving diversity in the student body of a public graduate or professional school can never be a compelling governmental interest. Indeed, the panel opinion itself hedges a bit on whether the Supreme Court's square holdings have gone that far,\u003cspan class=\"fnref\"\u003e78\u003c/span\u003e particularly in the realm of higher education.\u003cspan class=\"fnref\"\u003e79\u003c/span\u003e\n\nBetween the difficulty inherent in applying Bakke\u003cspan class=\"fnref\"\u003e80\u003c/span\u003e and the minimal guidance in Adarand,\u003cspan class=\"fnref\"\u003e81\u003c/span\u003e the definition and application of the compelling interest inquiry seems to be suspended somewhere in the interstices of constitutional interpretation. Until further clarification issues from the Supreme Court defining \"compelling interest\" (or telling us how to know one when we see one), I perceive no \"compelling\" reason to rush in where the Supreme Court fears -- or at least declines -- to tread. Instead, I would pretermit any attempt at a compelling interest inquiry and accept Justice O'Connor's invitation to apply the Court's more discernible and less intrusive \"narrow tailoring\" precedent.\u003cspan class=\"fnref\"\u003e82\u003c/span\u003e Thus, for the purpose of this appeal I assume, without deciding, that diversity is a compelling interest,\u003cspan class=\"fnref\"\u003e83\u003c/span\u003e and proceed to the narrowly tailored inquiry.\n\nF. TEST FOR NARROW TAILORING\n\nWhen strictly scrutinizing a racial classification for narrow tailoring, the first question is \"What is the purpose of this racial classification?\"\u003cspan class=\"fnref\"\u003e84\u003c/span\u003e The present effects rationale having proven feckless in this case, today's answer to that first question is a given: The law school's purpose is diversity. Accordingly, I perceive the next question to be, \"Was the law school's 1992 admissions process, with one TI range for blacks, another for Mexican Americans, and a third for other races, narrowly tailored to achieve diversity?\" I conclude that it was not. Focusing as it does on blacks and Mexican Americans only, the law school's 1992 admissions process misconceived the concept of diversity, as did California's in the view of Justice Powell: Diversity which furthers a compelling state interest \"encompasses a far broader array of qualifications and characteristics of which racial or ethnic origin is but a single though important element.\"\u003cspan class=\"fnref\"\u003e85\u003c/span\u003e\n\nWhen the selective race-based preferences of the law school's 1992 admissions process are evaluated under Justice Powell's broad, multi-faceted concept of diversity, that process fails to satisfy the requirements of the Constitution.\u003cspan class=\"fnref\"\u003e86\u003c/span\u003e The law school purported to accomplish diversity by ensuring an increase in the numbers of only blacks and Mexican Americans in each incoming class to produce percentages -- virtually indistinguishable from quotas--of approximately five and ten percent, respectively. Yet blacks and Mexican Americans are but two among any number of racial or ethnic groups that could and presumably should contribute to genuine diversity. By singling out only those two ethnic groups, the initial stage of the law school's 1992 admissions process ignored altogether non-Mexican Hispanic Americans, Asian Americans, and Native Americans, to name but a few.\n\nIn this light, the limited racial effects of the law school's preferential admissions process, targeting exclusively blacks and Mexican Americans, more closely resembles a set aside or quota system for those two disadvantaged minorities than it does an academic admissions program narrowly tailored to achieve true diversity. I concede that the law school's 1992 admissions process would increase the percentages of black faces and brown faces in that year's entering class. But facial diversity is not true diversity, and a system thus conceived and implemented simply is not narrowly tailored to achieve diversity.\n\nAccordingly, I would find that the law school's race-based 1992 admissions process was not narrowly tailored to achieve diversity and hold it constitutionally invalid on that basis. By so doing I would avoid the largely uncharted waters of a compelling interest analysis. Although I join my colleagues of the panel in their holding that the law school's 1992 admissions process fails to pass strict scrutiny,\u003cspan class=\"fnref\"\u003e87\u003c/span\u003e on the question of diversity I follow the solitary path of narrow tailoring rather than the primrose path of compelling interest to reach our common holding.\n\nII\n\nREMEDY\n\nBefore concluding, I am compelled to add a few words about the panel opinion's \"commentary\" regarding the remedy to be imposed by the district court on remand. Without employing the express language of injunction or affixing that label to its holding, the panel opinion's Discussion of the remedy on remand is \"strongly suggestive\" and has all of the substantive earmarks of an injunction:\n\n[The] plaintiffs have shown that it is likely that the law school will continue to take race into account in admissions unless it receives further judicial instruction to the effect that it may not do so for the purpose of (1) obtaining a diverse student body; (2) altering the school's reputation in the community; (3) combating the school's perceived hostile environment toward minorities; or (4) remedying the present effects of past discrimination by actors other than the law school.\n\nIt is not necessary, however, for us to order at this time that the law school be enjoined, as we are confident that the conscientious administration at the school, as well as its attorneys, will heed the directives contained in this opinion. If an injunction should be needed in the future, the district court, in its discretion, can consider its parameters without our assistance. Accordingly, we leave intact that court's refusal to enter an injunction.\u003cspan class=\"fnref\"\u003e88\u003c/span\u003e\n\nEssentially, the substance of the quoted portion of the panel opinion constitutes a de facto injunction -- telling the district court precisely what to tell the law school that it can and can't do -- albeit without the use of the word injunction. To me, if \"it\" has feathers, swims, waddles, and quacks like a duck, it is a duck; and I find such an \"un-injunction\" inappropriate. If instead we were simply to reverse and remand on the violation issue, we would stop short of finding de novo that the law school had violated these four plaintiffs' equal protection rights. It seems unavoidable to me that until the district court determines that there has been a violation, a remedy cannot be fashioned and should not be the subject of appellate speculation.\u003cspan class=\"fnref\"\u003e89\u003c/span\u003e\n\nThe district court denied the plaintiffs injunctive relief, but only after assigning the burden of proof to the wrong party.\u003cspan class=\"fnref\"\u003e90\u003c/span\u003e No member of this panel questions that, in the initial stanza of the burden-shifting minuet of Mt. Healthy Sch. Dist. Bd. of Educ. v. Doyle,\u003cspan class=\"fnref\"\u003e91\u003c/span\u003e the plaintiffs met their burden. Once the plaintiffs did that, the burden should have shifted to the law school. Instead, the district court left it with the plaintiffs and concluded that they had failed to carry the ultimate burden. The district court's failure to shift the burden to the law school, and the Conclusion of that court which followed, were errors. Accordingly, like my colleagues of the panel, I would remand the case to the district court with instructions to relieve the plaintiffs of the misplaced burden while affording the law school the opportunity to prove that the prima facie violation established by the plaintiffs was essentially harmless. But it seems clear to me that this is where our analysis should end. As a result, I depart from the \"commentary\" in the panel opinion regarding the precise elements of the remedy to be fashioned by the district court if it should conclude on remand that the law school shall have failed to bear its burden.\n\nIII\n\nConclusion\n\nI end where I began: We should only decide the issues necessarily before this court, and then only on the narrowest bases upon which our decision can rest. This is not a class action; nothing is before us here save the claims of four individual plaintiffs. These four individual plaintiffs properly challenge only the admissions process employed by the law school in 1992 -- not the admissions process that was in place and employed in 1995, not the admissions process that is being employed in 1996, and not the admissions process to be applied in any future years. In sum, I would remand, and in the process I would take care not to eviscerate the discretion of the district court with excessive \"commentary\" or implicit directions on the precise nature of the remedy that must ensue. Rather, my remand would simply instruct the district court to apply the correct burden-shifting process articulated in Mt. Healthy, then see how the law school deals with it. That way, if the Mt. Healthy application should demonstrate the need for a remedy, the district court would be free to fashion the appropriate relief -- including injunctive if necessary -- for those among the individual plaintiffs whose individual cases warrant it. For this court to do anything beyond that impresses me as overreaching. Thus I concur in the judgment of the panel opinion but, as to its Conclusion on the issue of strict scrutiny and its gloss on the order of remand, I disagree for the reasons I have stated and therefore concur specially.\n\nPOLITZ, Chief Judge, and KING, WIENER, BENAVIDES, STEWART, PARKER, and DENNIS, Circuit Judges, Dissenting from failure to grant rehearing en banc\n\nSoon after the founding of the Republic, the Supreme Court indicated that the power of judicial review should be exercised reluctantly, only because it is essential to the decision of the case before a federal court and because the Constitution and the laws of the United States, as the \"Supreme law of the Land,\" require it.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThis case was brought by four individual plaintiffs (not a class of plaintiffs) who were denied admission to the University of Texas Law School (Law School) in 1992, claiming that the Law School's admission process in 1992 violated the Fourteenth Amendment by giving race-based preferences exclusively to blacks and Mexican Americans.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e In resolving the case presented by these four plaintiffs, the panel opinion directed the Law School not to use race as a factor in the admissions process at all.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e In so doing, the opinion goes out of its way to break ground that the Supreme Court itself has been careful to avoid and purports to overrule a Supreme Court decision, namely, Regents of the University of California v. Bakke.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The radical implications of this opinion, with its sweeping dicta, will literally change the face of public educational institutions throughout Texas, the other states of this circuit, and this nation. A case of such monumental import demands the attention of more than a divided panel. It should have the attention of every active Judge on this court. We respectfully but emphatically Dissent from the denial of rehearing en banc.\n\nFor reasons that have not been communicated to this court, and upon which we can only speculate, neither the plaintiffs nor the defendants have sought rehearing en banc. It would appear that in this case, some of our colleagues may have embraced the rationale that, when sophisticated litigants represented by capable lawyers elect not to seek rehearing en banc, it is not our place to take any action. Our customary practice, however, does not support this position. Indeed, not infrequently we propose rehearing en banc on our own motion, before the parties have requested that we do so. We reject out of hand the notion that we are merely obsequious ciphers, subject to the tactical decisions and strategic maneuvers of the litigants before us. When the occasional case of such far reaching importance to this court, to public higher education, and to this nation comes down the pike, we have a duty to address it and to do the best possible job that our whole court is capable of, regardless of the tactical decisions of the litigants. To decline to rehear a case of this magnitude because the parties have not suggested that we do so bespeaks an abdication of duty--the ducking of a tough question by Judges who we know first-hand are made of sterner stuff.\n\nThe label \"judicial activism\" is usually found in the lexicon of those voicing concern about Judges whom they perceive to be \"liberal,\" fashioning remedies beyond the scope of what is deemed to be appropriate under the law. Such judicial legislating is generally excoriated as a \"bad thing.\" Hopwood v. State of Texas\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e is a text book example of judicial activism. Here, two members of the three-Judge panel determined to bar any consideration of race in the Law School's admission process. This \"injunction\" is wholly unnecessary to the Disposition of the matter appealed and thus is clearly dictum; yet dictum that is a frontal assault on contrary Supreme Court precedent and thus not the kind of dictum we can ignore. By tenuously stringing together pieces and shards of recent Supreme Court opinions that have dealt with race in such diverse settings as minority set asides for government contractors, broadcast licenses, redistricting, and the like, the panel creates a gossamer chain which it proffers as a justification for overruling Bakke. We are persuaded that this alone makes the instant case not just en banc-worthy but en banc mandatory.\n\nThe Supreme Court has left no doubt that as a constitutionally inferior court, we are compelled to follow faithfully a directly controlling Supreme Court precedent unless and until the Supreme Court itself determines to overrule it.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e We may not reject, dismiss, disregard, or deny Supreme Court precedent, even if, in a particular case, it seems pellucidly clear to litigants, lawyers, and lower court Judges alike that, given the opportunity, the Supreme Court would overrule its precedent.\n\nMembers of this court have frequently \"preached\" against such judicial activism. In Williams v. Whitley,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Judge Higginbotham explained the limits placed on appellate courts regarding Supreme Court precedent:\n\nAbsent clear indications from the Supreme Court itself, lower courts should not lightly assume that a prior decision has been overruled sub silentio merely because its reasoning and result appear inconsistent with later cases. As [the district court] pointed out . . . the Court issued a reminder to this effect only a few years ago in Rodriguez de Quijas v. Shearson/American Express, Inc., 490 U.S. 477, 109 S. Ct. 1917, 104 L. Ed. 2d 526 (1989): \"If a precedent of [the Supreme] Court has direct application in a case, yet appears to rest on reasons rejected in some other line of decisions, the Court of Appeals should follow the case which directly controls, leaving to [the Supreme] Court the prerogative of overruling its own decisions.\" Id. at 484-85, 109 S. Ct. at 1921-22; see also id. at 486, 109 S. Ct. at 1923 (Brennan, J., Dissenting) (describing anticipatory overruling as \"an indefensible brand of judicial activism\") . . . In these circumstances, our role as an inferior court counsels restraint, even if the result otherwise appears inescapable.\n\nIn like manner, our colleagues have routinely counseled that judicial restraint is the order of the day, especially in the constitutional context. For example, in Walton v. Alexander,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Judge Garwood insisted that courts have a duty not to address constitutional issues not necessary to the Disposition of an individual case.\n\nIt is settled that courts have a \"strong duty to avoid constitutional issues that need not be resolved in order to determine the rights of the parties to the case under consideration.\" County Court of Ulster County v. Allen, 442 U.S. 140, 154, 99 S. Ct. 2213, 2223, 60 L. Ed. 2d 777 (1979). This \"responsibility to avoid unnecessary constitutional adjudication\" is \"a fundamental rule of judicial restraint.\" Three Affiliated Tribes v. Wold Engineering, 467 U.S. 138, 157, 104 S. Ct. 2267, 2279, 81 L. Ed. 2d 113 (1984). All this, of course, applies not only to the Supreme Court but to lower courts as well. See Bowen v. United States, 422 U.S. 916, 920, 95 S. Ct. 2569, 2573, 45 L. Ed. 2d 641 (1975).\n\nVariations of this theme can be found in the opinions of many of the Judges of this court.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nThus, it seems that this court has trouble practicing what it preaches, at least in this instance. For here, Justice Powell's opinion in Bakke made the Supreme Court's Disposition precedential.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e We unequivocally reject the proposition that it does not mandate our Disposition. The syllogisms tacked together and proffered by the majority opinion as proof that Justice Powell's diversity Conclusion is no longer good law do not, under any standards of which we are aware, qualify as an overruling of Bakke.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e To the contrary, direct reference to Justice Powell's diversity analysis documents, supports, and reinforces its continuing validity.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Consequently, even if the members of the panel majority were convinced that the Supreme Court is certain to overrule Bakke, in the absence of an express overruling, they had no option but to grin, follow Bakke, bear it, and patiently await the Supreme Court's reconsideration. Rather than following this universally recognized canon, adhering to our established rules, and applying Supreme Court precedent, the panel charted a path into terra incognita. Judicial self-restraint was the first casualty; it proved to be too burdensome. The teachings proscribing the consideration of constitutional issues unnecessary to the decision soon followed. With these two limitations adroitly set aside, the panel majority apparently considered itself positioned to overrule Bakke.\n\nGiving the panel majority the benefit of the doubt, as we are wont to do and should do, and assuming arguendo that Bakke's diversity issue had to be addressed in this particular case, would it not have been the more judicious course to have brought our full en banc powers to bear on this difficult, vitally important question? It can hardly be gainsaid that reasonable jurists can and likely will differ on an issue of such magnitude, depth, and importance. Indeed, this very truism compels giving to the entire court the opportunity to devote to this crucial case its focused consideration. Conceivably, after an en banc rehearing the panel result, its reasoning, and even its dicta, might be embraced by a majority of the en banc court. But that is not the point; even if that unprecedented and, we suggest, impertinent step--a federal circuit court, sitting en banc, purporting to overrule a Supreme Court precedent--were to be taken, it would not be taken until sixteen of the seventeen active Judges of this court\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e had an opportunity to consider and participate in the deliberations on this matter fully.\n\nThere are many things which a \"yea\" vote on an en banc poll is not: It is not necessarily a vote against the analysis; it is not necessarily a vote against the result; it is not necessarily a vote against a panel opinion or in favor of a special concurrence or a Dissent. It is rather an affirmative statement that, for one or more reasons, a case or an issue is worthy of the time, attention, and efforts of the entire court. Hopwood is such a case. Unfortunately, a bare majority of our colleagues have joined hands to deny this storied court the opportunity to consider this case en banc.\n\nThe majority of the panel overruled Bakke, wrote far too broadly, and spoke a plethora of unfortunate dicta. That was not their prerogative, yet this court declined to reconsider Hopwood en banc. From that decision we must, perforce, Dissent.\n\nStewart, Circuit Judge, Dissenting from failure to grant rehearing en banc.\n\nI wholeheartedly concur in the Dissent to the denial of en banc rehearing. I write separately to underscore the lack of historical perspective and sensitivity in both the panel majority's opinion and the vote not to consider this case en banc.\n\nThat it is the University of Texas School of Law's admissions policy at issue is a fact whose significance has not been lost on any of us. In 1946, this very school denied admission to Heman Marion Sweart because he was black, prompting him to sue the University. Sweaff's real difficulties began fifty years before when the United States Supreme Court scripted one of this nation's most evil conceits in Plessy v. Ferguson, 163 U.S. 537, 41 L. Ed. 256, 16 S. Ct. 1138 (1896), declaring \"separate but equal\" treatment of black Americans constitutional. Plessy was no more than a license for continued racial discrimination. However, in 1950 the Supreme Court held that excluding Sweatt on account of his race violated the Equal Protection Clause of the Fourteenth Amendment. Sweatt v. Painter, 339 U.S. 629, 94 L. Ed. 1114, 70 S. Ct. 848 (1950).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ea\n\nHistory, in its characteristic irony, takes this court to that hallowed ground of civil rights jurisprudence to assess the University's effort to encourage minority enrollment and counter its legacy of segregation. It is an unfortunate, further irony that the panel majority opinion should so overreach in its decision. In Sweatt's case, the Supreme Court explicitly adhered to the \"principle of deciding constitutional questions only in the context of the particular case before the Court,\" drawing its decision \"as narrowly as possible.\" Id. at 631 (citing Rescue Army v. Municipal Court, 1947, 331 U.S. 549, 91 L. Ed. 1666, 67 S. Ct. 1409 (1947)). If there ever were a time to end legalized segregation, that was the time. The Court was in a position to paint with a broad brush and eliminate the very regime which denied civil rights to Sweatt and other blacks. Chief Justice Vinson's opinion for the Court, however, resisted calls to wax on \"broader issues . . . urged for our consideration.\" Id.\n\nThe panel majority in our case displayed no such discipline, instead taking the unauthorized liberty of deciding the appropriateness of diversity as an admissions criterion, not just the merits of the instant admissions policy. Constitutional interpretation is a sensitive project. Limiting ourselves to the facts before the court keeps the process measured--it is a traditional check which respects the need to calibrate rights and interests carefully. Given the sensitivity of constitutional interpretation, the panel majority's decision disrespects the importance of the facts. Refusing to correct this travesty en banc is a grave error.\n\nAs to the request to intervene, what class of persons is more qualified to adduce the evidence of the present effects of past discrimination than current and prospective black law students? Reading Sweatt as a benchmark decision marking the end of de jure segregation is akin to shelving Trotsky's The History of the Russian Revolution upon reading only the preface. Just as those initial pages fall to give a true rendition of the entire work, so too does Sweatt give only a superficial understanding of the racism it hardly addressed. A year after the Supreme Court ordered that Sweatt be admitted, he left the law school \"without graduating after being subjected to racial slurs from students and professors, cross burnings, and tire slashings.\" Hopwood v. State of Texas, 861 F. Supp. 551, 555 (1994). Furthermore, \"the record reflects that during the 1950s, and into the 1960s, the University of Texas continued to implement discriminatory policies against both black and Mexican American students.\" Id. It was not until 1983 that Texas even agreed, after years of threats of federal action, to an acceptable plan to desegregate its higher education system. In 1987 and again in 1994, the Department of Education instructed Texas to maintain its plan. To this day, Texas's higher education system still has not been declared in compliance with Title VI and the Fourteenth Amendment. Id. at 556-57.\n\n\"The life of the law,\" Justice Oliver Wendell Holmes observed, \"is not logic, but experience.\" To divorce the time in which it was legally possible for Sweatt to attend the Law School from the reality he experienced there is to ignore the very insidiousness of racial discrimination. It was the vestiges of that discrimination which, far from being destroyed, thrived and drove Sweatt out of the Law School. We act no less callously now in pretermitting the consideration of that legacy of discrimination by denying rehearing.\n\nFor all these reasons and those expressed in the collective Dissent, I vehemently disagree with our court's decision not to rehear this case en banc.\n\n\u003cspan class=\"fn\"\u003e1. The formulae were written by the Law School Data Assembly Service according to a prediction derived from the success of first-year students in preceding years. As the LSAT was determined to be a better predictor of success in law school, the formulae for the class entering in 1992 accorded an approximate 60% weight to LSAT scores and 40% to GPA. The formula for students with a three-digit LSAT, see infra note 5, was calculated as: LSAT + (10)(GPA) = TI. For students with a two-digit LSAT, the formula was: (1.25)LSAT + (10)GPA = TI.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Notably, but of less significance to this appeal, residency also had a strong, if not often determinant, effect. Under Texas law in 1992, the law school was limited to a class of 15% non-residents, and the Board of Regents required an entering class of at least 500 students. The law school therefore had to monitor offers to non-residents carefully, in order not to exceed this quota, while at the same time maintaining an entering class of a manageable size.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The number of votes would change over the course of the admissions season in order to achieve the appropriate number of offers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. As blacks and Mexican Americans were the only two minority categories granted preferential treatment in admissions, it is inaccurate to say that the law school conducted separate admissions programs for \"minorities\" and \"non-minorities.\" While the law school application form segregated racial and ethnic classification into seven categories \"Black/African American,\" \"Native American,\" \"Asian American,\" \"Mexican American,\" \"Other Hispanic\" (meaning non-Mexican descent), \"White,\" and \"Other (describe)\"only American blacks and Mexican Americans received the benefit of the separate admissions track. Thus, for example, the law school decided that a black citizen of Nigeria would not get preferential treatment, but a resident alien from Mexico, who resided in Texas, would. Likewise, Asians, American Indians, Americans from El Salvador and Cuba, and many others did not receive a preference. It is important to keep the composition of these categories in mind. For the sake of simplicity and readability, however, we sometimes will refer to two broad categories: \"whites\" (meaning Texas residents who were whites and non-preferred minorities) and \"minorities\" (meaning Mexican Americans and black Americans).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Because of a recent change in the grading scale of the LSAT, the law school in 1992 had applicants who had taken an earlier LSAT scored on a 10-to-48 scale and others who had taken a later one scored on a 120-to-180 scale. Equivalence calculations were used to compare scores received on the two scales. For example, TI numbers of 199 (three-digit LSAT) and 87 (two-digit LSAT) were equivalent. For the sake of simplicity, we use three-digit numbers throughout this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. In March 1992, the resident Mexican American and black presumptive admit lines were in parity, but they had not started that way. The initial presumptive admit TI's were 196 for Mexican Americans and 192 for blacks. Thus, initially, blacks received preferential treatment over Mexican Americans by having a lower hurdle to cross to get into the discretionary zone. In March, Professor Johanson lowered the Mexican American TI in order to admit more of this group.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The median scores of the 1992 class are as follows: Ethnicity Resident Nonresident GPA/LSAT GPA/LSAT All students 3.52/162 3.61/164White 3.56/164 3.72/166Black 3.30/158 3.30/156Mexican American 3.24/157 3.38/174 n*Other minority 3.58/160 3.77/157\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. To illustrate this difference, we consider the four plaintiffs in this case Cheryl Hopwood, Douglas Carvell, Kenneth Elliott, and David Rogers. For a student similarly situated to Hopwood, with a GPA of 3.8, to avoid presumptive denial as a white, i.e., to obtain a TI of 193 or above, her LSAT had to be at least a 155, a score in approximately the top 32% of test-takers. If she were black (thus, needing a 180 TI), she would have had to score a 142 on the LSAT, ranking her only in the top 80%. Likewise, a student similar to Carvell, who had a 3.28 GPA, would have needed a \"white\" LSAT of 160 (top 17%) and a \"black\" 147 (top 63%). A student like Rodgers with a 3.13 would have needed either a 162 (top 12%) as a white or 149 as a black (top 56%). Finally, a student like Elliott with a 2.98 GPA would have needed a 163 (top 10%) or 150 (top 53%), respectively.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. According to the plaintiffs, 600-700 higher-scoring white residents were passed over before the first blacks were denied admission. There is no specific finding on this assertion, and though the law school does not appear to refute it, we do not rely upon it in making our decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Thus, the law school constantly had to adjust its TI range over the course of the admissions season to reach a desired mix. See supra note 6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The district court did not find, nor is the record clear on, how these different classes of waiting list candidates were compared in the event the law school made last-minute admissions decisions. The record does show that the school carefully monitored the race of applicants in filling the last openings in late spring and early summer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The district court discussed in detail the plaintiffs' qualifications and their rejections. See 861 F. Supp. at 564-67.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The defendants are the State of Texas; the University of Texas Board of Regents; the members of the board, named but sued in their official capacities; the University of Texas at Austin; the President of the university, sued in his official capacity; the University of Texas School of Law; the dean of the law school, sued in his official capacity; and the Chairman of the Admissions Committee, sued in his official capacity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Because of this Conclusion, the district court examined at length the history of race relations in Texas and discrimination in its schools. 861 F. Supp. at 554-57.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Shortly before trial, apparently in response to the filing of this lawsuit, the law school modified its 1992 admissions practices to fit the district court's view of the proper constitutional system. See id. at 582 n.87.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. In their initial brief on appeal, the defendants argued that intermediate scrutiny is appropriate here. In a supplemental brief filed to address the subsequent opinion in Adarand, they now acknowledge that strict scrutiny is the appropriate test.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Adarand, 115 S. Ct. at 2112-13 (overruling Metro Broadcasting, Inc. v. F.C.C., 497 U.S. 547, 111 L. Ed. 2d 445, 110 S. Ct. 2997 (1990), insofar as it applied intermediate scrutiny to congressionally mandated \"benign\" racial classifications); City of Richmond v. J.A. Croson Co., 488 U.S. 469, 495, 102 L. Ed. 2d 854, 109 S. Ct. 706 (1989) (plurality opinion) (\"the standard of review under the Equal Protection Clause is not dependent on the race of those burdened or benefited by a particular classification\"); id. at 520 (Scalia, J., Concurring in judgment); Wygant v. Jackson Bd. of Educ., 476 U.S. 267, 273, 90 L. Ed. 2d 260, 106 S. Ct. 1842 (1986) (plurality opinion) (\"The level of scrutiny does not change merely because the challenged classification operates against a group that historically has not been subject to government discrimination.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. While Adarand -- -- the Supreme Court's most recent opinion on racial preferences -- -- does not directly address the application of the strict scrutiny test, it underscores the presumptive unconstitutionality of racial classifications. \"By requiring strict scrutiny of racial classifications, we require courts to make sure that a government classification based on race, which 'so seldom provides a relevant basis for disparate treatment,' Fullilove [v. Klutznick, 448 U.S. 448, 534, 65 L. Ed. 2d 902, 100 S. Ct. 2758 (1980)], (Stevens, J., Dissenting), is legitimate, before permitting unequal treatment based on race.\" 115 S. Ct. at 2113.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. See also Adarand, id. at 2111 (\"Any person, of whatever race, has the right to demand that any government actor subject to the Constitution justify any racial classification subjecting that person to unequal treatment under the strictest judicial scrutiny.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See, e.g., Croson, 488 U.S. at 498-500 (holding that past societal discrimination against a group confers no basis for local governments to provide a specifically tailored remedy to current members of that group); Wygant, 478 U.S. at 275-76 (rejecting argument that governmental discrimination in teacher layoffs is allowed to foster role models within a group).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. See, e.g., Vincent Blasi, Bakke as Precedent: Does Mr. Justice Powell Have a Theory?, 67 CAL. L. REV. 21, 24 (1979) (arguing that Bakke 's precedential force is governed by the common Conclusions of Justices Powell and Stevens, though it is erroneous to conclude that Powell's opinion has \"controlling significance on all questions\"); Robert G. Dixon, Jr., Bakke : A Constitutional Analysis, 67 CAL. L. REV. 69 (1979) (Justice Powell's \"tiebreaking opinion . . . has acquired wide pragmatic appeal.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. As affirmative action programs are by definition purposeful classifications by race, they do not present the problem of governmental action that is facially neutral but has a disparate impact and is motivated by race. See City of Arlington Heights v. Metropolitan Housing Dev. Corp., 429 U.S. 252, 50 L. Ed. 2d 450, 97 S. Ct. 555 (1977); Washington v. Davis, 426 U.S. 229, 48 L. Ed. 2d 597, 96 S. Ct. 2040 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The Supreme Court subsequently has agreed with that position. See Wygant, 476 U.S. at 274-76 (plurality opinion). The district court a quo erred in suggesting that societal discrimination is constitutionally cognizable. See 861 F. Supp. at 570 n.56, 571 n.60.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See also Sweezy v. New Hampshire, 354 U.S. 234, 263, 1 L. Ed. 2d 1311, 77 S. Ct. 1203 (1957) (Frankfurter, J., Concurring in result) (recognizing four separate components of \"academic freedom\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Saying that a university has a First Amendment interest in this context is somewhat troubling. Both the medical school in Bakke and, in our case, the law school are state institutions. The First Amendment generally protects citizens from the actions of government, not government from its citizens. Significantly, Sweezy involved a person who was called before the Attorney General of New Hampshire to answer for alleged subversive activities. He declined on First Amendment grounds to answer questions about a lecture he had delivered at the University of New Hampshire. While Justice Frankfurter spoke of a university's interest in openness and free inquiry, it was plainly through the First Amendment rights of individual scholars. 354 U.S. at 262, 266-67 (Frankfurter, J., Concurring in result).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. See also Milwaukee County Pavers Ass'n v. Fiedler, 922 F.2d 419, 422 (7th Cir.) (\"The whole point of Croson is that disadvantage, diversity, or other grounds favoring minorities will not justify governmental racial discrimination . . .; only a purpose of remedying discrimination against minorities will do so.\") (emphasis added), cert. denied, 500 U.S. 954, 114 L. Ed. 2d 714, 111 S. Ct. 2261 (1991). Notably, Justice Scalia rejected the use of racial classifications \"in order (in a broad sense) 'to ameliorate the effects of past discrimination.'\" Croson, 488 U.S. at 520 (Scalia, J., Concurring in the judgment) (quoting Croson, 488 U.S. at 476-77). He, however, suggested one other possible compelling state interest: a social emergency. He opined that \"where state or local action is at issue, only a social emergency rising to the level of imminent danger to life and limb\" will justify racial classifications. Croson, 488 U.S. at 521 (Scalia, J., Concurring in judgment). While such an interest is probably consistent with the widely criticized holdings of Hirabayashi v. United States, 320 U.S. 81, 87 L. Ed. 1774, 63 S. Ct. 1375 (1943), and Korematsu v. United States, 323 U.S. 214, 89 L. Ed. 194, 65 S. Ct. 193 (1944), plainly such an interest is not presented in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The law school places much reliance upon Justice O'Connor's concurrence in Wygant for the proposition that Justice Powell's Bakke formulation is still viable. In her 1986 Wygant opinion, in the context of discussing Justice Powell's opinion, Justice O'Connor noted that \"although its precise contours are uncertain, a state interest in the promotion of racial diversity has been found sufficiently 'compelling,' at least in the context of higher education, to support the use of racial considerations in furthering that interest.\" 476 U.S. at 286 (O'Connor, J., Concurring in part and Concurring in the judgment). The law school's argument is not persuasive. Justice O'Connor's statement is purely descriptive and did not purport to express her approval or disapproval of diversity as a compelling interest. Her subsequent statements outlined above in Croson and Metro Broadcasting suggest strongly that reliance upon this statement in Wygant is unjustified.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The law school's admissions program makes no distinction among black and Mexican American applicants in an effort to determine which of them, for example, may have been culturally or educationally disadvantaged.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. For example, Justice Powell apparently felt that persons with different ethnic backgrounds would bring diverse \"experiences, outlooks, and ideas\" to the medical school. Bakke, 438 U.S. at 314 (opinion of Powell, J.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Thus, to put it simply, under the Equal Protection Clause the distribution of benefits and costs by government on racial or ethnic grounds is impermissible. Even though it is frequently efficient to sort people by race or ethnic origin, because racial or ethnic identity may be a good proxy for functional classifications, efficiency is rejected as a basis for governmental action in this context. Posner, supra, at 22.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. We recognize that the use of some factors such as economic or educational background of one's parents may be somewhat correlated with race. This correlation, however, will not render the use of the factor unconstitutional if it is not adopted for the purpose of discriminating on the basis of race. See McCleskey v. Kemp, 481 U.S. 279, 95 L. Ed. 2d 262, 107 S. Ct. 1756 (1987). As Justice O'Connor indicated in Hernandez v. New York, 500 U.S. 352, 114 L. Ed. 2d 395, 111 S. Ct. 1859 (1991), which was a challenge under Batson v. Kentucky, 476 U.S. 79, 90 L. Ed. 2d 69, 106 S. Ct. 1712 (1986), based upon the prosecution's strike of potential jurors who spoke Spanish: No matter how closely tied or significantly correlated to race the explanation for a peremptory strike may be, the strike does not implicate the Equal Protection Clause unless it is based on race. That is the distinction between disproportionate effect, which is not sufficient to constitute an equal protection violation, and intentional discrimination, which is. 500 U.S. at 375 (O'Connor, J., joined by Scalia, J., Concurring in the judgment).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. According to one of the four-Justice opinions in Bakke, racial classifications stigmatize when \"they are drawn on the presumption that one race is inferior to another or because they put the weight of government behind racial hatred and separation.\" 438 U.S. at 357-58 (Brennan, White, Marshall, and Blackmun, JJ., Concurring in the judgment in part and Dissenting in part). In Bakke, however, these Justices rejected strict scrutiny because the program at issue could not be said to stigmatize as did other racial classifications. These Justices nevertheless recognized that rational-basis scrutiny would not be enough. Id. at 361 (Brennan, White, Marshall, and Blackmun, JJ., Concurring in the judgment in part and Dissenting in part).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. As Judge Posner has indicated, the proper constitutional principle is not, no \"invidious\" racial or ethnic discrimination, but no use of racial or ethnic criteria to determine the distribution of government benefits and burdens . . . . To ask whether racial exclusion may not have overriding benefits for both races in particular circumstances is to place the antidiscrimination principle at the mercy of the vagaries of empirical conjecture and thereby free the Judge to enact his personal values into constitutional doctrine. Posner, supra, at 25-26.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. See also Adarand, 115 S. Ct. at 2119 (Thomas, J., Concurring in part and Concurring in judgment) (\"But there can be no doubt that racial paternalism and its unintended consequences may be as poisonous and pernicious as any other form of discrimination.\"). One prominent constitutional commentator specifically has noted that where programs involve lower and separate standards of selection, \"a new badge of implied inferiority, assigned as an incident of governmental noblesse oblige,\" results. Explicit in state, local, or federal plans using separate and lower standards by race is a statement by government that certain persons identified by race are in fact being placed in positions they may be presumed not likely to hold but for their race (because they are presumed to be unable to meet standards the government itself requires to be met). The message from government is written very large when these plans proliferate: a double (and softer) standard for admission, a double (and softer) standard for hiring, a double (and softer) standard for promotion, a double (and softer) standard for competitive bidding, and so on. Without question, this is a systematic racial tagging by government a communication to others that the race of the individual they deal with bespeaks a race-related probability, created solely by the government itself, of lesser qualification than others holding equivalent positions. William Van Alstyne, Rites of Passage: Race, the Supreme Court, and the Constitution, 46 U. CHI. L. REV. 775, 787 n.38 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. As professor Van Alstyne has argued: Rather, one gets beyond racism by getting beyond it now: by a complete, resolute, and credible commitment never to tolerate in one's own life -- -- or in the life or practices of one's government -- -- the differential treatment of other human beings by race. Indeed, that is the great lesson for government itself to teach: in all we do in life, whatever we do in life, to treat any person less well than another or to favor any more than another for being black or white or brown or red, is wrong. Let that be our fundamental law and we shall have a Constitution universally worth expounding. Van Alstyne, supra note 34, at 809-10.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Because we have determined that any consideration of race by the law school is constitutionally impermissible if justified by diversity, it is not necessary to determine whether, as plaintiffs argue, the admissions system under which the plaintiffs applied operated as a de facto \"quota\" system similar to the one struck down in Bakke. We do note that even if a \"plus\" system were permissible, it likely would be impossible to maintain such a system without degeneration into nothing more than a \"quota\" program. See Bakke, 438 U.S. at 378 (\"For purposes of constitutional adjudication, there is no difference between [setting aside a certain number of places for minorities and using minority status as a positive factor].\") (Brennan, White, Marshall, and Blackmun, JJ., Concurring in the judgment in part and Dissenting in part). Indeed, in this case, the law school appeared to be especially adept at meeting its yearly \"goals.\" See Hopwood, 861 F. Supp. at 574 n.67.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Plaintiffs additionally have argued that the law school's program was not narrowly tailored in the diversity context because (1) it failed to award preferences to non-Mexican Hispanic Americans, Asian Americans, American Indians, or other minorities, and (2) it failed to accord as much weight to non-racial diversity factors, such as religion and socioeconomic background, as it did to race.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Hopwood I is the first appeal of the intervention issue that we address infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Unfortunately, the precise scope of allowable state action is of somewhat undefined contours. Indeed, it is not evident whether permitted remedial action extends to the \"present effects of past discrimination.\" This language, derived from Justice Brennan's opinion in Bakke, 438 U.S. at 362-66, appears intended to present little resistance to wide-ranging affirmative action plans. While Justice Brennan began by stating that schools have a duty affirmatively to erase the vestiges of their past discriminatory practices, he compared this duty to the power of Congress to enforce § 1 of the Fourteenth Amendment through § 5. He reasoned that under that wide-ranging power, the beneficiaries of such a program need not present proof that they were discriminated against; a showing that they were in the general class was sufficient. Id. at 363-64. Nor would a school need judicial findings of past discrimination. Id. at 364. Finally, he argued that such beneficiaries would not even have to show that that school had a history of past discrimination, but need only suggest that they were the victims of general societal discrimination that prevented them from being otherwise qualified to enter the school. Id. at 365-66. Hence, under this standard, almost any school could adopt an affirmative action plan. There is no question, however, that subsequent Supreme Court opinions, notably Wygant and Croson, have rejected broad state programs that purport to be remedial and that, presumably, would have satisfied Justice Brennan's standard for meeting the \"present effects of past discrimination.\" And some members of the Court would limit any remedial purpose to the actual victims of discrimination. See Adarand, 115 S. Ct. at 2118 (Scalia, J., Concurring in part and Concurring in judgment) (\"Government can never have a 'compelling interest' in discriminating on the basis of race in order to 'make up' for past racial discrimination in the opposite direction.\"). Nevertheless, we will not eschew use of the phrase \"present effects of past discrimination,\" as we used this language in Hopwood I, 21 F.3d at 605, and another circuit did so in Podberesky v. Kirwan, 38 F.3d 147, 153 (4th Cir. 1994), cert. denied, 131 L. Ed. 2d 1002, 115 S. Ct. 2001 (1995). We will, however, limit its application in accordance with Wygant and Croson.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. See Wygant, 476 U.S. at 286 (opinion of O'Connor, J., Concurring in part and Concurring in judgment) (\"The Court is in agreement that whatever the formulation employed, remedying past or present racial discrimination by a state actor is a sufficiently weighty state interest to warrant remedial use of a carefully constructed affirmative action program.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. See also id. at 288 (O'Connor, J., Concurring in part and Concurring in judgment) (\"I agree with the plurality that a government agency's interest in remedying 'societal' discrimination, that is discrimination not traceable to its own actions, cannot be deemed sufficiently compelling to pass constitutional muster under strict scrutiny.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Justice O'Connor was joined by Chief Justice Rehnquist and Justices White, Stevens, and Kennedy in this portion of the opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. The fact that the plaintiffs named the State of Texas as one defendant does not mean that it is proper to scrutinize the state as the relevant past discriminator. This argument confuses a theory of liability with a justification for a limited racial remedy. The State of Texas simply may be responsible for the wrongs of the law school, which is a governmental entity the state has created. The Supreme Court, however, has limited the remedial interest to the harm wrought by a specific governmental unit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. And again, any such remedy here would be grossly speculative. As the defendants concede and the district court found, there is no recent history of overt sanctioned discrimination at the University of Texas. Hopwood, 861 F. Supp. at 572. Nor does the record even suggest such discrimination at any of the other component schools of the University of Texas System. Thus, any harm caused to the students of those institutions would be the result of the present effects of past discrimination. We do note that the law school is not autonomous. In Texas, the management of higher education has been divided by the legislature into different \"systems.\" See 12 TEX. JUR. 3D, Colleges and Universities § 2 (1993). The University of Texas at Austin, with which the law school is associated, is part of the University of Texas System. TEX. EDUC. CODE ANN. §§ 67.01 to 67.62 (West 1991). Accordingly, the legislature, which has ultimate control over the school, has delegated its \"management and control\" to the regents of the University of Texas System. Id. § 67.02. Thus, the law school is governed by both the legislature and the university's board of regents. Yet, while the state's higher authorities may have the power to require the law school to remedy its past wrongs, they may do so consistently with the Constitution only if the remedial actions are directed at the law school. This requirement is what the Supreme Court dictated by limiting the remedial purpose to the \"governmental unit involved.\" Wygant, 476 U.S. at 274 (plurality opinion).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. The testimony of several minority students underscores this point. They stated generally that they felt that other students did not respect them because the other students assumed that minorities attained admission because of the racial preference program.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The argument is that because the state discriminated in its primary and secondary school systems, the students' educational attainment was adversely affected, and this harm extended to their higher education, thus justifying giving current applicants a \"plus\" based on race. This reasoning is especially important in justifying benefits for Mexican Americans, as there is no evidence that the law school implemented de jure (or even de facto) discrimination against this group in its admissions process. Because this logic ignores the relevant actions in this case, i.e., discrimination by the law school, it is not necessary for us to examine the potential causational flaws in the argument. Moreover, if we did find that the past wrongs of Texas school districts were the sort of discrimination that the law school could address, the school still would have to prove the present effects of that past wrong. Without some strong evidence in the record showing that today's law school applicants still bear the mark of those past systems, such effects seem grossly speculative. The district court simply assumed that \"this segregation has handicapped the educational achievement of many minorities. . . .\" 861 F. Supp. at 573. And we would still have to ask whether the program was narrowly tailored to this goal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. To the extent that the OCR has required actions that conflict with the Constitution, the directives cannot stand. The Supreme Court has addressed required state compliance with federal law in the voting rights context. Miller v. Johnson, 132 L. Ed. 2d 762, 115 S. Ct. 2475, 2491 (1995) (\"As we suggested in Shaw [v. Reno, 509 U.S. 630, 125 L. Ed. 2d 511, 113 S. Ct. 2816, 2830-31 (1993)], compliance with federal antidiscrimination laws cannot justify race-based districting where the challenged district was not reasonably necessary under a constitutional reading and application of those laws.\") (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. In more detail, the Fordice Court said the following: If the State perpetuates policies and practices traceable to its prior system that continue to have segregative effects -- -- whether by influencing student enrollment or by fostering segregation in other facets of the university system -- -- and such policies are without sound educational justification and can be practicably eliminated, the State has not satisfied its burden of proving that it has dismantled its prior system. 505 U.S. at 731.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. In Croson, Justice O'Connor did argue that a state may act to prevent its powers from being used to support private discrimination. 488 U.S. at 491-92 (plurality opinion) (\"[A] state or local subdivision, (if delegated the authority from the State) has the authority to eradicate the effects of private discrimination within its own legislative jurisdiction.\") (emphasis added). Hence, a specific state actor can act to prevent the state from being used as a \"passive participant\" in private discrimination. This power does not create wide-ranging authority to remedy societal discrimination, however.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. The plaintiffs argue that indeed there is no narrow tailoring, for at least the following reasons: (1) In 1992, more than two-thirds of all admission offers to blacks, and a majority of all blacks who matriculated, involved out-of-state residents, thus undercutting the law school's stated purpose of remedying past discrimination in Texas. (2) The system of preferences has no termination date, thus indicating that there is no connection between the plan and a bona fide remedial purpose. (3) Preference is given even to blacks and Mexican Americans who graduated from private secondary schools and thus did not suffer from state-ordered racial discrimination. The law school apparently chose admission goals of 5% blacks and 10% Mexican Americans because those are the respective percentages of college graduates in Texas who are black and Mexican American. Nothing in the record, however, establishes any probative correlation between the degree of past discrimination and the percentage of students from a minority group who graduate from college. There is no history either of de jure discrimination against Mexican Americans in education at any level in Texas or of de facto discrimination against Mexican Americans by the law school. Therefore, it is puzzling that the law school would set an admissions goal for Mexican Americans that is twice that of blacks, as to whom the history of de jure discrimination in Texas Education in general, and by the law school in particular, is irrefutable. If fashioning a remedy for past discrimination is the goal, one would intuit that the minority group that has experienced the most discrimination would have the lowest college graduation rate and therefore would be entitled to the most benefit from the designed remedy. The goals established by the law school are precisely the reverse of that intuitive expectation and are more reflective of a goal of diversity (which we hold is not compelling) than of a goal of remedying past discrimination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. This finding also affected the court's analysis in denying prospective relief and compensatory damages.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. The district court applied a burden-shifting scheme similar to the methodology used in the title VII context. 861 F. Supp. at 579-80 (citing St. Mary's Honor Ctr. v. Hicks, 509 U.S. 502, 125 L. Ed. 2d 407, 113 S. Ct. 2742 (1993)). The law school concedes that the burden-shifting exercise was unnecessary, but it maintains nonetheless that the \"ultimate burden of proof,\" including proof of damages, rests upon the plaintiffs. See id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Some of Justice Powell's dicta in Bakke also squarely supports the plaintiffs' claim that once discrimination is proved, the defendant bears the burden of proving no damage. Bakke, 438 U.S. at 320 (opinion of Powell, J.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Compare Henson v. University of Ark., 519 F.2d 576, 577-78 (8th Cir. 1975) (per curiam) (placing burden of persuasion on white applicant to show affirmative action program prevented her admission) and Martin v. Charlotte-Mecklenburg Bd. of Educ., 475 F. Supp. 1318, 1345 (W.D.N.C. 1979) (holding that plaintiff in non-class action bears burden of proving damages) with Donnelly v. Boston College, 558 F.2d 634, 635 (1st Cir. 1977) (dictum) (citing Bakke and Mt. Healthy, but finding no causation, as evidence showed that plaintiff would not have been admitted regardless of affirmative action) and Heit v. Bugbee, 494 F. Supp. 66, 66-67 (E.D. Mich. 1980) (adopting Bakke and Mt. Healthy reasoning in toto for firefighter's reverse discrimination claims) and United States v. McDonald, 553 F. Supp. 1003, 1006 (S.D. Tex. 1983) (dictum) (same for discriminatory criminal prosecution).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. The district court concluded that the plaintiffs proved only that they had been denied equal treatment but had failed to \"prove an injury-in-fact.\" 861 F. Supp. at 582. To the extent that the court felt that plaintiffs failed to show injury-in-fact because they failed to prove that they would have been admitted under a constitutional admissions system, this Conclusion should be revisited on remand, where the district court must apply the proper burden and redetermine whether plaintiffs would have been admitted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. We do not opine on any Eleventh Amendment immunity in this case. See, e.g., United Carolina Bank v. Board of Regents, 665 F.2d 553, 561 (5th Cir. Unit A 1982) (holding that the Eleventh Amendment barred a civil rights suit brought by a professor against university officials in their official capacities). This issue is simply not before us.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. For example, if the school is unable to show that plaintiff Carvell would not have gained admission even under a constitutional admissions system, he may be entitled to be compensated for the difference, to which he testified, between tuition at the law school and tuition at Southern Methodist University School of Law, which he attended instead. The district court should also consider the following paradox: The law school argued strenuously that plaintiff Elliott did not have standing to sue, as he had been offered admission to the school albeit at the last moment and had failed to accept that offer. The district court found that this offer of admission had not been communicated to Elliott. 861 F. Supp. at 566. In considering damages, however, the court held that \"in all likelihood, the plaintiffs would not have been offered admission even under a constitutionally permissible process.\" Id. at 581. The district court should re-examine these contradictory results.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. There is circuit law regarding successive motions, but the pertinent opinions do not examine the standard of review explicitly. See, e.g., Kneeland v. National Collegiate Athletic Ass'n, 806 F.2d 1285 (5th Cir.) (implicit application of de novo review without Discussion of standard), cert. denied, 484 U.S. 817 (1987); United States v. Louisiana, 669 F.2d 314, 315 (5th Cir. 1982) (application of abuse of discretion review for timeliness determination on second motion where proposed intervenor failed to argue for first motion after remand); Calvert Fire Ins. Co. v. Environs Dev. Corp., 601 F.2d 851, 857 (5th Cir. 1979) (implicit application of de novo review where district court treated second motion as both a reconsideration of prior motion and a new motion).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. The associations ground this argument in language taken from the prior appeal. One necessary element for intervention is a showing that the present parties will inadequately represent the proposed intervenors' interests. While the associations lost on this ground on the last appeal, they now claim that the opinion supports the argument that the law school's defense is inadequate. In the last appeal, we cited Jansen v. City of Cincinnati, 904 F.2d 336 (6th Cir. 1990), as support for the following statement: \"Nor have the proposed intervenors shown that they have a separate defense of the affirmative action plan that the State has failed to assert.\" Hopwood I, 21 F.3d at 606. Because the law school, now after trial, still has not asserted the associations' title VI defense, the associations maintain that they now can meet their burden. In Jansen, however, the court found that the proposed intervenors had an interest different from that of the defendant city. 904 F.2d at 343. This was the basis for that court's holding that the city's representation was inadequate. See id. (\"Proffering this alleged violation of the consent decree as an affirmative defense is directly counter to the City's interest.\") (emphasis added). Here, we have already found that the law school's and the associations' interests are the same. Jansen therefore does not support intervention.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. At least one set of commentators has eschewed this traditional rule. Their position is that \"any denial of intervention should be regarded as an appealable final order.\" 7C WRIGHT ET AL., supra, § 1923, at 508. Under this proposed rule, the federal court would \"affirm denial of intervention when previously, having determined on the merits that the trial court was right, it would dismiss the appeal.\" Id. at 509. We have acknowledged that this would be the better rule. See Korioth v. Briscoe, 523 F.2d 1271, 1279 n.26 (5th Cir. 1975) (citing WRIGHT ET AL., supra). In fact, the Hopwood I panel affirmed rather than dismissing for want of jurisdiction. Under the suggested rule, because we would have a final order on the merits from a previous panel on this issue, this case would probably be at an end. Nonetheless, as the anomalous rule constitutes our circuit caselaw, we are bound to follow it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. A dismissal for want of jurisdiction, however, leaves open the possibility that the deficiency can be cured. If that occurs, no issue preclusion exists. See 7C WRIGHT ET AL., supra, § 4436, at 338. It is at this point in the analysis that \"changed circumstances\" may become relevant. Arguably, the \"changed circumstances\" analysis, in effect, \"cures\" the earlier jurisdictional deficiency. Thus, if the circumstances of the case change to such an extent that jurisdiction would lie, the subsequent motion to intervene should not be dismissed for lack of jurisdiction. In effect, the posture of the case has changed, as it would any time a given jurisdictional problem is cured.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. In Hopwood I, we decided that (1) the interests of the associations were adequately represented by the law school and the state, and (2) as a practical matter, Disposition in the principal suit would not impair or impede either of those groups' interests. 21 F.3d at 605. The law of the case doctrine militates against revisiting that decision here. For purposes of any future litigation, however, we note a necessary effect of our previous holding when coupled with the law school's failure to raise a title VI argument: Neither the district court's decision nor ours in this appeal is binding on the associations as res judicata, law of the case, collateral estoppel, or any other theoretical bar. In short, as the title VI issue has not been litigated, the associations are not precluded from instituting a separate and independent title VI challenge to the law school's use of the TI. We neither express nor imply an opinion on the viability of such a challenge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* Only two matriculated applicants. In 1992, the LSAT's national distribution was approximately as follows: LSAT Percentile 2-Digit LSAT 166 94% 43164 91% 41162 88% 40160 83% 39158 78% 38156 71% 36On the basis of these percentiles, one-half of the law school's white resident matriculants were in the top 9% of all test-takers, one-half of the resident Mexican Americans were in approximately the top 25% of test-takers, and one-half of the resident blacks were in the top 22% of test-takers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Baker v. Wade, 769 F.2d 289, 298 (5th Cir. 1985) (Goldberg, J., Dissenting) (citing Marbury v. Madison, 5 U.S. (1 Cranch) 137, 2 L. Ed. 60 (1803); Martin v. Hunter's Lessee, 14 U.S. (1 Wheat) 304, 4 L. Ed. 97 (1816)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Law School no longer employs the system that was in place for 1992.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Judge Smith wrote the opinion for the panel, and Judge DeMoss joined that opinion in full. Judge Wiener, who wrote separately, did not join the panel opinion in this Conclusion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. 438 U.S. 265, 98 S. Ct. 2733, 57 L. Ed. 2d 750 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. F.3d (1996 U.S. App. LEXIS 4719, 1996 WL 120235) (5th Cir. 1996).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. See Rodriguez de Quijas v. Shearson/American Express, Inc., 490 U.S. 477, 109 S. Ct. 1917, 104 L. Ed. 2d 526 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. 994 F.2d 226, 235 (5th Cir. 1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. 20 F.3d 1350, 1356 (5th Cir. 1994). We cannot but note that a majority of our active Judges voted Walton en banc to correct the majority's erroneous interpretation of Supreme Court precedent regarding an issue that was not necessary for the resolution of the case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See also United States v. Mendiola, 42 F.3d 259, 260 n.1 (5th Cir. 1994) (Barksdale, J.) (\"It goes without saying that we have a strong duty to avoid constitutional issues that need not be resolved in order to determine the rights of the parties to the case under consideration.\"); Manning v. Upjohn Co., 862 F.2d 545, 547 (5th Cir. 1989) (Smith, J.) (\"Principles of judicial restraint dictate that if resolution of an issue effectively dispose of a case, we should resolve the case on that basis without reaching any other issues that might be presented.\"); Apache Bend Apartments, Ltd. v. United States, 987 F.2d 1174, 1175 (5th Cir. 1993) (Jolly, J.) (\"The judicial power to adjudicate constitutional questions is reserved for those instances in which it is necessary for the vindication of individual rights.\") (emphasis added); Doe v. Taylor Indep. Sch. Dist., 15 F.3d 443 (5th Cir. 1994) (Jones, J., Dissenting, joined by Garwood, Smith, Barksdale, and DeMoss, JJ.) (\"'The doctrine of judicial self-restraint requires us to exercise the utmost care whenever we are asked to break new ground in [the constitutional] field.'\") (quoting Collins v. City of Harker Heights, 503 U.S. 115, 125, 112 S. Ct. 1061, 1068, 117 L. Ed. 2d 261 (1992)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In a part V.C. of his opinion, Justice Powell writes, In enjoining [the University of California at Davis] from ever considering the race of any applicant, however, the courts below failed to recognize that the State has a substantial interest that legitimately may be served by a properly devised admissions program involving the competitive consideration of race and ethnic origin. Bakke, 438 U.S. at 318. Justices Brennan, White, Marshall, and Blackmun joined Justice Powell in this holding. Id. at 271 n. *.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Lest there be any doubt, we are firmly convinced that, until the Supreme Court expressly overrules Bakke, student body diversity is a compelling governmental interest for the purposes of strict scrutiny.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See Wygant v. Jackson Bd. Of Educ., 476 U.S. 267, 286, 90 L. Ed. 2d 260, 106 S. Ct. 1842 (1986) (O'Connor, J., Concurring) (recognizing racial diversity as sufficiently compelling in the context of higher education).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Judge Emilio M. Garza, our seventeenth active Judge, recused himself from the outset. 1a When a court ordered the State to provide a law school for blacks, Texas created a \"makeshift law school that had no permanent staff, no library staff, no facilities, and was not accredited.\" Hopwood v. State of Texas, 861 F. Supp. 551, 555 (1994). This \"law school\" consisted of 3 rooms in a basement and had two professors. Paul Butler, Affirmative Action Admissions, Dallas Morning News, April 7, 1996, at 1J.\u003c/span\u003e\n\n",
    "body_length": 162111,
    "citedas": [
      "78 F.3d 932"
    ],
    "attorneys": "ATTORNEYS FOR APPELLANTS (94-50569): Anthony P. Griffin, Galveston, TX. VAN OS \u0026 OWEN, David Van Os, Austin, TX. Theodore M. Shaw, NAACP Legal Defense \u0026 Educational Fund, Inc., Norman J. Chachkin, New York, New York. Janell M. Byrd, NAACP Legal Defense \u0026 Educational Fund, Inc., Washington, DC. For TMLS - Proposed Intervenor (94-50569): Dennis D. Parker, New York, NY. ATTORNEYS FOR APPELLEES (For Elliott \u0026 Rogers) (94-50569): SMALL, CRAIG \u0026 WERKENTHIN, Terral Ray Smith, Austin, TX. Steven W. Smith, Austin, TX. (FOR CHERYL HOPWOOD, ET AL) (94-50569): Michael E. Rosman, Ctr for Individual Rights, Washington, DC. (STATE OF TEXAS, ET AL) (94-50569): VINSON \u0026 ELKINS, Harry M. Reasoner, Houston, TX. Barry D. Burgdorf, R. Scott Placek, Austin, TX. Samuel Issacharoff, Charles Alan Wright, Univ. of Texas School of Law, Austin, TX. Betty Owens, Houston, TX. DAN MORALES, AG FOR TEXAS, Javier Aguilar, Spec. Assist. Atty Gen., Austin, TX. Allan Van Fleet, Houston, TX. ATTORNEYS FOR APPELLANTS (94-50664): ELLIOT \u0026 RODGERS, Steven W. Smith, Austin, TX. Terral R. Smith, Austin, TX. FOR HOPWOOD AND DOUGLAS W. CARVELL (94-50664): Michael E. Rosman, Ctr. for Ind. Rights, Washington, DC. Joseph A. Wallace, Elkins, West VA. Theodore B. Olson, WADC. ATTORNEYS FOR APPELLEES (94-50664): FOR STATE OF TEXAS, ET AL.: Javier Aguilar, Austin, TX. Harry M. Reasoner, Betty R. Owens, Houston, TX. Barry D. Burgdorf, VINSON \u0026 ELKINS, Austin, TX. Dana C. Livingston, Manuel Lopez, Allan Van Fleet, Houston, TX. R. Scott Placek, Austin, TX. Samuel Issacharoff, Charles Alan Wright, Austin, TX. FOR: AMICUS CURIAE (TMLS) (94-50664): Janell M. Byrd, Anthony P. Griffin, WA/DC. Theodore M. Shaw, Norman J. Chachkin, NY, NY. Myles V. Lynk, Washington, DC. FOR: AMICUS CURIAE (MALDEF) (94-50664): Albert H. Kauffman, John R. Vasquez, Antonio, TX.",
    "category": [
      "36"
    ],
    "judges": "Before Smith, Wiener, DeMOSS, Politz, and Stewart, Circuit Judges.",
    "citation_count": 60
  }
}
