{
  "id": "WJ3_RWYBTlTomsSBhH4N",
  "document": {
    "title": "ARTHUR v. NYQUIST",
    "full_title": "George ARTHUR et al., Plaintiffs, v. Ewald P. NYQUIST, Individually and as Commissioner of Education of the State of New York, et al., Defendants",
    "jurisdiction": "W.D. New York",
    "date": "1976-04-30T00:00:00.000Z",
    "docket": "1972-325",
    "body": "CURTIN, Chief Judge.\n\nINTRODUCTION\n\nThis court's decision in this case comes after a long and arduous journey through a complex lawsuit, in which the plaintiffs charge the defendants with \"creating, maintaining, permitting, condoning and perpetuating racially segregated public schools in the City of Buffalo and in the Buffalo Metropolitan area.\" (Complaint, at 1). Plaintiffs allege a cause of action under 42 U.S.C. ยง 1981 et seq. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" and the fourteenth amendment to the United States Constitution. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\" They seek declaratory and injunctive relief under 28 U.S.C. ยง 2201 \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\" and claim jurisdiction in this court under 28 U.S.C. ยง 1343.\n\nIt hardly needs to be pointed out that the Constitution and the laws do not forbid all types of discrimination. The fourteenth amendment prohibits only discrimination carried out under color of law; private discrimination, however regrettable or reprehensible, is not actionable under it. Civil Rights Cases, 109 U.S. 3, 11 [3 S. Ct. 18, 21, 27 L. Ed. 835, 839] (1883); Shelley v. Kraemer, 334 U.S. 1, 13 [68 S. Ct. 836, 92 L. Ed. 1161, 1180] (1948). This state action requirement presents no obstacle to the plaintiffs' case, since there is no question but that all the defendants are state agencies within the ambit of the fourteenth amendment's protection. See United States v. Texas Education Agency, 467 F.2d 848, 863 (5th Cir. 1972) (en banc); Oliver v. Kalamazoo Board of Education, 368 F. Supp. 143, 157-58 (W.D.Mich.), aff'd 508 F.2d 178 (6th Cir. 1974), cert. denied, 421 U.S. 963 [95 S. Ct. 1950, 44 L. Ed. 2d 449] (1975).\n\nAt this point in the lawsuit, the only question before the court is whether or not any or all of the defendants have acted in such a manner as to segregate the Buffalo Public School System [hereinafter BPSS]. The question of remedy, i.e., what action the court should take if it should find that the BPSS is segregated, is not before the court.\n\nIt should be emphasized that this court sits only as an arbiter of a legal dispute, not as a super-school board. It is this court's duty to safeguard the fourteenth amendment's guarantee of equal protection under the laws for all residents of the United States. The late Judge Murrah's words aptly describe the court's function in this lawsuit:\n\nWe yet like to believe that wherever the Federal courts sit, human rights under the Federal Constitution are always a proper subject for adjudication.\n\nStapleton v. Mitchell, 60 F. Supp. 51, 55 (D.Kan.1945), appeal dismissed, 326 U.S. 690 [66 S. Ct. 172, 90 L. Ed. 406] (1945).\n\nAt the outset, the court gratefully acknowledges the consistently professional cooperation exhibited by all parties to this lawsuit. One of the beneficial consequences of this cooperation was a series of 161 stipulations \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" upon which all parties agreed before the trial in this action commenced. This, of course, considerably reduced the burden on this court once the trial actually began.\n\nThe complexity and scope of the issues before the court must not be understated, however. The question presented -- whether or not the defendants intentionally committed segregative acts affecting the Buffalo public schools -- is one that calls forth the strongest of emotions. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\" The final written record of this case gives some testimony to its complexity and to the fervor with which it was contested. Pretrial motions and discovery procedures consumed many months; the actual trial lasted ten days, with a transcript running 1,695 pages; parties submitted many pre-trial and post-trial briefs; some 180 exhibits \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\" were admitted into evidence; and post-trial oral arguments were scheduled to facilitate a clear understanding of the positions and legal arguments of all parties.\n\nIt is, of course, the duty of this court to decide the facts from the evidence placed before it. Correlatively, it is the duty of this court to apply the law as it exists, both in the decisions of the Supreme Court and those of the Second Circuit in which this court sits. After carefully sifting through all the testimony, evidence, and argument, the court is now prepared to apply the applicable law to the facts as it finds them.\n\nI. THE PARTIES AND THEIR POSITIONS\n\nThis suit was instituted as a class action, with the named individual plaintiffs, black and white parents of public school children in the Buffalo metropolitan area, attempting to represent all others similarly situated. Although a class action is appropriate under Federal Rule of Civil Procedure 23(b)(2), the court believes that since little evidence was presented at trial regarding non-BPSS policies and practices, the certified class should be restricted to parents of children attending Buffalo public schools.\n\nAlso plaintiffs are the Citizens Council for Human Relations, Inc., a non-profit corporation organized under the laws of the State of New York, and the National Association for the Advancement of Colored People, Buffalo branch, organizations which seek, among other things, equal opportunity in education.\n\nThe defendants are Ewald Nyquist, the Commissioner of Education in New York State, The Board of Regents of the State of New York and its individual members [State defendants], Joseph Manch, Superintendent of Schools of the City of Buffalo at the time this suit was brought, and Eugene Reville, the present Superintendent, the Board of Education of the City of Buffalo and its members, the Common Council of the City of Buffalo and its members, and Stanley M. Makowski, Mayor of the City of Buffalo [City defendants].\n\nOriginally, the plaintiffs did not name the individual members of the Board of Education or the Board of Regents. By order of this court dated today, the plaintiffs' motion to amend their complaint to include the individual members of these two Boards as parties defendant was granted.\n\nThe plaintiffs allege that the defendants, by various actions and inactions, have caused the BPSS to become or remain severely segregated. Among the major allegations are segregation of staff, siting and construction of schools so as to promote segregation, manipulation of school district lines, optional zones and transfers for segregative reasons, failure to implement any meaningful integration plan, failure to hire significant numbers of minority group teachers, failure to promote significant numbers of minority individuals to supervisory positions, and failure to fund the proposed new East Side High School. Numerous other actions and inactions are alleged, including segregation of residential areas, and student assignment which incorporated this segregation. As a result of these actions of the defendants, plaintiffs claim that they have been denied the equal protection of the laws guaranteed to all citizens by the fourteenth amendment.\n\nThe City defendants, while acknowledging that many of the schools are racially imbalanced, insist that any imbalances are due to demographic shifts in housing patterns that are beyond their control. In addition, they contend that no affirmative action is required of them by the Constitution to alleviate the imbalances so caused. In adhering to their long-standing neighborhood school policy, which they argue is and has been racially neutral, the City defendants deny that they have violated the plaintiffs' constitutional rights.\n\nThe State defendants likewise admit that widespread segregation exists in the BPSS, but insist that they have done more than is constitutionally required of them to end it. They also disclaim any responsibility for, or power to end, the segregated residential patterns in the City of Buffalo.\n\nII. THE LAW\n\nIn 1954 the Supreme Court of the United States issued its famous decision in Brown v. Board of Education, 347 U.S. 483 [74 S. Ct. 686, 98 L. Ed. 873] (1954), which declared that laws requiring separate school facilities for blacks and whites -- the separate but equal school doctrine -- were unconstitutional. The Court ruled in that decision that such a system was \"inherently unequal\", and that such school segregation was a violation of the fourteenth amendment's guarantee of equal protection of the laws. 347 U.S., at 495 [74 S. Ct. at 692, 98 L. Ed. at 881]. Although separate school facilities mandated by statute have long been outlawed in New York State, \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\" this did not effectively prevent the slow emergence of separate educational facilities, as shown in tables 3 to 7, infra.\n\nThe law to be applied in this case has evolved through a series of Supreme Court and circuit court cases since Brown dealing with school segregation in many cities of our country, both North and South. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\" The essential elements, found in Keyes v. School District No. 1, 413 U.S. 189 [93 S. Ct. 2686, 37 L. Ed. 2d 548] (1973), a case which involved the Denver public schools, can be reduced to a series of questions:\n\n(1) Have plaintiffs shown that any of the Buffalo public schools are segregated? \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\"\n\n(2) If the answer to the first question is yes, have plaintiffs shown that any of this segregation was brought about or maintained by purposeful or intentional segregative acts by the defendants? \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\"\n\n(3) If question number 2 is answered affirmatively, have plaintiffs shown that a meaningful or substantial portion of the school district was so segregated?\n\nAll parties agree that the Buffalo public schools exhibit severe racial imbalance (City Defendants' Answer, at 2; State Defendants' Answer, at 2), and that \"in recent years, the degree of racial isolation in the Buffalo public schools has been increasing.\" (S-11). The defendants deny, however, that the segregated condition of the BPSS was intentionally or purposefully caused by them. In other words, the defendants argue that the schools are de facto segregated, not de jure segregated. As the Supreme Court has explained in Keyes, \"the differentiating factor between de jure segregation and so-called de facto segregation . . . is purpose or intent to segregate.\" Keyes, supra, 413 U.S. at 208 [93 S. Ct. at 2697, 37 L. Ed. 2d at 563] (emphasis in original).\n\nIn deciding the question of intent, the court is not required to find guilt or innocence, prejudice or evenhandedness, or even \"badness\" or \"goodness\" on the part of the defendants. To prove their case, plaintiffs are not required to show that racist motives prompted the defendants, nor even that defendants wanted the schools to be segregated, although proof of either of these would be sufficient to show the required intent. It is enough, as the Second Circuit explained in Hart v. Community School Board, 383 F. Supp. 699 (E.D.N.Y.1974), aff'd 512 F.2d 37 (2d Cir. 1975), to show that the probable and foreseeable result of the defendants' acts was segregation. In Hart, the district court found that the school board had unconstitutionally segregated a school despite the court's specific finding that the school board was not racially motivated. The board appealed this decision. The Second Circuit stated:\n\nUnless the Supreme Court speaks to the contrary, we believe that a finding of de jure segregation may be based on actions taken, coupled with omissions made, by governmental authorities which have the natural and foreseeable consequence of causing educational segregation.\n\nHart, supra, 512 F.2d at 50.\n\nFurthermore, it is not necessary that the plaintiffs prove that the defendants' every action was discriminatory or that no positive action was ever taken by the defendants to promote integration. We are not dealing with absolutes. Isolated actions of constitutionally insignificant effect, whether of a discriminatory nature or such as to avoid or alleviate segregation, are not determinative. If fourteenth amendment rights are being denied, plaintiffs are entitled to relief. United States v. Texas Education Agency, supra, 467 F.2d at 873.\n\nIn this regard, we note the words of the Sixth Circuit in Oliver v. Michigan State Board of Education, 508 F.2d 178 (6th Cir. 1974), cert. denied, 421 U.S. 963 [95 S. Ct. 1950, 44 L. Ed. 2d 449] (1975):\n\nWhen constitutional rights are involved, the issue is seldom whether public officials have acted with evil motives or whether they have consciously plotted with bigotry in their hearts to deprive citizens of the equal protection of the laws. Rather, under the test for de jure segregation, the question is whether a purposeful pattern of segregation has manifested itself over time, despite the fact that individual official actions, considered alone, may not have been taken for segregative purposes and may not have been in themselves constitutionally invalid. . . . Benevolence of motive does not excuse segregative acts.\n\n508 F.2d at 182-83 (citations omitted).\n\nSome of the actions and events considered in this lawsuit occurred before many, or in some cases any, of the present public school children first attended school. The passage of time alone does not wipe the evidentiary slate clean, however. The Supreme Court has stated:\n\n. . . We reject any suggestion that remoteness in time has any relevance to the issue of intent. If the actions of school authorities were to any degree motivated by segregative intent and the segregation resulting from those actions continues to exist, the fact of remoteness in time certainly does not make those actions any less \"intentional.\"\n\nKeyes, supra, 413 U.S. at 210-11 [93 S. Ct. at 2698, 37 L. Ed. 2d at 564].\n\nIf the plaintiffs prove that some schools were intentionally segregated by the defendants, the court must then decide whether the plaintiffs have shown that a substantial portion of the school district was so segregated. If the plaintiffs have proved that the defendants intentionally segregated a substantial part of the school district, this \"creates a presumption that other segregated schooling within the system is not adventitious. It establishes, in other words, a prima facie case of unlawful segregative design on the part of school authorities.\" Keyes, supra, 413 U.S. at 208 [93 S. Ct. at 2697, 37 L. Ed. 2d at 563]. It is then incumbent on the defendants to prove that the other segregated schools are not the consequence of their illegal segregative actions as well. The burden so imposed on the defendants is considerable. Mere reliance on an \"allegedly logical, racially neutral\" course of action is insufficient. The Supreme Court has explicitly enunciated the standard:\n\n[The defendants'] burden is to adduce proof sufficient to support a finding that segregative intent was not among the factors that motivated their actions.\n\nKeyes, supra, 413 U.S. at 210 [93 S. Ct. at 2698, 37 L. Ed. 2d at 564]. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\" (Emphasis added).\n\nIII. BUFFALO AND ITS PUBLIC SCHOOLS\n\nBuffalo's growth pattern has been similar to many other large cites of the northeast. Although the physical boundaries of the City of Buffalo have not changed significantly since the middle of the 19th century (PX 260, Pt. II, at 1), the population did not stop growing until a century later in 1950. In the quarter century since, the City has exhibited a steady population decline, due in large part to the familiar suburban migration. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\"\n\nMany immigrants were attracted to Buffalo in the late 1800's, and the City retains strong ethnic concentrations to this day. The black population of Buffalo, negligible around the turn of the century, has grown steadily since World War I, receiving a strong impetus from the economic growth occasioned by the war industries during the 1940's. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\" As is typical of northern cities, the older central city has long been the locus of the black population, with movement slowly taking place to other areas of the city over the last two decades. Although some diffusion of black families throughout the 43 square miles of Buffalo has occurred, the number of blacks in suburban areas has been, and is, negligible.\n\nThe segregated nature of Buffalo's suburbs is glaringly evident when area public school districts are compared. The New York State Commission on the Quality, Cost and Financing of Elementary and Secondary Education reported in 1972 that\n\n[Buffalo's] surrounding suburbs are severely segregated. Of the 30 Erie County school districts, only six have over 1 per cent nonwhite students. Of these six, the only two districts with significant nonwhite student populations are Buffalo (46.6 per cent) and Lackawanna (19.2 per cent). Akron, with a sizeable Indian population, has the third highest nonwhite population, representing 16 per cent of The total.\n\n(PX 305, at 4.44). \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" (Footnotes omitted). As the City's population has dropped, the minority percentage has correspondingly increased, as shown in the following table. TABLE I POPULATION CITY OF BUFFALO YEARS TOTAL % NON-WHITE 1950 580,132 6.51960 532,759 13.81970 462,768 21.0\n\nSOURCE: PX 263, at 5; S-9. At the same time, the BPSS has recorded a similar drop in its pupil population, with an even more striking percentage increase in non-white members,14a as the following table shows. TABLE 2 BPSS STUDENT POPULATION YEARS TOTAL NON-WHITE % NON-WHITE 1966 72,963 25,486 35%1970 70,300 28,692 40.8%1973 61,060 27,949 45.8%\n\nSOURCE: PX 6, at 6.\n\nThe difference in years 1970 and 1973 is illustrative of this phenomenon -- i.e., the population, in absolute numbers, of minority public school children decreased, yet the minority percentage increased. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\"\n\nThe population drop is naturally reflected in school attendance figures. During the years 1966 through 1973, only ten of Buffalo's seventy-three elementary schools experienced an increase in enrollment. The rest noted declines ranging from negligible to severe. Total enrollment in those years dropped over 11,000, a percentage decline of approximately 23% from the January 1966 totals. Minority enrollment declined during that period by 525, while majority enrollment dropped by over 10,000 students. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\" As of the 1973-1974 school year,16a the BPSS consisted of 77 elementary schools, \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\" 4 middle and 2 junior high schools, 7 academic and 6 vocational-technical high schools. The pupil population in October 1973 was 61,060, of whom 53.3% were white, and 46.7% were non-white. (S-10). The system has never been under mandate of law to operate a dual system along racial lines. In fact, New York State enacted an anti-segregation law for public schools in 1900. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\" Nevertheless, there exists substantial racial imbalance in the public schools. In 1973, 55 out of 77 elementary schools, 5 out of 6 junior and middle schools, and 7 out of 13 high schools were from 80 to 100% majority or minority, as tables 3 through 7 demonstrate. Statistics such as these prompted Commissioner Nyquist to state in April 1972 that \"segregation [in the BPSS] is more severe now than it was seven years ago.\" [S-18(b)]. TABLE 3 ELEMENTARY SCHOOLS 80-100% MINORITY ENROLLMENT (OCT.1973)SCHOOL (GRADES) MINORITY MAJORITY TOTAL 6 (PK-6) 801 (100%) 0 (0%) 801 8 (PK-6) 777 (99.9%) 1 (0.1%) 77812 (PK-6) 230 (100%) 0 (0%) 23016 (PK-6) 178 (90%) 19 (10.0%) 19717 (PK-6) 465 (99.4%) 3 (0.6%) 46823 (K-5) 697 (91.8%) 62 (8.2%) 75931 (K-8) 828 (99.2%) 7 (0.8%) 835Build (former 32) (PK-6) 575 (99.7%) 2 (0.3%) 57735 (Special) 76 (96.2%) 3 (3.8%) 7937 (PK-8) 809 (99.9%) 1 (0.1%) 81039 (PK-6) 927 (100%) 0 (0%) 92741 (PK-6) 371 (100%) 0 (0%) 37147 (PK-6) 272 (100%) 0 (0%) 27248 (PK-5) 396 (99.7%) 1 (0.3%) 39750 (Special) 99 (100%) 0 (0%) 9953 (PK-6) 880 (99.9%) 1 (0.1%) 88159 (K-5) 566 (98.3%) 10 (1.7%) 57662 (K-7) 712 (92.5%) 58 (7.5%) 77074 (PK-6) 626 (98.9%) 7 (1.1%) 63375 (PK-6) 363 (100%) 0 (0%) 36390 (K-6) 512 (89.3%) 61 (10.7%) 57393 (K-3) 99 (100%) 0 (0%) 99SOURCE: PX6 at 13-20 (Statistics); DX 3 (Grades). TABLE 4 ELEMENTARY SCHOOLS 80-100% MAJORITY ENROLLMENT (OCT.1973)SCHOOL MINORITY MAJORITY TOTAL 11 (K-8) 43 (9.8%) 398 (90.2%) 44118 (K-6) 43 (9.8%) 395 (90.2%) 43819 (K-8) 70 (11.8%) 523 (88.2%) 59326 (K-6) 32 (7.9%) 374 (92.1%) 40627 (K-6) 4 (0.6%) 631 (99.4%) 63528 (K-6) 70 (11.8%) 522 (88.2%) 59229 (K-8) 43 (6.0%) 690 (94%) 73330 (K-6) 13 (6.8%) 177 (93.2%) 19033 (PK-6) 45 (8.7%) 471 (91.3%) 51634 (K-5) 38 (13.4%) 245 (86.6%) 28338 (PK-8) 83 (13.0%) 554 (87.0%) 63743 (K-8) 27 (2.8%) 920 (97.2%) 94745 (K-8) 83 (8.9%) 848 (91.1%) 93149 (K-5) 14 (7.2%) 179 (92.8%) 19351 (K-6) 40 (9.3%) 388 (90.7%) 42852 (K-8) 54 (7.8%) 637 (92.2%) 69160 (K-6) 13 (2.1%) 620 (97.9%) 63363 (K-8) 86 (15.5%) 469 (84.5%) 55565 (K-6) 51 (13.4%) 330 (86.6%) 38166 (K-8) 74 (10.6%) 621 (89.4%) 69567 (K-8) 44 (6.6%) 626 (93.4%) 67069 (K-8) 57 (10.6%) 479 (89.4%) 53670 (K-6) 6 (1.4%) 427 (98.6%) 43371 (K-6) 63 (18.4%) 279 (81.6%) 34272 (K-8) 9 (1.1%) 821 (98.9%) 83077 (PK-8) 114 (15.1%) 640 (84.9%) 75479 (K-4) 38 (11.9%) 282 (88.1%) 32080 (K-8) 53 (16.5%) 269 (83.5%) 32281 (K-8) 87 (12.8%) 595 (87.2%) 68283 (K-5) 3 (2.3%) 127 (97.7%) 13084 (Special) 40 (17.9%) 184 (82.1%) 22486 (K-5) 26 (8.4%) 284 (91.6%) 31088 (K-4) 4 (3.2%) 125 (96.8%) 129SOURCE: PX6, at 13-20 (Statistics); DX3 (Grades). TABLE 5 MIDDLE AND JUNIOR HIGH SCHOOLS 80-100% MINORITY-MAJORITY ENROLLMENT (OCT. 1973)SCHOOL MINORITY MAJORITY TOTAL Fillmore 690 (89.0%) 85 (11.0%) 775 Middle Clinton 846 (100%) 0 (0%) 846 Junior Genesee Humboldt 932 (90.9%) 93 (9.1%) 1025 Junior Southside 202 (15.4%) 1107 (84.6%) 1309 Junior Woodlawn 764 (99.6%) 3 (0.4%) 767 JuniorSOURCE: PX 6, at 21. TABLE 6 ACADEMIC HIGH SCHOOLS 80-100% MINORITY-MAJORITY ENROLLMENT (OCT. 1973)SCHOOL MINORITY MAJORITY TOTAL East High 1622 (99.0%) 17 (1.0%) 1639Riverside High 232 (15.1%) 1301 (84.9%) 1533South Park High 245 (12.7%) 1683 (87.3%) 1928SOURCE: PX 6, at 22. TABLE 7 VOCATIONAL-TECHNICAL HIGH SCHOOLS 80-100% MINORITY-MAJORITY ENROLLMENT (OCT. 1973)Fosdick-Masten 576 (98.1%) 11 (1.9%) 587 Hutchinson-Central Technical 223 (19.8%) 902 (80.2%) 1125 McKinley 235 (20.3%) 922 (79.7%) 1157 Seneca 222 (20.0%) 891 (80.0%) 1113\n\nSOURCE: PX 6, at 23.\n\n[SEE MAP 1 IN ORIGINAL]\n\nThe BPSS exhibits a complex combination of grade structures and feeder patterns. Elementary schools vary from prekindergarten or kindergarten through third, fourth, fifth, sixth, seventh, or eighth grades. Middle schools are fifth through eighth grades, junior high schools, seventh through ninth grades, and high schools ninth through twelfth grades. Depending on the grade structure of the individual elementary school, a child may remain in one grammar school for his complete elementary education, or progress to a second grammar school, a middle school, or a junior high school. For instance, Schools 16, 30 and 38 are all within a matter of blocks of each other on the city's near west side. A child attending School 16, a K-6 school, will proceed to Woodlawn Junior High School and then Grover Cleveland High School, while a child starting out at School 30, another K-6 school, will transfer to School 56 for seventh and eighth grades and then go to Lafayette High School, while a third child at School 38 will remain at that school from kindergarten through eighth grade and then go to Grover Cleveland High School. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\" (PX 296, at 26; Record, Vol. VIII, at 21-22).\n\nAs a general rule, \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\" pupils do not have a choice of elementary schools. They must attend the school in the district \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\" in which they live. This is also true for the junior high schools, the middle schools and the academic high schools. However, it is not true for the vocational-technical high schools, which accept students from all over the city and have no district lines.\n\nIV. THE TRIAL\n\nFor purposes of assessing the allegations of the plaintiffs, the court will analyze separately what it considers to be the major issues: East High School, the siting and districting of Woodlawn Junior High, the use of transfers, optional areas and redistricting of attendance zones, the vocationaltechnical high schools, staff segregation, the state integration mandate, and the housing segregation in Buffalo.\n\nIV-A. EAST HIGH SCHOOL\n\nThere are seven academic high schools in the BPSS. Each of these schools has its own area from which it gets its students. The policy of the Board of Education has been, at least since 1956, that students living in a certain academic high school's district must attend that high school. (S-42). Any deviation from the Board's attendance policy requires authorization from the Office of Pupil Personnel Services, and \"may only be granted for hardship, language, and voluntary integration.\" (S-42). \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" The enrollments at the academic high schools as of January 1966 and October 1973 are shown in Table 8 below. TABLE 8 ACADEMIC HIGH SCHOOL ENROLLMENTS 1966 and 1973 TOTALSCHOOLS JAN.1966 MAJORITY MINORITY Bennett 2050 1494 (72.9%) 556 (27.1%) East 1818 157 (8.6%) 1661 (91.4%) Grover Cleveland 1453 1289 (88.7%) 164 (11.3%) Kensington 1999 1959 (98%) 40 (2%) Lafayette 1522 1257 (82.6%) 265 (17.4%) Riverside 1830 1804 (98.6%) 26 (1.4%) South Park 2649 2494 (94.1%) 155 (5.9%) TOTAL OCT.1973 Bennett 1606 899 (56%) 707 (44%) East 1639 17 (1%) 1622 (99%) Grover Cleveland 1139 674 (59.2%) 465 (40.8%) Kensington 1923 1093 (56.8%) 830 (43.2%) Lafayette 1152 664 (57.6%) 488 (42.4%) Riverside 1533 1301 (84.9%) 232 (15.1%) South Park 1928 1683 (87.3%) 245 (12.7%)\n\nSOURCE: PX 6, at 22.\n\nAlthough the outer boundaries of the BPSS have remained static for many years, the individual high school district lines that govern attendance zones have been altered many times. East High School is among those schools that have been redistricted.\n\nPlaintiffs charge that through redistricting and language transfers, the defendants have increased and maintained the racial segregation at East High School. In assessing the evidence, this court is cognizant that \"what is or is not a segregated school will necessarily depend on the facts of each particular case.\" Keyes, supra, 413 U.S. at 196 [93 S. Ct. at 2691, 37 L. Ed. 2d at 556].\n\n1. REDISTRICTING\n\nThe stipulations indicate the following facts with regard to the redistricting of East High School:\n\n1. The Board in May 1954 adjusted the East district so that students residing in an optional \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\" area in the eastern sector of the district would thereafter not be given the option of attending East. The students in this optional area were \"practically all white.\" (S-151).\n\n2. Another district adjustment by the Board at this time extended the East district further south. The result of this was that some black students were required to go to East instead of the predominantly white South Park High School. (S-152).\n\n3. Three years later, in May of 1957, another redistricting for East was authorized by the Board. This changed an area \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\" then optional to Grover Cleveland, Bennett and Lafayette High Schools to East's district. Most of the students in this formerly optional area are black. (S-153).\n\n4. At that same Board meeting, graduates of School 43 were assigned to South Park High School. School 43 students were predominantly white and the school was just as close to East as to South Park. (S-154-156).\n\nThe redistricting testimony at trial was not extensive, but it did flesh out the bare bones of the stipulations. S-151 and 154-156, paragraphs one and four, supra, deal with the same area, commonly referred to as the \"Lovejoy\" or \"School 43\" area. See Map 2, infra. As of 1950, this section was part of the East High district. In July of 1951, it was declared an optional district, providing students residing in that area the choice of attending either East High on the west, or Kensington High on the north. In 1954, as paragraph one explains, the Lovejoy district was made a part of the Kensington High district. Three years later, in 1957, the students in the district were transferred to South Park High, as indicated in paragraph four, supra. Finally, in 1961, the Board reassigned this area to Kensington High. (Record, Vol. VII, at 103-105). The evidence indicates that this area has always been overwhelmingly white (PX 290; 291), and that it \"is either closer to East High School -- or at least equidistant to -- than South Park.\" (S-156).\n\n[SEE MAP 2 IN ORIGINAL]\n\nThis redistricting of East High School, which resulted in the largely white Lovejoy neighborhood being excised from the East district, must be considered in conjunction with the language transfer policy in effect from 1960-1972.\n\n2. LANGUAGE TRANSFERS\n\nThe language transfer exception was designed to allow a student to take advantage of a particular language curriculum that his district school did not offer. This special exception injects additional flexibility into an academic high school system already quite accommodating of students' language pursuits, since Board policy is to offer language courses \"in each high school if there are [sic] a sufficient number of students who express a bonafide interest in taking such language.\" (S-46). Testimony at trial indicated that the minimum number of students required by the Board is fifteen. (Record, Vol. III, at 195-96).\n\nCertain languages, such as Spanish, French and Latin, are apparently taught at all the academic high schools. Polish, Italian, Hebrew and Russian, however, the socalled \"special languages,\" are restricted to selected high schools. (PX 264, at 545). A course in Polish was taught at East High School until about 1960, but, of the seven academic high schools, only East had none of these special language courses from approximately 1960 to 1972. (S-53, 54; PX 264, at 545; Record, Vol. IV, at 75).\n\nThe evidence shows that sometime in the early 1950's East High School was predominantly white. (Record, Vol. I, at 102). Although in 1970 the East High district had become approximately 60% black (PX 264, at 547), the court takes judicial notice of the well known fact, not disputed by the defendants, that the East High School district had long been, and still was in the 1950's and 1960's, populated by substantial numbers of persons of Polish extraction. Many Polish-Americans still live there. If there was any district in the Buffalo school system where a demand for Polish language classes existed, it was the East High School district and the Board of Education was well aware of this. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\"\n\nIt is not only a clearly foreseeable and natural consequence that curtailment of the language classes at East would induce transfers to other high schools, it is obvious that this result would occur. The evidence produced at trial corroborated this. Plaintiffs proved that many East district students obtained language transfers to study one of these special languages at another public high school, usually South Park or Kensington Highs. All of these transfers had to be authorized by the Student Personnel Services Office. They caused annual headaches for that office, which was inundated with transfer requests prior to the start of each school year.\n\nAs the following testimony of the head of the Student Personnel Services indicates, this situation was made known to the Superintendent of Schools.\n\nQ. Did you at anytime recommend to the Superintendent or to the Board of Education or to anyone that the languages that these students were asking to take be offered at East High School?\n\nA. Yes, I did. In fact, we constantly did. . . . So constantly we brought to the Superintendent's attention maybe these languages should all be put into East High School.\n\nQ. When would you recall that you first made that recommendation?\n\nA. Probably every year. Probably every year.\n\nQ. Every year. Would that be every year from 1965 when you assumed your position?\n\nA. Probably. Probably, yes.\n\n(Record, Vol. III, at 201-202).\n\nThe language transfers out of East were called to the Board's and to the Superintendent's attention by others also. At a Board meeting on May 26, 1971, Superintendent Manch was specifically informed that South Park High School alone had 143 out of district students, \"generally from the East High School district,\" studying Polish and Russian. (PX 60, at 88-89). The possibility that language transfers were contributing to East's predominantly black enrollment was raised as early as 1963 in a report by the Civil Rights Commission of the United States. (PX 10, at 18). Noting that East High at that time was predominantly black, though the East district was not, the report suggested that language transfers were possibly being used by white students to transfer out of East.\n\nThe report pointed out the curious result of a 1957 adjustment in the Riverside High-Bennett High boundary. The area assigned to Riverside, previously optional between Riverside and Bennett, contained a substantial Jewish population. Shortly after this change was made, the Board of Education became aware that significant numbers of the new Riverside High students were transferring back to Bennett to take Hebrew.To avoid this, the Board instituted Hebrew classes at Riverside High School. (PX 10, at 17-18). The Board could have instituted the same policy with regard to East and the Polish language classes to avoid the transfers out of East High. That they did not is an indication that they did not want to.\n\nThe difficulty that the Board's transfer policy caused only serves to highlight the Board's attitude. When dealing with a system of seven academic high schools, it is inevitable that an action taken regarding one school's attendance policies will have a reaction on other schools. The language transfers out of East High for Polish and Russian contributed substantially to severe overcrowding at South Park High, and the Board was aware of this. (PX 60, at 64-67; 88-89). A past president of the Board, Mr. Arnold Gardner, testified that\n\nfrom time to time this [language transfers] arose at the Board. I would say it arose and received brief attention on only a few occasions. It was one of those items with which we are all familiar. It was one of those items that people mention and drop because they are embarrassed by it and from time to time it would be proposed that Polish be offered at East High School and there would be a series of knowing smiles around the table and after a moment's discussion, that would be abandoned.\n\n(Record, Vol. I, at 147).\n\nIt cannot be disputed that East is now, and has been at least since 1960, an unidentifiably black school. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\" The Board attempts to rebut the plaintiffs' allegations that the Board caused East to become predominantly black by showing that the residential tracts surrounding East have become progressively more black as the years have passed. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\" While it is certainly true that the East district population has exhibited a substantial shift from predominantly white to predominantly black, nonetheless, even in 1973 the minority district percentage was only about 60%, while East High was 99% minority -- and had been over 90% minority for at least eight years. See Table 8, supra. It is obvious to the court that more than mere demographics caused this drastic effect. In 1966 East was already the black academic high school, with a student body 91.4% minority. By comparison at that time, Bennett stood at 73% majority, Lafayette at 83% majority, Grover at 89% majority, and Kensington, Riverside and South Park High Schools all over 90% majority. Id. Almost three out of every five black academic high school students in 1966 attended East High. (PX 6, at 5). \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\"\n\nThe Board admits that the language transfer policy contributed, in some degree, to East's racial imbalance. Furthermore, the head of the Student Personnel Services admitted, both on redirect and recross examination, that he believed that in many cases the language transfers were used to avoid attending East High School. (Record, Vol. VIII, at 101, 105). He also testified that there was no procedure whereby the central school administration monitored the transferring students to check whether or not they actually attended the requested language courses. (Record, Vol. VIII, at 90-91). However, the Board denies that its language transfer policy was a substantial causative factor of East High's imbalance. The first hard statistics on the racial effect of transfers were not available until 1966. The following table shows the numbers of transfers, including language transfers, granted at East since that year. TABLE 9 TRANSFERS FROM EAST HIGH TOTAL MAJORITY TRANSFERS MINORITY TRANSFERSYEAR ENROLLMENT ENROLLMENT GRANTED ENROLLMENT GRANTED 1966 1818 180 (9.9%) 73 1638 (90.1%) 391967 1814 112 (6.2%) 109 1702 (93.8%) 741968 1599 42 (2.7%) 129 1557 (97.3%) 911969 1696 27 (1.6%) 87 1669 (98.4%) 1121970 1710 24 (1.4%) 176 1686 (98.6%) 1141971 1343 2 (.2%) 51 1341 (99.8%) 1021972 1393 23 (1.7%) 9 1370 (98.3%) 71973 1638 23 (1.4%) 2 1615 (98.6%) 6\n\nSOURCE: DX 8.\n\nThe City defendants argue:\n\nHow can such a racially imbalanced school, 90.1% black, in 1966, have been substantially affected by a policy that had no known racial impact on said school until some two years later?\n\nPost-trial Brief for City Defendants, at 22.\n\nThe court finds this logic difficult to follow. Merely because cold raw data on the racial effect of transfers was unavailable prior to 1966 does not mean that this racial effect was not discernible prior to this date. The Board was aware that language transfers could produce this effect, as shown by the Riverside-Bennett experience; it was warned that it was producing this effect in 1963; and it was obviously cognizant that East High's district contained many Polish speaking families. East was the only high school that offered no foreign languages from 1960 to 1972.\n\nA brief examination of Table 9, supra, indicates that the segregative effect of transfers out of East, including language transfers, was substantial during those years, and from all the evidence the court can infer that it was substantial prior to those years. In 1967, as Table 9 shows, 112 majority students attended East while almost as many, 109, transferred. In 1968, only 42 white students attended while 129 transferred. In 1969, 27 attended and 87 transferred; and in 1970, 24 attended while 176 transferred. Although Table 9, supra, does not indicate the percentage of transfers granted for language study, it was admitted that as of October 1972, 197 white students from East High's district were studying languages at South Park. (S-56).\n\nIn addition to what these stark numbers show in terms of an annual effect, there is a certain cumulative impact to consider, since each student who transfers can remain at the transferee school for the duration of his high school career. That there were no definite statistics available prior to 1966 does not prohibit this court from concluding, in light of all the circumstantial evidence, that the language transfer device produced a substantial adverse racial impact on East High School before 1966.\n\nOn July 6, 1972 the Board ordered that a full range of foreign languages be offered at East High, and that no more language transfers out of East be permitted. (S-58). At trial, the Board of Education introduced evidence tending to show that in 1972-73, the first school year that language transfers were ended, most of the white students who should have attended East High School did not. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\" Since these East district residents could not avoid East through the language transfer device, the Board suggests that other subterfuges, such as false addresses, were apparently devised to thwart the Board's attendance policy. The essence of the Board's defense is that nothing the Board of Education or the City could do would force white students to attend East High School. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\"\n\nIt is no excuse for the Board to say that whites shunned the school in 1972 after the Board had aided, abetted and helped to cause the attitudes that prompted this \"white flight\" from East High. Neither the Board of Education nor the City Council, nor even the Commissioner of Education can in candor deny that they had knowledge that East was becoming identifiably black throughout the late 1950's and early 1960's. The possibility that language transfer out of East was leading to East's racial imbalance was raised as early as 1962, and this problem was repeatedly called to the attention of the Board and the Superintendent of Schools. For the Board to argue that when it ended the language transfers in 1972, no effect on the racial imbalance at East High School resulted, puts its good faith in question. The language transfers encouraged the concentration of minorities in one out of the seven academic high schools.\n\nFinally, the Board argues that the stipulations which the Board agreed to and the evidence regarding the redistricting of East are so lacking in detail that they are void of evidentiary value, and that any increase in the minority population at East at the time of the redistricting could only have served to integrate that school. Even assuming that the Board is correct on the redistricting evidence, the deletion of special languages from the East curriculum in 1960 and the subsequent language transfers effectively nullified whatever integration had been achieved.\n\nThe racial impact of the language program was clearly foreseeable. In addition, and more important, the failure of the Board to amend this policy when it was obviously aware of its segregative impact is indicative that the Board intended that that segregative effect continue.\n\nIV-B. WOODLAWN JUNIOR HIGH SCHOOL\n\nThe siting and districting of Woodlawn Junior High School, hotly debated issues for nearly two decades, are alleged by plaintiffs as clear examples of purposeful racial segregation. The City defendants argue that economic and demographic considerations required the North Masten District site on Woodlawn Avenue, and that the racial makeup of the school was the inevitable result of residential patterns beyond their control. It is uncontested that the school has been nearly all black throughout its twelve-year existence. [S-24(b)].\n\nThe Masten District experienced a great influx of population during the 1950's, due in substantial part to the Ellicott District Redevelopment which resulted in the relocation of many black families in the Masten District. As a consequence, severe overcrowding of the public elementary schools in that area of the city occurred. (PX 34, at 28-29; PX 124, at 36). \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\" Consistent with a previously devised master plan for junior high schools, the decision was made to construct a junior high to alleviate the situation. (PX 32, at 537-8).\n\nSeveral sites were considered for the new school, but apparently only two were given serious consideration by the Board and the Common Council. The first was the area of Northland, Purdy and Alexander Streets; the second, on Woodlawn Avenue, was the old Offermann Stadium, the home of the City's minor league baseball team. Both of these sites are in the North Masten district. See Map 3, infra.\n\n[SEE MAP 3 IN ORIGINAL]\n\nControversy raged in 1958 over the site selection, with some citizens arguing that the Offermann Stadium-Woodlawn Avenue site would inevitably lead to an all black school.In a Board meeting December 10, 1958, concerned citizens presented their views. Among those who spoke against the Woodlawn Avenue site was Mr. Frank Caldwell, representing a committee of citizens, who urged that the school be constructed in a site conducive to an integrated facility:\n\nWe do staunchly urge that this Board . . . commence right now to accept the fact that residential segregation creates an educational problem, which must be faced by this Board.\n\n(PX 32, at 537).\n\nThe then Chairman of the Board, Paschal Rubino, stated that the Board had never considered race in its decisions, that it always considered only the needs of the City's children, and that \"frankly, some of the apprehensiveness that exists at this point by your group, has never been a consideration of this Board.\" (Id., at 537). Mr. Caldwell replied: \"That is the basis of our complaint.\" (Id.)\n\nIn addition to Superintendent Manch and Mr. Rubino, the late Councilwoman for the Masten District, Cora Maloney, and two local ward supervisors, Mr. Delmar Mitchell and Mr. F. Cecil Brown, among others, spoke in favor of the Woodlawn Avenue site. (Id. at 5383-84, 5393). These proponents of the Woodlawn Avenue site, all leaders in the black community, expressed reservations, but finally agreed for the reasons stated by Mrs. Maloney:\n\nI wish that it could be at a different place, but if it can not be at a different place than the Offermann Stadium, and the children must have education, and the children are the innocent victims because the adults have situated and located there, then I rise or fall by the children of the Masten District. (Id. at 5371-2).\n\nThe Board voted unanimously to recommend the Offermann Stadium-Woodlawn Avenue site, and the Common Council, on Mrs. Maloney's resolution, unanimously approved it. Chief among the reasons cited by the Board were demographic changes -- \"We must build schools where there are children. There is no other way you can approach it,\" (Rubino, Id., at 5374), and economic forces -- fewer families would be displaced; lost property taxes would be much less; time of construction would be considerably shorter; site acquisition costs would be lower. (PX 34, at 29).\n\nThere was evidence tending to show that this siting of the new junior high school guaranteed that it would be segregated because potential feeder schools mentioned at that time were predominantly black. But influential black leaders, like Mrs. Maloney, Mr. Mitchell and Mr. Brown, who supported the Woodlawn site, apparently were convinced that regardless of the difficulties the site presented, the possibility of an integrated school was not foreclosed. As the court's discussion of the districting of Woodlawn shows, infra, the statements of Board members and the Superintendent encouraged their belief that the school would be integrated. They also apparently considered that economic and demographic reasons were sufficiently compelling to accept the Woodlawn Avenue site.\n\nAlthough it is a close question, it is the court's opinion that this conflicting evidence is not sufficient to show racially segregative intent on the part of the City or the State defendants with respect to the siting of the Woodlawn Junior High School. As the court weighs the evidence, the siting of the school on Woodlawn Avenue was not a virtual guarantee of segregation, and it cannot be said \"that the natural, probable, and foreseeable result of public officials' action or inaction was an increase or perpetuation of public school segregation.\" Oliver v. Michigan State Board of Education, supra, 508 F.2d, at 182.\n\nHowever, the same conclusion cannot be reached with regard to the districting decision that was made six years after the siting. During the debate on the site selection for Woodlawn, the following statements were made concerning the possible configuration of the school's attendance zone:\n\nMR. RAND, a Board member:\n\nNow, that particular site [Woodlawn Avenue site] is nearer to the center of that area, which I think is made up of not just one race or one group -- it's quite an all embracing area, particularly the area stretching on the other side of Main Street, \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\" so that is another matter.\n\n(PX 32, at 5375).\n\nSUPERINTENDENT MANCH:\n\nNow, it is not unlikely -- let me say it in that way, it is not unlikely that by placing the school in the Offermann site [Woodlawn Avenue], rather than the original site proposed, we may have a more integrated situation than would have been possible with the other arrangement, simply because the school is now suggested in a place a little bit further west -- practically at Main Street, you might say. (Id., at 5378).\n\nWe have no intention of being part of any movement to create a so-called segregated school, and that we would be conscious of this and do everything possible to make it a school which would be as integrated as the schools in that particular area can be. (Id., at 5379).\n\nThe Civil Rights Commission Report in 1963 stated:\n\nDr. Manch holds out hope that Woodlawn Junior High School will be an integrated school. \"The zone will cross Main Street if I have anything to say about it,\" he declares.\n\n(PX 10, at 41).\n\n\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\"\n\nIn a June 1962 letter, \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\" Superintendent Manch had stated:\n\nA careful study precedes any establishment of new school districts or redistricting of school boundaries to be certain that the best possible pattern of integration may be effected despite the difficult problems which may be posed by housing. (PX 10, at 74).\n\nSix years after the siting decision, push came to shove, as it were. After years of theorizing and analyzing, a final decision on the new school's attendance zone had to be made. The Board provided the forum for citizens to express their opinions, and heated public discussion occurred. Several districting proposals were bandied about by various Board members, the effects of which were racial ratios ranging from almost exclusively black to a 64-36 white majority. (Record, Vol. III, at 174). In addition, an alternative plan was proposed by which Lafayette High School would be utilized for the new junior high, and the new facility on Woodlawn would be used as a high school. [S-26(c); PX 34, at 1].\n\nBoard consideration of the districting question stretched over several meetings. Among the topics discussed at those meetings was the fact that between the date of the site selection in 1958 and the Board discussion of districting in 1964, the State Board of Regents had announced its policy on integration in the public schools of New York State. (PX 28, pt. II, at 11-12).\n\nAt a Board meeting February 26, 1964, Superintendent Manch read to the Board a statement that then Commissioner of Education James Allen had made October 28, 1963:\n\nAs a matter of policy, the State Education Department believes de facto segregation to be a detriment to the provision of equal educational opportunity. The Department further fervantly [sic] hopes that local authorities will deal with the elimination of de facto segregation, that the responsibility will be accepted at the local level. . . . Therefore, if appropriate local action is not forthcoming, if adequate plans are not made and actively pursued by local authorities, the state, in faithfulness to its responsibility, will have no choice but to act to move to fill the vacuum created by inertia or postponement in the exercise of local responsibility.\n\n(PX 122, at 22-23).\n\nOne month later, referring to the Commissioner's statement, Dr. Manch told the Board members:\n\nAt no time did he [Commissioner Allen] term these statements \"mandates\" but they were interpreted as such throughout the state. Indicative of this, most of the large cities have already taken positions and acted on various proposals.\n\n(PX 124, at 36).\n\nAt the Board meeting on the 26th of March, 1964, Mr. Parlato, a Board member, submitted a written resolution that would district Woodlawn Junior High School with the result that the school would be 99% black. [PX 34; PX 124, at 31-47; S-24(b)]. Board members Wright and Nitkowski had not been informed of this resolution prior to the meeting; Dr. Manch heard about it accidentally a day previous to its submission. (Record, Vol. III, at 176; PX 34, at 26; PX 124, at 31). During discussion on the proposal, Dr. Manch advised the Board:\n\nIt is not now feasible, from the point of view of sound education and administration, in view of everything that has happened, in view of all the factors, it is not now feasible, I believe, to draw the district lines for Woodlawn in such a way as to achieve a racial balance that would be meaningful or stable. I don't think there is any middle ground in it any more. (PX 124, at 36).\n\nDr. Manch did not set out the specifics of why it was not feasible to avoid a totally segregated school. Among the factors he evidently was referring to when he stated \"in view of everything that has happened,\" were a petition with ten thousand signatures submitted to the Board in 1963, by white parents living west of the Woodlawn school site, protesting the possible inclusion of their area in the Woodlawn district [PX 264, at 646; S-26(b)(ii)], and the atmosphere of the weeks previous to March 26, which he had referred to as \"akin to panic.\" (PX 124, at 33).\n\nThe Board voted in favor of the Parlato districting scheme six to one. (PX 124, at 47). The sole dissenting vote was cast by Dr. Lydia Wright, the only black Board member, who had proposed both a districting scheme that would have avoided a segregated school and who also had supported the alternative plan involving switching Lafayette High School and the new junior high school.\n\nThe final district plan for Woodlawn Junior High did extend west of Main Street, thus encompassing predominantly white neighborhoods, but a considerable portion of the district west of Main was made an optional zone, allowing students residing there the choice of attending School 56 or Woodlawn Junior. [S-27(b)(3)]. See discussion of optional areas, Section IV-C(2), infra. The remaining portion of the Woodlawn district west of Main was not made optional, but the evidence showed that many students residing in this area (see Map 4, infra) avoided Woodlawn Junior by transferring to predominantly white schools. See discussion of transfers, Section IV-C(1), infra. The racial composition of Woodlawn Junior High School has not changed measurably in the twelve years since that vote. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\"\n\n[SEE MAP 4 IN ORIGINAL]\n\nThe evidence is overwhelming that the action of the Board, in approving the Parlato districting plan for Woodlawn Junior High, was done with full understanding that the result would be a school student body almost totally black, and that this was the desire of the Board.\n\nThis is not a case of \"mere inaction allowing a racially imbalanced school to continue.\" Hart v. Community School Board, supra, 512 F.2d, at 48. Rather it is an example of blatant segregative intent with clear segregative results. Woodlawn Junior High School was part of the Board's master plan for junior high schools throughout the City. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\" The Board was operating on a clean slate when it decided the district boundaries for this new school. The City defendants attempted to argue that once Woodlawn was constructed the resultant racial makeup was inevitable, and that the district chosen was \"tight\" and \"well defined.\" (Post-trial Brief for City Defendants, at 28). Yet, the defendants' failure even to attempt to explain away the other zoning proposals that would have avoided an all black school belies this stance. Also, the defendants' failure to call Superintendent Manch, Mr. Parlato or any of the other principal figures to the districting decision, supports the inference that their testimony would not alter the conclusion the evidence leads the court to make. The court finds that the Board willfully and intentionally caused Woodlawn Junior High School to be districted so as to be a segregated school.\n\nIV-C. TRANSFERS AND OPTIONAL AREAS\n\nThe basic attendance policy of the BPSS is rigid -- it requires each pupil to attend the school in the geographic zone in which he lives. (S-42). All schools in the system, with the exception of the vocational-technical high schools, follow this rule. (S-95). As is the case with most rules, however, there are several exceptions which allow a child to attend a school outside his geographically assigned school. The major exceptions follow.\n\n1. Special course offered -- a student is allowed to transfer to another school offering a course his own school does not feature. This is best exemplified by language transfers. See section IV-A(2) of this opinion, supra.\n\n2. Medical necessity -- physical and psychological reasons may be grounds for transfer.\n\n3. Hardship -- this exception makes allowances for families with special problems that make it difficult for the child to attend his ordinary school.\n\n4. School adjustment -- this exception apparently encompasses transfers to a different school when a child, for one reason or another, has had difficulty with teachers or other students in his original school.\n\n5. Harassment -- if the child has been the victim of physical or psychological abuse from other students, a transfer is sometimes allowed.\n\n(Record, Vol. VIII, at 27).\n\n6. Voluntary integration -- inner city students are allowed to attend peripheral schools outside their normal attendance zone.\n\n(Record, Vol. VII, at 108-109).\n\n7. Optional areas -- students residing in certain geographical areas are granted the privilege of attending a school outside their normal school district.\n\n(S-34).\n\nThe plaintiffs charge that the Board defendants have manipulated the transfer rules and optional areas to effect segregative results.\n\n1. TRANSFERS\n\nPlaintiffs put into evidence over 70 transfer requests that were granted in the years 1968-1973. (PX 51; Record, Vol. IV, at 23-46). Among the specific reasons for granting the transfer requests, as stated by school officials on the transfer forms, were fear of black children and avoidance of Woodlawn Junior High School. On many of the forms, no reason at all is stated for granting the requested transfer. Although not all of these transfers adversely affected the racial balances of the schools involved, many involved transfers out of predominantly black schools to predominantly white schools. (S-50, 51, 52, 60). It was also stipulated by the parties that, in addition to official transfers granted by the Office of Pupil Personnel Services, some principals of schools peripheral to predominantly black schools granted unofficial transfers. (S-49).\n\nBecause of the different feeder patterns and grade structures, such transfers have potentially double and triple segregative ramifications. For example, School 16 students feed into Woodlawn Junior High School. On the other hand, students attending School 30, a few blocks away, feed into School 56 for grades seven and eight, and then go to Lafayette High School. (PX 296, at 26). So, a student avoiding black School 16 by transferring to School 30 is able to also avoid the nearly all black Woodlawn Junior High.Board officials were aware that the avoidance of Woodlawn Junior High prompted some transfers. (Record, Vol. IV, at 12-13). Table 10 shows the racial makeup of three elementary schools located on Buffalo's near West Side. All three of these schools are within blocks of each other, and none is in a predominantly black residential area. TABLE 10 SCHOOL 16 MINORITY MAJORITY TOTAL 1962 149 (61%) 94 (39%) 243 1968 332 (91%) 33 (9%) 365 1973 178 (90%) 19 (10%) 197 SCHOOL 30 1962 0 (0%) 189 (100%) 189 1968 23 (9.4%) 222 (90.6%) 245 1973 13 (6.8%) 177 (93.2%) 190 SCHOOL 38 1962 12 (2.5%) 463 (97.5%) 475 1968 55 (8.2%) 616 (91.9%) 671 1973 83 (13%) 554 (87%) 637\n\nSOURCES: 1962 figures from PX 10, at 52-53;\n\n1968 figures from DX 6, at 2, 4, 6;\n\n1973 figures from PX 6, at 13-15.\n\nSchool 16's district extends one block east of Main Street, into a predominantly black area, but it also extends seven blocks west of Main Street, a predominantly white area. (Record, Vol. I, at 162; PX 1). Although School 16's district is predominantly white, the school, at least for the last decade, has been predominantly black, a situation one witness described as \"anomalous.\" (Record, Vol. I, at 164). It is stipulated that in 1972 twenty-seven students from the School 16 district were attending School 30, and fifteen from School 16's district were attending School 38. (S-51, 52). Table 11 reflects the following facts about Schools 4 and 34: School 4 is heavily minority, School 34 is even more heavily majority, and the imbalances at both schools have become more disparate since 1962. TABLE 11 SCHOOL 4 MINORITY MAJORITY TOTAL 1962 339 (47.3%) 374 (52.7%) 713 1968 516 (78.2%) 144 (21.8%) 660 1973 545 (73.2%) 199 (26.8%) 744 SCHOOL 34 1962 43 (15.6%) 232 (84.4%) 275 1968 30 (11.3%) 235 (88.7%) 265 1973 38 (13.4%) 245 (86.6%) 283\n\nSOURCES: PX 10, at 52-53; DX 6, at 1, 5; PX 6, at 13, 15.\n\nWhat the table does not show is that these two schools are in one school district, that they are a few blocks from one another, that they have the same principal, that the Board considers School 34 to be an annex to School 4, that School 34 was built in 1863, and that School 4 is so underutilized that all the students in School 34 could easily be accommodated there. (PX 47, at 2; Record, Vol. III, at 23, 25, 26, 103; PX 263, at 63).\n\nDefendants argue that this is not a case of segregative action by the Board because the two schools are separated by a railroad track and the student population at both schools very nearly mirrors the populations of the respective neighborhoods the schools serve. (Record, Vol. III, at 103, 106, 109-110). The flaw in the defendants' logic is that this argument fails to take into account that in 1970-1971, for example, 38 minority students from School 34's area were attending School 4, and 41 white students from School 4's area were attending School 34. (Record, Vol. III, at 24). According to the HEW review, the principal of the schools cited three reasons for these transfers: suspensions (an unknown number), special classes (the number is negligible), and favors granted to parents by a former principal. (PX 264, at 586). At one time, the Board did attempt to shut down the antiquated School 34 and consolidate the schools, but area residents protested and the Board demurred. (PX 264, at 586). It is, of course, no constitutional violation for the Board to ignore its own sound economic or educational determination and continue to operate a rundown facility. But the Board cannot maintain a segregated facility in order to placate the local community. Spangler v. Pasadena City Board of Education, 311 F. Supp. 501, 523 (C.D.Calif.1970).\n\nDefendants attempt to rebut the transfer evidence presented by the plaintiffs by showing that the transfer policies predate problems of racial imbalance and were instituted without any racial motives, and that in any case any segregative effects from the transfers granted were not substantial. The defendants' contentions completely miss the mark. There is no allegation that the transfer policies per se are denying plaintiffs their rights. Any organization must have flexibility, and a school system of 90 schools and over 60,000 students must, of course, allow for special circumstances. Valid transfers are not attacked. What is attacked is the knowing granting of transfers, for specious or blatantly discriminatory reasons, that increases the segregation that characterizes many schools in Buffalo. The defendants cannot deny what their own records show and what their own Director of Student Personnel admits -- transfers were granted white students to avoid attending predominantly black schools.\n\nThe transfer policy not only increased segregation, which when isolated as separate transfers might appear insubstantial, but it also increased the proliferating tendency on the part of both school administrators and the public at large to identify certain schools as black. It is one thing to argue that unauthorized and surreptitious transfers, granted by certain principals, cannot be said to have substantially harmed the plaintiffs. It is quite a different matter when the individuals officially responsible for such matters authorize such transfers. Like a clever photographer who uses an airbrush to eliminate what he does not want in a picture, the defendants try to haze over what the evidence clearly shows. But we are not dealing with art here, and the Constitution does not permit this court to avoid the evidence, however unsightly.\n\nThe combined effect of official and unofficial transfers, including the language transfers detailed in the court's discussion of East High School, supra, was an annual total of 2,000-4,000 white students attending schools outside the zone in which they live,\n\nthereby contributing to the higher percentage of black students in various schools, including Schools 54, 16, Fillmore Middle, Genesee-Humboldt [Junior High], Woodlawn [Junior], East High School, all of which have black student populations of at least sixty percent. (S-60).\n\n2. OPTIONAL AREAS\n\nThe stipulated materials show that optional areas, which allow students to attend a school outside of their normal attendance zone, existed in the following school districts:\n\n1. An area involving Schools 56, 30, 16 and 17. Schools 56 and 30 are heavily white, while Schools 16 and 17 are predominantly black. The optional area, located in School 17's district, allowed students living in that area to avoid School 17 in favor of one of the other three schools. [S-35(a)].\n\n2. An area involving Schools 54, 74 and 17. School 54 was a majority white school until recent years. This optional area, also located in School 17's district, allowed students to avoid 17 by attending 54 or 74. [S-35(a)].\n\n3. An area involving Schools 31 and 40. Students in the overwhelmingly white optional area, located in School 31's district, could attend 40, a white school, in favor of School 31, a predominantly black school. This option ended in 1965 when the area was put in the School 57 district. School 57 at that time was a predominantly white school. [S-35(b)].\n\n4. An area involving Schools 40 and 75. Students in this area, in the School 40 zone, could attend either 40, majority white, or 75, almost totally black. [S-35(c)].\n\n5. A portion of the Woodlawn Junior High School district, comprising the area bounded by Delaware Avenue, Main, West Ferry and West Delavan Streets, was made optional in 1964 when the school was originally districted. Students residing in that predominantly white area could attend either School 56 (which feeds into Lafayette High School) or Schools 16 or 17 (which feed into Woodlawn Junior High School). [S-35(d); S-27(b)(3)].\n\n6. All district boundary streets were optional zones, allowing residents of those streets the options of attending either of the contiguous district schools. [S-35(f)].\n\nIt is not denied that these optional zones enabled some white students living in these zones to avoid the schools they would normally attend in favor of predominantly white schools. (S-38). Nor is it denied that the City defendants were fully cognizant of the detrimental racial result of these options long before this policy was abrogated. (S-36, 40; see PX 10, at 23-27). The parties have agreed that\n\nmaintenance of the optional areas has contributed to racial separation and isolation in the Buffalo public school system. (S-41).\n\nAny student, whether black or white, who resided in an optional district could take advantage of the option. The evidence showed, however, that the populations of the optional areas were usually predominantly white. (Record, Vol. III, at 70).\n\nA vivid example of the egregious segregative effect these optional areas could produce is School 17. This school is located just west of Main Street, with its district lines encompassing an area to the east and to the west of Main. In 1962, according to the United States Civil Rights Commission Report, the eastern section of School 17's attendance zone was approximately 80% black, the segment on the west about 95% white, yet even at that time School 17's enrollment was 98% black. (PX 10, at 14). The optional area, consisting of the western, or white, portion of 17's district, provided a convenient alternative for white students. School 17 remains nearly all black today. See Table 3, supra.\n\nDid the School Board intend this segregative result? We must conclude that it did. If the Board was not fully aware of the problems caused by optional areas, and School 17's optional in particular, before the anomalous racial balance of School 17 was cited in the United States Civil Rights Commission Report in 1963 (PX 10, at 14), it was certainly aware of it after the Report was published. The report noted that \"the continued existence of the option [area] was thought to be an example of the school authorities' unwillingness to recognize the segregative effect of their policies.\" (Id., at 14). Most of these optional areas remained in existence for another decade, and each year students living in an optional zone were allowed to exercise their option with harmful results to the racial balance of the schools involved. The segregative results of the optional areas policy were, under the Hart test, clearly foreseeable. Hart, supra, 512 F.2d at 50.\n\nThe defendants' witness, Mr. Leonard Testa, an employee of the Board of Education, testified that high school optional districts were designed to make the system more flexible in the face of population shifts, but these high school optionals were abolished in 1957. (Record, Vol. VII, at 101-102). No rational reason for the remaining optional areas, involving grammar schools and Woodlawn Junior High, was advanced by the defendants. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\" The 1963 Civil Rights Commission Report ascribed their origin to \"tradition.\" With regard to the failure of the Board to end the optionals, the report noted:\n\nTradition and inertia are powerful forces in our society. They seem a weak excuse, however, for inaction.\n\n(PX 10, at 27).\n\nIn 1973, after the detrimental effect of the optional zones was again called to the Board's attention, this time by HEW, they were abolished. (S-34; Record, Vol. III, at 43-44).\n\nThat the defendants abolished the optional districts, after HEW notified Superintendent Manch that their maintenance would be considered a violation, does not remove the matter from this lawsuit. The segregative results that these optional areas helped to cause remain today. Therefore, the Board actions with respect to this policy remain probative of the Board's segregative intent vel non. Keyes, supra, 413 U.S., at 210-211 [93 S. Ct. at 2698, 37 L. Ed. 2d at 564]. In addition, it appears that the optional area in the western portion of Woodlawn Junior High School's district remains today. This optional area, instituted in 1964 when the Board was fully aware of the detrimental racial effect such optionals could produce, effectively destroyed any chance that Woodlawn Junior High would have a substantial number of white students. See section IV-B of this opinion, supra.\n\nThe court concludes that the Board's transfer and optional areas policies were substantial contributing factors to the segregation at all levels of the BPSS, and that this segregative effect was clearly foreseeable by the Board. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\" The Board nevertheless deliberately continued to allow new transfers and optional movements every year until 1972, resulting in continued and increased segregation.\n\nIV-D. VOCATIONAL-TECHNICAL HIGH SCHOOLS\n\nThe six vocational-technical high schools of the BPSS have no set attendance areas. Unlike all the other schools in the system, the general rule is that any child can attend any of these schools, depending only on the space available and the individual student's ability to meet the scholastic qualifications. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\" Contrary to the situation in many school systems, these schools are considered of high quality. (S-95). Plaintiffs allege that the Board discriminated against minority applicants to several vocational and technical high schools through a selective admissions process which had the effect of screening out minority students.\n\nPrior to 1972, admissions criteria consisted of elementary school grades, a personal interview, and sometimes an additional test. At Hutchinson-Central Technical High School [Hutch Tech], an additional entrance exam was always required. Mr. Gardner, the former Board president, testified that in 1971 he concluded that \"the policies of admissions to vocational and technical schools were being operated, to the Board's knowledge, in a manner which was discriminatory against black applicants.\" (Record, Vol. II, at 105). Mr. Gardner cited statistics (Record, Vol. II, at 106-110) that seemed to show that it was much more difficult for blacks to be admitted to McKinley, Seneca and Hutch Tech (which, in 1971, were 83.0, 82.5 and 85.1% majority, respectively) than Burgard, Emerson or Fosdick-Masten High Schools (then 41.7, 45.2 and 94% minority, respectively). (PX 7, at 21). The result was that \"regardless of what the [Board's official] policy was, the system was, for some reason, operating as to make it more difficult for a black with a comparable record to be admitted to certain schools than for a white.\" (Record, Vol. II, at 112). Mr. Gardner's testimony was corroborated by the HEW survey of the BPSS. (Record, Vol. III, at 50-54).\n\nIn June of 1971, a committee was formed by the Board to investigate the admissions procedure for the vocational and technical schools. (PX 67). In February of 1972, on a recommendation of this committee, the procedures were revised so that admissions interviews and entrance tests would no longer be used at the vocational and technical high schools, except at Hutch Tech, where a revised entrance test would be used. (PX 74). The committee's report noted that\n\neffort will be made to increase minority group representation in vocational and technical high schools on a fair and equitable basis to insure all students the right to an education based on needs and ability.\n\n(PX 74, at 3).\n\nAs the parties agreed in the stipulation, \"such changes [in admissions procedures] have not significantly improved the racial isolation in the Buffalo vocational schools\" [S-98(b)], and therefore the Board's revision of the discriminatory admissions procedures does not eliminate this area from our consideration. As we have pointed out before,\n\nIf the actions of school authorities were to any degree motivated by segregative intent and the segregation resulting from those actions continues to exist, the fact of remoteness in time certainly does not make those actions any less \"intentional.\" Keyes, supra, 413 U.S., at 210-211 [93 S. Ct. at 2698, 37 L. Ed. 2d at 564].\n\nThe Board does not deny that admissions for minority students at McKinley, Seneca and Hutch Tech were discriminatorily restricted, although it argues that the numbers involved are insignificant. (Post-trial Brief for City Defendants, at 26).\n\nTable 12, infra, shows that the numbers here are not insignificant. McKinley, Seneca and Hutch Tech are all in the 80% majority range, while Burgard and Emerson are approximately 46% and 44% minority. Fosdick is 98% minority. Given the substantial difference in enrollments of minorities at the two groups of schools, and given defendant Board's admission of discriminatory admissions policies at the predominantly white schools, it is not enough for the Board to say that this is a de minimis situation. In the Supreme Court's words, the Board has not shown that \"a lesser degree of segregated schooling in the [vocational schools] would not have resulted even if the Board had not acted as it did.\" Keyes, supra, 413 U.S., at 211 [93 S. Ct. at 2698, 37 L. Ed. 2d at 564].\n\nFosdick-Masten Vocational School is the only all-female vocational high school in the BPSS. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\" Described by one witness as a \"step-child\" of the Board (Record, Vol. II, at 127), it has become increasingly more segregated since 1960. (PX 264, at 691; PX 6, at 23). As long ago as 1968, the Board planned to replace it (PX 164), and from 1970-1974, the Board allowed the school to linger on administrative death-row under the condemnation of urban renewal. (Record, Vol. II, at 127). Fosdick-Masten was given a sudden reprieve when plans for the new East Side High School, which was to have absorbed the programs at Fosdick, were eliminated in the City's 1974-75 budget. See section IV-F(4)(b) of this opinion, infra. The attendance figures for September 1973 and 1974, and the estimated capacities for each of the vocational-technical schools are presented in Table 12: TABLE 12 VOCATIONAL HIGH SCHOOLS CAPACITIES AND ENROLLMENTS 1974 CAPACITY 1973 SEPT. 1973 1974 SEPT.SCHOOL ESTIMATE ENROLLMENT MINORITY % ENROLLMENT Emerson 640 554 44% 625 FosdickMasten 840 595 98.1% 626 Hutch Tech 1200 1157 19.8% 1172 McKinley 1160 1176 20.3% 1132 Seneca 1160 1166 20.0% 1157\n\nSOURCE: DX 21; PX 6, at 23. (1974 Minority % not in evidence).\n\nThe Board attempts to absolve itself from any involvement in Fosdick's 98% minority enrollment by reiterating that the vocational-technical schools do not have any restricted attendance zone and that attendance at the schools depends on the choice of the individual student. But the Board does not act in a vacuum, and the actions it takes with respect to admissions at one vocational school will necessarily be felt at another. All the vocational-technical schools are close to full enrollment except Fosdick-Masten. See Table 12, supra. If admissions at Hutch Tech, McKinley and Seneca were non-discriminatory, and the number of blacks at these schools increased, the enrollments at the other vocational schools would necessarily be affected.\n\nThe court intimates no opinion on whether or not the revised policy on admissions implemented in 1972 (PX 74) is a sufficient answer to the segregative actions that occurred prior to 1972. All the court states is that, on the evidence before it, the discriminatory actions of the Board with regard to admissions at vocational-technical high schools had caused segregated conditions to exist at a significant number of those schools, and that, at the time this case was tried, these conditions continued to exist.\n\nIV-E. STAFF As of 1970, the population of the City of Buffalo was 21% non-white. The numbers and percentages of non-white staff members of the BPSS, for the years 1967 to 1973, are presented in the following table. TABLE 13 BPSS MINORITY STAFF 1967-68 1968-69 1969-70 Principal 1 (1.2%) 1 (1.2%) 3 (3.6%)Ass't. Principal 6 (6.8%) 6 (6.3%) 6 (6.4%)Other Staff* 357 (10.0%) 367 (10.6%) 374 (11.1%) 1970-71 1971-72 1972-73 Principal 5 (6.0%) 6 (7.2%) 13 (15.1%)Ass't. Principal 7 (7.6%) 7 (7.9%) 4 (4.8%)Other Staff 352 (10.0%) 369 (10.2%) 413 (11.4%)\n\nSOURCE: PX 13.\n\nThe plaintiffs allege that the assignment of these under-represented black teachers and principals generally to predominantly black schools, and the failure to recruit significant numbers of new minority teachers are further segregative acts and refusals to act by the Board of Education.\n\n1. STAFF ASSIGNMENTS\n\nThe information in the following paragraphs, taken from the stipulations (S-20), indicates the extent of staff segregation in 1970 and 1973 in the BPSS.\n\nIn 1970, fifteen elementary schools in the 85-100 percent majority range had no black teachers, while 63.3 percent of the black elementary teachers were concentrated in fifteen predominantly black schools. In 1973, nine elementary schools that were 85-100 percent white were without a single black teacher, and 57.6 percent of the non-white elementary teachers were assigned to fourteen predominantly black schools. The special elementary schools exhibited similar figures. In 1970, 41.6 percent of the faculty at the three predominantly minority special schools were non-white, while at the other three special schools only 5.6 percent of the teachers were non-white. In 1973, 28 percent of the teachers at the predominantly black special schools were minority; the average percentage of non-white teachers at the other four special schools was 3.1 percent.\n\nThe middle and junior high schools' staffing was similar. In 1970, Woodlawn Junior and Clinton Junior Highs, virtually 100 percent black, had minority teacher percentages of 25.9 and 10.9 percent respectively, while the predominantly white middle and junior highs had very few non-white staff. In 1973, the non-white faculty percentage at the two nearly all black schools averaged 28.7 percent; the comparable percentage at the other four schools was 8 percent.\n\nIn the academic high schools, 39 percent of all minority academic high school teachers in 1970 were assigned to East High, where they comprised 21.4 percent of the East faculty. The non-white teachers at the remaining six academic high schools ranged in representation from 3.7 to 12.9 percent of the individual school's staff. Three years later, 47.2 percent of the minority academic high school teachers in the BPSS were assigned to East. The East High minority teacher percentage was 32 percent, while the corresponding figures at the other six academic highs were between 2.1 and 9.7 percent.\n\nThe same situation existed in the vocational-technical high schools, where in 1970 the nearly all black Fosdick-Masten High had a non-white teacher percentage of 16.7 percent. Of the other five vocational-technical highs, none had a faculty of more than 2.5 percent minority. In 1973, the Fosdick-Masten faculty was 23 percent minority, while the remaining five vocational high school faculties ranged from 1.6 to 6 percent minority.\n\nThis concentration of black staff in predominantly black schools dates back at least to 1960. (PX 264, at 690-707). The evidence at trial also showed that black administrators were disproportionately over-represented at black schools. In 1970, each of the four minority principals and each of the seven minority assistant principals were assigned to schools over 98% black. (PX 264, at 718). In 1973, there were fourteen non-white principals; thirteen headed predominantly non-white schools. [S-20(d)(ii)].\n\nThe importance of the staff issue is accentuated in this particular case because of its unique position vis-a-vis the other charges brought by the plaintiffs. The defendants cannot argue, as they have with respect to student segregation in the schools, that the fortuitous combination of residential segregation and a racially neutral neighborhood school policy combined to segregate the teaching staff of the BPSS.\n\nIn Swann v. Charlotte-Mecklenburg Board of Education, 402 U.S. 1 [91 S. Ct. 1267, 28 L. Ed. 2d 554] (1971), the Supreme Court noted that\n\nexisting policy and practice with regard to faculty [and] staff . . . [are] among the most important indicia of a segregated system. Independent of student assignment, where it is possible to identify a \"white school\" or a \"Negro school\" simply by reference to the racial composition of teachers and staff, . . . a prima facie case of violation of substantive constitutional rights under the Equal Protection Clause is shown.\n\n402 U.S. at 18 [91 S. Ct. at 1277, 28 L. Ed. 2d at 568]. (Citation omitted).\n\nEssentially the Board does not deny what the statistics detailed supra indicate -- significant numbers of teachers and administrative personnel are assigned to schools under two racial criteria, the race of the teachers or the administrative personnel, and the racial makeup of the student population at the schools. Mr. Eugene Reville, Dr. Manch's successor as Superintendent of the Buffalo Public Schools, who was Associate Superintendent for Instructional Services at the time of the trial, testified that reassignments had been made to achieve a better racial balance in the school staffs. (Record, Vol. VII, at 192-93). Some of this ameliorative effort was admittedly done under the coercion of a threatened fund cutoff from the Department of HEW. (Record, Vol. VII, at 164-167). HEW had singled out three elementary schools with heavy black teacher concentrations, and nine elementary schools with no black teachers, and demanded that this situation be remedied. The Board's response was to lower the percentages of minority teachers at the three predominantly black schools and to assign black teachers to three of the nine previously all white staffs. Mr. Reville testified:\n\nI think very soon we will get a fourth [black teacher] into the nine schools and this certainly isn't integrating the staffs, but we are moving in that direction.\n\n(Record, Vol. VII, at 166-167).\n\n(Emphasis added).\n\nAlthough it has acted under pressure from HEW to improve the staff racial balance, it is the contention of Superintendent Reville that the policy of teacher assignments based on racial criteria has a sound educational rationale. As Mr. Reville explained it, given the racial imbalances characterizing the BPSS, it is his belief that black teachers and administrators should be assigned to the predominantly black schools because of the need of black students for role models and because the black teachers and administrators have greater understanding of the black community. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\"\n\nIt is thus plainly admitted that the Board has purposely followed a policy that has segregated, and was intended to segregate, the teacher and administrative staffs in the Buffalo public schools. Whether the Board's excuse for this action, to provide black role models for black students, is the real motivation behind the staffing according to race, is legally irrelevant. Whether desired by the majority or the minority, whether the motive be evil or benign, racial segregation in the public schools cannot withstand the proscriptions of the fourteenth amendment. Cooper v. Aaron, 358 U.S. 1 [78 S. Ct. 1401, 3 L. Ed. 2d 5] (1958); Morgan v. Hennigan, 379 F. Supp. 410, 461 (D.Mass.1974), aff'd sub nom. Morgan v. Kerrigan, 509 F.2d 580 (1st Cir. 1974), cert. denied, 421 U.S. 963 [95 S. Ct. 1950, 44 L. Ed. 2d 449] (1975).\n\nDefendant Board of Education's theory, if carried to its logical conclusion, supports the complete separation of the races in public schools. One of the premises of Brown, and the many cases that have followed, is simply that segregation is harmful for both black and white children, and ultimately divisive and destructive for society. It is not contended by this court that minority role models are not important for minority students. Racial and ethnic pride has its value. But, in the constitutional scheme, a higher value in the hierarchy is integration. Integration, and the understanding it fosters, will provide both black and white role models for both black and white children. See United States v. School District of Omaha, 521 F.2d 530, 537-38 (8th Cir. 1975), cert. denied, 423 U.S. 946 [96 S. Ct. 361, 46 L. Ed. 2d 280], 44 U.S.L.W. 3280 (U.S. Nov. 11, 1975), in which the court, faced with the same role model rationale, stated inter alia that\n\nsuch a belief -- if truly held -- reinforces rather than undercuts the presumption of segregative intent with respect to students, since it would logically suggest herding black students into their own schools where they could be taught by their proper black role models. The defendants are thus hoist by their own petard.\n\n521 F.2d at 538-39, n. 14.\n\n2. STAFF RECRUITING\n\nAs we have already pointed out, the Buffalo population, according to the 1970 census, was about 21% non-white, while the public school population in Buffalo in October 1973 was approximately 47% non-white. (S-9, 10).\n\nThe non-white teacher population, as indicated by Table 13, supra, was only 11.4% in 1972-73 and had not increased significantly since 1967-68. In fact, the evidence showed that the minority teacher percentage stood at 11% in 1965 (Record, Vol. III, at 29-30), and was estimated to be at just under 10% in 1962. (PX 10, at 19). Plaintiffs charge that these statistics are proof that the Board's recruitment practices discriminate against minority groups. At trial, they cited the failure, until 1974, to give teacher exams at recruitment locations, failure to advertise in a direct and intensified manner for minority applicants, and failure to make use of civil rights organizations as contacts or liaisons with the potential minority applicants. [S-22(e)]. Mr. Gilbert Francis, who conducted the HEW review of the BPSS, testified for the plaintiffs that the efforts of the BPSS to enlist added minority teachers \"in many school districts . . . would be considered as properly inadequate.\" (Record, Vol. III, at 33-34).\n\nThe Board, through Mr. James Connors, Associate Superintendent for Personnel for the BPSS, detailed its attempts to hire additional minority teachers. He explained that college campuses throughout the eastern half of the United States were visited and that \"one of the main aims, particularly in the last five years, was to contact colleges and universities where there was a large black enrollment, to try to attract minority teachers to the Buffalo School System.\" (Record, Vol. IX, at 47-48). Notwithstanding these efforts, he said, 95% of Buffalo's public school teachers were hired from Western New York campuses. (Id., at 48). Mr. Connors stated that there were several obstacles his program stumbled against, including the tendency of recent graduates to teach in the area they attended school, competition with government, private industry and other school systems for minority applicants, and New York Education Law, ยง 2573 (McKinney's 1970), which requires only Buffalo and New York City to give a licensing exam for teachers. (Record, Vol. IX, at 50-56). This test requirement of ยง 2573 is additional to state certification, which is the sole requisite in all other school districts in New York State. (Id., at 54-55). \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\"\n\nThe recruitment efforts of the Board for the four schools years 1967-70 are laid out in the HEW compliance review (PX 264, at 679-685). The report reads in part:\n\nThe charts [of recruitment data] reveal that there has been no significant increase in hiring of minority group teachers through the increased recruitment efforts of the school district. Visits to the predominantly black colleges have not produced any more black teachers than had been coming from those colleges in the years before the recruitment visits began.\n\n(Id., at 684).\n\nMr. Connors' testimony indicated that the same analysis could be made for the years 1970-74.\n\nSome courts have held that such figures, as shown in Table 13, supra, themselves may constitute prima facie evidence of intentional segregation. See Crockett v. Green, 388 F. Supp. 912, 917 (E.D.Wis.1975), where the court stated:\n\nA substantial disparity between the proportion of minorities in the general population and the proportion in a specific job classification is sufficient to establish a prima facie case of discrimination.\n\nSee also United States v. Lathers International Local 46, 471 F.2d 408, 414 n. 11 (2d Cir. 1973), cert. denied, 412 U.S. 939 [93 S. Ct. 2773, 37 L. Ed. 2d 398] (1973). Though the Board did detail its efforts to improve minority staff hiring, the results were admittedly dismal. When compared to the moderate improvement in the minority percentage of principals and assistant principals from 1967 to 1973, the static underrepresentation of minority teachers is evidence of the Board's unwillingness to effect a similar change in the BPSS's teaching staff.\n\nAs Chief Judge Brown of the Fifth Circuit has stated, \"figures speak and when they do, Courts listen . . ..\" Brooks v. Beto, 366 F.2d 1, 9 (5th Cir. 1966), cert. denied, 386 U.S. 975 [87 S. Ct. 1169, 18 L. Ed. 2d 135] (1967). The Supreme Court has also indicated the persuasiveness of statistics. In Hernandez v. Texas, 347 U.S. 475 [74 S. Ct. 667, 98 L. Ed. 866] (1954), the petitioner charged that citizens of Mexican descent were systematically excluded from the jury roles. The Court stated that\n\ncircumstances or chance may well dictate that no persons in a certain class will serve on a particular jury or during some particular period. But it taxes our credulity to say that mere chance resulted in there being no members of this class among the over six thousand jurors called in the past 25 years. The result bespeaks discrimination, whether or not it was a conscious decision on the part of any individual jury commissioner.\n\nHernandez v. Texas, supra, 347 U.S., at 482 [74 S. Ct. at 672, 98 L. Ed. at 872].\n\nWe feel constrained to say that this court's credulity is also taxed by the failure of the Board to increase the minority teacher percentage, in any meaningful amount, in over ten years' time.\n\nIV-F. THE STATE INTEGRATION MANDATE\n\nThe Board of Education \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\" of the City of Buffalo has direct control over the BPSS, but its powers are limited in several fundamental respects. It is subject to State control by the Board of Regents and the State Commissioner of Education on matters of education and educational policy, as discussed infra. It is also totally dependent on the City Council and the State for its financial requirements. \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\" Any capital improvement or other financially significant program conceived by the Board is destined to be stillborn if the Common Council denies the necessary funding.\n\nThe Board of Education's actions with respect to the siting and districting of Woodlawn Junior High School, the language transfer program at East High School, its general transfer and optional areas policies, its admissions procedures for vocational-technical schools, and its minority staffing and recruitment measures have already been discussed. A thorough study of Board action since the 1950's convinces this court that the already proven allegations of segregative actions and omissions are unfortunately not isolated incidents. The Board's course of action for the last two decades, and more specifically since 1965, has been consistently dilatory, evasive and at times obstructionist. Though there are some clear instances of positive Board action to integrate the BPSS, these actions were consistently taken under pressure and were inevitably designed to see the Board through the immediate crisis and to stall more extensive and effective efforts.\n\nThe actions of the City Council were very similar. Whenever the Board of Education was forced to implement integration plans, even if quite modest, the City Council quickly shut off the money supply or enacted an ordinance that would effectively negate the Board's actions. And, like the Board, if the City Council were forced to act, it would always find the route of least possible integrative consequence, hoping to stall until another day any meaningful integration.\n\nBut however much the Board of Education or the City Council procrastinated or wavered, an equal share of the blame for the segregation in the BPSS must be attributed to the State defendants. The Board of Regents and the Commissioner of Education have the central responsibility for education in New York State. They have the tools necessary to effectuate the integration policy they devised and to enforce the law they were clearly aware of. The State defendants shirked their responsibility under the laws of New York State and the Constitution, and in so doing encouraged the City defendants to continue their own segregative actions. They, like the City defendants, must be held accountable.\n\n1. NEW YORK STATE EDUCATION LAW\n\nIn New York State, full power over education is constitutionally vested in the State \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\" and specifically in the Department of Education, which \"is charged with the general management and supervision of all public schools and all of the educational work of the state.\" New York Education Law, ยง 101 (McKinney's 1969). The governing body of the University of the State of New York, the corporation formed in 1784 to charter and control schools in the State, is the defendant Board of Regents. New York Education Law, ยงยง 201, 202 (McKinney's 1969; Supp.1976). The Board of Regents is the statutory head of the Department of Education, and the Commissioner of Education, who serves at the pleasure of the Board of Regents, is the chief administrative officer of the department. New York Education Law, ยงยง 101, 303 (McKinney's 1969). The powers granted to the Commissioner under New York State statutes are extensive. In addition to the \"power and . . . duty\" to enforce statutes \"pertaining to the school system of the state or any part thereof or to any school district or city,\" and \"the power and authority to likewise enforce any rule or direction of the regents\" [New York Education Law ยง 308 (McKinney's 1969)], the Commissioner is also granted judicial authority to hear and decide appeals from persons believing themselves aggrieved by actions of any school officials. In such appeals, the Commissioner's decision \"shall be final and conclusive, and not subject to question or review in any place or court whatever.\" New York Education Law, ยง 310 (McKinney's 1969). \u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\"\n\nAs broad as these specific grants of authority are, the law provides for expansion of the Commissioner's legal clout:\n\nThe regents may adopt rules conferring and imposing upon the commissioner of education such additional powers and duties as may be required for the effective administration of the department and of the state system of education. New York Education Law, ยง 301 (McKinney's 1969).\n\n2. THE REGENTS' INTEGRATION POLICY\n\nThe actions of both the State Regents and the Commissioner of Education over the past two decades, and particularly since 1965, weave a saga of much talk and insufficient action, at least as far as the BPSS is concerned. As early as 1960, the Regents issued a policy statement urging the desegregation of New York State's public schools. (PX 28, Pt. II, at 11-12). Commissioner Allen, in 1963, stated:\n\nA special responsibility rests upon educators in this period. Not only must we act firmly and with all possible speed to eliminate segregation, de jure or de facto, but we must also give renewed emphasis to the teaching of the principles of equal rights and freedom that motivates our actions.\n\n(Id., at 10-11).\n\nIn 1969, a report prepared at the request of the Board of Regents and the Commissioner of Education entitled \"Racial and Social Class Isolation in the Schools\" exuberantly claimed that \"since 1900, the political and educational leadership in New York State had reacted positively in attempting to eliminate the inequalities resulting from de facto segregation.\" (Id., at 7). Unfortunately action, in some instances, has not matched rhetoric.\n\nIn 1963, the Commissioner requested all school boards to notify the State Education Department of those schools in their systems having a black enrollment exceeding 50%. \u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\" (PX 304, at 2). Guidelines for desegregation were drawn up, with primary emphasis on local control and local action to effect desegregation. (PX 304). Included in the guidelines were the following statements:\n\n4. . . . In establishing school attendance areas one of the objectives should be to create in each school, a student body that will represent as nearly as possible a cross-section of the population of the entire school district, but with due consideration also for other important educational criteria including such practical matters as the distance children must travel from home to school.\n\n5. A \"neighborhood school\" offers important educational values which should not be overlooked. . . .\n\n6. When a \"neighborhood school\" becomes improperly exclusive in fact or in spirit, when it is viewed as being reserved for certain community groups, or when its effect is to create or continue a ghetto type situation it does not serve the purposes of democratic education.\n\n(PX 304, Guiding Principles for Dealing with De Facto Segregation in Public Schools).\n\nAlmost immediately, the Regents and the Commissioner of Education were put to the test in Buffalo. In the words of the Chairman of the State Commission on the Quality, Cost and Financing of Elementary and Secondary Education, \"great problems of life require endless difficult reappraisals.\" (PX 305, at v). Unfortunately, the Commissioner of Education and the Regents at times stressed the \"endless\" and failed to reach the \"difficult reappraisals.\"\n\n3. THE YERBY DIXON APPEAL\n\nAfter the districting of Woodlawn Junior High School in 1964, several Buffalo parents, on behalf of their school children, took an appeal to the Commissioner of Education charging that the BPSS was racially imbalanced, that the Board of Education refused to alleviate the imbalance, and that blacks were discriminated against in the recruitment and distribution of teachers. On February 15, 1965, the Commissioner held for the plaintiffs on their first two allegations and stated:\n\nI hold that in developing its pupil assignment policies and in planning for new school buildings, it is incumbent upon a board of education to take into account the continued existence or potential creation of a school populated entirely, or largely, by Negro pupils.\n\nYerby Dixon Appeal, 4 Ed.Dept.Rep. 115, 117 (1965).\n\nThe Commissioner retained jurisdiction over the appeal, \"pending the adoption by the Buffalo Board of Education of a plan for mitigating the problem of racial imbalance which meets with my approval.\" 4 Ed.Dept.Rep., at 118. The Board did not appeal the Commissioner's ruling.\n\nAt the time of Commissioner Nyquist's testimony in this lawsuit, ten and one-half years after Commissioner Allen's decision in the Yerby Dixon Appeal, the Commissioner still retained jurisdiction over the appeal, and still was not satisfied with the actions of the Buffalo Board of Education. Put more bluntly, in the words of the parties to this lawsuit,\n\nThe Commissioner is aware that the Buffalo Board has done virtually nothing to enforce the order of February 15, 1965 through June 30, 1974, when an elected board took office. The Commissioner has no evidence that the newly-elected Board has complied or is planning to comply with the order.\n\n(S-137).\n\nThis court does not quarrel with the initial decision to defer to local authorities to solve what is admittedly a complex and demanding situation. Chief Justice Burger has suggested that \"local autonomy has long been thought essential both to the maintenance of community concern and support for public schools and to quality of the educational process.\" Milliken v. Bradley, 418 U.S. 717, 741-42 [94 S. Ct. 3112, 3125, 41 L. Ed. 2d 1069, 1089] (1974). Both the Commissioner and the Regents acknowledge this concept. (PX 304, at 2). But, when effective local action is not forthcoming, and no reasonable person \u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\" could expect that it will be forthcoming, and repeated attempts at cajoling, pleading and coercing the local authorities into action have failed, there comes a time when those individuals with both the power and responsibility to act must assert themselves. Deference to local authorities is not an absolute and binding requirement. It is a policy decision with a defined and limited rationale, i.e., that the local authorities have a greater degree of knowledge and insight into the complexities of local concerns. However, when the local authorities refuse to accept the responsibility that is theirs, State authorities have no recourse but to act. Neither the Commissioner nor the Regents did so in the case of the Buffalo public schools. A brief review of the decade following the Yerby Dixon Appeal delineates the culpability of the Regents and the Commissioner of Education, as well as that of the Common Council and the Board of Education.\n\n4. THE DEFENDANTS' RESPONSES TO THE YERBY DIXON ORDER\n\na. The Board of Education's Integration Plans: 1965-1969. Commissioner Allen ordered the Board of Education to\n\nPrepare, approve and submit to me on or before May 1, 1965 a plan for the progressive elimination of racial imbalance, including the steps to be taken in this direction beginning with the school year 1965-66.\n\nYerby Dixon Appeal, supra, 4 Ed.Dept. Rep. at 118-119.\n\nThe plan submitted by the Board did not meet with the Commissioner's approval. He stated at the time that \"it fails to come to grips realistically with the problem or to present a long-range solution or to identify the barriers which must be overcome in order to reach a solution.\" (PX 278, at 4).\n\nA citizens' committee was appointed by Commissioner Allen to assist him on the desegregation problems, and the Buffalo Board asked the State Education Department to lend its help. The advisory committee in August of 1966 submitted to the Board of Education a proposal drafted by the New York City Center for Urban Education, which included the use of a middle school concept to aid the desegregation effort. In September 1966, Commissioner Allen ordered the Buffalo Board to again submit a further plan for desegregating the BPSS. A 16-point proposal was approved by the Board and sent to the Commissioner in November 1966.\n\nThis plan provided for assignment to peripheral schools of as many 6th to 8th grade inner-city pupils as could be accommodated, and for the establishment of a \"Coordinator of Integration\" to facilitate \"quality integrated education.\" (PX 278, at 6-7). In April of 1967, the Board sent to the Commissioner its proposals for effective implementation of the previous November's plan. It recommended the establishment of Fillmore Junior High as a demonstration middle school, and proposed that new middle schools be limited to one-third black membership. It also proposed that all middle schools be located in predominantly white areas of the city. The Board specifically stated that white students would not be transported to non-white neighborhoods.\n\nThis plan also failed to meet the Commissioner's expectations and approval. He labeled it \"disappointing and unsatisfactory, lacking specificity and devoid of any real evidence of a serious intent on the part of the Board to significantly reduce racial imbalance in the Buffalo School system.\" [S-101(b); PX 278, at 8]. The Board was again ordered to submit a detailed plan. In late January 1968, three years after the original demand from the Commissioner, the Board produced a new plan, \"Recommendations for Achieving Quality Integrated Education in the Buffalo Public Schools.\" (PX 278, at 8). This new proposal detailed the results of the desegregation efforts since 1965. As of January 1968, the School Board reported, 1200 inner-city pupils were being bussed to peripheral schools, and the projected increase in this number for September 1968 was an additional 250. Also, 130 children from predominantly black schools were assigned to South Park High School and another 130 from nearly all black School 31 were attending Southside Junior High School.\n\nThe central feature of the Board's new plan was to restructure all the public schools on a 6-4-4 basis as follows: (1) Pre-kindergarten to fourth grade would be located in neighborhood schools and would service a sufficiently small area that walking to school would be possible; (2) Fifth to eighth grades would be in a series of middle schools, some new, some converted junior highs. These middle schools would be situated in peripheral neighborhoods and be distributed so that their racial composition would reflect that of the district as a whole, and so that two-thirds of the pupils would live in the immediate area; (3) The ninth to twelfth grades would be in the regular high schools, thus requiring that ninth grades from junior highs be absorbed in the high schools. (PX 278, at 9-12). This middle school plan, often referred to as the 4-4-4 plan, would have effectively integrated the fifth through twelfth grades, but would have left grades one through four in their existing segregated state. [S-120(b)].\n\nThe plan made the following specific proposals: converting Genesee-Humboldt Junior High and Southside Junior High into middle schools, developing initiatives to integrate Woodlawn Junior High School, \u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\" and either integrating East High School proper or distributing its students to other high schools. (S-102). The Board also endorsed the \"educational park\" \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\" concept to promote economic and educational efficiency, and to facilitate future metropolitan integration as population shifts occur. A $40,000 planning appropriation for a metropolitan educational park was recommended. (PX 278, at 14-15).\n\nThe Commissioner ordered that the Board report to him by November 15, 1968 on the actions taken to activate the proposals of this plan. In its November 1968 report, the Board detailed its efforts to date to the Commissioner (PX 271), noting that at that time, three and a half years after the Commissioner's original order to desegregate the BPSS, some 2,000 inner-city children were being transported to so-called \"receiving\" schools. The Board also reported the difficulty it was having with two phases of its desegregation program: its proposal for the use of portable classrooms and appropriations for middle school planning. The Board's difficulty was due in large part to Common Council opposition.\n\nb. Common Council Opposition. To increase the capacity of the designated receiving schools on the inner-city periphery, the Board had agreed in May of 1968 to purchase 24 portable classrooms. They were to be placed at twelve of the predominantly white receiving schools [S-112(a)], and would accommodate 450 minority youths from Clinton and Woodlawn Junior Highs. \u003cspan class=\"fnref\"\u003e51\u003c/span\u003e\" Within six days of the Board's decision, the Common Council requested the Corporation Counsel to draw up whatever legislation would be necessary to outlaw such portable classrooms. [S-113(a)]. Against the express advice of the Corporation Counsel, who warned that the proposed ordinance was \"discriminatory in purpose, nature, and object,\" [S-116(b)], the Common Council enacted an ordinance that required any addition to a school to be constructed with the same material as the permanent school building. \u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\" (S-114). The ordinance, which effectively prohibited the portable classrooms, was vetoed by the Mayor (S-116), but the veto was subsequently overridden by the Common Council. (S-117). The Board of Education then took the City and the Common Council to court, and succeeded in having the ordinance declared unconstitutional. Board of Education v. Buffalo, 57 Misc.2d 472, 293 N.Y.S.2d 421, aff'd 32 App.Div.2d 98, 302 N.Y.S.2d 71 (4th Dept. 1969). The Common Council's action delayed the portable classroom plan at least one year. (S-119).\n\nIt is undisputed that the core feature of the Board's 1968 integration plan submitted to the Commissioner was the middle school program. [S-120(a)]. Had it been implemented, integration could have been achieved on a broad scale. \u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\" From the outset, however, the middle school concept faced stiff opposition from the Common Council and, at the time of trial, the comprehensive plan for a city-wide system of six middle schools lay dead, with only two schools to mark its demise. \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\"\n\nThe Common Council's opposition to the middle schools plan was not long in forming. A new junior high school \u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\" in the Riverside area was under construction at the time the Board agreed in 1968 to restructure the schools into the 4-4-4 format. Bond issues had been approved by the Council to cover the initial financing of the new school, and construction in mid-1968 had passed the half-way point. [S-122(a)]. Consistent with the proposed district-wide middle school plan, the Board changed the nascent junior high into a middle school. But, when the bond issue for final funding was submitted in late July 1968, the Common Council turned it down. [S-122(a)].\n\nThis action provoked considerable community uproar \u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\" and prompted then Superintendent Manch to state: \"The issue is integration just as it was on the portable classrooms.\" [S-122(c)]. Eventually the Common Council did approve the bond issue; the school was built and opened as the West Hertel Middle School. (S-123).\n\nThe City defendants argue that since the school was built, the Common Council's actions are not probative of segregative intent. This argument might hold some water if the Common Council's action in allowing the West Hertel school to be completed signified its intent not to obstruct the 4-4-4 plan. Unfortunately, the decision to fund the school was apparently a case of the Council's deciding to choose what it considered the better of two evils: abandoning a school that was more than one-half completed, or acquiescing in its completion as a middle school. In July of 1968 and in June of 1969, resolutions approving planning funds for the balance of the middle school program were turned down by the Common Council. (S-124, 125). The Common Council's opposition to the Board's integration efforts has been a substantial factor in the continued and increased segregation in the BPSS. There can be no doubt that its actions were intended to achieve that result.\n\nThe plaintiffs also charge that the Common Council's refusal to negotiate a lease or purchase of Bishop Ryan High School from the Buffalo Catholic Diocese was a segregative act. When Bishop Ryan was closed in 1971, the Board of Education drew up a proposal to use that school to relieve overcrowding at Southside Junior High and South Park High Schools. Under the Board's plan, ninth grade students at both schools would attend Bishop Ryan.\n\nSince additional funding was required to obtain the school, the plan was submitted to the Common Council. The evidence at trial showed that during discussions with the Board, the Council requested assurances that the racial composition of the student body at the school be the same as when the diocese ran it, or at least not a greater percentage of black students than would have attended ninth grade at South Park High. Mr. Gardner, the ex-President of the Board of Education, testified that while this plan was being considered, residents of the Bishop Ryan area wrote to Board members expressing their opposition to the Board's use of the school. He described this opposition as racially motivated. On cross-examination, Mr. Gardner admitted that the Bishop Ryan building had once been owned by the BPSS, but had been abandoned for some reason, and that the stated purchase price of $1,000,000 was excessive in view of the condition of the building. (Record, Vol. II, at 168-69, 176).\n\nThe evidence is not sufficient to find that the Common Council's refusal to even negotiate with the Catholic Diocese was substantially motivated by segregative intent. However, the Council's insistence on limiting the number of blacks that would have attended the school, had it been purchased or leased, is further evidence of the Council's resistance to the Board's integration proposals.\n\nAnother plan of the Board's to alleviate crowding at South Park High was a new East Side High School, which was also designed to replace Fosdick-Masten High School, provide facilities for new programs and allow redistricting of East High to end that school's severe racial imbalance. The planning for this school consumed ten years, and Mr. Gardner testified that \"there is no site that has ever been selected for a school in Buffalo that was more carefully worked over.\" (Record, Vol. II, at 23-24). The proposed school site, on William Street on the City's east side, had already been purchased, and 4.6 million dollars borrowed, when the school was dropped from the City's 1974-1975 budget. Mr. Gardner testified that some citizens had expressed racial opposition to the project and that \"the principal reason for the abandonment of this project was racial.\" (Record, Vol. II, at 35).\n\nTo contradict Mr. Gardner's testimony, the City defendants called Mr. James Burns, Commissioner for the Department of Administration and Finance, whose job it is to make budget recommendations to the Mayor. Mr. Burns testified that because of Buffalo's severe fiscal problems and because City planners projected that only 60% of the new school would be needed by the time it could be opened, he recommended that the East Side High School project be abandoned. (Record, Vol. VIII, at 116-119, 129). Mr. Burns admitted that the City budget officials did not confer with Board members, but denied that the action was racially motivated. (Id., at 119, 128-130).\n\nAlthough the court finds it surprising that the City's decision to suspend, perhaps permanently, the proposed East Side High School was made without any consultation with School Board officials, especially in light of a decade of planning, the evidence is not sufficient to prove that segregative intent was a substantial factor in this decision.\n\nc. The Board of Education's Integration Plans: 1969-1972. Commissioner Nyquist, \u003cspan class=\"fnref\"\u003e57\u003c/span\u003e\" replying to the Board in June of 1969 about the Board's November 1968 proposals, cited statistics that showed that little actual integration had been effected. Mr. Nyquist stated: \"Despite the progress described in the report [of November 1968], the conditions which prompted an appeal to the Commissioner of Education [ i.e., the Yerby Dixon Appeal ] by the parents of Negro children still exist.\" (PX 272, at 2). It was then more than four years after Commissioner Allen's Yerby Dixon decision; the Board's responses had failed repeatedly to satisfy the Commissioner; and the segregation in the schools that prompted the Yerby Dixon decision had not been substantially alleviated. Mr. Nyquist requested the Board to notify him within one month of its plans for that fall.\n\nAfter the Board's next report, Commissioner Nyquist stated in a letter dated August 1, 1969 that \"it is apparent from the [Board's] report [of July 14] that there is forward movement in several respects,\" noting in particular the planned opening of integrated West Hertel Middle School, the use of portable classrooms located at peripheral schools for 300 inner-city students, the expected increase of inner-city transfers to peripheral schools from 2043 to 2600, and the possibility of suburban school district cooperation. (PX 276). This forward movement proved to be short-lived.\n\nAs one of its efforts to meet the Commissioner's demands, the Board had requested Superintendent Manch to initiate discussions with suburban school districts to enlist their assistance in the desegregation efforts. The evidence at trial indicated that only the Williamsville Central School District reacted favorably to whatever overtures Superintendent Manch made. However, a plan to transfer a small number of inner-city students to Williamsville schools was quickly rejected by the residents of that suburb.\n\nThe Board apparently continued to file reports with the Commissioner's office, outlining the progress it claimed to have achieved, \u003cspan class=\"fnref\"\u003e58\u003c/span\u003e\" but over the next two years very little else was done by the Board or the State. Then, in January 1972, Commissioner Nyquist's interest was apparently renewed and he wrote the Buffalo Board:\n\nReview of the reports submitted to me shows that, while many worthwhile efforts have been made and successes achieved, the problem of racial imbalance in the Buffalo schools is still a long way from solution.\n\nCommissioner Nyquist also stated:\n\nFaced with the hard fact that segregation is more severe in Buffalo now than it was seven years ago, with over 20 schools more than 90% black, and 29 schools 90% or more white, it is clear to me that only a new approach can equalize educational opportunity for the children of Buffalo. (PX 103, at 1, 2). (Emphasis added.)\n\nCommissioner Nyquist ordered the Board to devise a new plan that would integrate the early years as well as the 5 through 8 and 9 through 12 grades, although he did not completely rule out a 4-4-4 plan. The Commissioner gave the Board a little over two months to submit a desegregation plan \"under which every school would substantially reflect the racial composition of the entire district.\" (PX 103, at 3).\n\nFollowing seven years of weak leadership and continued acquiescence in the Board's dilatory actions, this stern and comprehensive order provoked, perhaps predictably, a strong and divisive reaction among Board members. \u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\" Much of the Board's debate over the Commissioner's new order centered on the question of busing. Ultimately, the Board approved by a 4 to 3 vote a motion to inform the Commissioner that the Board was unable to develop the requested April 1, 1972 desegregation plan. (PX 108). At the same Board meeting, the Board went on record as being opposed to any type of forced busing and also voted to file its own staff's report, \"A Study of Desegregation\" (PX 111), called the Heck Report. \u003cspan class=\"fnref\"\u003e60\u003c/span\u003e\"\n\nThe Heck Report was the product of a year's work, and was produced in response to a Board request for a study on a crossbusing program for Buffalo and the use of existing buildings for the middle school program. It proposed a restructuring of the BPSS into five large neighborhoods, each extending outward from the center of the City. The resultant racial balance at each school level was estimated to be from 30 to 45.9% black. The report stated that \"utilizing a variance of plus or minus 10%, it is feasible to assume racial balance for each [elementary] school at each level.\" (PX 106, at 29). The study recommended certain existing schools that would be converted to middle schools to achieve the Board's 4-4-4 plan, and integration in the 1-4 level was also provided for. The high school program was reported to need further study before detailed proposals to achieve full integration could be made. (PX 106, at 30).\n\nAfter the Board had refused to develop the requested April 1972 desegregation plan, the Commissioner sent a State task force to Buffalo in May of 1972 to develop a State plan for integrating the BPSS. The State task force proposed two alternative plans, the first being the Heck Plan and the second being a modified version of the Heck Plan (PX 278, at 39-92), both of which were submitted to the Board in mid-November of 1972 with a request that the Board respond by January 3, 1973. These plans were also rejected by the Board, and, according to the Commissioner, this action by the Buffalo Board \"more or less closed the door on any cooperative effort.\" (PX 298, at CW 7.5).\n\nBy January of 1973, some five years after the Board's 4-4-4 plan was adopted, only one middle school had been constructed, and only one other had been converted from a junior high. The Board's 1968 proposal had noted that \"Fillmore Middle School is the initial step in a long-range program to place all children in grades 5-8 in integrated middle schools.\" (PX 271, at 10). Fillmore Middle was the initial step, being converted to a middle school in 1967, but, as of October 1972, it could hardly be called integrated, with a minority enrollment of 82.5%. (PX 7, at 19). West Hertel Middle School, opened in 1969, was the second and last step in the Board's \"long-range\" 4-4-4 plan. The following table shows that the junior high school system remained heavily segregated as of October 1973. TABLE 14 MIDDLE AND JUNIOR HIGH RACIAL COMPOSITIONS OCTOBER 1973Fillmore Middle 89% minorityWest Hertel Middle 71.6% majorityClinton Junior High 100% minorityGenesee Humboldt Junior High 90.9% minoritySouthside Junior High 84.6% majorityWoodlawn Junior High 99.6% minority\n\nSOURCE: PX 6, at 21.\n\nThe 1968 plan for integrating the public schools, the only plan even provisionally acceptable to the Commissioner of Education (PX 105, at 6), had been a nearly total failure:\n\n1. Southside Junior High had not been converted to a middle school, and its racial imbalance in 1973, 84.6% majority, was worse than in 1969, when it was 76.4% majority.\n\n2. No action had been taken to desegregate Woodlawn Junior High.\n\n3. Neither of the alternative plans to avoid the segregated status of East High School -- integrating the school or redistributing its pupils to the other high schools -- had been effectuated.\n\n4. The Board had not approved any educational parks.\n\n5. The middle school program had floundered after only two middle schools were established.\n\n(S-103).\n\nEight years after the Yerby Dixon Appeal, it was clear that the Board had not accepted, and would not accept, the responsibility to integrate the Buffalo schools.\n\nd. The State Defendants' Response to City Defendants' Inaction. Two broad and specific enforcement powers are granted to the Commissioner of Education under New York Education Law: removal of school officers and withholding of funds for \"wilfully disobeying any decision, order, rule or regulation of the regents or of the commissioner of education.\" New York Education Law, ยง 306(1) (McKinney's 1969). Commissioner Nyquist was well aware of the powers that he was authorized to use. \u003cspan class=\"fnref\"\u003e61\u003c/span\u003e\"\n\nIn August 1973, after the Board rejected the State's integration plan, and after the Board president had written the Deputy Commissioner of Education that\n\nif your discussion with [the Board] should in any way involve forced bussing then, in view of the attitudes of the majority of the Board, there would be no point to such a discussion,\n\n(PX 267). \u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\"\n\nthe Commissioner had a show cause order drafted. (PX 298, at CW 7.5). This show cause order, a necessary prerequisite to either removal of school officials or withholding of funds [New York Education Law, ยง 306(1) (McKinney's 1969)], had not been served as of the day this case was tried in October of 1974. \u003cspan class=\"fnref\"\u003e63\u003c/span\u003e\"\n\nMr. Nyquist admitted at trial that between January 1972, when he requested the full scale integration plan, and the date of trial, nothing of consequence had happened: \"maybe minor decisions, but very minor. I see no real substantive change.\" (Record, Vol. V, at 39). In addition, Mr. Nyquist agreed that the Board's actions \"clearly and unequivocally violate the Regents policy\" and that the Board had willfully defied the Commissioner's instructions. (Record, Vol. V, at 39-40). The Commissioner testified: \"I don't think you can achieve racial desegregation here in Buffalo without an order from the Commissioner or from the Court.\" (Record, Vol. V, at 43). Mr. Nyquist's excuse for not having brought a show cause order to make the Yerby Dixon decision a final order, that he was incapacitated by a heart attack, is not persuasive. The State's authority cannot be so dependent on the health of any one person, and New York State law authorizes the Deputy Commissioner to fill in for a disabled Commissioner. \u003cspan class=\"fnref\"\u003e64\u003c/span\u003e\" The State defendants argue that \"it is only required that they take reasonable steps to implement Regents' policy and to enforce the Commissioner's order of February 15, 1965 [Yerby Dixon]. This they have done.\" (Post-trial Brief for State Defendants, at 15). Without considering whether the State defendants correctly interpret the law, this court is convinced that neither the Commissioner nor the Regents have taken \"reasonable steps\" to alleviate the segregation in the BPSS. At the time this case was submitted for decision, ten and onehalf years had elapsed since the 1965 Yerby Dixon Appeal and no significant improvement in desegregating the public schools in Buffalo had taken place. The Commissioner's actions over those ten years amount to a mountain of paper work with little substantive results. The lack of effective action by the Regents and by the Commissioner of Education has continued, and in some instances aggravated, racial segregation in the Buffalo public schools.\n\nIt is significant when considering the protracted negotiations between the Board and the Commissioner's office, which continue to this day, to ponder the hypothetical situation posed by plaintiffs' counsel at the final arguments. If the Buffalo School Board had decided to shorten the statemandated 190-day school year [New York Education Law ยง 3204(4)(a) (McKinney's Supp.1976)], on its own initiative, one would expect the State to react with great alacrity to enforce its attendance statute. Yet, this decade-old integration mandate has been \"more honour'd in the breach than in the observance.\" (W. Shakespeare, Hamlet, I, iv, fourteen).\n\ne. Mayoral Action. At the time this suit was filed, School Board members were appointed by the Mayor, subject to the confirmation of the Common Council. [New York Education Law ยง 2553(3) (McKinney's 1970)]. The plaintiffs allege that the late Mayor Frank A. Sedita's appointment of Mrs. Carol Williams to the Board of Education in early 1972 was done with segregative intent. This appointment occurred just after Commissioner Nyquist had requested the Board to submit an integration plan that would effect a racial balance in each school approximating the district-wide percentage.\n\nAs the Supreme Court stated in Mayor of Philadelphia v. Educational Equality League, 415 U.S. 605 [94 S. Ct. 1323, 39 L. Ed. 2d 630] (1974), such an allegation presents a sticky judicial and legal problem because \"judicial oversight of discretionary appointments may interfere with the ability of an elected official to respond to the mandate of his constituency.\" 415 U.S., at 615 [94 S. Ct. at 1330, 39 L. Ed. 2d at 641]. Because the Supreme Court ruled that there was no proof of discriminatory appointments in the Mayor of Philadelphia case, it did not resolve this problem. 415 U.S., at 621 [94 S. Ct., at 1333, 39 L. Ed. 2d, at 644].\n\nIn the present case, the only evidence of the Mayor's intent is a quote from a letter he once wrote indicating that he appointed Mrs. Williams because she was opposed to cross-busing. [S-130(b)]. We feel that this is insufficient evidence to find discriminatory intent on the part of the Mayor.\n\nIV - G. CONCLUSION ON SCHOOL EVIDENCE\n\nAs the Supreme Court has often noted, \"it is extremely difficult for a court to ascertain the motivation, or collection of different motivations, that lie behind a legislative enactment.\" Palmer v. Thompson, 403 U.S. 217, 224 [91 S. Ct. 1940, 1945, 29 L. Ed. 2d 438, 444] (1971). The same can be said for the motivation or motivations behind the actions of a school board or board of regents. When, however, the court is faced with a decade and more of intransigence and obstruction, of delay and procrastination, the interpretation of motivation becomes less difficult. The record in this case substantiates plaintiffs' claim that the Board of Education, the Superintendent of Schools, the Common Council, the Commissioner of Education and the Board of Regents intentionally created and maintained, in substantial part, the segregation in the BPSS.\n\nThe court again notes that some efforts were made to alleviate the segregation and promote integration. Specific examples include the Board's voluntary integration program that enabled some 2,600 inner-city youths to attend peripheral schools, compensatory education programs, and the increase in minority administrators. But these steps were inadequate in themselves [ see the district court opinion in Bradley v. Milliken, 338 F. Supp. 582, 591-92 (E.D.Mich.1971)], and their beneficial results were substantially nullified by contrary actions, such as the transfer and optional area policies that resulted in 2,000-4,000 white students shifting to predominantly white schools as the court has discussed supra, in section IV-C of this opinion.\n\nThe plaintiffs have proved that various schools in the BPSS are segregated, that this segregation was intentionally caused by the defendants, and that a substantial and meaningful portion of the school district has been intentionally segregated. There is no need, as the Keyes case explains, for the plaintiffs to prove de jure segregation as to each segregated school or student in the system:\n\nWhere plaintiffs prove that the school authorities have carried out a systematic program of segregation affecting a substantial portion of the students, schools, teachers, and facilities within the school system, it is only common sense to conclude that there exists a predicate for a finding of the existence of a dual school system.\n\nKeyes, supra, 413 U.S., at 201 [93 S. Ct., at 2694, 37 L. Ed. 2d, at 559].\n\nThe language transfer device that allowed white students living in the East High School district to avoid East and attend South Park or Kensington Highs; the districting of Woodlawn Junior High in 1964 that guaranteed an all-black student body; the transfer and optional areas policies that enabled white students to avoid schools with substantial numbers of minority students; the discriminatory admissions practices at some vocational high schools; the assignment of teachers and administrators on the basis of race; the discriminatory hiring practices of the Board; the refusal of the Board of Education to devise and implement an effective integration plan; the Common Council's obstruction of positive integration steps that the Board did take; the failure of the Board of Regents and the Commissioner of Education to take effective steps to end the segregation in Buffalo's public schools -- all of these are evidence of a systematic program of segregation.\n\nDefendants have not met their burden of showing that the instances of segregation were not caused by their design or device. Keyes, supra, 413 U.S., at 210 [93 S. Ct., at 2698, 37 L. Ed. 2d, at 564]. The evidence of segregative acts, briefly catalogued in the preceding paragraph, demonstrates the inadequacy of the City and State defendants' defenses. The Board's \"neighborhood school\" policy, long cited as a racially neutral, rational assignment device, stands exposed as a shibboleth. It was followed when its results were seen as accepable; it was disregarded and subverted when the Board saw fit. When the City defendants do admit segregative actions, they attempt to minimize their responsibility by claiming that the segregative effect was \"not substantial.\" (Post-trial Brief for City Defendants, at 14, 15, 21, 22, 26, 30, 31). The evidence proves otherwise.\n\nThe State defendants' attempt to wash their hands of any involvement in the segregation that characterizes the BPSS, by claiming they have done all that is legally required of them, is similarly unpersuasive. Nothing could have encouraged the City defendants' procrastination and recalcitrance more than the lack of effective action by the State defendants. In the final analysis, the State defendants are entrusted with the authority over and responsibility for the educational system in New York State. They must be held accountable for their actions and omissions that allowed and encouraged the BPSS's increasingly severe segregation.\n\nNotwithstanding the culpability of the City and the State defendants, the court does acknowledge that some efforts by all defendants, evidencing various degrees of support for desegregating the BPSS, were shown. Unfortunately, these efforts were too insignificant to alleviate the constitutional harm that had been done.\n\n1. THE EVIDENCE\n\nIV - H. HOUSING\n\nNone of the parties to this lawsuit dispute the existence of severe residential segregation in the City of Buffalo, nor do the parties dispute the fact that the housing problems have contributed to the racial isolation and imbalance present in the Buffalo public schools. The City defendants claim that the housing segregation is the direct cause for the school segregation, that they are blameless for the existence of residential segregation and are not constitutionally required to correct it. (Answer for City Defendants at P P 17, 19; Post-trial Brief for City Defendants, at 1). Consequently, they argue that any evidence regarding the housing situation is irrelevant to the issue: intentional segregation in the BPSS. (Record, Vol. IV, at 143, 161-162, 173; Vol. V, at 110-111; Vol. VI at 10). The State defendants agree that the housing evidence should have been stricken at trial as irrelevant. In addition, they argue that they have no legal responsibility for housing matters in New York State. (Post-trial Brief for State Defendants, at P P 36, 37).\n\nThe plaintiffs introduced evidence tending to show that both the containment of minorities in certain areas of the City, and the exclusion of minorities from suburban areas, did not occur by chance. This evidence can most easily be discussed by dealing with the allegedly discriminatory parties seriatim: (1) The Federal Government; (2) The Buffalo Municipal Housing Authority [BMHA], (3) The Real Estate Industry, and (4) The City of Buffalo.\n\n(1) The Federal Government\n\nDuring the 1930's, the Federal Government's explicit policy, as described in the Underwriting Manual of the Federal Housing Administration [FHA], was to keep racial populations separate. When rating a location, FHA valuators were advised that protection from adverse influences was \"one of the most important features.\" (PX 228, pt. II, at P 226). Adverse influences were defined to include \"infiltration of inharmonious racial or nationality groups.\" (Id., at P 310). The valuators were further advised to award high ratings only to those areas where the most effective exclusionary devices, such as zoning regulations and deed restrictions, were employed, \"inasmuch as these provide the surest protection against undesirable encroachment and inharmonious use.\" [ Id., at P 284(1)]. It was specifically recommended that a \"prohibition of the occupancy of properties except by the race for which they are intended\" be included in the deed restrictions. [ Id., at P 284(3)(g)].\n\nThe Federal Government also funded housing projects, especially war housing, that were purposely segregated. (PX 229, at 3; see (2), infra).\n\n(2) The Buffalo Municipal Housing Authority As shown in Table 15, four major public housing facilities were constructed in Buffalo in the late 1930's under the aegis of the BMHA, a municipal corporation formed under the laws of New York State by the City of Buffalo in 1934. [PX 229, at 2; see New York Public Housing Law ยงยง 403, 404 (McKinney's Supp.1976)]. TABLE 15 BMHA HOUSING PROJECTS - 1930's PROJECT NAME LOCATION UNITS RACIAL MAKEUP Lakeview W.Side, Waterfront 668 All white Commodore Perry Louisiana Street 772 All white Willert Park Jefferson Avenue \u0026 William Street 172 All black Kenfield Kensington area 658 All white\n\nSOURCE: Record, Vol. IV, at 145-152; PX 229, at 3.\n\n[The Kenfield project was originally built as a PWA project, but was taken over by BMHA. (Record, Vol. IV, at 151)]. This segregation in public housing continued as new housing was constructed during the war years, as shown in Table 16 below. TABLE 16 BMHA HOUSING PROJECTS - 1940's LaSalle Courts North W. City Line 206 All white Langfield Homes Kensington area 594 All white Carver Apts. William Street 42 All black Talbert Court William Street 73 All black Ti-o-run-da Cheektowaga 1,050 All white Sheridan- Town of Tonawanda 1,200 All white Parkside\n\nSOURCE: Record, Vol. IV, at 155-158; PX 229, at 3-4.\n\n[These public housing projects were managed by BMHA through Niagara Frontier War Housing. (PX 229, at 3)].\n\nThe testimony at trial demonstrated that these various projects, whose locations are indicated on map 5, infra, were built in either white or black residential areas, and remained totally segregated through about 1950. (Record, Vol. IV, at 168).\n\nNewspaper articles from the 1940's submitted into evidence refer to Willert Park as specifically designated for Negroes. (PX 207, 208, 210, 212). When Willert Park became overcrowded and many black defense workers were in need of housing, an additional 200-unit facility was authorized in 1941 by the Federal Government, specifically for Negroes. (PX 213, 214). Several white residential sites were selected, including Cheektowaga, South Buffalo, and the Fillmore-Eagle Streets area. In each of these areas, public protests arose and the site was rejected.(PX 214, 215, 216 and 221). Among the remarks attributed to protesting community spokesmen at the time were the following:\n\nOf course the Negro workers should be taken care of but this is not the place. There are none living or working here now,\n\nand\n\nThe Negroes, who are certainly in need of better living conditions, would be far happier were they given a city of their own outside of Buffalo.\n\n(PX 215 and 217).\n\nUltimately, an addition to the all-black Willert Park project was built. (Record, Vol. IV, at 176).\n\nThe evidence at trial was conflicting as to whether or not the public housing projects are still segregated. Mr. Victor Einach, who worked for the BMHA from 1939 to 1940, and with the New York State Division on Human Rights from 1941 through 1973, testified that most of the units \"are pretty well integrated.\" (Record, Vol. IV, at 169). However, Mr. Cleon Service, a black realtor with some forty years' experience in the Buffalo real estate market, and the vicepresident and member of the executive committee of Housing Opportunities Made Equal [HOME], testified that even after 1946, when the BMHA had agreed to end its segregative housing assignments, such segregative actions continued, and that\n\nit wasn't until 1970 that we actually were able to sit down with them and work out what we felt was the beginning of a satisfactory resolution of their practices of discrimination and assignment and refusal to transfer blacks from the predominantly black projects at that time.\n\n(Record, Vol. IV, at 179).\n\nMr. Anthony Dutton, a member of the Board of Directors of HOME, testified that the public housing administered by the BMHA was still heavily segregated, as the following table indicates, as of 1966. TABLE 17 PROJECT NAME UNITS RACIAL MAKEUP LOCATION Kenfield 658 3% black A LaSalle 206 3% black B Langfield 594 6% black C Shaffer 233 3% black D Ferry-Grider 210 6% black E Kensington Heights 371 6% black F Willert Park (including extension) 472 100% black G Ellicott Mall 590 99% black H Talbert Mall 763 99% black I Lakeview 668 23% black J Commodore Perry 772 19% black K Jasper Parish 212 13% black L Commodore Perry Ext. 472 58% black K\n\nSOURCE: Record, Vol. V, at 125-128.\n\n[Location of these projects shown on map 5, infra].\n\n= [SEE MAP 5 IN ORIGINAL]\n\nMr. Dutton stated that he relied on BMHA's Research Division for the statistics, and that no appreciable change in these statistics had occurred by 1970. (Record, Vol. V, at 124, 125). \u003cspan class=\"fnref\"\u003e65\u003c/span\u003e\" The figures supplied by Mr. Dutton stand unrebutted, calling into question Mr. Einach's observation that the public housing is \"pretty well integrated,\" supra, at 963, and census tract data bear out the continuance of a segregated city. (PX 289-293).\n\nThe statistics in Table 17 prompted the HOME organization to investigate the BMHA. Mr. Dutton testified that HOME's study found that federal and state law required a housing authority running more than one housing project to operate all the projects as a single unit with regard to application and assignment of tenants. The BMHA, however, allowed the individual project managers to make use of an informal waiting list procedure, which enabled white applicants to avoid the identifiably black projects. (Record, Vol. V, at 129-137). Thus, the segregation initiated by the FHA was maintained by the BMHA.\n\n(3) The Real Estate Industry\n\nMr. Service, the realtor, also testified about the state of the private real estate business in the Buffalo area after World War II. He stated that it was extremely difficult for a black buyer to purchase a home in a white neighborhood. White realtors told Mr. Service that \"they could not either morally or ethically permit [him] to sell black families into an all white community.\" (Record, Vol. IV, at 182).\n\nIn the late 1950's, when the real estate industry in the Buffalo area introduced the multiple listing system, under which all brokers send their listings to a central file that is then distributed to all the members of the system, there was fear among white brokers that this procedure would precipitate a black influx into the suburbs. (Record, Vol. IV, at 187). The suburban realtors were so worried at this prospect that they broke off and formed their own separate real estate board from which blacks were excluded. (Id., at 187, 191-192). The problem was so acute in the white realtors' eyes that they devised a system that avoided a black realtor showing a white prospective buyer a home, even in a white neighborhood. The white brokers \"felt any incident of a black showing up in all white areas would create a furor, and they wanted to avoid it.\" (Id., at 189). This practice continued into the 1960's. \u003cspan class=\"fnref\"\u003e66\u003c/span\u003e\" (Id., at 191).\n\n(4) The City of Buffalo\n\nAll three of the above forces had helped to cause the black population in the City of Buffalo to be squeezed into a central city area in the 1950's. At that time, the Ellicott District redevelopment, an urban renewal program, resulted in the City's purchase of large areas of the Ellicott District and subsequent razing of the purchased homes. The evidence at trial showed that almost all of the dislocated black families were relocated in the Masten District area, which exacerbated the segregated housing conditions. (See map 3, supra). The relocation was described in Buffalo's official Community Renewal Program, quoted in the City's Model Cities grant application which was introduced into evidence:\n\nAlthough at the time there was a sufficient number of adequate housing units available, the relocation program failed to take into account the residential exclusion problem which restricted the movement of non-whites to the Masten and Ellicott Communities. This restriction, though unwritten and unstated, nevertheless, reduced the supply of housing units available to the non-white families displaced by the Ellicott Project to an unsatisfactory level. Thus, relocation of the Ellicott residents was accomplished by increasing the density of the remainder of the Ellicott Community and the lower Masten area mainly by virtue of illegal conversions of single and two, multi-family structures and by the doubling up of families in existing units. The impaction of these two areas in turn led to the speeding up of the processes of blight formation in the remainder of the Ellicott and Masten areas.\n\n(PX 260, pt. III, at 25, 26).\n\nAt trial, plaintiffs called as a witness Martin Sloan, General Counsel of the National Committee Against Discrimination in Housing, Inc. Mr. Sloan, who has extensive experience in Government agencies dealing with segregation in housing, such as the United States Commission on Civil Rights and the Home Financing Agency, was asked at trial whether he had an opinion as to how long it would take to alleviate the results of the discriminatory practices and policies followed by the Federal Government. Mr. Sloan's answer appears to be equally applicable to the discriminatory practices of BMHA, the City, and the private real estate industry:\n\nWell, it depends. If the federal agencies could turn around 180 degrees, by that I mean match the zeal, with which they carried on the discriminatory policies in the '30's and '40's, with a similar enthusiasm in carrying out equal housing opportunities and obligations, I would estimate two to three generations. At the rate they are going now, which is essentially a passive attitude toward their enforcement responsibilities, a much, much longer time. I couldn't estimate at all. (Record, Vol. VI, at 47).\n\n2. THE RELEVANCY OF HOUSING SEGREGATION\n\nThe State and City defendants cite Milliken v. Bradley, 418 U.S. 717 [94 S. Ct. 3112, 41 L. Ed. 2d 1069] (1974), as authority for the proposition that, in a case such as this, housing evidence is not relevant. In Milliken, a school desegregation suit involving the public schools of Detroit, the Court of Appeals, in affirming the district court's decision that the defendants were guilty of segregative actions, had this to say about the housing evidence introduced at trial:\n\nThis record contains a substantial volume of testimony concerning local and State action and policies which helped produce residential segregation in Detroit and in the metropolitan area of Detroit. In affirming the District Judge's findings of constitutional violations by the Detroit Board of Education and by the State defendants resulting in segregated schools in Detroit, we have not relied at all upon testimony pertaining to segregated housing except as school construction programs helped cause or maintain such segregation.\n\n484 F.2d 215, 242 (6th Cir. 1973).\n\nThe Supreme Court took note of this in its decision:\n\nAccordingly, in its present posture, the case does not present any question concerning possible state housing violations. Milliken, supra, 418 U.S. at 728 n. 7 [94 S. Ct. at 3119, 41 L. Ed. 2d at 1082].\n\nIt cannot be said that either the Court of Appeals or the Supreme Court held the housing evidence inadmissible or irrelevant. The only certainty is that neither court relied on the housing testimony. Because of the defendants' primary reliance on the residential composition of Buffalo as a defense to this action, we feel it necessary and appropriate to express our findings on the housing evidence. It is too facile an argument to say that since this is a school desegregation suit, housing evidence is necessarily irrelevant. If the school suits have shown anything, they have demonstrated convincingly, in the words of Judge Weinstein, that\n\nhousing and school patterns feed on each other. The segregated schools discourage middle class whites from moving into the area and the segregated housing patterns lead to segregated schools. Hart v. Community School Board, supra, 383 F. Supp. at 706.\n\n\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e\"\n\nIn United States v. School District of Omaha, supra, 521 F.2d 530 (8th Cir. 1975), cert. denied, 423 U.S. 946 [96 S. Ct. 361, 46 L. Ed. 2d 280], 44 U.S.L.W. 3280 (Nov. 11, 1975), the court stated in a footnote:\n\nIn light of the conclusive evidence of intentional segregative practices by the school district, we have not addressed ourselves to the appellants' contention that the public and private racial discrimination in housing provides an alternate ground for ordering all-out school integration. However, we do subscribe to the Fourth Circuit's reasoning:\n\n. . . If residential racial discrimination exists, it is immaterial that it results from private action. The school board cannot build its exclusionary attendance areas upon private racial discrimination. . . .\n\nBrewer v. School Board of City of Norfolk, Va., 397 F.2d 37, 41-42 (4th Cir. 1968) (en banc).\n\n521 F.2d at 537 n. 11.\n\nThe evidence proves that the residential segregation in Buffalo was caused, in substantial part, by the policies and practies of the Federal Government, the BMHA, the private real estate industry and the Common Council of the City of Buffalo. The citizens of Buffalo, both black and white, and particularly the public school children, have been affected by the legacies of these actions, stretching back over many generations, which have contributed to a wall of misunderstanding.\n\nThe City defendants cannot use the residential segregation as a defense because, as the evidence demonstrates, they helped to cause the residential segregation through the Ellicott Relocation Program. The Common Council's portable classroom ordinance, discussed in section IV-F of this opinion, supra, and the Board's districting of Woodlawn Junior High School, discussed in section IV-B of this opinion, supra, are examples of how the City defendants attempted to sustain and prolong the racial separation in schools that residential segregation encourages. But, even had the City defendants not actually contributed to residential segregation, to allow them to hide behind a condition they have long been aware of, that they have the authority to alleviate and that they once, in the City's Model Cities application, committed themselves to rectify, would be untenable.\n\nGiven the purposeful residential segregation in the City of Buffalo, the School Board's \"neighborhood school policy\" was not, and could not be, racially neutral. The Board's continued reliance on it tered and maintained school segregation. As the district court in Oliver v. Kalamazoo Board of Education, supra, 368 F. Supp. 143 (W.D.Mich.1973), stated:\n\nThe school board should not be heard to plead that its neighborhood school policy was racially neutral when in fact \"state action under the color of law\" produced or helped to produce the segregated neighborhoods in the first place.\n\n368 F. Supp. at 183.\n\nThe Fifth Circuit has noted that \"[when] the segregated housing patterns are the result of 'state action', we are faced with double discrimination.\" United States v. Texas Education Agency, 467 F.2d 848, 863-64 n. 22 (5th Cir. 1972) (emphasis in original), motion to clarify opinion denied, 470 F.2d 1001 (5th Cir. 1973) (en banc). And the district court in Morgan v. Hennigan, supra, 379 F. Supp. 410 (D.Mass.1974), ruled that \"when school officials have followed for at least a decade a persistent course of conduct which intentionally incorporated residential segregation into the system's schools, that conduct is unconstitutional.\" 379 F. Supp. at 470.\n\nThis court cannot allow the Common Council and the Board to avoid liability by pointing the finger at each other. As the record reveals, neither has taken adequate steps within the ambit of their own authority to cure segregative situations in the community, and in fact both have taken some steps which have caused the segregation in the schools and in the community at large to continue.\n\nAlthough the State Commissioner of Education and Board of Regents cannot be held directly responsible for housing segregation, they cannot use the unconstitutional actions of others to excuse their own failure to act, because, in the final analysis, the State defendants are responsible for education in New York.\n\nThe court finds, therefore, that the defense of residential segregation, like the \"racially neutral\" neighborhood school policy defense to which it is intimately related, is essentially a smokescreen. Furthermore, the court finds that the City defendants' past action and inaction which have, to a substantial degree, caused, exacerbated or maintained the segregated housing conditions, are separate and independent alternative grounds for holding them constitutionally liable for the segregated condition of the schools in Buffalo.\n\nORDER\n\nIt is the finding of this court that the Board of Education, the Superintendent of Schools, the Common Council, the Commissioner of Education, and the Board of Regents have violated the plaintiffs' fourteenth amendment right to equal protection under the laws by intentionally causing and maintaining a segregated school system. Defendants, their successors and their agents are therefore enjoined from taking any further action in violation of plaintiffs' rights under the Constitution.\n\nThe court and the parties must now prepare to deal with phase two of this lawsuit - the remedy that is to be devised to end the unconstitutional segregation in the public schools of Buffalo. There are several preliminary considerations that all parties should keep in mind as the remedy is hammered out.\n\nThis court is not, and does not want to be, a school administrator. It does not have the specialized training, the knowledge or the experience that belong to the defendants. The limited nature of the court's function has been clearly delineated by the Supreme Court:\n\nOur cases, of course, make clear that the initial responsibility for devising an adequate desegregation plan belongs with school authorities, not with the District Court. The court's primary role is to review the adequacy of the school authorities' efforts and to substitute its own plan only if and to the extent they default.\n\nMilliken v. Bradley, supra, 418 U.S. 717, 809 [94 S. Ct. at 3158, 41 L. Ed. 2d at 1128] (1974). (Marshall, J., dissenting) (emphasis added).\n\nIt is, therefore, the responsibility of the defendants to come forward with a plan that comports with the Constitution. The problems presented are difficult and will require rigorous effort to overcome, but overcome them the defendants must.The court is, of course, aware that both the Commissioner and the Board have already worked out plans on their own, under the Commissioner's impetus, but whether or not such plans will pass constitutional muster is not to be guessed at.\n\nThere are many diverse factors and influences that must necessarily be considered by the defendants, but this court's sole\n\nobjective in dealing with the issues presented by [this case] is to see that school authorities exclude no pupil of a racial minority from any school, directly or indirectly, on account of race; it does not and cannot embrace all the problems of racial prejudice, even when those problems contribute to disproportionate racial concentrations in some schools.\n\nSwann v. Charlotte-Mecklenburg Board of Education, supra, 402 U.S. 1, 23 [91 S. Ct. 1267, 1279, 28 L. Ed. 2d 554, 570] (1971).\n\nAcknowledging the complexity of these cases, the Supreme Court has set only one guideline: \"The burden on a school board today is to come forward with a plan that promises realistically to work, and promises realistically to work now.\" Green v. County School Board, 391 U.S. 430, 439 [88 S. Ct. 1689, 1694, 20 L. Ed. 2d 716, 724] (1968) (emphasis in the original).\n\nTherefore, it is ordered that the City and the State defendants prepare plans to desegregate the BPSS. The proposed plans must encompass the staff segregation as well as the student segregation.\n\nThe Supreme Court, in Milliken v. Bradley, has stated:\n\nBefore the boundaries of separate and autonomous school districts may be set aside by consolidating the separate units for remedial purposes or by imposing a cross-district remedy, it must first be shown that there has been a constitutional violation within one district that produces a significant segregative effect in another district. Specifically, it must be shown that racially discriminatory acts of the state or local school districts, or of a single school district have been a substantial cause of interdistrict segregation. Thus an interdistrict remedy might be in order where the racially discriminatory acts of one or more school districts caused racial segregation in an adjacent district, or where district lines have been deliberately drawn on the basis of race.\n\nMilliken v. Bradley, supra, 418 U.S. 717, 744-745 [94 S. Ct. at 3127, 44 L. Ed. 2d at 1091] (1974).\n\nOn the present state of the record, there does not appear to be any basis for the court to order a metropolitan-wide remedy. However, it should be noted that Milliken does not prevent the State from itself devising and implementing a metro response to what is essentially a metropolitan problem. Nor does Milliken prevent a plan that would encompass the metropolitan areas on a voluntary basis, and the State defendants shall consider this in their plan.\n\nAll parties are directed to appear on Wednesday, May 19, 1976 at 2:00 p.m. The individual defendants and witnesses are not required to be present. But all attorneys shall be accompanied by representatives of the agency defendants who are acquainted with the problems of preparing a plan. The timetable for submission of the plan and other problems will be discussed.\n\nSo ordered.\n\nAppendix to follow. APPENDIX ERIE COUNTY SCHOOL DISTRICTS RACIAL PERCENTAGES Spanish American Total Surnamed Indian \u0026 District Enrollment Black Americans Oriental Other Alden 1,492 0.2 0.2 0.1 99.5Williamsville 11,660 0.9 0.1 0.8 98.2Sweet Home 7,500 1.9 0.1 0.4 97.6Eggertsville 1,115 1.3 0.9 2.3 95.5Snyder 1,331 0.9 1.2 97.9Amherst CHS 2,842 0.6 0.4 0.5 98.5East Aurora 3,439 0.2 0.2 0.1 99.6Buffalo 64,324 41.0 2.9 1.0 55.1Cheektowaga 3,872 0.3 99.7Maryvale 7,440 0.2 0.1 99.7Cleveland Hill 2,566 0.4 0.3 99.3Depew 3,998 0.8*1 0.2 99.1Sloan 2,994*1 99.8*1Clarence 4,639 0.3*1 0.3 99.4GriffithInstitute 3,395 0.1 0.3 0.6 99.1Eden 2,781 0.4 0.1 99.4*1Iroquois 3,988 0.1*1 0.2 99.6Lake Shore 4,273 1.3 0.8 0.4 97.5Grand Island 4,314 1.5 0.1 0.5 97.9Hamburg 6,112 0.1 0.1 99.7Frontier 7,079 0.2 0.3 0.1 99.4Holland 1,802 0.6 0.2 99.3Lackawanna 5,473 16.3 5.2 0.1 78.5Lancaster 6,980 0.4 0.2 99.4Akron 2,045 0.6 6.7 92.7North Collins 1,413 0.2 1.5 2.7 95.6Orchard Park 5,557 0.5 0.2 0.1 99.2Tonawanda 5,157 0.1 0.1 0.4 99.4Kenmore 19,786 0.4 0.3 0.2 99.1West Seneca 14,608 0.3 0.1 0.1 99.5COUNTY TOTAL 215,613 13.0 1.1 0.6 85.2\n\nSOURCE: DX 4; See Record, vol. X, at 68.\n\nON MOTION TO AMEND COMPLAINT\n\nWhen this school desegregation suit was filed in June of 1972, the plaintiffs named the Buffalo Board of Education, Dr. Manch, the Superintendent of Schools, the State Board of Regents, and Mr. Nyquist, the State Commissioner of Education, as defendants. Later, the plaintiffs moved to amend their complaint to add the Common Council of the City of Buffalo and its members, and the Mayor of Buffalo as party defendants. By order dated April 29, 1974, this motion was granted.\n\nThe trial of this action was held in October of 1974. The State defendants for the first time in their post-trial brief (Post-Trial Brief for State Defendants, at 3-5), argue that the Board of Education and the State Board of Regents are not \"persons\" within the scope of 42 U.S.C. ยง 1983, and, therefore, that the court lacks subject matter jurisdiction under 28 U.S.C. ยง 1343(3) with respect to them. There is no question that Dr. Manch and Mr. Nyquist were properly named as parties.\n\nIn 1972, when this case was instituted, the law was clear that municipalities could not be sued for damages under ยง 1983, since they were not \"persons.\" Monroe v. Pape, 365 U.S. 167 [81 S. Ct. 473, 5 L. Ed. 2d 492] (1961). However, several court decisions interpreted Monroe to allow suits solely for equitable relief, such as the plaintiffs seek here, against municipalities. See Schnell v. City of Chicago, 407 F.2d 1084 (7th Cir. 1969); Adams v. City of Park Ridge, 293 F.2d 585 (7th Cir. 1961). This interpretation of the Monroe case was rejected in June 1973, when the Supreme Court decided the case of City of Kenosha v. Bruno, 412 U.S. 507 [93 S. Ct. 2222, 37 L. Ed. 2d 109] (1973). In that case, the Court stated:\n\nWe find nothing in the legislative history discussed in Monroe, or in the language actually used by Congress, to suggest that the generic word \"person\" in ยง 1983 was intended to have a bifurcated application to municipal corporations depending on the nature of the relief sought against them. Since, as the court held in Monroe, \"Congress did not undertake to bring municipal corporations within the ambit of\" ยง 1983 [365 U.S.] at 187 [81 S. Ct. at 484], they are outside of its ambit for purposes of equitable relief as well as for damages. The District Court was therefore wrong in concluding that it had jurisdiction of appellees' complaints under [28 U.S.C.] ยง 1343.\n\nId., at 513 [93 S. Ct. at 2226, 37 L. Ed. 2d at 116].\n\nSince the Kenosha case, several courts have explicitly ruled that school boards are not \"persons\" under ยง 1983. See Monell v. Social Services of the City of New York, 532 F.2d 259 (2d Cir. 1976); Adkins v. Duval County School Board, 511 F.2d 690 (5th Cir. 1975); Harkless v. Sweeny Independent School District, 388 F. Supp. 738 (S.D.Tex. 1975).\n\nThe plaintiffs have now requested leave of this court to amend their complaint to add as parties-defendant in their individual and official capacities the present Superintendent of the Buffalo Schools, and the present members of the Buffalo Board of Education and the State Board of Regents.\n\nThe State defendants argue that this action by the plaintiffs will not cure the jurisdictional defect because of the recent Supreme Court case of Rizzo v. Goode, 423 U.S. 362, 96 S. Ct. 598, 46 L. Ed. 2d 561, 44 U.S.L.W. 4095 (1976), which, in the State defendants' words, \"held that for jurisdiction under ยง 1983, it is necessary to have as parties defendant the actual persons or officials who acted to deprive plaintiffs of constitutional rights.\" (State Defendants' Affidavit in Opposition, at 2). In addition, the City and State attorneys state that since these individuals would now be sued in their individual capacities, they do not represent them.\n\nThe State defendants read too much into the Supreme Court's decision in Rizzo v. Goode, supra. The Supreme Court said in Rizzo that, before injunctive relief may issue to remedy the deprivation of constitutional rights, there must be a showing that the responsible authorities played an affirmative part in the deprivation of those rights. At trial in Rizzo, there was a showing that constitutional rights were violated, but no showing that the named defendants participated.\n\nThe situation in Rizzo is different from the instant case, where plaintiffs allege that the State and City defendants denied them the equal protection of the laws by creating and maintaining segregated schools in the City of Buffalo, and where, at trial, plaintiffs attempted to prove that the Board of Education, through various devices, had segregated and maintained segregation in the schools and the staffs of Buffalo Public School System, and that the State defendants, who have the responsibility under the New York Constitution for public education, allowed the segregation to continue. The Supreme Court itself noted this difference between school desegregation cases and cases like Rizzo, when it said that there is a\n\n. . . critical factual distinction between their case [ Rizzo ] and the desegregation cases decided by this Court. In the latter, segregation imposed by law had been implemented by state authorities . . . whereas in the instant case [ Rizzo ] the District Court found that the responsible authorities had played no affirmative part in depriving . . . any constitutional rights.\n\nId., at 377 [96 S. Ct., at 607, 46 L. Ed. 2d, at 573], 44 U.S.L.W., at 4100.\n\nTherefore, the defendants' reliance on Rizzo is misplaced.\n\nThe Second Circuit in Monell, supra, has stated that \"there is no doubt that municipal and state officials, sued in their official capacities, are 'persons' within the meaning of ยง 1983 when sued for injunctive or declaratory relief.\" (532 F.2d at 264). There is a recognition here of the fiction inherent in the case of Ex Parte Young, 209 U.S. 123, 28 S. Ct. 441, 52 L. Ed. 714 (1908), in which the Supreme Court ruled that although a state cannot be sued under the eleventh amendment, a suit can be maintained against a state official. The requirement of suing \"persons\" instead of municipalities or agencies under ยง 1983 is a further extension of this same fiction. Although a school board itself cannot be sued, individual members can be. And, once the individuals are named, the suit proceeds as if it were against the school board as a separate entity. Indicative of this fiction is the statement of the Supreme Court in Keyes v. School District No. 1, 413 U.S. 189, 210-211 [93 S. Ct. 2686, 2698, 37 L. Ed. 2d 548, 564] (1973):\n\nThe courts below attributed much significance to the fact that many of the Board's actions in the core city area antedated our decision in Brown. We reject any suggestion that remoteness in time has any relevance to the issue of intent. If the actions of school authorities were to any degree motivated by segregative intent and the segregation resulting from those actions continues to exist, the fact of remoteness in time certainly does not make those actions any less \"intentional.\"\n\nIn other words, it is the actions of the school board, and not just the present board members, that are considered by the courts. If the law were otherwise, a school board or other entity could escape responsibility by a change of members whenever suits arose.\n\nFederal Rule of Civil Procedure 15(a) states that \"leave [to amend] shall be freely given when justice so requires.\" Rule 15(c) allows an amendment that changes the party against whom a claim is asserted to relate back to the date of the original complaint if the claim in the amended complaint arose out of the conduct set forth in the original complaint and\n\nthe party to be brought in by amendment (1) has received such notice of the institution of the action that he will not be prejudiced in maintaining his defense on the merits, and (2) knew or should have known that, but for a mistake concerning the identity of the proper party, the action would have been brought against him.\n\nRule 19 states:\n\nA person who is subject to service of process and whose joinder will not deprive the court of jurisdiction over the subject matter of the action shall be joined as a party in the action if (1) in his absence complete relief cannot be accorded among those already parties. . . .\n\nRule 21 states:\n\nMisjoinder of parties is not ground for dismissal of an action. Parties may be dropped or added by order of the court on motion of any party or of its own initiative at any stage of the action and on such terms as are just.\n\nIn addition, 28 U.S.C. ยง 1653 states:\n\nDefective allegations of jurisdiction may be amended, upon terms, in the trial or appellate courts.\n\nMost notably, in Ingraham v. Wright, 498 F.2d 248 (5th Cir. 1974), some minority students sued the Dade County School Board and its superintendent seeking injunctive and declaratory relief against the use of corporal punishment. At the end of the trial in the district court, the defendant motioned to dismiss under Federal Rule of Civil Procedure 41(b). The district court granted the motion.\n\nThe plaintiffs appealed and, at the circuit court, the defendant school board argued that the court was without jurisdiction, citing Kenosha, supra. The Fifth Circuit stated:\n\nThe district court should on remand grant the likely request of plaintiffs to add the individual members of the Dade County School Board as parties defendant.\n\nIngraham, supra, at 252.\n\nIn this case, had the individual defendants been properly named originally, the present members of the Board of Education and the Board of Regents would automatically have been substituted. Federal Rule of Civil Procedure 25(d). Given the fact that in 1972, when this suit was instituted, it was not clear that a school board was not a \"person\" under ยง 1983, and given the fact that no defendant contested this point until the State defendants raised it in their post-trial brief, and that all defendants have been fully represented by counsel each step of the way, we feel that it would be a manifest injustice to deny the plaintiffs' motion. Plaintiffs have stipulated that they do not, and will not, seek attorneys fees from the defendants as private citizens in their individual capacities. Each individual defendant, as a member of either the Buffalo Board of Education or the New York State Board of Regents, is, and has been, fully aware of this lawsuit. As the Supreme Court stated in Mullaney v. Anderson, 342 U.S. 415, 417 [72 S. Ct. 428, 429, 96 L. Ed. 458, 461] (1952), a case in which the plaintiffs petitioned for leave to add two new party plaintiffs in the Supreme Court, the Court stated:\n\nTo dismiss the present petition and require the new plaintiffs to start over in the District Court would entail needless waste and runs counter to effective judicial administration -- the more so since, with the silent concurrence of the defendant, the original plaintiffs were deemed proper parties below.\n\nId., at 417, 72 S. Ct. at 430, 96 L. Ed. at 461.\n\nAttorneys for the State and City defendants have indicated that no new offer of evidence will be forthcoming if this motion is granted.For all the reasons stated above, plaintiffs' motion to amend the complaint is granted.\n\nSo ordered.\n\n\u003cspan class=\"fn\"\u003e1. 42 U.S.C. ยง 1983, entitled, Civil Action for Deprivation of Rights, provides: Every person who, under color of any statute, ordinance, regulation, custom, or usage, of any State or Territory, subjects, or causes to be subjected, any citizen of the United States or other person within the jurisdiction thereof to the deprivation of any rights, privileges, or immunities secured by the Constitution and laws, shall be liable to the party injured in an action at law, suit in equity, or other proper proceeding for redress.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The pertinent section of the fourteenth amendment reads as follows: \"No State shall . . . deny to any person within its jurisdiction the equal protection of the laws.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Plaintiffs' complaint cites 28 U.S.C. ยง 2201 as a jurisdictional basis. This section does not confer jurisdiction on a court where it would not otherwise exist, but merely provides the court with remedial powers. See Nickerson v. United States, 513 F.2d 31, 33 (1st Cir. 1975); Kinsella v. Board of Education of Central School District No. 7, 402 F. Supp. 1155, 1157 (W.D.N.Y.1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Stipulated material will be referred to throughout the text by reference to the numbered stipulation, for example (S-#).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. As judge Gurfein has noted with considerable understatement, most people are \"as reluctant to admit that they have racial prejudice as to admit that they have no sense of humor.\" Hart v. Community School Board of Education, 512 F.2d 37, 50 (2d Cir. 1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Exhibits will be referred to as PX # (Plaintiffs') and DX # (Defendants').\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. N.Y.Educ.Law ยง 3201 (McKinney's 1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. For the first decade or so after Brown, all school desegregation cases concerned southern schools. This case is one of many that have been brought in northern and western cities, such as Denver, Detroit and Boston. For an extensive list of the northern and western city school desegregation suits that have occurred, see United States v. School District of Omaha, 521 F.2d 530, 535, n. 7 (8th Cir. 1975), cert. denied, 423 U.S. 946 []96 S. Ct. 361, 46 L. Ed. 2d 280, 44 U.S.L.W. 3280].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. There was some discussion at trial about exactly how \"segregated\" or \"integrated\" are to be defined. Absolute separation of the races need not be proved to show \"segregated\" conditions. Keyes v. School Dist. No. 1, 413 U.S. 189 [93 S. Ct. 2686, 37 L. Ed. 2d 548] (1973). Nor does the court need to set a precise numerical ratio to indicate what it considers segregated or integrated schools. Suffice it to say that substantial separation of the races amounts to \"segregation\" of the races. See 20 U.S.C. ยง 1720(c). Throughout this opinion, the terms \"imbalance,\" \"segregated,\" \"predominantly majority\" or \"predominantly minority\" are used interchangeably and without a precise mathematical connotation. The question of whether different minority groups should be considered separately in a desegregation suit arose in Keyes, supra. The Supreme Court there ruled that blacks and hispanic Americans should be considered together when defining a \"segregated\" school. 413 U.S. at 197-98 [93 S. Ct. at 2691-92, 37 L. Ed. 2d at 556-57]. For the BPSS, this distinction is not of significant dimensions, since as of October 1973 Spanish-surnamed students comprised only 3.1%, American Indians.8%, and oriental students.1% of the student population. (PX 6, at 6). Unless otherwise noted, minority population figures include all four of these groups.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The court notes the debate, both in the legal and in the public arenas, over the significance between de jure and de facto segregation. Since the plaintiffs in Keyes pleaded and proved de jure segregation, the Supreme Court was not forced to decide whether merely proof of de facto segregation constitutes cognizable legal wrong. Keyes, supra, 413 U.S. at 198 [93 S. Ct. at 2692, 37 L. Ed. 2d at 557]. Justice Douglas nevertheless urged that \". . . it is time to state that there is no constitutional difference between de jure and de facto segregation, for each is the product of state actions or policies.\" Keyes, supra, 413 U.S. at 216 [93 S. Ct. at 2701, 37 L. Ed. 2d at 567] (Justice Douglas concurring). Justice Powell argued that the distinction had slowed the process of integration in the country at large and that it should now be abandoned. Keyes, supra, 413 U.S. at 217-236 [93 S. Ct. at 2701-2711, 37 L. Ed. 2d at 568-579]. He quoted Senator Abraham Ribicoff: Somehow residential segregation in the North was accidental or de facto and that made it better than the legally supported de jure segregation of the South. It was a hard distinction for black children in totally segregated schools in the North to understand, but it allowed us to avoid the problem. 118 Cong.Rec. 5455 (1972). Keyes, supra, 413 U.S. at 219 n. 5 [93 S. Ct. at 2703, 37 L. Ed. 2d at 569]. See also Brief for American Jewish Committee as Amicus Curiae at 6-13. Our circuit adheres to the de jure/de facto distinction, Hart v. Community School Bd. of Educ., 512 F.2d 37, 49 (2d Cir. 1975), and since plaintiffs have alleged de jure segregation, this court need not enter this debate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The Supreme Court further amplified the defendants' burden with this comment: This is not to say, however, that the prima facie case may not be met by evidence supporting a finding that a lesser degree of segregated schooling in the core city area would not have resulted even if the Board had not acted as it did. Keyes, supra, 413 U.S. at 211 [93 S. Ct. at 2698, 37 L. Ed. 2d at 564]. 12 Buffalo's Population 1900-1970: 1900 352,3871910 423,7151920 506,7751930 573,0761940 575,9011950 580,1321960 532,7591970 462,768[PX 263, at 5 (citing U.S. Census Reports, 1900-1970)]. 13 Although complete racial population statistics are not available to the court for the years before 1960, the evidence at trial indicated that the black population in Buffalo grew as follows. Black Population in Buffalo 1910 1,7731930 13,0001940 17,5001943 25,6561946 30,000SOURCE: PX 229, at 1. It was estimated that three out of five new citizens coming to Buffalo during the war years were black. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See APPENDIX. 14a Several factors have been cited to explain the disproportion between the percentage of the black population in the City as a whole and the percentage of black population in the public schools, a phenomenon that is not unique to the BPSS. Among the factors are a higher black birth rate, the suburban exodus of whites, and the disproportionately high enrollment of whites in private and parochial schools. See Farley, Residential Segregation And Its Implications For School Integration, 39 Law and Contemporary Problems 164, 169-174 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. This phenomenon is common to many cities. Id. at 172. 16 ELEMENTARY SCHOOL GROWTH \u0026 DECLINE MINORITY MAJORITY TOTAL Jan. 66 17,756 (35.9%) 31,461 (64.1%) 49,217Oct. 73 17,231 (45.5%) 20,671 (54.5%) 37,902SOURCE: PX 6, at 19. This exhibit is the Ethnic Census of the Buffalo Public Schools 1973-74. The above figures are from page 19. Figures at page 7 of the same exhibit are slightly different. ELEMENTARY SCHOOLS GROWING: 22, 27, 32 (Build Academy), 34, 44, 62, 67, 70, 82 and 86. ELEMENTARY SCHOOLS DECLINING: 1, 3, 4, 6, 8, 9, 11, 12, 16, 17, 18, 19, 21, 23, 26, 28, 29, 30, 31, 33, 36, 37, 38, 39, 40, 41, 42, 43, 45, 47, 48, 49, 51, 52, 53, 54, 56, 57, 59, 60, 61, 63, 64, 65, 66, 68, 69, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 83, 85, 88, 90, 93. Id., at 13-19. 16a This suit was tried in October 1974. The most recent figures in evidence at trial on schools, students and staff in the PBSS were for the 1973-1974 school year. (PX 6).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Included in the 77 elementary schools are four special schools -- 24, 35, 50 and 84. There are also three other special schools with small enrollments that are not included in these figures. They are the Child Care Center, Immaculate Heart of Mary Home, and St. Augustine's.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. N.Y.Educ. Law ยง 3201 (McKinney's 1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. These examples assume that the children would attend academic high schools. If a child chooses to attend a vocational-technical high school, he can choose any vocational-technical school in the city. See section IV-D of this opinion, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Like all rules, there are exceptions. The principal exception that developed over the last decade was the voluntary integration program under which inner-city students could attend predominantly white peripheral schools. See Record, vol. VII, at 108-111. An example of this is West Hertel Middle School, where the minority students, comprising 28% of the student body, are primarily from the inner-city schools. There are other exceptions, also. See discussion in section IV-C of this opinion, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The word \"district\" in this sense refers to an attendance zone for a particular school, and does not indicate a complete school system, as in BPSS or Central School District No. 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The hardship category apparently includes physical and emotional problems, harassment and social adjustment. See page 58, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. An optional area is unique in that a student living there can attend the school in whose zone he lives, or another school. The \"optional\" school's district is usually contiguous to his normal school's district. See section IV-C-2 of this opinion, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. This area, to the east of Main Street, was bounded by East Ferry Street, Michigan Avenue, Virginia Street and Jefferson Avenue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The Board's Director of School Attendance testified at a pre-trial deposition, offered into evidence at trial, as follows: Now, in the East High School District a lot of the white children used to take Polish because in the East High School District it is predominantly a Polish area, it was a Polish community, and they used to come down here and ask for Polish, and we used to allow them to go to maybe South Park or Kensington High School, . . . (PX 296, at 13).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. East High School enrollment was estimated to be in the range of 80% black in the United States Civil Rights Commission report in 1963. (PX 10, at 35).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. In their attempt to show that East High School is \"an all black school in an all black neighborhood\" (Post-trial Brief for City Defendants, at 25), the City defendants called Mr. Anthony Girard who testified about the census tracts comprising the East High attendance zone. (Record, vol. VIII, at 8-18). He listed fourteen census tracts, and then explained their racial composition. All but two of these tracts, listed in DX 9, are overwhelmingly black, and the import of his testimony was that the East High district is overwhelmingly black. The court notes that certain census tracts, which are overwhelmingly white, that are also contained in part in the East High district, were left out of DX 9 and were not mentioned in Mr. Girard's testimony. See PX 289, 290, 291 (census tracts 16, 24, 28, 29). 28 The Department of Health, Education and Walfare's Preliminary Compliance Review of the BPSS, PX 264, at 690-691, indicates that even by 1960 East was the black academic high school in Buffalo, as the following figures show: East 52.4% minorityBennett 12.8% minorityGrover Cleveland 10.5% minorityKensington .3% minorityLafayette 18.2% minorityRiverside .7% minoritySouth Park 2.8% minority\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. In June 1973, the Board of Education undertook a survey to discover where East district high school students were attending school. (DX 12).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The Board of Education did take some of these East district students to court in order to force them to attend school. (Record, vol. VIII, at 37-40).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. See section IV-H of this opinion, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The area west of Main Street has traditionally been predominantly white.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Staff members of the United States Commission on Civil Rights visited Buffalo to examine the BPSS in preparation for the staff report published in 1963. Among the individuals that were interviewed was Superintendent Manch. It was during an interview that Manch made this statement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Letter to Mr. Raphael DuBard, President of the Buffalo Branch of the NAACP, as quoted in PX 10, at 72-74.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Woodlawn Junior High's enrollment was 99% non-white when the school first opened in 1964. In October 1973, it was 99.6% minority. [S-24(b); PX 6, at 21]. 36 The junior high schools and the years in which they were built are listed below. Genesee-Humboldt 1961Fillmore 1962Clinton 1963Woodlawn 1964Southside 1966Fillmore was changed to a middle school in 1967.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Two interoffice memoranda from Board files were put in evidence that indicated that certain optional areas were instituted to promote integration. (PX 42, 43). The Board did not push this position at trial, and we consider these memos' explanation of the optional areas to be self-serving and inaccurate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Other courts have found transfer and optional areas policies having segregative effect to be evidence of segregative intent. See United States v. School District of Omaha, 521 F.2d 530, 540 n. 19, 542 n. 23 (8th Cir. 1975). 39 Each of the vocational-technical high schools specialize in particular areas. The following is a non-comprehensive list. Burgard automotive and air- plane mechanics. Emerson plumbing and car- pentry. Fosdick Masten cosmetology and health sciences. Hutchinson-Central advanced science and Technical mathematics. McKinley graphic arts. Seneca food training.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The court could find no reference in the trial record as to whether the other vocational-technical schools are all male or mixed. The court assumes that young women do attend these schools. * \"Other Staff\" includes teachers, counselors, librarians, etc.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Mr. Reville testified as follows: A. . . . It is my opinion that, -- although I think the staff should be integrated and we have an affirmative policy of integrating staffs, given the racial composition of the schools as it is now, I believe that there ought to be black principals in predominantly black schools and there ought to be black teachers in predominantly black schools. This opinion is not only held by me, but most black teachers and most black principals, and I would say most of the black community because they exert a tremendous amount of pressure on me to assign these principals and teachers to predominantly black schools. Q. This is in spite of the policy of the Board to integrate? A. That's correct, and I feel we have made some headway in the policy, but if I were asked what I felt, do I believe a black principal should be in a predominantly black school, I would have to say again, given the racial composition of our schools now, I think black students need black principals and black teachers for role models and these black teachers and black principals are very important in the community because of their knowledge of the community and their rapport with the students and again my experience with black parents, black community groups, black principals and teachers and black Board members, the way, I think they are almost unanimous in agreeing with me on that particular point, so we are doing something we don't completely agree with. (Record, Vol. VII, at 167-169).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. The constitutionality and/or legality of N.Y.Educ.Law ยง 2573 (McKinney's 1970), which has allegedly hampered the Board in its attempts to attract young minority teachers, is not before the court at this time. ยง 2573 is being contested in this court in another suit, Build of Buffalo v. Board of Education, Civ-74-558.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Until July 1, 1974, the Board members were appointed by the Mayor, N.Y.Educ.Law ยง 2553(3) (McKinney's 1970), subject to confirmation by the Common Council. Since that time, members have been elected to their posts. N.Y.Educ.Law ยง 2553(10) (McKinney's Supp.1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. The Board of Education must submit a budget each year for the Common Council's approval. The Common Council appropriates money for the Board of Education in the City budget, just like any other City department. N.Y.Educ.Law ยง 2576(4) (McKinney's 1970). State monies are apportioned to school districts through a complicated formula based on student attendance within the individual school systems. N.Y.Educ.Law ยงยง 3602, 3602a (McKinney's Supp.1976). In addition, the State funnels funds appropriated by the Federal Government to the school districts of New York. N.Y.Educ.Law ยง 3713 (McKinney's 1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. N.Y.Const. art. XI, ยง 1 (1931) (McKinney's 1969) reads: The legislature shall provide for the maintenance and support of a system of free common schools, wherein all the children of this state may be educated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. The statute states the Commissioner's powers in hyperbolic terms, for his decisions can be reviewed on the limited grounds of arbitrariness. See Radford v. Gage, 59 Misc.2d 948, 301 N.Y.S.2d 282 (Sup.Ct.1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. The first racial census of the public schools in New York State had been ordered by the Commissioner of Education in late 1961 and was completed in 1962. This census only covered grades one to six. (PX 10, at 10; PX 282, at 2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. The Project 1990 Middle School Plan for Buffalo, published in March of 1970, stated: It would take 24 years to integrate the schools of Buffalo at the present rate of progress, even if the white-black proportions in the total school enrollment stay constant. (PX 270, at 25). Commissioner Nyquist, in a report to the Board of Regents in 1973, stated: It has been the exception, rather than the rule, that districts have voluntarily implemented desegregation plans. (PX 298, at CW 7.3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. One of the suggestions for Woodlawn Junior High School was that it be made into a \"magnet\" school. The magnet concept involved making the school's curriculum so attractive that it would draw students from all areas of the city. (PX 278, at 12).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. As the court understands the \"educational park\" concept, one large area consisting of a complex of buildings would house school facilities ranging from fifth grade through community college and would provide a diverse and enriching educational opportunity. The hope was that such an educational park would draw both city and suburban students. (PX 270, at 8-10).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. The incoming inner-city students would not be resegregated at the receiving school by containing them in one large group in the portable classrooms. The portables merely increased the total capacity of each school.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. Section 201, Chapter XII of the City Ordinances, as amended June 11, 1968, is as follows: (The amended portion is underlined). Section 201. Schools, special restrictions and alternate requirements. Notwithstanding any other provisions of this chapter regulating the classification, design, construction or location of buildings or structures, when there presently exists on any site a building or buildings used and occupied for school classrooms or other school purposes, no additional buildings or structures shall be erected or placed on said site unless the additional building or structure is of the same type of construction as the main building located thereon. Subject to the foregoing limitation, it shall be lawful to erect in this city schools and colleges, including the auditoriums and gymnasiums connected therewith, designed, constructed and used in the manner set forth herein, any other provision of this chapter to the contrary notwithstanding. This section shall only apply to such buildings or structures which do not exceed two stories in height; and this section may only take precedence over other applicable provisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Commissioner Nyquist stated at a press conference in February of 1972 that, \"if you carried out that plan [the 4-4-4], . . . we wouldn't be here today.\" (PX 105, at 6).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. Although twelve middle schools had originally been planned, it was later decided that six larger middle schools would be a more feasible idea. (Record, Vol. I, at 181).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. Long before the adoption in 1968 of the 4-4-4 plan by the Board of Education, the schools in Buffalo were on a two tier K to 8 and 9 to 12 system. In the early 1960's the system was in a transitional state, moving towards a three tier system, which would involve grades 1 to 6 in the elementary schools, grades 7 to 9 in junior high schools, and grades 10 to 12 in high schools. (PX 10, at 5). The junior high school system never reached its full implementation and, at the time the 4-4-4 plan was approved by the Board, only 5 junior high schools existed. See n. 36, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. According to various newspaper articles submitted into evidence, numerous civic groups expressed their opposition to the Council's refusal to fund the West Hertel Middle School, including the Buffalo Area Chamber of Commerce, the Rotary Club of Buffalo, the United Jewish Federation of Buffalo, Inc., the Buffalo Elementary and Secondary Principals and Assistant Principals Associations, the Buffalo Branch Inc. of the American Association of University Women, the Buffalo Public School Administrators Association, and the Building Trades Council of Buffalo \u0026 Vicinity (AFL-CIO). (PX 164).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. Commissioner Nyquist at this time was the acting Commissioner of Education.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. For example, the Board at one point reported that in September 1970 Bennett High School was to be redistricted to improve racial balance. The improvement in the minority enrollment at Lafayette High School was approximately 1.3% (to about 30%), and in the enrollment at Grover Cleveland High School, approximately 2.2% (to about 14.6%). (PX 278, at 22).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. One Board member, at a February 1, 1972 Board meeting concerning the Commissioner's order, stated: \"I suggest that we treat the Commissioner respectfully but as an adversary.\" [PX 105(a), at 95].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. No action has been taken on this report. (S-108).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. In a press conference in February of 1972, the Commissioner was questioned about possible alternatives if the Board failed to agree on a desegregation plan as he had ordered. Mr. Nyquist stated: Well I hope it won't come to that. I said to the Board this morning, got the same question, the Board is divided. I mean there's some difference of opinion on the Board as you probably know. I was asked that question and I said I'd jump off that bridge when I came to it because we have no precedent in this State, not to my knowledge, where a Board has refused to go along with a racial integration plan for a judicial decision of the Commissioner unless it was brought into the courts. There are two remedies in the law, and you can read the law as well as I can, when a Board -- see a school district or school board is an extension of the State. Education is a state function and when a Board refuses to carry out educational policies the Board of Regents or the Commissioner of Education, the two remedies that are specifically stated are the withholding of state aid and the initiation of proceedings to remove the Board. And I hope we don't have to come to that. (PX 105) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. The Board President had written the Deputy Commissioner in January of 1973. Shortly thereafter, another Board member wrote Mr. Sheldon and said that the . . . letter is phrased in terms of bussing, but to be realistic what he is saying to you is that the Board majority, as presently constituted, has no interest in talking about school desegregation regardless of the manner in which it might be accomplished. (PX 268).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. A show cause order was finally served in January 1975. As of April 10, 1975, the hearing on this order (originally scheduled for February 14, 1975) had been indefinitely post-poned. (Plaintiffs' Post-Trial Reply Brief at 5, filed April 10, 1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. N.Y.Educ.Law ยง 101 (McKinney's 1969) states in pertinent part: The regents also may appoint and, at pleasure, remove a deputy commissioner of education, who shall perform such duties as the regents may assign him by rule and who, in the absence or disability of the commissioner or when a vacancy exists in the office of commissioner, shall exercise and perform the functions, powers and duties conferred or imposed on the commissioner by this chapter. (emphasis added). See Ex parte Anderson, 282 App.Div. 993, 125 N.Y.S.2d 701, leave to appeal denied, 283 App. Div. 748, 128 N.Y.S.2d 581 (3rd Dept. 1954).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. More recent figures on housing were not admitted into evidence. It should be noted, however, that housing patterns are not changed overnight. See Testimony of Martin Sloan, Record, Vol. VI, at 47, quoted in section IV-H(4) of this opinion, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. It was not only in the sale and purchase of real estate that black citizens ran into discrimination. Testimony at trial indicated that rental housing in Buffalo is comprised mainly of owner-occupied two-family dwelling units. (Record, Vol. V, at 111-112). Such housing is specifically exempted from coverage by Federal, State and City anti-discrimination housing laws. In 1967, the City of Buffalo applied to the Federal Government for a Model Cities grant. In the application, three barriers to open housing facing citizens in the model neighborhood area were detailed: short supply of rental housing, limited incomes of citizens in this area of the city, and discrimination in housing. (PX 260, pt. III, at 25). The application stated a number of goals the City would attempt to reach, including the removal of \"all barriers to unrestricted, free and equal access to all Buffalo area housing.\" (Id., at 27). Among the approaches that the City specifically pledged would be adopted to achieve the open housing goal was \"[the] provision of totalcoverage fair housing legislation together with machinery for vigorous enforcement.\" (Id., at 28). A resolution that directed the Corporation Counsel to draw up a total coverage fair housing law was introduced in the Common Council by Councilman Johnson in 1968.(PX 171). But, notwithstanding the City's pledge in its Model Cities appelication, no open housing legislation was ever passed. (Record, Vol. IV, at 114-115).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. Whether residential segregation is due to State action or private action, or even if it merely is due to fortuitous external factors, the possible consequence is that by rigidly adhering to geographic criteria over a long period of time the school board assures the parent who does not want his children to go to school with Negroes that this desire can be fulfilled by moving into a white neighborhood. The invasion-succession sequence is also fortified by the use of geographic criteria since it assures the white parent that if he moves out of the neighborhood \"invaded\" by the Negro, he will be leaving the Negro behind. Fiss, Racial Imbalance In The Public Schools: The Constitutional Concepts, 78 Harv.L.Rev. 564, 587-588 (1965). *1 - less than one percent\u003c/span\u003e\n\n",
    "body_length": 200543,
    "citedas": [
      "415 F. Supp. 904"
    ],
    "attorneys": "Richard F. Griffin, Buffalo, New York, for Plaintiffs. Curtin, Chief Judge.",
    "category": [
      "243",
      "36",
      "75"
    ],
    "judges": "CURTIN, Chief Judge.",
    "citation_count": 0
  }
}
