{
  "id": "EYkdQGYBTlTomsSB4wLe",
  "document": {
    "title": "Parents Involved in Community Schools v. Seattle School District",
    "full_title": "PARENTS INVOLVED IN COMMUNITY SCHOOLS, A WASHINGTON NONPROFIT CORPORATION -COUNTER-DEFENDANT-APPELLANT, v. SEATTLE SCHOOL DISTRICT, NO. 1, A POLITICAL SUBDIVISION OF THE STATE OF WASHINGTON; JOSEPH OLCHEFSKE, IN HIS OFFICIAL CAPACITY AS SUPERINTENDENT; BARBARA SCHAAD-LAMPHERE, IN HER OFFICIAL CAPACITY AS PRESIDENT OF THE BOARD OF DIRECTORS OF SEATTLE PUBLIC SCHOOLS; DONALD NIELSEN, IN HIS OFFICIAL CAPACITY AS VICE PRESIDENT OF THE BOARD OF DIRECTORS OF SEATTLE PUBLIC SCHOOLS; STEVEN BROWN; JAN KUMASAKA; MICHAEL PRESTON; NANCY WALDMAN, IN THEIR OFFICIAL CAPACITIES AS MEMBERS OF THE BOARD OF DIRECTORS -COUNTER-CLAIMANTS-APPELLEES.",
    "jurisdiction": "Ninth Circuit",
    "date": "2004-07-27T00:00:00.000Z",
    "docket": "No. 01-35450",
    "body": "FOR PUBLICATION\n\nArgued and Submitted December 4, 2001-Seattle, Washington\n\nOpinion Filed April 16, 2002\n\nOpinion Withdrawn and Question Certified June 17, 2002\n\nCertificate of Finality Received September 8, 2003\n\nReargued and Resubmitted December 15, 2003-Portland, Oregon\n\nOpinion by Judge O'Scannlain; Dissent by Judge Graber\n\nOPINION\n\nFollowing the Washington Supreme Court's resolution of certified state-law questions, we must decide whether the use of race in determining which students will be admitted to oversubscribed high schools in Seattle, Washington violates the federal Constitution's Equal Protection Clause.\n\nI.\n\nThis opinion marks the fourth time a federal court has addressed the Seattle Public Schools' use of an explicit \"racial tiebreaker\" in choosing which student applicants it will admit to the City's most popular public high schools. See Parents Involved in Cmty. Schs. v. Seattle Sch. Dist. No. 1, 137 F. Supp. 2d 1224 (W.D. Wash. 2001) [Parents Involved I], rev'd, 285 F.3d 1236 (9th Cir. 2002) [Parents Involved II], withdrawn, 294 F.3d 1084 (9th Cir. 2002), certifying questions, 294 F.3d 1085 (9th Cir. 2002) [Parents Involved III]. We draw the following restatement of facts largely from Parents Involved II.\n\nA.\n\nSeattle School District Number 1 (the \"School District\") operates ten public high schools: Ballard, Chief Sealth, Cleveland, Franklin, Garfield, Ingraham, Nathan Hale, Rainier Beach, Roosevelt, and West Seattle. Four of these (Ballard, Ingraham, Nathan Hale, and Roosevelt) are located north of downtown Seattle; of the remaining six, five (Chief Sealth, Cleveland, Franklin, Garfield, and Rainier Beach) are located south of downtown, and one (West Seattle) is located directly west of downtown.\n\nThese schools vary widely in quality, as measured by such factors as standardized test scores,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e numbers of college preparatory and Advanced Placement (AP) courses offered and the availability of an Internal Baccalaureate (IB) program, percentages of students taking AP courses and SATs, percentages of graduates who attend college, Seattle Times college-preparedness rankings, University of Washington rankings, and disciplinary statistics. Moreover, some of the schools offer unique educational programs or opportunities not offered in other schools.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe School District has never been segregated by law. However, due to Seattle's racially imbalanced housing patterns,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e if Seattle's children were simply assigned to the high schools nearest their homes, those schools would tend to reflect such imbalance. That is, the demographic profile of the individual high schools would not mirror the demographic makeup of the city's student population as a whole.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e As part of its continuing efforts to prevent such imbalance and to promote racial diversity in its high schools, the School District has adopted an open choice plan instead of simply assigning students to the high schools nearest their homes. Pursuant to this system, each student may choose to attend any of the ten high schools in the city, so long as there is room available in that school.\n\nThe District's open choice plan provides for a multi-step application process. Each student is first asked to rank the high schools he or she would like to attend. If a student is not admitted to his or her first-choice school because that school is full, the School District attempts to assign him or her to his or her second-choice school, and so on. If a student is not admitted to any of his or her chosen schools, he or she receives a mandatory assignment to a school with available space.\n\nNot surprisingly, a significant problem arises when a school becomes \"oversubscribed\"-that is, when more students want to attend that school than there are spaces available. For the academic year 2000-01, five of the School District's high schools were oversubscribed and five were undersubscribed.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The magnitude of oversubscription during the 2000-01 school year underscores its problematic nature: Approximately 82 percent of students selected one of the oversubscribed high schools as their first choice, while only about 18 percent picked one of the undersubscribed high schools as their first choice.\n\nTo resolve the dilemma of oversubscription, the School District's high school assignment plan uses a series of four \"tiebreakers\" to determine which students will be admitted to each oversubscribed school. The first tiebreaker gives a preference to students with siblings already attending the requested school. This tiebreaker accounts for somewhere between 15 percent and 20 percent of high school assignments. If a school is still oversubscribed after applying this first tiebreaker, the School District proceeds to a second tiebreaker, which is based entirely on race. For purposes of the racial tiebreaker, students are deemed to be of the race specified in their registration forms, which ask parents to identify their child's race. Because registration must be completed in person by a parent, if a parent declines to specify a racial category, the School District assigns the student a category based on a visual inspection of the parent (and, if present, the student) at the time of registration. It is this second-racial-tiebreaker that spawned the present suit.\n\nUse of the racial tiebreaker is designed to balance the racial makeup of the city's public high schools. Accordingly, if an oversubscribed school's demographic profile deviates from the overall demography of Seattle's student population (approximately 40 percent white and 60 percent non-white) by more than a set number of percentage points, the School District designates that school \"integration positive.\" The racial tiebreaker is then applied in the course of determining admissions to such schools, so that students whose race (coded by the School District simply as white or non-white) will push an integration positive school closer to the desired racial ratio are automatically admitted.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Thus, at Franklin (for instance), whites are admitted preferentially because they are white; and at Ballard, non-whites are admitted preferentially because they are not white.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Ultimately, the School District's use of this racial tiebreaker determines where about 10 percent of applicants will be admitted.\n\nOnce all students of the preferred racial category are admitted to an oversubscribed high school, any remaining \"ties\" are broken by resort to a third variable: distance. Quite simply, applicants are admitted on the basis of the mileage between their homes and the school to which they seek admission, with those who live closest admitted first. Although a fourth tiebreaker exists-a random lottery-it rarely is invoked because distances are calculated to one hundredth of a mile for purposes of the preceding tiebreaker.\n\nB.\n\nParents Involved in Community Schools (\"Parents\") is \"a nonprofit corporation formed by parents whose children have been or may be denied admission to the high schools of their choosing solely because of race.\" It commenced this legal action in July of 2000, contending that the School District's use of the racial tiebreaker for high school admissions is illegal under both state and federal law. Specifically, Parents alleged that by using race to decide who will be admitted to the oversubscribed high schools, the School District engages in illegal racial discrimination prohibited by the Washington Civil Rights Act (\"Initiative 200\"),\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e the Equal Protection Clause of the Fourteenth Amendment,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e and Title VI of the Civil Rights Act of 1964.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nBoth Parents and the School District moved for summary judgment on all claims; neither contended that genuine issues of material fact precluded summary judgment. In a published opinion dated April 6, 2001, the district court upheld the use of the racial tiebreaker under both state and federal law, granting the School District's motion and denying the Parents's. See Parents Involved I, 137 F. Supp. 2d at 1240. Parents timely filed an appeal in this court and, on April 16, 2002, we issued an opinion reversing the district court's decision. Acting \"in our constitutionally ordained role as oracles of Washington law,\" Parents Involved II, 285 F.3d at 1243, we prophesied that the School District's use of the racial tiebreaker violated Initiative 200. Id. at 1244.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Simultaneously, we enjoined the School District from using the racial tiebreaker in its system of high school admissions pending further order from this court. Id. at 1257.\n\nWhile the School District's petitions for rehearing and rehearing en banc were pending before us, it \"bec[a]me clear that [we could not] provide a definitive [legal] answer before assignments [were to] be made for the 2002-03 year, and therefore, . . . that our sole reason for not certifying this question to the Washington Supreme Court ha[d] dissolved.\" Parents Involved III, 294 F.3d at 1086. Consequently, we granted the petition for rehearing, withdrew our opinion, and vacated our injunction. See id. Simultaneously, we entered an order certifying to the Supreme Court of Washington the question whether\n\n[b]y using a racial tiebreaker to determine high school assignments, [the] Seattle School District Number 1 \"discriminate[s] against, or grant[s] preferential treatment to, any individual or group on the basis of race, . . . color, ethnicity, or national origin in the operation of public education\" in violation of Initiative 200. . . . ?\n\nId. at 1087.\n\nThe Supreme Court of Washington accepted certification, heard oral argument in the matter, and on June 26, 2003 issued an opinion concluding that I-200 \"does not prohibit the Seattle School District's open choice plan tie breaker based upon race so long as it remains neutral on race and ethnicity and does not promote a less qualified minority applicant over a more qualified applicant.\" Parents Involved in Cmty. Schs. v. Seattle Sch. Dist. No. 1, 72 P.3d 151, 166 (Wash. 2003). It therefore \"return[ed] the case to the federal court for further proceedings consistent with [its] resolution of the questions of Washington law,\" id. at 167, and formally notified this court of its actions by delivery of a Certificate of Finality on September 8, 2003.\n\nAll state law issues having been definitively decided, the parties prepared supplemental briefing on the remaining federal constitutional question in light of the Supreme Court's intervening decisions in the University of Michigan affirmative actions cases-Gratz v. Bollinger, 539 U.S. 244 (2003), and Grutter v. Bollinger, 539 U.S. 306 (2003)-followed by reargument.\n\nII.\n\nAs a preliminary matter, we must address whether the passage of time has mooted Parents's action. Article III's case-or-controversy requirement mandates that the parties to a federal court action must \"continue to have a personal stake in the outcome of the lawsuit\" at all stages of the proceedings. United States v. Verdin, 243 F.3d 1174, 1177 (9th Cir. 2001) (internal quotation marks and citation omitted). \"This means that, throughout the litigation, the plaintiff must have suffered, or be threatened with, an actual injury traceable to the defendant and likely to be redressed by a favorable judicial decision.\" Spencer v. Kemna, 523 U.S. 1, 7 (1998) (quoting Lewis v. Cont'l Bank Corp., 494 U.S. 472, 477-478 (1990)). As with any jurisdictional inquiry-and notwithstanding the parties' unhesitating agreement that Parents's action remains a live controversy appropriately subject to federal adjudication on the merits-we are charged with an independent constitutional responsibility to verify our authority to resolve their litigation. See Dittman v. California, 191 F.3d 1020, 1025 (9th Cir. 1999).\n\nInitially, we have little doubt that the associational aspect of Parents's standing has not been mooted. At reargument, counsel for Parents informed us that several of the association's members have children who, over the course of the next several years, will be applying for admission to the School District's public high schools and who thus will be subject to the admissions policies established by the School Board. Because \"some members of the [association] [c]ould [continue to] have . . . standing to bring this suit in their own right,\" Int'l Union, United Auto., Aerospace \u0026 Agric. Implement Workers of Am. v. Brock, 477 U.S. 274, 286 (1986), and because the passage of time has not called into question Parents's satisfaction of the other requirements for associational standing, see Friends of the Earth, Inc. v. Laidlaw Envtl. Serv. (TOC), Inc., 528 U.S. 167, 181 (2000), we are satisfied that the associational aspect of Parents's standing has continued vitality.\n\nPerhaps more troubling, however, is the disclosure that the School District is not currently employing-and has not since the 2001-02 school year employed-the racial tiebreaker that Parents challenge in this litigation. As noted earlier, we enjoined the School District's use of the racial tiebreaker with our initial disposition of this case. See Parents Involved II, 285 F.3d at 1257. And although we vacated that injunction with the withdrawal of our initial opinion, see Parents Involved III, 294 F.3d at 1086, the School District has voluntarily declined to reinstate its racial tiebreaker during the pendency of this litigation. With the passage of time, the voters of Seattle have elected a new School Board,\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e and there is at least a remote possibility that the new Board will opt not to resume its use of the racial tiebreaker that prompted this lawsuit.\n\nNonetheless, it is beyond cavil that \" 'a defendant's voluntary cessation of a challenged practice does not deprive a federal court of its power to determine the legality of the practice' unless it is 'absolutely clear that the allegedly wrongful behavior could not reasonably be expected to recur.' \" Buckhannon Bd. \u0026 Care Home v. W. Va. Dep't of Health \u0026 Human Res., 532 U.S. 598, 609 (2001) (emphases added) (quoting Friends of the Earth, 528 U.S. at 189, with internal quotation marks and citations omitted). Indeed, in these circumstances, a \"heavy burden of persuading the court that the challenged conduct cannot reasonably be expected to start up again lies with the party asserting mootness.\" Adarand Const., Inc. v. Slater, 528 U.S. 216, 222 (2000) (emphasis in original) (internal quotation marks and citations omitted). The problem here, of course, is that neither party has asserted that this case is moot: When asked at oral argument about the possibility that we lack jurisdiction over Parents's action, counsel for the School District not only maintained that this controversy remains live, but questioned whether the Board would have him defend the racial tiebreaker if it did not intend to reinstate the challenged policy in the future.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIndeed, where a court must address sua sponte the possibility that the passage of time has mooted litigation on alternative grounds (for instance, that the associational aspect of a plaintiff's standing no longer satisfies Article III jurisdictional requirements), we find it hard to imagine that a defendant's voluntary cessation could ever operate itself to moot the underlying litigation. By virtue of the fact that neither party will have alleged mootness in the first instance, there is no one to \"satisfy the heavy burden of persuasion\" that well-established doctrinal precepts require a party to demonstrate before voluntary cessation can be held to moot a once live case or controversy. See United States v. Concentrated Phosphate Export Ass'n, 393 U.S. 199, 203 (1968). We therefore conclude that the present case remains live.\n\nIII.\n\nWe now turn to the heart of Parents's claim: that the School District's use of race to determine who will be admitted to its oversubscribed public high schools constitutes illegal racial discrimination in violation of both the Fourteenth Amendment and Title VI.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nA.\n\n[1] Forged in the crucible of Reconstruction and \"[p]urchased at the price of immeasurable human suffering,\" Adarand Const., Inc. v. Peña, 515 U.S. 200, 240 (1995) (Thomas, J., concurring), the Equal Protection Clause of the Fourteenth Amendment mandates that \"No state shall . . . deny to any person within its jurisdiction the equal protection of the laws.\" U.S. Const. amend. XIV, § 1. \"Because the Fourteenth Amendment 'protects persons, not groups,' all governmental action based on race-a group classification long recognized as in most circumstances irrelevant and therefore prohibited-should be subjected to detailed judicial inquiry to ensure that the personal right to equal protection of the laws has not been infringed.\" Grutter, 539 U.S. at 326 (quoting Adarand, 515 U.S. at 227 (1995) (quoting Hirabayashi v. United States, 320 U.S. 81, 100 (1943))) (emphasis in original); see also Ho v. S.F. Unified Sch. Dist., 147 F.3d 854, 865 (9th Cir. 1998) (\"It is as a person that each of us has these rights that are so majestically secured.\"). Therefore, \"any person, of whatever race, has the right to demand that any governmental actor subject to the Constitution justify any racial classification subjecting that person to unequal treatment under the strictest of judicial scrutiny.\" Adarand, 515 U.S. at 224; see also Coalition for Econ. Equity v. Wilson, 122 F.3d 692, 702 (\"The standard of review under the Equal Protection Clause does not depend on the race or gender of those burdened or benefitted by a particular classification. . . . '[A]ny individual suffers an injury when he or she is disadvantaged by the government because of his or her race.' \") (quoting Adarand, 515 U.S. at 230).\n\n[2] For race-based educational policies \"[t]o withstand strict scrutiny analysis, respondents must demonstrate that the[ir] use of race in [their] current admission program employs 'narrowly tailored measures that further compelling governmental interests.' \" Gratz, 539 U.S. at 270 (quoting Adarand, 515 U.S. at 227); see also Hunter v. Regents of Univ. of Calif., 190 F.3d 1061, 1063 (9th Cir. 1999) (\"To meet the strict scrutiny test, the Regents must demonstrate that . . . consideration of race/ethnicity is narrowly tailored to serve a compelling governmental interest.\") (first emphasis added); Ho, 147 F.3d at 865 (\"Once the plaintiffs established the School District's use of racial classifications . . . the School District has the duty to justify them. . . . At trial, the School District will bear the burden of proving that [its use of race] is a 'narrowly tailored measure that furthers compelling government interests.' \") (quoting Adarand, 515 U.S. at 227) (emphasis added); Monterey Mech. Co. v. Wilson, 125 F.3d 702, 713 (9th Cir. 1997) (\"The burden of justifying different treatment by ethnicity or sex is always on the government.\"). Notwithstanding its remarkable assertions to the contrary, it is thus quite plainly the School District which bears the weighty burden of demonstrating that its use of the racial tiebreaker in its open choice admissions program satisfies the \"most searching examination\" demanded by strict scrutiny, Gratz, 539 U.S. at 270 (quotations and citations omitted): that is, that the racial tiebreaker is designed to further a compelling governmental interest, and that the manner in which it does so is narrowly tailored to achieve that interest.\n\nB.\n\nIn papers prepared for purposes of this litigation, the School District has proffered an array of interrelated and putatively compelling interests in pursuit of which it seeks to employ the racial tiebreaker in its open choice high school admissions program. These myriad interests include the School District's desires to achieve: \"the educational benefits of attending a racially and ethnically diverse school\"; \"integration of schools which, as a result of housing patterns and the tendency of many parents to choose schools close to home, would otherwise tend to become racially isolated\"; \"ensuring that public institutions are open and available to all segments of American society\"; \"alleviating de facto segregation\"; \"increasing racial and cultural understanding\"; \"avoiding racial isolation\"; fostering \"cross-racial friendships\"; and \"reduc[ing] prejudice and increas[ing] understanding of cultural differences.\" Perhaps its most articulate statement supporting use of the racial tiebreaker is the School Board's policy \"Statement Reaffirming [the] Diversity Rationale.\" It explains:\n\nDiversity in the classroom increases the likelihood that students will discuss racial or ethnic issues and be more likely to socialize with people of different races. Diversity is thus a valuable resource for teaching students to become citizens in a multi-racial/ multi-ethnic world.\n\nProviding students the opportunity to attend schools with diverse student enrollment also has inherent educational value from the standpoint of education's role in a democratic society. . . . Diversity brings different viewpoints and experiences to classroom discussions and thereby enhances the educational process. It also fosters racial and cultural understanding, which is particularly important in a racially and culturally diverse society such as ours.\n\nBased on the foregoing rationale, the Seattle School District's commitment is that no student should be required to attend a racially concentrated school. The District is also committed to providing students with the opportunity to voluntarily choose to attend a school to promote integration. The District provides these opportunities for students to attend a racially and ethnically diverse school, and to assist in the voluntary integration of a school, because it believes that providing a diverse learning environment is educationally beneficial for all students.\n\n[3] To the extent Parents once may have been able to make out a colorable claim that the only interest sufficiently compelling to justify the use of racial classifications is the remediation of past official discrimination,\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e such anargument no longer obtains. In Smith v. University of Washington, this court followed Justice Powell's solo concurrence in Regents of the University of California v. Bakke, 438 U.S. 265 (1978), observing that \"educational diversity is a compelling governmental interest that meets the demands of strict scrutiny of race-conscious measures.\" 233 F.3d 1188, 1201 (9th Cir. 2000). And in its landmark 2003 opinion in Grutter, the Supreme Court settled any debate over the validity of employing racial preferences for non-remedial purposes by asserting that it had \"never held that the only governmental use of race that can survive strict scrutiny is remedying past discrimination.\" Grutter, 539 U.S. at 328 (O'Connor, J.).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Indeed, it expressly sanctioned the so-called \"diversity rationale\" articulated by the University of Michigan in support of employing such preferences in determining which applicants would be offered admission to its selective law school. See id. 328-33. It is upon Justice O'Connor's elaboration of the diversity rationale that we now focus our attention.\n\n1.\n\nIn part due to a recognition that the diversity rationale had often been criticized as \"amorphous,\" \"abstract,\" \"malleable,\" and \"ill-defined,\" see, e.g., Metro Broad., 497 U.S. at 612 (O'Connor, J., dissenting); Wessmann v. Gittens, 160 F.3d 790, 796 (1st Cir. 1998); Lutheran Church-Missouri Synod v. FCC, 141 F.3d 344, 354 (D.C. Cir. 1998); Johnson v. Bd. of Regents, 106 F. Supp. 2d 1362, 1371 (S.D. Ga. 2000); Tracy v. Bd. of Regents, 59 F. Supp. 2d 1314, 1321 (S.D. Ga. 1999); cf. Grutter, 539 U.S. at 350 \u0026 354 n.3 (Thomas, J., dissenting) (deriding the interest in \"diversity\" as \"a faddish slogan of the cognoscenti\" and describing the concept as being \"more a fashionable phrase than it is a useful term\"), the University of Michigan and its aligned amici mounted a concerted effort to bring much-needed clarity. In a remarkable series of briefs, these groups assembled both social scientific evidence and observational reports from business, industry, and military leaders regarding the \"substantial\" educational and societal benefits that flow from an educational institution's \"enroll[ment of] a critical mass of minority students.\" Grutter, 539 U.S. at 330 (citation and quotation omitted).\n\nAmong the benefits attributed by the University and its amici to the enrollment of a minimal core of minority students, and embraced by the Court under the broad rubric of the diversity rationale, are the promotion of \"cross-racial understanding,\" the \"break[ing] down of racial stereotypes,\" and the fact that \"classroom discussion is livelier, more spirited, and simply more enlightening and interesting when the students have the greatest possible variety of backgrounds.\" Id. at 330 (citations and quotations omitted). Justice O'Connor's opinion for the Court also explained that \"student body diversity promotes better learning outcomes, and better prepares students for an increasingly diverse workforce and society,\" and noted \"that the skills needed in today's increasingly global marketplace can only be developed through exposure to widely diverse people, cultures, ideas, and viewpoints.\" Id.; see also Brief for Respondents at 11, Gratz v. Bollinger, 539 U.S. 244 (2003) (No. 02-516) (\"Racial and ethnic diversity is educationally important because, notwithstanding decades of progress, there remain significant differences in our lives and perceptions that are undeniably linked to the realities of race. Continuing patterns of residential segregation, for example, mean that the daily events and experiences that make up most Americans' lives take place in strikingly homogenous settings. As a result, most students entering college have had few opportunities for meaningful interactions across lines of race and ethnicity. This separation . . . provides little opportunity to disrupt racial stereotypes . . . .\").\n\nFinally, the majority emphasized testimony that, in the absence of race-conscious admissions, \"underrepresented minority students would have comprised 4 percent of the [school's] entering class in 2000, instead of the actual figure of 14.5 percent,\" id. at 320, and that a principal aim of the program was to prevent racial isolation. Id. at 318 \u0026 319; see also id. at 380-81 (Rehnquist, C.J., dissenting) (noting that the university's focus on achieving a \"critical mass\" of minority students was premised on \"enroll[ing] enough minority students to provide meaningful integration of its classrooms and residence halls\" and reducing the effects of \"isolat[ion] by racial barriers\") (quoting Brief for Respondents at 5).\n\n2.\n\nRecognizing that each of the School District's proffered interests in using its racial tiebreaker falls comfortably within the diversity rationale as that justification's aims and benefits were articulated to (and embraced by) the Court, see supra at 10003-04, Parents and their amici seek to cabin Grutter's reach by contending that the Court's compelling interest analysis was expressly limited to the use of race in admissions in the context of \"the expansive freedoms of speech and thought associated with the university environment.\" Grutter, 539 U.S. at 330. We of course acknowledge that Grutter addressed the use of racial classifications in higher education, and that language in the Court's opinion reflects that factual underpinning.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e But we cannot identify a principled basis for concluding that the benefits the Court attributed to the existence of educational diversity in universities cannot similarly attach in high schools. We simply do not see how the government's interest in providing for diverse interactions among 18 year-old high school seniors is substantially less compelling than ensuring such interactions among 18 year-old college freshmen. Cf. Grutter, 539 U.S. at 347 (Scalia, J., dissenting) (\"The 'educational benefit' that the University . . . seeks to achieve by racial discrimination consists, according to the Court, of 'cross-racial understanding,' and 'better preparation of students for an increasingly diverse workforce and society,' all of which is necessary not only for work, but also for good 'citizenship.' This is not, of course, an 'educational benefit' [but] the same lesson taught to . . . people three feet shorter and twenty years younger . . . in institutions ranging from Boy Scout troops to public-school kindergartens.\") (quoting Grutter, 539 U.S. at 331) (citations and alterations omitted).\n\n3.\n\n[4] At bottom, Grutter plainly accepts that constitutionally compelling internal educational and external societal benefits flow from the presence of racial and ethnic diversity in educational institutions. In support of its racial tiebreaker, the School District invokes precisely the interest sanctioned by the Supreme Court: securing those benefits. Those benefits are as compelling in the high school context as they are in higher education. We therefore conclude that the District has satisfied its first burden under strict scrutiny: It has articulated a compelling interest in pursuit of which it seeks to use a racial classification.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nC.\n\nOf course, to hold that the School District has invoked a compelling interest in pursuit of which it seeks to employ the racial tiebreaker is merely to begin our inquiry. Because \" 'racial classifications are simply too pernicious to permit any but the most exact connection between justification and classification,' \" Gratz, 539 U.S. at 270 (quoting Fullilove, 448 U.S. at 537 (Stevens, J., dissenting)), the School District also bears the burden of demonstrating that its use of the racial tiebreaker is narrowly-tailored to further that interest. See Hunter, 190 F.3d at 1063; Ho, 147 F.3d at 865. As with respect to compelling interest analysis, Grutter and Gratz shed much-needed light on the once crepuscular contours of the narrow tailoring test applicable to the non-remedial use of racial preferences in educational admissions. Careful attention to these decisions-and the ways they addressed the divergent undergraduate and law school admissions schemes at the University of Michigan-is especially warranted.\n\n1.\n\nAs Grutter outlined, the admissions process at the University of Michigan Law School functions roughly as follows. Every completed application received by the Law School is both read and considered holistically by admissions officials. A significant focus of the decisionmakers is on an applicant's academic ability, as measured by his or her undergraduate grade point average and score on the Law School Admissions Test (LSAT). Even so, these \"hard\" measures are insufficient to resolve admissions decisions: Just as \"the highest score does not guarantee admission[, neither] does a low score disqualify an applicant.\" Grutter, 539 U.S. at 315. Instead, admissions officials must look beyond those measures to \"soft\" variables, including \"the enthusiasm of the [applicant's] recommenders, the quality of the undergraduate institution, the quality of the applicant's essay, and the areas and difficulty of undergraduate course selection,\" which in turn are used to help measure \"an applicant's likely contributions to the intellectual and social life of the institution.\" Id. (internal quotations omitted).\n\nThis focus on \"soft\" variables aims to ensure that the Law School can \" 'achieve that diversity which has the potential to enrich everyone's education and thus make a law school class stronger than the sum of its parts.' \" Id. (quoting the Law School's written admissions policy). While recognizing that there are \" 'many possible bases for diversity admissions,' \" the admissions policy\n\n\"reaffirm[s] the Law School's longstanding commitment to 'one particular type of diversity,' that is, 'racial and ethnic diversity with special reference to the inclusion of students from groups which have been historically discriminated against . . . , who without this commitment might not be represented in our student body in meaningful numbers.' \"\n\nId. at 316 (quoting policy). Of note, the policy seeks to ensure the enrollment of a \"critical mass\" of underrepresented minority students through the use of a calibrated racial preference-in the absence of which such students would comprise just 4 percent of the law school's entering class, and thereby be less likely as a group fully to \" 'make unique contributions to the character of the Law School.' \" Id. (quoting policy). Crucially, \"[t]he policy does not define diversity 'solely in terms of racial and ethnic status,' \" id. (quoting policy), but rather gives \"serious consideration to all the ways an applicant might contribute to a diverse educational environment.\" Id. at 337.\n\nTurning to the constitutionality of the program, Justice O'Connor immediately honed in on its core features: its flexibility and breadth. In concert with the baseline constitutional prohibition against quotas, id. at 334 (\"[A] race-conscious admissions program cannot use a quota system-it cannot 'insulate each category of applicants with certain desired qualifications from competition with all other applicants.' \") (quoting Bakke, 438 U.S. at 315 (Powell, J., concurring)), the law school \"consider[s] race [and] ethnicity more flexibly as a 'plus' factor in the context of individualized consideration of each and every applicant.\" Id. Moreover, she explained, the Law School's policy strenuously avoids evaluating individual applicants \"in a way that makes [their] race or ethnicity the defining feature of [their] application.\" Id. at 337. Conforming to the \"paramount\" constitutional requirement of truly \"individualized consideration in the context of a race-conscious admissions program,\" id. at 337, the Law School's admissions officers shun a \"policy, either de jure or de facto, of automatic acceptance or rejection based on any 'soft' variable,\" and awards \"no mechanical, predetermined diversity 'bonuses' based on race or ethnicity.\" Id.\n\nQuite in contrast, the school refuses to \"limit in any way the broad range of qualities and experiences that may be considered valuable contributions to student body diversity,\" id. at 338, and illustrates the strength of its commitment to that principle by highlighting a variety of non-racial criteria the institution considers valuable-for instance, that an applicant has lived or traveled abroad, speaks more than one language, has overcome personal adversity, or has a strong record of community service or even a prior career in a non-legal profession. Id. (discussing policy). And the Law School pays more than mere lip service to this commitment: It \"actually gives substantial weight to diversity factors besides race,\" allowing those factors to \"make a real and dispositive difference for nonminority applicants as well.\" Id. In short, the law school's admissions program \"considers race as one factor among many, in an effort to assemble a student body that is diverse in ways broader than race,\" id. at 340, and as a consequence, \"does not unduly harm nonminority applicants.\" Id. at 341.\n\nFinally, the Court observed that the Law School has \"sufficiently considered workable race-neutral alternatives,\" id. at 340, and that periodic reviews (along with an eventual legal cutoff) ensure that the Law School's use of race will be time-limited, in concert with the Constitution's demand that any \" 'deviation from the norm of equal treatment of all racial groups [be] a temporary matter, a measure taken in the service of the goal of equality itself.' \" Id. at 342 (quoting Croson, 488 U.S. at 510 (plurality opinion)). In light of the policy's careful design and its adherence to the strict limits placed on the non-remedial use of race, the Court upheld the Law School's program as narrowly tailored.\n\n2.\n\nAt issue in Gratz, however, the undergraduate admissions program at the University's College of Literature, Sciences, and the Arts (LSA)—though purportedly pursuing the same benefits from diversity as the Law School—had structured its admissions program around such a crude racial classification that the school had not even come close to satisfying the narrow tailoring requirement.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e Prior to its 1998 admissions cycle, LSA developed an admissions \"selection index\" that assigned each applicant a score of up to 150 points based on his or her grades, test scores, high school quality and curricular rigor, in-state residency, legacy status, personal essay, and personal achievement or leadership. The index was then divided into strict dispositional bands: students scoring 100-150 points were admitted; students scoring 95-99 points were either admitted or had consideration of their application postponed; students scoring 90-94 points either had consideration of their application postponed or were admitted; students scoring 75-89 points were delayed or postponed; and students scoring fewer than 75 points were delayed or rejected. Gratz, 539 U.S. at 255.\n\nAlthough the LSA system superficially appeared to provide for individualized consideration of each applicant-at least to the extent that each application was reviewed to ascertain the presence of various \"soft\" variables for mechanical scoring-such a rosy portrait was belied by the underlying reality of the policy. Tucked into a \" 'miscellaneous' category, an applicant was entitled to 20 points based upon his or her membership in an under-represented racial or ethnic minority group.\" Id. Indeed, during 1999 and 2000, \"every applicant from an underrepresented racial or ethnic group was awarded 20 points,\" id. at 256, at least one-fifth of the points necessary to secure admission to LSA.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nIt therefore is not surprising that the Court rejected LSA's program on narrow tailoring grounds. Put simply, the program provided no serious individualized consideration of the applicant's potential contributions to educational diversity.\n\nThe LSA's policy automatically distributes 20 points to every single applicant from an 'underrepresented minority' group, as defined by the University. The only consideration that accompanies this distribution of points is a factual review of an application to determine whether an individual is a member of one of these minority groups. Moreover, unlike Justice Powell's example, where the race of a 'particular black applicant' could be considered without being decisive, the LSA's automatic distribution of 20 points has the effect of making 'the factor of race . . . decisive' for virtually every minimally qualified underrepresented minority applicant.\n\nId. at 272 (quoting Bakke, 438 U.S. at 317 (Powell, J., concurring)); see also id. at 273 (\"[A]s the University has conceded, the effect of automatically awarding 20 points is that virtually every qualified underrepresented minority applicant is admitted.\"). Having so easily concluded that the LSA policy was not narrowly tailored, the Court concluded by swiftly rejecting the University's lame suggestion that \" 'the volume of applications and the presentation of applicant information make it impractical' \" to predicate admissions on individualized consideration. Id. at 275 (quoting LSA's Brief). \"[T]he fact that the implementation of a program capable of providing individualized consideration might present administrative challenges does not render constitutional an otherwise problematic system.\" Id. (citing Croson, 488 U.S. at 508).\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\n3.\n\n[5] From the Court's decisions in Grutter and Gratz—and drawing upon well-established narrow tailoring principles— we derive the following governing constraints. First, where an institution pursues non-remedial objectives, racial quotas are strictly prohibited. Gratz, 539 U.S. at 293 (Souter \u0026 Ginsburg, JJ., dissenting) (\"Justice Powell's opinion in [Bakke] rules out a racial quota or set-aside, in which race is the sole fact of eligibility for certain places in a class.\"); Grutter, 539 U.S. at 334.\n\n[6] Second, any consideration of race for non-remedial purposes must be flexible; an educational institution may not treat an applicant's race or ethnicity as the touchstone of his or her individual identity, but instead must meaningfully evaluate each applicant's potential diversity contributions in light of all pertinent factors. Gratz, 539 U.S. at 271-74; id. at 279 (O'Connor, J., concurring); Grutter, 539 U.S. at 337-39; Bakke, 438 U.S. at 315 \u0026 317-18; Belk v. Charlotte-Mecklenburg Bd. of Educ., 269 F.3d 305, 345 (4th Cir. 2001) (Traxler, J., concurring); Wessmann, 160 F.3d at 798 \u0026 800; Eisenberg v. Montgomery Cty. Pub. Schs., 197 F.3d 123, 132-33 (4th Cir. 1999); Tuttle v. Arlington Cty. Sch. Bd., 195 F.3d 698, 707 (4th Cir. 1999).\n\n[7] Third, it follows that an institution's use of race must be neither mechanical nor conclusive. Gratz, 539 U.S. at 271-72; id. at 278-79 (O'Connor, J., concurring); Grutter, 539 U.S. at 336-37. After all, automatically awarding a fixed racial preference to every single racially-preferred applicant signals an institutional disregard for the far broader array of diversity characteristics that produce the educational and social benefits deemed compelling by the Court. Bakke, 438 U.S. at 317 (Powell, J., concurring). And any racial preference that necessarily results in the admission of an applicant demonstrates the pursuit of prohibited racial balancing simpliciter. See, e.g., Grutter, 539 U.S. at 337 (\"There is no policy, either de jure or de facto, of automatic acceptance . . . .\"); Wessmann, 160 F.3d at 799; cf. Eisenberg, 197 F.3d at 131; Tuttle, 195 F.3d at 707.\n\n[8] Fourth, narrow tailoring demands that the institution seeking to employ racial preferences at the very least demonstrate an earnest consideration of race-neutral alternatives. Grutter, 539 U.S. at 339-40; Wygant, 476 U.S. at 280 n.6; Tuttle, 195 F.3d at 706; Podberesky, 38 F.3d at 1060-61.\n\n[9] Fifth, serious efforts must be made to minimize the adverse impact of racial preferences on non-preferred group members; a programmatic use of race should be no more potent than necessary to achieve the compelling interest being pursued. Grutter, 539 U.S. at 341; Wygant, 476 U.S. at 287 (O'Connor, J., concurring in part and dissenting in part); Bakke, 438 U.S. at 308, 311, 314-15 (Powell, J., concurring); Wessmann, 160 F.3d at 798.\n\n[10] Sixth, and finally, any program of racial preferences, regardless of its ultimate aspirations, must be time-limited. Grutter, 539 U.S. at 342; Croson, 488 U.S. at 510 (plurality opinion by O'Connor, J.); Hayes v. N. State Law Enforcement Ass'n, 10 F.3d 207, 216 (4th Cir. 1993).\n\n4.\n\n[11] The School District's racial tiebreaker fails virtually every one of the narrow tailoring requirements.\n\na.\n\n[12] First (and second), in contrast to the \"flexible, nonmechanical,\" evaluation of race employed by the University of Michigan Law School in the course of a \"highly individualized, holistic review\" which scrupulously \"ensure[s] that each applicant is evaluated as an individual and not in a way that makes an applicant's race or ethnicity the defining feature of his or her application,\" Grutter, 539 U.S. at 337, the School District's racial tiebreaker is virtually indistinguishable from a pure racial quota. As Grutter defined that forbidden fruit of non-remedial racial preferences, \"Quotas impose a fixed number or percentage which must be attained, or which cannot be exceeded, and insulate the individual from comparison with all other candidates for the available seats.\" Grutter, 539 U.S. at 335 (citations and quotations omitted). Yet this is almost precisely how the District itself has described the operation of its program—with a single variance: rather than impose a racial floor or ceiling, the School District's racial tiebreaker establishes both a floor and a ceiling.\n\n[I]f an oversubscribed school has fewer than 45 [percent] students of color/more than 55 [percent] whites, students of color will be assigned ahead of white students who live closer to the school. Conversely, if an oversubscribed school has fewer than 25 [percent] white students/more than 75 [percent] students of color, white students will be assigned ahead of students of color who live closer.\n\n[13] Indeed, to an even greater degree than the University of Michigan's undergraduate admissions program, the School District-third-automatically and mechanically admits, using a computer algorithm designed to implement the ceilings and floors framing its racial tiebreaker, hundreds of white and non-white applicants solely because of their race. Cf. Gratz, 539 U.S. 270 (\"[T]he University's policy, which automatically distributes . . . one-fifth of the points needed to guarantee admission . . . to every single 'underrepresented minority' applicant solely because of race, is not narrowly tailored . . . .\") (emphasis added); id. at 271-72 (\"The only consideration that accompanies this distribution of points is a factual review of an application to determine whether an individual is a member of one of these minority groups.\"). Thus, in stark contrast to the program sanctioned by Grutter, the racial tiebreaker not only fails to \"serious[ly] consider[ ] all the ways an applicant might contribute to a diverse educational environment,\" but is in fact a \"de jure [policy] of automatic acceptance or rejection based on a[ ] single 'soft' variable.\" Grutter, 539 U.S. at 337. This the Constitution categorically forbids; such an impliably reflexive use of race \"cannot be said to be narrowly tailored to any goal, except perhaps outright racial balancing.\" Croson, 488 U.S. at 507 (plurality opinion).\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nc.\n\n[14] Fourth, although numerous alternative admissions structures have been proposed to solve the School District's oversubscription dilemma without so prominently featuring race in the equation, not all have been (or ever were) seriously considered by the Board.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Three such alternatives stand out.\n\ni.\n\nFirst, the School Board has never seriously considered the use of a citywide high school admissions lottery. Though perhaps not palatable to the electorate-a consideration that cannot justify the use of race in its stead-a randomized lottery would necessarily produce levels of school diversity statistically comparable to (and perhaps even more proportional than) the District's racial tiebreaker. Yet, when asked about using a lottery to meet the District's diversity targets, Board member Barbara Schaad-Lamphere actually argued that a lottery would not result in racially proportional representation \"because of probabilities, the law of probabilities.\" Let us be clear: We are not forcing the School District to adopt a random assignment lottery. But given its evident commitment to achieving diversity, there is no question but that the Board should have earnestly appraised such a program's costs and benefits. Whatever reasons there may be to reject a lottery, the demonstrably false pretext that \"the law of probabilities\" would render it ineffectual is not one.\n\nThe dissent takes us to task for suggesting that the School District must seriously consider using a lottery to achieve its diversity goals when Grutter itself explicitly rejected the plaintiffs' claim that Michigan's Law School should have considered a lottery. See post at 10091-93. We find such criticism unavailing. Grutter rejected the plaintiffs' demand that the Law School consider a lottery because such a program would necessarily diminish the quality of its admitted students and might not produce adequate educational diversity due to potential under-representation of various (not necessarily racial) kinds of diversity in its limited applicant pool.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Yet as the dissent itself notes, the School District's adoption of a lottery is subject to neither of these potential pitfalls. Post at 10076 (noting that in this case \"there is absolutely no competition or consideration of merit . . . . All high school students must and will be placed in a Seattle public school. The students' relative merit is irrelevant.\") (emphasis in original). As a result, the District's unconstrained applicant pool is not subject to a possible demographic skew, and there is absolutely no possibility that a lottery would diminish the quality of admitted students. Thus, neither of Grutter's grounds for rejecting consideration of a lottery is present here.\n\nii.\n\nSecond, the School District could have considered adopting a diversity-oriented policy that does not rely exclusively on race, but which instead accounts for the wider array of characteristics that comprise the kind of true diversity lauded by Justice Powell in Bakke and by the Court in Grutter and Gratz. In this respect, we observe that-for purposes of its internal school funding formula-the School District already collects a much wider array of data on students and families than merely their racial and ethnic identities. Among that data is information on whether a child lives at home or in \"an agency\"; if she lives at home, with whom; whether the child's home and most proficient languages are English or some other language; and the child's eligibility for free or reduced price lunch. Yet, the District considers none of those factors in admissions, and although individual Board members have occasionally suggested using one or more of those factors as an alternative tiebreaker, the Board has declined even to study how such an alternative would impact school diversity.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThe dissent once again strays in its criticism of this suggestion. It first suggests that a programmatic focus on \"true diversity\" is no alternative at all \"because it is not directed toward achieving the District's interest in a racially integrated learning environment.\" Post at 10090. But this claim is fundamentally mistaken. A programmatic focus on true diversity-within which race is one of many factors considered by the School District-subsumes the District's interest in achieving racial diversity: It does not supplant it. Indeed, such a focus may not only help the District achieve the racial diversity it desires, see infra at 10078 n.26, but might actually serve the District's socialization interests to a far greater degree than its presently narrow focus on race alone. For, if the District's fundamental interest is, as the dissent characterizes it, \"to prepare children to be good citizens-to socialize children and to inculcate civic values,\" see post at 10061, and to achieve \"a more democratic and inclusive experience for all citizens,\" id. at 10061-62 n.9 (quoting one of the District's expert witnesses), then accounting for factors other than race-like socioeconomic status-would bolster the District's \"democratic\" mission by fostering, for instance, cross-class (and not just cross-racial) interaction. See Richard D. Kahlenberg, All Together Now: Creating Middle-Class Schools Through Public School Choice (2001) (documenting the civic and educational benefits of socioeconomically integrated schooling).\n\nThe dissent also errs in suggesting that \"even though there has been no formal study of [this] proposal,\" the deposition testimony of a few Board members is sufficient to demonstrate \"legitimate reasons why the majority of the Board rejected the use of poverty measures . . . .\" Post at 10090. We disagree. The Board members' blithe dismissal of a sincerely presented proposal simply cannot satisfy the constitutional requirement that the government earnestly appraise race-minimal alternatives prior to adopting race-conscious policies. Matters not formally evaluated cannot be \"rejected\" in a constitutionally-relevant sense: Such appraisal-whether with regard to the need for race-based action, or to the shape such action is to take-must be conducted \"on the record.\" See, e.g., Croson, 488 U.S. at 498-511 (chronicling Richmond's failure adequately to document the basis for its use and design of a racial quota and stressing the constitutional demand that it do so); see also Shaw v. Hunt, 517 U.S. 899, 909-10 (1999); Fullilove, 448 U.S. at 533-35 (Stevens, J., dissenting); Rothe Dev. Corp. v. United States Dep't of Def., 262 F.3d 1306, 1322-28 (Fed. Cir. 2001); Associated Gen. Contractors of Ohio, Inc. v. Drabik, 214 F.3d 730, 735-37 (6th Cir. 2000) (Boggs, J.); WH Scott Constr. Co. v. City of Jackson, 199 F.3d 206, 217-19 (5th Cir. 1999) (King, C.J.); H.K. Porter Co. v. Metro. Dade County, 975 F.2d 762 (11th Cir. 1992).\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\niii.\n\nThird (and at least for the moment, finally), acting in response to Parents's filing of this lawsuit, the Seattle Urban League convened a working group which included, among others, a representative from the NAACP, one of the Parents, a former member of the School Board, a retired high school principal, the then-current President of the Seattle Council Parent Teacher Student Association (PTSA), and a former PTSA President. In September 2000, they developed-and then formally proposed to the School Board-a comprehensive plan that would seek to enhance the quality of education in the City's schools by focusing on educational organization, teacher quality, parent-teacher interaction, raising curricular standards, substantially broadening the availability of specialized and magnet programs (which could attract a broader cross-section of students to undersubscribed schools), and supporting extra-curricular development.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nAt the same time, their plan proposed decreasing the School District's reliance on race in the admissions process by adding a new, primary tiebreaker based on pairing neighborhoods with particular schools and structuring the scope and size of the component residential areas such that no single region would contain enough students to fill its linked high school to capacity. Under the plan, preferences initially would be given to students choosing a school in their paired region, and the existing racial tiebreaker would be dropped from second to third in the process of resolving any remaining over-subscription (and any residual racial concentration not already solved by improving the attractiveness of previously racially concentrated schools). Finally, the Urban League working group proposed that the School District add an eleventh public high school, and that it strenuously market to the public the existing (and proposed additional) specialty programs throughout the City's other high schools.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nWe cannot know whether its proposed reforms would have been successful in achieving the working group's ambitious goals, but there is no doubt that the Urban League presented the Board with an especially thoughtful proposal for addressing the dilemmas plaguing contemporary urban education\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e while simultaneously striving to attain educational diversity without unduly relying on the use of crude racial preferences. Yet, this proposal was never formally discussed at a Board meeting. Indeed, some members of the Board even refused to read it. Consider the following remarkable deposition testimony by Board member Michael Preston:\n\nQ: Are you familiar with the plan proposed by the ad hoc work group of the Urban League?\n\nA: Somewhat.\n\nQ: Did you ever consider that plan as a viable alternative to the current assignment plan?\n\nA: No.\n\nQ: Why not?\n\nA: I thought they hadn't done their homework. And yeah, they seemed too liberal and unbusinesslike. But it didn't recognize the legitimate concerns that the people of Ballard and Magnolia have about the school.\n\nQ: What in particular do you believe are the shortcomings of that Urban League plan that caused you not to consider it to be a viable alternative?\n\nA: That it came from the Urban League. Even though [Urban League President and CEO] James Kelly is a good friend of mine, the Urban League has not been a bastion of enlightened thought, in my view, historically.\n\nQ: Did you read the proposal?\n\nA: No. I heard it characterized and summarized.\n\nQ: By whom?\n\nA: By the superintendent. I have a copy of it. I chose not to read it. I'd rather play with my bass lunker fishing game.\n\nQ: Than consider the Urban League's proposal?\n\nA: Well.\n\nQ: That might give some offense to the people who spent a good deal of time working that proposal up.\n\nA: Okay.\n\nQ: We don't need to show them a copy of the deposition transcript.\n\nA: I'm sure it will eventually fall into their hands.\n\nQ: Are you familiar with the broad outlines of how that proposal was structured?\n\nA: Yeah.\n\nQ: What's your understanding of that? Not necessarily the minutia, but what's your understanding of the general way that the Urban League's proposal would have worked?\n\nA: I don't understand the relevance of the Urban League's proposal, because it wasn't considered, it wasn't used. I don't understand what difference it makes.\n\nQ: Well, I'm just-in all honesty, one of the issues in the case, as I see it, is what alternatives were available to the school board.\n\nA: Well, that wasn't an alternative.\n\nQ: Why is that?\n\nA: Well, the Urban League is not the school board, it's not the administration, it's not the superintendent. . . .\n\nWithout belaboring the point, this is not exactly the stuff from which narrow tailoring is made. While it may be the case that educational institutions need not exhaust every conceivable alternative to the use of racial classifications to satisfy strict scrutiny, narrow tailoring at least demands that schools earnestly consider using race-neutral and race-limited alternatives in order to provide for the kind of diversity that, properly constituted, can further compelling educational and social interests. Grutter, 539 U.S. at 339. Given the tragic history of race in our country, the Constitution demands no less -our education policymakers' enthusiasm for handheld electronically simulated \"bass lunker fishing game[s]\" notwithstanding.\n\n[15] Fifth, the School District's racial tiebreaker is not designed to minimize its adverse impact on third parties; the extent to which it uses race is not calibrated to the benefits sought. Over time, \"the band,\" see supra n.6, has ranged from as much as +/- 25 percent to as little as +/- 10 percent, and it currently sits at +/- 15 percent. And while such variances conceivably could be interpreted to suggest that the School District is carefully trying to optimize its realization of diversity's benefits, the record belies such an interpretation. In October 2000, School Superintendent Joseph Olchefske formally recommended that the band be expanded from +/- 10 percent to +/- 20 percent because \"[a]fter review and 2 years experience, there was not strong evidence that utilizing a +/- 10 [percent] band provided a materially better educational experience than would a band of +/- 20 [percent]. Accordingly, in order to fulfill our narrow tailoring obligation, staff is recommending a +/- 20 [percent] band.\"\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Yet, even after its chief educator and his staff twice had reported that twice as much of an adjustment would have no adverse impact on the diversity payoff, the Board adjusted the band by just 5 percentage points. This is not the measure of tailored proportionality. Instead, it represents a stubborn adherence to the use of race for race's sake, with the effect that some non-preferred student applicants will be displaced solely because of their racial and ethnic identities -to no benefit at all.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\n[16] Taken alone, any of these shortcomings would doom the School District's program. Together, they reveal an unadulterated pursuit of racial proportionality that cannot possibly be squared with the demands of the Equal Protection Clause.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\n5.\n\nIn an effort to evade the clear import of the narrow tailoring analysis applied by Grutter, Gratz, and their progenitors, the School District argues that such analysis simply does not apply in the K-12 context: \"[T]he Michigan decisions have meaning only in the context of selective admissions and other 'zero sum' programs. . . . [The] argument that race may be considered [only] in a holistic individualized review as one factor among many contributing to diversity is not applicable to non-selective school assignments.\"\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e Indeed, they argue, the use of racial classifications in their allegedly \"non-zero sum\" open choice high school admissions process \"is narrowly tailored, as a matter of law.\"\n\nFor support, they unearth language from Associated General Contractors of California v. San Francisco Unified School District, a 1980 case in which we addressed a challenge to a School Board policy requiring that \"bidders for construction contracts . . . must be minority general contractors or must utilize minority subcontractors for 25 [percent] in dollar volume of the contract work.\" 616 F.2d 1381, 1383 (9th Cir. 1980). At the heart of their challenge, the contractors asserted that the quota violated California law requiring that all school contracts (except those involving de minimis expenditures) be awarded solely to \"the lowest responsible bidder.\" Id. at 1385 (discussing and quoting Cal. Educ. Code § 39640). In defense, the School Board asserted not only that its policy was permissible, but that the policy was required in order to remedy past discrimination-and therefore that insofar as it would prevent maintenance of such a policy, California's low-bid law violated the Supremacy Clause, U.S. Const. art. VI, § 2. Id. at 1386.\n\nWe flatly rejected that argument, drawing a distinction between \"reshuffle programs\" and \"stacked deck programs,\" id. at 1386, and placing the Board's quota in the latter category of race-based policies. We explained the central difference between these two categories as follows: While reshuffle programs \"neither give[ ] to nor withhold[ ] from anyone any benefits because of that person's group status, but rather ensure[ ] that everyone in every group enjoys the same rights in the same place,\" so-called stacked deck programs \"specifically favor[ ] members of minorities in the competition with members of the majority for benefits that the state can give to some citizens but not to all.\" Id. In passing, we twice suggested that programs designed to desegregate schools are reshuffle programs, see id. at 1386 \u0026 1387, and elsewhere stated \"that 'stacked deck' programs trench on Fourteenth Amendment values in ways that 'reshuffle' programs do not.\" Id. at 1387.\n\nUltimately, we held simply that although \"the state has an affirmative constitutional duty to use 'reshuffle' programs to cure the effects of past or present de jure segregation . . . , there is no constitutional duty to engage in 'stacked deck' affirmative action.\" Id. Of particular import, we never reached the Fourteenth Amendment question squarely implicated by this case: whether notwithstanding the absence of an obligation to adopt such a policy, its implementation of such a program was permissible. Instead, given our resolution of an underlying state law question, our assessment of that law's constitutionality, and the fact that the Court recently had granted certiorari in Fullilove, we explicitly declined to \"test the policy itself against the standard of the United States Constitution.\" Id. at 1391.\n\nAlthough it might seem obvious that a case cannot control the resolution of an issue it expressly declined to confront, the School District nonetheless grasps at Associated General's furtive references to school desegregation.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e It argues that its racial classification is equivalent to the programs arguably favored by Associated General, and thus (reading that opinion at the highest level of generality) not violative of the Fourteenth Amendment.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e We disagree.\n\nLet us begin with two interrelated observations. First, Associated General addressed neither school desegregation nor the use of race in educational admissions; it assessed a mechanical set-aside governing distribution of construction projects. Second, Associated General did not even purport to apply strict scrutiny to a particular racial classification (or, more specifically, an actual school desegregation program). Its Fourteenth Amendment analysis assessed only whether the use of certain types of classifications is required to remediate prior official race discrimination-not whether constitutional limits circumscribe the use of such classifications for non-remedial purposes, what those limits might be, and how they might affect the constitutionality of a particular policy.\n\nTwo conclusions follow. First, Associated General sheds no light on how we are to apply the narrow tailoring analysis rendered applicable to any racial classification by Croson, 488 U.S. 493-95, Adarand, 515 U.S. at 224, Grutter, 539 U.S. at 326, and Gratz, 539 U.S. at 270,\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e to the tiebreaker at issue in this case. And second, Associated General's assertions about the nature of school desegregation programs are-however one defines the term-obiter dicta.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nInsofar as the School District argues that because reshuffle programs may be less invidious than stacked deck programs and thus, as a constitutional matter, somehow not subject to the stringencies of the narrow tailoring requirement-a proposition never embraced by this court\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e and certainly not one reconcilable with binding Supreme Court holdings\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e -it misapprehends the concept of narrow tailoring. The contours of narrow tailoring do not turn on the importance of the interest supporting the government's use of a racial classification (though such analysis, whatever its shape, surely is triggered by use of a racial classification in pursuit of a compelling interest), nor on the asserted degree of the intrusion that a particular use of race might render. The personal right to equal treatment is implicated any time the government employs race for any reason. See Coalition, 122 F.3d at 702 (quoting Adarand, 515 U.S. at 230)).\n\nInstead, narrow tailoring analysis focuses only upon the fit between the ends in pursuit of which a racial classification is used, the particular way in which the policy at issue uses that racial classification, and the baseline legal limits placed upon the use of racial classifications-and it does so because any policy using race, for any reason and in any way, is \"inherently suspect,\" \"by [its] very nature odious to a free people,\" and simply \"too pernicious to permit any but the most exact connection between justification and classification.\" Adarand, 515 U.S. at 223 (quoting Fullilove, 448 U.S. at 523 (Stewart, J., dissenting)); id. at 224 (quoting Hirabayashi, 320 U.S. at 100); id. 229 (quoting Fullilove, 448 U.S. at 537 (Stevens, J., dissenting)). It is for those reasons that, as Judge Selya-in typically perspicuous fashion-has observed, a court applying strict scrutiny must focus on \"whether the concrete workings of the Policy merit constitutional sanction. Only by such particularized attention can we ascertain whether the Policy bears any necessary relation to the noble ends it espouses. In short, the devil is in the details.\" Wessmann, 160 F.3d at 798. Under strict scrutiny, no racial classification, no matter its context and no matter the nature or strength of the interest it serves, is exempt from the strictures of narrow tailoring, and this program plainly fails to satisfy them.\n\nFinally, even if were we to accept that Associated General bears on this case, we observe that the School District's racial tiebreaker operates as a \"stacked deck\" program. Quite simply, it \"specifically favors members of [some races] in the competition with members of [other races] for benefits that the state can give to some citizens but not to all,\" Associated General, 616 F.2d at 1386-here, of course, admission to particular high schools.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e As noted earlier, operation of the tiebreaker at Franklin causes whites to be admitted preferentially because they are white, and its operation at Ballard causes non-whites to be admitted preferentially simply because they are not white. To the argument that this program is \"non-selective,\" we can only express bewilderment: The racial tiebreaker is used to determine student admissions solely to oversubscribed-and thus necessarily selective-schools.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nWhatever Associated General says about school desegregation programs, this is not the programmatic design that we had in mind.\n\n[17] Having accepted the School District's invocation of Grutter and Gratz in support of the proposition that racial and ethnic diversity can generate constitutionally compelling benefits within the educational setting itself and our society at large, we ultimately are compelled to reject the School District's strained efforts both to eat its cake and have it too. Its racial tiebreaker-though enlisted in the service of admittedly worthy ends-plainly fails the narrow tailoring component of the Constitution's strict scrutiny test.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nIV.\n\nApproaching this case from a fundamentally divergent perspective, the dissent offers a spirited and thoughtful defense of the School District's racial tiebreaker. Although we have responded to a few of its more specific criticisms, we see little to gain from the kind of note-by-note combat so pervasive in modern judicial opinions. Rather, given the thoroughness with which we have articulated our respective analyses of the racial tiebreaker, we think there is more to gain by elucidating the core foundations of our dispute. We perceive three significant points of departure, and address each in turn.\n\nA.\n\nThe dissent repeatedly suggests that we should simply defer to the School District's decision to employ its tiebreaker in pursuing racial proportionality. Post at 10065 n.13, 10068, 10069-72 \u0026 10089. Indeed, the dissent gradually shifts from noting how \"compelling\" the District's policy is to focusing on its \"reasonable[ness],\" \"legitima[cy],\" and \"permissi[bility].\" Id. at 10065 n.13, 10085, 10090, 10090, 10091, 10099. We believe such unfettered deference is inconsistent with our obligations under strict scrutiny-and, contrary to the dissent, that it is especially inconsistent with constitutional demands in this context. Because Grutter's decision to accord universities a measure of deference occasioned a sharp debate over this issue, careful attention to its rationale for doing so is in order.\n\n1.\n\nAfter identifying the Law School's \"compelling interest in attaining a diverse student body,\" Grutter, 539 U.S. at 328, the Court promptly stated:\n\nThe Law School's educational judgment that such diversity is essential to its educational mission is one to which we defer. . . . Our scrutiny of the interest asserted by the Law School is no less strict for taking into account complex educational judgments in an area that lies primarily within the expertise of the university. Our holding today is in keeping with our tradition of giving a degree of deference to a university's academic decisions . . . .\n\nId. at 328-30 (citations omitted) (emphases added).\n\nIn developing its rejection of the dissenting Justices' charge that such deference was indeed at odds with strict scrutiny, see id. at 379-86 (Rehnquist, J., dissenting); id. at 387-94 (Kennedy, J., dissenting); id. at 362-67 (Thomas, J., dissenting), the Court began by reiterating its \"long recogni[tion] that, given the important purpose of public education and the expansive freedoms of speech and thought associated with the university environment, universities occupy a special niche in our constitutional tradition.\" Id. at 330. It then expressly sanctioned Justice Powell's statement in Bakke that, given these unique First Amendment interests, universities have a \"right to select those students who will contribute the most to the 'robust exchange of ideas.' \" Id. (quoting Bakke, 438 U.S. at 313 (Powell, J., concurring)).\n\nDeference thus was due to the University not because its interest was \"simply to assure within its student body some specified percentage of a particular group merely because of its race or ethnic origin . . . but [because it] was defined by reference to the educational benefits that [such] diversity is designed to produce,\" id. (quotations and citations omitted)-and of crucial importance, because those \"educational benefits\" were not merely socially compelling, id. at 330-33, but fundamentally internal to the university's \"academic\" mission. Id. at 328. The Court emphasized: \"The benefits are important and laudable, because classroom discussion is livelier, more spirited, and simply more enlightening and interesting when the students have the greatest possible variety of backgrounds.\" Id. at 330 (quotations and citations omitted).\n\n2.\n\nBeyond the fact that Grutter deferred only to the Law School's identification of its interests as compelling—and, contrary to the dissent here, not to its tailoring analysis— neither of Grutter's grounds for affording deference is present here. First, secondary schools do not occupy the same \"special niche in our constitutional tradition\" as higher education, and the Court has never held they possess a similar First Amendment right of academic freedom. Indeed, while the Court has been willing to afford secondary schools some limited leeway to enable them to meet their most basic need (preserving the orderly school environment necessary to enable academic learning\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e), the Court has never suggested that public secondary schools have a constitutional right to select their student body, much less that such a right entails selecting students based solely on their race—a power that not even universities enjoy, despite their uniquely privileged status. Quite in contrast, the Court has repeatedly condemned racial balancing, held that a State's creation of a system of compulsory public education endows students (not schools) with a constitutionally-protected interest, and has pointedly reminded school authorities that \" '[t]he Fourteenth Amendment . . . protects the citizen against the State itself and all of its creatures-Boards of Education not excepted.' \" Goss, 419 U.S. at 574 (quoting W. Va. Bd. of Educ. v. Barnette, 319 U.S. 624, 637 (1943)); see also Grutter, 539 U.S. at 330 \u0026 336.\n\nSecond, the principal benefits the School District seeks through its pursuit of racial proportionality are neither internal to the school environment nor within the special expertise of school administrators. For although the District's asserted interests in the educational and societal benefits derivable from diverse schools mirror those embraced by Grutter, see supra at 10003-10, the dissent quite properly notes that the School District has an appreciably different focus. Rather than primarily seeking the internal academic benefits of diversity, the District's chief focus is on the broader social benefits diversity can stimulate. See post at 10061.\n\nWe do not believe this divergent emphasis changes the nature of the District's interests; they remain compelling, and thus can justify an appropriately limited use of race. See supra Sections III.B.3 \u0026 III.C.3. But it does affect the degree to which the District can claim deference. With regard to its secondary pursuit of diversity's internal academic benefits, we believe that while limited deference to educational institutions arguably could be due when they pursue core goals, such deference is entirely unwarranted when they court tangential ones. Having proceeded from the premise that the internal academic benefits of diversity are secondary to the District's socialization mission, it is at best curious that the dissent nonetheless maintains we should defer to the District's particularly crude use of a most disfavored classification in their pursuit.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nFar more important, we see a crucial difference between a school's pursuit of the internal academic benefits of diversity and its pursuit of diversity's external social benefits. For although the former manifest within the District's schoolhouses, and thus are susceptible to ready appraisal exclusively by education policymakers, the \"democratic\" benefits attributable to classroom diversity are diffuse, manifest long after students leave the classroom, do so in contexts not subject to the exclusive oversight of teachers, and cannot be measured with skills possessed uniquely by educators. That is to say: While it is clear that educators are uniquely positioned to gauge how classroom discussions respond to shifts in classroom racial composition, they are not similarly well-positioned to assess how marginal changes in schoolhouse racial demographics affect how students interact with each other years after they leave school for the \"real world.\" And to the limited extent they may have such insight, the record does not suggest the District ever sought to appraise the long-term social effects of engineering proportional demographic changes in connection with its design of the tiebreaker.\n\nB.\n\nBeyond the dissent's unfettered deference to the School District-a constitutional departure that we think undermines its supposed \"strict scrutiny\" of the tiebreaker-one of its most striking features is its lack of focus on the data. For if it is true that a picture is worth a thousand words, there are times when statistics give Proust a run for his money.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\n1.\n\nThe dissent simply seems to assume that absent the racial tiebreaker, Seattle's public high schools would be \"racially concentrated, or racially isolated,\" and thus unable to attain diversity's benefits. Post at 10064; id. at 10077-78, 10092-93, 10095 \u0026 n.39. The record belies its assumption. Uncontroverted data produced by the School District during this litigation and contained in the record indicate that, in the absence of the racial tiebreaker, 2000-2001 school year enrollments at Seattle's public schools would have been as follows:\n\nTABLE 1: 2000-2001 DEMOGRAPHICS WITHOUT RACIAL TIEBREAKER\n\nSCHOOLASIANBLACKLATINONATIVE AMERICANWHITENON-WHITE OVERALL\n\nBALLARD14.7%8.9%9.6%4.3%62.5%37.5%\n\nCHIEF SEALTH27%18%21%3%32%68%\n\nCLEVELAND43%35%10%2%10%90%\n\nFRANKLIN39.3%34.6%5.5%0.8%19.8%80.2%\n\nGARFIELD12.5%34.7%4.4%1.1%47.2%52.8%\n\nINGRAHAM38%19%9%4%30%70%\n\nNATHAN HALE17.4%12.1%6.4%3.3%60.8%39.2%\n\nRAINIER BEACH30%52%8%2%8%92%\n\nROOSEVELT26.8%6.7%8.7%3.0%54.8%45.2%\n\nW. SEATTLE26%15%10%2%46%54%\n\nFar from revealing \"racially concentrated\" or \"racially isolated\" student bodies, these figures demonstrate that each of the District's schools would enroll a vibrant array of students without considering race at all.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e (Only by indulging the fallacious proposition that inter-ethnic diversity is irrelevant to the District's putative democratic mission could one conclude otherwise.)\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e It is thus particularly hard to credit the dissent's assumption that the tiebreaker is necessary to the District's fulfillment of its diversity oriented goals.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e \u0026 \u003cspan class=\"fnref\"\u003e50\u003c/span\u003e\n\nSuch an assumption becomes even less tenable in light of the tiebreaker's limited effect where it does operate. Indeed, the data demonstrate that the tiebreaker produces only the most trivial annual changes in school demography.\n\nTABLE 2: 2000-2001 DEMOGRAPHIC IMPACT OF THE RACIAL TIEBREAKER\n\nSCHOOLASIANBLACKLATINONATIVE AMERICANWHITE\n\nBALLARD+ 2.8%+ 1.9%+ 1.1%+ 0.3%- 6.1%\n\nFRANKLIN- 2.5%- 2.4%- 0.3- 0.1%+ 5.3%\n\nNATHAN HALE+ 0.5%+ 1.2%+ 0.6%+ 0.1%- 2.4%\n\nROOSEVELT+ 2.3%+ 1.0%+ 0.2%+ 0.1%- 3.7%\n\nGiven enrollment totals at these schools, the tiebreaker's annual effect is thus merely to shuffle a few handfuls of different minority students between a few schools-about a dozen additional Latinos into Ballard, a dozen black students into Nathan Hale, perhaps two dozen Asians into Roosevelt, and so on. The District has not met its burden of proving these marginal changes substantially further its interests,\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e much less that they outweigh the cost of subjecting hundreds of students to disparate treatment based solely upon the color of their skin.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e\n\n2.\n\nBeyond casting serious doubt on the School District's need to use its racial tiebreaker, the numbers undermine the dissent's assessment of its efficacy—and yet again, on the dissent's own terms. For present purposes, we take at face value the dissent's identification of the District's primary interest as ensuring \"that children learn to interact with peers of different races,\" post at 10077; see also post at 10063-64, and accept arguendo its claim that \"when a racially integrated school system is the goal . . . , there is no more effective means than a consideration of race to achieve a solution.\" Post at 10078, 10093. We credit for the moment its assessment that it is appropriate to \"link[ ] the integration tiebreaker to the racial demographic of the District's population [because] the District is trying to teach its students to be effective participants in the racially diverse environment in which they exist,\" post at 10094 (emphasis added), and we ignore both that the tiebreaker does not operate where it would be most needed to meet the dissent's articulation of the District's goals and that its demographic impact is trivial where it does operate. Yet even then, it is clear to us that the School District's racial tiebreaker falls well short.\n\nBecause the tiebreaker relies on a crude white/non-white metric of racial identity, representation of particular minorities varies widely within the schools where it operates (indeed, throughout the school system). Once again, consider data produced by the School District and contained in the record:\n\nTABLE 3: 2000-2001 DEMOGRAPHICS WITH RACIAL TIEBREAKER\n\nSCHOOLASIANBLACKLATINONATIVE AMERICANWHITENON-WHITE OVERALL\n\nBALLARD17.5%10.8%10.7%4.6%56.4%43.6%\n\nFRANKLIN36.8%32.3%5.2%0.7%25.1%74.9%\n\nNATHAN HALE17.9%13.3%7%3.4%58.4%41.6%\n\nROOSEVELT29.1%7.7%8.9%3.1%51.1%48.9%\n\nGiven that the demographic impact of the tiebreaker during the 2000-2001 school year was merely to shift overall white/ non-white student ratios by at most 6.1 percent at the schools where it operated, supra at 10047, Table 2, these are truly enormous variations. The range in representation of Asians at the tiebreaker schools (19.3 percent, as Asian representation ranged from just 17.5 percent of students at Ballard to a whopping 36.8 percent of students at Franklin) was more than 3 times the size of the tiebreaker's maximum annual impact on overall white/non-white ratios; and the range in black representation (24.6 percent, ranging from 32.3 percent of students at Franklin to just 7.7 percent of students at Roosevelt) was more than 4 times the maximum annual white/non-white impact.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e \u0026 \u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nThese representational variances cut to the core of the dissent's defense of the tiebreaker's design. For if the tiebreaker's goal is (as the dissent characterizes it) to assure every student the opportunity to interact with the right ratio of different-looking peers in order to prepare them for life in our diverse society, the program plainly fails huge numbers of students. Consider: Roughly 600 black students at Garfield during the 2000-2001 school year were deprived of the chance to interact with a sufficient number of Asian students (12.5 percent of Garfield students versus 27.5 percent of students in the school population at large); more than 100 Latino students at Roosevelt were denied a chance to interact with an adequate number of African-American peers (7.1 percent of Roosevelt students versus 22.8 percent of the student population at large); 600 Asian students at Franklin were unable adequately to interact with Native American students (0.8 percent of Franklin students versus 2.5 percent of the student population at large). And thousands of other students left their schools not having been inadequately exposed to interaction with certain racial minorities, but rather having been overexposed to them-and thus likewise not having been readied \"to be effective participants in the racially diverse environment in which they exist.\" Cf. post at 10094. Even taking at face value the dissent's embrace of racial balancing, these data indicate the tiebreaker does not even rationally further the impermissible ends the dissent trumpets.\n\nC.\n\nThe final major point of departure between our opinion and the dissent is perhaps the most significant: We believe the dissent errs in failing to recognize the injury rendered by the tiebreaker. We have already explained that the individual right to equal treatment is implicated any time government uses race to apportion benefits or burdens. Here, in determining where some 300 students will attend high school, the School District crudely approximates the shades of their skin and assigns them to schools accordingly. Nonetheless, the dissent surprisingly suggests that not one of those students suffers a legally cognizable injury (whether such an injury can be justified or not) because the constitutional prohibitions against determinative racial preferences and quotas do not apply to secondary education, and because each of those students will get a basic education anyway. We address these claims in turn.\n\n1.\n\nThe dissent suggests that the constitutional prohibitions against determinative racial preferences and quotas do not apply within the secondary educational context because secondary schools do not employ race as a proxy for merit, and thus pose little risk of stigmatizing or stereotyping those they putatively benefit. Post at 10074-78. Its analysis cannot be squared with precedent.\n\nThe Court has long prohibited the use of outright quotas in contexts where merit and qualification are—as the dissent asserts them to be here—completely irrelevant. Thus, Croson rejected Richmond's racial quota for construction contracts on grounds that the \"quota cannot be said to be narrowly tailored to any goal, except perhaps outright racial balancing.\" Croson, 488 U.S. at 507. Of course, when dealing with contracting, the only \"qualification\" or indicum of \"merit\" is submission of a low bid. Croson's constitutional objection to the City's use of a quota was thus not that it threatened to stigmatize minorities: It was that quota-driven racial balancing is flatly at odds with the Fourteenth Amendment's \" 'ultimate goal' of 'eliminat[ing] entirely from governmental decisionmaking such irrelevant factors as a human being's race.\" Id. at 500 (quoting Wygant, 476 U.S. at 320 (Stevens, J., dissenting)) (alteration in original).\n\nLikewise, courts have rejected the use of race-based quotas in legislative redistricting. As the Fifth Circuit has put the point, \"[D]istricters are not bound-or allowed-to sacrifice traditional districting concerns to meeting quotas of diversity, just as they are not allowed to do so in order to meet quotas of racial concentration.\" Chen v. City of Houston, 206 F.3d 502, 511 (5th Cir. 2000); see also Easley v. Cromartie, 532 U.S. 234, 241 \u0026 257 (2001) (recognizing that race may not be the predominant factor in legislative districting, and noting that an email referencing \"racial balance\" constituted evidence of such an \"improper[ ]\" use of race). But surely redistricting involves no \"competition\" or \"consideration of merit,\" and of course \"no stigma results from any particular [districting] assignment.\" Cf. post at 10076. At bottom, the problem with the imposition of a racial quota and the use of inflexibly mechanical racial preferences is not simply that they impermissibly conflate skin color with merit or qualification; it is that, more than any euphemistic \"thumb on the scale,\" they breed deep-seated cross-racial resentment and do violence to the constitutional principle that \"we are just one race here. It is American.\" Adarand, 515 U.S. at 239 (Scalia, J., concurring).\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e\n\n2.\n\nEven more baffling is the dissent's claim that because the District ultimately assigns each student to a \"quality\" high school offering a \"baseline . . . education,\" no applicant rejected on the basis of his or her race \"suffers a constitutionally significant burden\" from the tiebreaker's operation. Post at 10076-77, 10098-99.\n\nWe certainly agree with the dissent's observation that no student has a right to attend the school of his or her choice or to attend a school offering anything more than the standard education mandated by state law. Post at 10098. What the dissent seems to overlook is that individuals likewise have no right to welfare benefits, Shapiro v. Thompson, 394 U.S. 618, 627 n.6 (1969), unemployment compensation, Sherbert v. Verner, 374 U.S. 398, 404 (1963), overruled on other grounds by Employment Div. v. Smith, 494 U.S. 872 (1990), a tax exemption, Sherbert, 374 U.S. at 406 (discussing Speiser v. Randall, 357 U.S. 513 (1958)), or a public job, Perry v. Sindermann, 408 US. 593, 597-98 (1972). Yet no one would seriously maintain that, as a result, states or localities could condition the distribution and extent of such benefits on the basis of race.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\n\nThe dissent's appeal to the rights/privileges distinction in this context is particularly ironic because it readily parallels arguments long ago repudiated in this context. Indeed, it quite unintentionally evokes the State of Missouri's argument that because it had no duty to supply legal education, and there was therefore no personal \"right\" to a legal education, no one could suffer a legally cognizable injury from the University of Missouri Law School's use of a racial classification in admissions. Yet as the Court explained in rejecting that claim, \"The question here is not of a duty of the State to supply legal training, or of the quality of the training which it does supply, but of its duty when it provides such training to furnish it to the residents of the State upon the basis of an equality of right.\" Missouri ex rel. Gaines v. Canada, 305 U.S. 337, 349-50 (1938).\n\nLikewise, we think the issue here is not whether students have a right to attend the school of their choice, or one of significantly above-average quality. It is whether having made available a choice-based system of public education the District may use race to circumscribe parental choices in the way it has. The dissent's suggestion that it may do so because all are \"equally subject\" to such discrimination, post at 10097 (emphasis in original), cannot be correct: Across-the-board wrongs do not, as the dissent reasons, make a right.\n\nD.\n\nUnfortunately, the dissent's thin scrutiny of the District's racial tiebreaker strays far from constitutional norms-and it inadvertently threatens to entrench a permanent regime of racial discrimination. For if public education's most compelling mission really is to prepare children to interact with those who look different by balancing each school's racial profile, then the Constitution's promise of equal justice will remain unfulfilled for the inestimable number of future generations during which race inevitably will be perceptible.\n\nV.\n\n[18] Because the School District's use of the racial tiebreaker violates the equal protection mandate of the Fourteenth Amendment, we REVERSE the decision of the District Court and REMAND with instructions to ENJOIN the School District from using the racial tiebreaker, as most recently constituted, in making future high school assignments.\n\nGRABER, Circuit Judge, dissenting:\n\nFifty years after Brown v. Board of Education, 347 U.S. 483 (1954), required the integration of public schools \"with all deliberate speed,\" 349 U.S. 294, 301 (1955), segregated schools remain in many communities, often as a result of segregated housing patterns.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e Seattle has been no exception to the struggle to achieve and maintain integrated schools. After decades of more coercive efforts to counteract the effects of segregated housing patterns, Seattle School District No. 1 (\"the District\") in 1998 adopted a high school assignment plan (\"the Plan\") to maximize school choices for students and their families while continuing to ensure that integrated public schools are available to all. I respectfully dissent from my colleagues' conclusion that the Plan is unconstitutional.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e When understood in context, the Plan is narrowly tailored to serve a compelling governmental interest in ensuring that all students in Seattle's public high schools receive the educational benefits of an integrated learning environment.\n\nThe Supreme Court of the United States has never decided a case involving the consideration of race in a voluntarily imposed school assignment program that is intended to promote integrated secondary schools. The Court's recent decisions regarding the consideration of race in selective admissions to institutions of higher learning do not control in the secondary-school context, but they provide several guiding principles. First, the Court in Grutter v. Bollinger, 539 U.S. 306, 328 (2003), clarified that remediation of past official or de jure discrimination is not the only permissible reason for a government to use racial classifications; one permissible reason for considering race is to achieve the educational benefits of diversity. Second, as the Court reminded us in Grutter:\n\nNot every decision influenced by race is equally objectionable and strict scrutiny is designed to provide a framework for carefully examining the importance and the sincerity of the reasons advanced by the governmental decisionmaker for the use of race in that particular context.\n\nId. at 327.\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e Finally, the Court emphasized that \"narrow tailoring\" is a fact-based analysis, noting that the inquiry in Grutter had to be \"calibrated to fit the distinct issues raised by the use of race to achieve student body diversity in public higher education.\" Id. at 334.\n\nIn order to calibrate our inquiry to fit the distinct issues raised by the use of race as a factor in a school assignment program in a public school district, I believe it is necessary, first, to understand the governmental interests that the District is trying to further and, second, to employ a narrow-tailoring analysis that is appropriate to the secondary-school setting and to the process of assigning every student to a high school. Doing so leads me to conclude that the Plan is narrowly tailored to serve compelling governmental interests.\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e\n\nI. The District's interests in employing a race-conscious classification are compelling, but are not identical to those asserted in Grutter and Gratz v. Bollinger, 539 U.S. 244 (2003).\n\nAs the majority rightly notes, \"diversity\" can be an amorphous concept. Maj. op. at 10006. Indeed, the compelling interest that the Court recognized in Grutter is not \"diversity\" per se but, rather, promotion of the specific educational and societal benefits that flow from diversity. See Grutter, 539 U.S. at 329-30 (noting that the law school's concept of critical mass must be \"defined by reference to the educational benefits that diversity is designed to produce\"). In evaluating the relevance of diversity to higher education, the Court focused principally on two benefits that a diverse student body provides: (1) the learning advantage of having diverse viewpoints represented in the \"robust exchange of ideas\" that is critical to the mission of higher education, id. at 329-30; and (2) the greater societal legitimacy that institutions of higher learning enjoy by cultivating a cadre of national leaders who are representative of our country's diversity, id. at 331-33. The Court also mentioned the role of diversity in challenging stereotypes. Id. at 330, 333; see also Lani Guinier, Admissions Rituals as Political Acts: Guardians at the Gates of Our Democratic Ideals, 117 Harv. L. Rev. 113, 175-76 (2003) (observing that the diversity interest recognized in Grutter has \"three important elements . . . diversity is pedagogical and dialogic; it helps challenge stereotypes; and it helps legitimate the democratic mission of higher education\" (footnotes omitted)). The Court explicitly deferred to the law school's \"educational judgment that such diversity is essential to its educational mission.\" Grutter, 539 U.S. at 328.\n\nBecause strict scrutiny requires us to evaluate the \"fit\" between the government's means and its ends, Wygant v. Jackson Bd. of Educ., 476 U.S. 267, 280 n.6 (1986), it is critical to identify precisely the governmental interests-the ends -to which the government's use of race must be fitted. See United States v. Paradise, 480 U.S. 149, 171 (1987) (noting that, in order to determine whether an order was narrowly tailored, \"we must examine the purposes the order was intended to serve\"). In other words, before we assume that the District shares the interest identified in Grutter, we must consider carefully the interests the District asserts and then determine whether the District's interests are compelling.\n\nThe District's interests are connected. First, the District seeks the affirmative educational benefits that flow from racial diversity (which, as I will discuss below, are different in K-12 education than in higher education). Second, and related, is the District's interest in preventing its school assignment system from replicating Seattle's segregated housing pattern;\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e that is, the District has an interest in ensuring that each one of its students has access to the educational benefits of an integrated school environment.\n\nA. The District has a compelling interest in the educational benefits of racial diversity in secondary education.\n\nThe District has established that racial diversity produces compelling educational benefits in secondary education.\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e\n\nBecause the educational benefits that the District seeks are materially different from those sought by the university in Grutter, however, the type of diversity required to produce those benefits is also different.\n\nThe university sought to further the academic and professional development of its students through the \"livelier, more spirited, and simply more enlightening and interesting\" classroom discussions that result when students have \"the greatest possible variety of backgrounds.\" Grutter, 539 U.S. at 330 (internal quotation marks omitted). Aggrieved applicants accused the university of using race as an impermissible proxy for particular viewpoints and perspectives, but the Court disagreed, holding that racial diversity added to the mix of diversity factors by representing the \"unique experience of being a racial minority in a society, like our own, in which race unfortunately still matters.\" Id. at 333.\n\nAlthough secondary-school educators share the university's academic goals to some extent,\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e achieving diversity of viewpoint and background is not the sole-or even the primary-reason for promoting an integrated secondary-school environment. Cf. Comfort ex rel. Neumyer v. Lynn Sch. Comm., 283 F. Supp. 2d 328, 381 n.90 (D. Mass. 2003) (\"The value of a diverse classroom setting at these ages does not inhere in the range of perspectives and experience that students can offer in discussions; rather, diversity is valuable because it enables students to learn racial tolerance by building cross-racial relationships.\").\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e\n\nThe District begins its own explanation of its interest in classroom diversity by noting the socialization and citizenship advantages of racially diverse schools. See maj. op. at 10003-04 (quoting the School Board's \"Statement Reaffirming [the] Diversity Rationale\"). Indeed, courts have recognized that the fundamental goal of K-12 education is to prepare children to be good citizens-to socialize children and to inculcate civic values.\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e See Bethel Sch. Dist. No. 403 v. Fraser, 478 U.S. 675, 683 (1986) (stating that the inculcation of civic values is \"truly the work of the schools\" (internal quotation marks omitted)); Plyler v. Doe, 457 U.S. 202, 221-23 (1982) (noting that public education perpetuates the political system and the economic and social advancement of citizens); Ambach v. Norwick, 441 U.S. 68, 76-77 (1979) (observing that public schools transmit to children \"the values on which our society rests,\" including \"fundamental values necessary to the maintenance of a democratic political system\"); Brown, 347 U.S. at 493 (\"[Education] is required in the performance of our most basic public responsibilities . . . . It is the very foundation of good citizenship.\"); see also Comfort, 283 F. Supp. 2d at 381 n.90 (\"[A]t the elementary, middle, and high school level, the goal of teaching socialization is at least as important as the subject matter of instruction.\").\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e In Washington, such civic training is mandated by the state constitution: \"Our constitution is unique in placing paramount value on education for citizenship.\" Parents Involved in Cmty. Schs. v. Seattle Sch. Dist., No. 1, 72 P.3d 151, 158 (Wash. 2003).\n\nIn our society, in which \"race unfortunately still matters,\" Grutter, 539 U.S. at 333, the \"goals of teaching tolerance and cooperation among the races[ ] [and] of molding values free of racial prejudice . . . are integral to the mission of public schools,\" Parents Involved, 72 P.3d at 162.\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e Achieving those teaching goals requires the presence of a racially diverse student body. See Comfort, 283 F. Supp. 2d at 376-77 (\"If the compelling goal of the Plan is to train citizens to function in a multiracial world, actual intergroup racial contact is essential.\"). The District has emphasized the importance of interaction with peers of other races in educating students for citizenship; school officials, relying on their experience as teachers and administrators, and the District's expert all explained these benefits on the record. Even Plaintiff's expert admitted that students are widely perceived to benefit from the information that they gain from increased contact with children of other races.\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e See also Boston's Children First v. City of Boston, 62 F. Supp. 2d 247, 259 (D. Mass. 1999) (\"Diversity may well be more important at this stage than at any other-[because elementary school] is when first friendships are formed and important attitudes shaped . . . .\"). As the United States Supreme Court has noted, this educational goal is relevant for the entire community:\n\nAttending an ethnically diverse school may help accomplish this goal by preparing minority children for citizenship in our pluralistic society while, we may hope, teaching members of the racial majority to live in harmony and mutual respect with children of minority heritage.\n\nWashington v. Seattle Sch. Dist. No. 1, 458 U.S. 457, 473 (1982) (citations and internal quotation marks omitted).\n\nThe majority misperceives the distinction between the interest recognized in Grutter and the one that I would recognize here. See maj. op. at 10043-44. The District's socialization and citizenship training is no more tangential or external to the educational experience of a secondary school than is academic training to the educational experience offered by a law school. The University of Michigan wanted to promote a stimulating academic environment so that its graduates would become accomplished and well-rounded members of the legal profession; the District wants to encourage integrated schools so that its graduates will become tolerant, productive, and well-adapted members of this racially diverse society. In both cases, although the benefits are external and long-term, the teaching occurs-and can be observed and evaluated-within the school environment.\n\nIn short, the District has a compelling interest in educating all students in a racially diverse learning environment, to educate them effectively to take their places in a racially diverse society.\n\nB. The District has a compelling interest in reducing racial isolation and ameliorating de facto segregation.\n\nThe District's interest in achieving the affirmative benefits of a racially diverse educational environment has a flip side: avoiding racially concentrated, or racially isolated, schools. In particular, the District is concerned with making the educational benefits of an integrated school environment available to all its students. Thus, in addition to striving for better academic and social outcomes across the board, the District has been motivated by its belief that \"[n]o student should be required to attend a racially concentrated school.\"\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e In other words, the Plan strives to ensure that patterns of residential segregation are not repeated as patterns of educational segregation that would be \"determinative of a child's opportunity.\" Comfort, 283 F. Supp. 2d at 384.\n\nThis \"flip side\" makes the District's interest different from any that could have been posited in Grutter. Universities (like most other entities that select a few from among a pool of competitive applicants) are not, in any direct sense, responsible for the welfare of the entire universe of their applicants. That is, so long as all applicants are treated fairly in the competition for access to the limited government benefit, a university may design a class of students that satisfies its academic objectives without worrying about the effect that its admissions decisions have on rejected applicants.\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e Public school districts, on the other hand, must consider not only the affirmative effect that a student's assignment to a particular school will have on the level of diversity in that school, but also the concomitant effect of that assignment on the entire school system.\n\nAs the district court did in this case,\u003cspan class=\"fnref\"\u003e71\u003c/span\u003e several courts have conceived of a school district's voluntary reduction or prevention of de facto segregation as a compelling interest. See Brewer v. W. Irondequoit Cent. Sch. Dist., 212 F.3d 738, 752 (2d Cir. 2000) (holding that \"a compelling interest can be found in a program that has as its object the reduction of racial isolation and what appears to be de facto segregation\"), superseded on other grounds as stated in Zervos v. Verizon N.Y., Inc., 252 F.3d 1163, 171 n.7 (2d Cir. 2001); Parent Ass'n of Andrew Jackson High Sch. v. Ambach, 738 F.2d 574, 579 (2d Cir. 1984) (\"[W]e held that the Board's goal of ensuring the continuation of relatively integrated schools for the maximum number of students, even at the cost of limiting freedom of choice for some minority students, survived strict scrutiny as a matter of law.\" (citing Parent Ass'n of Andrew Jackson High Sch. v. Ambach, 598 F.2d 705, 717-20 (2d Cir. 1979)); Comfort, 283 F. Supp. 2d at 384-86 (holding that a school district had a compelling interest in ameliorating the effects of de facto residential segregation); Hampton v. Jefferson County Bd. of Educ., 102 F. Supp. 2d 358, 379 (W.D. Ky. 2000) (noting that \"voluntary maintenance of the desegregated school system should be considered a compelling state interest,\" such that a district may consider race in assigning students to comparable schools).\n\nNone of the school districts in the above-cited cases was subject to a court-ordered desegregation decree nor, with one exception, did the schools face an imminent threat of litigation to compel desegregation.\u003cspan class=\"fnref\"\u003e72\u003c/span\u003e Like the Seattle School District, they may have been vulnerable to litigation in decades past,\u003cspan class=\"fnref\"\u003e73\u003c/span\u003e but the districts' voluntary desegregation measures today would make it difficult to make the required showing that the districts intended to create segregated schools. See, e.g., Comfort, 283 F. Supp. 2d at 390 (explaining that the district's vulnerability to litigation had been \"headed off by the very Plan in contention here\"). It is well established that school districts have no obligation to remedy de facto (as distinct from de jure) segregation. Freeman v. Pitts, 503 U.S. 467, 495 (1992). Nevertheless, several courts have pointed out the irony of a conclusion that a measure that could be required to remedy segregation could not be adopted voluntarily to prevent segregation. See, e.g., Comfort, 283 F. Supp. 2d at 384-85 (\"It would make no sense if [school] officials were obliged to take responsibility for addressing these adverse consequences [of segregated schools] but at the same time were constitutionally barred from taking voluntary action aimed at nipping some of these effects in the bud.\"); Parents Involved in Cmty. Schs. v. Seattle Sch. Dist. No. 1, 137 F. Supp. 2d 1224, 1235 (W.D. Wash. 2001) (\"[I]t would defy logic for this court to find that the less intrusive programs of today violate the Equal Protection Clause while the more coercive programs of the 1970's did not.\"); Hampton, 102 F. Supp. 2d at 379 (\"It is incongruous that a federal court could at one moment require a school board to use race to prevent resegregation of the system, and at the very next moment prohibit that same policy.\").\n\nIn essence, what these courts have recognized is that school districts have a prospective, even if not a remedial, interest in avoiding and ameliorating real, identifiable de facto racial segregation. Support for this conclusion comes from statements in the Supreme Court's school desegregation cases, which repeatedly refer to the voluntary integration of schools as sound educational policy within the discretion of local school officials. See Swann v. Charlotte-Mecklenburg Bd. of Educ., 402 U.S. 1, 16 (1971) (stating that school authorities \"are traditionally charged with broad power to formulate and implement educational policy and might well conclude . . . that in order to prepare students to live in a pluralistic society each school should have a prescribed ratio of Negro to white students reflecting the proportion for the district as a whole\"); N.C. State Bd. of Educ. v. Swann, 402 U.S. 43, 45 (1971) (\"[A]s a matter of educational policy school authorities may well conclude that some kind of racial balance in the schools is desirable quite apart from any constitutional requirements.\"); Bustop, Inc. v. Bd. of Educ. of L.A., 439 U.S. 1380, 1383 (Rehnquist, Circuit Justice 1978) (denying a request to stay implementation of a desegregation plan and noting that there was \"very little doubt\" that the Constitution at least permitted its implementation); Keyes v. Sch. Dist. No. 1, 413 U.S. 189, 242 (1973) (Powell, J., concurring in part and dissenting in part) (\"School boards would, of course, be free to develop and initiate further plans to promote school desegregation. . . . Nothing in this opinion is meant to discourage school boards from exceeding minimal constitutional standards in promoting the values of an integrated school experience.\"); Seattle Sch. Dist., 458 U.S. at 480, 487 (reinstating the Seattle School District's authority to use mandatory busing to correct de facto segregation).\n\nOf course, these statements must be considered in the light of the Court's later decisions in City of Richmond v. J.A. Croson Co., 488 U.S. 469, 507 (1989) (holding that \"outright racial balancing\" did not constitute a permissible reason to establish a quota for awarding construction contracts); Freeman, 503 U.S. at 494 (holding that, in the absence of a constitutional violation, the district court had no power to order \"[r]acial balance . . . for its own sake\"); and Grutter, 539 U.S. at 329-30 (stating that the law school's concept of \"critical mass\" was permissible only because it was not \"outright racial balancing,\" but rather was \"defined by reference to . . . educational benefits\"). Those decisions establish that the government may not act in furtherance of racial balance without a compelling nonracial reason. Unless and until the Supreme Court says otherwise, however, I would heed its repeated statements that the voluntary integration of public schools, in response to specific conditions of de facto segregation and in furtherance of legitimate educational policies, can be a constitutionally permissible interest.\n\nIn sum, I would hold that the District has a compelling interest in structuring its assignment policies to prevent a return to the era in which Seattle's undisputedly segregated housing pattern was the exclusive determinant of school assignments to neighborhood schools.\n\nC. Deference to administrators' expertise in education policy is warranted.\n\nIn addition to signaling specifically its approval of voluntary measures to promote integrated schools, the Supreme Court repeatedly has shown deference to school officials at the intersection between constitutional protections and educational policy. See generally Wendy Parker, Connecting the Dots: Grutter, School Desegregation, and Federalism, 45 Wm. \u0026 Mary L. Rev. 1691 (2004). Local control over public education has animated Supreme Court jurisprudence from the dawn to the apparent twilight of federal-court involvement in the desegregation of public schools. See, e.g., Brown, 349 U.S. at 299 (directing local school officials, with court oversight, to devise remedies for segregation in the light of \"varied local school problems\"); Milliken v. Bradley, 418 U.S. 717, 741-42 (1974) (\"No single tradition in public education is more deeply rooted than local control over the operation of schools; local autonomy has long been thought essential both to the maintenance of community concern and support for public schools and to quality of the educational process.\"); Freeman, 503 U.S. at 490 (\"As we have long observed, 'local autonomy of school districts is a vital national tradition.' \" (quoting Dayton Bd. of Educ. v. Brinkman, 433 U.S. 406, 410 (1977)). In the context of a challenge to a school-funding system, the Court was motivated, in part, by concerns about the judiciary's lack of competency in the area of educational policy. See San Antonio Indep. Sch. Dist. v. Rodriguez, 411 U.S. 1, 42 (1973) (stating, in its rational-basis review of a school-funding system, that \"this case . . . involves the most persistent and difficult questions of educational policy, another area in which this Court's lack of specialized knowledge and experience counsels against premature interference with the informed judgments made at the state and local levels\").\u003cspan class=\"fnref\"\u003e74\u003c/span\u003e\n\nThus, although I agree that public secondary schools do not have \"a constitutional right to select their student body,\" maj. op. at 10042,\u003cspan class=\"fnref\"\u003e75\u003c/span\u003e they have been given considerable discretion to devise school assignment policies, even in the face of adjudicated constitutional violations.\n\nThe Supreme Court also has shown solicitude toward the educational objectives of public school administrators in balancing those educational objectives with students' First Amendment rights. See, e.g., Hazelwood Sch. Dist. v. Kuhlmeier, 484 U.S. 260, 273 (1988) (holding that educators may censor student speech in school-sponsored forums for valid educational reasons and noting that \"[t]his standard is consistent with our oft-expressed view that the education of the Nation's youth is primarily the responsibility of parents, teachers, and state and local school officials, and not of federal judges\"); see also Comfort, 283 F. Supp. 2d at 374 \u0026 n.83 (citing Supreme Court cases involving the balancing of schools' curricular needs against students' rights under the First, Fourth, and Eighth Amendments, as well as the Due Process Clause of the Fourteenth Amendment). This deference recognizes not merely a school's need to preserve order so as to promote pure \"academic\" learning, as the majority suggests, maj. op. at 10043, but also to teach students that certain kinds of discourse are \"wholly inconsistent with the 'fundamental values' of public school education,\" Bethel Sch. Dist., 478 U.S. at 685-86.\n\nThese Supreme Court decisions suggest that secondary schools, like universities, occupy a \"special niche\" in our constitutional tradition, albeit one that owes more to the values of federalism and to the public schools' broad educational mission than to a desire to safeguard academic freedom. For this reason, I would afford some deference to the District's judgment that integrated schools are essential to its educational mission and would extend to the District's identification of its core values a deference similar to that which the Grutter Court afforded the university. See Grutter, 539 U.S. at 328; cf. Petit v. City of Chicago, 352 F.3d 1111, 1114 (7th Cir. 2003) (extending deference, pursuant to Grutter, to the \"views of experts and Chicago police executives that affirmative action was warranted to enhance the operations\" of the Chicago Police Department), cert. denied, 124 S. Ct. 2426 (2004).\n\nIn sum, I am convinced by the record, as well as by deference to the District's expertise in educational policy, that the District's interests in obtaining the educational benefits of diversity in secondary education and in ameliorating the de facto segregation caused by Seattle's segregated housing pattern are compelling as a matter of law.\n\nII. The District's Plan is narrowly tailored to achieve its compelling governmental interests.\n\nThe narrow-tailoring inquiry is intended to \" 'smoke out' illegitimate uses of race\" by ensuring that the government's classification is closely fitted to the compelling goals that it seeks to achieve. Croson, 488 U.S. at 493. As discussed above, the analysis must fit the context of the challenged governmental action. Grutter, 539 U.S. at 327, 333-34. For example, the factors that the Court uses to assess narrow tailoring in the employment context, Paradise, 480 U.S. at 171,\u003cspan class=\"fnref\"\u003e76\u003c/span\u003e must be modified for use in the context of higher education. See Johnson v. Bd. of Regents of Univ. of Ga., 263 F.3d 1234, 1252 (11th Cir. 2001) (\"We do think, however, that the Paradise factors should be adjusted slightly to take better account of the unique issues raised by the use of race to achieve diversity in university admissions.\"). Likewise, some of the factors used to assess programs related to employment or higher education are of doubtful relevance in the context of K-12 school assignment plans. See Hampton, 102 F. Supp. 2d at 380 (\"The workplace, marketplace, and higher education cases are poor models for most elementary and secondary public school education . . . .\"). We must consider which narrow-tailoring factors are appropriate to this context; our inquiry\n\npivots not merely on the fact that race is used in a school plan, but how it is used, in what settings, for what purposes, whether it is race conscious or race preferential, whether it involves an examination school (or a college or law school) for which there are significant qualifications, or an elementary school, for which there are not, whether the use of race excludes or simply affects the distribution of a benefit . . . .\n\nBoston's Children, 62 F. Supp. 2d at 259.\n\nBecause of the differences in setting, several of the narrow-tailoring factors employed by the Supreme Court in Grutter and Gratz-and by the majority in this case-have no logical relevance to the evaluation of secondary-school assignment plans like the District's. After fashioning an appropriately contextualized narrow-tailoring analysis, I will consider the Plan in its broader historical and factual context and conclude that the Plan satisfies strict scrutiny.\n\nA. Narrow-tailoring factors involving \"holistic review\" and \"quotas\" have no relevance in the context of assigning students to secondary schools.\n\nFor two reasons, cases involving selective admissions to institutions of higher learning do not provide a proper \"narrow tailoring\" model for this case.\u003cspan class=\"fnref\"\u003e77\u003c/span\u003e First, they involve situations in which a school grants or denies access to a limited government benefit based on the school's evaluation of a particular applicant's merit; using race as a proxy, or as a substitute, for merit in awarding this benefit raises problems of stereotyping and stigma that are absent from the District's Plan. Second, the institutions involved in those cases seek the \"true diversity\" befitting their advanced academic orientations; as I have discussed, the diversity interest in the K-12 context involves different educational benefits and, like the District's related interest in ameliorating de facto segregation, is more appropriately achieved through an explicit consideration of racial diversity.\n\n1. Where competition for a limited government resource is absent, rules about how competition may be conducted are irrelevant.\n\nIn Grutter, the Supreme Court \"define[d] the contours of the narrow-tailoring inquiry with respect to race-conscious university admissions programs.\" See Grutter, 539 U.S. at 333. In the context of university admissions, where applicants compete for a limited number of spaces in a class, the Court focused its inquiry on what role race may play in judging an applicant's qualifications. The Court's underlying concern is for fair competition-to prevent race from being used as an outright substitute for merit in the competition for access to a limited government resource, in part because of the stigma that may attach. See Regents of Univ. of Cal. v. Bakke, 438 U.S. 265, 298 (1978) (Powell, J., concurring) (stating that \"preferential programs may only reinforce common stereotypes holding that certain groups are unable to achieve success without special protection based on a factor having no relationship to individual worth\"); Croson, 488 U.S. at 493 (\"Classifications based on race carry a danger of stigmatic harm. Unless they are strictly reserved for remedial settings, they may in fact promote notions of racial inferiority and lead to a politics of racial hostility.\"); see also Gratz, 539 U.S. at 272-73 (applying the narrow-tailoring inquiry to ensure that applicants of all races have the opportunity to prove their merit based on a broad range of criteria). In Grutter, the Court discussed two specific rules to ensure fair competition. 539 U.S. at 334. The first prohibits \"quotas,\" which insulate applicants from certain groups from competition with applicants from other groups for some portion of the available slots.\u003cspan class=\"fnref\"\u003e78\u003c/span\u003e Id. at 335. The second rule prevents race from being used as a mechanical proxy for merit by requiring individualized consideration of the merit of each applicant, across a broad range of factors (of which race may be but one). Id. at 336-37.\n\nNeither of those requirements, which concern how universities are permitted to evaluate merit, is relevant in a situation where there is absolutely no competition or consideration of merit at issue. All high school students must and will be placed in a Seattle public school. The students' relative merit is irrelevant. There are no special qualifications for assignment to any school, so no stigma results from any particular school assignment.\u003cspan class=\"fnref\"\u003e79\u003c/span\u003e The dangers of substituting racial preference for fair, merit- or worth-based competition are absent here. Justice Powell recognized this very fact in his landmark opinion in Bakke, which reasoned that the use of racial classifications to desegregate schools was fundamentally different from the selective admissions context because, in the school assignment context, \"white students [were not] deprived of an equal opportunity for education.\" Bakke, 438 U.S. at 301 n.39.\n\nJustice Powell's comment suggests an even more fundamental reason why a careful, holistic, individualized consideration of an applicant's worth is not necessary here: No student is being excluded from the government resource at issue-a free public education.\u003cspan class=\"fnref\"\u003e80\u003c/span\u003e In the assignment process, all students are accommodated with the same baseline high school education.\u003cspan class=\"fnref\"\u003e81\u003c/span\u003e As I will discuss in more depth below, differences among the high schools may be relevant to our consideration of the \"burdens\" that the Plan imposes, but perceived or actual differences in academic quality do not transform the District's assignment process into a competition for access to a limited government resource. This is especially true where it is clear that every student can enroll in at least one of Seattle's oversubscribed, \"quality\" high schools.\n\n2. Where \"true diversity\" is not the goal, consideration of a broad range of diversity factors is unnecessary.\n\nAnother rationale for the Court's requirement of holistic review is that it provides a closer fit with a university's interest in viewpoint diversity. Grutter, 539 U.S. at 337. The Court held that it was impermissible to presume that race would correlate with viewpoint, perspective, or background; rather, the university must evaluate each applicant's viewpoint, perspective, and background. Id. at 338-39.\n\nThe danger that race would be used to \"fill[ ] stereotyped 'viewpoint' niches,\" Comfort, 283 F. Supp. 2d at 379, is not present here. The diversity interest in K-12 education is much simpler: that children learn to interact with peers of different races. That interest requires that there be children of different races in the classroom. Rather than relying on stereotypes, intergroup contact has the opposite effect; it inhibits the formation of stereotypes by teaching children that \"all people are different no matter what their color or ethnic background.\" Id. In other words, the District's focus on racial diversity is not a presumption that students of the same race will share common viewpoints; the presence of students of different races is meant to break down, rather than to further, racial stereotypes by giving students an opportunity to learn that race does not signal an individual's viewpoint, perspective, or background.\n\nMoreover, the holistic review necessary to achieve \"true diversity\" is of even less relevance to the District's interest in preventing and ameliorating de facto racial segregation. As the Second Circuit has said:\n\nIf reducing racial isolation is-standing alone-a constitutionally permissible goal, as we have held it is . . . , then there is no more effective means of achieving that goal than to base decisions on race. . . . [T]he cases cited by the District Court in support of its decision that the use of race alone in the Program was not narrowly tailored only address the efficacy of employing strictly racial classifications to achieve \"true diversity.\" Those decisions are, therefore, inapplicable to the present situation where the Program's aim . . . is precisely to ameliorate racial isolation in the participating districts.\n\nBrewer, 212 F.3d at 752-53 (citations omitted). In other words, when the District's compelling interest is in racial diversity, it makes little sense to ask it instead to evaluate a student's musical talent, athletic prowess, or eligibility for a free lunch.\u003cspan class=\"fnref\"\u003e82\u003c/span\u003e\n\nB. Viewed in its historical and factual context, the District's Plan satisfies an appropriate narrow-tailoring test.\n\nExcept for rejecting the narrow-tailoring factors peculiar to situations of competition and \"true diversity,\" I have no disagreement with the majority's identification of the remaining narrow-tailoring factors. As I will discuss, I conclude that the Plan satisfies the narrow-tailoring test. But first, in order to facilitate an accurate narrow-tailoring inquiry, I believe it is necessary to supplement the majority's statement of facts by placing the District's adoption of the Plan in a broader factual context.\n\n1. The broader context of desegregation efforts and the Board's decision to adopt the Plan.\n\nThe increase in Seattle's minority population after World War II was concentrated first in the central, then in the southeast, area of the city.\u003cspan class=\"fnref\"\u003e83\u003c/span\u003e Because school assignments were made strictly on the basis of neighborhood, schools in the central and southeast areas reflected that population concentration. In 1962, the central area's Garfield High School reported 64 percent minority enrollment (it accommodated 75 percent of all black students), and six of the central area elementary schools had at least 75 percent minority enrollment.\u003cspan class=\"fnref\"\u003e84\u003c/span\u003e Meanwhile, the eight high schools serving other major areas of the city remained more than 95 percent white.\n\nIn the 1960's, the District responded to this imbalance in various ways. It granted the central area principals' request for special financial assistance. It responded to racial tensions by experimenting with exchange programs, in which a handful of students switched high schools for several weeks. And in 1963, the District implemented a voluntary racial transfer program, through which a student could transfer to any school with available space, if the transfer would improve the racial balance at the receiving school. Although this program had some positive results, it did not reduce the racial imbalance significantly.\n\nIn the 1970's, the District stepped up its efforts. It adopted a plan to desegregate central-area middle schools by requesting volunteers to transfer between minority- and majority-dominated neighborhood schools and ordering mandatory transfers when the numbers of volunteers were insufficient. The District also took steps to desegregate Garfield High School by changing its educational program, improving its facilities, and eliminating the \"special transfers\" that had allowed white students to leave the Garfield area. In addition, for the 1977-78 school year, the District instituted a magnet-school program to promote desegregation. According to the District's history:\n\nWhile it appeared evident that the addition of magnet programs would not in itself desegregate the Seattle schools, there was supportive evidence that voluntary strategies, magnet and non-magnet, could be significant components of a more comprehensive desegregation plan.\n\nBy the 1977-78 school year, Franklin was 78 percent minority, Rainier Beach 58 percent, Cleveland 75 percent, and Garfield 64 percent. Other high schools ranged from 9 percent to 23 percent minority enrollment, with one school (Lincoln) at 37 percent. See Seattle Sch. Dist., 458 U.S. at 461 (noting that the racial imbalance in Seattle's schools had increased between the 1970-71 and 1977-78 school years).\n\nIn the spring of 1977, the NAACP filed a complaint with the Office of Civil Rights, alleging that Seattle's School Board had acted to further racial segregation in the city's schools. Several other organizations, principally the ACLU, threatened to file an action in court if the District failed to adopt a mandatory desegregation plan. When the District agreed to develop a desegregation plan, the Office of Civil Rights concomitantly agreed to delay its investigation, and the ACLU agreed to delay filing a lawsuit. See Seattle Sch. Dist., 458 U.S. at 460 n.2 (describing this threat of litigation).\n\nDuring the summer of 1977, the District and community representatives reviewed five model plans. Ultimately, the District incorporated elements of each model into its final desegregation plan, adopted in December 1977 and known as the \"Seattle Plan.\" The Seattle Plan divided the district into zones, within which majority-dominated elementary schools were paired with minority-dominated elementary schools to achieve racial balance. Mandatory high school assignments were linked to elementary-school assignments, although various voluntary transfer options were available. With the Seattle Plan,\n\nSeattle became the first major city to adopt a comprehensive desegregation program voluntarily without a court order. By doing so the District maintained local control over its desegregation plan and was able to adopt and implement a plan which in the eyes of the District best met the needs of Seattle students and the Seattle School District.\n\n\"History of Desegregation\" at 36-37. An initiative was passed immediately to block implementation of the Seattle Plan, but the initiative ultimately was declared unconstitutional by the United States Supreme Court. Seattle Sch. Dist., 458 U.S. at 470 (holding that the initiative violated equal protection).\n\nThe Seattle Plan apparently furthered the District's school desegregation goals, but its operation was unsatisfactory in other ways.\u003cspan class=\"fnref\"\u003e85\u003c/span\u003e In 1988, the District abandoned the Seattle Plan and adopted a new plan that it referred to as \"Controlled Choice.\" Under the Controlled Choice plan, schools were grouped into clusters that met state and district desegregation guidelines, and families were permitted to rank schools within the relevant cluster, increasing the predictability of assignments. Because of Seattle's housing patterns, the District's planners explained that \"it was impossible to fashion clusters in a geographically contiguous manner\"; some cluster schools were near the student's home, but others were in \"racially and culturally different neighborhoods.\" Although roughly 70 percent of students received their first choices, the Controlled Choice plan still resulted in mandatory busing for 16 percent of the District's students.\n\nIn the mid-1990's, District staff were directed to devise a new plan for all grade levels to simplify assignments, reduce costs, and increase community satisfaction, among other things; the guiding factors were to be choice, diversity, and predictability. Staff developed four basic options, including the then-existing Controlled Choice plan, a regional choice plan, a neighborhood assignment plan with provision for voluntary, integration-positive transfers, and an open choice plan.\n\nBoard members testified that they considered all the options, as they related to the District's educational goals-with special emphasis, at the secondary-school level, on the goals of choice and diversity. Neighborhood and regional plans were viewed as unduly limiting student choice, on which the District placed high value because it was seen to increase parental involvement in the schools and promote improvements in quality through a marketplace model. The District sought to maintain its commitment to integrated education by establishing diversity goals, but moving away from the rigid desegregation guidelines and mandatory assignments prevalent in the 1970's and 1980's. The Board adopted the current, open choice Plan for the 1998-99 school year.\n\nThe Plan now under review permits students to rank their choices among the District's 10 high schools. The District has sought to make each of the 10 schools unique, with programs that attempt to respond to the continually changing needs of students and their parents.\u003cspan class=\"fnref\"\u003e86\u003c/span\u003e Only when oversubscription results from families' choices-as, of course, it has-does the District become involved in the assignment process. Assignments to oversubscribed schools proceed by way of a series of tiebreakers: first, students with a sibling attending the selected school are assigned; second, if but only if the school deviates from the District's proportion of white and minority students by more than a specified percentage,\u003cspan class=\"fnref\"\u003e87\u003c/span\u003e students who bring that school closer to the ratio are assigned; third, students are assigned in order of the distance from their homes to the school.\u003cspan class=\"fnref\"\u003e88\u003c/span\u003e The first and third tiebreakers seek to further the District's goal of parental involvement, and the second is directed toward the District's diversity goal. Students not assigned to one of their chosen schools are assigned to the closest school with space available; naturally, students who list more choices are less likely to receive one of these \"mandatory\" assignments.\n\nHaving examined the District's interests and the specifics of the Plan in its historical context, I will turn next to a consideration of whether the Plan is narrowly tailored to serve the compelling governmental interests that I have identified.\n\n2. The District's Plan is narrowly tailored.\n\nA narrow-tailoring analysis requires consideration of three traditional groups of factors: (1) the necessity for the action and the efficacy of alternative, race-neutral remedies; (2) the extent to which the action is proportional to the District's interests (particularly, whether it is of limited duration and is flexible, in relation to its objective); and (3) the relative weight of any burden on third parties. See Paradise, 480 U.S. at 171; see also Comfort, 283 F. Supp. 2d at 371-73. As I stated above, the purpose of this inquiry is to \" 'smoke out' illegitimate uses of race\" by ensuring that the government's means are closely fitted to its ends. Croson, 488 U.S. at 493.\n\n(a) The Plan achieves the District's diversity goals more effectively than any workable race-neutral alternative.\n\n(i) Need for the integration tiebreaker\n\nThe integration tiebreaker allows the District to make students' and parents' choices among high schools the primary feature of its educational plan,\u003cspan class=\"fnref\"\u003e89\u003c/span\u003e while discouraging a return to enrollment patterns based on Seattle's racially segregated housing pattern. When the District moved from its Controlled Choice plan to the current, open choice Plan, it predicted that families would tend to choose schools close to their homes. Indeed, this feature was seen as a positive way to increase parental involvement. However, unfettered choice-especially with tiebreakers based on neighborhood or distance from a school-raised the risk that Seattle's high school enrollment would begin to reflect its segregated housing patterns. The District's 2000-01 enrollment data showed that, of the students living in the southern half of Seattle, only 23 percent are white (6,247 out of 27,377 students), as compared with 64 percent of the students living in the northern half of the city (12,571 out of 19,555 students).\n\nIt is de facto residential segregation across this white/ nonwhite axis that the District has battled historically and that it sought to prevent by making the integration tiebreaker a part of its open choice Plan. Although I have no doubt that other forms of race-based tension exist, see maj. op. at 10046 n.47, the District reasonably placed its focus here. The District has consistently faced a pattern in which its white students live predominately in the northern half of the city (in 2000-2001, 66.8 percent of the District's white students lived in the northern half of the city) and its students of color-in each of the three largest categories that the District tracks\u003cspan class=\"fnref\"\u003e90\u003c/span\u003e -live predominately in the southern half of the city. In 2000-2001, 74.2 percent of the District's Asian students, 83.6 percent of its Black students, and 65 percent of its Hispanic students lived in the southern half of the city:\n\n2000-01 ENROLLMENT BY GEOGRAPHIC AREA\n\nGEOGRAPHIC AREAASIANBLACKHISPANICWHITE\n\nNORTH2,8791,7781,69312,571\n\nSOUTH8,2699,0543,1456,247\n\nTOTAL11,14810,8324,83818,818\n\nPERCENTAGE OF STUDENTS SOUTH74.2%83.6%65.0%33.2%\n\nMoreover, Seattle's peculiar geography makes its northern neighborhoods and schools distant from its southern neighborhoods and schools. In these circumstances, the District permissibly could prioritize white/nonwhite, primarily north/ south, movement. This white/nonwhite focus also is consistent with the history of public school integration measures in this country, as reflected in a current federal regulation defining \"[m]inority group isolation\" as \"a condition in which minority group children constitute more than 50 percent of the enrollment of the school,\" without distinguishing among the various categories included within the definition of \"[m]inority group.\" 34 C.F.R. § 280.4(b).\n\nTo discourage choices that would perpetuate this north-south division between the district's white and nonwhite populations, the District gave priority to choices that would counter it and create north-south movement within the District. In the 2000-01 school year, the integration tiebreaker operated in four high schools (that is, four high schools were oversubscribed and deviated by more than 15 percent from the ratio of white to nonwhite students District-wide). Although the integration tiebreaker was a limited measure, in contrast to the District's previous efforts, it did serve to alter the imbalance in the schools in which it operated.\n\nThe majority's contrary view is based on a skewed presentation of the enrollment statistics. Figures reflecting the tiebreaker's total effect on a school's enrollment, such as those cited in the majority opinion, see maj. op. at 10047 (\"Table 2\"), 10049 (\"Table 3\"), 10049 (citing a maximum shift of 6.1 percent in the white/nonwhite ratio), artificially minimize the tiebreaker's effect by failing to recognize that students enter the ninth grade in much greater numbers than they transfer to other schools after the ninth grade. The following statistics submitted by the District, which portray directly the effect of the tiebreaker on the make-up of the ninth grade classes at the four affected schools, illustrate the function of the tiebreaker far more accurately:\n\n2000-01 CHANGE IN PERCENTAGES OF STUDENTS OF COLOR IN NINTH GRADE CLASSES\n\nSCHOOLWITHOUT INTEGRATION TIEBREAKERWITH INTEGRATION TIEBREAKERPERCENT CHANGE\n\nFRANKLIN79.259.5- 19.7\n\nNATHAN HALE30.540.6+ 10.1\n\nBALLARD33.054.2+ 21.2\n\nROOSEVELT41.155.3+ 14.2\n\nIn other words, the majority's references to a 6.1 percent maximum shift do not tell the whole story.\n\nStill, without the integration tiebreaker, the freshman classes at some of the affected north-end schools may well have been sufficiently diverse to promote interaction across the white/nonwhite axis and to prevent the tokenization of nonwhite students. See maj. op. at 10046 n.49. However, without the integration tiebreaker, the Plan would have operated to prevent students of color who lived in the south end of Seattle from attending those schools because of the schools' distance from south-end neighborhoods. The tiebreaker furthered the District's goal of giving south-end students of color the opportunity to opt out of attending the more racially concentrated schools in their neighborhoods, if they so desired.\n\nCertainly, the integration tiebreaker does not attempt to achieve perfect adherence to the District-wide ratios in each of the District's high schools. Except by encouraging an opt-out, the tiebreaker does not directly alter the racial make-up of schools that are not oversubscribed, even that of the southend schools that diverge widely from District-wide proportions. See supra note 13. I do not, however, view the Plan's underinclusiveness as a fatal flaw.\n\nIndeed, I find it peculiar that the majority's rebuttal makes so much of the failure of the District's Plan to achieve perfect racial balance. To be sure, in strict scrutiny review, especially in the First Amendment context, a law's underinclusiveness can be a sign that the enacting authority was not in fact motivated by its stated objectives. See Republican Party of Minn. v. White, 536 U.S. 765, 780 (2002) (noting that underinclusiveness impairs the credibility of the government's rationale for restricting speech) (citing City of Ladue v. Gilleo, 512 U.S. 43, 52-53 (1994)). Apparently, in order for the majority to find that a race-conscious means is necessary to achieve the District's stated goals, the means would have to produce perfect adherence to the District's racial make-up-which, in Seattle's circumstances, only aggressive districting, forced busing, and more intrusive racial classifications could do. However, requiring that the chosen means achieve perfect balance would make strict scrutiny impossible to satisfy, because the burden caused by the Plan-the third element of the narrow-tailoring inquiry-would be enormous. That is why, in contexts more relevant to this case, such as employment, courts have found that the modesty-i.e., the underinclusiveness-of government action is a point in favor of a conclusion that the action was narrowly tailored. See, e.g., Cotter v. City of Boston, 323 F.3d 160, 171 (1st Cir.) (\"The necessity for relief was great, but the means chosen by the Department were modest-only three African-American officers were promoted out of rank-indicating narrow tailoring.\"), cert. denied, 124 S. Ct. 179 (2003).\n\nBecause strict scrutiny is not meant to be \"fatal in fact,\" Grutter, 539 U.S. at 326, I would hold that the District's modest measures, which were enacted to decrease the intrusiveness and burden of its assignment policy, do not cause its Plan to become unnecessary or the District's motivations to become suspect. And, the Plan furthers the District's goals better than any workable race-neutral alternative.\n\n(ii) Race-neutral alternatives\n\nIn Grutter, the Court explained that narrow tailoring \"require[s] serious, good faith consideration of workable race-neutral alternatives that will achieve the diversity the university seeks.\" 539 U.S. at 339 (emphasis added). On the other hand, \"[n]arrow tailoring does not require exhaustion of every conceivable race-neutral alternative.\"\u003cspan class=\"fnref\"\u003e91\u003c/span\u003e Id. Furthermore, the Court made clear that the university was not required to adopt race-neutral measures that would have forced it to sacrifice other educational values central to its mission. Id. at 340. Implicit in the Court's analysis was a measure of deference toward the university's identification of those values. See id. at 328, 340 (affording deference to the university's judgment that diversity and \"academic selectivity\" were important to its educational mission). By affording deference to the university's identification of its core educational values in this context, the Court simply recognized that whether a race-neutral measure is truly an alternative in the first place depends on whether that measure is consistent with an institution's core values.\n\nThe majority faults the District for failing to consider seriously three specific race-neutral measures. Maj. op. at 10020-31. One of the majority's suggestions-that the District measure and assign students according to their \"true diversity,\" maj. op. at 10021-25-cannot properly be considered an \"alternative,\" because it is not directed toward achieving the District's interest in a racially integrated learning environment. See supra pp. 10077-78. Furthermore, it is clear from the record that the school board has discussed the use of other diversity measures, including poverty, as a tiebreaker. Although the majority correctly points out that there has been no formal study of that proposal by District staff, Board members' testimony reveals two legitimate reasons why the majority of the Board rejected the use of poverty measures to reach its goal of racial diversity: one, it is insulting to minorities and often inaccurate to assume that the two populations are coextensive; and, two, implementation would be thwarted by high school students' reluctance to reveal their socioeconomic status to their peers.\n\nThe majority also asserts that the District should have considered more formally a proposal developed by the Urban League (which, incidentally, did not eliminate the integration tiebreaker, but merely demoted it). Maj. op. at 10026-31. The majority quotes at length from the colorful and often emotional testimony of one Board member, who clearly was not impressed by the proposal. But there was other testimony from other Board members suggesting that the Board was aware of, and informally considered, the Urban League's proposal. Board member Schaad-Lamphere testified that she remembers reading the Urban League's plan and considered it to be similar to other regional assignment plans being proposed at the same time; she testified that she weighed it as she did other community input. Furthermore, the testimony of Board member Nielsen is consistent with Superintendent Olchefske's understanding that regional plans, including the Urban League's, had been disfavored by the Board because of the high value the District placed on choice among the different academic offerings at the various high schools. In other words, when all the testimony in the record is examined, it is clear that the Urban League's plan was in fact considered and that it was rejected for legitimate educational reasons.\u003cspan class=\"fnref\"\u003e92\u003c/span\u003e\n\nThe majority concludes that such informal consideration is inadequate and that we should evaluate the District's consideration of race-neutral alternatives using the same rigorous evidentiary standard that we use to evaluate whether a local government has proved that past discrimination justified its enactment of a remedial minority set-aside program. Maj. op. at 10025 (citing cases that elucidate the latter standard). To the contrary, our cases on set-aside programs plainly employ different standards to these different analyses-with a more permissive view toward the analysis of race-neutral alternatives. Compare Coral Constr. Co. v. King County, 941 F.2d 910, 916-22 (9th Cir. 1991) (discussing, within its \"compelling government interest\" analysis, the high burden of demonstrating actual discrimination by the county), with id. at 923 (noting, under the race-neutral alternatives prong of the narrow-tailoring analysis, that \"some degree of practicality is subsumed in the exhaustion requirement\" and that exhaustion of every possible alternative is not required); see also Associated Gen. Contractors of Cal., Inc. v. Coalition for Econ. Equity, 950 F.2d 1401, 1416-17 (9th Cir. 1991) (citing Coral). Under the relevant standard, the District adequately considered the alternatives.\n\nFinally, the majority would require the District to \"earnestly appraise[ ]\" a random, citywide lottery for high school assignments. Maj. op. at 10020 (emphasis omitted). In view of the District's clear commitment to educational choice among high schools, and in view of its desire to provide students with an opportunity to attend school closer to home, the majority's suggestion flatly contradicts the Grutter Court's approach to narrow tailoring:\n\nThe District Court took the Law School to task for failing to consider race-neutral alternatives such as \"using a lottery system\" . . . . But [this] alternative[ ] would require a dramatic sacrifice of diversity, the academic quality of all admitted students, or both.\n\n. . . We are satisfied that the Law School adequately considered race-neutral alternatives currently capable of producing a critical mass without forcing the Law School to abandon the academic selectivity that is the cornerstone of its educational mission.\n\n539 U.S. at 340. The university, in other words, was not required to \"earnestly appraise[ ],\" maj. op. at 10020 (emphasis omitted), a lottery system. The majority is incorrect in its conclusion that the District must do so, despite the harm that a lottery would do to the goals of choice and parental involvement that lie at the heart of its educational mission.\u003cspan class=\"fnref\"\u003e93\u003c/span\u003e\n\nIt is a closer question whether the District's goals could be met by using a pure lottery tiebreaker-that is, a lottery to determine which of the students who had chosen a particular school would be enrolled there. This format would allow the District to retain its emphasis on choice and would cause unhappiness more randomly. However, as Superintendent Olchefske explained, District patterns suggested that more people would choose schools close to home, thus raising the justifiable concern that the pool of students choosing a particular school would be skewed in favor of the demographic of the surrounding residential area. Indeed, when the District adopted the Plan, it could not predict exactly how much harm open choice would do to the racial diversity of its schools. A lottery, in the face of this uncertainty, would have left the District without a safety net for its diversity goals and, moreover, would have prevented the District from furthering the policy goals reflected in its sibling and proximity tiebreakers.\n\nOver the long history of its efforts to achieve integrated schools, the District has experimented with many alternatives, including magnet and other special-interest programs, which it continues to employ, and race-conscious districting.\u003cspan class=\"fnref\"\u003e94\u003c/span\u003e But when a racially integrated school system is the goal (or racial isolation is the problem), there is no more effective means than a consideration of race to achieve a solution. Even Plaintiff's expert conceded that, \"if you don't consider race, it may not be possible to offer an integrated option to students. . . . [I]f you want to guarantee it you have to consider race.\" As Superintendent Olchefske stated, \"when diversity, meaning racial diversity, is part of the educational environment we wanted to create, I think our view was you took that issue head on and used-you used race as part of the structures you developed.\" The logic of this point is sound: When race is a principal element of the government's compelling interest, then race-neutral alternatives seldom will be equally efficient. Cf. Hunter v. Regents of Univ. of Cal., 190 F.3d 1061, 1066 (9th Cir. 1999) (upholding, as narrowly tailored, a research elementary school's admissions policy that explicitly considered race in pursuit of a racially balanced research sample). Of course, race-conscious remedies still must be proportional to the government's interest.\n\n(b) The Plan satisfies requirements of proportionality, flexibility, and limited duration.\n\nThe District's plan is proportional to its interests and is sufficiently flexible and time-limited to meet the requirements of narrow tailoring.\n\n(i) Proportionality\n\nTo determine whether the means adopted are proportional to the government's interest, courts have considered the \"relationship between the numerical relief ordered and the percentage of nonwhites in the relevant [school population].\" Paradise, 480 U.S. at 179; see Tuttle v. Arlington County Sch. Bd., 195 F. 3d 698, 706 (4th Cir. 1999) (per curiam) (applying Paradise's proportionality analysis to K-12 student assignment plans); Comfort, 283 F. Supp. 2d at 372 (same); see also Brewer, 212 F.3d at 756-57 (Miner, C.J., dissenting) (same).\n\nThe principal question here is whether linking the integration tiebreaker to the racial demographic of the District's population-rather than, for instance, that of the city of Seattle-overshoots the District's goals. Specifically, Plaintiff suggests that, even when they are considered \"out of balance\" by the District (i.e., when they deviate from the 60/40 ratio by more than 15 percent and thus enroll less than 45 percent or more than 75 percent nonwhite students), Seattle's oversubscribed schools are sufficiently racially diverse to achieve the District's goals.\n\nI disagree that the District's means significantly overshoot its goals. First, the District is trying to teach its students to be effective participants in the racially diverse environment in which they exist. Superintendent Olchefske noted that Seattle's school-age demographic is significantly more racially diverse than the demographic for its population as a whole. (\"There [are] a lot of elderly white people in this town,\" he noted.) And he stated that the District has no regular access to data on the racial make-up of Seattle's private school students.\n\nSecond, even if the racial mix at some of the oversubscribed high schools would be sufficiently diverse for the District to achieve its goals\u003cspan class=\"fnref\"\u003e95\u003c/span\u003e in those schools without the integration tiebreaker, this fact would not account for the effect of the integration tiebreaker on the overall school system. A clear objective of the School Board was that \"no child should be required to attend a racially concentrated school.\" Removing the integration tiebreaker would mean that non-white students living in the southern area of the city, where neighborhoods and schools are more racially concentrated, would not have an opportunity for access to the more diverse schools in the northern part of the city, simply because of where they live. Giving them this access furthers the District's diversity goals.\n\nFurthermore, the fact that a particular oversubscribed high school would draw a sufficiently diverse population in a given year without the integration tiebreaker does not guarantee that it would continue to do so. As I discussed above, open choice puts school assignment in the hands of the students; a tiebreaker tied to the District's racial demographic is a natural way for the District to retain a safety net.\n\n(ii) Flexibility\n\nThe District also has shown that its Plan is flexible in the short term and that its approach has been flexible over the long term. The District no longer forces white students south, nor nonwhite students north. For this reason, racial concentration has increased in some schools. But the District's response has been measured. Responsive to community concerns and its own educational goals, the District has abandoned its complicated and mandatory systems for integrating its schools. Instead, it has developed a system that gives south-end non-white students an opportunity to leave racially concentrated schools (if they wish to) and promotes integrated schools across the district, while preserving the choice that it considers so critical to parental involvement. Mandatory assignments are kept to a minimum,\u003cspan class=\"fnref\"\u003e96\u003c/span\u003e and waivers are permitted for various reasons. The District's consistent movement from coercive to voluntary integration measures lends credence to its argument that it is working, through improvements to its programs, to reduce or eliminate oversubscription and therefore to reduce its reliance on the integration tiebreaker.\n\nFurthermore, the Plan is not inflexible in the manner of a quota; the integration tiebreaker operates only when patterns of individual choice result in oversubscription, and only until the school approximates the characteristics of the district as a whole. Choice, not a prescribed ratio of white to nonwhite students, controls the overwhelming majority of assignments. And choice patterns have been shown to change over time, as new facilities and programs are offered at different schools.\n\nThe District has demonstrated its ability to be responsive to these choice patterns and to the concerns of its constituents. It revisits the plan annually.\u003cspan class=\"fnref\"\u003e97\u003c/span\u003e In 2000, when a higher than normal number of students selected the same schools, the Board responded by increasing the integration trigger from a 10 percent to a 15 percent deviation from the school population and adopting a \"thermostat\" that turns off the integration tiebreaker as soon as the school has come into balance. The majority considers it constitutionally significant that the Board rejected a staff suggestion that the trigger instead be increased to 20 percent. Board members testified that they rejected a 20 percent trigger, in effect, because it would fail to assist students in moving from racially concentrated southend schools. In other words, the proposed 20 percent trigger would no longer promote the Board's goals; it therefore could not be considered narrowly tailored to achieve the District's compelling interest because it would not achieve that interest at all. The Board's decision thus is not a sign that the Board has failed, as the majority suggests, to \"minimize [the] adverse impact on third parties,\" maj. op. at 10031.\n\n(c) Relative burden on third parties.\n\nThe majority assumes that every student who is denied his or her choice of schools because of the integration tiebreaker suffers a constitutionally significant burden. As I foreshadowed above, however, I consider the District's Plan to impose a minimal burden that is shared equally by all of the District's students. See Parents Involved, 72 P.3d at 159-60 (noting that the burden of not being allowed to attend one's preferred school is shared by all students equally).\n\nWhen we view the Plan on the large scale, without attempting to anticipate students' subjective and shifting preferences for different schools, all the District's students are equally subject to the possible burden of being denied their first choices. Only when we conceive of the Plan narrowly, by imagining two students-one white, one nonwhite-who are next door neighbors and have identical preferences for Ballard or for Franklin high school, will one student bear a \"burden\" and the other gain a \"benefit.\"\n\nYet it is well established that \"there [is] no right under Washington law to attend a local school or the school of the student's choice.\" Id. at 159.\u003cspan class=\"fnref\"\u003e98\u003c/span\u003e Of course, students and their parents will nonetheless prefer some schools over others; their preferences may be based on their perceptions of a school's academic quality, on their subjective preference for a particular educational theme or program, or on the convenience of attending a particular school, among other things. These preferences result in changing choice patterns and the oversubscription of certain high schools. But oversubscribed schools do not become a limited government resource because of their popularity in a given year or their convenience for a given family. See Hampton, 102 F. Supp. 2d at 380 n.43 (\"The Court understands that students and their parents might prefer one school over another. The preference may even arise from a perception that one school is better than others due to its location, its teachers and principal, or its classroom environment. However, these matters of personal preference do not distinguish those schools in a constitutionally significant sense.\"); see also supra note 24. Despite any differences in academic quality (or perceptions thereof), all students who enroll in a Seattle high school will receive a high school education that meets state standards. And, as the District points out, even if Plaintiff's assertions of objectively unequal school quality were accepted,\u003cspan class=\"fnref\"\u003e99\u003c/span\u003e it is undisputed that the integration tiebreaker operates to give every student an opportunity to attend at least one of five oversubscribed \"quality\" high schools (because at least one is \"integration positive\" for both white and nonwhite students). I do not believe that students' subjective preferences for one school over another, where the existence and educational relevance of objective differences among them is disputed, make the inconvenience of a nonpreferred assignment weightier than the District's legitimate educational goals.\n\nFinally, the District has minimized any burden by working to ameliorate the inconvenience and frustration for families who do not receive their preferred school assignments. When the popularity of the District's five oversubscribed schools spiked for 2000-01 assignments, the School Board met to consider ways to soften the adverse effects. The administration immediately began to \"aggressively move the waitlists\" and to attempt to increase capacity at the oversubscribed schools. The Board and the administration discussed specific, long-range plans to increase the attractiveness of the undersubscribed schools. Finally, the District reached out to students receiving assignments to undersubscribed schools to share with them advantages of the schools of which they may not have been aware.\n\nIII. Conclusion.\n\nFor all these reasons, the Plan adopted by the Seattle School District for high school assignments is constitutional notwithstanding its inclusion of an integration tiebreaker. I would affirm the district court's judgment, and I dissent from the majority's contrary holding.\n\n\u003cspan class=\"fn\"\u003e1. The Honorable Thomas M. Reavley, Senior United States Circuit Judge for the Fifth Circuit, sitting by designation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. For instance, year 2000 data indicates that the average combined score on the Scholastic Achievement Tests (SATs) at Garfield was 1208-some 154 points above the state average-while at Cleveland it was 838, some 216 points below the state average. Similarly, while just one-quarter of students at Roosevelt scored below the 25th percentile on the Iowa Tests of Educational Development, more than three-quarters of Rainier Beach students scored below the 25th percentile.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. For instance, Ballard High School offers a unique \"Biotech Academy.\" Ballard describes its Biotech program as \"[a] specialized learning program that brings together science, mathematics and language arts to prepare students for advanced study and a career in science.\" Ballard Biotech Academy Website \u003chttp://ballard.seattleschools.org/academics/academies/ biotech.html\u003e (visited Mar. 24, 2004). The program has its own separate admissions procedure with required prerequisite classes. Admission to the program does not, however, guarantee admission to Ballard-which is governed by the School District's open enrollment plan.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. For graphic representations of the racial and ethnic dispersion within Seattle's population, interested readers may wish to consult the various thematic maps derived from year 2000 U.S. Census data and made available by the City of Seattle at: \u003chttp://www.cityofseattle.net/DCLU/ demographics/data_census.asp\u003e (visited March 29, 2004). They indicate that census tracts north of Seattle's downtown and those along the City's waterfronts tend to be predominantly white, while those south of downtown (and particularly in the City's southeast quadrant) tend to reflect more substantial non-white populations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Seattle's student population is approximately 40 percent white and 60 percent non-white. Splitting Seattle along a north-south axis, data introduced by the School District indicates that 74.2 percent of the District's Asian students, 83.6 percent of its black students, 65.0 percent of its Hispanic students, and 51.1 percent of its Native American students live in the southern half of the city. By contrast, 66.8 percent of the District's white student population lives in the northern half of the city. Overall, approximately 77.2 percent of students in the southern half of the city, and just 35.7 percent of students in the northern half of the city, are non-white.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Oversubscription was apparently not tied to geographic location. The oversubscribed schools included three high schools north of downtown (Ballard, Nathan Hale, and Roosevelt) and two high schools south of downtown (Garfield and Franklin). The undersubscribed schools included one north of downtown (Ingraham), three south of downtown (Chief Sealth, Cleveland, and Rainier Beach), and one west of downtown (West Seattle).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. During the 2000-01 school year, the acceptable deviation (called \"the band\") was fixed at +/- 10 percent. Thus, if an oversubscribed school had fewer than 31 percent or more than 51 percent white students, the tiebreaker would operate. Between the 2000-01 and 2001-02 school years-while this litigation was pending-the school board expanded the band to +/- 15 percent, meaning that the tiebreaker would operate only if an oversubscribed school had fewer than 26 percent or more than 56 percent white students. During the 2000-01 school year, four of the city's five oversubscribed schools were considered integration positive and therefore employed the tiebreaker: Ballard, Franklin, Nathan Hale, and Roosevelt. With the expansion of the band to +/- 15 percent prior to the 2001-02 school year, the tiebreaker ceased to operate at Roosevelt. Two further changes were made to the program prior to the 2001-02 school year. First, a so-called \"thermostat\" was added to the plan: The School District would cease to use the racial tiebreaker for the year at any school once its use had brought the school into racial balance. Second, the integration tiebreaker would be used only in determining the makeup of entering ninth grade classes, but would not be applied to assignments involving the limited number of students seeking to transfer high schools before the tenth, eleventh, or twelfth grades.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Of course, this also means that at Franklin, non-whites are denied admission because they are not white; and at Ballard, whites are denied admission because they are white.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Wash. Rev. Code § 49.60.400 (\"The state shall not discriminate against, or grant preferential treatment to, any individual or group on the basis of race, sex, color, ethnicity, or national origin in the operation of public employment, public education, or public contracting.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. U.S. Const. amend. XIV, § 1 (\"No state shall . . . deny to any person within its jurisdiction the equal protection of the laws.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. 42 U.S.C. § 2000d (\"No person in the United States shall, on the ground of race, color, or national origin, be excluded from participation in, be denied the benefits of, or be subjected to discrimination under any program or activity receiving Federal financial assistance.\"). Title VI has long been held to be essentially co-extensive with the guarantees of the Equal Protection Clause of the Fourteenth Amendment and the equal protection component of the Fifth Amendment. See Regents of Univ. of Cal. v. Bakke, 438 U.S. 265, 287 (1978) (Powell, J., concurring) (\"Title VI must be held to proscribe only those racial classifications that would violate the Equal Protection Clause or the Fifth Amendment.\"); id. at 329 (\"Title VI prohibits only those uses of racial criteria that would violate the Fourteenth Amendment if employed by a State or its agencies. . . .\") (Brennan, White, Marshall, and Blackmun, JJ., concurring in part); see also Alexander v. Sandoval, 532 U.S. 275, 280-81 (2001).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Specially concurring in the court's decision, Judge Graber likewise divined that \"the racial tiebreaker that Seattle School District No. 1 uses to assign some public high school students to desirable schools plainly 'grants preferential treatment' to those students on the basis of their race, in violation of Initiative 200.\" Parents II, 285 F.3d at 1253 (Graber, J., specially concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See Deborah Bach, New School Board Must Work Together, Observers Say, Seattle Post-Intelligencer, Nov. 6, 2003, at B1; David Postman, Incumbents Hammered: 3 on Seattle School Board Out; 3 on Council Headed There, Seattle Times, Nov. 5, 2003, at A1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. We note further that the School District's 2004-05 secondary education \"Enrollment Guide\" continues to describe the operation of the racial tiebreaker as part of its open choice assignment program, explaining that \"The integration positive tiebreaker has been suspended for the 2004-2005 assignment period due to the pendency of a lawsuit challenging its use.\" See Seattle Public Schools, Middle and High School Choices 2004-2005: Enrollment Guide for Parents 44, available at http:// www.seattleschools.org/area/eso/secondary_guide_04_05.pdf (last visited June 8, 2004) (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Because \"discrimination that violates the Equal Protection Clause of the Fourteenth Amendment committed by an institution that accepts federal funds also constitutes a violation of Title VI,\" we address Parents's twin challenges to the racial tiebreaker simultaneously. See Gratz, 539 U.S. at 276 n.23. As with any grant or denial of summary judgment, the district court's resolution of cross-motions for summary judgment is reviewed de novo. United States v. City of Tacoma, 332 F.3d 574, 578 (9th Cir. 2003). Because \"[n]either side contends that there are any genuine issues of material fact. . . , our task is to determine whether the district court correctly applied the relevant substantive law.\" Ar v. Hawaii, 314 F.3d 1091, 1094 (9th Cir. 2002). Such purely legal determinations are, of course, subject to de novo review on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See, e.g., Freeman v. Pitts, 503 U.S. 467, 494 (1992) (\"Racial balance is not to be achieved for its own sake. It is to be pursued when racial imbalance has been caused by a constitutional violation.\"); Metro Broad., Inc. v. FCC, 497 U.S. 547, 612 (1990) (\"Under the appropriate standard, strict scrutiny, only a compelling interest may support the Government's use of racial classifications. Modern equal protection doctrine has recognized only one such interest: remedying the effects of racial discrimination.\") (O'Connor, J., joined by Rehnquist, C.J., Scalia and Kennedy, JJ., dissenting); Richmond v. J.A. Croson Co., 488 U.S. 469, 493 (1989) (O'Connor, J., joined by Rehnquist, C.J., and White and Kennedy, JJ.) (\"Classifications based on race carry a danger of stigmatic harm. Unless they are strictly reserved for remedial settings, they may in fact promote notions of racial inferiority and lead to a politics of racial hostility.\"); id. at 524 (Scalia, J., concurring) (\"[T]here is only one circumstance in which the States may act by race to 'undo the effects of past discrimination': where that is necessary to eliminate their own maintenance of a system of unlawful racial classification.\") (emphasis in original); Fullilove v. Klutznick, 448 U.S. 448, 489 (1980) (Burger, C.J., joined by White and Powell, JJ.) (\"That the use of racial and ethnic criteria is premised on assumptions rebuttable in the administrative process gives reasonable assurance that application of the [contracting set-aside] program will be limited to accomplishing the remedial objectives contemplated by Congress . . . .\"); id. at 530 (Stewart, J., joined by Rehnquist, J., dissenting) (\"Since the [setaside] provision was in whole or in part designed to effectuate objectives other than the elimination of the effects of racial discrimination, it cannot stand as a remedy that comports with the strictures of equal protection, even if it otherwise could.\"); Ho, 147 F.3d at 864 (\"[T]he Supreme Court has not banished race altogether from our governmental systems. The concept, so long the instrument of governmental evil, so fraudulently promoted by pseudo-science, so corrosive of the rights of the person, may still be employed if its use is found to be necessary as the way of repairing injuries inflicted on persons because of race. Deployed for that limited purpose. . . .\"); Monterey Mech., 125 F.3d at 713 (\"For a racial classification to survive strict scrutiny in the context before us, it must be a narrowly tailored remedy for past discrimination, active or passive, by the governmental entity making the classification.\"); Coral Constr. Co. v. King County, 941 F.2d 910, 920 (9th Cir. 1991) (\"Race-based classifications must be reserved strictly for remedial settings.\"); see also Hopwood v. State of Texas, 78 F.3d 932, 944 (5th Cir. 1996); Contractors Ass'n v. City of Phila., 91 F.3d 586, 596 (3d Cir. 1996); Aiken v. City of Memphis, 37 F.3d 1155, 1162-63 (6th Cir. 1994); In re Birmingham Reverse Discrimination Employment Litig., 20 F.3d 1525, 1544 (11th Cir. 1994); O'Donnell Constr. Co. v. District of Columbia, 963 F.2d 420, 424 (D.C. Cir. 1992); Podberesky v. Kirwan, 956 F.2d 52, 56 (4th Cir. 1992) (en banc); Cunico v. Pueblo Sch. Dist. No. 60, 917 F.2d 431, 437 (10th Cir. 1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. But cf. Metro Broad., 497 U.S. at 612-13 (O'Connor, J., dissenting) (condemning the majority's decision to apply intermediate scrutiny to racial classifications on grounds that doing so \"too casually extends the justifications that might support racial classifications, beyond that of remedying past discrimination\"); cf. also Croson, 488 U.S. at 493 (plurality op. by O'Connor, J.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See, e.g., Grutter, 539 U.S. at 322 (\"We granted certiorari to resolve . . . [w]hether diversity is a compelling interest that can justify the narrowly tailored use of race in selecting applicants for admission to public universities.\") (citation omitted); id. at 325 (\"[T]oday we endorse Justice Powell's view that student body diversity is a compelling state interest that can justify the use of race in university admissions.\"); id. at 331 (\"[T]he diffusion of knowledge and opportunity through public institutions of higher education must be accessible to all . . . .\"); id. at 331-32 (\"[E]nsuring that public institutions are open and available to all segments of American society, including people of all races and ethnicities, represents a paramount government objective. [N]owhere is the importance of such openness more acute than in the context of higher education.\") (quoting Brief of the United States); id. at 332 (\"[U]niversities, and in particular, law schools, represent the training ground for a large number of our Nation's leaders.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. We express no opinion on the extent to which the diversity rationale extends beyond the secondary educational context. Cf. Petit v. City of Chicago, 352 F.3d 1111 (7th Cir. 2004) (addressing the diversity rationale in the context of race-conscious promotions within a police department).\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. For present purposes, we focus on the University's post-1998 admissions program rather than its more troubling predecessors. See Gratz v. Bollinger, 122 F. Supp. 2d 811, 831-33 (E.D. Mich. 2000) (describing the myriad constitutional defects of the 1995-98 program).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In actuality, LSA's mechanical award of 20 points may have been worth more than one-fifth of the points necessary to secure admission. In 1999, LSA also established a discretionary review process in which individual applications would be given special additional consideration from the Admissions Review Committee (ARC) if the applicant met a threshold selection index score (80 points for Michigan residents, 75 points for out-of-state residents) and was selected by an admissions officer. Id. at 256-57 \u0026 n.8. If chosen, ARC would consider whether the applicant \"possesses a quality or characteristic important to the University's composition of its freshman class\"-including race and ethnicity-and could then choose to admit such students outside the strictures of the normal selection index grid. Id. Thus, under LSA's plan, membership in an underrepresented racial group would secure an applicant at least one-fifth of the points necessary to ensure admission, as well as one-quarter of the points necessary for an individualized review that, by facilitating the double-counting of race, could lead to admission.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Of some note, Justice O'Connor's concurrence (joined by Justice Breyer) highlighted key distinctions between the Law School and undergraduate programs: The law school considers the various diversity qualifications of each applicant, including race, on a case-by-case basis. By contrast, the Office of Undergraduate Admissions relies on the selection index to assign every underrepresented minority applicant the same, automatic 20-point bonus without consideration of the particular background, experiences, or qualities of each individual applicant. And this mechanized selection index score, by and large, automatically determines the admissions decision for each applicant. The selection index thus precludes admissions counselors from conducting the type of individualized consideration the Court's opinion in Grutter requires: consideration of each applicant's individualized qualifications, including the contribution each individual's race or ethnic identity will make to the diversity of the student body, taking into account diversity within and among all racial and ethnic groups. Gratz, 539 U.S. at 276-77 (O'Connor, J., concurring, joined by Breyer, J.) (emphases in original).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Although we admire the School District's use of a \"thermostat\" designed to curtail the deleterious impact of its racial tiebreaker once the requisite racial proportion is attained in a given school, the fact that it turns the tiebreaker on and off with such numerical precision ultimately helps confirm that the School District's aim is simple proportional representation by race. Cf. Eisenberg, 197 F.3d at 132 (\"The fact that the . . . diversity profile for each school is reviewed and adjusted each year to avoid the facilitation and the creation of a racially isolated environment does not make the policy narrowly tailored. Instead, it manifests Montgomery County's attempt to regulate transfer spots to achieve the racial balance or makeup that most closely reflects the percentage of the various races in the county's public school population.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Indeed, when asked whether the District gave \"any serious consideration to the adoption of a plan for the assignment of high school students that did not use racial balancing as a factor or goal,\" Superintendent Olchefske responded: \"I think the general answer to your question is no. . . . I mean it's possible informal ideas were floated here or there, but I don't remember any significant staff work being done.\" When asked whether he could \"ever recall the board considering any race neutral plans,\" John Vacchiery (who heads the District's Facilities, Planning, and Enrollment Department) answered simply \"No.\" And responding to inquiries regarding the possibility of using a \"system kind of similar to the one you have now but without race as a tiebreaker,\" Board member Don Nielsen replied that \"It's never been considered.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. As the Court explained: The Law School[ ] . . . considers race as one factor among many, in an effort to assemble a student body that is diverse in ways broader than race. Because a lottery would make that kind of nuanced judgment impossible, it would effectively sacrifice all other educational values, not to mention every other kind of diversity. Grutter, 539 U.S. at 340.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. In particular, the School District's data expert, Morgan Lewis, testified that although Board member Don Nielsen once suggested instituting an income-based tiebreaker, \"[t]hat particular proposal never went anywhere, in terms of assessing how you would implement it\" and that School District staff was never asked to (and so never did) examine the effect that such a tiebreaker would have on the demographic composition of the District's high schools.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Even beyond this evidentiary inadequacy, we observe that the individual Board members' post-hoc litigation rationales for the Board's allegedly having \"rejected\" the use of broader diversity considerations do not withstand even limited scrutiny. Whether it is \"often inaccurate\" to assume that poverty and race are \"coextensive\" and \"insulting to minorities\" to suggest they may be, see post at 10090, it is beyond dispute that despite remarkable racial progress during the past century, see generally Stephan and Abigail Thernstrom, America in Black and White (1997), race and socioeconomic status remain correlated, so that the latter might serve as a workable race-neutral alternative satisfying the District's interest in obtaining the benefits of enrolling an otherwise diverse student population. (Of course, we can only determine whether it would do so if the School District would evaluate it.) Likewise, it is beyond dispute that any insult generated by recognizing the opportunity presented by this sad reality pales in comparison to the insult of rejecting an applicant solely because of the color of her skin (whether they are white or minority-as in this case, see supra at 9994-95 \u0026 n.7). Finally, we find unsupportable the individual Board members' suggestion that socioeconomic integration would not result in appreciable socialization advantages because \"implementation would be thwarted by high school students' reluctance to reveal their socioeconomic status to their peers.\" Post at 10090. For if the theory underpinning integrated schooling is (quite accurately) that it will foster cross-bounded friendships, it is inevitable that students of varying backgrounds will not only interact in the classroom, but outside it-where exposure to their peers' varying communities, families, and lifestyles will almost certainly reveal their divergent socioeconomic experiences.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. As their report put the point, \"With quality high schools throughout the city, assignment issues will disappear.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Of note, the report also concluded by discussing four additional alternatives that it ultimately declined to propose to the Board-but nonetheless deemed worthy of consideration.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Our nation's public schools, especially those in central cities, currently face a crisis of epic proportions. Although black and Latino students made substantial educational gains following the demise of legalized governmental segregation, the best data on educational attainment demonstrates that no further progress has been made in the past fifteen years-and indeed that the gap between white and Asian students' educational achievement and that of blacks and Latinos has actually expanded on some measures during that period. See Stephan Thernstrom \u0026 Abigail Thernstrom, No Excuses: Closing the Racial Gap in Learning 18-21 (2003); see also John E. Chubb and Tom Loveless, eds., Bridging the Achievement Gap 1-2 (2002); David Grissmer, Ann Flanagan, and Stephanie Williamson, Why Did the Black-White Test Score Gap Narrow in the 1970s and 1980s?, in Christopher Jencks \u0026 Meredith Phillips, eds., The Black-White Test Score Gap 185-91 (1998). As the Thernstroms poignantly observe: Racial progress on many fronts has been enormously heartening. But in a society committed to equal opportunity, we still have a racially identifiable group of educational have-nots-young African-Americans and Latinos whose opportunities in life will almost inevitably be limited by their inadequate education. . . . [Such] [o]ngoing racial inequality is not only morally unacceptable; it corrupts the fabric of American society and endangers our future. Id. at 271-72.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Indeed, Olchefske also recommended expanding the band in 1999.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The dissent suggests that even though schools \"may well have been sufficiently diverse to promote interaction across the white/nonwhite axis and to prevent the tokenization of nonwhite students\" had the District used a 20 percent band (or, in something of a surprising concession, had it used no integration tiebreaker at all), see post at 10087 \u0026 10095, the District's selection of a 15 percent band was appropriate because it would facilitate greater movement of students between the south end of the District and the north. Id. Given Superintendent Olchefske's statement that the District's interests in the tiebreaker would not be served by setting the band at 15 percent instead of 20 percent, we find it hard to credit the assertion that those interests must have included such movement of students. In any event, we hardly think that non diversity-enhancing north-south integration is sufficiently compelling to justify the use of a racial classification.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The only narrow tailoring requirement the School District's racial tiebreaker even arguably satisfies is the final one-that the institutional use of race be time-limited. Addressing temporal limitations in Grutter, the Court explained that \"[i]n the context of higher education, the durational requirement can be met by sunset provisions in race-conscious admissions policies and periodic reviews to determine whether racial preferences are still necessary to achieve student body diversity.\" 539 U.S. at 342 (emphases added). Yet, notwithstanding the conjunctive nature of its stated requirements and in spite of the fact that Michigan's policy did not itself contain a sunset provision, the Court held the policy to be adequately limited after unhesitatingly crediting the University's pledge \"that it would like nothing better than to find a race-neutral admissions formula,\" id. (quotation omitted), and stating that \"We expect that 25 years from now, the use of racial preferences will no longer be necessary to further the interest approved today.\" Id. at 343. Whether that vague assertion represented a \"holding that racial discrimination in higher education admissions will be illegal in 25 years,\" id. at 351 (Thomas, J., dissenting), or merely a \"hope, but not [a] firm[ ] forecast, that over the next generation's span, progress . . . will make it safe to sunset affirmative action\" in accordance with the ever-powerful \"international understanding of the office of affirmative action,\" id. at 344 \u0026 346 (Ginsburg, J., concurring), we cannot say. But the School District's annual review of the racial tiebreaker and the at least theoretical availability of a judicially-enforceable end-point to the School District's racially discriminatory admissions program may well bring the policy into line with the durational limits required by strict scrutiny.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Of course, the School District makes this bold assertion only when pressed by the full gravity of the Court's pronouncements. Where otherwise convenient, the School District argues that \"the Michigan decisions do provide crucial guidance to this Court,\" and claims that beyond illuminating the contours of the compelling interest test, those decisions \"also provide considerable assistance in applying the narrow tailoring element of strict scrutiny.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. To its credit, the dissent declines to follow the School District's lead.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. We emphasize the District's over-reading of Associated General at the outset because-even beyond our express failure to address the issue joined here-it is not clear that Associated General implicitly suggested that reshuffle programs do not violate the Constitution. There is a world of difference between stating that \" 'stacked deck' programs trench on Fourteenth Amendment values in ways that 'reshuffle' programs do not,\" Associated General, 616 F.2d at 1387 (emphasis added), and holding that reshuffle programs designed to integrate schools cannot violate the Fourteenth Amendment at all.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. See also Shaw v. Hunt, 517 U.S. 899, 904-05 (1996); Miller, 515 U.S. at 904; Shaw v. Reno, 509 U.S. 630, 643 (1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Compare Miller v. Gammie, 335 F.3d 889, 902 (9th Cir. 2003) (en banc) (Tashima, J., concurring) (citing Best Life Assurance Co. v. Comm'r, 281 F.3d 828, 834 (9th Cir. 2002), for the proposition that \"dictum [i]s a statement made during the course of delivering a judicial opinion, but one that is unnecessary to the decision in the case and therefore not precedential.\") (citations and quotations omitted) with Miranda B. v. Kitzhaber, 328 F.3d 1181, 1186 (9th Cir. 2003) (per curiam) (\" '[W]here a panel confronts an issue germane to the eventual resolution of the case, and resolves it after reasoned consideration in a published opinion, that ruling becomes the law of the circuit, regardless of whether doing so is necessary in some strict logical sense.' \") (quoting United States v. Johnson, 256 F.3d 895, 914 (9th Cir. 2001) (Kozinski, J., concurring)) with United States v. Crawley, 837 F.2d 291, 292-93 (7th Cir. 1988) (Posner, J.) (suggesting that rather than define dicta, courts should look to the \"reasons there are against . . . giving weight to a passage found in a previous opinion[:] One is that the passage was unnecessary to the outcome of the earlier case and therefore perhaps not as fully considered as it would have been if it were essential . . . . A closely related reason is that the passage was not an integral part of the earlier opinion-it can be sloughed off without damaging the analytical structure of the opinion, and so it was a redundant part of that opinion . . . . Still another reason is that the passage was not grounded in the facts of the case and the judges may therefore have lacked an adequate experiential basis for it; another, that the issue addressed in the passage was not presented as an issue, hence was not refined by the fires of adversary presentation. All these are reasons for thinking that a particular passage was not a fully measured judicial pronouncement . . . .\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. In our intervening 24 years of jurisprudence addressing the use of race, we have referenced Associated General just once for the proposition that reshuffles are less suspect than stacked deck programs, and we did so only in discussing the interaction between a state ballot initiative and the Court's political structure doctrine, see Washington v. Seattle Sch. Dist. No. 1, 458 U.S. 457 (1982); Hunter v. Erickson, 393 U.S. 385 (1969), rather than in applying the narrow tailoring requirement of the Fourteenth Amendment to a particular race-based program. Coalition, 122 F.3d at 707 n.16. To the limited extent that Coalition's passing reference to school desegregation programs might bear on the Equal Protection inquiry at issue here, we note simply that-among other crucial differences-the desegregation program referred to in the Coalition footnote \"bas[ed] student assignments on attendance zones rather than on race,\" Seattle, 458 U.S. at 461, and thus would not even be necessarily subject to the tailoring analysis we must apply here (and to the use of all racial classifications). Adarand, 515 U.S. at 224; Croson, 488 U.S. 493-95.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. We recognize that more than 30 years ago the Court-in what is well recognized as dicta, see, e.g., Brewer v. W. Irondequoit Cent. Sch. Dist., 212 F.3d 738, 750 (2d Cir. 2000)-suggested that school districts may pursue a measure of racial balance independent of constitutional requirements to remedy past discrimination. Swann v. Charlotte-Mecklenburg Bd. of Educ., 402 U.S. 1, 16 (1971). In contrast to the dissent, which recognizes that \"these statements must be considered in the light of the Court's later decisions . . . establish[ing] that the government may not act in furtherance of racial balance without a compelling nonracial reason\" but then declines to so read those statements, we do not feel free to privilege a gratuitous statement over the Court's clear holdings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Although Associated General describes stacked deck programs as \"specifically favor[ing] members of minorities in the competition with members of the majority,\" 616 F.2d at 1386, it is beyond any serious dispute that such a distinction is utterly bereft of force in the post-Croson, post-Adarand world-where our focus is on the use of racial classifications per se, rather than upon the race of those who are benefitted or burdened by the operation of the classification. Grutter, 539 U.S. at 326; Gratz, 539 U.S. at 270; Adarand, 515 U.S. at 224; Croson, 488 U.S. 493-95; see also Shaw II, 517 U.S. at 904-05; Miller, 515 U.S. at 904; Shaw I, 509 U.S. at 643; Jed Rubenfeld, Affirmative Action, 107 Yale L.J. 427, 434 (\"The critical holding of Adarand was that all laws employing a racial classification must undergo strict scrutiny, with no exception made on the basis of allegedly benign intentions. The classification itself is the constitutionally suspect feature of the law, the feature that triggers heightened scrutiny, regardless of which race happens to be burdened, and regardless of the particular burdens imposed.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Indeed, the oversubscribed Seattle high schools to which children of the Parents members seek admittance are \"selective\" in precisely the same way as the University of Michigan: Due to the quality of the education they provide, the availability of special academic programs, and their location, more students than can be accommodated seek admission-and the District must therefore determine which applicants will be offered a coveted seat in a more desirable school. We simply disagree with the dissent's assertion, post at 10098, that school quality exists in some objective vacuum distinct from market assessment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. We further hold that the School District's racial tiebreaker violates Title VI. See Gratz, 539 U.S. at 275 \u0026 n.23.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. See generally Abigail Thernstrom, Where Did All the Order Go? School Discipline and the Law, in Diane Ravitch, ed., Brookings Papers on Education Policy: 1999, 299-314 (1999).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. We offer another basis for declining to defer to the District's pursuit of racial proportionality in seeking diversity's benefits, infra at 10046 n.49.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. See Marcel Proust, À la recherche du temps perdu [Remembrance of Things Past, or In Search of Lost Time] (1913-27).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. The same picture emerges from 2002-03 school year data contained in the School District's \"Individual School Profiles\" report, submitted as an appendix to the supplemental amicus brief of Pacific Legal Foundation et al.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Indeed, as one dissenting Board member noted in deposition testimony, \"What we've done is we've defined ourself [sic] a problem by lumping all minorities together . . . . [O]ne of the things that the [D]istrict still hasn't come to grips with is that minorities are quite different among and between themselves and sometimes have vast differences.\" It is in part for this reason that the history of racial conflict in this country is not one limited to tensions among whites and non-whites. See, e.g., Bill Ong Hing, In the Interest of Racial Harmony, 47 Stan. L. Rev. 901 (1995) (discussing tensions between the African-American and Asian communities). Interethnic tensions persist even within diverse high schools. See, e.g., Carl Campanile, Now It's a Federal Case, N.Y. Post, Aug. 23, 2001, at 2 (detailing a series of incidents at Brooklyn's Lafayette High School between African-American students and Asians); Elissa Gootman, City to Help Curb Harassment Of Asian Students at High School, N.Y. Times, June 2, 2004, at B9 (describing a recent consent decree designed to address these incidents, and noting the diversity of Lafayette's student population). Surely helping resolve these tensions is just as crucial to the District's mission as addressing tensions between whites and non-whites.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. While we do not mean to suggest that better-calibrated pure racial balancing would be constitutionally permissible, it bears note that the tiebreaker does not even operate to correct \"racial imbalance\" at the two schools where the white/non-white student ratio is most out of line with the District demographics (Rainier Beach and Cleveland). Supra at 9994-95 n.6; post at 10065 n.13. Taking the dissent on its own terms, it is thus that much harder to credit its claim that the tiebreaker is adequately designed to address the \"flip side\" of the District's interest-ensuring that \" '[n]o student . . . attend a racially concentrated school.' \" Post at 10065 (alteration in original); see also id. at 10095.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. We further note that these numbers show the District's high schools would enroll a proportion of underrepresented minority students already recognized by the Court as adequate to spur the internal educational benefits of diversity. This fact further counsels against deferring to the District's decision to use a racial classification here. Cf. Grutter, 539 U.S. at 320 (\"[A] race-blind admissions system would have a very dramatic, negative effect on underrepresented minority admissions. . . . [U]nderrepresented minority students would have comprised 4 percent of the entering class in 2000 instead of the actual figure of 14.5 percent.\") (quotation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Asked whether she was aware of any studies suggesting that the District's goals were better achieved by shifting enrollment proportions by \"three, four, or five percentage points,\" Board Member Schaad-Lamphere said she was not aware of any such evidence and that she \"ha[d] not used research to base [her] decisions on.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. It is not even clear that the tiebreaker itself is fully responsible for this trivial shuffling of students. The dissent, post at 10096 n.40, observes that among students who were denied admission to any school of their choice by operation of the tiebreaker, some 35 percent were assigned to the same school they would have been assigned to had the tiebreaker not operated. As a consequence, the numbers in Table 3 likely overestimate substantially the demographic impact of the tiebreaker—and thus cast further doubt over its usefulness. In turn, the fact that these changes are so marginal dovetails our holding that the District was obligated to seriously consider whether alternative arrangements could have met its goals. See supra at 10020-31. Raceneutral alternatives not only may have produced equivalent levels of diversity in the District's schools, but far greater diversity than the tiebreaker.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Likewise, while Latinos accounted for less than one-tenth of the students at these schools, and Native Americans less than one-twentieth of students, representational ranges for those student populations were, respectively, almost as large as the maximum effect and more than half the size of the maximum effect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. The point holds even using the dissent's preferred metric (ninth grade -rather than overall-enrollment changes): Individual inter-ethnic disparities either trump or rival overall white/non-white enrollment variances attributable to the tiebreaker's operation, and the schools continue to enroll widely diverse ninth grade classes-a point essentially conceded by the dissent. Post at 10087 \u0026 10095.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. The dissent's assertion that the constitutional requirement of holistic review does not apply in this context fails for the same reason. Grutter and its progenitors require that one's race be considered only as one among many factors not because \"holistic review . . . provides a closer fit with a university's interest in viewpoint diversity,\" post at 10076-77, but because any interest in race alone is unconstitutional: \"Outright racial balancing . . . is patently unconstitutional. . . . Racial balance is not to be achieved for its own sake.\" Grutter, 539 U.S. at 330 (quoting Freeman, 503 U.S. at 494, and citing Bakke, 438 U.S. at 307). Given such a clear-and oft-repeated-condemnation of the practice by the Supreme Court, it is hard seriously to credit the dissent's peculiar assertion that we misread the case law's per se ban on racial balancing. See post at 10075 n.22.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. Recall the undisputed fact that the gap in average SAT scores between students at Garfield and Cleveland is nearly 400 points. See supra at 9991 n.1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. See Erica Frankenberg et al., A Multiracial Society with Segregated Schools: Are We Losing the Dream? 4 (The Civil Rights Project, Harvard Univ. Jan. 2003), at http://www.civilrightsproject.harvard.edu/research/ reseg03/AreWeLosingtheDream.pdf., cited in Gratz v. Bollinger, 539 U.S. 244, 299 n.4 (2003) (Ginsburg, J., dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. I agree with the majority's conclusion that the case is not moot. Maj. op. at 9998-10001.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. In other words, strict scrutiny is a tool that we use to root out the improper prejudices and stereotypes that are the baseline concern of the Equal Protection Clause. See City of Richmond v. J.A. Croson Co., 488 U.S. 469, 493 (1989) (stating that the aim of strict scrutiny is to determine \"what classifications are in fact motivated by illegitimate notions of racial inferiority or simple racial politics\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. I agree with the majority that the rights afforded by Title VI are coextensive with those guaranteed by the Equal Protection Clause. Maj. op. at 9996 n.10, 10001 n.14. I therefore conclude that the Plan does not violate Title VI. See Grutter, 539 U.S. at 343 (concluding that the university's admissions policy did not violate Title VI).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. A map created by the District's planners shows a striking pattern: Between 70 and 100 percent of the students who live in the various elementary-school \"reference areas\" in the south and southeast areas of the city are nonwhite, compared with 20 to 50 percent in the northern half of the city.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. The Plan under consideration here involves only high school assignments. However, because the District adopted the high school assignment Plan as part of a process of redesigning its school assignment system for all grade levels, the District understood its interest in diversity to span the K-12 system. Accordingly, when I discuss the details of \"the Plan,\" I refer only to high school assignments; my discussion of the District's compelling governmental interests, however, encompasses the K-12 context as a whole.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. The Board explained that \"[d]iversity brings different viewpoints and experiences to classroom discussions and thereby enhances the educational process.\" Maj. op. at 10004. The District's expert noted that, in racially diverse schools, \"both white and minority students experienced improved critical thinking skills-the ability to both understand and challenge views which are different from their own.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. Comfort involved an elementary-school assignment plan, in which the school district allowed students to transfer from their assigned neighborhood schools only if the transfer would further the district's desegregation goals. 283 F. Supp. 2d at 347-48. I agree with the court's statement in Comfort that, \"[w]hile a high school's mission is surely more academic-oriented than that of the elementary schools, citizenship training is still part and parcel of the enterprise.\" Id. at 375 n.84.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. The District's expert explained the civic benefits of diverse schools this way: The research clearly and consistently shows that, for both white and minority students, a diverse educational experience results in improvement in race-relations, the reduction of prejudicial attitudes, and the achievement of a more democratic and inclusive experience for all citizens. More specifically, these benefits include more cross-race friendliness, reduction in prejudicial attitudes and increases in cross-race understanding of cultural differences. Recent research has identified the critical role of early school experiences in breaking down racial and cultural stereotypes. The research further shows that only a desegregated and diverse school can offer such opportunities and benefits. The research further supports the proposition that these benefits are long lasting. (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. The Supreme Court in Grutter also recognized the importance of higher education in \"preparing students for work and citizenship.\" 539 U.S. at 331. For the Court in Grutter, this point related less to the academic benefits of diversity and more to the Court's second rationale: ensuring open access to selective institutions of higher education in order to maintain their democratic legitimacy. See id. at 331-33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. Although it has not decided whether the state constitution requires integrated schools, the Supreme Court of Washington has written: [I]f it is determined that in a contemporary setting de facto segregated schools cannot provide children with the educational opportunities necessary to equip them for their role as citizens, then the state constitution would most certainly mandate integrated schools. Parents Involved, 72 P.3d at 162-63.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. Academic research has shown that intergroup contact reduces prejudice and supports the values of citizenship. See Derek Black, Comment, The Case for the New Compelling Government Interest: Improving Educational Outcomes, 80 N.C. L. Rev. 923, 951-52 (2002) (collecting academic research demonstrating that interpersonal interaction in desegregated schools reduces racial prejudice and stereotypes, improving students' citizenship values and their ability to succeed in a racially diverse society in their adult lives).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. Seattle's Cleveland and Rainier Beach High Schools, located in the minority-dominated southeast area of the city, enrolled 90 and 92 percent nonwhite students, respectively, in the 2000-2001 school year. The District's view that these schools are racially concentrated is, at the very least, reasonable, if not compelled by the evidence. See 34 C.F.R. § 280.4(b) (defining \"[m]inority group isolation, in reference to a school, [as] a condition in which minority group children constitute more than 50 percent of the enrollment of the school\"); see also infra pp. 10085 (discussing the majority's assertion that \"inter-ethnic diversity\" obviates the District's need for pro-diversity and pro-integration policies, maj. op. at 10045-46).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. There are at least two exceptions to this general proposition. First, public university systems can be ordered to desegregate to remedy the effects of past intentional or de jure segregation, as in United States v. Fordice, 505 U.S. 717 (1992). Second, the Court in Grutter recognized that universities do exist in, and affect, the society as a whole and that they have a compelling interest in taking into account the effects of their admissions policies on that society. 539 U.S. at 332-33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. The district court held that \"[p]reventing the re-segregation of Seattle's schools is . . . a compelling interest.\" Parents Involved in Cmty. Schs. v. Seattle Sch. Dist. No. 1, 137 F. Supp. 2d 1224, 1237 (W.D. Wash. 2001); see also id. at 1233-35.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. The Andrew Jackson cases arose out of an action by minority students seeking compulsory desegregation, but the school district was held not to have engaged in intentional or de jure segregation and therefore could not be ordered to remedy the de facto racial imbalance that existed. 598 F.2d at 715. The court then addressed the question whether the district's voluntary plan itself violated equal protection, id. at 717, holding that it did not, id. at 718-19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. As I will discuss below, the District voluntarily adopted its first mandatory desegregation plan in 1977, in order to forestall legal action by the NAACP and the ACLU, who alleged that the District had acted to further de facto segregation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. The logical corollary to this concern about the judiciary's lack of competency is a recognition that public school educators are, in fact, trained in and qualified to assess educational policies and their outcomes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. Indeed, as I will argue below, a fundamental difference between the university and the public school settings is that public schools generally do not \"select\" their students at all. Rather, they are obliged to educate all students in the relevant district.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. In an oft-quoted sentence, the Court described the analysis as follows: In determining whether race-conscious remedies are appropriate, we look to several factors, including the necessity for the relief and the efficacy of alternative remedies; the flexibility and duration of the relief, including the availability of waiver provisions; the relationship of the numerical goals to the relevant labor market; and the impact of the relief on the rights of third parties. Paradise, 480 U.S. at 171.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. The same is true of selective admissions to special high school programs, as in Wessmann v. Gittens, 160 F.3d 790, 799-800 (1st Cir. 1998) (employing a \"true diversity\" analysis in the context of competitive admissions to a prestigious examination high school); and Hampton, 102 F. Supp. 2d at 380-81 (noting that admissions to magnet schools, unlike basic school assignments, have \"vertical effects\"). See Brewer, 212 F.3d at 752-53 (distinguishing Wessmann because it was a selective admissions case in which \"true diversity\" was the compelling interest). I disagree with the majority's reasoning that the District's plan is \"necessarily selective\" merely because some schools are oversubscribed or more popular. See maj. op. at 10038-39. Under this logic, assignment between two first-grade classrooms in a single school-classrooms that are equivalent but for the popularity of the teacher-could be considered \"selective.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. I use the term \"quota\" here, as I believe the Court did in Grutter, 539 U.S. at 335, to mean \"a fixed number or percentage of minority group members who may be admitted into some activity or institution\"-not to mean, more generally, \"a proportional part.\" Webster's Third New Int'l Dictionary 1868 (unabridged ed. 1993). Quotas, as I understand them, are not at issue here because no student is preferentially admitted to, or turned away from, the Seattle public high schools. Thus, the District does not run afoul of this aspect of the Court's narrow-tailoring analysis. The majority seizes upon the more general sense of the word \"quota\"-as meaning \"proportion\"-and argues that \"racial balancing\" is per se unconstitutional. See maj. op. at 10051-52. The cited cases do not support the majority's sweeping statements. First, the Court in Croson held that a minority set aside was prohibited because the government could not prove that past discrimination provided a compelling reason for the program, not because \"racial balancing\" as a mechanism for achieving a compelling state interest would necessarily be inconsistent with the Fourteenth Amendment. Second, states are prohibited from making race the predominant factor in drawing legislative districts because of the impermissibility of racial stereotyping (that is, using race as a proxy for political characteristics), not because any consideration of a district's racial proportions is per se improper. See Bush v. Vera, 517 U.S. 952, 968 (1996) (plurality); see also id. at 958 (noting that redistricting may be performed with \"consciousness of race\"). These cases do not establish that the District is per se prohibited from linking its assignment practices to the racial make-up of its student enrollment, especially where student choices, not fixed proportions, are the principal determinant of student assignments. I simply cannot agree that we have reached the majority's promised land: Our governments, schools, and courts may yet be forced, by compelling reasons, to acknowledge that race exists in America. See Grutter, 539 U.S. at 333 (noting that, in our society, \"race unfortunately still matters\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. Students are selected by merit into at least one District program (which carries a corresponding school assignment), but not into any District school. Those who test in the top 2 percent of their grade levels are offered admission to the Advanced Placement Program for academically talented students. Selection for that program is not at issue in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. Of course, I agree with the majority that the government must offer its benefits on equal terms, regardless of race. See maj. op. at 10053-54. But the governmental benefit at issue here is a high school education, not free student choice about school assignments. Indeed, the District could devise a permissible assignment system that is devoid of student choice among high schools. Nonetheless, the District has opted to offer some choices to families-not as an abstract benefit, but rather as an educational policy that interacts with and is necessarily constrained by other District policies, including the District's diversity and integration goals.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. Justice Powell noted: Respondent's position is wholly dissimilar to that of a pupil bused from his neighborhood school to a comparable school in another neighborhood in compliance with a desegregation decree. Petitioner did not arrange for respondent to attend a different medical school in order to desegregate Davis Medical School; instead, it denied him admission and may have deprived him altogether of a medical education. Bakke, 438 U.S. at 301 n.39.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. The majority's view is that diversity is an all-or-nothing proposition and that it is improper to try to achieve racial diversity without simultaneously trying to achieve every other conceivable type of diversity (e.g., socioeconomic, religious, or linguistic). See maj. op. at 10021-25. I disagree. The District's interest is in the socialization benefits that come from racial diversity in particular. The narrow tailoring inquiry is not concerned with how a different compelling interest might lead to similar benefits, but rather asks whether race-neutral means are effective in achieving the race-related compelling interest at issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. The history that follows comes principally from two documents in the district court record. One is a paper entitled, \"The History of Desegregation in Seattle Public Schools, 1954-1981,\" which was prepared by the District's desegregation planners. The other is the \"Findings and Conclusions\" adopted by the Board in support of the current Plan.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. South and southeast area high schools Franklin and Cleveland would experience similar enrollment changes in the 1960's and the 1970's, with minority enrollment at Franklin reaching 78 percent in 1977.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. For example, the District's History of Desegregation reports that the Seattle Plan was extremely confusing, required mandatory busing of non-white students in disproportionate numbers, made facilities and enrollment planning difficult, and contributed to \"white flight\" from the city schools.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. Indeed, the District implemented the school assignment Plan as part of a comprehensive plan to improve and equalize the attractiveness of all the high schools, which included a weighted funding formula, a facilities plan, and a new teacher contract that would make teacher transfers easier.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. Originally, schools that deviated by more than 10 percent were considered \"imbalanced.\" For the 2000-2001 school year, the trigger was increased to 15 percent, softening the effect of the tiebreaker.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. A fourth tiebreaker, a random lottery, is seldom used because distance is calculated to 1/100th of a mile.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89. \"Today choice is a popular way to reform American education . . . .\" Wendy Parker, The Color of Choice: Race and Charter Schools, 75 Tul. L. Rev. 563, 564 (2001).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e90. Native American students are by far the smallest group and are the only group spread evenly between the two halves of the city.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e91. Indeed, later in the opinion, the Court noted that universities in states with laws against \"racial preferences\" were experimenting with \"a wide variety of alternative approaches.\" Grutter, 539 U.S. at 342. Yet the Court did not require the university to have analyzed fully and rejected each of these alternatives; instead, it noted that universities in states without such laws should monitor and \"draw on the most promising aspects of these race-neutral alternatives as they develop.\" Id. (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e92. The majority also notes the Urban League's suggestion that the District improve and better market its specialty programs, especially at racially concentrated schools. In fact, the District demonstrated that it is striving to improve its programming in a manner intended to make all schools equally attractive, thereby reducing or eliminating its dependence on the integration tiebreaker; it has installed new principals, constructed new buildings, undertaken major renovations, introduced an International Baccalaureate program, and introduced an information technology program linked with community colleges, among other things. Similar steps taken at Ballard and Nathan Hale High Schools led to their recent turnarounds in popularity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e93. The majority interprets Grutter to demand that every school consider a pure lottery unless, but only unless, such a lottery would sacrifice the academic quality or diversity of the student body. See maj. op. at 10021. This narrow reading does not fit a context, like this one, in which the school's mission is not to fashion an academically exceptional student body. Instead, the more appropriate principle to draw from Grutter is that schools need not consider alternatives that would do violence to the values central to their particular educational missions-here, choice and parental involvement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e94. We have held that a local government's continuing efforts to combine race-neutral measures with a minority set-aside program are \"one factor suggesting that [a set-aside] plan is narrowly tailored.\" Coral, 941 F.2d at 923; Associated Gen. Contractors, 950 F.2d at 1417 (citing Coral). See supra pp. 10080, 10083 \u0026 n.30, 10090-91 n.36 (discussing the District's many race-neutral efforts to promote integrated schools).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e95. To reiterate, in this context the District's relevant goals are for regular intergroup contact to occur and for students not to feel isolated or tokenized.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e96. For the 2000-01 school year, roughly 350 students received \"mandatory\" assignments, meaning that their assigned school was not one of their choices. Roughly 100 of these students had listed only one choice and another hundred had listed only two choices. Of the roughly 300 students affected by the integration tiebreaker, only 84 were given \"mandatory\" assignments. Of these, 29 were ultimately assigned to the same school they would have been attending without the tiebreaker, and 55 received assignments affected by the tiebreaker.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e97. Like the majority, maj. op. at 10032-33 n.32, I believe that this annual review, combined with the fact that the tiebreaker operates only until a school comes into balance, satisfies the durational requirement of narrow tailoring. See Grutter, 539 U.S. at 342-43; Adarand Constructors, Inc. v. Pena, 515 U.S. 200, 238 (1995) (holding that narrow tailoring requires that a program be limited in scope and duration \"such that it will not last longer than the discriminatory effects it is designed to eliminate\" (internal quotation marks omitted)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e98. Subject to federal statutory and constitutional requirements, structuring public education has long been within the control of the states, as part of their traditional police powers. See Barbier v. Connolly, 113 U.S. 27, 31-32 (1884) (describing the states' traditional police powers).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e99. The District has disputed Plaintiff's assertion of significant differences in objective quality among the 10 high schools. Before granting summary judgment to Plaintiff, the majority must accept the District's version of the facts. See Simo v. Union of Needletrades, Indus. \u0026 Textile Employees, 322 F.3d 602, 609 (9th Cir. 2003) (stating that, on summary judgment, facts are to be viewed in the light most favorable to the nonmoving party). If this factual issue were material, summary judgment would not be proper. Id. at 610.\u003c/span\u003e\n\n",
    "body_length": 225273,
    "citedas": [
      "377 F.3d 949",
      "2004 Daily Journal D.A.R. 9175",
      "4 Cal. Daily Op. Serv. 6716"
    ],
    "attorneys": "Counsel Daniel B. Ritter and Harry J.F. Korrell (argued), DavisWright Tremaine Llp, Seattle, Washington, for the plaintiff-appellant. Michael Madden (argued) and Carol Sue Janes, Bennett Bigelow \u0026 Leedom, P.S., Seattle, Washington, and Mark S.Green, Office of the General Counsel, Seattle School DistrictNo. 1, Seattle, Washington, for the defendant-appellees. Sharon L. Browne, Pacific Legal Foundation, Sacramento,California, and Russell C. Brooks, Pacific Legal Foundation,Bellevue, Washington, for amici curiae Pacific Legal Foundation, American Civil Rights Institute, American Civil RightsUnion, and Center for Equal Opportunity. Paul J. Lawrence, Preston Gates \u0026 Ellis Llp, Seattle, Washington, for amicus curiae American Civil Liberties Union ofWashington.",
    "category": [
      "36"
    ],
    "judges": "Before: Thomas M. Reavley,*fn1 Diarmuid F. O'Scannlain, andSusan P. Graber, Circuit Judges.",
    "citation_count": 7
  }
}
