{
  "id": "IrTaTGYBTlTomsSBKgIM",
  "document": {
    "title": "08/25/76 MARIA S WELDON",
    "full_title": "IN RE MARIA S WELDON; (DOE v. MONROE COUNTY PROBATE JUDGE)",
    "jurisdiction": "Michigan Supreme Court",
    "date": "1976-08-25T00:00:00.000Z",
    "docket": "Docket No. 56251",
    "body": "Dahlari H. Weldon when fourteen years old gave birth to Maria Sophia Weldon. Maria was placed in the foster home of Mr. and Mrs. John Doe. The Monroe County Probate Court entered an order terminating the parental rights of Dahlari H. Weldon, and later consented to the adoption of Maria by the Does. Dahlari brought an action in Federal district court alleging a violation of due process in her delinquency hearings and in the hearings which led to a termination of parental rights. The Federal district court, Philip Pratt, J., declared the Monroe County proceedings void and ordered a probate court hearing. Philip H. Mitchell, assigned Probate Judge, heard a new petition; he dismissed the petition and ordered that all prior orders of Probate Judges Seitz and Barnard remain in effect. The Does brought an action in Monroe Circuit Court against Judge Mitchell and Dahlari H. Weldon for superintending control. The Monroe Circuit Court, James J. Kelley, J., found the matter res judicata based upon the Federal court order, and declared all probate proceedings void, including the approval of adoption. The court also found the Child Custody Act inapplicable and ordered Maria returned to Dahlari. Then the Sixth Circuit Court of Appeals reversed the Federal district court order and remanded. The Federal district court entered a declaratory judgment of failure of due process and retained jurisdiction pending Conclusion of litigation in state courts. The Michigan Court of Appeals, Lesinski, C. J., and V. J. Brennan and Bashara, JJ., denied leave to appeal from the Monroe Circuit Court (Docket No. 19629). Plaintiffs appeal. Held:\n\nThe Supreme Court affirmed the judgment of the Monroe Circuit Court insofar as it recognized comity with the United States District Court decision that procedural due process was not accorded by the probate court in terminating the parental rights of Dahlari; and reversed the judgment insofar as the circuit court refused to act under the provisions of the Child Custody Act. The cause is remanded to Monroe Circuit Court for a hearing under the Child Custody Act with application of the standard of \"best interests of the child\". Maria shall continue in the custody of the Does pending a final Disposition by the circuit court and 20 days thereafter.\n\nJustice Coleman, with Justice Fitzgerald Concurring, concurred concerning the standard of the best interests of the child under the Child Custody Act but Dissented in recognizing the decision of the United States District Court:\n\n1. The doctrines of res judicata and full faith and credit should not apply to the order of the Federal district court which declared the original probate court proceedings void, because the district court order was reversed by the Sixth Circuit Court of Appeals with a finding that the Federal district court did not have jurisdiction to set aside the probate court proceedings. The probate court hearing ordered by the district court is irrelevant to the Disposition of the original hearing.\n\n2. The Child Custody Act, MCL 722.21 et seq.; MSA 25.312(1) et seq., applies to the facts of this case and the matter is remanded to the circuit court to consider the question of the third-party custody of the Does under the Child Custody Act. Where the probate court does not retain jurisdiction, or if the Federal court declares the probate court proceedings void, the circuit court may hear an original action under the act.\n\n3. Children are deserving of the right to those liberties in which physical, mental and emotional growth are essential. They are endowed with a right to equal opportunity to \"life, liberty and pursuit of happiness\" and the right to be recognized as individuals, separate and distinct entities from the parents.\n\n4. The Child Custody Act looks to \"the best interests of the child\" in granting custody. The Does, as third-party custodians with whom Maria has lived under color of a legal adoption placement, cannot be eliminated from consideration for placement by the circuit court.\n\n5. The Child Custody Act does not incorporate the prior law that the presumption in favor of parental custody could be overcome only by affirmative proof that the parent was unfit to have custody or had neglected or abandoned the child. The presumption that parental custody is in the best interests of the child may be rebutted by evidence of the best interest of the child which does not relate to the question of the natural parent's fitness. The court must determine placement on the basis of the best opportunity of the child to develop to full potential.\n\n6. The proceedings leading to the order terminating the parental rights of Dahlari Weldon afforded Dahlari procedural due process as a matter of state law. The original order of the probate court terminating parental rights should be affirmed and the adoption proceedings continue in the usual manner. The Disposition by the probate court of the original neglect petition was not invalid under the totality of the circumstances and there was sufficient evidence through testimony and in the court records to support termination of parental rights at the August 11, 1972 hearing when the matter of Maria was taken under advisement by the probate court. No objections were heard from trial counsel; Dahlari failed to return home during the period of advisement; no appeal, petition for rehearing, or petition for delayed appeal was taken within the statutory periods; and the adoption by the Does had proceeded through the proper steps without challenge during the statutory period of observation.\n\n7. This appeal is based on a finding of lack of procedural due process. To open up substantive matters on collateral attack and especially in equity would be to place every adoption in jeopardy. Reference to the testimony is irrelevant and not a part of this case.\n\n8. An order under MCLA 712A.12; MSA 27.3178(598.12) for Maria's medical examination was not necessary. Judge Seitz examined the parties personally in probate court and authorized the filing of a petition alleging that Maria was a dependent or neglected child. He also ordered a physical examination. Maria was actually taken into custody for examination after a hearing in Ohio. A hearing in Michigan was promptly noticed to the parties.\n\n9. Final statements of counsel were requested and made at the Dispositional hearing. A Discussion took place between counsel and the probate Judge at the adjudication hearing and no requests or objections were made concerning arguments of counsel at that time. To declare all similar cases reversible because no formal argument was made at adjudication, requested or not, is to threaten many adoptions.\n\n10. After the final Disposition hearing was over the probate court had sufficient evidence to enter an order terminating Dahlari's parental rights but instead took the matter under advisement. The information reported to the court after the final hearing did not change the sufficiency of the previous evidence, so the order was entered.\n\n11. The principles of equity, comity and federalism allow a Federal court to issue an injunction against state Judges or other personnel such as prosecutors in only a narrow class of civil rights cases. The Federal anti-injunction statute should apply here because there is an undeniable state interest and the state is a party to the probate court petition. There is not a sufficient commonality of interest between the Federal and state suits in this matter to warrant the Conclusion that the Does are deemed to have been represented in the Federal District Court or that the action would preclude reliance on the probate court records and files without additional evidence.\n\n12. The Federal District Court does not settle the question of state law. Whether the parties were properly in court or whether relief can be fashioned remains to be seen. The process of exhaustion of state remedies requires review of only the records and files of the state proceedings.\n\n13. The Child Custody Act supplants general jurisdiction of the circuit court and gives specific authority and standards to apply. Moral unfitness or promiscuity may be a ground for terminating parental rights if the child's best interests demand it.\n\nJustice Levin, with Chief Justice Kavanagh Concurring, Dissented concerning the standard of the best interests of the child under the Child Custody Act; but concurred in recognizing the decision of the United States District Court:\n\n1. The Michigan Supreme Court adopts the determination of the Federal court that the requirements of the Due Process Clause were not observed in the probate court proceedings resulting in termination of Dahlari's parental rights. A declaration by the probate court that Maria was subject to jurisdiction of the probate court as a neglected child after the close of proofs without inquiry whether any of the attorneys wished to make an argument before the court decided the issue of neglect denied the parties an essential element of the due-process right to a hearing and to the assistance of counsel. The Due Process Clause was violated in receiving, after the hearing on termination of parental rights, evidence from a social worker's written report which was not made part of the record at a hearing at which the parties would have an opportunity to explain or rebut. Informing Mrs. Weldon of the period for filing an appeal from an order of the probate court terminating Dahlari's parental rights was not an adequate substitute for advising Dahlari and giving her an opportunity to exercise her appellate rights where the history of family conflict demonstrates that Dahlari's legal interests and those of her mother were not the same.\n\n2. The requirements of the Due Process Clause were not observed in the proceedings resulting in the termination of parental rights. There is no evidence in the proceedings conducted by Judge Seitz or in subsequent proceedings that the child was neglected or that there was any statutory basis for termination of parental rights. The statute authorizes the probate court to take jurisdiction of a neglected child, of a child subjected to other described deprivations, and of a child \"whose mother is unmarried and without adequate provision for care and support\". Dahlari's personal impecuniosity is not determinative. Many mothers are dependent on others for the financial support of their children, and Dahlari's father was able and willing to do so for Maria. A parent may entrust the care of a child to relatives or others without interference by the state as long as the child is adequately cared for. There is no evidence that Dahlari's mother did not adequately care for Maria during the periods when Dahlari was away from home.\n\n3. The judgment by the Federal District Court is entitled to full faith and credit. The Federal court's judgment is also res judicata. The Does were the persons for whose benefit the defense of the Federal court litigation was conducted, and Maria was at all times represented in the Federal proceedings. The Does were aware of the pendency of the Federal court action and of the issues there being litigated. They participated through counsel in the probate court hearing before Judge Mitchell on remand from Judge Pratt. They did not seek to intervene in the Federal proceedings until all briefs had been filed on the second appeal to the Sixth Circuit Court of Appeals, and they did not seek an opportunity to present further evidence on the issue whether the requirements of the Due Process Clause were observed in terminating Dahlari's parental rights. The Federal court judgment was entered following an opportunity to present evidence affecting the matter and full consideration at the trial and appellate levels. The record and the law strongly support that judgment. There is no suggestion that any further evidence affecting the Federal court determination could be offered in additional state court proceedings. Even if the Federal court determination were thought not binding on Michigan courts under the principles of full faith and credit and res judicata, the Michigan Supreme Court would defer to it as a matter of comity.\n\n4. A parent able to provide care and support has the right to custody unless parental rights are terminated or modified or the child is abandoned. A child has the right to be protected from a transfer of custody that results in the destruction of the child's ability to grow and mature into a healthy and whole person. Evidence of the comparative advantages of a foster home is not admissible in probate court proceedings for termination of parental rights. The Child Custody Act does not expand the powers of the probate court where it acts beyond its authority in terminating parental rights. Even if a baby is more likely to obtain love, affection and guidance, food, clothing, medical care or other remedial care from prospective adoptive parents, even if they provide permanency as a family unit and are morally better fit and possess better mental and physical health than the unwed teenage mother who is herself dependent on others, the probate court may not take a baby from the mother unless the conditions to its jurisdiction set forth in the statute are established by a process satisfying constitutional requirements. Moral unfitness or promiscuity is not a ground for terminating parental rights. The mere fact that the child was born out of wedlock does not deprive the mother of her parental rights. The delinquency of a parent confers no jurisdiction over a child of the parent unless the parental delinquency affects the child. The probate court is not empowered to remove Maria from Dahlari's custody as punishment for her delinquency.\n\n5. No equity can be recognized in favor of the Does based on changed circumstances resulting from the pursuit of litigation judicially found to have been unjustified years before. It would be unjust to say that because so much time has been required to litigate the matter, the door is now barred because mother and child have been too long separated.\n\n6. The Child Custody Act does not require that the best interests of the child control where the dispute is between a parent and a third party. Under the Child Custody Act and apart from it the circuit court has the power to determine the rights and duties of a child, the parents, and of other persons having custody of a child.\n\nJustice Williams concurred that comity requires recognizing the decision of the United States District Court and that the standard of the best interest of the child controls under the Child Custody Act. The interest is presumed to be placement or custody with the natural parent unless the opposing party proves the opposite result. The Child Custody Act is applicable and the matter is remanded to the circuit court for further action.\n\nAffirmed in part; reversed in part. Jurisdiction retained.\n\nWilliams, J.\n\nOut of the welter of state and federal litigation, only two issues are before this Court, because we are being called upon to review the action of the circuit court on the petition for superintending control.\n\nFirst, what recognition, if any, must be given to Judge Pratt's decision?\n\nSecond, did the circuit Judge correctly refuse to consider the Child Custody Act?\n\nOn the first issue, comity requires us to recognize the decision for what it is, that in terminating the parental rights of Dahlari Weldon, due process was not accorded.\n\nOn the second issue, we find the Judge erred because he failed to respond to the whole purpose of the Child Custody Act, and to the specific language of §§ 2 and 6.\n\nMy colleagues are divided as to what the controlling criterion in the Child Custody Act is. It is abundantly clear to me that the whole purpose of the act is to serve \"the best interests\" of the child \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and the second sentence in § 5 establishes that as between the natural parents and the third party the criterion is \"the best interests of the child\". It presumes that this interest shall be placement or custody with the natural parent unless the opposing party proves the opposite. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe best interests of the child under §§ 1 and 3 of the Child Custody Act have not been determined because of the circuit court's refusal to consider the act. This Court therefore remands the matter to the circuit court for further action not inconsistent with the majority decision of this Court that the Child Custody Act is applicable under the circumstances of this case, and that the best interests of the child is the ultimate criterion to apply, subject, of course, to the rebuttable presumption in the second sentence in § 5.\n\nWe retain jurisdiction.\n\nColeman, J.\n\nMaria Sophia Weldon, born on October 18, 1971 is caught in a web of legal strands spun between the parallel tracks of state and Federal courts. She has lived with would-be adoptive parents, \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Mr. and Mrs. John Doe, since September 7, 1972. For four years she has been the focal point of legal battles in several arenas. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e There was no appeal or petition for rehearing in the state courts during the statutory periods. The initial attack was collaterally brought in Federal district court where the last extant order was a declaratory judgment in equity.\n\nRespondent Dahlari was present and represented by counsel throughout probate court proceedings and represented by counsel in each review. Circumvention of state remedies at the outset of review has resulted in a most complex situation, but the matter has been exquisitely explored.\n\nPlaintiffs now appeal from the Court of Appeals denial of leave to appeal from a circuit court order returning Maria to her natural mother. Both decisions were predicated in part upon Federal district court orders, of which one was reversed. This Court must determine the important issues involving Michigan law. We must establish a reliable factual base, address constitutional concerns, clarify Michigan juvenile law concepts and procedure in termination hearings, determine the rights of the parties, analyze the Child Custody Act and provide Maria some hope of a stable home by bringing the state process to an end.\n\nResume of Facts\n\nInitial Proceedings\n\nOn October 18, 1971 -- 14-year-old Dahlari H. Weldon gave birth to Maria Sophia (father unknown).\n\nJune 9, 1972 -- During Dahlari's adjudication hearing on a delinquency petition filed by youth officer Elizabeth Harrington and at the time of the later Disposition hearing, testimony was presented that she is the mother of Maria. She was in shelter care, her family was divided and in a chaotic condition. Although Dahlari had had no prenatal care and had a venereal disease, the baby had not been examined (or immunized) in the eight months since birth. Dahlari's mother, Norma Weldon, resisted a court medical examination of Maria ordered by the Judge.\n\nJune 9, 1972 -- The sheriff filed a dependent/neglect petition (hereinafter denominated D/N) as to Maria. Norma Weldon left the state with baby Maria and returned to her residence in Bowling Green, Ohio.\n\nJune 15, 1972 -- A juvenile hearing was held in Wood County, Ohio regarding Maria. Maria was ordered released to Monroe County probate court and placed in temporary custody pending hearing on the D/N petition.\n\nJune 19, 1972 -- Dahlari was served with notice of hearing on the D/N petition, including notice that parental rights could be terminated.\n\nJuly 11, 1972 -- Adjudication hearing was held on the D/N petition. Dahlari was present and represented by counsel. Grandmother Norma was not present but represented by counsel. Grandfather Frank Weldon was present but not represented by counsel. Maria was represented by counsel.\n\nJurisdiction of Monroe County probate court over Maria was established and the matter adjourned to allow Dahlari and her parents more time to establish and present a plan for Maria (who was continued in foster care) by 15 days before the adjourned date so that investigation and verification could be effected prior to the hearing. (This was not done.)\n\nAugust 11, 1972 -- Dispositional hearing was held as to Maria; Dahlari and attorney were present. Attorney for Norma Weldon was present and on record claimed to represent both of the grandparents. Frank Weldon and attorney for Maria also were present. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nAfter testimony, attorneys for Dahlari and her parents asked the Disposition be \"held in abeyance\" pending a request for investigation of the Bowling Green home and supervision by the Wood County, Ohio court. They had not previously so requested nor presented a concrete plan to the caseworker since the adjudication hearing.\n\nIn connection with the request, the attorneys asked that Dahlari be released to her parents in order to establish a home for Maria. The Judge temporarily released Dahlari for return with her parents to Ohio. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe matter of Maria was taken under advisement.\n\nAugust 29, 1972 -- Dahlari was picked up by police back in Monroe County. Parents had requested a missing persons alert.\n\nSeptember 5, 1972 -- A letter was received from James E. Thompson (Wood County juvenile court) to Shirlie Friess (Monroe County probate court) conveying the court's refusal to supervise the Weldon home and stating that there were no suitable relatives in Wood County for placement of Dahlari and Maria.\n\nSeptember 7, 1972 -- Maria was placed in the foster home of Mr. and Mrs. John Doe.\n\nSeptember 12, 1972 -- Order was entered terminating Dahlari's parental rights.\n\nSeptember 15, 1972 -- Order of termination was served on Dahlari.\n\nSeptember 18, 1972 -- By letter, attorney for Norma Weldon acknowledged receipt of order of termination and advised his client regarding appeal or reconsideration of the case.\n\nFebruary 6, 1973 -- Report of court investigation of the Doe home was filed and consent was executed by the court to the adoption of Maria by the John Does.\n\nMay 2, 1973 -- Almost eight months after termination of parental rights and three months after the probate court consented to the adoption of Maria, Dahlari filed suit in Federal district court alleging a violation of the Civil Rights Act in her Monroe County delinquency hearings and in the hearings which led to a termination of parental rights. An avalanche of judicial activity followed as described below.\n\nJuly 20, 1973 -- At the Federal district court's suggestion, the parties agreed to file a petition for rehearing. This was denied by the assigned probate Judge on the basis that the state statutory period for rehearing had expired three months after termination order and the court had no jurisdiction. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nSeptember 25, 1973 -- The Federal district court declared the Monroe County neglect proceedings as to Maria void and ordered a probate court hearing within 30 days.\n\nOctober 22 and 25, 1973 -- Another assigned probate Judge heard a different petition (not a rehearing) pursuant to Federal court order. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e He said:\n\n\"his is not a rehearing of any material which was before Judge Seitz at the time he heard the case in June of 1972. * * * That all we are doing is determining that as of the Conclusion of this hearing here, there has been insufficient testimony to warrant this court assuming jurisdiction over this child, as a neglected child. I in no way am attempting to interfere with any rights which have been acquired by the adopting parents, or any orders which might have been entered in this court * * *.\" (Emphasis added.)\n\nHe dismissed the petition and ordered that all prior orders remain in full force and effect.\n\nNovember 3, 1973 -- The Does filed a complaint for superintending control in circuit court and petition for custody under the Child Custody Act.\n\nMarch 6, 1974 -- While an appeal from the Federal district court order was pending in the Sixth Circuit Court, Monroe County Circuit Court found the Federal court order res judicata and declared all probate proceedings void, including adoption proceedings. It also found the Child Custody Act, MCLA 722.21 et seq.; MSA 25.312(1) et seq., to be inapplicable. It ordered Maria returned to Dahlari. This order was stayed by the Michigan Court of Appeals pending emergency application for leave to appeal.\n\nApril 19, 1974 -- Sixth Circuit Court of Appeals found that the district court \"did not have jurisdiction under 42 USC 1983 and 28 USC 1343 to review and set aside the probate court's proceedings and to order the probate court to conduct another hearing\" and therefore reversed the Federal district court order which had found the proceedings void and which had ordered a new hearing. The case was remanded.\n\nJuly 24, 1974 -- The Federal district court entered a declaratory judgment in equity finding failure of procedural due process and retained jurisdiction \"pending Conclusion of litigation in the courts of the State of Michigan\".\n\nAugust 11, 1974 -- Appeal was filed in Sixth Circuit Court of Appeals from the Federal district court order of July 24, 1974.\n\nAugust 28, 1974 -- Michigan Court of Appeals denied plaintiffs leave to appeal the Michigan circuit court order because of the July 24, 1974 Federal district court order and vacated circuit court's stay of the order to return the baby to Dahlari providing order to enter.\n\nSeptember 10, 1974 -- Michigan Supreme Court granted stay of order of Monroe circuit court dated March 6, 1974.\n\nJanuary 24, 1975 -- Michigan Supreme Court granted leave to appeal. 393 Mich 795 (1975).\n\nStatus of Proceedings\n\nThe action for superintending control or custody under the Michigan Child Custody Act filed by plaintiffs in the circuit court is the only matter here on appeal. It is not a \"matter\" before the Federal courts. The parties are different. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e It contains questions of state law and procedure quite distinct from and in addition to those presented in Federal district court.\n\nAlthough briefs and oral arguments weave in and out of collateral testimony allegedly given in Federal proceedings, this Court is not privy to those transcripts and files. The Federal court opinions and orders which have bearing upon this matter will be considered so far as they have affected the state proceedings to date and are of record herein.\n\nPlaintiffs' motion to include in the record the Monroe County probate court delinquency as well as neglect files and records pertaining to Dahlari H. Weldon is unnecessary. This Court has the duty to inspect all files and records to which the probate Judge and the attorneys had access in the disposition of this matter. Previously plaintiffs' motion to include Dahlari's delinquency files and records from Wood County, Ohio, both prior and subsequent to the termination proceedings was denied. A motion to permit a subsequent Ohio adult criminal record also was denied. Some Ohio juvenile history is present as a part of the Michigan files.\n\nIssues\n\nThe issues which will be addressed are:\n\nI. Was Dahlari afforded procedural due process in the proceedings to terminate her parental rights to Maria Sophia Weldon?\n\nII. Did the circuit Judge err in declining to hear on its merits the complaint for superintending control?\n\nIII. Does the Child Custody Act, MCLA 722.21 et seq.; MSA 25.312(1) et seq., apply to these facts?\n\nIV. Does Maria have protected rights?\n\nI. State Procedural Due Process\n\nThe following juvenile court rules are of particular importance:\n\nJCR 1969, 7:\n\n\".2(A) * * * Upon filing of a petition the court shall order a hearing by the issuance of a summons.\"\n\nThis was done.\n\n\"(B) * * * The summons shall require the person to whom it is directed to appear for hearing at the time and place specified by the court therein. It shall contain:\n\n\"(1) * * * The following statement shall appear in or be attached to the summons:\n\n\"(a) You have the right to be represented by an attorney,\n\n\"(b) If you desire to employ an attorney you should do so immediately in order that he may be ready at the hearing date,\n\n\"(c) If you are financially unable to employ an attorney and you desire the services of an attorney, you must notify the court immediately, upon receipt of this summons. If you desire a court-appointed attorney, the court must determine prior to the hearing whether you are financially unable to employ an attorney, or to reimburse the county in whole or in part for the cost of such services.\"\n\nThis was done.\n\n\"(2) * * * Notice that the matter may be heard before the court with or without a jury shall be included in or attached to the summons, together with notice that a request for a jury shall be filed in writing with the court prior to the hearing.\"\n\nThis was done.\n\n\"(3) * * * Notice of the charges appearing in the petition shall be given by reciting their contents in the summons or by attaching a copy of the petition to the summons.\"\n\nThis was done.\n\n\"(4) * * * In cases where a hearing could result in the termination of parental rights, such possibility shall be stated.\" (Emphasis added.)\n\nThis was done.\n\n\"(C) * * * The summons shall be directed to the following persons:\n\n\"(2) Summons shall be served as in proceedings where an offense by a child is charged; provided, a parent, guardian, custodian, guardian ad litem or counsel may be served in lieu of service on the child in the discretion of the court.\"\n\nThis was done.\n\n\"(D) * * * Summons shall be served in a manner provided by law or as shall hereafter be provided by these rules.\"\n\nThis was done.\n\nJCR 1969, 8:\n\n\".1 * * * Juvenile court hearings on the formal calendar shall consist of 2 phases -- the adjudicative phase and the Dispositional phase. Duration of an interval of time between the 2 phases of the hearing, if any, shall be discretionary with the court.\n\n\"(A) * * * The adjudicative phase determines whether the child comes within the jurisdiction of the court under provisions of [Act 54 of the extra session of 1944], as amended, as alleged in the petition or supplemental petition.\n\n\"(B) * * * The Dispositional phase determines measures to be taken by the court with respect to the child and adults properly within its jurisdiction in the event the court has determined at the adjudicative phase that the child comes within the provisions of said act.\"\n\nThis was done.\n\nDiscrepancies, Federal-State Courts\n\nThe state courts have relied upon orders and findings of the Federal district court. There are discrepancies between those findings and the probate court records which must be noted:\n\n1. Federal District Court Opinion:\n\nThe Federal district court found that the delinquency and neglect hearings were held jointly. The Judge stated:\n\n\"* * * the joint consideration and hearing of both the delinquency case and the termination of parental rights case were inappropriate and could not but be confusing to Dahlari. While involving mutual facts, the issues are great to the uninitiated.\"\n\nProbate Court Record:\n\nOn June 19, 1972, notice solely of the neglect petition as to Maria was served upon the parties. The transcribed records of the adjudication phase and the Disposition phase contain explanations that the hearings concern Maria, not Dahlari. Dahlari's presence was noted as the mother of Maria and all testimony had to do with such relevant material as her fitness as a mother, her home as a suitable environment for Maria and her ability to care for and support the child. Before the time of the first neglect hearing, Dahlari's delinquency case had been completed (June 9, 1972) and the Disposition taken under advisement. The hearings were in no way combined. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\n2. Federal District Court Opinion:\n\nIn speaking of the Disposition phase of Dahlari's delinquency hearing, the Judge said:\n\n\"It was at that hearing, on June 9, 1972, that the matter of the baby, Maria Sophia Weldon, was brought directly to the attention of the court.\"\n\nProbate Court Record:\n\nAt the delinquency adjudication hearing on April 25, 1972, the following colloquy took place before Dahlari was released to her mother:\n\n\"Q. I see. Well, did your daughter have a baby also?\n\n\"A. Yes, she does.\n\n\"Q. Is that baby living with you?\n\n\"A. Yes.\"\n\nIn the context of questioning on June 9, 1972 regarding Dahlari's carrying through on her treatment for her disease, the Judge asked whether Maria had been examined by a doctor. He also wanted to know about immunization. He said, speaking of the need for a physical examination for Maria:\n\n\"I have no way of knowing what the physical condition of this child is, or whether this child is a carrier of a venereal disease or anything else.\" \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\n3. Federal District Court Opinion:\n\n\"he form gave way to substance and no real effort was made to assure that the plaintiff * * * was fully apprised of her rights, of the nature of the proceedings and of the possible irrevocable consequences.\"\n\nProbate Court Record:\n\nIn addition to summons and attached petition which described the nature of the complaint, possible consequences, right to counsel and jury trial, the probate Judge appointed an attorney for Dahlari and another for Maria. Dahlari's attorney stated on the record and in her presence that he had discussed the proceedings with Dahlari.\n\nAt the beginning of the neglect proceedings, the Judge stated:\n\n\"Now the nature of the proceedings before the Court is proceedings in the nature of a neglect petition alleging that the infant child comes within the jurisdiction of the Court.\"\n\nHe then stated the charges and proceeded:\n\n\"The court would advise the parties of their right to a full and complete hearing in connection with this matter and with the right to question and cross-examine witnesses in an orderly fashion and procedure and through counsel * * * if there are any questions or doubts concerning the truth of the charges that have been made, by all means there should be a full hearing before the court * * * the consequences could be anything from a warning and dismissal up to and including termination of parental rights and removal of the child for placement as a ward of the court, ward of the state.\"\n\nAt the request of counsel, the Disposition hearing in the neglect case was adjourned to allow the parties time to present a plan for the care of Maria. A request was made by the prosecutor and agreed to by the Judge that a plan be submitted to the court within 15 days before the Disposition hearing to allow time for investigation of claimed plan. Again at the subsequent Disposition hearing when no further move had been made since the previous hearing or concrete plans presented by Dahlari or her family, the Judge took the matter under advisement and said:\n\n\"In making a determination concerning Maria, the court must consider what would appear to be in the best interest of the youngster and this is not an easy decision to make. If the child is made a permanent ward of the court, it may be placed for adoption and have the opportunity of a mother and father and a stable home. To do this certainly would not be without traumatic effect on the teenage mother of the child. The court has two lives to consider really, in considering a Disposition of this matter.\" (Emphasis added.)\n\n4. Federal District Court Opinion:\n\nIn speaking of due process, the Judge wrote:\n\n\"Perhaps the most striking example of this deprivation is the failure to ascertain, or attempt to ascertain, from the plaintiff Dahlari at any time whether she understood the nature of the proceedings and the possible consequences. Her participation in the pertinent hearings, as shown by the transcripts, is limited to the mere mention of her presence. No inquiry was ever directed to her, no invitation to testify or make a statement.\"\n\nProbate Court Record:\n\nDahlari did not testify other than to give her name. The Judge did, however, at each hearing ask her attorney if he wished to present any witnesses. In each instance the attorney replied that he did not wish to call any. The attorney also stated that he had discussed the proceedings with Dahlari. It was his decision whether Dahlari should take the stand.\n\n5. Federal District Court Opinion:\n\nThe Judge found credible Dahlari's testimony that \"she was not only not advised and did not understand the proceedings, but that she was confused as to which attorney represented her\".\n\nProbate Court Record:\n\nTogether with the attorney's recorded representation that he had discussed the matter with Dahlari, see discrepancy 3, (supra) for probate Judge's explanation of the proceedings. The record reveals that at each D/N hearing Dahlari was identified as the mother of Maria. Her counsel also identified himself as Dahlari's attorney on the record and in Dahlari's presence.\n\nThe transcript indicates Dahlari's presence in the courtroom at all times. Because both her own attorney and Norma Weldon's attorney were fighting for the return of the baby to Dahlari, it is possible she concluded that both were representing her interests. In effect, both were actively engaged on her behalf.\n\nWe cannot assume from the record that counsel was incompetent in his representation of Dahlari before, during or after the hearing and order, nor is such a charge made.\n\n6. Federal District Court Opinion:\n\nIn speaking of Dahlari, the Court wrote:\n\n\"With respect to the most devastating testimony -- that of Mrs. Friess that Dahlari had told her Mrs. Weldon had physically abused the baby -- she was not asked to verify or deny.\"\n\nProbate Court Record:\n\nApparently the testimony in the Disposition phase was not so devastating as to preclude the Judge's last effort to provide a home for Maria with Dahlari and the Weldons in Ohio. Mrs. Friess' testimony was allowed to enter without objection. Dahlari and her lawyer were both present had her testimony seemed necessary or her lawyer wished to examine further. It was admissible under JCR 1969, 8.3. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nIn any event, this \"hearsay\" was brought out by the attorney for the Weldons, not by the prosecutor or Maria's attorney. The interest of the Weldons was consistent with that of Dahlari in the neglect case. All were interested in obtaining custody for Dahlari.\n\n7. Federal District Court Opinion:\n\n\"Another area of concern is the final order of September 12, 1972 which terminated parental rights. The record does not indicate the reasons for that action nor the basis for the order. On the contrary, the August hearing had produced the testimony of Mr. Weldon as to his ability and willingness to care for and support the baby subject to closest supervision of a court. That hearing was concluded with the stipulation that the Ohio authorities be contacted. Yet there is no indication that they were contacted and, if so, whether the results were favorable or unfavorable to the plaintiff and her parents. If unfavorable and a factor in the determination, fairness would have required some disclosure, or an opportunity to be heard.\"\n\nProbate Court Record:\n\nThe file contains this letter from James E. Thompson of the Wood County, Ohio juvenile court, to Mrs. Friess:\n\n\"Judge Glenn C. Parsons had advised me that he does not feel that Dahlari Weldon can be rehabilitated while on probation, particularly when subjected to the influence of any member of her immediate family. Dahlari does not have a relative in this area suitable to serve as custodian of either Dahlari or her baby, Maria, or of both. Supervision of such a placement would be categorically impossible.\"\n\nThe files also reveal that Mr. Weldon had allowed Dahlari to return to Monroe to pick up some clothes, but that she failed to return to Bowling Green. She had been observed \"roaming Monroe County\" on August 21-23, 1972, and her parents notified. Mr. and Mrs. Weldon then turned in a missing persons report and on August 29, Dahlari was detained by the police after having been in a motorcycle accident. She was lodged in the shelter home.\n\nIn taking the neglect Disposition under advisement, the probate Judge had explained in part:\n\n\"The court has many things to consider in a case of this nature. To summarize some of the problems that do exist, we have a teenage mother, 15 years of age, who has been involved in delinquency acts, has been known to the courts in Ohio, as well as the courts in Michigan. That certainly she does not demonstrate a record of maturity, or responsibility for the care, or would indicate that she was suitable for the care of the infant child. Apparently, some of her difficulties as well as some of the difficulties that would occur with regard to the child, the infant, stem from the conflicts that have existed between the mother of the infant and the grandmother of the infant. The court is not so naive, as to ignore all the indications that Dahlari and her mother have jumped from one jurisdiction to another as they found best suited their interests and avoided proper supervision or resolution of problems that existed to some degree in this fashion.\"\n\nTaking a matter under advisement indicates an end to the legal proceedings and a subsequent time for deliberation. The order finally entered must be supported by the facts on file and record at the time of the hearing. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Here the Judge could have entered a termination order at the end of the Disposition hearing, but he held the case under advisement and acceded to the attorney's request to release Dahlari from shelter care. Dahlari won the point now contested. When the refusal to supervise was received from Wood County, Ohio and Dahlari had failed to grasp this last opportunity to make a suitable home for Maria, \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e the Judge had only to enter the order in the already completed D/N case. A written finding of fact, or conference, would have constituted better practice, but we would not find the omission fatal.\n\n8. Federal District Court Opinion:\n\n\"Further, although it is arguable that the delay between final order of termination of plaintiff Dahlari's parental rights and the filing of the complaint in this Court subverts the statutory three month appeal limitation, such argument loses validity when it is considered that the plaintiff Dahlari was incarcerated during that period and there is no indication that she was advised of any rights she might have.\" \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nProbate Court Record:\n\nEight days after Dahlari was served with the order terminating her parental rights (September 15, 1972) she was released from the shelter home. The records contain no other information excepting that she was placed by State Department of Social Services in a small group residence on November 1, 1972, where she also received counseling regarding the termination.\n\nWe also know that Mrs. Weldon had written to the probate Judge regarding Dahlari's regaining custody of Maria after she was informed by her attorney of the appeal and rehearing time limitations and of his receipt of the termination order. Later she was informed of the need to file a motion for delayed appeal. We cannot conclude that Dahlari remained unaware of her rights for approximately eight months during the periods she was at home or when in residency and when her mother and attorney were active in her behalf. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e In this respect, it is important to remember that it is normal for parents to be the aggressors in cases involving children. Court rules even provide for service of notice on a parent in lieu of the child.\n\nOur review of the record shows that Dahlari was afforded procedural due process. There was no reversible error on that point, particularly when considered in balance with the rights of Maria as discussed later.\n\nII. Circuit Court Review\n\nThe matter before the Court stems from a complaint for superintending control and custody with subsequent order filed in the Monroe circuit court. Leave to appeal was denied by the Court of Appeals.\n\nThe circuit court order was based upon a Federal district court order which had declared the original neglect hearing void. The circuit Judge said that the matter was res judicata -- the order of termination was void -- and the Child Custody Act was not applicable. He ordered the return of Maria to Dahlari.\n\nThe circuit court relied upon an order which was appealed and reversed with a finding \"that the district court did not have jurisdiction under 42 USC 1983 and 28 USC 1343 to review and set aside the probate court's proceedings and to order the probate court to conduct another hearing. See Kenosha v Bruno, 412 U.S. 507 [93 S Ct 2222; 37 L Ed 2d 109] (1973)\". The Sixth Circuit Court of Appeals ordered the judgment reversed \"insofar as it held the probate court's proceeding to be void and ordered the probate court to hold a hearing\". The doctrine of res judicata is not applicable under these circumstances.\n\nBecause the Sixth Circuit Court of Appeals reversed the order regarding the validity of the probate hearing and found the order for a new hearing to be void, the termination as of this date remains a valid order (unless a final Federal order finds it void).\n\nThe probate hearing ordered by the district court is irrelevant for two reasons:\n\n(1) The Judge stated at the beginning of the hearing and in the final order that the matter before the court was not a rehearing of the original petition, but a new and separate hearing held upon a new petition (with some allegations different from the original petition). The facts bear out the assertion. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e The order specifically referred to the appeal pending in the Sixth Circuit and with foresight limited the validity of the proceedings before it to the validity of the Federal district court order. Upon dismissal of the petition before him, the Judge found all prior orders in full force and effect except as \"otherwise may be ordered by a higher court\".\n\n(2) If the Federal district court had no jurisdiction in the case as it stood to order that hearing, the hearing held pursuant to and limited to that order also was void.\n\nFrom any perspective the Federal-court-ordered hearing has no effect upon the original hearing.\n\nWe readily acknowledge the good faith efforts of all the Judges involved as viewed from different factual presentations and from different benches -- and we assert ours. Some Conclusion of facts, some erroneous assumptions and some possibly self-serving after-the-fact statements have made the task even more difficult.\n\nIII. Child Custody Act\n\nThe circuit court also ruled that the Child Custody Act was inapplicable. The Judge had little guidance from Michigan law because this Court has not ruled heretofore as to the act's effect upon third parties or upon the rights of a child in Maria's situation. Therefore, we have considered the issue and find that the Child Custody Act applies to the facts of this case.\n\nMCLA 722.25; MSA 25.312(5) provides:\n\n\"When the dispute is between the parents, between agencies or between third parties, the best interests of the child shall control. When the dispute is between the parent or parents and an agency or a third person, it is presumed that the best interests of the child are served by awarding custody to the parent or parents, unless the contrary is established by clear and convincing evidence.\" (Emphasis added.)\n\nThe statute clearly encompasses \"a third person\". Importantly, the emphasis is upon the best interests of the child rather than the property rights of others.\n\nThe Act also provides for liberal construction and states: \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\n\"This act shall apply to all circuit court child custody disputes and actions, whether original or incidental to other actions. * * * An application for a writ of or for a warrant in its place to obtain custody of a child shall not be granted unless it appears that this act is inadequate and ineffective to resolve the particular child custody dispute.\"\n\nBecause the act purports in its title to \"declare the inherent rights of minor children\", we look further to the means of identifying and protecting those rights.\n\nMany eloquent words have been written and spoken concerning \"the best interests of the child\" only to evolve into an analysis of rights of parents and others as to a piece of property. To minimize these regretable results, the Child Custody Act was passed and hailed as implanting in our statutes the humane and progressive mandate that children are people who have the same unalienable rights as all other citizens. As such, children are deserving of the right to those liberties in which physical, mental and emotional growth are essential. They are endowed with a right to the \"pursuit of happiness\".\n\nThe statute contains a rebuttable presumption that parental custody is in the best interests of the child. The critical question then becomes, \"ho may attempt to overcome the presumption and how?\"\n\nIf the act is what it purports to be, and does indeed look to \"the best interests of the child\", we cannot under any analysis eliminate the Does from consideration for placement by the circuit court. They are third-party custodians with whom Maria has lived under color of a legal adoption placement.\n\nHowever, the circuit court did just that when it asserted \"superintending control over all proceedings in the Monroe County Probate Court\" which involved Maria Weldon and ordered her returned to her mother Dahlari. The Judge said that the \"best interests of the child\" would not be applicable and likened Maria's situation to that of a kidnapped child:\n\n\"The Does, who appear faultless in this matter, claim that they have given Maria good care and she is happy and well-adjusted. They urge the Court to consider that it would be in Maria's best interest to leave her with them.\"\n\n\"To grant the Does custody would be to set a dangerous precedent. Assume a child is kidnapped and then abandoned. A well-to-do couple find and care for the child. Should any court thereupon even consider not returning the child to the natural parents, regardless of the child's best interests?\"\n\nThe answer was negative.\n\nIn effect, the circuit court found that the Does have no standing to seek custody under the act.\n\nAlthough parties may not seek custody under the Child Custody Act when the probate court has exercised and retains jurisdiction, this circuit court went further. It held, even after declaring the probate court orders void and thereby purportedly divesting it of jurisdiction, that the circuit court could not hear an original action under the act.\n\nWe find that the court erred in that Conclusion.\n\nWe agree with Jewell v Grand Traverse County Probate Judge, 51 Mich App 134; 214 NW2d 717 (1974) that the act does not apply when the matter of custody is in the probate court. The Court of Appeals referred with approval to Justice Edwards' Concurring opinion in Sovereign v Sovereign. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Although it was based upon the predecessor \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e to the Child Custody Act, it is apposite in its analysis of jurisdiction.\n\n\"ince the turn of the century, Michigan has been one of the leading states in the development of a court with specialized powers and functions in relation to dependent, neglected and delinquent children. * * *\n\n\"Further, as authorized by the Constitution, detailed legislation spelling out the jurisdiction and the powers of Disposition of the probate court, juvenile division, in relation to children has been adopted. MCLA 712A.2, 712A.18; MSA 27.3178(598.2), 27.3178(598.18).\n\n\"Further, by specific statutory enactment, the circuit courts are granted appellate powers over the decisions of the probate court, juvenile division. 1948 CL 712A.22; MSA 27.3178(598.22).\n\n\"These constitutional and statutory provisions appear to follow a popular and legislative design in the creation of a division of the probate court with special jurisdiction, special powers of Disposition, and specialized staffing as to children's problems in dependency and delinquency cases.\n\n\"We feel the revival of the use by the circuit court in chancery of broad powers in children's cases concurrent with the constitutional and statutory powers of the probate court, juvenile division, would be catastrophic for the children for whom this state has plainly intended to create these specialized services. The confusion and delay attendant upon the exercise of original jurisdiction by both circuit and probate courts in dependency and delinquency cases would confound court administration and undoubtedly result in lengthened and more damaging detention of children pending Disposition.\n\n\"Fortunately, the constitutional and statutory provisions which we have cited, by creating specific exceptions to the general jurisdiction of the circuit courts, prohibit any such undesirable result.\"\n\nHowever, here the court ruled that although the probate court actions were void, the circuit court could not assume jurisdiction over the parent-third party dispute. If the probate court has no jurisdiction, the Child Custody Act can be invoked.\n\nSimilarly, if the Federal court declares the probate court proceedings void, an action under the Child Custody Act would be valid.\n\nThe \"Fitness Test\"\n\nInherent in this case and in cases arising from statutes comparable to our Child Custody Act is a question raised in the courts of several states:\n\nTo overcome the presumption that it is in the best interest of a child to be placed in the custody of a parent, what is meant by the standard of \"clear and convincing evidence\"?\n\nAlthough this Court has not spoken on the issue within the confines of the act, there has been a long-enduring conflict of opinion in general regarding whether the \"best interests of a child\" must give way to the test of parental \"fitness\". In other words, must the presumption be overcome solely by a finding that the parent is \"unfit\"? In this case, we do not know what proofs would be forthcoming as to Dahlari's present \"fitness\", so this analysis is largely general in nature.\n\nThere has been a split of opinion and close votes accompanied by excellent analyses on both sides of the question. As Justice Black said in his Dissent to In re Ernst: \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\n\"e do have 'two irreconcilable lines of cases' -- pure shuttlecock law that is -- for whimsical application to child custody controversies.\"\n\nThe argument most frequently used for the \"fitness\" test is that such a consideration might result in a comparison of wealth, the respective luxury of homes and, in short, become solely a contest of economics. Indeed, this would become a tragedy for it is common knowledge that some wealthy homes are not healthy homes for children and would not serve their best interests.\n\nIt is an effective technique to argue extremes, so the opposite position could be, for example, that third-party custody could turn upon the fact that the parent lives in a home without plumbing.\n\nThe answer to both extremes is that neither condition in itself would be determinative. Many well-balanced, successful people have come from both financially rich and poor homes. Neither condition would be a core factor.\n\nThe argument of comparative wealth sidetracks the real issue and even has the \"red herring\" effect of diverting attention from the most important factors to be considered.\n\nTo return to this case, it is uncontroverted that the Does are \"faultless\". Their involvement came after the two phases of the neglect hearings were completed. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nMaria also is faultless. It can safely be said that she does not know what has occurred and it makes no difference to her who is at fault -- yet, it is her life which is at stake. She is a small girl whose opportunity to grow into full enjoyment of those \"unalienable rights\" we hold so dear lies in our hands.\n\nWe have been experiencing an activist era of judicial history. Former \"privileges\" have evolved into \"rights\". Some formerly unrecognized \"rights\" have been afforded constitutional status. In most of these altered perceptions of what is fair and who is entitled to what right, if it is a right, the common denominator is the right of the individual to equal opportunity to the American birthright of \"life, liberty and the pursuit of happiness\". Basic to this goal is first the right to be recognized as an individual.\n\nIt is timely and fitting to reconsider the status of a child and many legal scholars are engaged in the process. Judges are not magicians that they can guarantee the perfect life to a child in this imperfect world, but so far as we allow, they can protect children's rights to the utmost of their abilities. The question is what the statutes as interpreted by this Court will allow them to do.\n\nIn Bahr v Bahr, 60 Mich App 354, 359; 230 NW2d 430 (1975), Judge Walsh makes an excellent analysis of \"the best interests of the child\" when in conflict with the presumption in favor of the parent as it appears in the act. The Discussion regarding the effect of the act upon caselaw existing at the time of enactment is pertinent:\n\n\"Prior to the Child Custody Act of 1970, in a dispute between a parent and a third party or agency the best interests of the child were deemed to be served by awarding custody to the parent unless it could be affirmatively proven that the parent was unfit to have custody or had neglected or abandoned the child. Furthermore the court could not indulge in a comparison between the parental home and the proposed alternative. In re Ernst, 373 Mich 337; 129 NW2d 430 (1964), Rincon v Rincon, 29 Mich App 150; 185 NW2d 195 (1970). Neither of these formerly accepted principles was incorporated within the comprehensive provisions of the Child Custody Act. Since the Legislature is presumed to be aware of the long-standing judicial precedent affecting an area in which an exhaustive codification of the law is undertaken and enacted, we must conclude the omission was intentional. See Alexander v Liquor Control Commission, 35 Mich App 686, 688; 192 NW2d 505 (1971), Jeruzal v Wayne County Drain Commissioner, 350 Mich 527, 534; 87 NW2d 122 (1957).\"\n\nWe find the Child Custody Act to be consistent with contemporary recognition of the inherent rights of children as citizens \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e and would not interpret into oblivion the avowed legislative intent.\n\nIt has been observed in Note, Custody of Minor Children, 7 J Family L 81, 84, 85 (1967) that:\n\n\"The traditional view, now existing in only a minority of jurisdictions, holds that the parent, unless positively shown to be unfit, is prima facie entitled to custody of a minor child. The third party has the burden of proving the parent's lack of fitness.\"\n\nAfter noting the departure from English and early American common law whereby children (and wives) were viewed as the father's property, it was observed:\n\n\"The predominate guideline in modern custody cases seems to be 'best interest' or 'welfare of the child' test, under which custody will be awarded to the party who, in the court's judgment, will best promote the child's future welfare.\"\n\nThe observation is consistent with our later passage of the Child Custody Act which superseded such previously contrary opinions as presented in In re Ernst and that line of cases.\n\nOther states have faced this question with thoughtful analyses and determinations that the presumption in favor of the parent is not conclusive absent a finding of unfitness.\n\nThe Supreme Court of Illinois, in People ex rel Edwards v Livingston, \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e affirmed third-party custody \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e saying:\n\n\"The best interest of the child is the standard and it is not necessary that the natural parent be found unfit or be found to have legally forfeited his rights to custody, if it is in the best interest of the child that he be placed in the custody of someone other than the natural parent. See Giacopelli v The Florence Crittenton Home, 16 Ill 2d 556 [158 NE2d 613 (1959)]; 67 CJS, Parent and Child § 11; 27 Am Jur, Infants § 108; and also see Halstead v Halstead, 259 Iowa 526, 144 NW2d 861 [1966].\"\n\nThe Supreme Court of Colorado in Coulter v Coulter, 141 Colo 237, 241; 347 P2d 492 (1959), had occasion to review a third-party custody case. In speaking of parental rights, it said of a previous case: \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\n\"e do not interpret it as requiring that custody be awarded to the parent or parents merely because the evidence shows fitness and ability to care for the child. The controlling factor, recognized and applied in all of these cases, and confirmed in the Wilson case, is the welfare of the child.\"\n\nAgain in Root v Allen, 151 Colo 311, 316, 318; 377 P2d 117 (1962), the same Court awarded custody to a stepfather over the claims of the father. The following question was answered \"in the negative\":\n\n\"Is the natural father, once he shows beyond doubt that he is a fit and proper person to have custody of his child, in law entitled to restoration of the child to him even though the court in its findings, amply supported by the evidence, determines that to give him custody would not be in the best interests of the child?\"\n\nThat Court said:\n\n\"It will thus be seen that this court has held that the presumption that a child's welfare is best served through custody of the natural parent is a rebuttable one, and that where the evidence establishes that the welfare of the child will not be promoted by the parent's custody, such custody will not be granted.\"\n\nIowa also was one of the leading states in considering the legal status of children. In Painter v Bannister, \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e the Supreme Court of Iowa found that a fit person may be deprived of the custody of his child if the best interests of the child will be served by those who have furnished him with a happy and stable home. Halstead v Halstead \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e refined the concept and awarded the child to the grandparents on the basis of \"best interests of the child\", although the mother was not found unfit.\n\nIn a 1973 case from the Family Court, City of New York, Kings County, the court noted that there was no allegation that the natural mother was unfit. It commented in denying the mother's application for custody in favor of a third party In the Matter of Confessora B, 75 Misc 2d 576, 582; 348 NYS2d 21 (Fam Ct, 1973):\n\n\"Custody decisions are always very difficult, involving as they almost always do, one of the deepest feelings persons can experience * * *. What eases the burden a little is the conviction that one is acting in the best interests of the child, the most innocent and helpless participant of all, and the hope that the adults will accept it in this light and react wisely and maturely to the future benefit of the youngster.\"\n\nThe Judge \"unreservedly\" concurred in the opinion of the court in In the Matter of Catherine S \u0026 Darlene S, 74 Misc 2d 154, 159; 347 NYS2d 470 (Fam Ct, 1973). \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nAn excellent analysis of the problem appears in the opinion of Judge Zukerman. He noted that New York had been more oriented toward the principle of \"parental right\" (that natural parents should be deprived of custody only where unfit), but said in awarding custody to a third party:\n\n\"ther jurisdictions, increasing in number, have already recognized and now emphasize that it is 'the best interests of the child' which are determinative. The latter approach has been viewed by many commentators to be 'clearly in accord with the philosophy and social interests predominate in the twentieth century.' Foster \u0026 Freed, Child Custody, 39 NYU L Rev 423 (1964); Custody of Minor Children, 7 Family L J 81 (1967).\"\n\nHe also noted that as early as 1925, Judge Cardozo had said: \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\n\"The chancellor in exercising his jurisdiction * * * does not proceed upon the theory that the petitioner, whether father or mother, has a cause of action against the other or indeed against any one. He acts as parens patriae to do what is best for the interest of the child. * * * Equity does not concern itself with such disputes [over custody] in their relation to the disputants. Its concern is for the child.\"\n\nThe Family Court also said:\n\n\"All too often there is a conclusive presumption that the child's welfare requires that custody be awarded to the 'fit' natural parent as against a nonparent. Such arbitrary rules can be no substitute for careful inquiry and a thorough investigation of the facts. It is often the case that the issue of a party's fitness obscures the paramount issue of the child's welfare.\" 74 Misc 2d 161-162.\n\nIn granting custody of a child to third parties, with permission to proceed towards adoption, the Alabama Court of Civil Appeals said in Borsdorf v Mills, 49 Ala App 658, 661, 662; 275 So 2d 338 (1973):\n\n\"t is equally well established that the prima facie right of the parent [to custody] is not an absolute one but must yield to the pole star of all cases involving the custody of children, that is, the welfare of the child.\"\n\nThe Court concluded:\n\n\"Though there was a lack of evidence as to the present unfitness of the appellant to have custody of the child Roger, the evidence and reasonable inferences therefrom that the child knows only the Mills as his parents, loves and is loved by them, and is assured of a future in their home, is more than sufficient to support the decree of the court that his welfare will be best served in their custody. We affirm that decree.\"\n\nThe Supreme Court of Washington also has addressed the conflict. In In the Matter of the Guardianship of Dawn Palmer, 81 Wash 2d 604, 607; 503 P2d 464 (1972), \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e the Court said:\n\n\"In particular, this court has repeatedly held in child custody cases the best interest and welfare of the children are the primary and controlling considerations. Munoz v. Munoz, 79 Wash.2d 810, 489 P.2d 1133 (1971). If this were not the rule, there is a danger that insufficient weight will be given to the welfare of children and that they will be regarded as a chattel to be given to the winner of an adversary proceeding.\"\n\nMany learned treatises have been written regarding \"parental rights\" in third party custody disputes. Perhaps the one most widely quoted in case law and other writings appears at Note, Alternatives to \"Parental Right\" in Child Custody Disputes Involving Third Parties, 73 Yale L J 151, 156 (1963). It discusses the extensive works of several noted psychoanalysts such as Erickson, Bowlby, and Anna Freud as well as the historical development of the concept of a child as a person:\n\n\"Most recent decisions seem to reflect this operative dominance of the child's interest and welfare. Thus, Judges are not only vocally conscious of their special responsibility to the child, but also express this concern more concretely: by refusing to honor biological relationship when the natural parents seem less capable of providing for the child's well-being than the third party.\"\n\nThe review speaks to results of separation from psychological parents:\n\n\"The trauma of separating a child from the custody of an adult with whom an affection-relationship exists may be psychologically equivalent in its detriment to the orphaning of that child. While, in all probability, the child will eventually form a new affection-relationship, this tie may be of lesser quality and strength. And a series of separations might have a cumulative effect on the child's ability to form new affection-relationships. Where a third party has custody of a child, the child will probably have already undergone at least one separation trauma. If a new affection-relationship has been formed with the third party custodian, court enforcement of a further change in custody may, by effecting this new separation, markedly diminish the child's willingness or ability to form new relationships, and thus substantially curb his development. And to the extent that such changes may impede the resolution of conflicts arising from the child's present state of development, their effects may be all the more serious.\"\n\nThe entire review of child custody is pertinent to this case.\n\nAlso pertinent is an article by Henry H. Foster, Jr., Adoption and Child Custody; Best Interests of the Child?, 22 Buff L Rev 1, 12-13 (1972). \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nAlthough the article speaks to revocation of adoption consent, the following is pertinent:\n\n\"Recent decisions in other states indicate an increasing acceptance of generally recognized theories of child development. It has been recognized that the psychological parent-child relationship is more important than biological parenthood and that true mother love entails the care and nurture of a child, rather than an empty sentiment. Ordinarily, the best psychological interests of a child require continuity and consistency in the parent-child relationship. Removing a child from the warmth and security of the place he knows as home should be done only in the most compelling circumstances.\"\n\nFor an excellent chronological history of the dichotomy of judicial thought in Michigan regarding the \"best interests of the child\" see Justice Black's Dissent in In re Ernst, supra.\n\nFamily\n\nA strong argument is made for the preservation of \"family\" ties and we must agree that they are a strong factor to be weighed. If a child has put down roots in the natural family, Judges have and will continue to leave children with some very \"bad\" parents if, on balance, the children are more likely to be harmed by removal, even if only temporarily.\n\nHere it could be argued that Maria's family is the Doe family where she has lived since 10-1/2 months old. She has brothers/sisters, we are told, and relatives. At this juncture of the adoption, she must have a name other than Maria Weldon and a new identity.\n\nThe fact that a girl can have intercourse and thereafter produce a child does not necessarily mean that she has the emotional ability and stability to raise that child, regardless of what subjective judgment may be made as to \"fitness\".\n\nPreservation of the family unit is subject to interpretation other than that based solely on the biological family. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nWe recognize two protected rights -- that of a parent to her child and that of the child as a separate and distinct entity to those unalienable rights of American citizenship.\n\nUnder Michigan law, the child's rights entail consideration of a rebuttable presumption that his or her best interests are served by custody of a natural parent. That presumption does not turn solely on the question of fitness. In other words, fitness is not an impermeable wall to keep out all other considerations. That isolated factor is not determinative, but may be one of many factors employed by a Judge. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nThere is, of course, the danger of self-serving testimony on behalf of the various contestants for the life of a child. Therefore, we would encourage independent investigation, including independent psychiatric evaluation of the parties and the child and such other inquiries as are consistent with due process.\n\nIn the end, the Judge has perhaps the most difficult decision of all to make -- where will the child have the best opportunity for healthy physical, emotional, intellectual and spiritual growth, the best opportunity to develop to full potential?\n\nSomeone must be hurt by the ultimate decision, but it should not be the child.\n\nIV. Rights of Maria\n\nAlthough we see ways in which the subject hearing could have been improved, we also see what we perceive to have been counterbalancing factors, some of which are as follow:\n\n(1) No objections were heard from trial counsel and, in effect, all of their requests were honored.\n\n(2) The failure of Dahlari to return home during the period of advisement was known by all.\n\n(3) The statutory times for the right of appeal and for rehearing had passed.\n\n(4) By the parent's failure to apply for delayed appeal within six months \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e there arises a legal Conclusion that the rights of the child prevail over the rights of the parent.\n\nPrior to January 1, 1971, an order of the juvenile court was subject to the same rules of delayed appeal as any other order. In recognition of the importance of time and stability in a juvenile proceeding, the Legislature set a maximum time limit. Beyond that limit there is no jurisdiction for the circuit court to hear an appeal.\n\n(5) The Does, under color of a valid court order unchallenged during the statutory periods, proceeded through the steps of adoption up to what remained of the observation period and the subsequent confirmation.\n\nWhatever weight may be given to these factors in determining what is due to Dahlari, we must also place on the scales of Justice the rights of the \"prize\" or \"pawn\" in this case, Maria.\n\nThese proceedings are not against Maria, although her life will depend upon the final judicial pronouncement.\n\nPlaintiffs' appendix contains a report by Thomas Trocchio, clinical psychologist of Blue Water Mental Health and Child Guidance Clinic, as of November 16, 1973. He analyzes his observations and concludes:\n\n\"In summary then is seen as a well adjusted normally developed youngster. Those skills -- i.e., coordination, perceptive , which at this age are indicative of intellectual level are normal. Sense of security and trust in the environment also appear to be normal.\n\n\"The relationship, as observed, between parent and child too, appear to be warm and mutually satisfying. It would be then, if any trauma did exist as a result of [Maria's] foster placement and adoption, that at least now, there appears little sign of such.\" (\"Parent\" refers to the Does.)\n\nMr. Trocchio prefaced his personal observations of the child's interactions with him outside the presence of her adoptive parents, her \"purposeful and goal related\" play and others by observing in part:\n\n\"To make a valid predictive statement for any individual case regarding the effects of taking a child from a home where good adjustment and strong relationships have developed is difficult. However, from our knowledge and experience general probabilities can be discussed.\n\n\"Early experiences are significant in the development of emotional and intellectual functioning. When inconsistencies and uprooting persist over the early age years a sense of mistrust and insecurity tend to predominate the childs attitude. When strong emotional ties are severed, the child, out of egocentricity, experience guilt and blames himself, and the resultant view of self becomes negative. The ability to invest himself in any person is blocked. The experience of loss and worthlessness manifests itself in frustration. Often in these cases basic needs are not met, and as such the child is often unable to develop along the lines of emotional maturity.\n\n\"It is often in adolescense that we see the results of such deprivation and/or separations. These are typified by either of two behavior patterns. One being the acting out, or impulsive characteristic, and two, the withdrawn depressed and often detached trait. Both of these personality patterns are unable to develop close intimate ties, and find it difficult to utilize energies toward 'acceptable' goals. Both of these personality patterns have at varying degrees misconceptions of the environment and of themselves which may lead to the attitude of 'not fitting in' and often results in an attempt to gain recognition in atypical ways. Both of these personality patterns, too possess a great deal of anger which may be directed toward the society or toward the self. The former are those who come in contact with the court, and the latter are those who go through life seeking self punishment.\n\n\"It is my belief that great consideration be given in determining and weighing the consequences of any action that continues or has the possibility of fostering uprooting and severing of strong emotional bonds of a young child. It is too often that a childs rights are denied in lieu of what our adult society views as parental rights.\"\n\nThe fact that Maria was said to have engaged in solo play without responding to stimuli around when she first came to the Does and that this behavior had changed indicated a \"substantial gain in her growth resulting from a stable consistent living pattern\".\n\nWe do not weigh the Does against the natural mother in the contest of the original neglect hearing. They were not on the scene at the original hearings and we are long past that time.\n\nWe have discussed the concept of \"the best interests of the child\" as a fundamental consideration. The rights of Maria must be the primary consideration in this matter. We view the proceedings as a whole and in the posture of the case at the time of hearing this appeal. We conclude that the original order of the court should stand and that the adoption should go forth in the usual manner prescribed.\n\nConclusion\n\nWe find that the circuit court erred in basing the order upon the doctrine of res judicata (or of full faith and credit as the case stood at the time of rendering the opinion).\n\nWe also perceive a factual situation surrounding the challenged procedure which is different from that which was the basis of the Federal court opinion and which has been relied upon by the circuit court and the Court of Appeals.\n\nThis opinion reflects our Conclusions as to the termination proceedings which constitute the foundation for the adoption proceedings, but the effectiveness of such must depend upon the Conclusions of the Federal courts as to the Federal law involved.\n\nThe use of equity as a device to impose direct Federal review jurisdiction over state termination of parental rights poses some serious problems. The state appellate courts may not have the opportunity to correct state court mistakes, to interpret state law and court rules or carry out state policies. The door is opened to incursions of possible self-serving remembrances of past days in court and to \"bootstrapping\" by new testimony. It is to be devoutly hoped either that the Federal courts will revoke this new devise as it applies to termination of parental rights or severely limit its use.\n\nNo adoption is safe under this concept of Federal intervention.\n\nHowever, if the probate court eventually is found by final judgment of the Federal courts to have no further jurisdiction in this matter, the circuit court may then consider the question of third-party custody as it relates to the Does under the Child Custody Act.\n\nWe would remand to the circuit court for action consistent with this opinion.\n\nAddendum:\n\nThis unusual manner of replying to Justice Levin's opinion is born of extraordinary circumstances. This is written on Friday before court conferences (August 20, 1976) commencing Monday, during which time this case is to be concluded. Like Maria, we have been caught between state and Federal proceedings. Most recently, respondent Dahlari has filed a petition for a writ of in Federal district court and Monroe County probate court has filed its petition for writ of certiorari in the United States Supreme Court after having been granted an extension of time. Judge Pratt has adjourned the hearing on the petition for writ of until Wednesday, August 25. We have obligated ourselves to come to a decision by that date. Time is of the essence, precluding a thorough rewriting of the original opinion. Therefore, we take this means to reply to Justice Levin's opinion as it now reads and insofar as the opinion above does not already speak to important matters.\n\nThe observations and arguments below follow, section by section, Justice Levin's opinion.\n\nAlthough we dispute the interpretation of facts and the Conclusions of the opening synopsis, the pertinent divergences not already approached in the opinion above will be set forth as they are extrapolated by Justice Levin.\n\nI\n\nIn this section and those following, substantive arguments not a proper part of this appeal (are interposed). The posture of the case must be remembered because there have been repeated efforts to bring in extraneous matters and to supplement the record.\n\nThis is an appeal from a writ of superintending control and a denial of Child Custody Act application. The writ was based on the finding that an order of Judge Pratt (later reversed) was res judicata. That order and the later order in equity (now also on appeal) were based on lack of procedural due process in several respects. We are not rehearing the facts in the juvenile court case but looking at the process by which the case was heard.\n\nThis is an important distinction because to open up substantive matters on collateral attack and especially in equity would be to place every adoption in jeopardy. After appeal periods have passed and a child either is adopted or is in the final process of adoption (as here), any parent could collaterally file a petition for a writ of or for equitable Disposition as here (although this is most unusual), declare the court erred in finding dependency/neglect and open up the whole matter, including additional testimony.\n\nNo adopted child or adoptive parent could rest secure.\n\nWe dispute the claim about the absence of evidence at the time Maria was ordered into court custody. The court was informed that the baby was without proper custody or guardianship; that Dahlari was unwed and in shelter care for reasons relevant to the matter; that the father was unknown; that no one was legally responsible for Maria's care at that time; that Dahlari's parental home was divided and in a chaotic and peripatetic situation; that the baby had not been examined since leaving the hospital after birth, particularly to discover if she carried her mother's disease, but also for immunization.\n\nMore fundamentally, the reference to the testimony is irrelevant and not a part of this case. Therefore, we decline to parade further Dahlari's and her family's problems as revealed by the files and records, although we must object to the accuracy of the allegations even if appropriate.\n\nJustice Levin alleges a failure to enter an order such as provided for in § 12 (also not a part of Judge Pratt's finding upon which the circuit court order was based, but a short reply is made). Such an order is usually employed to bring parties into court so the Judge can inquire as to probable jurisdiction, after which the filing of a petition may or may not be authorized and a child possibly detained. The parties may, however, come voluntarily or be available to the court.\n\nHere, Judge Seitz examined the parties personally. He did not have to order them in. He authorized the filing of a petition and it was filed the same day. An order also entered to bring Maria into court custody. However, it was much later and after an Ohio hearing, that Maria actually was taken into custody and an examination made. The official hearing was promptly noticed. The purposes of the preliminary hearing were served.\n\nAgain, this was not a defect found by Judge Pratt or the circuit court, but is argued nevertheless by respondent.\n\nTowards better understanding, it must be retained in mind that the juvenile court is not a criminal court. Historically, it was carved out of the chancery court and has continuously been given exclusive jurisdiction over delinquents and dependents (Const 1963, art 6, § 15). For this reason alone, a circuit court sitting in equity has no jurisdiction while a child is under juvenile court jurisdiction. Nor should a suit in equity or be a substitute for an appeal of the probate court order. Because of the differences in circumstances and those being served, procedures are different as they must be in order to meet everyday crises. Some which require immediate removal of children from the home.\n\nFor instance, a social worker or police officer is able to bring the child(ren) and at least one parent immediately to court with no prior order, or the parties can be brought in voluntarily by telephone to determine preliminarily whether the court has probable jurisdiction and what should be done at that time, if anything. There is then no need for the formal order directing them to appear. They are already there. If the Judge then authorizes the filing of a formal petition, a formal hearing is noticed and heard according to statute and court rule. The immediate objective of the preliminary hearing is to have the parties in court whether voluntarily or by force of court order.\n\nCiting a criminal case decided subsequent to this proceeding, Justice Levin holds fatal the \"fact\" that no formal closing arguments were made, although no requests or objections were made at the adjudication hearing! There were final statements requested and made at the final (disposition) hearing. A Discussion took place between counsel and judge at the adjudication hearing.\n\nAgain, we emphasize that this is not a criminal case. The procedures so far have been different and statutorily are provided with a degree of informality. We suspect that many hearings end in a Discussion in search of a solution of the matter. Formal statements were made here, however, at the completion of the case.\n\nIf it is the Conclusion of the Court that strict rules be applied in D/N cases, we should at least give prior notice as to what they are (e.g., court rule). To declare all similar cases reversible because of no formalized final argument at adjudication, requested or not, is again to threaten many adoptions.\n\nIn addition to further substantive arguments which we find are incomplete but, as stated, not relevant, Justice Levin's opinion also alleges that the termination was based on evidence procured after the final hearing, so absence of another Disposition hearing was fatal.\n\nThe final Disposition hearing was over and an order could have entered instead of taken under advisement. Only the matters then before the court were relevant and could be considered in the Disposition. Taking a matter under advisement is common to any court and to date there has been no mandate to call the parties back for another hearing before entering the order. It is quite possible, even probable, that Judge Seitz hoped for some substantial change of circumstances after completion of the case, but changes made afterwards did not change the sufficiency of the previous evidence. However, again Dahlari had absented herself from home for over a week and the Ohio court where the family resided and where Dahlari had a considerable record, refused supervision -- so nothing new was to be added if the case was opened. So the order entered.\n\nAlthough part I contains a number of what we consider to be unfounded spurious (as well as irrelevant) statements, we will not dissect them one by one. However, an example is, \"No evidence was offered that Maria was in Michigan and not already in Ohio when the petition was filed\". At the initial inquiry, Mrs. Weldon testified that the baby was in Michigan and the Judge then and there authorized the filing of a petition, which was promptly filed the same day. Maria's mother also was in Michigan at all times. There was no denial of jurisdiction and judge Pratt did not find it lacking. The effort to employ at this point in the proceedings as an attack on jurisdiction the fact that Dahlari's mother, supposedly later the same day, absconded to Ohio with Maria rather than submit her for physical examination is inappropriate.\n\nII and III\n\nThe heart of part II is the argument in support of Federal court jurisdiction in the first place. Because the issue was (and is) on appeal in Federal courts, we did not address the issue in the opinion above and will do so only briefly in important part here.\n\n1. Judge Pratt relies heavily upon Younger v Harris, 401 U.S. 37; 91 S Ct 746; 27 L Ed 2d 669 (1971), and its progeny for a finding that in this termination of parental rights case, the doctrine of judicial immunity (28 USC 2283) \"does not bar civil rights actions against Judges or other personnel such as prosecutors for equitable or injunctive relief\" under 42 USC 1983.\n\nYounger and the other like cases cited involved criminal matters. The United States Supreme Court decided that the principles of equity, comity and federalism allow a Federal court to issue an injunction in only a narrow class of cases. Injunctions were not allowed in those cases. However, there has been greater reluctance to intervene in criminal than in civil proceedings, the offense to state interests usually being less in civil cases where the state may not be a party. (See Justice Stewart's Concurring opinion in Younger.)\n\nHere, there is an undeniable state interest and the state is a party. Under the Younger concept, the anti-injunction statute should apply.\n\nIf not, the effect on adoptions is apparent and most serious. Parties could obtain Federal jurisdiction collaterally in equity and add testimony (possibly only self-serving). The Federal courts could order state judges (if not courts -- but what is the difference?) either directly or indirectly to take specific action or make certain findings. The state's power to exercise its authority and correct its own mistakes, if any, would be undermined. The children would be left in limbo and no adoption secure.\n\nWe appreciate Judge Pratt's restraint in his latter opinion and order in directing no further order to state Judges and others despite the fact that he found the court had equitable jurisdiction under the civil rights act. The declaratory judgment, if upheld, would have the same practical result, however, since jurisdiction was retained. In the meanwhile, we acknowledge respectfully the abstention of any direct intervention while the state courts grind to Conclusion.\n\n2. In writing of Federal court action, Justice Levin's opinion in parts II and III contends that, although not named as parties and not participating, the Does were \"deemed represented\" because they were \"persons for whose benefit the defense of the Federal court litigation was conducted\". Therefore, it would hold that evidence by the Does, in addition to that in the Federal district court, would have been necessary in this Court.\n\nIt must be remembered that defendant court and its personnel were initially sued for money damages as well as other equitable relief against the court under the civil rights act. The suit also asked for the release of Dahlari from State Department of Social Services supervision. Further, the Does were in no way involved in the initial proceedings nor in the initial attack in the Federal court. The parties of the two suits also are different and the Does' action encompasses matters of state law, procedure and policy.\n\nThere is not sufficient commonality of interest to warrant the Conclusion that the Does are deemed to have been represented in the Federal district court or that that action would preclude reliance on the probate court records and files without additional evidence.\n\nJudge Pratt's declaratory judgment does not settle the question of state law. He noted that as state court remedies had not been exhausted he lacked the jurisdiction to grant a type of relief. Although claiming jurisdiction to rescind the termination of parental rights, he noted, \"it must be yet determined whether the defendants are judicially immune from suit and whether the relief is appropriate\". Whether the parties were properly in court or whether relief can be fashioned remains to be seen.\n\nAt this time, we supposedly are in the process of exhausting state remedies. We cannot exhaust them excepting by review of only the records and files of the state proceedings. To hold otherwise would render meaningless the \"exhaustion of state remedies\" concept. We would claim our right to exercise state review of the circuit court proceedings. There was no state appeal from the probate proceedings per se.\n\nIV and V\n\nThe Child Custody Act has been discussed in our opinion above. However, we emphasize the legislative intent to adopt in custody dispute the standard of \"best interests of the child\". Under the act, disputes between parents, between agencies or between third parties require no presumptions of where the best interests may lie. However, as between a parent and third party, the statute provides a rebuttable presumption that \"the best interests of the child\" lie with a parent. It can be overcome by \"clear and convincing evidence\".\n\nThe act has substituted for the often disputed \"present fitness\" of parent concept, definite criteria to be followed in determination of what is in the child's best interest, as stated above. Certainly it is not true that \"oral unfitness or promiscuity is not a ground for terminating parental rights\" if the child's best interests demand otherwise.\n\nFurther, any circuit court custody action must be brought under the Child Custody Act. MCLA 722.24; MSA 25.312(4) says in all such actions the circuit court \"shall declare the inherent rights of the child and establish the rights and duties as to custody, support and visitation of the child in accordance with this act\". MCLA 722.26; MSA 25.312(6) says the act's provisions \"being equitable in nature shall be liberally construed and applied\". Other actions such as shall not be brought \"unless it appears that the act is inadequate and ineffective to resolve the particular child custody dispute\".\n\nThese provisions argue against a restrictive interpretation of the act. They do not permit recourse to general equity jurisdiction. The act supplants general jurisdiction and gives the circuit court specific authority and specific standards to apply. It should prevail.\n\nLevin, J.\n\n(Ordinarily trial Judges are not identified by name in judicial opinions. In an effort to clarify the complex history of this litigation, the five trial Judges of three different courts involved in this matter are referred to by name in this opinion.)\n\nThe issues on this appeal relate to the efforts of an unwed mother to obtain the return of her child after the probate court terminated her parental rights and gave preliminary approval to adoption by foster parents.\n\nThe child has been in the foster parents' custody since she was 10-1/2 months old and throughout the 4 years of this litigation. No order of adoption has been entered.\n\nThe order terminating parental rights, entered September 12, 1972 by Probate Judge Harry J. Seitz, was not appealed within the six-month period for delayed appeals1a nor was a rehearing sought within the three-month rehearing period.2a\n\nOn May 12, 1973, the mother commenced an action in the United States District Court claiming that her civil rights had been violated. Judge Philip Pratt declared that the proceedings resulting in termination of her parental rights violated the Due Process Clause and were void. He remanded the matter to the probate court for a hearing.\n\nProbate Judge Philip H. Mitchell, assigned by the State Court Administrator, conducted a hearing in October, 1973 and found that \"no evidence\" of neglect had been offered \"sufficient to warrant an assumption of jurisdiction\" by the probate court, and dismissed the petition on which the termination order had been based. Judge Mitchell did not enter an order directing Disposition of the child. The matter was referred back to Judge Pratt who entered a judgment reflecting his earlier declaration that the proceedings resulting in termination of the mother's parental rights were void.\n\nThe foster parents then commenced this action in the circuit court seeking an order of superintending control setting aside Judge Mitchell's findings on the ground that Judge Pratt was without authority to order the probate court to hold a hearing. The mother responded with a petition in this action seeking a writ of directing that the child be returned to her. The foster parents filed a petition under the Child Custody Act.\n\nCircuit Judge James J. Kelley, relying on Judge Pratt's declaration and findings, ordered that the child be returned to the mother. Judge Kelley, stating that the foster parents had come into possession of the child through proceedings that had been judicially declared void, refused to consider the child's \"best interests\" under the Child Custody Act.\n\nThe judgment entered by Judge Pratt was reversed by the United States Court of Appeals for the Sixth Circuit on the ground that a United States District Court does not have the authority to review probate court proceedings or to direct a probate court to hold a hearing. The cause was remanded to Judge Pratt to determine if the action could be maintained against the individual defendants and appropriate relief could be fashioned. On remand, Judge Pratt reiterated in a declaratory judgment that the parental rights termination proceedings violated the Due Process Clause. He did not direct that custody of the child be returned to the mother but retained jurisdiction to provide equitable relief if necessary upon Conclusion of state court litigation.\n\nAt this juncture, the Michigan Court of Appeals denied leave to appeal from the circuit court. This Court granted leave to appeal.\n\nAfter argument and submission in this Court, the United States Court of Appeals for the Sixth Circuit affirmed the declaratory judgment entered by Judge Pratt. An extension of time to file with the United States Supreme Court a petition for writ of certiorari to the Sixth Circuit was obtained.\n\nIt is apparent that the foster parents obtained the relief they sought in commencing this action when the Sixth Circuit, in the first appeal to that Court, held that Judge Pratt was without authority to direct the holding of a hearing by the probate court.\n\nWe adopt the determination of the Federal courts that the requirements of the Due Process Clause were not observed in the proceedings resulting in termination of parental rights. There is no evidence in the proceedings conducted by Judge Seitz or in subsequent proceedings that the child was neglected or that there was any other statutory basis for termination of parental rights.\n\nThe Child Custody Act does not require that the best interests of the child shall control where the dispute is between a parent and a third party. Under the Child Custody Act and apart from it the circuit court has the power to determine the rights and duties of a child, the parents and of other persons having custody of a child.\n\nA parent able to provide care and support has the right to custody unless parental rights are terminated or modified or the child is abandoned. A child has the right to be protected from a transfer of custody that results in the destruction of the child's ability to grow and mature into a healthy and whole person.\n\nThe mother is now nearly 20 years old, the child nearly 5. The child has been in the home of the foster parents for four years. On remand, the circuit court should determine whether the mother can provide care and support and, if she can, in the exercise of its equitable powers the court shall frame a decree providing for supervision of the transfer of custody to the mother and during a reasonable period following transfer and reserving to the court the power to require remedial measures if it should appear that the transfer of custody adversely affects the child's ability to grow to a healthy maturity.\n\nI\n\nThe child, named Maria Sophia, was born to Dahlari Weldon on October 18, 1971. Dahlari was then 14 years old. She had been living with her parents in Bowling Green, Ohio. During the pregnancy her parents were estranged and she moved with her mother, Norma Weldon, to Monroe County, Michigan, where the baby was born. The baby was taken to her mother's home.\n\nOn June 6, 1972, Norma Weldon reported to juvenile authorities that Dahlari was missing from home. She had earlier been adjudicated a delinquent child and a Disposition hearing had been set for June 9, 1972.3a\n\nDahlari appeared before the time set for the hearing and was taken into custody. She was in custody when the hearings resulting in termination of her parental rights were held. After the second hearing on August 11, she was released to her father. On August 29 she was again taken into custody. She was in custody when her parental rights were terminated on September 12. She was released in the summer of 1973, after the Federal court action was commenced.\n\nAt the June 9 hearing Judge Seitz inquired about the baby. Norma Weldon said Maria was in Monroe with a sitter and that she was well taken care of and not neglected. Judge Seitz responded that Maria was \"without a competent parent\", \"the child of an unwed mother without adequate means of support\" and he ordered Norma to produce Maria for a medical examination.\n\nNorma did not produce Maria and returned with her to Bowling Green, Ohio.\n\nThe statute authorizes the probate court to take jurisdiction of a neglected child, of a child subjected to other described deprivations and of a child \"whose mother is unmarried and without adequate provision for care and support\".4a\n\nWhen Judge Seitz spoke on June 9 no evidence had been offered regarding Maria's care and support or the means available to Dahlari to provide for her care and support. At no subsequent hearing was any evidence offered that Maria had been neglected. At subsequent hearings evidence was offered that Dahlari's father had provided support and was able and willing to continue to do so.\n\nDahlari's personal impecuniosity is not determinative. Some mothers have their own financial resources. Many, however, are dependent on others, e.g., their husbands, the child's father, their parents or public welfare (ADC), for the financial support of their children.\n\nMost parents raise their children themselves. Some parents, however, because of illness, incarceration, employment or other reason, entrust the care of their children for extended periods of time to others. This they may do without interference by the state as long as the child is adequately cared for. \"Clearly it is not the law that before a child can be placed by a parent in temporary custody of a relative permission must be first obtained from the court.\" Diernfeld v People, 137 Colo 238, 242-243; 323 P2d 628, 631 (1958) (emphasis by the Court).5a There is no evidence that Maria's grandmother, Norma Weldon, did not adequately care for Maria during the periods Dahlari was away from home.\n\nWhen Judge Seitz spoke on June 9 no petition had been filed respecting Maria. Later that day, a petition was filed by a youth officer stating that Maria was \"without legal home or guardian\" because her father was unknown and her mother had been committed to the county shelter home. The statute does not in those terms vest the probate court with jurisdiction of a child.6a\n\nJudge Seitz's oral order requiring Maria's production for a physical examination before any petition regarding Maria had been filed with the court was premature. The statute provides: \"After a petition shall have been filed and after such further investigation as the court may direct, in the course of which the court may order the child to be examined by a physician, dentist, psychologist or psychiatrist\", the court may order the person who has custody or control of the child to appear personally and bring the child before the court.7a Judge Seitz did not enter an order in accordance with this section of the statute.\n\nJudge Seitz arranged with the aid of Ohio authorities to obtain physical possession of Maria and she was placed in foster care. A pediatrician examined her and found her to be in good health. His report did not state any sign of abuse.8a\n\nNo evidence was offered that Maria was in Michigan and not already in Ohio -- the permanent home of the Weldon family -- when the youth officer filed the petition with the probate court and judge Seitz authorized action on the petition. The statute authorizes the probate court to take jurisdiction in proceedings concerning a child \"found within the county\".9a\n\nThe statute permits the court to detain a child pending hearing, among other circumstances, when \"home conditions make immediate removal necessary\".10a No showing was made that the home conditions warranted Maria's detention pending hearing. At none of the hearings following Maria's foster care placement was such a showing made. Nevertheless, the probate court kept Maria in foster care from the time it first obtained physical possession of her. During the following three-month period, Maria was moved twice and was cared for by three foster parents. The probate court and foster parents designated by it have had custody of Maria since June 15, 1972.\n\nDahlari was notified that a hearing would be conducted on the neglect petition and that the result could be termination of her parental rights. Attorneys/guardians ad litem were appointed to represent Dahlari and Maria.\n\nShirley Friess, a social worker, testified at an adjudication hearing on the neglect petition conducted July 11, 1972 that Maria was in a foster home and that, in her opinion, Dahlari's father had failed to come up with a \"plan\" for Maria's care. Frank Weldon, Dahlari's father, testified that he had supported Dahlari and Maria and would continue to do so. The social worker acknowledged that Dahlari's father was presently employed and able to support them. No evidence of inability or failure to support was offered. Four or five weeks before the hearing, Frank and Norma Weldon resumed living together in a four-bedroom duplex home in Bowling Green.\n\nNo evidence was offered at the hearing11a that Maria was neglected. This Court has held that there \"must\" be \"some testimony of neglect\" before a probate court may take jurisdiction and terminate parental rights and that termination of parental rights on a record containing \"no evidence of permanent neglect\" would represent \"a violation of due process of law\". Fritts v Krugh, 354 Mich 97, 113, 122; 92 NW2d 604 (1958).12a\n\nAt the Conclusion of the hearing Judge Seitz declared that Maria \"is without legal home or guardian, that the mother is in the custody of the Court herself as a delinquent minor without adequate means of care and support. Accordingly, the Court will enter an order finding this child to be subject to the jurisdiction of the court and neglected.\"\n\nJudge Seitz made this declaration immediately after the lawyers all stated they had no further witnesses without inquiry whether any of them wished to make an argument before he decided the issue of neglect.\n\nThis Court has held that where the Judge is the trier of fact a litigant is \"denied an essential element of his due process right to a hearing and of his right to the assistance of counsel when the trial Judge\" decides the case without allowing his lawyer to make a closing argument. People v Thomas, 390 Mich 93, 95; 210 NW2d 776 (1973).\n\nA Disposition hearing was held August 11 on the neglect petition. The social worker testified that Dahlari had always expressed a desire to have the child in her custody and had indicated a desire to live with her father but at the time this was \"not feasible by Mr. Weldon's statements to me\". Frank Weldon testified that if Judge Seitz were to award custody of Dahlari and Maria to him he would support them and see that Dahlari finished school. At the Conclusion of the hearing Judge Seitz expressed doubt concerning the appropriate Disposition:\n\n\"Considering the interests of the parties on what has been presented here this morning, I will take the matter under advisement and request that an investigation of the suitability of this home be completed together with investigation of what arrangements could be made for close supervision, inasmuch as the home is not located in this state, or in this county.\"\n\nThe face sheet of the stenographic record shows that Dahlari was present at both the adjudication and Disposition hearings. She was represented by a court-appointed attorney at the hearings. She was not called upon to testify or speak and judge Seitz did not address her at either hearing.\n\nFollowing the August 11 Disposition hearing, interim orders were entered in respect to Dahlari as a delinquent child and Maria as a neglected child.13a Dahlari was released in the custody of her father. Maria was continued in foster care.\n\nOn August 29 Dahlari was injured in a motorcycle accident and was taken to Mercy Hospital in Monroe for treatment. Probate court personnel removed her to the Monroe County shelter home. A preliminary hearing was held August 30 or 31. Dahlari apparently had been missing from home or had not returned home as promised.\n\nThe social worker received a letter from an employee of the Ohio juvenile court stating that the Ohio court would not supervise the Weldon home and that in his opinion there were no suitable relatives in Ohio for placement of Dahlari and Maria.\n\nMaria was placed in the foster home of the plaintiffs, Mr. and Mrs. John Doe, on September 7, five days before the order terminating Dahlari's parental rights was entered.\n\nOn September 12, 1972, without a further hearing at which Dahlari would have had an opportunity to respond to the additional evidence received since August 11 and apparently considered in reaching decision,14a Judge Seitz entered two orders:\n\n(i) on the delinquency petition, finding that Dahlari had deserted her home on numerous occasions without sufficient cause and had been repeatedly disobedient to the reasonable and lawful commands of her parents, making her a temporary ward of the court and committing her to the Department of Social Services for placement; and\n\n(ii) on the neglect petition, making Maria a permanent ward of the court and terminating Dahlari's parental rights.\n\nThe Due Process Clause was violated in receiving evidence after the August 11 hearing which was not made part of the record at a hearing at which the parties would have an opportunity to explain or rebut:\n\n\"Appellant objects to the use of a social file by the court in making its determination. The file was not introduced into evidence and included * * * hearsay matters * * *\n\n\"* * * hen a written report is considered in connection with a ruling or judgment, it should be filed in evidence the same as any other writing the court may consider. It is error for a court to consider any writing or anything else that is not in evidence.\n\n\"In the instant action, the use of the social file was a denial of due process of law, since appellant had no opportunity to know, cross-examine, explain or rebut this secret evidence.\" State v Lance, 23 Utah 2d 407, 413; 464 P2d 395, 399, 400 (1970).\n\n\"In any proceeding that is judicial in nature, whether in a court or in an administrative agency, the process of decision must be governed by the basic principle of the exclusiveness of the record. * * * Unless this principle is observed, the right to a hearing itself becomes meaningless. Of what real worth is the right to present evidence and to argue its significance at a formal hearing, if the one who decides the case may stray at will from the record in reaching his decision?\" Mazza v Cavicchia, 15 NJ 498, 514; 105 A2d 545, 554 (1954).\n\n\"anifestly there is no hearing when the party does not know what evidence is offered or considered and is not given an opportunity to test, explain, or refute. * * * All parties must be fully apprised of the evidence submitted or to be considered, and must be given opportunity to cross-examine witnesses, to inspect documents and to offer evidence in explanation or rebuttal. In no other way can a party maintain its rights or make its defense.\" Interstate Commerce Commission v Louisville \u0026 NR Co, 227 U.S. 88, 93; 33 S Ct 185; 57 L Ed 431 (1913).15a\n\nThe superintendent of the shelter home filed an affidavit stating that on September 15 he served Dahlari with a copy of the order terminating her parental rights. It does not appear that a copy of the order was served upon her court-appointed guardian ad litem/attorney. There is no indication that the scope of the attorney's assignment by the court included rendition of service to Dahlari except at such hearings as might be held. Dahlari appears to have been without counsel during the critical period following her detention on August 29.\n\nIt is not claimed that Dahlari was advised of her appellate rights.16a Informing Dahlari's mother of the period for filing an appeal is not an adequate substitute for advising Dahlari and giving her an opportunity to exercise her appellate rights. The history of the conflict between Dahlari and her mother -- a conflict which triggered the interest of the probate court in the Weldon family -- demonstrates that Dahlari's legal interests and those of her mother are not the same.\n\nDahlari was in state custody from August 29 until the summer of 1973. First she was in the shelter home, then a foster home and on November 1, 1972 she was transferred to a state supervised home located in Traverse City. The time for seeking rehearing and appealing ran out while she was detained in Traverse City.\n\nJudge Seitz entered an order \"consenting\" to the adoption of Maria by the Does on February 6, 1973, but no order of adoption has been entered.17a\n\nOn March 1, 1973 Frank and Norma Weldon and Dahlari obtained counsel and on May 2 Dahlari and Maria, by said counsel acting as next friend, filed a complaint in the United States District Court for the Eastern District of Michigan against Judge Seitz, a juvenile court referee and the social worker, alleging a denial of due process in the probate court proceedings conducted by Judge Seitz causing deprivation and interference with civil rights,18a and seeking equitable relief and damages.\n\nA guardian ad litem, Bettye S. Elkins, was appointed by Judge Pratt for Maria. This guardian ad litem had not participated in the prior state court proceedings but has appeared and filed a brief in all subsequent Federal and state court proceedings, including a brief and argument in this Court.\n\nJudge Pratt suggested that the matter be resolved in state court. Counsel stipulated on July 11, 1973 that upon the filing of a petition in the probate court of Monroe County an expedited hearing would be held in the matter pursuant to the laws of Michigan.\n\nDahlari filed a petition for hearing in the Monroe County Probate Court, Juvenile Division. A hearing was held on July 20 and Probate Judge Norman R. Barnard, sitting in lieu of Judge Seitz who had disqualified himself, ruled that he did not have jurisdiction because the petition had been filed more than three months after the entry of the order terminating parental rights.19a\n\nJudge Pratt issued an opinion on September 28, 1973, stating that he could not grant relief as his court did not have jurisdiction over such a claim \"in the absence of exhaustion of state remedies as required by 28 USC § 2254. Preiser v Rodriguez, 411 U.S. 475 (1973).\" The Judge concluded, however, that the court could grant injunctive or equitable relief under the civil rights acts, 42 USC 1983 and 28 USC 1343, and that such relief was warranted: \"A careful review of this record, then, leads to the Conclusion that plaintiffs have been deprived of due process rights of fundamental fairness guaranteed to them under the Fourteenth Amendment.\" Judge Pratt remanded the matter to the probate court for a hearing.20a\n\nAfter a hearing on October 22 and 25 conducted by Judge Mitchell, an order was entered stating that \"no evidence sufficient to warrant an assumption of jurisdiction under the provisions of the Probate Code had been offered\" and dismissing the June 9, 1972 neglect petition. The order stated that it was not to be deemed a reversal or rehearing of the original order entered by Judge Seitz finding neglect or a reversal of the earlier order entered by Judge Barnard declaring that the probate court was without jurisdiction to review or consider after the lapse of three months from entry of a termination order. The matter was referred to Judge Pratt \"for such further action as [the United States District C]ourt may deem appropriate\". The Does participated by counsel at the hearing conducted by Judge Mitchell.\n\nOn October 25, 1973, Judge Pratt entered a judgment declaring on due process grounds that the proceedings terminating Dahlari's parental rights were void.\n\nThis action was commenced by the Does on November 2, 1973 in the Monroe County Circuit Court (Judge Kelley), naming as defendants Dahlari and judge Mitchell. The complaint asserts that the sole jurisdictional basis for Judge Mitchell's order was the paragraph of Judge Pratt's opinion remanding to the probate court for a hearing and that Judge Pratt was without authority to so direct and asked that an order of superintending control be entered quashing the proceedings before Judge Mitchell and prohibiting him from entering any order or finding in connection with those proceedings. Dahlari sought in the same action and was granted a writ of directing the Does, as agents of the Monroe County Probate Court, and the court and judge Mitchell to justify their retention of Maria. The Does filed a petition seeking to have the best interests of the child determined under the Child Custody Act.\n\nOn March 6, 1974 Judge Kelley, relying on the judgment entered by Judge Pratt, ruled:\n\n\"Here the only possible grounds for depriving the natural mother from her child, are those set forth in the Probate Code. It has been judicially determined that in this case no such grounds exist. Therefore all proceedings for Maria's adoption are likewise void. Dahlari Weldon is entitled to and is granted possession and custody of her daughter, Maria. If future conditions warrant, action to remove custody may be commenced.\"\n\nJudge Kelley refused to consider \"Maria's best interests\" stating that the \"Does came into possession of Maria only through proceedings which have been judicially declared void\". He entered an order directing the Does to deliver custody of Maria to Dahlari. This order has been successively stayed by the Michigan Court of Appeals and this Court.\n\nOn April 19, 1974 the United States Court of Appeals for the Sixth Circuit reversed the judgment entered by Judge Pratt. The Sixth Circuit concluded that Judge Pratt did not have jurisdiction \"to review and set aside the probate court's proceedings [conducted by Judge Seitz] and to order the probate court to conduct another hearing\".21a The case was \"remanded to the district court to consider, insofar as a Section 1983 action may be maintained against the individual defendants, whether the district court can fashion appropriate relief not barred by Preiser v Rodriguez, 411 U.S. 475 (1973), and whether notions of comity in federal-state relations otherwise require deferral to state procedures. See, e.g., Williams v Dalton, 231 F2d 646 (CA 6, 1956). Alternatively the district court may consider whether to treat the action as an application for . See, e.g., Bennett v Allen, 396 F2d 788 (CA 9, 1968), and, if so considered, whether plaintiffs must satisfy the exhaustion requirements of 28 USC § 2254(b).\"\n\nOn remand, Judge Pratt declared in an opinion filed July 25, 1974 that since Dahlari's claim was \"equivalent to that available through a writ of , the court must necessarily apply 28 USC § 2254\". Judge Pratt continued:\n\n\"Although the matter is currently being litigated in state court, available state remedies clearly have yet to be exhausted. Accordingly, this Court necessarily lacks jurisdiction to grant relief in the nature of .\n\n\"Plaintiffs additionally request that defendant be ordered to rescind the termination of parental rights. With respect to this claim, the Court clearly has jurisdiction but it must yet be determined whether these defendants are judicially immune from suit and whether this relief is appropriate giving due weight to traditional considerations of equity, comity and federalism.\" (Emphasis by the court.)\n\nJudge Pratt \"reaffirmed\" his earlier decision that Dahlari's \"parental rights were terminated without the due process of law and the proceedings held before the individual defendants were void.22a Since the courts of the state originally declined to consider the issues raised in this action, comity is no bar. Moreover, the importance of the federal right involved indicates that we should adjudicate it in this form.\"23a\n\nJudge Pratt declined, however, to grant injunctive relief, limiting his judgment to a declaration of rights.\n\n\"Nevertheless, the court does not believe injunctive relief of the type sought is now appropriate. Given the fact this court now lacks jurisdiction to order return of Maria to her natural mother, Dahlari Weldon, as noted above, plaintiffs must first pursue available state remedies on that score. Moreover, at present, this court has no reason to believe that the courts of the State of Michigan will not give a judgment rendered by this court full faith and credit. Accordingly applying general principles in equity, an injunction is not now warranted. The court furthermore believes that at this time the requisite showing contemplated by the Supreme Court in Mitchum v Foster, supra [407 U.S. 225 (1972)] for a federal court to enjoin state court proceedings has been satisfied.\"\n\nJudge Pratt again declared that the proceedings terminating Dahlari's parental rights were in violation of the Due Process Clause and retained jurisdiction \"pending Conclusion of litigation on related matters in state courts in the event further equitable relief may later prove necessary\". A declaratory judgment to like effect was also entered on July 25, 1974.\n\nThe Michigan Court of Appeals, on August 28, 1974, denied leave to appeal. It noted the judgment entered by Judge Pratt and stated that any further judicial delay in the matter was unwarranted and not in the best interests of Dahlari and Maria. This Court denied leave to appeal on December 26, 1974 and on January 24, 1975 granted reconsideration and leave to appeal.\n\nThe United States Court of Appeals for the Sixth Circuit, by order of February 12, 1976, affirmed the declaratory judgment entered on remand stating that Judge Pratt had jurisdiction and had given due consideration to principles of comity, equity and federalism and affirmed \"for the reasons set forth in the opinion of United States District Judge Philip Pratt dated July 25, 1974\". The Sixth Circuit denied reconsideration. An extension of time was granted to file with the United States Supreme Court a petition for writ of certiorari to the Sixth Circuit.\n\nII\n\nThis is an appeal from the order entered by Judge Kelley\n\ni) denying the Does an order of superintending control that would quash the October, 1973, probate court proceedings conducted by Judge Mitchell on \"remand\" from Judge Pratt, and\n\nii) directing the Does to deliver custody of Maria to Dahlari.\n\nThe first aspect of Judge Kelley's order was mooted by the Sixth Circuit which, in the first appeal to that court, held that Judge Pratt was without power to direct the probate court to hold the hearing conducted by Judge Mitchell. Moreover, Judge Mitchell did not enter an order of Disposition of Maria and referred the cause to Judge Pratt for further action. Judge Kelley does not have the power of superintending control over Judge Pratt. Judge Kelley did not err in denying the Does an order of superintending control.\n\nNor did Judge Kelley err in directing the Does to deliver custody of Maria to Dahlari. This aspect of the order was based on Judge Pratt's declaration and findings that the probate court proceedings conducted by Judge Seitz, resulting in the order terminating Dahlari's parental rights, violated the Due Process Clause.\n\nThe judgment entered by Judge Pratt is entitled to full faith and credit. \"Although the [Full Faith and Credit] Clause in terms prescribes recognition 'in each state' only for the 'judicial proceedings in every other State,' the same rule has been held to apply to federal courts regarding state judgments, on the one hand, and to state courts regarding federal judgments, on the other hand.\"24a\n\nOnly final judgments are entitled to full faith and credit.25a For full faith and credit purposes, the finality of a judgment will ordinarily be determined by the law of the rendering state.26a \"The federal rule is that the pendency of an appeal does not suspend the operation of an otherwise final judgment as res judicata or collateral estoppel, unless the appeal removes the entire case to the appellate court and constitutes a proceeding de novo.\"27a The finality of the judgment entered by Judge Pratt is not affected by a possible application to the United States Supreme Court for a writ of certiorari to the Sixth Circuit.\n\nThe Does contend that they are not bound by the Federal court judgment because they were not named as defendants in that action. In response it is suggested that they are bound as privies of the named defendants.\n\nA final judgment is conclusive as to the rights of the \"parties and their privies\".28a\n\nPrivity has been greatly expanded beyond the succession-to-an-interest-in-property concept to include a variety of relationships.29a A person may be precluded by a judgment if he is deemed to have been represented by a party30a or to have had a substantive legal relationship with a party.31a\n\nJust as due process is the basis of Dahlari's claim so too it limits the extent to which nonparties may be precluded. The basic concept is fairness;32a \"the achievement of substantial Justice rather than symmetry is the measure of the fairness of the rules of res judicata\". Bruszewski v United States, 181 F2d 419, 421 (CA 3, 1950).33a\n\nJudgments determining status are generally binding on all other persons without regard to whether they are parties. However it has been said that when a person has \"an immediate and substantial interest in the status\" the judgment is not necessarily conclusive upon him.34a\n\nIn this case the Does claim an interest based on the orders entered by Judge Seitz terminating Dahlari's parental rights and giving preliminary approval to their adoption of Maria. Analogies to successors in interest and litigation by a fiduciary or other representative have been suggested. (See fns 30 and 31.) The nature of the interest of prospective adoptive parents is not defined by the present35a or former adoption statute.36a Our Disposition makes it unnecessary to decide whether prospective adoptive parents, during the period between placement and entry of an order of adoption, are necessary or permissive parties in litigation challenging the validity of an order terminating parental rights.37a\n\nA person is deemed represented and collaterally estopped by judgment if he substantially participates, directly or indirectly, in controlling the prosecution or defense of the action.38a\n\n\"The persons for whose benefit, to the knowledge of the court and of all the parties to the record, litigation is being conducted cannot, in a legal sense, be said to be strangers to the cause. The case is within the principle that one who prosecutes or defends a suit in the name of another to establish and protect his own right, or who assists in the prosecution or defense of an action in aid of some interest of his own, and who does this openly to the knowledge of the opposing party, is as much bound by the judgment and as fully entitled to avail himself of it as an estoppel against an adversary party, as he would be if he had been a party to the record.\" Souffront v La Compagnie des Sucreries de Porto Rico, 217 U.S. 475, 486-487; 30 S Ct 608; 54 L Ed 846 (1910).\n\nThe concept that a nonparty may be bound by the representation of a party has been held to preclude a party in companion litigation who did not seek to intervene in the action first adjudicated. In Penn-Central Merger and N \u0026 W Inclusion Cases, 389 U.S. 486, 505-506; 88 S Ct 602; 19 L Ed 2d 723 (1968), it was held that a governmental body \"had an adequate opportunity to join in the litigation\" in New York following the stay of Pennsylvania proceedings, in which it was a party, in favor of the New York action:\n\n\"All parties with standing to challenge the Commission's action might have joined in the New York proceedings. In these circumstances, it necessarily follows that the decision of the New York court which, with certain exceptions, we have affirmed, precludes further judicial review or adjudication of the issues upon which it passes.\"\n\nAs in Penn-Central, the preclusion issue does not arise here in its usual format of subsequent litigation against another pocketbook. Both actions were pending at the same time (Judge Pratt's declaratory judgment on remand was entered over eight months after this action was commenced), concern the same subject matter and seek the same relief. The range of options is similarly limited: the merger would be approved or not; Maria will be returned to Dahlari or not.\n\nThe \"persons for whose benefit\" the defense of the Federal court litigation was conducted were the Does.\n\nThe Does assert that the primary consideration at this time is the best interests of Maria. Maria was at all times represented in the proceedings before Judge Pratt and in all subsequent proceedings by the guardian ad litem appointed by him.\n\nThe failure to name the Does as parties defendant may be attributable to the shield of confidentiality with which the statute surrounds the identity of prospective adoptive parents.39a\n\nThe Does were fully aware at an early date of the pendency of the Federal court action and of the issues there being litigated. They did not seek to intervene in the Federal proceedings until all briefs had been filed on the second appeal to the Sixth Circuit.40a\n\nOn July 20, 1973, Judge Barnard entered an order stating that he had met with the Does and advised them of their right to be represented in the proceedings before him and had directed that they be served with notice of a September 13, 1973 hearing in such manner as to preserve their anonymity. The Does' present counsel entered an appearance in the probate court on August 30, 1973. The Does participated through such counsel in the October, 1973 probate court hearing before Judge Mitchell on \"remand\" from Judge Pratt.\n\nThis action was commenced when Judge Pratt entered a judgment in Dahlari's favor. Thereafter, the dispute over Maria's custody has been and still is being pursued in parallel on Federal and state lines. The resistance to Dahlari's effort to regain possession of Maria has been a joint effort by counsel for the probate court authorities and counsel for the Does.\n\nIII\n\nOrdinarily when a nonparty contends he should not be barred by a former adjudication he asserts that he did not have a full and fair opportunity to present evidence on the issue. In this case the Does do not seek an opportunity to present further evidence on the issue whether the requirements of the Due Process Clause were observed in terminating Dahlari's parental rights, the issue decided in her favor in the Federal court.41a They contend that this Court should decide that issue in their favor. The guardian ad litem and Dahlari join in the request for a decision by this Court on that issue. Whether or not the Does were bound by the Federal court judgment, under the circumstance that the issue decided in that action can be considered and decided by this Court without a further evidentiary hearing, the matter can now be resolved.\n\nDue process is more than the observance of form. Facial compliance with statutory and court rule requirements is not the hallmark of a fair hearing. The Due Process Clause requires a fair hearing in fact -- content, not ritual. \"he requirements of due process cannot be ascertained through mechanical application of a formula.\" Groppi v Leslie, 404 U.S. 496, 500; 92 S Ct 582; 30 L Ed 2d 632 (1972). \"'Due process' is an elusive concept. Its exact boundaries are undefinable, and its content varies according to specific factual contexts.\" Hannah v Larche, 363 U.S. 420, 442; 80 S Ct 1502; 4 L Ed 2d 1307 (1960). \"'Due process' emphasizes fairness between the State and the individual.\" Ross v Moffitt, 417 U.S. 600, 609; 94 S Ct 2437; 41 L Ed 2d 341 (1974).42a\n\nDahlari was notified of a hearing on the neglect petition and that her parental rights might be terminated. An attorney was appointed to represent her.\n\nJudge Seitz decided that Maria was a neglected child without any evidence whatever (see fn 12) to support that finding or affording Dahlari's counsel an opportunity to argue the question (see text following fn 12). He committed Dahlari to the Department of Social Services and terminated her parental rights without giving her an opportunity to explain or rebut the additional evidence he had received since the last hearing (see text accompanying fn 15).\n\nDahlari was not advised of her appellate rights (see text accompanying fn 16), or given an opportunity to exercise them. Although an attorney was appointed to represent her she did not have legal assistance during the critical period, following her detention on August 29, when her parental rights were terminated and the time for seeking a rehearing or appealing was running.\n\nWhile the state may not be obliged to provide an appeal,43a it has established a right of appeal.44a The Due Process Clause requires that a person such as Dahlari, 15 years of age and incarcerated,45a be informed of and given an opportunity to exercise her appellate rights.46a\n\nDahlari's court-appointed counsel made no issue of the detention of Maria without a showing that home conditions justified it and without a hearing on that question. Nor did he, either at the adjudication or Disposition hearing, call Judge Seitz's attention to the utter failure of the record to support a finding of neglect.\n\nDahlari's right to counsel is constitutionally rooted.47a The right secured is to the effective assistance of counsel.48a\n\nThe Federal court judgment was entered following an opportunity to present evidence affecting the matter and full consideration at the trial and appellate levels. The record and the law strongly support that judgment.49a There is no suggestion that any further evidence affecting the Federal court determination could be offered in additional state court proceedings.\n\nEven if the Federal court determination were thought not binding on Michigan courts under the principles of res judicata and full faith and credit, we would defer to it as a matter of comity.50a\n\nWe adopt the Federal court finding that the requirements of the Due Process Clause51a were not observed in the probate court proceedings resulting in termination of Dahlari's parental rights.\n\nIV\n\nCircuit Judge Kelley refused to consider Maria's best interests under the Child Custody Act stating that the Does had come into possession of Maria through proceedings that had been judicially declared void.52a\n\nSection 3 of the act defines the term \"best interests of the child\".53a\n\nSection 454a provides that in all circuit court child custody disputes the court \"shall declare the inherent rights of the child and establish the rights and duties as to custody, support and visitation of the child in accordance with this act\".\n\nSection 555a provides: \"When the dispute is between the parents, between agencies or between third persons, the best interests of the child shall control.\" This is not a dispute between the parents nor is it a dispute between agencies or between third persons.\n\nThe next sentence of § 5 concerns a dispute between a parent, such as Dahlari, and a third person, such as the Does: \"When the dispute is between the parent or parents and an agency or a third person, it is presumed that the best interests of the child are served by awarding custody to the parent or parents, unless the contrary is established by clear and convincing evidence.\" The act does not go on to provide that if the \"contrary\" is established by clear and convincing evidence \"the best interests of the child shall control\".\n\nThe next section of the act, § 6,56a provides:\n\n\"The provisions of this act, being equitable in nature, shall be liberally construed and applied to establish promptly the rights of the child and the rights and duties of the parties involved.\"\n\nIf the Legislature had meant that the best interests of the child shall control in all child custody disputes it would not, in the first sentence of § 5, have limited the active second clause, \"the best interests of the child shall control\", by the preceding limiting words: \"When the dispute is between the parents, between agencies or between third persons.\"\n\nThe limiting words make clear that the best interests of the child do not necessarily control where the dispute is not between parents or between agencies or between third persons -- where, as here, it is between a parent and an agency or a third person. In such a case, as expressed in §§ 4 and 6, the circuit court has the power to decide the inherent rights of the child and establish the rights and duties of the parties involved as to custody, support and visitation.\n\nThe construction sought by the Does would effectively modify the limitations in the Probate Code on the power of the probate court to terminate parental rights. The history of this controversy illustrates that years of contentious litigation on many fronts may follow the entry of an order terminating parental rights and the transfer of physical custody of a child to prospective adoptive parents. To say to a parent successful in challenging a termination order on direct or collateral review that the issue is what is in the best interests of the child would in effect confer unstructured power on the probate court to terminate the parental rights of arguably unfit parents and to transfer custody of their children to \"better\" adoptive parents contrary to constitutional and statutory limitations.\n\nIt is a settled principle that evidence of the comparative advantages of a foster home is not admissible in parental rights termination proceedings. In re Mathers, 371 Mich 516, 530; 124 NW2d 878 (1963).57a In Fritts v Krugh, supra, at 119, this Court said:\n\n\"The concept of the relationship of his court to the family entertained by the probate Judge, and exemplified by his orders, is one for which we find no warrant in the law of this State or, for that matter, any one of these United States.\n\n\"* * * he orders on their face suggest the Conclusion that, while the parents may well prove to be proper custodians for their own children, the probate Judge had, in his view, succeeded in finding parents for each of them who were superior to those whom nature and the Deity had provided.\"\n\nThe Child Custody Act, which all agree concerns circuit court custody disputes, does not expand the powers of the probate court in those cases where that court acts beyond its authority in terminating parental rights.\n\nSingle teenagers between the ages of 15 and 19 account for approximately one-half of the illegitimate births. An increasingly large percentage of unwed mothers are choosing to keep their babies. More than one-half were making that choice in 1975. At the same time there has been a decrease in adoptions of over 50%.58a\n\nThere are a larger number of prospective adoptive parents -- married and able to provide a stable home -- than there are \"desirable\" children available for adoption.59a\n\nEven if a baby is more likely to obtain \"love, affection and guidance\", \"food, clothing, medical care or other remedial care\" from prospective adoptive parents, even if they provide permanency \"as a family unit\" and are \"morally\" better fit and possess better \"mental and physical health\"60a than the unwed teenage mother who is herself a child, has not \"settled down\" and is dependent on others, the probate court may not take a baby from the mother unless the conditions to its jurisdiction set forth in the statute (see fn 4) are established by a process satisfying constitutional requirements.\n\nThere is no evidence, either in the original probate court proceedings or in any subsequent Federal or state court proceedings, that Maria was neglected or that there was any other statutory basis for termination of parental rights (see fn 12).\n\n\"There has been, it is true, assertion of unfitness, but the problems the mother has are no greater nor different than for other young unmarried mothers, further complicated by her particular circumstances. There is a chasm between unfitness for parenthood and what is only troubled parenthood, or poverty, or difficulty in resolving plans for a child's upbringing. Even if she has not lived wisely, the mother loves and is concerned for her child.\" In the Matter of Spence-Chapin Adoption Service v Polk, 29 NY2d 196, 201; 324 NYS2d 937, 941-942; 274 NE2d 431 (1971).\n\nAn unmarried girl who becomes pregnant, bears a child and desires to keep and raise it will appear to some to be promiscuous, disobedient, immature, and irresponsible.\n\nMoral unfitness or promiscuity is not a ground for terminating parental rights. \"The mere fact that the child was born out of wedlock does not deprive the mother of the right to seek recovery of its custody in a proceeding. [Citation omitted.] The petitioner has not forfeited her parental rights merely because she has been convicted of criminal offenses, including the charge of escape from the prison after the child was born.\" State ex rel Acton v Flowers, 154 W Va 209, 218; 174 SE2d 742, 748 (1970).61a The delinquency of a parent confers no jurisdiction over a child of the parent unless the parental delinquency affects the child.62a\n\nThe probate court is not empowered to remove Maria from Dahlari's custody as punishment for her delinquency.63a Any other construction of these statutory provisions would pose the gravest constitutional issues.\n\nV\n\nAlthough Maria's best interests do not control, her interests assuredly are to be considered.\n\nThe Child Custody Act reaffirms the traditional equity jurisdiction of the circuit court in child custody disputes.64a Under the act the circuit court has the power to decide the inherent rights of the child and to establish the rights and duties of the parent and of other persons having physical custody of the child.\n\nThe right of a parent to custody of his or her child is an aspect of liberty under the Due Process Clause65a absent circumstances justifying intervention by the state.66a\n\nThe argument that it is important to preserve Maria's stable family relationship with the Does overlooks the origin of that relationship. It arose out of the disruption -- judicially found to have been unwarranted -- of Maria's relationship with her maternal family. Adoption of the proffered argument would endanger the parental rights of imperfect but fit parents and the family relationships of children who live in deficient but adequate homes.67a\n\n\"Thus the issue is not, as the Polks [foster parents] would have it, whether one choice of custody or another is better for the child, or, put another way, whether the Polks would raise the child better than would the unwed mother, or which cultural or family background would be best for the child. Least of all is the issue that of comparing the quality and depth of love and affection between the child and those who would compete for its custody. Nor is the issue whether natural parents or adoptive parents make 'better' parents, whatever that may mean. The power of the State, let alone its courts, is much narrower. Child and parent are entitled to be together, unless compelling reason stemming from dire circumstances or gross misconduct forbid it in the paramount interest of the child, or there is abandonment or surrender by the parent. A baby born out-of-wedlock, even of a troubled mother, is not no-one's child. In the inimitable vernacular, it is not 'up for grabs'. It is not a waif claimable by the first finder, however highly qualified.\n\n\"There is also much about the love and affection the Polks have for the child and the child for them, and about the inadequate or undesirable plans the mother has had for raising the child. All these factors would be material, perhaps, if the State had the power to wrest a child from its mother in the absence of abandonment, outstanding formal surrender, or demonstrated unfitness as distinguished from what others might regard as inadequate plans for its upbringing. It has no such power, nor should it have.\" Spence-Chapin Adoption Service v Polk, supra at 198-199, 201; 324 NYS2d at 939-940.68a\n\nIn the best interests cases to which our attention is directed where, although parental rights had not been judicially terminated or modified,69a the court preferred foster or adoptive parents to natural parents, there was evidence and a finding of grounds for termination or the natural parent initiated the separation of the child from the parent.70a\n\nDahlari did not release Maria for adoption and later seek to rescind her action. She did not abandon Maria nor did her delinquency adversely affect Maria. There is no evidence of neglect or other basis for depriving Dahlari of her fundamental right to custody of her child.\n\nIf Dahlari is able to provide for Maria's care and support she is entitled to custody unless a transfer of custody would result in the destruction of Maria's ability to grow and mature into a healthy and whole person.\n\nAlthough Maria was improperly taken from Dahlari, circumstances may be such that it is not possible for Maria to grow to a healthy maturity in Dahlari's custody. Vindication of Dahlari's rights does not justify Maria's destruction.71a\n\nWhile a transfer of custody will, no doubt, be traumatic for Maria, who probably does not remember parental figures other than the Does, countless children are subjected to this experience and overcome it. As a result of war, death or other misfortune, children are uprooted from home and permanently separated from family and yet grow to a healthy maturity. Probate courts frequently, sometimes abruptly, change well-established foster care arrangements.\n\nExpert testimony could be obtained on all sides of this question and case histories produced to support different Conclusions. It is pure guesswork whether transfer of custody of this child can be effected without undue adverse effect on her. Properly handled and supervised, the transfer of custody may be less traumatic than feared.\n\nThere is another factor. Dahlari would in all probability be entitled to rights of visitation under the Child Custody Act. It is doubtful whether a court could properly attempt to keep a natural mother whose parental rights have not been properly terminated from all access to her child. Interaction between Dahlari and Maria appears inevitable. Maria's search for identity may be more traumatic than a transfer of custody.\n\nWe conclude that the correct resolution is to transfer custody, supervise it, and to order appropriate remedial measures if it should appear that the transfer of custody in fact adversely affects Maria's ability to grow to a healthy maturity. As in In re Mathers, supra at 536, such an \"order is to be carried out with care, sensitivity, and reasonable promptness. Every effort shall be made to minimize the emotional impact of the child's transfer. Sensible transfer procedures should be devised, employing all necessary resources of the court.\"72a\n\nThe guardian ad litem appointed by Judge Pratt has demonstrated her concern and interest in this matter. The circuit court may wish to consider appointing her to supervise the transfer of custody and to observe Maria for a reasonable period following transfer and from time to time to report to the court with or without recommendation.\n\nThe Federal court action has been a lis pendens since May, 1973, less than four months after Judge Seitz gave preliminary approval to the adoption and less than nine months after the Does obtained physical custody.73a Dahlari bore Maria in her womb for a longer period of time.\n\nCountless foster care arrangements continue for years without adoption, and with either the substitution of new foster parents or the return of the children to their parents after long separation.74a The Does, who served the probate court as foster parents before Maria was entrusted to them, have had this experience. We can empathize with the Does but no equity can be recognized based on changed circumstances resulting from the pursuit of litigation judicially found, three years ago, to have been unjustified.\n\n\"Even more unjust would it be for us to say that because 8 years have been necessary to litigate the matter, the door is now barred because mother and child thusly have been too long separated.\" In re Mathers, supra at 535.\n\n\u003cspan class=\"fn\"\u003e1. The whole purpose of the act is \"to declare the inherent rights of minor children; to establish rights and duties to their custody, support and visitation in disputed actions * * *\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Section 5 provides that \"hen the dispute is between the parent or parents and an agency or a third person, it is presumed that the best interests of the child are served by awarding custody to the parent or parents, unless the contrary is established by clear and convincing evidence.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe standard for establishing the contrary is to determine the best interests of the child as set forth in § 3. See, e.g., Bahr v Bahr, 60 Mich App 354, 357-360; 230 NW2d 430 (1975); lv den'd, 394 Mich 794 (1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 Report of investigation and consent of the Judge to adoption were filed on February 6, 1973.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 The contest for the custody of Maria has been waged in these arenas:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eState courts:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThree times in probate court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOnce in circuit court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOnce in Court of Appeals.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOnce (plus motions) in this Court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFederal courts:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTwice in a district court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTwice in the Sixth Court of Appeals.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Mrs. Weldon's attorney in each D/N hearing stated on the record that he had informed her of the right to be present but that she chose not to be.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. A delinquency petition against Dahlari had been completely heard through the Disposition phase. The Disposition itself had been taken under advisement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. MCLA 712A.21; MSA 27.3178(598.21):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"* * * If parental rights have been terminated by an order entered in the proceedings and custody of the child has been removed from the parents, guardian or other person, the petition for rehearing shall be filed within 3 months from the date of entry of the order terminating parental rights * * *.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. From the transcript of the hearing, the Judge said prior to testimony:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"I agree wholeheartedly with all that opinion of Judge Barnard's with regard to jurisdiction, but his ruling has been overruled by Judge Pratt and the original proceedings have been held void, so this is an original hearing with regard to this matter.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Judge also said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"I am in no way reviewing anything that Judge Seitz did with respect to this case and, like to say, it will entirely be on what has been presented to me for my consideration at this hearing on the 22nd and today * * * I also feel that Judge Barnard's decision that he made was correct, that I cannot halt that decision because this Court does lose jurisdiction. n the event that there was a previous valid hearing, then this Court loses jurisdiction. So I'm saying that Judge Seitz's decision may be correct * * * on what was presented to him.\" (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(The Judge also denied the motion of guardian ad litem to adjourn [and later to rehear] the matter to allow the presence or deposition of one Linda Haskins who had moved to California. Later a similar motion was adjourned indefinitely. The circuit court writ of superintending control had been filed by that time.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Federal proceedings are entitled:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDahlari Weldon v Monroe County Probate Court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. There is some reason for this Federal district court mistake in that the probate court transcriber placed on one of the cover sheets, \"Combined Hearing on Disposition\". There is nothing in the notices or in the hearings to bear out the description.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Respondent's brief argues that the Judge was solely interested in medical attention for purposes of providing immunization for the baby. The record negates this argument.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. JCR 1969, 8.3:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(A) Adjudicative Phase. In absence of a valid plea in confession only competent, relevant, and material evidence is admissible at the adjudicative phase, subject to the general rules of evidence in civil proceedings. [This phase is comparable to conviction in an adult court.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(B) dispositional Phase. In the Dispositional phase only such matters as are relevant and material may be considered.\" [This phase is comparable to sentencing in an adult court.] (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. See In re Mathers, 371 Mich 516, 532; 124 NW2d 878 (1963): \"He must weigh the nature and quality of proofs on the question of neglect along with sociological, medical, and other available data, in order to make a proper Disposition.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Dahlari had been temporarily released from shelter care. The delinquency Disposition remained under advisement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. MCLA 712A.22; MSA 27.3178(598.22), GCR 1963, 701.4(1), provides for a 20-day appeal period. MCLA 712A.21; MSA 27.3178(598.21) provides for a maximum period of three months for a petition to rehear a termination in the probate court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The record does not disclose what efforts her appointed attorney may have undertaken, but one can assume that he carried out his responsibilities in discussing the meaning of the termination and advised her.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. This hearing was not brought under MCLA 712A.21; MSA 27.3178(598.21) which places the burden on the petitioner (usually parents) to demonstrate present conditions which might lead to modification or setting aside of the original decree.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. MCLA 722.26; MSA 25.312(6).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. 354 Mich 65, 93, 94-96; 92 NW2d 585 (1958).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. MCLA 722.541; MSA 25.311.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. 373 Mich 337, Supplemental Opinion, 349, 354; 129 NW2d 430 (1964).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Unlike In re Mathers, fn 11 (supra) , where comparative advantages were argued before the jury during the adjudicative phase, here there were no comparisons of any kind during the proceedings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. By this assertion, we do not denigrate the responsibility of a parent to guide a child, to set limits of behavior and to invoke reasonable discipline. Nor do we deny the responsibility of the parents or custodians to guide and advise the child and make requests of the court on behalf of the child in a juvenile proceeding in which the petition is against the child.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. 42 Ill 2d 201, 209; 247 NE2d 417 (1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Because of the grandfather's age, temporary, not permanent custody was granted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Wilson v Mitchell, 48 Colo 454; 111 P 21 (1910).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. 258 Iowa 1390; 140 NW2d 152 (1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. 259 Iowa 526; 144 NW2d 861 (1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Also see In the Matter of Nathan M, 76 Misc 2d 1003, 1005; 352 NYS2d 319 (Fam Ct, 1973). Although the court found the parents \"unfit * * * to minister to the needs of the children\", it commented upon the \"new provisions of section 392 of the Social Services Law\" which is similar to our Child Custody Act:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"In enacting the new provisions of section 392 of the Social Services Law, it is apparent the Legislature has recognized the desire to approach custody problems from a 'best interests approach', in regard to foster care review.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Finlay v Finlay, 240 NY 429, 433-434; 148 NE 624; 40 ALR 937 (1925).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The case was remanded to the trial court for further findings, suggesting that an independent investigation by the Judge might be helpful to him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Also see Foster \u0026 Freed, Law and the Family -- New York (rev ed 1972) and Foster \u0026 Freed, Child Custody (pts 1, 2) 39 NYU L Rev 423, 615 (1964).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. See Goldstein, A. Freud \u0026 Solnit, Beyond the Best Interests of the Child (Free Press 1973), pp 12-14:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Unlike adults, children have no psychological conception of relationship by blood-tie until quite late in their development. For the biological parents, the facts of having engendered, borne, or given birth to a child produce an understandable sense of preparedness for proprietorship and possessiveness. These considerations carry no weight with children who are emotionally unaware of the events leading to their births. What registers in their minds are the day-to-day interchanges with the adults who take care of them and who, on the strength of these, become the parent figures to whom they are attached.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"* * * he 'family', however defined by society, is generally perceived as the fundamental unit responsible for and capable of providing a child on a continuing basis with an environment which serves his numerous physical and mental needs during immaturity. * * * His intellect needs to be stimulated and alerted to the happenings in his environment. * * * He needs assistance from the adults in curbing and modifying his primitive drives (sex and aggression). He needs patterns for identification provided by the parents to build up a functioning moral conscience.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eRemoval from satisfying parent figure(s) could result in a regression \"along the whole line of affections, skills, achievements and social adaptation\". Id. p 18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. MCLA 722.23; MSA 25.312(3) reads:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"'Best interests of the child' means the sum total of the following factors to be considered, evaluated and determined by the court:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(a) The love, affection and other emotional ties existing between the competing parties and the child.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(b) The capacity and Disposition of competing parties to give the child love, affection and guidance and continuation of the educating and raising of the child in its religion or creed, if any.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(c) The capacity and Disposition of competing parties to provide the child with food, clothing, medical care or other remedial care recognized and permitted under the laws of this state in lieu of medical care, and other material needs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(d) The length of time the child has lived in a stable, satisfactory environment and the desirability of maintaining continuity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(e) The permanence, as a family unit, of the existing or proposed custodial home.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(f) The moral fitness of the competing parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(g) The mental and physical health of the competing parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(h) The home, school and community record of the child.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(i) The reasonable preference of the child, if the court deems the child to be of sufficient age to express preference.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(j) Any other factor considered by the court to be relevant to a particular child custody dispute.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. MCLA 712A.22; MSA 27.3178(598.22).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1a MCLA 712A.22; MSA 27.3178(598.22).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2a MCLA 712A.21; MSA 27.3178(598.21).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3a MCLA 712A.2; MSA 27.3178(598.2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDahlari was charged as, and on April 27, 1972 adjudicated to be, a delinquent child based on her absences from home. A Disposition hearing set for May 26 was adjourned to June 9. During the interim, on June 6, Norma Weldon reported that Dahlari was missing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4a \"Except as provided herein, the juvenile division of the probate court shall have:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"* * *\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(b) Jurisdiction in proceedings concerning any child under 17 years of age found within the county\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(1) Whose parent or other person legally responsible for the care and maintenance of such child, when able to do so, neglects or refuses to provide proper or necessary support, education as required by law, medical, surgical or other care necessary for his health, morals, or who is deprived of emotional well-being, or who is abandoned by his parents, guardian or other custodian, or who is otherwise without proper custody or guardianship; or\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(2) Whose home or environment, by reason of neglect, cruelty, drunkenness, criminality or depravity on the part of a parent, guardian or other custodian, is an unfit place for such child to live in, or whose mother is unmarried and without adequate provision for care and support.\" MCLA 712A.2(b); MSA 27.3178(598.2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5a \"If, through arrangements made by the parent, the child is being properly cared for by those who have a genuine interest in its welfare, the fact that the mother has obtained such help and has sought out and procured proper care for the child is evidence that the parent is not neglecting the child. It is also evidence of proper concern for the child's welfare and tends to establish that she was not abandoned or left homeless. If the person in whose care the child is placed assumes the responsibility, is not being imposed upon, and there is no dispute among persons entitled to the custody of the child, the jurisdiction of the court cannot be invoked and the state is not concerned in the matter. To be sure the state has an interest in the child, but its interest is based upon the statutory grounds of dependency, neglect or abandonment, and in order for the child to be snatched from a blood relation who is giving her love and care, there certainly must be some showing as to the necessity therefor.\" Diernfeld v People, 137 Colo 238, 243; 323 P2d 628, 630-631 (1958).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6a See fn 4, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7a \"After a petition shall have been filed and after such further investigation as the court may direct, in the course of which the court may order the child to be examined by a physician, dentist, psychologist or psychiatrist, the court may dismiss said petition or may issue a summons reciting briefly the substance of the petition, and requiring the person or persons who have the custody or control of the child, or with whom the child may be, to appear personally and bring the child before the court at a time and place stated: Provided, That the court in its discretion may excuse but not restrict children from attending the hearing. If the person so summoned shall be other than the parent or guardian of the child, then the parents or guardian, or both, shall also be notified of the petition and of the time and place appointed for the hearing thereon, by personal service before the hearing, except as hereinafter provided. Summons may be issued requiring the appearance of any other person whose presence, in the opinion of the Judge, is necessary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Any interested party who shall voluntarily appear in said proceedings, may, by writing, waive service of process or notice of hearing.\" MCLA 712A.12; MSA 27.3178(598.12).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8a Maria was given certain inoculations by the pediatrician.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNorma Weldon explained that there had been two deaths in the family from leukemia and that a family physician had advised against early inoculation. All her children, including Dahlari, had not been inoculated until they were of school age.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9a See fn 4, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10a \"In the case of a child concerning whom a complaint has been made or a petition or supplemental petition or petition for revocation of probation has been filed pursuant to this chapter, the court may order the child, pending the hearing, detained in such place of detention as it shall designate. The court may release the child, pending the hearing, in the custody of a parent, guardian or custodian, to be brought before the court at the time designated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Detention, pending hearing, is limited to the following children:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(a) Those whose home conditions make immediate removal necessary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(b) Those who have run away from home.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(c) Those whose offenses are so serious that release would endanger public safety.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(d) Those detained for observation, study and treatment by qualified experts.\" MCLA 712A.15; MSA 27.3178(598.15).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11a After the June 9 adjudication hearing and the adjudication of neglect at the Conclusion of that hearing -- see accompanying text -- the social worker testified at the August 11 Disposition hearing that \"there was quite a bit of conflict between [Norma Weldon] and Dahlari as to the care of the baby or the baby's whereabouts. Dahlari has stated that many times when her mother became angry with her she would remove the baby to a married daughter's home in Bowling Green, Ohio or near Bowling Green, Ohio to punish Dahlari\". On cross-examination, the attorney for Frank and Norma Weldon asked the case worker \"re you talking about physical abuse, that she has also claimed that Mrs. Weldon has physically abused the child?\" The social worker responded, \"Yes, she has.\" Question, \"This is what Dahlari says?\" Answer, \"Yes, sir.\" The matter was not further explored.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe hearsay statement was not offered or received to establish neglect. When the statement was made, that issue had already been decided a month previously. The hearing on that issue was not reopened when the statement was made. The issue of neglect was no longer before the court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis Court has said that a hearsay statement is not \"legal evidence\" to support an \"assertion [by the probate court] of jurisdiction\":\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"As far as this record discloses, no witness was called except the county agent whose report was based largely on what she had been told. Nothing resembling legal evidence was offered to establish abuse of or neglect of the children. * * * In effect, the mother's own statements about her husband in the midst of a marital dispute repeated in hearsay form have been employed to defeat her own efforts to regain custody of her children. We reiterate that where the fundamental facts of neglect are in dispute, our Constitution and statute require some legal evidence to support the court's assertion of jurisdiction.\" Fritts v Krugh, 354 Mich 97, 118; 92 NW2d 604 (1958).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMoreover, the hearsay statement does not support a finding of neglect. Parental rights cannot be terminated because of minor isolated instances of parental misconduct. Most parents, at one time or another, administer unjustified discipline, even physically abuse their children. Parental rights may be terminated only if the record shows abuse endangering the child's health or safety. There is no such showing here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"There must be real evidence of long-time neglect, or serious threats to the future welfare of the child, to overthrow permanently the natural and legal right of parents to the custody and nurture of their own children.\" Fritts v Krugh, supra at 116.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSimilarly, see In the Matter of LaFlure, 48 Mich App 377, 388; 210 NW2d 482 (1973), \"clear and convincing proof;\" and In the Matter of Spence-Chapin Adoption Service v Polk, 29 NY2d 196, 199; 324 NYS2d 937; 274 NE2d 431 (1971):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Child and parent are entitled to be together, unless compelling reason stemming from dire circumstances or gross misconduct forbid it in the paramount interest of the child, or there is abandonment or surrender by the parent.\" (Emphasis supplied.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12a On the same principle that it is \"a violation of due process to convict and punish a man without evidence of his guilt\", Thompson v Louisville, 362 U.S. 199, 206; 80 S Ct 624; 4 L Ed 2d 654 (1960); Garner v Louisiana, 368 U.S. 157; 82 S Ct 248; 7 L Ed 2d 207 (1961); Vachon v New Hampshire, 414 U.S. 478, 480; 94 S Ct 664; 38 L Ed 2d 666 (1974), it is a violation of due process to terminate parental rights -- an aspect of \"liberty\" under the Due Process Clause (fn 65, (infra)) -- without evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn United States ex rel Vajtauer v Commissioner of Immigration, 273 U.S. 103, 106; 47 S Ct 302; 71 L Ed 560 (1927), the United States Supreme Court said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Deportation without a fair hearing or on charges unsupported by any evidence is a denial of due process which may be corrected on .\" (Emphasis supplied.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Schware v Board of Bar Examiners of New Mexico, 353 U.S. 232, 246-247; 77 S Ct 752; 1 L Ed 2d 796 (1957), the United States Supreme Court held that the Due Process Clause was violated by denying a person the right to practice law on the ground that he had not shown good moral character where that Conclusion was not supported by the record. The Court said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"There is no evidence in the record which rationally justifies a finding that Schware was morally unfit to practice law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"On the record before us we hold that the State of New Mexico deprived petitioner of due process in denying him the opportunity to qualify for the practice of law.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Fritts v Krugh, supra, this Court said that it would be a violation of the Due Process Clause to terminate parental rights \"upon no evidence of permanent neglect\":\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"As indicated previously, we likewise hold that a permanent deprivation of parental rights, based upon the record certified to us here, would represent, if authorized by statute, a violation of due process of law as far as these parents are concerned.\" 354 Mich at 122.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"There must, therefore, be some testimony of neglect before the probate court has the power to take jurisdiction of the child and to enter a valid order under the Disposition section of the code [MCLA 712A.18; MSA 27.3178(598.18)].\" 354 Mich at 113.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13a While no order was entered in the delinquency matter setting a Disposition hearing on August 11, Judge Seitz indicated at that hearing that he had under advisement and was considering the Disposition of Dahlari as well as Maria. Following the hearing he entered separate interim orders of Disposition: Dahlari was released to her father; Maria was continued in foster care. See fn 20, (infra), for Judge Pratt's findings in this regard.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14a All parties in their briefs, the opinions in the Federal and state court proceedings, including the opinions in this Court, regard as pertinent the events between August 11 and September 7.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15a Similarly see Ohio Bell Telephone Co v Public Utilities Commission of Ohio, 301 U.S. 292, 300; 57 S Ct 724; 81 L Ed 1093 (1937): \"The fundamentals of a trial were denied to the appellant when rates previously collected were ordered to be refunded upon the strength of evidential facts not spread upon the record.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also Goldberg v Kelly, 397 U.S. 254, 271; 90 S Ct 1011; 25 L Ed 2d 287 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe may indeed in our review of trial court proceedings examine whatever files and documents the trial Judge examined but a trial Judge may not properly examine or consider anything not received as evidence in the case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee Armstrong v Manzo, 380 U.S. 545; 85 S Ct 1187; 14 L Ed 2d 62 (1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe statute provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"If the child is placed in the temporary custody of the court, no supplemental order of Disposition providing permanent custody, or containing any other order of Disposition shall be made except at a hearing pursuant to issuance of summons or notice as provided in sections 12 and 13 of this chapter or at a rehearing provided by section 19 of this chapter.\" MCLA 712A.20; MSA 27.3178(598.20).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16a See In the Matter of Ella B, 30 NY2d 352; 334 NYS2d 133; 285 NE2d 288 (1972); In re Adoption of RI, 455 Pa 29; 312 A2d 601 (1973); State v Jamison, 251 Or 114; 444 P2d 15 (1968); Reist v Bay Circuit Judge, 396 Mich 326, 349; 241 NW2d 55 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17a See MCLA 710.7; MSA 27.3178(547). Now MCLA 710.56; MSA 27.3178(555.56), as enacted in the Michigan Adoption Code, 1974 PA 296, effective January 1, 1975.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18a 42 USC 1983, 1985; 28 USC 1343.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19a See fn 2, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eJudge Barnard also said that the child was no longer a ward of the Juvenile Division since a petition to adopt her had been filed; she was a ward of the Probate Division.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20a Judge Pratt's opinion reads in part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Perhaps the most striking example of this deprivation is the failure to ascertain, or attempt to ascertain, from the plaintiff Dahlari at any time whether she understood the nature of the proceedings and the possible consequences. Her participation in the pertinent hearings, as shown by the transcripts, is limited to the mere mention of her presence. No inquiry was ever directed to her, no invitation to testify or make a statement. With respect to the most devastating testimony -- that of Mrs. Friess that Dahlari had told her Mrs. Weldon had physically abused the baby -- she was not asked to verify or deny. The fact that she was represented by counsel is barely an adequate rebuttal to her testimony, which this Court found credible, that she was not only not advised and did not understand the proceedings, but that she was confused as to which attorney represented her.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Another area of concern is the final order of September 12, 1972, which terminated parental rights. The record does not indicate the reasons for that action nor the basis for the order. On the contrary, the August hearing had produced the testimony of Mr. Weldon as to his ability and willingness to care and support for the baby subject to closest supervision of a court. That hearing was concluded with the stipulation that the Ohio authorities be contacted. Yet there is no indication that they were contacted and, if so, whether the results were favorable or unfavorable to the plaintiff and her parents. If unfavorable and a factor in the determination, fairness would have required some disclosure, or an opportunity to be heard.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"As alluded to earlier, the joint consideration and hearing of both the delinquency case and the termination of parental rights case were inappropriate and could not but be confusing to Dahlari. While involving mutual facts, the issues are separate and distinct and the possibility of obfuscation great to the uninitiated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"This Court is left with this impression -- that the defendants here being heavily concerned with the well-being of the baby Maria, and being frustrated by what may have been or appeared to be challenges, neglected to consider the rights, particularly, of the plaintiff Dahlari. As a result the form gave way to the substance and no real effort was made to assure that the plaintiff Dahlari was fully apprised of her rights, of the nature of the proceedings and of the possible irrevocable consequences. It must be remembered that at that time the principal figure was a 15 year old girl having severe home difficulties, was incarcerated in a juvenile institution and had not seen her child for several months. Such circumstances require much more than the pro forma procedures of service of process, appointment of counsel and presence in a hearing room.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Further, although it is arguable that the delay between the final order of termination of plaintiff Dahlari's parental rights and the filing of the complaint in this Court subverts the statutory three month appeal limitation, such argument loses validity when it is considered that the plaintiff Dahlari was incarcerated during that period and there is no indication that she was advised of any rights she might have.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"In accordance with the foregoing, then, this Court finds that the plaintiffs were deprived of due process in the termination of parental rights matters before the Probate Court for Monroe County and that, therefore, such proceedings are void.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21a The probate court had been added as a party in the Federal court action.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22a Judge Pratt said that \"the great weight of current authority has held that the doctrine of judicial immunity does not bar civil rights actions against Judges or other personnel such as prosecutors for equitable or injunctive relief\". He concluded that he \"must proceed to the merits of plaintiffs' equitable claims\". In deciding the \"type of relief, if any, which may be fashioned,\" he said he was cognizant that he \"must look to the principles of equity, comity and federalism\". \"In making this decision we must look to the factual setting as the case presently stands before the court. This court has conducted a trial on the federal constitutional issues and has determined that the parental rights of plaintiff Dahlari Weldon were terminated by defendants in a manner inconsistent with her procedural rights granted by the Fourteenth Amendment. On the basis of this ruling, new proceedings were instituted in state court resulting in an order requiring Maria to be returned to Dahlari. An appeal from that decision is now pending in the state Court of Appeals.\" (Emphasis by the court.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23a So in original; possibly \"forum\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24a Ehrenzweig on Conflict of Laws, § 47, p 167; Metcalf v Watertown, 153 U.S. 671; 14 S Ct 947; 38 L Ed 861 (1894); Hancock National Bank v Farnum, 176 U.S. 640; 20 S Ct 506; 44 L Ed 619 (1900).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25a Restatement Judgments, § 41; Ehrenzweig, (supra) , § 54, p 196; 1B Moore's Federal Practice, para. 0.416[3], p 2251.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26a Barber v Barber, 323 U.S. 77, 80; 65 S Ct 137; 89 L Ed 82 (1944); Ehrenzweig, (supra) , § 54, p 196.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27a 1B Moore's Federal Practice, para. 0.416[3], p 2252; Huron Holding Corp v Lincoln Mine Operating Co, 312 U.S. 183, 189; 61 S Ct 513; 85 L Ed 725 (1941); Refior v Lansing Drop Forge Co, 134 F2d 894, 896 (CA 6, 1943).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also Restatement Judgments, 2d, Tentative Draft No 1 (1973), § 41, Comment f, pp 5-6.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28a 46 Am Jur 2d, Judgments, § 404, p 571 and § 518, p 669; 6 Callaghan's Michigan Pleading \u0026 Practice, § 42.106, p 540; Restatement Judgments, § 83, p 389.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29a Judge Goodrich, Concurring in Bruszewski v United States, 181 F2d 419, 423 (CA 3, 1950), said: \"Privity states no reason for including or excluding one from the estoppel of a judgment. It is merely a word used to say that the relationship between the one who is a party on the record and another is close enough to include that other within the res judicata.\" Similarly see Developments in the Law -- Res Judicata, 65 Harv L Rev 818, 856 (1952).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Restatement Judgments, 2d, avoids use of the term. See Restatement Judgments, 2d, Tentative Draft No 2 (1975), § 78, p 2 and Tentative Draft No 3 (1976), § 89, p 33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eProfessor Moore defends use of the term:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"It is perhaps difficult to formulate a definitive statement of the doctrine of privity with respect to judicial finality, but the doctrine does have practical scope and limitations. While the existence of privity does depend on particular circumstances, the rational grounds on which the existence of privity may be based are susceptible of some degree of analysis and ascertainment. In most situations where privity has been held to exist, one or more of the following three relationships between the privies are present: concurrent relationship to the same right of property; successive relationship to the same right of property; or representation of the interests of the same person.\" 1B Moore's Federal Practice, para. 0.411[1], p 1255.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30a A person may be represented in litigation by a fiduciary or by some other person, e.g., as in a class action. See Restatement Judgments, 2d, Tentative Draft No 2 (1975) § 85, p 56. Generally, see Restatement Judgments, 2d, Tentative Draft No 2 (1975), §§ 80-87.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee Sea-Land Services, Inc v Gaudet, 414 U.S. 573, 593; 94 S Ct 806; 39 L Ed 2d 9 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31a For example, the persons originally denominated privies: successors to property interests, Restatement Judgments, 2d, Tentative Draft No 3 (1976) §§ 89, 90; derivative or related personal injury claims, Restatement Judgments, 2d, Tentative Draft No 3 (1976), § 92 et seq. For others, see Restatement Judgments, 2d, Tentative Draft No 3 (1976), § 95 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32a \"his Court is justified in saying that there has been a failure of due process only in those cases where it cannot be said that the procedure adopted, fairly insures the protection of the interests of absent parties who are to be bound by it. [Citation omitted.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"It is familiar doctrine of the federal courts that members of a class not present as parties to the litigation may be bound by the judgment where they are in fact adequately represented by parties who are present, or where they actually participate in the conduct of the litigation in which members of the class are present as parties [citations omitted], or where the interest of the members of the class, some of whom are present as parties, is joint, or where for any other reason the relationship between the parties present and those who are absent is such as legally to entitle the former to stand in judgment for the latter.\" Hansberry v Lee, 311 U.S. 32, 42-43; 61 S Ct 115; 85 L Ed 22 (1940). See also Blonder-Tongue Laboratories, Inc v University of Illinois Foundation, 402 U.S. 313, 329; 91 S Ct 1434; 28 L Ed 2d 788 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33a See Note, Collateral Estoppel of Nonparties, 87 Harv L Rev 1485, 1504 (1974); Comment, The Expanding Scope of the Res Judicata Bar, 54 Texas L Rev 527 (1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34a See Restatement Judgments, 2d, Tentative Draft No 3 (1976) § 74(2)(a), p 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePersons standing in loco parentis have been permitted to contest the custody provisions of a divorce decree. See Anno, Child Custody Provisions of Divorce or Separation Decrees as Subject to Modification of , 4 ALR3d 1277, §§ 8, 15. See fn 37.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35a MCLA 710.21 et seq.; MSA 27.3178(555.21) et seq.; 1974 PA 296, effective January 1, 1975.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36a MCLA 710.1 et seq.; MSA 27.3178(541) et seq., repealed by 1974 PA 296, effective January 1, 1975.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37a The identity of adoptive parents is confidential. MCLA 710.11; MSA 27.3178(551). Now MCLA 710.67; MSA 27.3178(555.67). See also MCLA 710.7b; MSA 27.3178(547b), repealed by 1974 PA 296, and MCLA 326.12; MSA 14.232. See People ex rel Scarpetta v Spence-Chapin Adoption Service, 28 NY2d 185, 195; 321 NYS2d 65; 269 NE2d 787 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe confidentiality of adoption records need not be an obstacle to joinder of prospective adoptive parents. The commencement of litigation challenging the validity of a termination order would be \"good cause\" for disclosure within the meaning of the statute. The probate court might, as did Judge Barnard in this case, preserve confidentiality by himself seeing to it that process naming, as, say, Mr. and Mrs. William Roe, the prospective adoptive parents is served upon them and by filing a proof of service in the court where the action is pending. The prospective adoptive parents, in such a manner, would learn of the pendency of the action and have an opportunity to participate in their own names or by counsel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38a 1B Moore's Federal Practice, para. 0.411[6]; Restatement Judgments, 2d, Tentative Draft No 2 (1975), § 83.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee Cauefield v Fidelity \u0026 Casualty Co of New York, 378 F2d 876 (CA 5, 1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39a See fn 37, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40a Their motion of January 14, 1975 to intervene was denied on February 6, 1975.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41a Judge Kelley's opinion recites that all counsel stated that they did not desire to offer any evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42a See also Irvin v Dowd, 366 U.S. 717; 81 S Ct 1639; 6 L Ed 2d 751 (1961); Webb v Texas, 409 U.S. 95; 93 S Ct 351; 34 L Ed 2d 330 (1972); In re Gault, 387 U.S. 1; 87 S Ct 1428; 18 L Ed 2d 527 (1967); Turner v Louisiana, 379 U.S. 466; 85 S Ct 546; 13 L Ed 2d 424 (1965). Cf. Yick Wo v Hopkins, 118 U.S. 356, 373; 6 S Ct 1064; 30 L Ed 220 (1886).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43a See Reist v Bay Circuit Judge, supra at 338.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44a In Dow v Michigan, 396 Mich 192, 206, fn 21; 240 NW2d 450 (1976), we said that \"ven if the right to redeem [from a tax foreclosure sale] were not constitutionally rooted, once granted by statute it is protected by the Due Process Clause.\" In so holding we relied on Arnett v Kennedy, 416 U.S. 134, 167, 177, 211; 94 S Ct 1633; 40 L Ed 2d 15 (1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45a Cf. Fritts v Krugh, supra at 116.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46a See Reist v Bay Circuit Judge, supra at 349.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47a In re Luscier, 84 Wash 2d 135; 524 P2d 906 (1974); Danforth v State Department of Health \u0026 Welfare, 303 A2d 794, 796-797 (Me, 1973); In the Matter of Ella B, 30 NY2d 352, 356-357; 334 NYS2d 133; 285 NE2d 288 (1972); In re Friesz, 190 Neb 347; 208 NW2d 259 (1973); State v Jamison, 251 Or 114; 444 P2d 15 (1968); In re Adoption of RI, 455 Pa 29; 312 A2d 601 (1973); Reist v Bay Circuit Judge, supra at 342.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48a \"The validity of the adversary system and the legal and ethical requirements of the profession obligate the attorney to provide diligent and skillful representation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Counsel must be 'reasonably likely to render and rendering reasonably effective assistance'. [Beasley v United States] 491 F2d 687, 696 [CA 6, 1974].\" People v Strodder, 394 Mich 193, 210, 218-219; 229 NW2d 318 (1975) (Williams, J., Concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49a See fn 12 and text accompanying and following fn 12, text accompanying fns 15 and 16, and fn 20.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50a \"Comity is not a rule of law, but one of practice, convenience, and expediency. It is something more than mere courtesy, which implies only deference to the opinion of others, since it has a substantial value in securing uniformity of decision, and discouraging repeated litigation of the same question. But its obligation is not imperative. If it were, the indiscreet action of one court might become a precedent, increasing in weight with each successive adjudication, until the whole country was tied down to an unsound principle. Comity persuades; but it does not command. It declares, not how a case shall decide, but how it may with propriety be decided. It recognizes the fact that the primary duty of every court is to dispose of cases according to the law and the facts; in a word, to decide them right. In doing so, the Judge is bound to determine them according to his own convictions. If he be clear in those convictions, he should follow them. It is only in cases where, in his own mind, there may be a doubt as to the soundness of his view that comity comes in play and suggests a uniformity of ruling to avoid confusion, until a higher court has settled the law. It demands of no one that he shall abdicate his individual judgment, but only that deference shall be paid to the judgments of other coordinate tribunals. Clearly it applies only to questions which have been actually decided, and which arose under the same facts.\" Mast, Foos \u0026 Co v Stover Manufacturing Co, 177 U.S. 485, 488-489; 20 S Ct 708; 44 L Ed 856, 858 (1900).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSimilarly see Lauer v Freudenthal, 96 Wash 394; 165 P 98 (1917).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51a US Const, Am XIV; Const 1963, art 1, § 17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52a The Does have not caused a transcript of the proceedings before Judge Kelley to be prepared. Judge Kelley's opinion states that no evidence was offered. See fn 41, (supra) .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53a \"'Best interests of the child' means the sum total of the following factors to be considered, evaluated and determined by the court:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(a) The love, affection and other emotional ties between the competing parties and the child.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(b) The capacity and Disposition of competing parties to give the child love, affection and guidance and continuation of the educating and raising of the child in its religion or creed, if any.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(c) The capacity and Disposition of competing parties to provide the child with food, clothing, medical care or other remedial care recognized and permitted under the laws of this state in lieu of medical care, and other material needs.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(d) The length of time the child has lived in a stable, satisfactory environment and the desirability of maintaining continuity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(e) The permanence, as a family unit, of the existing or proposed custodial home.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(f) The moral fitness of the competing parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(g) The mental and physical health of the competing parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(h) The home, school and community record of the child.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(i) The reasonable preference of the child, if the court deems the child to be of sufficient age to express preference.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(j) Any other factor considered by the court to be relevant to a particular child custody dispute.\" MCLA 722.23; MSA 25.312(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54a \"In all actions now pending or hereafter filed in a circuit court involving dispute of custody of a minor child, the court shall declare the inherent rights of the child and establish the rights and duties as to custody, support and visitation of the child in accordance with this act.\" MCLA 722.24; MSA 25.312(4).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55a \"When the dispute is between parents, between agencies or between third persons, the best interests of the child shall control. When the dispute is between the parent or parents and an agency or a third person, it is presumed that the best interests of the child are served by awarding custody to the parent or parents, unless the contrary is established by clear and convincing evidence.\" MCLA 722.25; MSA 25.312(5).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56a MCLA 722.26; MSA 25.312(6).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57a \"It is totally inappropriate to weigh the advantages of a foster home against the home of the natural and legal parents. Their fitness as parents and the question of neglect of their children must be measured by statutory standards without reference to any particular alternative home which may be offered the children.\" Fritts v Krugh, supra at 115.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58a Westoff, Kids with Kids, New York Times Magazine, February 22, 1976; Duffy, Unwed Motherhood, Detroit Free Press, May 31, 1976.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59a \"To point out the misconception of the court in this proceeding, we find the court, after the jury had returned its verdict and before being discharged, pronouncing this novel philosophy:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"'I do not know what eventual Disposition I may make with respect to the placement of the child but I do know that every child we have had available for adoption we have nine or ten parents ready and willing and anxious to take them.'\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Apparently the court was more concerned with providing sufficient children for adoption by childless couples than in safeguarding the rights of natural parents, and assumed the attitude that any one who is convicted of a felony is fair game for the accomplishment of this purpose. The court was not alone in this viewpoint because, as noted above, the juvenile officer also said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"'* * * there being hundreds of people physically unable to bring children into this world, and they have longed for years for such a little child in their home, and this little child should have every benefit and opportunity that any little child in the world should have. * * *'\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"These are popular sentiments, expressed in cryptic words, but they have no part in a dependency proceedings and cannot justify either the court or its officers in depriving the mother of her natural rights.\" Diernfeld v People, 137 Colo at 243-244; 323 P2d at 631. (Emphasis by the Court.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60a The quoted phrases are from § 3 of the Child Custody Act defining the term \"best interests of the child\". See fn 53, (supra) , for text of § 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe agree with the guardian ad litem that the factors to be considered under § 3 of the Child Custody Act inevitably favor foster parents over natural parents. We quote from her brief:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\" review of the factors listed as determinative of the best interests of a child indicates that in almost every case where the natural parent has lost or been deprived of custody for a significant period of time and later seeks to regain custody as opposed to keep custody, and where both the natural parent and foster parent are fit, the presumption in favor of the natural parent will be overcome and the natural parent will lose custody. * * * Factors (a), (d) and (i) clearly favor continuing the child in its present situation, and factors (b) and (e) emphasize continuity and permanence. Thus it would appear that unless the natural parent can show a moral superiority, or better mental or physical health, or a greater capacity to love or provide for the material needs of the child, the presumption will be overcome, and the natural parent will lose custody.\" (Emphasis by author.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eProbate courts do not terminate parental rights of parents who are not at least arguably unfit. Generally they will be disadvantaged parents. Probate courts do not entrust children easily placed for adoption with foster parents who are disadvantaged. A disadvantaged, arguably unfit parent is foreordained to lose in a § 3 comparison with foster parents. Application of the § 3 standard in a case such as this where parental rights have not been properly terminated would be tantamount to allowing the state, on the strength of its error, to transfer custody of children from disadvantaged parents to advantaged parents. The disadvantaged lose their children to the advantaged in the last analysis simply because they are disadvantaged.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61a \"It is not denied that the plaintiff in error was twice convicted of felonies, but this is not alone sufficient to invoke the jurisdiction of the county or juvenile court in dependency matters. We cannot hold that every convicted felon, by that fact alone, loses all parental rights in children. Social workers and mothers may wish that parents had turned out better or that their children had received a 'better break' in life. But not every sin of the father or mother is visited upon the children. It is not one of the punishments prescribed by law that conviction of a felony works also for forfeiture of parental rights.\" Diernfeld v People, 137 Colo at 244; 323 P2d at 631.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62a Judge Seitz was apparently of the opinion that he could terminate Dahlari's parental rights if he decided she was a delinquent child. At the July 11, 1972 adjudication hearing he interjected after Dahlari's counsel established that Frank Weldon was able and willing to support Dahlari and Maria in the family home in Ohio:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The Court: This is pre-supposing that the mother of the minor child is considered fit and competent and is released from custody of the court. She is presently a temporary ward of the court and retained in the shelter facility. Let the record make that clear.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eJudge Seitz entered an order terminating Dahlari's parental rights the same day he made her a temporary ward of the court and committed her to the Department of Social Services for placement. He may have supposed that since Dahlari was to be committed, Maria was neglected. There is, however, no necessary relationship between Dahlari's delinquency and the adequacy of Maria's care and support. See Diernfeld v People, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAn unmarried mother who is a minor has the same parental right to her child as an adult unmarried mother. Just as the probate court could not terminate the parental rights of an unmarried woman simply because she had been incarcerated by an adult court (see fn 61, (supra) , and accompanying text), as long as her child was adequately cared for and supported, so too the probate court may not take a minor mother's child from her simply because it has confined the mother on a finding of delinquency.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63a Diernfeld v People, supra at 244; 323 P2d 631.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64a Sovereign v Sovereign, 354 Mich 65; 92 NW2d 585 (1958); In re Mark T, 8 Mich App 122, 142; 154 NW2d 27 (1967); Finlay v Finlay, 240 NY 429, 433-434; 148 NE 624; 40 ALR 937 (1925); 4 Pomeroy, Equity Jurisprudence, (5th ed) § 1307, p 874.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65a Meyer v Nebraska, 262 U.S. 390; 43 S Ct 625; 67 L Ed 1042 (1923); Reist v Bay Circuit Judge, supra; Stanley v Illinois, 405 U.S. 645; 92 S Ct 1208; 31 L Ed 2d 551 (1972); In the Matter of LaFlure, 48 Mich App 377; 210 NW2d 482 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66a Stanley v Illinois, supra at 652.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67a The Does rely on In re Mark T, 8 Mich App 122; 154 NW2d 27 (1967). There too the Court acted to preserve the bond between a natural parent and his child against unwarranted state interference.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68a See also State ex rel Acton v Flowers, 154 W Va 209; 174 SE2d 742 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69a In the following cases which have been cited, the custody rights of the parent were terminated or modified by a decree of divorce: Bahr v Bahr, 60 Mich App 354; 230 NW2d 430 (1975); Coulter v Coulter, 141 Colo 237; 347 P2d 492 (1959); Root v Allen, 151 Colo 311; 377 P2d 117 (1962); Halstead v Halstead, 259 Iowa 526; 144 NW2d 861 (1966); People ex rel Edwards v Livingston, 42 Ill 2d 201; 247 NE2d 417 (1969); and Wilson v Mitchell, 48 Colo 454; 111 P 21 (1910).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70a In Borsdorf v Mills, 49 Ala App 658; 275 So 2d 338 (1973), the child was removed from the mother's custody on clear and compelling evidence of neglect. In In the Matter of Nathan \u0026 Cathy M v Catholic Guardian Society, 76 Misc 2d 1003; 352 NYS2d 319 (1973), the parents placed the children with the Bureau of Child Welfare and were found to be unfit to assume their parental functions and to minister to the needs of the children. In In the Matter of Catherine S \u0026 Darlene S, 74 Misc 2d 154; 347 NYS2d 470 (1973), the mother had abandoned the child, leaving her with another woman. A neglect petition was filed, a warrant was issued and the child was \"paroled\" to the other woman. In People v Hoerner, 6 Ill App 3d 994; 287 NE2d 510 (1972), there was a finding of abandonment and unfitness. In In re One Minor Child, 254 A2d 443 (Del, 1969), there was a finding of neglect. In In the Matter of the Guardianship of Dawn Palmer, 81 Wash 2d 604; 503 P2d 464 (1972), the maternal grandmother was made legal guardian on a finding of unfitness.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Giacopelli v Florence Crittenton Home, 16 Ill 2d 556; 158 NE2d 613 (1959), the mother placed the child for adoption. In In the Matter of the Adoption of Baby Boy Krueger, 104 Ariz 26; 448 P2d 82 (1968), the mother consented to adoption. In Adoption of a Minor, 362 Mass 842; 291 NE2d 729 (1973), the mother consented to adoption and then sought to withdraw her consent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn In the Matter of Confessora B, 75 Misc 2d 576; 348 NYS2d 21 (1973), the mother placed the child with foster parents. In Painter v Bannister, 258 Iowa 1390; 140 NW2d 152 (1966), the child was entrusted to his maternal grandparents by his father. Munoz v Munoz, 79 Wash 2d 810, 489 P2d 1133 (1971), is not a custody dispute; divorced parents did not agree on the religious training of their minor children.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71a \"Every child born in the United States has, from the time it comes into existence, a birthright of citizenship which vests it with rights and privileges, entitling it to governmental protection.\" In re Gould, 174 Mich 663, 669-670; 140 NW 1013 (1913).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72a Similarly, in Fritts v Krugh, supra at 117, this Court said:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"We affirm the decision of the circuit Judge but remand these matters for the entry of orders allowing a reasonable time for the transfer of physical custody from the present foster parents to the parents under the supervision of the appropriate arm of the court with the purpose of occasioning as little damage as possible in the lives of these children.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eGenerally, see de Funiak, Handbook of Modern Equity (2d ed), p 42; McClintock on Equity (2d ed), § 30, p 78; Dobbs, Remedies, pp 52 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73a Maria had been in the Weldon home for approximately the same period of time.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74a Wald, State Intervention on Behalf of \"Neglected\" Children: A Search for Realistic Standards, 27 Stanford L Rev 985 (1975); Wald, State Intervention on Behalf of \"Neglected\" Children: Standards for Removal of Children from Their Homes, Monitoring the Status of Children in Foster Care, and Termination of Parental Rights, 28 Stanford L Rev 625 (1976).\u003c/span\u003e\n\n",
    "body_length": 203670,
    "citedas": [
      "244 N.W.2d 827",
      "397 Mich. 225"
    ],
    "attorneys": "Thomas E. Griffin, Jr., Frederick B. Bellamy, and Alan G. Gilchrist, for the Does. Gabe Kaimowitz for Dahlari H. Weldon. Bettye S. Elkins, guardian ad litem for Maria Weldon.",
    "category": [
      "158",
      "243",
      "75"
    ],
    "judges": "Williams, J. Coleman, J., Concurring and Dissenting. Fitzgerald, J., concurred with Coleman, J. Levin, J., Concurring and Dissenting. Kavanagh, C. J., concurred with Levin, J. Lindemer and Ryan, JJ., took no part in the decision of this case.",
    "citation_count": 0
  }
}
