{
  "id": "6bhoTmYBTlTomsSBgq7k",
  "document": {
    "title": "State v. Williams",
    "full_title": "STATE OF NEW JERSEY v. JAMES EDWARD WILLIAMS",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1988-12-08T00:00:00.000Z",
    "docket": "No. A-4",
    "body": "In January 1984, a Mercer County jury convicted the defendant, James Edward Williams, of the murder of Beverly Mitchell and thereafter sentenced him to death. He appeals directly to this Court as of right. R. 2:2-1(a)(3). We reverse both the conviction and the sentence. We find as the basis for reversal of both phases the failure of the trial court to assure that the jury was impartial. We find further reversible error in the penalty phase jury instructions. We remand this matter for a new trial of both the guilt and penalty proceedings in accordance with this opinion.\n\nI.\n\nFacts\n\nAt approximately 4:00 p.m. on Thursday, December 30, 1982, twenty-three year old Beverly Mitchell arrived for work at the Bellevue Care Center, a Trenton nursing home. Mitchell, a full-time teacher at Trenton High School, held a part-time position as a receptionist at the Center, where on weekdays she worked the 4:30 to 7:30 p.m. shift. She occupied a desk in the reception area, and controlled access to the normally-locked front door. As late as 6:05 p.m. on that day, she was seen sitting at her typewriter alone in the reception area. A nurse at the Center noticed sometime shortly before 6:45 p.m. that Mitchell was not at her desk. At about 6:45, the nurse entered\n\nan office adjoining the reception area, turned on the light, and found Beverly Mitchell's dead body lying on the floor.\n\nThe scene was gruesome. The victim lay face down and naked, her clothing strewn about the room. There was blood on the floor, the walls, and the furniture. Under the body, investigators found an undergarment, some pieces of jewelry, and a steak knife covered with blood.\n\nThe autopsy determined that Beverly Mitchell had been stabbed thirty-six times: there were twenty-one wounds on the back, seven on the front, and eight defense wounds on the body. Additionally, there were bruises, contusions, and abrasions in numerous areas of the body, and the victim's throat was slashed. The medical examiner found that the throat slashing and the defense wounds were superficial and would not have killed or immobilized the victim. The wounds to the front of the body would not, in her estimation, have immediately killed or immobilized the victim either; it was the wounds to the back that were fatal. The medical examiner concluded that the steak knife discovered at the scene could have been the murder weapon, but that another knife could also have been used. It was also her opinion that the victim had been sexually assaulted, although she found no trauma to the genital area.\n\nTwo days after the murder, defendant's mother, Sharon Ildefonso, and younger brother, Dennis Floyd, came forward. Floyd said that he had accompanied defendant to the Bellevue Care Center on the evening of December 30 and had witnessed the killing. His testimony would become the foundation of the State's case against James Williams.\n\nAlthough brothers, Floyd and Williams had known each other only a few months at the time of the murder, having been raised in separate foster homes. They nonetheless had become companions, with Floyd, who was seventeen or eighteen, tending to follow his twenty-one year-old brother's lead. So it was the evening of the killing.\n\nAccording to Floyd's testimony, the two brothers spent the late afternoon of December 30 drinking beer with four friends at Williams' apartment. Williams had \"seemed to be okay,\" but at some point during the gathering began speaking and acting aggressively. He spoke more than once of \"going to make some money tonight\" and going to \"beat up some white boys,\" at one point placing a knife in his belt and repeating the statement about making money. Floyd testified that he did not take this statement seriously, since defendant was employed as a construction worker and was not, to Floyd's knowledge, in need of money. Though not knowing his brother's destination, Floyd accompanied Williams as he left the apartment and walked to Bellevue Avenue. As the two young men approached the Bellevue Care Center, Floyd pointed out the Center as the place where his foster grandmother had died.\n\nWilliams proceeded to the main entrance of the Center, his brother following. Defendant opened the door -- whether it had been locked Floyd did not know -- and stated to the young black woman in the reception area that he wanted to see a Mr. Hoffman. The woman indicated that Mr. Hoffman was on the second floor, and Floyd walked toward the elevator. Defendant, however, approached the woman and began pushing her into a back room. Floyd followed. Once in that room, defendant closed the door and turned out the lights and then ordered the victim to take off her clothes. She started to comply, but then stopped, at which point defendant \"got mad\" and began hitting her. The victim, in a scared voice, cried, \"Jesus help me.\"\n\nWhat followed, according to Floyd's testimony, was a horrendous sequence of events in which defendant raped and stabbed the victim while Floyd passively stood by, gripped by fear. The 6'6\" Williams forced the 5'2\" victim to the floor, where she lay on her back. Floyd testified that defendant appeared to penetrate the victim. She screamed; he put his hand over her mouth and then \"started cutting her.\" The victim eventually managed to stand up, at which point defendant stabbed her in\n\nthe back. After the victim fell to the floor on her face, defendant got down on one knee and \"started stabbing her in the back.\" Williams then attempted to give his brother the knife and have him \"stab her a couple of times.\" Floyd refused. Defendant then began looking around to see if he had dropped anything, saying that he did not want to leave any evidence. \"He asked me if I touched anything,\" Floyd recounted at trial, \"and I said no.\" On the way out, Williams took the victim's pocketbook.\n\nWilliams was limping slightly and bleeding from his leg as he left the scene of the crime; he blamed his stab wound on his brother's nervousness, and told Floyd that \"the last person who was nervous I iced him.\" He later rubbed blood on the elbows of his brother's coat. He told Floyd that he had stabbed the woman in her lungs, liver, and heart to make sure that she was dead.\n\nThe two brothers proceeded back to Williams' apartment, where defendant hid the knife he had with him under some blankets. Williams dumped the contents of Beverly Mitchell's pocketbook on the floor of the apartment, searched for money and credit cards, then put everything back into the pocketbook. Defendant then washed his hands and changed coats, though he did not change his bloodstained jeans and boots. Floyd also changed his jacket on defendant's instructions. The two men went out again, proceeding first to a site along the Delaware River, where defendant put a rock into the pocketbook and tossed it into the water, and then to various points in Trenton in an effort to establish an alibi. On the way through Trenton, they passed the Bellevue Care Center; \"as he passed Bellevue, he said they don't know yet. And he started laughing.\" At one point during the journey around Trenton, Williams bought and smoked \"what looked like a white joint\" in order, he later told Floyd, \"to help him handle what he did.\" Floyd testified, however, that he had not seen Williams using drugs earlier in the day, and that he had noticed nothing impaired in defendant's motor skills.\n\nFloyd remained silent about the murder for two days, telling only his mother, Sharon Ildefonso, with whom he was then living. Both were fearful of defendant. Their decision to come forward came after Williams made an unannounced visit to the Ildefonso apartment on January 1 with \"a bag full of bloody clothes,\" which he and Floyd proceeded to wash at the laundromat across the street. While at the laundromat, defendant stated that he intended to kill his mother's minister. The brothers returned to the Ildefonso apartment, where Floyd saw that defendant was carrying a gun. After Williams left, Floyd and Ildefonso decided to contact the authorities.\n\nThe following day, Williams was arrested. A search of his apartment uncovered, among other items, the jeans, coat, and boots that defendant wore on the evening of the murder, a serrated steak knife, a blood-stained cloth, a pellet gun, and copies of two local newspapers with articles providing details of the murder of Beverly Mitchell. On January 3, 1983, Beverly Mitchell's pocketbook was recovered from the Delaware River. Inside were found, in addition to the victim's belongings, two letters addressed to James Williams.\n\nOn April 15, 1983, a Mercer County Grand Jury indicted defendant on the following charges: knowing and purposeful murder by his own conduct, in violation of N.J.S.A. 2C:11-3a(1) and (2) (count one); murder during the course of a robbery, in violation of N.J.S.A. 2C:11-3a(3) (count two); robbery while armed with a knife, in violation of N.J.S.A. 2C:15-1 (count three); robbery, in violation of N.J.S.A. 2C:15-1 (count four); murder during the course of an aggravated sexual assault, in violation of N.J.S.A. 2C:11-3a(3) (count five); aggravated sexual assault while armed, in violation of N.J.S.A. 2C:14-2a(4) (count six); aggravated sexual assault, in violation of N.J.S.A. 2C:14-2a(6) (count seven); murder during the course of a burglary, in violation of N.J.S.A. 2C:11-3a(3) (count eight); burglary while armed with a knife, in violation of N.J.S.A. 2C:18-2\n\n(count nine);\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and possession of a knife for an unlawful purpose, in violation of N.J.S.A. 2C:39-4d (count ten). Counts four, six, and ten were later dismissed on motion of the prosecution. Dennis Floyd was not indicted in connection with the murder.\n\nDefendant brought a number of pretrial motions, the denial of which he now challenges. These include a motion to allow attorney-conducted voir dire, a motion to permit voir dire questioning regarding racial prejudice, a motion to implement a struck jury system for the exercise of peremptory challenges, and a motion for additional peremptory challenges.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nJury selection began on January 3, 1984, and continued for nine days. The defense exhausted all twenty peremptory challenges before the final jury was seated; the State exercised ten of its twelve peremptories. Seven jurors were excluded for cause because of biases regarding capital punishment, six for their opposition to the death penalty, and one for his support of it in all murder cases. The court refused to excuse for cause one juror who initially stated that she would impose the death penalty in all murder cases regardless of the circumstances; this prospective juror was challenged peremptorily by the defense. Sixteen jurors were excluded for reasons unrelated to their death penalty views, and two were excused by consent. The voir dire was marked by repeated defense objection to the\n\nlimited scope of the court's questioning, especially with respect to the juror's attitudes toward imposition of the death penalty.\n\nAt trial the prosecution's principal witness was Dennis Floyd, who gave the above-summarized account of the events surrounding the murder of Beverly Mitchell. Other prosecution witnesses corroborated the essential aspects of Floyd's version of the events that occurred before and after the murder. One witness confirmed Floyd's description of Williams' aggressive behavior at the apartment, and agreed that defendant had seemed relatively sober. Several noted the strangeness of Williams' behavior later that evening, and in particular referred to defendant's seeming obsession with a threat posed by \"poison bubbles in the water.\" They also testified to Floyd's timid passivity while in defendant's company.\n\nThroughout the trial, the prosecution emphasized the brutality of the crime and the character of the victim. The opening statement began by noting that Beverly Mitchell was \"[b]right, beautiful, educated, religious, a member of her church choir,\" and went on to detail her background. The prosecution's direct examination of the victim's mother similarly belabored, over defense counsel's repeated objections, favorable aspects of the victim's lifestyle. References to the victim's background were also made during summation. Such references caused the defense to move for a mistrial both immediately after the prosecution's opening and following its summation, but these motions were denied on the ground that \"a certain amount of background\" is permissible.\n\nThe defense conceded Williams' presence at the scene of the murder, but argued that Dennis Floyd's account was self-serving and could not be trusted. The defense pointed out inconsistencies in the details of Floyd's testimony and contended, on the basis of testimony from defendant's friends present at Williams' apartment prior to the crime, that defendant had been\n\nusing drugs on that day and was intoxicated at the time of the killing.\n\nOn January 31, 1984, the jury returned a verdict of guilty on all counts.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nDuring the penalty phase, the prosecution continued, again over objection, to refer to the victim's character and background. The prosecution sought to establish that the murder was outrageously and wantonly vile and that it occurred in the course of the commission of a sexual assault, both facts constituting statutory aggravating factors. It introduced photographs of the victim's body and testimony from the medical examiner, who concluded that the victim remained conscious and able to feel pain after the frontal wounds were inflicted, and that the victim lived several minutes after sustaining the fatal back wounds.\n\nThe defense sought to establish, inter alia, that Williams was acting under the influence of extreme mental or emotional disturbance and that his capacity to conform his conduct to the requirements of law was significantly impaired by intoxication and/or mental disease. It drew largely on records from the Division of Youth and Family Services (DYFS), which had dealt with defendant from the time he was fifteen months old. The evidence suggested that Williams' life had been filled with\n\ninstability and emotional trauma from the first; the highlight of this life history was the incident in which, at age nine, defendant had accidently shot his younger brother to death. His childhood had been marked by numerous foster care placements and inadequate psychiatric intervention. The defense also introduced evidence that in November 1982, Williams, a construction worker, had been hit in the head by a load of falling cinder block, after which his behavior began to change in an alarming fashion. It was apparently at this point that defendant became fixated on the threat from \"poison bubbles in the water.\"\n\nThe jury found that both aggravating factors existed in this case, i.e., that the murder was outrageously and wantonly vile and occurred in the course of the commission of a sexual assault. It rejected as mitigating factors defendant's age at the time of the murder (twenty-one), his alleged extreme mental or emotional disturbance, and his alleged diminished capacity, but did find that some \"other relevant mitigating factor\" existed. The jury, operating under the capital punishment charge that has since been invalidated by this Court, State v. Biegenwald, 106 N.J. 13, 53-67 (1987), found that the mitigating factor failed to outweigh each aggravating factor, and therefore imposed the death penalty.\n\nWe note at the outset that (as the State acknowledges) our holding in Biegenwald compels reversal of the penalty phase of the proceedings below. \"[I]n order for the death penalty to be imposed, the State must prove beyond a reasonable doubt that the aggravating factors outweigh the mitigating factors.\" Id. at 67. Our opinion cannot be limited to this conclusion, however, as defendant raises substantial challenges to the guilt phase as well. Moreover, since other issues raised by defendant, though not essential to our holding, may have a significant bearing on the course of other future capital proceedings, those issues will also be treated.\n\nII.\n\nA. Adequacy of the Voir Dire\n\nDefendant argues that the conviction below should be reversed because the manner in which the trial court conducted the voir dire was so inadequate, when viewed as a whole, that it violated defendant's federal and state constitutional right to a fair trial by an impartial jury. This broad-based attack alleges that the trial court repeatedly asked perfunctory questions regarding jurors' attitudes -- both pro and con -- toward the death penalty, their exposure to pre-trial publicity, and preconceived opinions concerning the guilt of the defendant. The inadequate questioning, it is argued, left the defense insufficiently informed to make an intelligent and effective challenge of potential jurors for cause or peremptorily.\n\nWe agree with defendant's contentions concerning the overall inadequacy of this voir dire. We need not, however, reach the question whether the inadequacy of the voir dire would, by itself, warrant reversal. Rather, we hold that this inadequacy, when combined with the trial court's erroneous refusal to dismiss prospective juror Pfeiffer for cause, which effectively resulted in defendant's loss of a peremptory challenge, requires reversal of both the guilt and penalty proceedings.\n\nThe perfunctory nature of the trial court's questioning of jurors not only forced the defense to exercise its peremptory challenges in an uninformed -- almost random -- manner, it also undercut the ability of the prosecutor to exercise her peremptory challenges effectively. Moreover, the lack of significant information regarding jurors' attitudes on a host of issues effectively denied both parties the ability to challenge jurors for cause, and perhaps most importantly left the trial court unable to fairly evaluate the fitness of many of the jurors to serve. Thus, both parties were forced to use a significant number of peremptory challenges to strike jurors who had given responses that were impossible to interpret or who with a more complete record would be dismissible for cause. This effectively reduced\n\nthe number of challenges at each party's disposal and thereby reduces our confidence in the panel that actually was selected. Even in a case such as this, where the evidence of guilt is compelling, the right to a fair trial must be diligently protected to insure that all defendants, regardless of the crime charged or the weight of the evidence produced, are tried by a fair and impartial jury.\n\nAlthough a significant portion of the errors that we have identified concerned death qualification, our complete review of this jury selection process compels us to conclude that the questioning of numerous jurors was so woefully inadequate that these errors infected not only the penalty phase of this trial, but also seriously undermines our confidence in the fairness and impartiality of the guilt proceeding. Counsel must be afforded the opportunity for a thorough voir dire to evaluate and assess jurors' attitudes in order to effectively participate in jury selection. If counsel is unable to screen out prejudice and bias, that inevitably leads to unfair juries. This result -- or the possibility of this result -- cannot be tolerated.\n\nIt is axiomatic that an impartial jury is a necessary condition to a fair trial. See Sheppard v. Maxwell, 384 U.S. 333, 362-63, 86 S. Ct. 1507, 1522-23, 16 L. Ed. 2d 600, 620 (1966); Estes v. Texas, 381 U.S. 532, 85 S. Ct. 1628, 14 L. Ed. 2d 543, reh. den., 382 U.S. 875, 86 S. Ct. 18, 15 L. Ed. 2d 118 (1965). At an earlier stage of this case, this Court emphasized the right to trial by an impartial jury, secured by Article I, paragraph 10 of the New Jersey Constitution as well as the sixth amendment of the United States Constitution, that a jury panel be \"as nearly impartial 'as the lot of humanity will admit.'\" State v. Williams (I), 93 N.J. 39, 60-61 (1983) (citations omitted). \"This requirement of fairness -- and particularly jury impartiality -- is heightened in cases in which the defendant faces death.\" Id. at 61; State v. Ramseur, 106 N.J. 123, 324 n. 84 (1987).\n\nIn order to insure the impartiality of the jury, we have emphasized the critical importance of the voir dire in exposing\n\npotential and latent bias. Williams (I), supra, 93 N.J. at 68. In Williams (I) we suggested that trial courts\n\nconsider the efficacy of more exhaustive and searching voir dire examinations. The court in conducting the voir dire should be particularly responsive to the requests of counsel regarding the examination of prospective jurors as to potential bias. The court could consider whether there should be a greater willingness to resolve doubts in favor of the defendant in excusing jurors for cause. Particularly in capital cases, trial judges should exercise extraordinary care in the voir dire of potential jurors and could excuse for cause any juror who has been exposed to sensational prejudicial publicity, especially where such exposure is repeated and involves patently inadmissible evidence. The court should also be mindful of the need to fashion effective cautionary jury instructions and to increase the frequency of their application. [ Id. at 68-69 (footnotes omitted).]\n\nVoir dire procedures and standards are traditionally within the broad discretionary powers vested in the trial court and \"its exercise of discretion will ordinarily not be disturbed on appeal.\" State v. Jackson, 43 N.J. 148, 160 (1964), cert. den. sub nom. Ravenell v. New Jersey, 379 U.S. 982, 85 S. Ct. 690, 13 L. Ed. 2d 572 (1965). In State v. Singletary, 80 N.J. 55 (1979), we discussed the rationale for this deference to the trial court:\n\nDecisions concerning the potential bias of prospective jurors are primarily subjective in nature. They require at bottom a judgment concerning the juror's credibility as he responds to questions designed to detect whether he is able to sit as a fair and impartial trier of fact. Consequently, such evaluations are necessarily dependent upon an observation of the juror's demeanor during the course of voir dire -- observations which an appellate court is precluded from making.\n\nInasmuch as the trial judge observed the venireman's demeanor, he was in a position to accurately assess the sincerity and credibility of such statements, and we should therefore pay due deference to his evaluation. . . . [ Id. at 63-64 (citations omitted).]\n\nOn reviewing capital jury voir dire proceedings in State v. Biegenwald, supra, 106 N.J. at 35-37, and State v. Ramseur, supra, 106 N.J. at 256-57, we found in each case the trial court's approach to the problems of death qualification and pre-trial publicity entitled to deference. We further noted in Ramseur that \"[a] sensitive weighing and appraisal of a juror's entire response must be made by the trial court in its duty to\n\nresolve the question of whether the juror has shown bias or prejudgment. . . .\" 106 N.J. at 257. It has also been observed that this Court is \"perhaps too far removed\" from the realities of the voir dire to appreciate the nuances concealed by a \"bloodless record\"; therefore deference to the trial court is usually prudent. Id. at 260 (quoting State v. Gilmore, 103 N.J. 508, 547 (1986) (Clifford, J., dissenting)); see also State v. Biegenwald, supra, 106 N.J. at 37 (noting that a trial court's rulings on excusals for cause are \"highly discretionary\").\n\nWhereas defendants in Ramseur and Biegenwald contested various rulings on challenges for cause, here defendant attacks the overall comprehensiveness of the voir dire, arguing that it falls short of the standards articulated in Williams (I). In order to address this claim, a review of the totality of the voir dire is necessary.\n\n1. Preliminary Voir Dire Instruction\n\nBefore any potential jurors were seated or questioned, each was required to complete a questionnaire outlining his or her occupation, familiarity with the case, and whether he or she had had any prior contact with any of the participants in the trial including defendant, witnesses, and counsel. The trial court then conducted the voir dire on the basis of the responses to the written questions. Prior to commencing any individual questioning, however, the trial court provided the jurors with the following instruction regarding the death qualification process:\n\nThe people on this jury panel probably have widely differing opinions as to those questions. Some of you may believe that a death penalty should never be imposed no matter what the crime a defendant has committed. Others may believe that the death penalty should always be imposed if a defendant is found guilty of murder no matter what the circumstances are. Some of you may believe that the death penalty is proper in some cases but not in others. Some of you may not have formed any opinions on the subject. . . .\n\nHaving any of these views does not necessarily disqualify you from serving as a juror in this case. You are disqualified only if your view is so broad and so firmly held that you will not follow my instructions at the close of the trial with respect to whether the defendant is guilty or if found . . . guilty whether a\n\npenalty of death be imposed or whether the Court will impose some other sentence authorized by the law. In short, your views about a death penalty disqualify you only if they cause you to vote automatically one way or the other without regard to the evidence or my instructions as to whether the defendant is guilty or as to whether a death penalty is to be imposed.\n\nWe have serious reservations concerning the propriety of this type of instruction.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The problem with this instruction is that it effectively tells a juror what answers during the death qualification process lead to automatic excusal and what responses avoid excusal. Although this instruction was surely intended to enable jurors to come forward and openly and honestly disqualify themselves without prolonged questioning, it unwisely put the potential juror in the position of determining whether he or she met the legal requirements to serve on a jury.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nGiven the important, delicate, and complex nature of the death qualification process, there can be no substitute for thorough and searching inquiry by the trial court into each individual's attitude concerning the death penalty. An important ingredient in this inquiry is the use of open-ended questions, which in our opinion are most likely to provide counsel and the court with insight into jurors' opinions and biases.\n\nOnce the trial court has elicited from each juror sufficient information concerning that person's predilections -- which are much more likely to be expressed freely when the juror is not constrained by an instruction from the court on what kind of answer leads to automatic dismissal -- then counsel's ability to formulate and argue for excusal for cause is enhanced. More importantly, the trial court will have a more complete record on which to apply the Adams-Witt standard in granting or denying excusals for cause. This enhanced record is imperative to preserve society's interest in a fair trial. Greater disclosure will also undoubtedly aid both the defense and prosecution in the exercise of their respective peremptory challenges.\n\n2. Automatic Death Penalty Jurors\n\nDefendant asserts that the trial court abused its discretion in failing to inquire during the voir dire into whether jurors who favored the death penalty in some cases favored the death penalty automatically if the defendant committed murder\n\nand rape.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e This error, it is argued, affected the voir dire of every prospective juror who stated that he or she supported the death penalty in some cases but not in others. Therefore, this error, according to defendant, poisoned the voir dire of all jurors who ultimately served on the jury panel.\n\nDefendant's argument rests on the premise that some jurors, if they found a defendant guilty of a murder involving a rape, would be unable at that point to consider mitigating evidence; their vote in favor of the death sentence, in other words, would be automatic if rape was involved. The trial court rejected this approach, taking the position that the only constitutionally relevant consideration was whether a juror favored or opposed the death penalty in general to such an extent that his or her resolution of the sentencing issue would be automatic, either for or against. Instead each prospective juror was told that the defendant was charged with \"murder, robbery, rape, and burglary,\" and then asked if his knowledge of the charges \"would . . . in any way influence their decision as to the imposition of death or nonimposition of death.\" Although this question was an appropriate starting point, we find that the trial court's repeated refusal to go beyond this initial inquiry raises serious questions about the impartiality of the jury ultimately impanelled.\n\nOur examination of the record indicates ten instances in which the trial court, faced with a juror who favored the death penalty in certain cases, refused defendant's request to inquire whether a conviction for both murder and rape could cause the juror to refuse to consider mitigating factors.\n\nAs we stated in State v. Bey (II), 112 N.J. 123, 152 (1988), the standard for exclusion for cause of jurors derived from Witherspoon v. Illinois, 391 U.S. 510, 89 S. Ct. 1770, 20 L. Ed. 2d 776 (1968), Adams v. Texas, 448 U.S. 38, 100 S. Ct. 2521, 65 L. Ed. 2d 581 (1980), and Wainwright v. Witt, 469 U.S. 412, 105 S. Ct. 844, 83 L. Ed. 2d 841 (1985), applied to jurors who support the death penalty as well as those opposed. The Witherspoon, Adams, and Witt standard is whether the juror's position on capital punishment would \"prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.\" Adams, supra, 448 U.S. at 45, 100 S. Ct. at 2526, 65 L. Ed. 2d at 589. Therefore, the issue presented is not simply whether the combination of murder and another crime would prompt a juror to automatically support the death penalty in all cases, which obviously warrants disqualification. Rather, the issue is whether the juror's \"capacity to credit the evidence in mitigation would be 'substantially impaired' within the meanings of Adams and Witt.\" Bey (II), supra, 112 N.J. at 154.\n\nAn example of this inadequacy in the voir dire is the questioning of juror Troyano:\n\nTHE COURT: . . . During [the penalty] stage of the trial, the jury might be presented with additional evidence and testimony to consider in deciding the appropriate sentence to be imposed, whether it be death or a prison sentence, in accordance with the law as the Court will instruct you in that law. I again want to remind you in general terms as to the charges under this indictment, and they are murder, under which charge the State is seeking the death penalty. And charges also of robbery, rape and burglary.\n\nNow, these are merely charges, and the defendant is assumed to be innocent of those charges until such time as the State in the trial of this matter proves him guilty of any one or more of those charges beyond a reasonable doubt.\n\nWould the nature of those charges alone in any way affect your ability to be a fair and impartial juror in either the guilt or the sentencing phase of this trial?\n\nMR. TROYANO: I would, to the best of my ability, try to remain open and honest throughout the trial.\n\nTHE COURT: Are you indicating that the nature of the charges would not affect your ability in that respect?\n\nMR. TROYANO: No, I don't think they would, your Honor.\n\nAfter the trial court completed its voir dire of Mr. Troyano, the following colloquy took place concerning this portion of the voir dire.\n\nMR. FISHMAN [defense counsel]: We would ask, we would request that you ask him specifically does he think that the death penalty should automatically apply to someone who was found guilty of a knowing or purposeful killing and a rape.\n\nTHE COURT: I deny that.\n\nMR. FISHMAN: Your Honor, could I just indicate for the record that by denying that question you are denying us the information --\n\nTHE COURT: We went through this before and you are not getting my view, and I could be right or wrong, but we went through that same question on two or three other jurors. That is a question that the jury would have to answer yes, and it would prove nothing because the mitigating circumstances are not even broached or told to him and that is the law.\n\nMR. FISHMEN: Judge, you are --\n\nTHE COURT: You are diverting and --\n\nMR. FISHMAN: -- by not --\n\nTHE COURT: -- diverting it actually, and that's not a fair question.\n\nMR. FISHMAN: By not asking that question, you are preventing us from getting information as to whether this person or any of those jurors are automatic death penalty individuals when they are confronted with a murder and a rape. And there's no way for us to tell that. And there are many individuals who are.\n\nTHE COURT: I will ask any juror that you request whether or not they would automatically oppose, impose the death penalty regardless of what. And think I've asked that to this particular juror, but I will not tie it up with specific other counts of the indictment, burglary, rape or robbery.\n\nMR. FISHMAN: But it's just those kind of things that make them into automatic death penalty people.\n\nTHE COURT: Not, it is not.\n\nMR. FISHMAN: It is.\n\nTHE COURT: It is those kind of things that you would like to use to make them into automatic death penalty when they are not factually, reasonably, or realistically automatic death people.\n\nNo, I disagree with you.\n\nAnything further?\n\nMR. FISHMEN: Not at this time, your Honor.\n\nThe trial court's refusal to allow questions that might provide important insight into any juror's attitude concerning a rape accompanying a murder constitutes serious error. As counsel in the quoted passage asserts, the lawyers and the court were prevented from gathering information about whether a juror would automatically impose the death penalty on a defendant found guilty of rape and murder. Under the eighth amendment, a juror in our system of capital punishment must consider \"the character and record of the individual offender and the circumstances of the particular offense. . . .\" Woodson v. North Carolina, 428 U.S. 280, 304, 96 S. Ct. 2978, 2991, 49 L. Ed. 2d 944, 961 (1976). We have previously stated that \"[t]he sentencer, whether judge or jury, has a constitutional obligation to evaluate the unique circumstances of the individual defendant.\" Biegenwald, supra, 106 N.J. at 48 (quoting Spaziano v. Florida, 468 U.S. 447, 459, 104 S. Ct. 3154, 3161, 82 L. Ed. 2d 340, 351 (1984)). It follows that a juror who will not, or cannot, consider relevant mitigating evidence pertaining to the defendant because the crime involves rape and murder is \"substantially impaired\" under the Adams-Witt test. Therefore, the failure to inquire into whether any juror could consider the mitigation evidence if it was established that defendant was guilty of rape and murder denied counsel and the trial court the tools with which to insure that the jury panel could fairly undertake its role in this case.\n\nWhether or not the trial court's refusal to inquire further regarding the murder and rape issue would, by itself, suffice to compel reversal we do not decide; the trial court's failure to make this inquiry is nonetheless a significant component of the deficiencies on which our result today is based.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\n3. General Death Qualification\n\nDefendant contends that the trial court's inadequate questions regarding death qualification were also a very damaging part of the voir dire. To support his claim, defendant points to the questioning of the first potential juror, Ms. Vasanski, as indicative of the quality of the voir dire in general. The trial court asked Ms. Vasanski whether she could consider the death penalty as \"one of the possible sentences to be imposed . . . should a sentencing stage be required.\" She answered, \"Yes.\" The court then asked: \"Do you agree that you will not automatically reject the death penalty regardless of the evidence\n\npresented?\" She answered \"yes\" again. Then she was asked, \"And you also agree that you will not automatically impose the death penalty regardless of the evidence presented?\" Ms. Vasanski again answered the question \"yes.\"\n\nAt this point a sidebar conference was called where the assistant prosecutor objected to the substance of the voir dire, stating:\n\nI am reluctant, but I think I must say I don't think that that covers the area respectfully. . . . [T]here is nothing . . . to tell us anything at sidebar whether she is giving an automatic yes because that's the way the question is put to her, or whether there is a real understanding.\n\nBased on the entreaties of the prosecutor and a similar one by defense counsel, the trial court agreed to ask Ms. Vasanski a more open-ended question: \"I want to ask you whether or not you have formed any opinion or any view in favor of or against the imposition of the death penalty.\" She responded: \"I haven't formed any opinion.\" The court rephrased the question: \"You haven't formed any at this point?\" She simply replied: \"No.\" The court pressed further asking \"Have you given it any thought at all?\" Ms. Vasanski answered, \"No, I haven't.\" Responding to defense counsel's request for more information regarding the circumstances that the juror might find appropriate for the death penalty, the trial court informed the jurors that the defendant was charged with \"murder, robbery, rape, and burglary,\" and then asked each potential juror if his or her knowledge of the charges \"would . . . in any way influence their decision as to the imposition of death or nonimposition of death.\"\n\nFollowing these rather tentative early questions, the court settled on the following death qualification procedure for Ms. Vasanski and subsequent venirepersons. First, the court presented the candidate with four possible positions he or she might hold on the death penalty: \"you may believe that a death\n\npenalty should never be imposed\"; \"[y]ou may believe that a death penalty should always be imposed if a defendant is found guilty of murder\"; \"[y]ou may believe that the death penalty is proper in some cases, but not in others\"; and \"you may not have formed an opinion. . . .\" Next, each potential juror was asked to state his or her opinion, and follow-up questions were then asked based on that answer. Based on this procedure, Ms. Vasanski indicated that the death penalty could be imposed under appropriate circumstances.\n\nThe trial court then followed up: \"But you feel that, all right, if you think or believe that under certain circumstances it would be appropriate to impose the death penalty, is that what you're indicating?\"\n\nMS. VASANSKI: Yes.\n\nTHE COURT: Now, would you, with that view in mind, agree that you would not automatically impose the death penalty, regardless of the evidence presented in the case?\n\nMS. VASANSKI: Yes, I would.\n\nTHE COURT: And although you are, from your indication, in favor of the death penalty under certain circumstances, should the facts warrant it, would you be able to reject the death sentence and impose a prison sentence?\n\nMS. VASANSKI: Yes.\n\nDefendant objects to the voir dire because the procedure used by the trial court led to questions that prompted only yes or no responses from a prospective juror and therefore provided neither the prosecutor nor defense counsel with sufficient information to pick an unbiased jury. Moreover, defendant argues that the trial court repeatedly refused to ask follow-up questions requested by counsel in order to further explain the yes or no answers. Based on an independent review of the voir dire, we find that the trial court relied much too heavily on closed-ended questions, and on several occasions did not ask adequate follow-up questions to overcome the inadequacy of the initial inquiry.\n\nThe questioning of Ms. Vasanski illustrates the closed nature of the inquiry and the failure of the voir dire to elicit responses that indicate in specific terms what Ms. Vasanski's opinion or\n\nattitude about the death penalty was. In addition to its closed nature, the tenor of the questions often appears to lead the juror inevitably to the \"correct\" response. To ask the juror whether she would \"automatically impose the death penalty, regardless of the evidence in the case,\" is to predetermine the answer; indeed without more careful phrasing it is to ask whether a mere indictment for capital murder automatically warrants the death penalty.\n\nAnother instance that illustrates the deficiency of the form and substance of the trial court's voir dire is the questioning of juror Malloy. Mr. Malloy was asked by the trial court: \"Could you tell me, please, what is your view of the death penalty?\"\n\nMR. MALLOY: Well, only in certain situations, the third.\n\nTHE COURT: The third choice?\n\nMR. MALLOY: Yes.\n\nTHE COURT: In other words, you are in that category that the death penalty may be proper under certain circumstances, and it may not be proper under other circumstances, is that what you're indicating.\n\nMR. MALLOY: Correct.\n\nTHE COURT: . . . . Should the jury find the defendant guilty of a knowing or purposeful killing, and a sentencing stage be required in this matter to determine if the penalty shall be death or a life sentence as I indicated, and knowing that your view as you've just indicated on the imposition of the death penalty, and also knowing that you are required to consider any additional evidence concerning the appropriate sentence to be imposed, that is either death or life in prison, would you automatically impose the death penalty or would you consider imposing a sentence of life in prison and reject the death penalty if the facts would warrant that position?\n\nMR. MALLOY: Yes.\n\nWith that most ambiguous response, the death qualification of Mr. Malloy was ended. Not surprisingly, defense counsel sought clarification of Mr. Malloy's views since he had answered an either/or question with a yes response.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The trial court\n\nemphatically rejected defense counsel's request because Mr. Malloy's \"answers were certainly very forthright, direct and clear.\" Defendant ultimately challenged Mr. Malloy peremptorily.\n\nDespite the deference normally accorded the trial court in assessing the demeanor and responses of potential jurors, see State v. Singletary, supra, 80 N.J. at 62-64 our reading of this admittedly cold record leaves us no choice but to find that insufficient information was elicited from Mr. Malloy to evaluate properly his fitness to serve. Our conclusion does not constitute second-guessing of the trial court's determination, based on Mr. Malloy's credibility, that the juror was \"forthright, direct and clear,\" but rather constitutes a finding that the substance of the elicited information -- yes or no answers to broad general questions and the selection of category 3 -- left both counsel and the trial court unable to evaluate Mr. Malloy's fitness to serve on the jury. Moreover, the paucity and narrowness of the responses left both the defense and the prosecutor unable to exercise peremptory challenges intelligently.\n\nA further example cited by defendant to support his claim is the voir dire of prospective juror Reade. The voir dire concerning death qualification went as follows:\n\nTHE COURT: Now, before I discuss your views on the death penalty, I want to review with you in general terms the charges under this indictment and they are murder. And under that charge, the State is seeking the death penalty. There are other charges under the indictment of robbery, rape and burglary.\n\nNow, is there anything in the nature of those charges alone that would prevent you from sitting as a juror in this case?\n\nMR. READE: No\n\nThe trial court then presented the four possible death penalty opinions, and asked:\n\nTHE COURT: . . . Now, would you please tell me your views?\n\nMR. READE: Number three.\n\nTHE COURT: And would you just tell me what that would mean to you?\n\nMR. READE: Well, in some cases you would have to impose it and in others you wouldn't.\n\nTHE COURT: Now, let me just explore a little bit further upon your views. Should the jury in the guilt stage of the trial find the defendant guilty of a\n\nknowing or purposeful killing and, therefore, a sentencing procedure is necessary, you will be instructed, along with all the other jurors at the outset of that sentencing hearing, as to certain factors to be determined by the, to be considered, not determined, certain factors to be considered by the jury in determining the appropriate sentence to be imposed that should it be death or life imprisonment, 30 years minimum ineligibility for parole.\n\nNow, if you're selected as a juror, would you be able to consider during that sentencing hearing any evidence presented concerning the existence of those factors before you make any determination as to the appropriate sentence?\n\nMR. READE: Yes.\n\nTHE COURT: Now, Mr. Reade, if you find during that sentencing hearing, based upon the evidence presented, that the sentencing factors support the death penalty, could you impose the death penalty?\n\nMR. READE: Yes.\n\nTHE COURT: On the other hand, if during that sentencing hearing, from the evidence, you find that the sentencing factors would support a life sentence, could you impose a life sentence?\n\nMR. READE: Yes.\n\nDefense counsel objected strongly to the voir dire of Mr. Reade stating that \"we've heard almost nothing from this particular juror other than yes no No. 3.\" Counsel requested that the trial court ask Mr. Reade more questions regarding his statement that he supported the death penalty in some cases. The trial court emphatically rejected this request because defendant had \"all the information that you are entitled to. . . .\" Defense counsel then asserted that he had insufficient information to formulate a challenge for cause.\n\nIn evaluating the adequacy of this voir dire, we are mindful that\n\n[q]uestions which merely invite an express admission or denial of prejudice are, of course, a necessary part of voir dire because they may elicit responses which will allow the parties to challenge jurors for cause. However, such general inquiries often fail to reveal relationships or interests . . . which may cause unconscious or unacknowledged bias. For this reason, a more probing inquiry is usually necessary. [ Darbin v. Nourse, 664 F.2d 1109, 1113 (9th Cir.1981).]\n\nWe concur fully in the Ninth Circuit's reasoning. Accordingly, we find the examination of juror Reade to have been patently inadequate. Nothing of substance concerning the juror's death penalty views is ascertainable from this record.\n\nProbing inquiries are essential in uncovering hidden biases. Despite the numerous glaring inadequacies of the voir dire identified here, not all jurors were inadequately questioned -- except with respect to the rape and murder issue. Indeed, the usefulness of thoroughgoing questioning is demonstrated in this very case by the questioning of juror Stevenson. After the court outlined the array of possible opinions on the death penalty, the following exchange took place:\n\nTHE COURT: Now, at this point, I will ask you if you would please let me know what your view is on the death penalty based upon those various --\n\nMS. STEVENSON: Well, before this happened, I believed in the death penalty, Your Honor. Before I came into this. And -- but I feel that, as I say, no one has a right to take another one's life.\n\nTHE COURT: In what respects are you talking about, taking a life?\n\nMS. STEVENSON: That an eye for an eye.\n\nTHE COURT: Oh. Do you mean as far as the accused that --\n\nMS. STEVENSON: Yes.\n\nTHE COURT: That you would be --\n\nMS. STEVENSON: I believe in the death penalty. I did.\n\nTHE COURT: You did believe in it before?\n\nMS. STEVENSON: Yes.\n\nTHE COURT: Do you still believe in the death penalty?\n\nMS. STEVENSON: Nothing has changed my mind so far.\n\nTHE COURT: All right. Now, should the jury, and this is a hypothetical, of course, find the defendant guilty of a knowing or purposeful killing and a sentencing stage be required in this trial, in other words, to determine the penalty, the question that I'm asking you, since you indicated you would be in favor of the death penalty, assuming the facts would support that, correct?\n\nMS. STEVENSON: (the juror nods her head.)\n\nTHE COURT: Would you automatically impose the death penalty regardless of the evidence presented in this case that might support the imposition of a prison sentence? Do you follow my question?\n\nMS. STEVENSON: Yes, you mean rather than have a death sentence, you'd --\n\nTHE COURT: Would you be able, if the evidence supported that position, to not vote for a death penalty but to vote for a prison sentence instead if the facts supported that?\n\nMS. STEVENSON: Uh, I think so, your Honor.\n\nTHE COURT: All right. Now, although you've indicated to the Court that you are in favor of the death penalty, would you be able, should the facts warrant it, to impose the sentence of imprisonment and reject a death sentence?\n\nMS. STEVENSON: That is so hard to answer.\n\nTHE COURT: Well, can you give me your --\n\nMS. STEVENSON: That's a question -- I reject the idea of death and at the same time I feel a guilty has to be, guilty person has to be prosecuted. So what does that make?\n\nTHE COURT: Well, the question is this, you have a right to your views as you've indicated that you don't feel an individual should impose the death sentence upon another person.\n\nMS. STEVENSON: Another person, yes.\n\nTHE COURT: And that's a personal view.\n\nMS. STEVENSON: Yes.\n\nTHE COURT: And you are entitled to that view. However, we also have the laws in the State of New Jersey, and as I indicated, the law does, under certain circumstances, permit a jury to return a death penalty. It also permits that jury in that same case to reject the death penalty and impose instead a prison sentence. And now, the issue that I'd like to find out from you is even with the views that you have, your own personal views, would you be able to follow the law as the Court will give it to you at the end of this case in that sentencing phase, and apply that law and if the facts warrant it, not impose the death penalty, but impose a prison sentence?\n\nMS. STEVENSON: Yes.\n\nWhen defense counsel expressed confusion about the juror's ultimate stance, the court agreed to inquire whether the other charges would affect Ms. Stevenson's deliberation on the penalty:\n\nMS. STEVENSON: I'm afraid it would, yes. I'm afraid it would.\n\nTHE COURT: You think it would?\n\nMS. STEVENSON: Yes.\n\nTHE COURT: Okay. . . .\n\nWell, let me ask you this.\n\nIn what way would the mere fact that there's a charge of rape, unproven at this stage, and in what way would that, do you think that would affect your sitting as a juror in this case, of being impartial?\n\nMS. STEVENSON: I was a little girl and a friend of mine was raped when I was 13 years of age. And since that, it's horrified me.\n\nTHE COURT: And you feel that because of that knowledge --\n\nMS. STEVENSON: Yes.\n\nTHE COURT: -- that experience --\n\nMS. STEVENSON: Very -- my closest friend.\n\nTHE COURT: Yes. That that would influence you in this case?\n\nMS. STEVENSON: Oh yes. Because we were like sisters.\n\nTHE COURT: All right, we'll come to sidebar.\n\n(At which time all counsel and the court reporter approached the bench for a sidebar conference out of the hearing of the juror and the following took place)\n\nMS. FLICKER: Well, I think we have no way to question --\n\nTHE COURT: Yes.\n\nMR. FISHMAN: We would note the strike for cause, but I would also indicate that this is exactly why we think that open-ended questions are important which is, we just found out something which we wouldn't have otherwise known and which obviously is extremely important.\n\nTHE COURT: But you also found it out as result of going to sidebar and discussing it. So, that is not the \"Open, Sesame\" to every question that you feel might be relevant.\n\nHad the trial court proceeded more consistently in the above fashion, serious difficulties could have been avoided. The examination of Ms. Stevenson is an excellent illustration of the vital information that can be derived from more probing follow-up questions. Moreover, it highlights the risks of undiscovered bias or prejudice -- especially heightened when the death penalty is a possibility -- that may be the result of merely administering a multiple choice exam to a juror, without any supplemental questioning. Accordingly, when exercising their wide discretion to control voir dire in death penalty cases as mandated by State v. Manley, 54 N.J. 259 (1969), and Rule 1:8-3(a),\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e trial courts should be sensitive to questions suggested by counsel, see State v. Biegenwald, supra, 106 N.J. at 29, and \"should be sensitive to permitting attorneys to conduct some voir dire.\" Id. at 30.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e We also note that the suggestions in\n\nWilliams I, supra, 93 N.J. at 68, for dealing with juror bias resulting from pretrial publicity are equally applicable to the death qualification procedure.\n\nThe court should consider the efficacy of more exhaustive and searching voir dire examinations. The court in conducting voir dire should be particularly responsive to the requests of counsel regarding examination of prospective jurors as to potential bias. The court should consider whether there should be a greater willingness to resolve doubts in favor of the defendant in excusing jurors for cause. [ Ibid. (footnotes omitted).]\n\nAlthough the voir dire of juror Stevenson did uncover potential bias, we find that the limited scope of the trial court's questioning of jurors Reade, Vasanski, and Malloy was more representative of the jury selection process as a whole. This conclusion obviously casts grave doubts on the fairness of the trial.\n\n4. Racial Prejudice\n\nDefendant contends that the trial court, by limiting the voir dire to a single question on racial prejudice, deprived him of his constitutional rights to due process and a fair trial. Moreover, defendant asserts that the limited questioning on this sensitive issue prevented him from intelligently exercising his peremptory challenges.\n\nThe trial court posed this query to prospective jurors: \"Defendant is a black man. Would that, in any way, prejudice or influence your sitting as a juror in this case?\" The record reflects, however, that the trial court failed to seek clarification or explanation from jurors who gave ambiguous, indefinite responses to this question.\n\nAlthough the issue of race was not \"inextricably bound up with the conduct of the trial,\" Ristaino v. Ross, 424 U.S. 589, 597, 96 S. Ct. 1017, 1021, 47 L. Ed. 2d 258, 264 (1976), and the circumstances of the case did not indicate that there existed \"a\n\nreasonable possibility that racial or ethnic prejudice might have influenced the jury\" in reaching its verdict, Rosales-Lopez v. United States, 451 U.S. 182, 191, 101 S. Ct. 1629, 1636, 68 L. Ed. 2d 22, 30 (1981), the absence of racial overtones does not obviate the need to consider whether a more expansive voir dire should be conducted. See State v. Ramseur, supra, 106 N.J. at 246. Racial prejudice may be either blatant and easy to detect or subtle and therefore more difficult to discern. A probing voir dire that elicits more than a \"yes\" or \"no\" response will aid the trial court in excusing prospective jurors for cause and will assist the defense in exercising its peremptory challenges. When the defendant is a member of a cognizable minority group, a more searching voir dire should be conducted, if requested. See State v. Ramseur, supra, 106 N.J. at 247-48.\n\n5. Prejudicial Pretrial Publicity\n\nDefendant also asserts that the trial court abused its discretion by conducting an inadequate examination of the jurors concerning the prejudicial impact of pretrial publicity. Prior to jury selection, defendant requested a change of venue to remove the possibility of juror bias as a result of pretrial publicity. The trial court denied the motion because it had not yet conducted the voir dire and therefore had no basis to ascertain whether pretrial publicity had created \"the realistic likelihood of prejudice\" on potential jurors. Williams (I), supra, 93 N.J. at 69.\n\nA fundamental prerequisite to a fair trial is \"a jury panel not tainted by prejudice.\" State v. Biegenwald, supra, 106 N.J. at 32 (citing Irvin v. Dowd, 366 U.S. 717, 722, 81 S. Ct. 1639, 1642, 6 L. Ed. 2d 751, 755 (1961)). We have repeatedly emphasized, particularly in capital cases, the trial court's responsibility \"to preserve the integrity of the jury and minimize the danger that prejudice will infiltrate the adjudicatory process. . . .\" State v. Biegenwald, supra, 106 N.J. at 32 (quoting\n\nWilliams (I), supra, 93 N.J. at 63). To expunge the taint that results from inflammatory pretrial publicity or the disclosure of inadmissible evidence, the trial court has a number of trial management techniques at its disposal, including a change of venue, impanelling \"foreign jurors,\" postponing the trial, restraining public statements by the participants in the trial, and the use of thorough and searching voir dire examinations. State v. Biegenwald, supra, 106 N.J. at 32.\n\nTo protect defendant's -- and society's -- interest in an impartial trial, jurors who have \"formed an opinion as to the guilt or innocence of the defendant must be excused.\" Williams (I), supra, 93 N.J. at 61; see also State v. Van Duyne, 43 N.J. 369, 386 (1964) (appellate tribunal should determine for itself whether pretrial newspaper stories are so prejudicial that a new trial should be ordered), cert. den., 380 U.S. 987, 85 S. Ct. 1359, 14 L. Ed. 2d 279 (1965); In re Kozlov, 79 N.J. 232, 239-40 (1979) (\"[w]here a juror on voir dire fails to disclose potentially prejudicial material . . . a party may be regarded as having been denied fair trial\"). Total ignorance of the case, however, is not a necessary prerequisite to serving as a juror. State v. Sugar, 84 N.J. 1, 23 (1980). A juror may still serve \"if the juror can lay aside his impression or opinion and render a verdict based on the evidence presented in court.\" Ibid. (quoting Dobbert v. Florida, 432 U.S. 282, 302, 97 S. Ct. 2290, 2303, 53 L. Ed. 2d 344, 362 (1977)); Williams (I), supra, 93 N.J. at 61; State v. Conyers, 58 N.J. 123, 143-44 (1971).\n\nIn order to distinguish potential jurors who are able to put their opinions or prior knowledge aside from those who are unable to serve in an impartial fashion, the trial court must conduct a probing voir dire of potential jurors. See, e.g., State v. Sugar, supra, 84 N.J. at 23; State v. Deatore, 70 N.J. 100, at 104-06.\n\nDuring the voir dire in this case, fifty-seven jurors were asked whether they had any prior knowledge concerning the case; forty-two (74%) answered affirmatively. We have previously\n\nnoted that extensive pretrial publicity does not necessarily preclude the impanelling of an impartial jury. State v. Biegenwald, supra, 106 N.J. at 35. We observed in Williams (I), supra, that \"even in highly publicized cases the venire will contain many individuals who have not been exposed to the publicity or who, if exposed, are only faintly aware of the nature of the case.\" Id., 93 N.J. at 66 n. 10.\n\nIn challenging the adequacy of the voir dire concerning the prejudicial effect of pretrial publicity, defendant's most serious challenge is to the examination of juror Fairburn, who had indicated in his juror questionnaire that he had knowledge concerning the case prior to coming to the courthouse. The court questioned Mr. Fairburn on the source of his knowledge. Mr. Fairburn responded that he had read more than one newspaper article and that he recalled the facts set forth in the articles. The voir dire proceeded:\n\nTHE COURT: As a result, Mr. Fairburn, of reading those articles over a year ago, have you formed any opinion concerning the charges under this indictment as to this defendant?\n\nMR. FAIRBURN: I think so.\n\nTHE COURT: And as a result of that -- strike that.\n\nIf you were to be seated as a juror in this case, would you be able to set aside that opinion or opinions and render a verdict or verdicts in this case based solely on the evidence presented in this courtroom from the witness stand, so forth, under oath and in accordance with the law?\n\nMR. FAIRBURN: I'm not sure.\n\nTHE COURT: What is your hesitancy, why do you feel that?\n\nMR. FAIRBURN: I had some pretty strong feelings when I read the newspaper accounts.\n\nTHE COURT: What was cited in the newspaper accounts, just from that?\n\nMR. FAIRBURN: Yes.\n\nTHE COURT: The facts cited in there or anything stated in there are not necessarily accurate, or the facts that will be presented during this trial, you understand that? That's just newspaper recitation of facts.\n\nMR. FAIRBURN: Yes.\n\nTHE COURT: If you're selected as a juror, you will be required to render your decision, ultimate decision in this case solely on what you hear and see in the courtroom and not from any other sources. Do you understand that?\n\nMR. FAIRBURN: Yes.\n\nTHE COURT: Now, would you be able to follow those instructions of the Court and make a determination in this case upon what is presented in the courtroom and the law that the Court will give you and not let those newspaper facts that you may have read influence that decisions? That's what I'm asking you. Could you do that?\n\nMR. FAIRBURN: I think so.\n\nAt sidebar, defense counsel asked the trial court to find out what the juror meant by \"strong feelings,\" what he had read, and whether he had any conversations with anyone about the case. The court responded:\n\nTHE COURT: I will ask what he recalls from those articles, and I will not go into any further discussion. He can tell us precisely what he recalls because I've already run through what effect that would have, and he satisfied the Court that he could lay aside those recollections of those facts, but you're entitled to hear what he recalls.\n\nMR. FISHMAN: We would like to know what opinions he formed and what strong feelings --\n\nTHE COURT: No.\n\nMR. FISHMAN: Your Honor, I would cite State v. Williams, this very case in the Supreme Court, and at that point, we were dealing with the effect of prejudicial pretrial publicity, and the Supreme Court, Justice Handler said, and I would quote from page 68:\n\n\"Another important, indeed, critical means for dealing with potential and latent bias is the voir dire. The Court should consider the efficacy of more exhaustive and searching voir dire examinations. The Court, in conducting voir dire, should be particularly responsive to the requests of counsel regarding the examination of prospective jurors as to potential bias. . . .\"\n\nTHE COURT: And I have followed fully those concepts in the examination in this matter.\n\nNow, what else? I will not ask him his opinions. I have been through that. I will ask him his present recollection of any of those facts that he referred to, and that will be the extent of the individual questioning.\n\nMR. FISHMAN: . . . Can I just also indicate that in terms of the publicity that occurred at the time of this incident, there was a banner headline that indicated that the defendant had killed his brother in the past, and I believe that that is part and parcel and may even be what Justice Handler was referring to in the quote I just gave your Honor. I neglected to say at the time --\n\nTHE COURT: How would you propose I ask this juror or any other juror on whether he saw that banner headline?\n\nMR. FISHMAN: By asking him what he did see and what opinions he formed.\n\nTHE COURT: I told you I'm going to ask what evidence do you recall from those articles.\n\nMR. FISHMAN: This juror more so than anyone has indicated that he had strong feelings.\n\nTHE COURT: Other jurors have indicated that. Let's not have a debate about other jurors and this juror. Just ask me the questions that you would like to be asked in addition to what I have already asked.\n\nMR. FISHMAN: What opinions --\n\nTHE COURT: No, I will not go over opinions. I will expand to the effect that I have just indicated.\n\nMR. FISHMAN: I would also indicate that in response to setting aside those opinions, he said, I think so, and that connected to everything else I think requires further probing.\n\nTHE COURT: This is asking the impossible. And what you're really working at is never getting a jury in any circumstances with these questions that are so far out and have no relevance. If I were to ask every question that you have in the last five days have been asking me to ask, we wouldn't have a single juror, no way.\n\nMR. FISHMAN: With all due respect to the Court, this is not a probing voir dire under the case law.\n\nTHE COURT: It certainly is, and I disagree with your opinion.\n\nThe court then asked Mr. Fairburn what he recalled from the newspapers; the juror indicated that he could not recall anything specific, \"but with some jogging of my memory, I would probably have almost total recall. . . . I remember the feeling I had about it. I don't remember the details.\" Defense counsel again requested at sidebar that the court \"inquire what those feelings were.\" The court relented, asking the juror \"what the strong feelings were.\" Mr. Fairburn stated: \"I assume from the newspaper account that . . . the defendant was guilty.\" Mr. Fairburn then stated \"I believe so\" when asked if he could \"set aside that previous opinion\" and decide the case \"based solely on the evidence introduced in this courtroom.\" The defense then, based on State v. Williams, challenged the juror for cause:\n\n[H]e has expressed a feeling that the defendant was guilty, and I think that this, based on the State v. Williams, and Justice Handler's indication we could challenge for cause and ask the Court to give us that leeway as Justice Handler suggests.\n\nTHE COURT: You had more than the leeway Justice Handler suggests, but that isn't the issue. You're challenging for cause, and it is denied on the simple ground that your reason that a juror hasn't seen, over a year ago, headlines or articles, or read them, and had formed at that time, because the defendant was charged with the offense, a strong opinion as to the guilt based solely on those\n\nhearsay statements and those allegations, one-sided in the newspapers, would not be unusual for every person in this county who read those same articles to come to that same strong opinion, and it's obvious people will have a strong opinion. That is not the test of what they read. If they can take it out of their mind and lay it aside and listen to the evidence here presented in the Court, and the law, and he clearly indicated to me he could do that. He is qualified. You're denied.\n\nMR. FISHMAN: But the Supreme Court has indicated that this, that a capital case should have more flexibility than a regular case.\n\nTHE COURT: I have given it extreme flexibility in my opinion, maybe not yours, but in mine.\n\nWe strongly disagree with the trial court's refusal to excuse Mr. Fairburn for cause. This colloquy in no way demonstrates that the juror could lay aside his impression or opinion and decide the case based solely on the evidence presented in court. Like the death qualification portion of the voir dire, this examination is not sufficiently thorough and probing to ascertain how strongly the potential juror actually felt. This perfunctory voir dire provides no basis to conclude that this juror could put his preconceptions aside. Once it is established that a juror has been exposed to pretrial publicity, then, in order to vindicate a defendant's right to an impartial jury, the voir dire must unequivocally establish that the potential juror can put that information or opinion aside. That burden simply was not met here. Therefore the trial court abused its discretion.\n\nFollowing the court's denial of defendant's motion for excusal for cause, the prosecution informed the court that following review of its notes, it agreed with the defense's motion for excusal. Despite the plea from both parties, the trial court again rejected the excusal motion. The prosecution then excused Mr. Fairburn peremptorily. This had the effect of curing what might otherwise have been reversible error. The example is nonetheless noteworthy, as it illustrates the type of questioning that falls short of what is required to ensure an impartial jury.\n\nA similar problem concerning prejudicial publicity arose during the voir dire of juror Minnick. She indicated that her\n\nknowledge of the case was derived from newspaper articles that appeared soon after the murder. The court asked if, having read those newspaper articles, the juror had formed an opinion about the guilt or innocence of the defendant. Ms. Minnick answered \"I guess in a sense, yes.\"\n\nTHE COURT: All right, and what would that opinion be?\n\nMS. MINNICK: To his guilt.\n\nMs. Minnick indicated, however, that she could put her opinion aside and be impartial. At sidebar, defense counsel requested \"that the Court inquire as to what she recalls from the newspaper accounts, specifically concerning the incidents. She said that she had formed an opinion as to guilt. We would request that the Court inquire as to what she based that on, what facts or things that she read.\" The court agreed to ask if she had \"a present recollection of any of the facts in those Trenton Times newspaper accounts, but I will not go into any more about her opinion. I went through that, and I'm satisfied with her answers.\" The juror recalled:\n\nMS. MINNICK: To tell you the truth, I really don't remember a lot of it. I remember what happened, and you know, very -- I mean it was a year ago, and I know that I read it, but I don't remember specific details, you know.\n\nTHE COURT: What do you remember generally about it?\n\nMS. MINNICK: That a girl was raped, murdered, stabbed, and it happened at night, and that's all I really remember was what happened.\n\nTHE COURT: That's it.\n\nMS. MINNICK: Yeah, I really don't remember specific details.\n\nThe court then agreed, at sidebar, to ask if she remembered reading anything about the defendant. She responded: \"Do I remember anything concerning him?\"\n\nTHE COURT: Anything that was in those articles dealing with Mr. Williams specifically.\n\nMS. MINNICK: No, the name really wasn't familiar.\n\nAt sidebar, defense counsel pressed for more, stating \"The question we want asked is whether she remembers any details about the person who was arrested.\"\n\nTHE COURT: The answer is no. I have gone as far as I'm going and I have sufficiently covered your inquiry for your purposes. You are again trying to\n\nrefine something, you get an answer you don't particularly care for the answer . . . and it satisfies the area of inquiry, and I'm not going to go further.\n\nThe defense was then forced to excuse her peremptorily.\n\nIt also appears that defendant was forced to spend two additional peremptory challenges due to similar inadequate questioning of juror Puhalski and juror Fiorentino. Mr. Puhalski told the court that he had followed the case very closely in the newspaper. Although juror Puhalski was asked what specific facts he remembered, the trial court emphatically refused to probe further into how that exposure might impact on the juror's attitude about the defendant. Denied access to the type of information necessary to try to establish the necessary prejudice under our case law, defendant used one of his twenty peremptory challenges to excuse Mr. Puhalski.\n\nJuror Fiorentino also indicated that he had read about the case in the newspaper. Most importantly, he disclosed that he discussed the cases shortly after the murder with his daughter, who worked for the State Police, and had formed an opinion concerning defendant's guilt. However, because Mr. Fiorentino indicated that he could put his prior opinion aside and be impartial, the court adamantly refused to inquire into the substance of his discussions with his daughter. Again, effectively denied the opportunity to establish a record supporting a challenge for cause, defendant exercised another peremptory challenge to excuse juror Fiorentino.\n\nThe voir dire is an indispensable mechanism for assuring the impartiality of a jury. In the instant case, the voir dire was insufficiently probing to fulfill that role. At numerous points, it failed to provide the information necessary to enable the effective formulation of challenges for cause and the intelligent exercise of peremptory challenges. Moreover, we have identified in the questioning regarding pretrial publicity at least three instances where the defense, and one where the prosecutor, had to use peremptory challenges to correct abuses in the exercise of the trial court's discretion.\n\nThe inadequacy of the voir dire in this case and its effect on the utility and number of both parties' peremptory challenges, when combined with defendant's loss of a peremptory challenge through the trial court's failure to excuse juror Pfeiffer for cause, as explained immediately below, so abridged defendant's right to an impartial jury as to compel reversal of both phases of the proceedings below.\n\nB. Failure to Excuse Prospective Juror Pfeiffer for Cause\n\nDefendant contends that the trial court erred in failing to excuse for cause prospective juror Pfeiffer, who expressed strong feelings in favor of applying the death penalty in all murder cases regardless of the specific facts. As a result of this alleged error, defendant was forced to use a peremptory challenge to dismiss Ms. Pfeiffer. Defendant ultimately expended all twenty of his allotted peremptory challenges, and his motion for additional peremptories was denied. Therefore, defendant argues that the trial court's erroneous ruling denying the motion to excuse juror Pfeiffer for cause resulted in the deprivation of defendant's right to exercise peremptory challenges, which is by itself sufficiently serious to warrant reversal. While we agree with defendant that the trial court improperly failed to remove juror Pfeiffer for cause, we need not reach the question whether the effective deprivation of one peremptory challenge, when the defendant exhausts his full complement of challenges, warrants automatic reversal. Instead, we reverse, as noted above, because the deprivation of the peremptory challenge in conjunction with the perfunctory nature of the voir dire combined to deny defendant fundamental procedural protections that guarantee a fair and impartial jury panel.\n\nIn State v. Ramseur, supra, 106 N.J. at 255-56, this Court set forth the test governing the exclusion for cause of prospective jurors holding views opposed to the imposition of capital punishment. Following the United States Supreme\n\nCourt decisions in Adams v. Texas, supra, 448 U.S. at 45, 100 S. Ct. at 2526, 65 L. Ed. 2d at 589, and Wainwright v. Witt, supra, 469 U.S. at 418-26, 105 S. Ct. at 849-53, 83 L. Ed. 2d at 847-53, we determined that a prospective juror's views regarding capital punishment warrant dismissal for cause where these \"'would prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.'\"\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e State v. Ramseur, supra, 106 N.J. at 255 (quoting Adams v. Texas, 448 U.S. 38, 45, 100 S. Ct. 2521, 2526, 65 L. Ed. 2d 581, 589 (1980)). We held that a juror's bias need not \"be proven with unmistakable clarity.\" Id., 106 N.J. at 256. As the Witt Court pointed out,\n\ndeterminations of juror bias cannot be reduced to question-and-answer sessions which obtain results in the manner of a catechism. What common sense should have realized experience has proved: many veniremen simply cannot be asked enough questions to reach the point where their bias has been made \"unmistakably clear\"; these veniremen may not know how they will react when faced with imposing the death sentence, or may be unable to articulate, or may wish to hide their true feelings. [469 U.S. at 424-25, 105 S. Ct. at 852, 83 L. Ed. 2d at 852.]\n\nA trial court must therefore seek to discover the nature and strength of the juror's convictions on the basis of a \"sensitive weighing and appraisal of a juror's entire response.\" State v. Ramseur, supra, 106 N.J.. at 257.\n\nThe same test that applies to a juror biased against imposition of the death penalty applies to a juror biased in favor of imposing capital punishment in all murder cases. Neither\n\ncan serve fairly in the penalty phase. A juror in a capital case must be able to comply with the instruction relating to the weighing of aggravating and mitigating factors. If a juror is substantially impaired in this regard, no fair trial can result. State v. Bey (Bey II), supra, 112 N.J. at 152.\n\nJuror Pfeiffer's answers to voir dire questions addressing her views on capital punishment indicate that her ability to weigh aggravating and mitigating factors was substantially impaired by a pro-death penalty bias. In denying defense counsel's motion to excuse Ms. Pfeiffer for cause, the trial court abused its discretion.\n\nThe voir dire testimony is instructive. The trial court asked Ms. Pfeiffer which of four possible attitudes she took toward the death penalty: that the death penalty should never be imposed, regardless of the circumstances; that the death penalty should always be imposed where the defendant is found guilty of murder, regardless of the circumstances; that the death penalty is properly imposed in some murder cases but not others; or no opinion on the issue. Ms. Pfeiffer stated that she believed that the death penalty should be imposed for all murder convictions. The court then explained that the jury would be instructed \"as to certain factors to be considered in determining the appropriate sentence to be imposed,\" and asked Ms. Pfeiffer whether she would be able to consider any evidence presented before choosing between the alternative sentences of death or life imprisonment with thirty years minimum parole ineligibility. She responded affirmatively. Then, however, the following exchange ensued:\n\nTHE COURT: Now, should the jury find the defendant, Ms. Pfeiffer, guilty of a knowing or purposeful murder, killing I should say, strike murder, and a sentencing stage should be required to determine if the penalty shall be death or life in prison with 30 years ineligible for parole, knowing your view on the death penalty and knowing the law requires that a penalty be either death or a life sentence, and knowing you are required to consider any additional evidence concerning the appropriate sentence to be imposed in that sentencing phase, would you automatically impose a death sentence or would you consider\n\nimposing a sentence of life imprisonment and rejecting the death sentence if that was justified under the facts presented in that sentencing phase?\n\nMS. PFEIFFER: Probably go with the death penalty.\n\nTHE COURT: In other words, are you saying that under no circumstances even if the facts warranted the imposition of a life sentence, that you would impose a life sentence, that you would automatically impose a death sentence?\n\nMS. PFEIFFER: Yes.\n\nTHE COURT: And is there any further elaboration you can tell me on your feeling why you would only impose the death penalty and not consider the imposition of the life sentence?\n\nMS. PFEIFFER: I feel like when they brought back capital punishment it should be brought back as a deterrent. That was my idea, to be used as a deterrent against future crimes.\n\nTHE COURT: But you don't consider, do you, the fact that a life sentence and 30 years ineligibility for parole would also be a deterrent under given circumstances?\n\nMS. PFEIFFER: It probably would, but I don't know -- I guess, I would just think the death penalty would be the proper way. [Emphasis supplied.]\n\nIn indicating that she would automatically impose a death sentence for deterrence purposes even if the circumstances warranted a life sentence, Ms. Pfeiffer disqualified herself as a juror. Her responses to the follow-up questions demonstrate that she did not misunderstand the court's twice-posed question on the automatic imposition of the death penalty. Her defense of her attitude was straightforward and rational, making it clear that she would indeed automatically favor a death sentence if the defendant were to be convicted of a knowing and purposeful killing, regardless of the court's instructions to consider additional evidence.\n\nHaving heard these responses, the trial court continued to press Ms. Pfeiffer for clarification of her death-penalty views. The manner in which the court sought clarification, however, was counterproductive; instead of drawing out Ms. Pfeiffer's actual views and intentions, the court's further questions seemed calculated to draw out only such answers as would rehabilitate her as a juror. The court's inquiry proceeded as follows:\n\nTHE COURT: Well, that may be your opinion, your view, and that's perfectly understandable, but the issue here is even having that opinion, would you be able to listen to the testimony, the evidence in the sentencing phase and not automatically impose a death penalty, but consider that evidence and if that evidence merited or warranted the lesser penalty than death, that is a life sentence, would you then be able to vote for a life sentence? That is the issue even though you may feel strongly about the death penalty, would you just automatically shut your eyes?\n\nMS. PFEIFFER: No. No, I wouldn't do that.\n\nTHE COURT: In other words, you would consider both the alternatives? You would consider the death penalty and if the facts in the sentencing phase were appropriate in your opinion to support and justify the position of death, you would vote for the death penalty; is that what you're indicating?\n\nMS. PFEIFFER: Yes.\n\nTHE COURT: On the other hand, if those facts in the sentencing phase would warrant the imposition of the lesser penalty, that is, a life sentence with 30 years ineligible for parole, you would be able to impose that sentence, is that what you're indicating?\n\nMS. PFEIFFER: Yes. [Emphasis supplied.]\n\nBy asking the juror if she would \"just automatically shut [her] eyes,\" the court not only made the \"correct\" answer unmistakably clear, but placed the weight of its authority behind that answer. We think it unlikely that any prospective juror would have had the fortitude to offer any answer other than the one Ms. Pfeiffer gave, even if that juror intended to disregard legally significant evidence so as to enhance the deterrent impact of the death penalty. Ms. Pfeiffer's expectable responses to such highly leading and heavy-handed questioning clearly did not rehabilitate her as a fit juror. Moreover, on hearing the one-word responses it sought, the court abruptly ended this line of questioning, later refusing defense counsel's request that the subject be reopened to obtain greater clarification of Ms. Pfeiffer's views. Such an approach is not conducive to a sound determination of whether a juror should be dismissed for cause.\n\nOn the basis of what was learned of Ms. Pfeiffer's death penalty views during the voir dire, we conclude that the trial court erred in failing to excuse this prospective juror for cause.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Although deference is normally accorded the trial court in such determinations, see Wainwright v. Witt, supra, 469 U.S. at 425-26, 105 S. Ct. at 852-53, 83 L. Ed. 2d at 852-53, the need to guarantee a fair trial in a death-penalty case compels this result. Even in the ordinary case, a trial court must \"see to it that the jury is as nearly impartial 'as the lot of humanity will admit.'\" State v. Jackson, supra, 43 N.J. at 158. In death-penalty cases, the need to guard against any and all prejudice is all the more pressing. Williams (I), supra, 93 N.J. at 61. In this case, far from carefully seeking to guarantee the impartiality of the jury, the court sought to seat a clearly biased juror. Its questioning was aimed not at probing for sources of possible bias, but at eliciting a programmed response that would satisfy what the court apparently thought were the technical terms -- but not the substance -- of the death qualification standard. Such an approach to the voir dire process is intolerable. Where a prospective juror has stated so clearly that she would disregard the court's instructions and impose the death penalty on a defendant convicted of murder,\n\nthis Court cannot but find error in the failure to excuse her for cause.\n\nHaving established that failure to excuse juror Pfeiffer for cause constituted error, we are asked to decide whether that error warrants reversal. Although Ms. Pfeiffer did not ultimately sit on the jury, defendant was forced to expend a peremptory challenge to dismiss her, and ultimately exhausted his allotment of peremptory challenges. Defendant asserts that deprivation of one peremptory challenge violates a substantial right and cannot be regarded as harmless error.\n\nThis Court has repeatedly stressed the significance of the right of peremptory challenge. It has not, however, decided whether reversal is required whenever a peremptory challenge is used to remove a juror who should have been removed for cause.\n\nIn Wright v. Bernstein, 23 N.J. 284 (1957), a civil case, a prospective juror failed to give an accurate answer to a question asked during voir dire that, if answered accurately, would clearly have caused the defendant to exercise a peremptory challenge, and would perhaps -- though the Court withheld judgment on this point, see id. at 294 -- have sustained a challenge for cause. The Court held that defendant's loss of the opportunity to challenge the juror peremptorily warranted reversal. Although in ordering a new trial the court spoke in terms of defendant's loss of the right to excuse the juror peremptorily (the loss stemming from defendant's lack of knowledge of the juror's potential bias), the case is better understood as turning on the fact that a potentially biased juror was allowed to sit on the jury. By contrast, in the instant case, the biased juror did not sit.\n\nIn State v. Deatore, supra, 70 N.J. at 105 (1976), the Court held that the trial court's refusal to question a prospective juror about the extent of her relationship with the victim justified reversal, notwithstanding the fact that the defendant challenged her peremptorily. In that case, as here, defendant\n\nultimately exhausted his peremptory challenges and was denied additional challenges. The Court never discussed the possibility that the error was harmless. Unlike the instant case, however, there was an indication in Deatore that the error was indeed prejudicial; the exhaustion of defendant's peremptories prevented defendant from challenging a juror who mentioned two relatives employed as corrections officers. Ibid.\n\nIn State v. Singletary, supra, 80 N.J. 55, we mentioned but did not reach the issue of whether an erroneous failure to dismiss a juror for cause, leading to an expenditure of one of defendant's peremptory challenges and the ultimate exhaustion of defendant's allotment of challenges, warrants reversal. The majority found that the trial court had not erred in refusing to dismiss the juror in question for cause, but noted the gravity of the issue:\n\nWere we of the view that the trial judge had in fact erroneously deprived defendant of a peremptory challenge, his contentions in this regard would merit serious consideration by this Court. Jury selection is an integral part of the process to which every criminal defendant is entitled. Although not constitutionally required to do so, the Legislature and this Court have sought to insure that the triers of fact will be \"as nearly impartial 'as the lot of humanity will admit'\" by providing defense counsel with twenty peremptory challenges. As such, \"[t]he denial of the right of peremptory challenge is the denial of a substantial right.\" [ Id. at 62 (citations omitted).]\n\nJustice Jacobs, in a separate concurrence, took the position that automatic reversal based on the deprivation of one peremptory challenge \"would needlessly burden the administration of justice and would grossly disserve the interests of society.\" Id. at 65. Three dissenting justices, however, took the opposite view, one concluding that \"the denial to defendant of the full range of choice accorded by the allowance of the right to challenge jurors peremptorily constituted reversible error.\" Id. at 82. The view that the denial of a single peremptory challenge warrants reversal has been adopted by the Appellate Division. State v. Pereira, 202 N.J. Super. 434, 438; (App.Div.1985); accord People v. O'Hare, 117 A.D. 2d 757, 758, 498 N.Y.S. 2d 478, 480, app. den., 67 N.Y. 2d 948, 494 N.E. 2d 126, 502 N.Y.S. 2d 1041 (1986) (New York court rule requires reversal\n\nwhere erroneous denial of challenge for cause prompts defendant to exhaust peremptories prior to completion of jury selection).\n\nFederal courts have also taken the position that automatic reversal results from the denial of a peremptory challenge where defendants' peremptory challenges are ultimately exhausted. See, e.g., United States v. Martin, 749 F.2d 1514, 1518 (11th Cir.1985); United States v. Allsup, 566 F.2d 68, 71 (9th Cir.1977); United States v. Turner, 558 F.2d 535, 538 (9th Cir.1977); United States v. Nell, 526 F.2d 1223, 1230 (5th Cir.1976); United States v. Boyd, 446 F.2d 1267 (5th Cir.1971). But see United States v. Brown, 644 F.2d 101, 104 (2d Cir.), cert. den., 454 U.S. 881, 102 S. Ct. 369, 70 L. Ed. 2d 195 (1981) (2-1 decision taking the opposite view). This rule does not \"rest on constitutional grounds but on the common-law principle that the 'denial or impairment of the right is reversible error without a showing of prejudice.'\" Celestine v. Blackburn, 750 F.2d 353, 360 (5th Cir.1984) (quoting Swain v. Alabama, 380 U.S. 202, 219, 85 S. Ct. 824, 835, 13 L. Ed. 2d 759, 772 (1965)), cert. den., 472 U.S. 1022, 105 S. Ct. 3490, 87 L. Ed. 2d 624, reh. den., 473 U.S. 925, 106 S. Ct. 16, 87 L. Ed. 2d 695 (1985).\n\nUntil recently, it had not been decided whether denial of a single peremptory challenge rises to the level of a federal constitutional violation, Celestine v. Blackburn, supra, 750 F.2d at 360, though it had long been clear that the federal Constitution does not compel the granting of any peremptory challenges, Batson v. Kentucky, 476 U.S. 79, 91, 106 S. Ct. 1712, 1720, 90 L. Ed. 2d 69, 84 (1986); Stilson v. United States, 250 U.S. 583, 586, 40 S. Ct. 28, 30, 63 L. Ed. 1154, 1156 (1919); United States v. Sams, 470 F.2d 751, 753 (5th Cir.1972). See generally United States v. Allsup, supra, 566 F.2d at 73-77 (Foley, D.J., concurring) (discussing the derivation of the automatic reversal rule). The United States Supreme Court has lately resolved the question conclusively, holding in Ross v. Oklahoma, U.S. , , 108 S. Ct. 2273, 2278, 101\n\nL. Ed. 2d 80, 90 (1988), that the federal Constitution does not require the automatic reversal rule.\n\nWe need not decide whether the loss of a peremptory challenge in this case where all peremptories were ultimately exhausted would, by itself, warrant reversal. We find instead that whatever prejudice may be attributed to that loss was compounded by a voir dire so inadequate as to leave in doubt the ultimate impartiality of the jury. That combination of errors -- the failure to discharge Ms. Pfeiffer for cause leading to the loss of a peremptory challenge and the failure to conduct the searching voir dire required in all capital cases -- requires reversal of both the guilt and penalty phases. No matter how convinced we may be of defendant's guilt, unless we are similarly convinced of the jury's impartiality, we cannot allow the death penalty to be imposed. When the basic procedures designed to assure that impartiality -- challenges for cause, peremptory challenges, and a searching voir dire -- are improperly applied so as to seriously weaken their combined effectiveness, a new trial is necessary.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nIII.\n\nProsecutorial Misconduct\n\nDefendant maintains that the trial court, over defendant's numerous objections, permitted the trial to become infected with highly prejudicial, inflammatory statements and testimony that focused not on defendant's guilt or innocence, but on the victim's sterling character. Defendant asserts that the court improperly admitted, as \"background,\" emotion-laden testimony relating to the victim's personal life, and improperly allowed the prosecutor to comment on that testimony in an unduly prejudicial manner. As a result, he contends, the jury was inappropriately invited, in both the guilt and penalty phases, to reach a verdict based on the victim's virtues rather than the defendant's culpability.\n\nThe State maintains that the prosecutor's comments related to matters that were supported by proofs and properly admitted in evidence at trial, and that the prosecutor's comments were therefore reasonable and appropriate. We disagree. Since we are reversing both the guilt and penalty phases on other grounds, however, we need not determine the likelihood that the prosecutor's behavior led to an unjust verdict. See State v. McCloskey, 90 N.J. 18, 30 (1982); State v. Bankston, 63 N.J. 263, 273 (1973); State v. Macon, 57 N.J. 325, 335 (1971). Nonetheless, the instances of misconduct are so egregious that we address this matter to ensure that this kind of prosecutorial excess is not repeated.\n\nThe issue here centers on the prosecution's comments on testimony elicited from the victim's mother during the guilt phase of the trial. The ostensible purposes of that testimony were to provide certain background facts and to demonstrate that the purse retrieved from the Delaware River belonged to\n\nthe victim, the latter being established through an item-by-item identification of the contents of the purse. This testimony led to the introduction, often over defendant's strenuous objections, of extraneous information concerning, inter alia, the victim's marriage plans and her involvement in a variety of church-related activities. The prosecutor made considerable mention of these facts and their implications during her opening and closing statements in both phases of the trial. This conduct may be attributed to the prosecutor's overzealous advocacy in the heat of litigation, but it has the same effect as would a deliberate plan to induce the jury to reach a verdict based on the victim's virtuous character.\n\nIt is well-established that prosecuting attorneys, within reasonable limitations, are afforded considerable leeway in making opening statements and summations. See State v. Perry, 65 N.J. 45, 47 (1974); State v. Mayberry, 52 N.J. 413, 437 (1968), cert. den., 393 U.S. 1043, 89 S. Ct. 673, 21 L. Ed. 2d 593 (1969). This wide latitude is not unfettered, however, and is subject not only to the parameters established by decisional law, but to ethical considerations as well. See Model Code of Professional Responsibility, DR7-106(c) (1979) (\"[A] lawyer shall not: [s]tate or allude to any matter that he has no reasonable basis to believe is relevant to the case or that will not be supported by admissible evidence\"); ABA Standards Relating to the Administration of Criminal Justice, Standard 3-1.1(c) (\"The duty of the prosecutor is to seek justice, not merely to convict\").\n\nProsecuting attorneys, as representatives of the State, are compelled to further the goals of our criminal justice system. State v. Bucanis, 26 N.J. 45, 56 (1958). This mission is accomplished by conscientiously and ethically undertaking the difficult task of maintaining the precarious balance between promoting justice and achieving a conviction. State v. Ramseur, supra, 106 N.J. at 323. A prosecutor's remarks and actions must at all times be consistent with his or her duty to\n\nensure that justice is achieved. State v. Biegenwald, supra, 106 N.J. at 39. Absolute adherence to this duty is stringently compelled in capital cases where the penalty is death. State v. Rose, 112 N.J. 454, 524 (1988); State v. Ramseur, supra, 106 N.J. at 324.\n\nThe following are some of the remarks made by the prosecutor during her guilt phase opening statement:\n\nBeverly Mitchell had so much to live for. Bright, beautiful, educated, religious, a member of her church choir. Beverly taught school in the Trenton school system. She taught special education. She was working part-time as a receptionist at the Bellevue Care Center to earn some extra money. You see, Beverly was due to be married in 1983. That very day, December 30, 1982, Beverly and her mother spent the day before Beverly went to work at the Bellevue Care Center, they spent the day looking for an apartment, an apartment that Beverly and her husband-to-be would share when Beverly started her new life. Beverly looked forward to 1983 with such joy, such hope, such promise. But it was not to be. The defendant, James Edward Williams, changed all of that. He changed it brutally, savagely, permanently. In a few moments of unspeakable horror, the defendant destroyed all of Beverly's dreams. In a few moments of unimaginable terror, the defendant destroyed all of Beverly's plans. In those few moments of a living nightmare, the defendant destroyed all of that joy, all that hope, all that promise. In those few moments, he destroyed Beverly Mitchell. She would never live to see her wedding day. . . . When I have a chance to speak to you again, you will have . . . the total picture of how this defendant savagely, brutally and permanently destroyed all the goodness and humanity that was Beverly Mitchell.\n\nAt the conclusion of the State's remarks, the defendant moved for a mistrial, arguing that the victim's background and her future plans were irrelevant to the case, and that comments were made on these matters solely to inflame the jury and elicit passion. The motion was denied, the trial court ruling that \"background\" information was admissible. The same type of commentary is found in the prosecutor's guilt phase summation; defendant again moved, unsuccessfully, for a mistrial.\n\nThe pattern recurred during the sentencing proceeding. Although the objectionable remarks relating to the victim's character and future plans were not as numerous in the opening statement and the summation of the penalty phase, the prosecutor's references cannot be characterized as oblique or incidental, especially in view of the more detailed statements and\n\ntestimony during the guilt phase. These references were neither appropriate nor harmless. See People v. Hope, 116 Ill. 2d 265, 108 Ill.Dec. 41, 45, 508 N.E. 2d 202, 206 (1986) (conviction reversed when admission of highly prejudicial testimony regarding surviving members of victim's family \"[was] not brought to jury's attention incidentally, but in such a manner as to permit jury to believe it material\"). But see Ingram v. State, 253 Ga. 622, 323 S.E. 2d 801, 814 (1984) (general background of victim held relevant in a trial of a defendant accused of his murder), cert. den., 473 U.S. 911, 105 S. Ct. 3538, 87 L. Ed. 2d 661 (1985).\n\nIn response to the recent trend toward revitalizing the victim's role in criminal proceedings, many jurisdictions have enacted legislation that recognizes, in some fashion, the victim's interests. See Cardenas, The Crime Victim in the Prosecutorial Process, 9 Harv.J.L. \u0026 Pub.Pol'y 357 (1986); see also Ala.Code  15-14-50 to 57 (1987) (victim of a criminal offense entitled to be present at trial and to be seated at prosecuting attorney's table); Cal.Penal Code,  679 to 679.02. (West 1988) (enacted \"to ensure that all victims of crime are treated with dignity, respect, courtesy, and sensitivity\"); Fla.Stat.Ann.  960.001 (West 1985 and 1988) (establishes guidelines for treatment of victim in criminal justice system); Ill.Ann.Stat. ch. 38 paras. 1403-1408 (Smith-Hurd 1987) (enacted to \"increase the effectiveness of the criminal justice system by affording certain basic rights and considerations to . . . victims . . . of violent crime who are essential to prosecution\"); Mich.State.Ann.  28.1287(751) to 28.1287(775) [M.C.L.A.  780.751 to 780.775] (Callaghan 1988) (codifies victims' rights, including the right to make an oral impact statement at sentencing); S.C.Code Ann.  16-3-1530 (Law Co-op 1985) (establishes victim's bill of rights); S.D.Codified Laws Ann.  24-15-8.1 to -8.2 (1987) (victim entitled to notification when inmate who was convicted of committing felony is granted parole, escapes or is released from the penitentiary); N.Y.Exec.Law  640-649 (McKinney 1988) (established standards for the treatment of crime victims\n\nby state agencies, including the unified court system). Some states have gone so far as to include the crime's impact on its victim among the factors to be considered in sentencing the defendant. See N.Y.Crim.Pro Law  390.30 (McKinney 1983 and 1988) (establishes requirement of victim impact statement as a part of pre-sentence report).\n\nNew Jersey has enacted similar legislation. See N.J.S.A. 52:4B-39 to -49 (establishing Office of Victim-Witness Assistance, Victim-Witness Rights Information Program and Office of Victim-Witness Advocacy). Notwithstanding the enactment of N.J.S.A. 2C:44-6, which provides for the inclusion of a victim impact statement in the pre-sentence report, our criminal laws focus on the culpability of the defendant rather than the virtue of the victim. See 3 C. Torcia, Wharton's Criminal Procedure  528 (12th ed. 1975). Defendants may not assert as a defense that the victim was such a worthless human being that the latter's murder was acceptable or at least no loss to the world. Similarly, our law does not regard a crime committed against a particularly virtuous person as more heinous than one committed against a victim whose moral qualities are perhaps less noteworthy or apparent. The law exists to protect all persons equally.\n\nIn Booth v. Maryland, the United States Supreme Court addressed the constitutionality of introducing a victim impact statement (VIS) at the sentencing phase of a capital murder trial. 482 U.S. 496, 107 S. Ct. 2529, 96 L. Ed. 2d 440 (1987). The VIS, which contained a description of the personal characteristics of the victims and the effect of the murder on the victims' family, was found to cause the jury to focus on the victim rather than the defendant. The Court, finding that the eighth amendment prohibits a capital sentencing jury from considering a VIS, stated that\n\na jury's discretion to impose the death sentence must be \"suitably directed and limited so as to minimize the risk of wholly arbitrary and capricious action.\" . . . [A] jury must make an \"individualized determination\" of whether the defendant in question should be executed, based on \"the character of the\n\nindividual and the circumstances of the crime.\" . . . To do otherwise would create the risk that a death sentence will be based on considerations that are \"constitutionally impermissible or totally irrelevant to the sentencing process.\" [ Id. at , 107 S. Ct. at 2532, 96 L. Ed. 2d at 448 (citations omitted).]\n\nMoreover, a jury as fact-finder should undertake its task as dispassionately as possible without being \"divert[ed] . . . from deciding the case on the relevant evidence concerning the crime and the defendant.\" Id. at , 107 S. Ct. at 2536, 96 L. Ed. 2d at 452.\n\nThe admission of \"background\" evidence relating to the victim's character or personal life requires a balancing of the probative value of the proffered evidence against the risk that its admission may pose the danger of undue prejudice or confusion to the jury. Evid.R. 4. The trial court, in its discretion, makes the determination of whether the otherwise admissible evidence should be excluded. State v. Carter, 91 N.J. 86, 106 (1982). The trial court is also empowered to restrict the use of admissible evidence to the purpose for which it was admitted; evidence that is admissible for the purpose of proving a material fact is not a tool of the prosecutor, to be employed as a means to bring irrelevant and prejudicial facts and irrelevant conclusions to the attention of the jury. In this case, the trial court mistakenly failed to exercise its powers to prevent undue prejudice.\n\nAny capital trial will necessarily involve testimony and physical evidence pertaining to the victim. This evidence, though admissible, cannot be used in a manner calculated to so confuse or impassion the jury that it inappropriately intertwines irrelevant emotional considerations with relevant evidence. There are occasions when evidence relating to the victim's character and personality may be probative of critical aspects of the trial, e.g., defendant's assertion of self-defense or provocation. Where, however, as in the matter before us, the victim's character has no bearing on the substantive issue of guilt or the penalty to be imposed, the prosecution may not comment\n\non the evidence in a manner that serves only to highlight the victim's virtues in order to inflame the jury.\n\nThe passage quoted at length above contains nothing that would aid the jury in determining the defendant's guilt or innocence. Rather, the inflammatory statements could likely result not only in unduly prejudicing the jury against defendant but also in confusing it over whether its deliberations should be influenced by the sterling character of the victim. There is no place in a capital case for such confusion and prejudice. The prosecutor's remarks were clearly improper and should have been stricken from the record and the jury properly instructed to disregard them.\n\nIn State v. Bucanis, we acknowledged that not every deviation from the legal prescriptions governing prosecutorial conduct warrants reversal. 26 N.J. at 56. To justify reversal the prosecutor's conduct must have been \"clear[ly] and unmistakabl[y]\" improper, and the improper conduct must have resulted in substantial prejudice to the defendant's fundamental right to have a jury fairly assess the persuasiveness of his case.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Id. at 56. Nonetheless, this Court has been neither indecisive nor hesitant to reverse a conviction where a defendant's constitutional rights have been abridged as the result of glaring, unequivocal evidence of prosecutorial misconduct. This is especially true in capital cases where the severity of the penalty requires that nothing be permitted to undermine the underlying objective of our task -- to ensure that justice is done. See State\n\nv. Rose, supra, 112 N.J. at 524; State v. Johnson, 31 N.J. 489, 511 (1960).\n\nWith respect to the sentence, the prosecutor's remarks, permitted over defendant's objection, raise serious questions about whether the jury's judgment was \"suitably directed and limited\" during the penalty phase. Booth v. Maryland, supra, 482 U.S. at , 107 S. Ct. at 2532, 96 L. Ed. 2d at 448. For example, the prosecutor related to the jury that the victim had \"so much to live for,\" that she was \"beautiful, educated, religious, a member of her church choir.\" The prosecutor concluded her opening statement by remarking that James Williams had \"destroyed all the goodness and humanity that was Beverly Mitchell.\" The trial court overruled defendant's objections to these opening statements. Additionally, at the end of the State's case in the guilt phase, the prosecutor stated that she would be \"remiss\" if she did not \"just take up a few more moments and talk about the person who was actually the most important in this case, and that person is Beverly Mitchell.\" The trial court also overruled defendant's objections to these statements. The prosecutor then picked up a photograph of Beverly Mitchell that had been in the victim's pocketbook and walked past the jury, showing the photo and stating: \"Bright, educated, a teacher at Trenton High School . . . holding down two jobs in anticipation of her marriage that was to be in July of 1983 . . . looking forward to the future, in fact that very day . . . looking for an apartment she would live in after she was married. . . . She didn't deserve to die as she did, naked, ravaged, in agony, and calling to Jesus for help. Jesus help me, Jesus help me.\"\n\nConceding that any capital case will be prone to emotional displays by those giving testimony, surely it is not too much to expect and require that officers of the court conduct themselves without resorting to improper appeals to the jury's emotions. It is constitutionally required that juries in capital trials reach a verdict and impose a penalty without inordinate exposure to unduly prejudicial, inflammatory commentary.\n\nFailure to purge successfully such comments from admittedly emotion-charged proceedings creates the unacceptable risk that what will result is the arbitrary and capricious imposition of the death penalty. Booth v. Maryland, supra, 482 U.S. at , 107 S. Ct. at 2532, 96 L. Ed. 2d at 448.\n\nDefendant further asserts that other aspects of the prosecutor's conduct throughout both the guilt and penalty phases of the trial proceedings prevented defendant from receiving a fair trial in violation of the sixth amendment of the United States Constitution, and article I, paragraph 10 of the State Constitution. In support of this assertion defendant maintains that: (1) the prosecutor's summation at the close of the penalty phase improperly invited the jury to draw an adverse inference from the defendant's failure to testify, thereby vitiating defendant's fifth-amendment right against self-incrimination; (2) the State's characterization of the defendant as a \"cancer\" and a \"parasite upon society\" was improper, and (3) the State's comments regarding the veracity and credibility of defendant's witnesses were prejudicially erroneous. Defendant maintains that these examples of prosecutorial misconduct constitute reversible error.\n\nReversal is mandatory if the prosecuting attorney has unambiguously called attention to defendant's failure to testify in exercise of his fifth-amendment constitutional right. See Griffin v. California, 380 U.S. 609, 85 S. Ct. 1229, 14 L. Ed. 2d 106 (1965). Not all prosecutorial comments on defendant's failure to testify, however, compel this result. In United States v. Robinson, 485 U.S. , 108 S. Ct. 864, 99 L. Ed. 2d 23 (1988), defense counsel asserted, during his closing statement, that the Government had not permitted defendant to recount his version of the facts. In response, the prosecutor commented during his summation that defendant could have explained his story to the jury. The court found no fifth amendment violation, concluding that \"where as in this case the prosecutor's reference to the defendant's opportunity to testify\n\nis a fair response to a claim made by defendant or his counsel, we think there is no violation of the privilege.\" Id. at , 108 S. Ct. at 869, 99 L. Ed. 2d at 31.\n\nThe record before us is devoid of any indication that the State improperly referred to defendant's silence at trial. The State's summation at the close of the penalty phase, in which the State commented that defendant had shown no remorse about his actions, was, at most, a direct response to defense counsel's summation, which asserted that defendant was indeed remorseful, as testified to by one of defendant's expert witnesses. As such the State's comments were directed to properly admitted evidence, not defendant's failure to testify.\n\nThe State's comments casting aspersions on the veracity and credibility of defendant's witnesses similarly were not improper, since two of the witnesses admitted that they had perjured themselves before the grand jury. Moreover, there were discrepancies between the testimony of police officers and defendant's witnesses over the physical appearance of an apartment frequented by defendant. The State did not overstep the bounds of permissible conduct by drawing the jury's attention to inconsistencies in testimony and therefore questioning the strength of defendant's case.\n\nHowever, the State's reference to defendant as a \"cancer\" and \"a parasite upon society\" is troubling, especially when viewed cumulatively with the State's conduct during both phases of the trial. Both the United States Supreme Court and this Court have criticized improper references to defendant as an \"animal.\" Darden v. Wainwright, 477 U.S. 168, 180, 106 S. Ct. 2464, 2471, 91 L. Ed. 2d 144, 156-57 (1986); State v. Wilson, 57 N.J. 39, 50 (1970). New Jersey courts have also repeatedly condemned the use of similar objectionable appellations to describe defendants. State v. Siciliano, 21 N.J. 249, 262 (1956) (criticizing use of \"butcher boy\"); State v. Stewart, 162 N.J. Super. 96, 102-03 (App.Div.1978) (prosecuting attorney's description of defendant as \"young punk\" condemned); State v. Von\n\nAtzinger, 81 N.J. Super. 509, 516 (App.Div.1963) (use of \"hood,\" \"punk,\" \"bum\" constituted plain error); State v. Bruce, 72 N.J. Super. 247, 251 (App.Div.1962).\n\nAgain, we caution prosecuting attorneys that derogatory name-calling will not be condoned. Mindful of the rhetorical excesses that invariably attend litigation, we nonetheless strongly admonish prosecutors to be circumspect in their zealous efforts to win convictions. Although our courts on numerous occasions have noted with displeasure prosecutorial excesses, it is evident that these expressions of dissatisfaction have failed to eliminate improper conduct that results in constitutional deprivation or violates established notions of fair play. See State v. Spano, 64 N.J. 566, 568 (1974). As this Court cautioned in State v. Spano, we are prepared to take more severe action as required to ensure that capital trials are conducted without resort to improper remarks and questionable tactics by the State's prosecuting attorneys. Id. at 569.\n\nIV.\n\nPenalty Phase Jury Instructions\n\nA few words remain to be said about the trial court's instructions to the jury in the penalty phase of the proceedings below. As stated above, supra at 407 the court's instruction governing the weighing of aggravating and mitigating factors contravenes our holding in State v. Biegenwald, supra, 106 N.J. at 53-67. The instruction must make clear that in order for a death sentence to be imposed, the aggravating factors must be found beyond a reasonable doubt to outweigh the mitigating factors.\n\nA second problem with the sentencing charge concerns the trial court's explanation of the mitigating factors and their role in the sentencing determination. In State v. Bey (II), supra, 112 N.J. at 168-70 although acknowledging that the trial court is not obliged to frame jury instructions according to any\n\nparticular formula, we noted that the trial court is bound to explain adequately the significance and function of mitigating factors and the meaning of the factors on which defendant relies. This explanation is critical to ensure that there is no reasonable possibility of the jury misunderstanding the proper application of mitigating factors. Id., at 169.\n\nHere, as in Bey II, the trial court's charge to the jury was inadequate, for it was merely a recital of the applicable sections of N.J.S.A. 2C:11-3c(5)(d) (intoxication), -3c(5)(c) (age), and -3c(5)(h) (the catch-all mitigating factor). As such, the charge was devoid of explanatory language to guide and assist the jury in its determination of whether to impose the death penalty. In the absence of such guidance, there is the likelihood or at least a reasonable possibility that the jury might misunderstand the function and meaning of mitigating factors, resulting in the risk of an arbitrary and capricious death sentence. Id. at 169. Neither the federal nor the state Constitution allows the accommodation of this risk. We find it unnecessary, however, to decide whether this error -- failure adequately to explain mitigating factors -- would, standing alone, require reversal.\n\nIn sum, both the guilt and penalty phase of the proceedings below must be reversed. The trial court's failure to assure the impartiality of the jury due to the inadequacy of the voir dire and defendant's loss of a peremptory challenge require reversal of both phases. Furthermore, the instructions issued to the jury in the sentencing phase concerning the weighing of aggravating and mitigating factors were erroneous and also require reversal.\n\nThe judgment of conviction and the sentence of death are reversed, and the cause remanded for proceedings consistent with the opinion.\n\nHANDLER, J., filed a separate concurring opinion.\n\nHANDLER, J., concurring.\n\nIn this capital-murder appeal, the defendant, James Edward Williams, was convicted of the knowing and purposeful murder of Beverly Mitchell and sentenced to death. I concur in the Court's conclusion that the defendant's murder conviction and death sentence must be reversed. While I agree in part with the essential conclusions of the Court, I write separately to point out that reversal of the conviction and sentence, in my view, is required for additional reasons.\n\nI.\n\nThis appeal is one of several capital-murder cases that followed the Court's initial decisions, State v. Biegenwald, 106 N.J. 13 (1987), appeal after remand, 110 N.J. 521 (1988), and State v. Ramseur, 106 N.J. 123 (1987), in which the Court held that New Jersey's capital murder-death penalty act, N.J.S.A. 2C:11-3, substantially satisfies constitutional requirements. Its holdings, however, evade finality. There are myriad circumstances that constantly affect the critical issues in death-penalty prosecutions. Decisional law regularly presents new and varying applications of capital-murder standards, demographic evidence and statistical data continue to inform us about the ramifications of the death penalty, and the absence of guided prosecutorial discretion and proportionality review creates a gaping void in our death penalty jurisprudence. These factors serve to reshape our perceptions of constitutional doctrine, unsettle the law of capital murder, and mandate constant reconsideration of capital murder-death penalty issues. Because death-penalty law remains in flux, I continue to adhere to my position that the death-penalty statute, as enacted and applied, violates constitutional and fundamental fairness standards. State v. Gerald, 113 N.J. 40, 48 (1988) (Handler, J., concurring and dissenting); State v. Zola, 112 N.J. 384, 391 (1988) (Handler, J., concurring and dissenting). I believe it is necessary and important to explain the reasons that justify this position.\n\nIn State v. Ramseur, supra, 106 N.J. at 345, 382-404, I asserted, among other positions, that the capital-murder statute should be held to violate this State's constitutional requirement of due process and prohibition against cruel and unusual punishments, as well as standards of fundamental fairness. Arbitrary enforcement of the act, in my view, derives in substantial measure from the statute's broad definition of capital murder in combination with the application of aggravating factors that are vague, susceptible of varying interpretations and fail adequately to guide jury discretion both in defining the class of death-eligible defendants and in imposing the ultimate penalty. Ibid. I acknowledge that the Court has moved in the direction of reducing some of these constitutional shortcomings by narrowing somewhat the definition of capital-murder, see, e.g., State v. Gerald, supra, and clarifying the standards governing aggravating factors, see, e.g., State v. Ramseur, supra, but the constitutional gaps, in my view, remain wide. See, e.g., State v. Gerald, supra, 113 N.J. 40, 48-56 (Handler, J., concurring and dissenting); State v. Rose, 112 N.J. 454, 481-87 (1988) (Handler, J., dissenting). I have stressed, also, that the absence of guided prosecutorial discretion in this statutory framework can lead only to the arbitrary, and thus unconstitutional, enforcement of the act. See State v. Bey (II), 112 N.J. 123, 131 (1988) (Handler, J., dissenting); State v. Koedatich, 112 N.J. 225, 276 (1988) (Handler, J., dissenting); State v. Ramseur, supra, 106 N.J. at 404-08 (Handler, J., dissenting). Further, while the Court appreciates the need and urgency of meaningful proportionality review, see State v. Koedatich, supra, 112 N.J. at 258-59, the continuing absence of proportionality review within this statutory scheme is a fatal constitutional flaw because there is no other way under the statute to correct an arbitrary or discriminatory death sentence. State v. Gerald, supra, 113 N.J. at 72 (Handler, J., concurring and dissenting); State v. Ramseur, supra, 106 N.J. at 404-08 (Handler, J., dissenting).\n\nI have, in addition, urged the Court to adopt an express enhanced standard of review that can be applied to capital-murder prosecutions, a standard that would address particularly the unique issues of a capital-murder case without inadvertently or unnecessarily distorting the principles that govern other criminal cases. See State v. Bey (I), 112 N.J. 45, 52-65 (1988) (Handler, J., concurring). Under this enhanced standard, courts should engage in a searching review of the trial record, and on finding error, apply a different and stricter measure for determining whether the error is reversible. Ibid. I reiterate that we are dealing with capital crime, the prosecution of which fundamentally implicates community values that can be brought to bear only through the deliberations of the jury. It is therefore imperative to invoke a process of appellate review that directs attention to the jury's deliberative responsibility, rather than one that simply examines its conclusion. State v. Zola, supra, 112 N.J. at 391 (Handler, J., concurring and dissenting). The test, as I view it, must concern itself primarily with the direct and indirect impact of trial-level events on the jury itself and, particularly, with the fairness of the presentation and consideration of evidence. Such a test in capital cases must be more critical and incisive than conventional appellate review, which in the ordinary case is strongly influenced by the pragmatic desire to salvage a conviction, and consequently concentrates its criticism on the ostensible correctness of the verdict. Unlike the conventional \"harmless error\" or \"plain error\" or \"unjust result\" analyses, in which the appellate court looks to whether the error contributed to and indeed changed the verdict itself, the enhanced standard concentrates on the intrinsic fairness of the overall prosecution, and, especially, on whether the jury was able fully to engage in unfettered deliberations untainted by error. The question in a capital murder appeal thus should be whether, in the face of error, the State can prove beyond a reasonable doubt that there was no realistic likelihood that the error had a prejudicial influence or effect on the jury's deliberations of guilt. State v. Bey (II), supra, 112 N.J. at 131-44 (Handler, J., dissenting).\n\nThese considerations, as well as substantive differences, bear on my disagreements with the Court in this case. The majority in this appeal has found grounds other than those of constitutional or statutory invalidity for the reversal of defendant's capital-murder conviction and death sentence. These relate to the inadequacy of the voir dire and selection of the jury and to prosecutorial misconduct with respect to the introduction of and reference to inadmissible evidence. I do not differ from the Court that grave error attended the impanelling of the jury and the prosecutorial treatment of particular evidence. In my opinion, however, each of these trial deficiencies would separately and independently warrant reversal of the conviction and sentence.\n\nII.\n\nDefendant contends that the trial court erred in failing to excuse for cause prospective juror Pfeiffer, who expressed strong feelings in favor of applying the death penalty in all murder cases regardless of the specific facts. As a result, defendant was forced to use a peremptory challenge to dismiss Ms. Pfeiffer, and ultimately expended all twenty of his allotted peremptory challenges.\n\nI fully agree with the Court that juror Pfeiffer's answers to voir dire questions disclosed that her ability to weigh aggravating and mitigating factors was substantially impaired by a pro-death penalty bias. In indicating that she would automatically impose a death sentence for deterrence purposes even if the circumstances warranted a life sentence, Ms. Pfeiffer indisputably demonstrated her unfitness to serve as a juror. Ante at 437-39. The Court rules expressly and unequivocally that \"on the basis of what was learned of Ms. Pfeiffer's death penalty views during the voir dire, . . . the trial court erred in failing to excuse this prospective juror for cause.\" Ante at 440-41.\n\nIn finding that the trial court erred despite the fact that juror Pfeiffer never did sit on the jury, the majority thus acknowledges\n\nthe significance of the right of a peremptory challenge. It finds, further, that whatever prejudice may be attributed to that loss was compounded by a voir dire so inadequate as to leave in doubt the ultimate impartiality of the jury; it is the combination of errors -- the failure to discharge Ms. Pfeiffer for cause leading to the loss of a peremptory challenge and the failure to conduct the searching voir dire required in all capital cases -- that requires reversal of both the guilt and penalty phases. Ante at 445. The Court, however, chooses not to reach the question whether the wrongful deprivation of one peremptory challenge, when the defendant exhausts his full complement of challenges, warrants reversal. I would address that issue and reverse on that ground.\n\nThis Court recently noted that under the Federal Constitution it is not reversible error to fail to excuse for cause a juror who is thereafter peremptorily dismissed by a defendant who exhausts all his peremptory challenges \"[s]o long as the jury that sits is impartial. . . .\" State v. Bey (II), supra, 112 N.J. at 154 (citing Ross v. Oklahoma, 487 U.S. , , 108 S. Ct. 2273, 2278, 101 L. Ed. 2d 80, 90 (1988)). The Court posited, however, a sliding scale against which to measure the prejudice of the wrongful denial of a peremptory challenge. It recognized that \"forcing a defendant to waste a peremptory challenge could force defense counsel to be more cautious in the exercise of remaining peremptories,\" and expressly admonished trial courts to \"be particularly sensitive in capital cases to the defendant's right to a full complement of twenty peremptory challenges.\" Ibid. 112 N.J. at 155. \"As the defendant approaches the exhaustion of his or her peremptory challenges,' the Court continued, \"the trial court should become increasingly sensitive to the possibility of prejudice from its failure to dismiss the juror for cause.\" Id. at 155 (emphasis added).\n\nDespite the indication in Bey (II), supra, that the standard involved a sliding scale on which prejudice would be reached when all peremptories have been exhausted, the majority here seemingly adopts a jury-bias standard as the operative test for\n\nreversal. This can be inferred from its approving reference to the standard as formulated in Ross v. Oklahoma, supra, namely, that \"[s]o long as the jury that sits is not impartial,\" the wrongful denial of a peremptory challenge is not prejudicial or reversible. 487 U.S. at , 108 S. Ct. at 2278, 101 L. Ed. 2d at 90. It also is suggested by the Court's insistence that the concomitant inadequacy of voir dire is a crucial factor contributing to the potential bias of the jury.\n\nI strongly disagree with the Court's approach and analysis. I think it is entirely illusory to posit a jury-bias test for determining the significance of a wrongful denial of a peremptory challenge. As noted, under that test prejudice occurs only if \"the jury that sits is not impartial.\" Ibid. Jury bias, however, will almost never be provable, at least if there is adequate voir dire. It is self-evident that jurors who are impanelled will not have been excused for cause, presumably because such cause had not been shown. By definition, then, it will not be possible for a defendant, in objecting to the wrongful denial of a peremptory challenge, to show that the impanelled jury is \"not impartial.\"\n\nIf, on the other hand, there has been inadequate voir dire, resultant jury bias may readily be presumed and the deficient voir dire itself could be a sufficient basis for reversal. The denial of the peremptory challenge in that posture of a case becomes nothing but a procedural peccadillo.\n\nThe denial of a peremptory challenge, however, is surely not a matter of trial trivia, particularly when all peremptories have been used. An analysis that trivializes this particular error misperceives the objectives of proper jury selection. Unfortunately, the jury-bias test endorsed by this Court does just that. The jury-bias test fails wholly to appreciate that the ultimate object of jury selection embraces a combination of values. The goal is to enable the parties, within the bounds of reasonable practicability as determined by our rules of procedure, to select fair and impartial jurors and, further, to select from among\n\nsuch jurors those who conform to each party's perception of jurors who are especially suited to determine the issues in the particular case being tried. The key to the selection of such jury is the peremptory challenge. See State v. Brunson, 101 N.J. 132, 136-38 (1985). However, in this case, the point of the peremptory challenge is lost. By concentrating attention solely on the voir dire and resultant jury bias, the test espoused by the Court treats the wrongful denial of a peremptory challenge as virtually irrelevant.\n\nThus, jury bias as such is not a meaningful standard and cannot be the critical test for determining the significance to a defendant of the wrongful deprivation of a peremptory challenge. I submit the standard should be whether the defendant was unfairly deprived of the opportunity, through the exercise of peremptory challenges, to secure a jury that consists not only of impartial and qualified persons impanelled in accordance with the rules governing jury selection, but who are otherwise satisfactory and suitable to the defendant.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThere is some suggestion in our cases that jury bias is important, if not dispositive, in determining whether the wrongful deprivation of a peremptory challenge is prejudicial and justifies a reversal. See, e.g., Wright v. Bernstein, 23 N.J. 284 (1957). Nevertheless, we have not adopted a jury-bias standard. See, e.g., State v. Pereira, 202 N.J. Super. 434, 438 (App.Div.1985); State v. Hammond, 107 N.J. Super. 588, 589-90 (App.Div.1969). Undoubtedly, the existence of such bias, or even the presence of potential, albeit unexplored bias, can be\n\nrelevant. In State v. Deatore, 70 N.J. 100, 105 (1976), for example, the Court held that the trial court's refusal to question a prospective juror about the extent of her relationship with the victim justified reversal, notwithstanding the fact that the defendant challenged her peremptorily. In that case, as here, defendant ultimately exhausted his peremptory challenges and was denied additional challenges. The Court indicated that the error was indeed prejudicial because the exhaustion of defendant's peremptories prevented defendant from challenging a subsequent juror who mentioned two relatives employed as corrections officers.\n\nRegardless of the relevance of jury-bias as a viable test in civil cases, e.g., Wright v. Bernstein, supra, or in ordinary criminal cases, e.g., State v. Deatore, supra, it cannot serve as the standard in a capital case. The presence of actual bias or even the possibility of potential or latent bias of impanelled jurors cannot become the exclusive or controlling consideration in assessing the inherent fairness of a capital-murder prosecution.\n\nAs noted, the jury-bias test is suggested by Ross v. Oklahoma, supra, 487 U.S. , 108 S. Ct. 2273, 101 L. Ed. 2d 80. We should not, however, accept Ross v. Oklahoma as an influential or persuasive precedent. We have acknowledged that federal decisions are unreliable authority in determining our own constitutional death-penalty jurisprudence. We have just recently repudiated a similar federal lead. In both State v. Gerald, supra, 113 N.J. at 70-80, and State v. Marie Moore, 113 N.J. 239, 300-01 (1988) the Court adopted the rationale of Enmund v. Florida, 458 U.S. 782, 102 S. Ct. 3368, 73 L. Ed. 2d 1140 (1982), and refused to follow the Supreme Court's later decision Tison v. Arizona, 481 U.S. 137, 107 S. Ct. 1676, 95 L. Ed. 2d 127 (1987), which significantly curtailed the Enmund decision. There is even less compulsion for us to follow the Supreme Court in Ross.\n\nThe application of Ross to our law is misguided and unfortunate because Ross itself represents a dramatic retrenchment from the view taken by the Supreme Court just a year ago in Gray v. Mississippi, 481 U.S. 648, 107 S. Ct. 2045, 95 L. Ed. 2d 622 (1987). In Gray, a majority of the Court rejected as \"unpersuasive\" the argument that the erroneous exclusion for cause of a death-scrupled juror was harmless because the State retained a peremptory challenge that it could have used to excuse the juror. As the Supreme Court stated in Gray, \"the relevant inquiry is 'whether the composition of the jury panel as a whole could possibly have been affected by the . . . error.'\" Id. at 665, 107 S. Ct. at 2055, 95 L. Ed. 2d at 637 (quoting Moore v. Estelle, 670 F.2d 56, 58 (5th Cir.), (specially concurring opinion), cert. den., 458 U.S. 1111, 102 S. Ct. 3495, 73 L. Ed. 2d 1375 (1982)). The Ross Court's contrary position, which focuses exclusively on the actual impartiality of a given jury, simply ignores the due process-related argument that \"everyone concedes that the trial judge could not arbitrarily take away one of the defendant's peremptory challenges. Yet, that is in effect exactly what happened here.\" Ross v. Oklahoma, supra, 487 U.S. at , 108 S. Ct. at 2280, 101 L. Ed. 2d at 92 (Marshall, J., dissenting, joined by Brennan, Blackmun, and Stevens, JJ.).\n\nThe Court in this case should conclude that an erroneous failure to dismiss a juror for cause, leading to an expenditure of one of defendant's peremptory challenges and the ultimate exhaustion of defendant's allotment of challenges, warrants reversal. The Court in State v. Singletary, 80 N.J. 55 (1979), while finding that the trial court had not erred in refusing to dismiss the juror in question for cause, noted the gravity of the issue when a defendant has thereafter exhausted all his peremptory challenges. The Court emphasized that \"[j]ury selection is an integral part of the process to which every criminal defendant is entitled\" and that \"'the denial of the right of peremptory challenges is the denial of a substantial right.'\" Id. at 62 (quoting Wright v. Bernstein, supra, 23 N.J. at 295.\n\nThree dissenting justices, moreover, determined under the circumstances that the denial of the peremptory challenge in that case was indeed error, with one concluding that \"the denial to defendant of the full range of choice accorded by the allowance of the right to challenge jurors peremptorily constituted reversible error.\" Id. at 82.\n\nThe view that the denial of a single peremptory challenge warrants reversal has been adopted by the Appellate Division. State v. Pereira, supra, 202 N.J. Super. at 438; State v. Hammond, supra, 107 N.J. Super. at 590; accord People v. O'Hare, 117 A.D. 2d 757, 759, 498 N.Y.S. 2d 478, 480, app. den., 67 N.Y. 2d 948, 494 N.E. 2d 126, 502 N.Y.S. 2d 1041 (1986) (New York court rule requires reversal where erroneous denial of challenge for cause prompts defendant to exhaust peremptories prior to completion of jury selection). Further, while the Supreme Court now adheres to the view that the Federal Constitution does not require the automatic reversal rule, see, e.g., Ross v. Oklahoma, supra, a number of federal courts have taken the position that automatic reversal results from the denial of a peremptory challenge where defendants' peremptory challenges are ultimately exhausted. See, e.g., United States v. Ricks, 776 F.2d 455 (4th Cir.1985), cert. den. sub nom. King v. U.S., 479 U.S. 1009, 107 S. Ct. 650, 93 L. Ed. 2d 705 (1986); United States v. Martin, 749 F.2d 1514, 1518 (11th Cir.1985); United States v. Allsup, 566 F.2d 68, 71 (9th Cir.1977); United States v. Turner, 558 F.2d 535, 538 (9th Cir.1977); United States v. Nell, 526 F.2d 1223, 1230 (5th Cir.1976); United States v. Boyd, 446 F.2d 1267, 1275 n. 27 (5th Cir.1971). But see United States v. Brown, 644 F.2d 101, 104 (2d Cir.) (2-1 decision taking the opposite view), cert. den., 454 U.S. 881, 102 S. Ct. 369, 70 L. Ed. 2d 195 (1981). This rule does not \"[r]est on constitutional grounds but on the common-law principle that the 'denial or impairment of the right is reversible error without a showing of prejudice.'\" Celestine v. Blackburn, 750 F.2d 353, 360 (5th Cir.1984) (quoting Swain v. Alabama, 380 U.S. 202, 219, 85 S. Ct. 824, 835, 13 L. Ed. 2d 759, 772 (1965)), cert. den., 472 U.S. 1022,\n\n105 S. Ct. 3490, 87 L. Ed. 2d 624, reh. den., 473 U.S. 925, 106 S. Ct. 16, 87 L. Ed. 2d 695 (1985)).\n\nIn urging the position that the denial of the peremptory in these circumstances is reversible error, I need do no more than adopt and adapt Justice Clifford's analysis in Singletary, supra, 80 N.J. 55. Here, as in the Singletary case, the trial court erroneously failed to excuse a juror for cause, thereby forcing defendant to expend a peremptory challenge to dismiss that juror; here, as in Singletary, defendant ultimately exhausted his allotment of peremptory challenges, i.e., entitled to twenty, he was, in effect, accorded but nineteen; and here, as stressed by Justice Clifford in Singletary, \"[t]hat . . . is the rub.\" 80 N.J. at 69.\n\nAny diminution of or infringement upon [the] legislatively granted opportunity [to excuse any juror peremptorily] deprives defendant of as fair a trial as our rules permit. Defendant's argument here, with which I agree, is that his claim of error derives from his due process guarantees and from our standards of fair trial, whereas his entitlement to relief springs from the legislative grant of twenty peremptory challenges and his right thereto, which he was denied. [ Id. at 71 (Clifford, J., dissenting) (citations omitted).]\n\nWhat this analysis underscores is that a defendant's right to challenge peremptorily even impartial and qualified jurors is one that belongs exclusively to the party. Its function is not to supplement or complement the trial court's responsibility to excuse jurors for cause; nor, is it intended to be a safety net to catch the court's error in failing to excuse an unqualified juror. \"Purity of the right to be tried by an impartial jury is so zealously guarded that an accused may covet his peremptory challenges and 'spend' them as he alone sees fit. . . .\" State v. Morrison, 557 S.W. 2d 445, 446 (Mo.1977). No one can dispute that \"in a criminal case . . . defendant is afforded twenty opportunities to excuse any venireman peremptorily -- for a good reason, a bad reason, or no reason at all. . . .\" State v. Singletary, supra, 80 N.J. at 74 (Clifford, J., dissenting). But cf. State v. Gilmore, 103 N.J. 508 (1986) (prosecutorial exercise of peremptory challenges based on race violates defendant's right to impartial jury). In State v. Bey (II), supra, I stressed that the erroneous refusal by the Court to excuse a juror for cause, which forced the defendant to exercise a peremptory challenge, is not \"harmless\" nor does its prejudicial effect depend exclusively on whether a defendant has exhausted his peremptory challenges. 112 N.J. at 142 (Handler, J., dissenting). I emphasized that every time a peremptory challenge is \"wasted\" on a juror who should have been excused for cause, the calculus is altered with respect to the rest of the panel and the defendant's right to his full complement of challenges is abridged. Peremptory challenges are usually exercised during the course of jury selection with no clear sense of the overall jury composition. Cf. State v. Morrison, supra, 557 S.W. 2d at 446 (peremptory challenges with respect to a \"struck jury\" are exercised in light of the composition of the entire qualified jury panel.)\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Each exercise of a peremptory entails the risk that a subsequent venireperson who would be qualified for cause later during the voir dire could not be removed by a peremptory challenge because of the earlier expenditure of such challenges; the defendant cannot intelligently weigh each potential juror against others, making the exercise of each peremptory challenge a greater gamble and a more fateful decision. Indeed, this was understood, though understated, by the Court in State v. Bey (II), supra, when it observed that defense counsel forced \"to waste\" a peremptory challenge must \"be more cautious in the exercise of remaining peremptories.\" 112 N.J. at 155. The defendant, in effect, must treat each use of a peremptory as potentially his last peremptory.\n\nArguably, the question of whether peremptories were exhausted, or in what order they were used, may not be of controlling significance. Nevertheless, in this case, the error was extreme because the defendant did, in fact, use all of his peremptory challenges. Thus, in this case, Justice Clifford's analysis, in my view, controls this issue: \"[a]ny diminution of or infringement upon that legislatively granted opportunity [to exercise a full complement of peremptory challenges] deprives defendant of as fair a trial as our rules permit.\" State v. Singletary, supra, 80 N.J. at 71.\n\nMoreover, these considerations are even weightier in the context of a capital-murder prosecution because jurors must be death-qualified. In this kind of criminal trial death-qualification prior to the guilt phase constitutes a substantial and additional constraint on the exercise of peremptory challenges; it effectively reduces a defendant's complement of peremptories by requiring defense counsel to assess a prospective juror's possible bias as to punishment in addition to the usual assessment of possible bias as to guilt. Increasing this burden on the exercise of defendant's \"substantial right,\" moreover, is the fact that the death-qualification process itself induces bias as to guilt by requiring potential jurors to presuppose a finding that defendant is, indeed, guilty. See State v. Bey (II), supra, 112 N.J. at 133-40 (Handler, J., dissenting); State v. Ramseur, supra, 106 N.J. at 428-35 (Handler, J., dissenting). Thus, the defense counsel's normal calculation of when to \"spend\" a peremptory challenge for possible bias as to guilt is heavily encumbered by concerns of possible bias as to punishment and is severely skewed by a process that fosters bias as to guilt.\n\nAs I observed in Bey (II), in assessing whether the court's refusal to excuse a juror for cause is harmless, a defendant's failure to exhaust his peremptory challenges is a relevant consideration in the ordinary case, and, given the singularly important function of peremptory challenges, such an error could be reversible. Supra, 112 N.J. at 145-46. But there is nothing ordinary about a capital-murder case. The principle\n\nthat \"death is different\" requires, if anything, more punctilious appellate review, if not an enhanced standard of review with a stricter standard for reversibility. Whatever compunction and hesitation the Court might experience in characterizing an error as reversible in an ordinary criminal case assuredly cannot serve to dilute the gravity of the identical error in a case where the death penalty has resulted. See, e.g., State v. Zola, supra, 112 N.J. at 391 (Handler, J., concurring and dissenting); State v. Bey (I), supra, 112 N.J. at 52-65 (Handler, J., dissenting). Sharpened appellate review, combined with the distorting effects of death-qualification, leads me to conclude that an erroneous refusal to excuse a prospective juror for cause on death-qualification grounds should be reversible when a defendant ultimately exhausts all his peremptory challenges.\n\nThus, I believe that this Court should hold that in capital cases, where an erroneous denial of a challenge for cause prompts a defendant to dismiss a juror peremptorily, and the defendant ultimately exhausts his supply of peremptory challenges prior to the completion of jury selection and is denied an additional peremptory challenge, state constitutional standards of due process and principles of fundamental fairness compel reversal. Accordingly, on this ground alone, defendant's conviction should be reversed and the cause remanded for a new trial.\n\nIII.\n\nDefendant also contends that the trial court, over defendant's repeated objections, permitted the trial to become infected with highly prejudicial, inflammatory testimony and statements that focused not on defendant's guilt or innocence but on the victim's character. Defendant asserts that the court improperly admitted, as \"background,\" emotion-laden testimony relating to the victim's personal life, and improperly allowed the prosecutor to comment on that testimony in an unduly prejudicial manner. As a result, he contends, the jury was invited, in both\n\nthe guilt and penalty phases, to reach a verdict based on the victim's virtues rather than the defendant's culpability.\n\nThe Court states that because it is reversing both the guilt and penalty phases \"on other grounds,\" it need not determine the likelihood that the prosecutor's behavior led to an \"unjust verdict.\" Ante at 446. In my opinion, the prosecutor's misconduct tainted the presentation and consideration of evidence, and seriously affected the jury's deliberations. The misconduct was so egregious, it would, apart from other errors, require reversal of defendant's conviction as well as the death sentence.\n\nThe prosecution sought to provide certain background facts and to establish that the purse retrieved from the Delaware River belonged to the victim. This led to the introduction, over defendant's objections, of extraneous information, such as the victim's marriage plans and her involvement in a variety of church-related activities. The prosecutor repeatedly emphasized these facts during her opening and closing statements in both phases of the trial.\n\nThe defendant moved for a mistrial, contending that evidence and prosecutorial comments in both the guilt and penalty phases concerning the victim's background and her future plans were not sufficiently probative of any facts genuinely in dispute and were presented solely to inflame the jury. The motion was denied, the trial court ruling that \"background\" information was admissible.\n\nThe Court seemingly agrees with the defendant, concluding that the prosecutor's treatment of such evidence was \"neither appropriate nor harmless,\" and, further, that \"[t]his conduct cannot be attributed to the prosecutor's overzealous advocacy in the heat of litigation, but to an intentional, calculated plan to induce the jury to reach a verdict based on the victim's virtuous character.\" Ante at 447.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The Court's reasoning, however,\n\ntakes an ironic twist when it thereafter refuses to decide that this blatant prosecutorial misconduct was sufficiently prejudicial to warrant a reversal of defendant's conviction of guilt or death sentence.\n\nIn Booth v. Maryland, 482 U.S. 496, 107 S. Ct. 2529, 96 L. Ed. 2d 440 (1987), the Supreme Court addressed the constitutionality of introducing a victim-impact statement at the sentencing phase of a capital murder trial. The statement contained a description of the effect of the murder on the victim's family as well as \"the personal characteristics of the victims,\" i.e., they were a \"close couple,\" \"married for fifty-three years,\" \"loving parents and grandparents.\" Id. at n. 3, 107 S. Ct. at 2531 n. 3, 96 L. Ed. 2d at 446 n. 3. The Court concluded that the cruel and unusual punishment stricture of the eighth amendment prohibits a capital sentencing jury from considering such a statement because it caused the jury to focus on the victim rather than the defendant.\n\nWe thus reject the contention that the presence or absence of emotional distress of the victim's family, or the victim's personal characteristics, are proper sentencing considerations in a capital case. [ Id. at , 107 S. Ct. at 2535, 96 L. Ed. 2d at 450-51.]\n\nSimilarly, in State v. Gathers, 295 S.C. 476, 369 S.E. 2d 140, 144, cert. granted sub nom. South Carolina v. Gathers, U.S. , 109 S. Ct. 218, 102 L. Ed. 2d 209 (1988), the South Carolina Supreme Court concluded that prosecutorial remarks that \"conveyed the suggestion appellant deserved a death sentence because the victim was a religious man and registered voter\" violated the eighth amendment.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nIn this case, the prosecutor's remarks concerning the victim's personality and character contain nothing that would aid the jury in determining the defendant's guilt or innocence. As the Court itself states:\n\nthe inflammatory statements could likely result not only in unduly prejudicing the jury against defendant but also in confusing it over whether its deliberations should be influenced by the sterling character of the victim. There is no place in a capital case for such confusion and prejudice. The prosecutor's remarks were clearly improper and should have been stricken from the record and the jury properly instructed to disregard them.\" [ Ante at 452.]\n\nIn dealing with comparable, highly inflammatory comments by the prosecutor, the Court in Ramseur found that the defendant was not deprived of a fair trial because curative instructions were given following prompt objections to the comment. 106 N.J. at 322-23. Likewise, in State v. Koedatich, supra, the Court ruled that curative instructions could overcome egregious prosecutorial misconduct. 112 N.J. at 325-26. However, here no curative instructions were given; indeed, the trial court by consistently overruling defendant's objections seemingly authorized, if it did not condone, the prosecutor's introduction of and comments on this evidence. Not only was prejudice not overcome\n\nor neutralized by curative instructions, it was tangibly reinforced by the trial court's rulings. Hence, in my opinion, it is not possible to conclude that defendant's right to a fair trial was preserved.\n\nThe Court tacitly acknowledges this when it notes that the trial court mistakenly failed to exercise its powers to prevent undue prejudice. Ante at 457. Nevertheless, the Court refuses to consider whether the prosecutorial misconduct in this case would be sufficient independently to warrant a reversal of defendant's conviction as well as the death sentence.\n\nThe majority, with a hint of self-righteousness, reminds us that \"this Court has been neither indecisive nor hesitant to reverse a conviction where a defendant's constitutional rights have been abridged as the result of glaring, unequivocal evidence of prosecutorial misconduct,\" emphasizing that this is \"especially true in capital cases where the severity of the penalty requires that nothing be permitted to undermine the underlying objective of our task -- to insure that justice is done.\" Ante at 452. Acknowledging that this is indeed a case in which \"the prosecutor's remarks were clearly improper,\" ante at 452, the Court then does no more than \"strongly admonish . . . prosecutors to be circumspect in their zealous efforts to win convictions.\" Ante at 456.\n\nSadly, we have been this route before. In State v. Ramseur, supra, 106 N.J. at 322-23, we admonished prosecutors that we would not hesitate to reverse capital convictions based on prosecutorial misconduct where that conduct is \"so egregious that it deprived defendant of a fair trial.\" This is such a case; the \"fairness\" of a trial depends not on the culpability of a defendant, for it seems obvious that the most guilty defendant can have a trial that was unfair; rather, the fairness of a trial must rest, particularly in capital cases, on the integrity of the procedures that safeguarded the trial. As Justice Clifford put it in State v. Koedatich, supra, \"I see little hope of avoiding repitition of the deprivation of a fundamental constitutional\n\nright to a fair trial if we do no more than 'reiterate our warning . . .' that dire consequences may flow from [prosecutorial] violations. . . .\" 172 N.J. 225 at 232-33 (Clifford, J., dissenting). A hortatory decision is not the plateau on which justice should come to rest when a defendant's life is at stake.\n\nThe misconduct in this case did not begin with the penalty phase, but infected the entire proceeding. Indeed, in refusing to recognize the prosecutorial misconduct in this case as an independent ground for reversal, the majority denigrates such misconduct and sends an entirely wrong signal. A decision that does no more than this is no better than a primer for prosecutors; it is a placebo for the public but a bitter pill for defendants.\n\nIn my opinion, the defendant's conviction must be reversed for reasons of prosecutorial misconduct. Under an appropriate enhanced standard of review, State v. Bey (I), 112 N.J. at 52-65 (Handler, J., concurring), there was a realistic likelihood that the misconduct of the prosecutor had an adverse influence on the jury's ability to consider and deliberate exclusively on evidence properly admitted, warranting a reversal of the conviction and sentence. Similarly, even under this Court's conventional standard of review for prosecutorial misconduct in a capital case, State v. Bey (I), supra, 112 N.J. at 93-95; Ramseur, supra, 106 N.J. at 324 the prosecutor's misconduct requires such reversals. This Court should follow its own dictate in Ramseur and \"more readily find prejudice\" attributable to prosecutorial misconduct as justification to reverse the conviction.\n\nIV.\n\nFor the reasons set forth, I conclude that the respective errors entailed in the improper refusal to excuse a juror for cause resulting in the defendant's exhaustion of all peremptory challenges, and in the prosecutorial misconduct relating to the evidence of the victim's character and personality, independently\n\njustify a reversal of the defendant's murder conviction. I therefore concur only in the judgment of the Court.\n\n\u003cspan class=\"fn\"\u003e1. Defendant contends that he is entitled to a judgment of acquittal on the burglary charge, there being insufficient evidence to support a finding that the structure entered (i.e., the Bellevue Care Center) was not open to the public and that defendant was not privileged to enter, N.J.S.A. 2C:18-2a(1). As we reverse the conviction on other grounds, we do not reach this issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Defendant also moved that the bail hearing be held in camera on the ground that the pretrial publicity attending an open proceeding would deprive him of a fair trial before an impartial jury. That motion was denied, but an in camera bail hearing was eventually held on interim order of this Court. The Court ultimately directed the release of the transcript of that proceeding. State v. Williams (I), 93 N.J. 39, 74 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Defendant contends that the trial court, in its guilt-phase jury instructions, failed to explain adequately that as a requisite to a conviction for capital (as distinct from non-capital) murder, defendant had to be found to have committed the murder \"by his own conduct.\" N.J.S.A. 2C:11-3c. Special explanation of this point is clearly called for where there is a risk that the jury might otherwise convict a defendant of capital murder on a theory of accomplice liability. In this case, however, no such risk existed. Although the defense suggested during the trial that Dennis Floyd shared responsibility for the murder, the jury instructions adequately made clear that no conviction for capital murder could result from a finding that it was the conduct of Floyd, not that of defendant, that caused the death of the victim. The court used the words \"own conduct\" more than once and explained the offense in a straightforward manner. No further elaboration of the distinction between capital and non-capital murder was required on the facts of this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Although the basis of this instruction was the test governing dismissals for cause set forth in Witherspoon v. Illinois, 391 U.S. 510, 522 n. 21, 88 S. Ct. 1770, 1777 n. 21, 20 L. Ed. 2d 776, 785 n. 21 (1968), and not that adopted by this Court in State v. Ramseur, supra, 106 N.J. at 255-56, based on Adams v. Texas, 448 U.S. 38, 45, 100 S. Ct. 2521, 2526, 65 L. Ed. 2d 581, 589 (1980), and Wainwright v. Witt, 469 U.S. 412, 418-26, 105 S. Ct. 844, 849-53, 83 L. Ed. 2d 841, 847-53 (1985), that fact is not the source of our objection. Rather, it is the potential bias that may be injected -- even if the Witt \"substantially impair\" test were used (ibid.) -- by instructing people how to get themselves excused from jury service.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Our objection to this legal instruction prior to voir dire does not necessarily mean that the jurors must be shielded from any and all knowledge concerning death penalty law in this state. On the contrary, we believe it would be helpful if the trial court provided the jurors with an outline of this state's death penalty statute. See N.J.S.A. 2C:11-3. Knowledge about what constitutes capital murder, the bifurcated proceeding that separates the guilt and penalty phases, and the use of the \"aggravating and mitigating factors\" scheme during sentencing will enable all potential jurors to answer questions concerning the death penalty free of misconceptions and faulty assumptions concerning how the law is administered in this state. Additionally, this type of instruction will provide all jurors with a common base of information from which to answer questions, removing any difference between jurors based on knowledge of the law. We are mindful that even this informational instruction might inhibit to some degree jurors who believe in the death penalty for all homicides or who are death scrupled from freely voicing an opinion at odds with the philosophy of our law. This danger is minimized with this instruction, however, because the juror is not necessarily aware, based on this type of instruction, of what responses will eliminate him or her from consideration as a juror. Moreover, the trial judge can question the juror regarding his or her opinion of the statute itself, and query him or her on various hypothetical examples to probe how various factors might affect a person's decisionmaking process. Finally, we believe that providing jurors with a concrete and accurate view of the death penalty in New Jersey will enable them to answer questions concerning their attitudes about the death penalty based on an accurate portrayal of what the law is, and thus put the juror in a position to answer questions free of mistaken notions concerning the law, which appear to be so prevalent on review of the transcripts of this voir dire and so many others.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Defendant also challenges the court's refusal to ask the jurors whether or not the voir dire questions themselves left the juror with the impression that the defendant was guilty of murder and the only real dispute was therefore over punishment. We reject defendant's claim. First, during the voir dire the trial court asked, and each juror responded affirmatively, about his or her ability to follow and apply the law. Second, each juror stated that he or she understood that the defendant was presumed innocent and that the State had the burden of proving defendant's guilt beyond a reasonable doubt. The trial court's refusal to pursue defendant's line of questioning regarding the effect of the death qualification process represents an intelligent and sound exercise of the court's discretion. Since a properly instructed jury can understand that death qualification is based on a hypothetical finding of guilt, and nothing more, we believe that the risk of prejudice to the guilt-innocence phase is minimal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Defendant also alleges that three jurors -- Mr. Truitt, Mr. Bathurst and Mr. Semler -- were excluded without sufficient questioning by the trial court due to their opposition to the death penalty. We disagree. As noted above, this Court has joined the United States Supreme Court in holding that a challenge to a juror can be interposed where his or her views regarding capital punishment \"'would prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.'\" State v. Ramseur, supra, 106 N.J. at 255 (quoting Adams v. Texas, supra, 448 U.S. at 45, 100 S. Ct. at 2526, 65 L. Ed. 2d at 589). Moreover, we concluded that \"[t]his standard does not require that a juror's bias be proven with unmistakable clarity.\" Ramseur, supra, 106 N.J. at 256. The voir dire of all three of these jurors is similar. For example, Mr. Truitt informed the court that he was \"firmly opposed\" to the death penalty and that he would \"automatically reject it.\" Responding to a follow-up question from the trial court, he asserted that \"[u]nder no circumstances\" would he be able to impose a death penalty. The second juror, Mr. Bathurst, told the court, \"I would never vote for the death penalty.\" After the court asked him to explain, Mr. Bathurst replied: \"It's not a religious feeling, but it's just my own that I could never vote for it.\" During a long colloquy that followed, Mr. Bathurst repeatedly reiterated his opposition to the death penalty. Lastly, Mr. Semler stated under oath that he thought a death sentence should never be imposed regardless of the crime committed. On follow-up the court asked: THE COURT: And would you please explain why you couldn't accept it? MR. SEMLER: (Pause) I think it's very basic belief that if killing is wrong, then killing is wrong. And I don't think there should be any exceptions to that. THE COURT: All right. Can you think of any set of circumstances under which you would be able to vote to impose a death penalty? MR. SEMLER: No, sir. Undoubtedly, all three of these jurors expressed strong opposition to the death penalty after repeated questions from the trial court. The trial court's determination to exclude these three jurors for cause was well supported by the record and eminently reasonable under the Adams-Witt standard.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The problem of yes or no answers to either/or questions is pervasive in this case. Other particularly troubling examples are found in the questioning of several other jurors, including Mr. Troyano, Mr. Reppucci, Ms. Szmutko, Mr. Hampton, Mr. Puhalski, Mr. Fiorentino and Mr. Marchetti.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Rule 1:8-3(a) (1988) provides: For the purpose of determining whether a challenge should be interposed, the court shall interrogate the prospective jurors in the box after the required number are drawn without placing them under oath. The parties or their attorneys may supplement the court's interrogation in its discretion. At trials of crimes punishable by death, the examination shall be made of each juror individually, as his name is drawn, and under oath.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Defendant also claims that the trial court's refusal to allow attorney-conducted voir dire in a capital case warrants reversal. We reject defendant's argument. As we held in State v. Biegenwald, supra, 106 N.J. at 29-30, \"the trial court's refusal to permit the voir dire interrogation to be conducted by counsel was within the limits of our decision in State v. Manley, supra, 54 N.J. 259, and of Rule 1:8-3(a) because both the Manley decision and the Rule are applicable to capital cases.\" Nonetheless, we reemphasize -- especially in light of the overall inadequacy of the voir dire in this case -- that trial courts should be especially sensitive to counsel's requests to supplement the court's voir dire examination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Our selection of this standard in Ramseur is dispositive of another of defendant's challenges in this matter. Defendant contends that the court below erred in dismissing for cause juror Dagostino, who vacillated on the question of whether she was capable of imposing the death penalty in any circumstance. Although Ms. Dagostino left open the possibility that she could impose a death sentence in a case that involved her personally, such as one involving the murder of a family member, she made clear that she could not envisage applying capital punishment in this case regardless of the circumstances. There is no question that such an attitude would have substantially impaired her performance had she sat on the jury in this case, and the trial court's dismissal for cause was therefore correct.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In fairness, it should be noted that in conducting the voir dire, the trial court did not have the benefit of either our decision in State v. Ramseur, supra, 106 N.J. at 255-56, or the United States Supreme Court's decision in Wainwright v. Witt, supra, 469 U.S. at 418-26, 105 S. Ct. at 849-53, 83 L. Ed. 2d at 847-53. Prior to those decisions, the recognized test for exclusion of a juror opposed to the death penalty was that set forth in Witherspoon v. Illinois, supra, 391 U.S. at 522 n. 21, 88 S. Ct. at 1777 n. 21, 20 L. Ed. 2d at 785 n. 21 (1968). That test permitted dismissal for cause only of jurors \"who made unmistakably clear . . . that they would automatically vote against the imposition of capital punishment without regard to any evidence that might be developed at the trial,\" or that their death penalty scruples would prevent them from making an impartial decision on the issue of guilt. Ibid. This test was altered in Adams v. Texas, supra, 448 U.S. at 45, 100 S. Ct. at 2526, 65 L. Ed. at 589, but was not decisively rejected until the Witt decision. In refusing to exclude juror Pfeiffer for cause, the trial court appears to have applied the Witherspoon test to the reverse problem of the prospective juror favoring imposition of the death penalty for all murder convictions. Whether the trial court acted properly given the precedent available to it is academic, as today we apply the subsequent holdings retrospectively.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Defendant also contends that because the trial court empaneled sixteen jurors rather than the fourteen typically empaneled in a criminal case, the court should also have increased the number of peremptory challenges allotted the parties. This case stands in contrast to State v. Ramseur, supra, 106 N.J. at 239, in which the trial court, having decided to empanel eighteen jurors, proportionately increased defendant's allotment of peremptories from twenty to twenty-six and the prosecution's allotment from twelve to sixteen. Rule 1:8-2 dictates that a jury in a criminal action consist of twelve persons. There is no requirement that there be a specific number of alternate jurors. \"The court in its discretion may direct the impanelling of a jury of such number as is appropriate under the circumstances. . . .\" R. 1:8-2(d). Rule 1:8-3(d) sets the number of peremptories in the most serious criminal cases at twenty for the defense and twelve for the prosecution; there is no implication that these allotments are keyed to any presumptive number of impaneled jurors. Rule 1:8-3(d) allows the judge \"discretionary authority\" to increase the allotments in capital cases, but does not require any such increase. Against this background, it is difficult to find any basis for the contention that the trial court abused its discretion by failing, at the outset, to award defendant additional peremptory challenges. Therefore, apart from the deficit in peremptories arising from the court's failure to excuse prospective juror Pfeiffer for cause, we conclude that the trial court did not erroneously deprive defendant of peremptory challenges.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. An additional consideration is whether a timely objection has been made by defense counsel, for \"ordinarily a defendant will not be heard to claim prejudice if defense counsel does not interpose a timely and proper objection to the improper remarks.\" State v. Bucanis, supra, 26 N.J. at 57 (citations omitted). As the first line of defense in our criminal justice system, the trial court has the ability to remedy digressions from accepted legal and ethical obligations. The failure to object promptly to questionable comments, although not fatal, may oft-times result in not having the benefit of the trial court's exercise of its remedial powers on the propriety of the statements in issue. This case, however, presents no such problem.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The State contended at oral argument that any error committed by the trial court in failing to excuse Ms. Pfeiffer for cause was harmless because although the defense ultimately expended all twenty of its peremptory challenges and requested additional peremptories, the defense expressed satisfaction with the jury while still holding two challenges in reserve. In this context, the argument is specious. A defendant's expression of satisfaction with the jury is of no legal significance where, as here, the prosecution subsequently alters the makeup of the jury by exercising an additional peremptory challenge, for what then results is a different jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In that case, the issue was posed in the context of a struck jury system, in which the voir dire of the potential juror is completed, challenges for cause are decided by the trial court, and the venireperson is then qualified for jury service in the instant case. All of the preliminarily qualified venirepersons return as a panel and are then subject to peremptory challenges by the defendant and prosecution who have the opportunity to exercise these peremptory challenges in light of the composition of the total qualified jury panel. See State v. Ramseur, supra, 106 N.J. at 239-43.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. A sample of some of the remarks made by the prosecutor buttresses the Court's conclusion, viz: Beverly Mitchell had so much to live for. Bright, beautiful, educated, religious, a member of her church choir. Beverly taught school in the Trenton school system. She taught special education. She was working part-time as a receptionist at the Bellevue Care Center to earn some extra money. You see, Beverly was due to be married in 1983. That very day, December 30, 1982, Beverly and her mother spent the day before Beverly went to work at the Bellevue Care Center, they spent the day looking for an apartment, an apartment that Beverly and her husband-to-be would share when Beverly started her new life. Beverly looked forward to 1983 with such joy, such hope, such promise. But it was not to be. The defendant, James Edward Williams, changed all of that. He changed it brutally, savagely, permanently. In a few moments of unspeakable horror, the defendant destroyed all of Beverly's dreams. In a few moments of unimaginable terror, the defendant destroyed all of Beverly's plans. In those few moments of a living nightmare, the defendant destroyed all of that joy, all that hope, all that promise. In those few moments, he destroyed Beverly Mitchell. She would never live to see her wedding day. [ Ante at 448.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Similarly, in this case, the prosecutor, in her opening remarks to the jury at the guilt phase of the trial, stated that the victim had \"so much to live for,\" and was \"religious, a member of her church choir,\" and that James Williams had \"destroyed all the goodness and humanity that was Beverly Mitchell.\" At the end of the State's case in the guilt phase, the prosecutor stated that she would be \"remiss\" if she did not \"just take up a few more moments and talk about the person who was actually the most important in this case, and that person is Beverly Mitchell,\" and that \"[s]he didn't deserve to die as she did, naked, ravaged, in agony, and calling to Jesus for help. Jesus help me, Jesus help me.\"\u003c/span\u003e\n\n",
    "body_length": 172801,
    "citedas": [
      "550 A.2d 1172",
      "113 N.J. 393"
    ],
    "attorneys": "Matthew Astore, Assistant Deputy Public Defender, and Lois De Julio, First Assistant Deputy Public Defender, argued the cause for appellant (Alfred A. Slocum, Public Defender, attorney). Steven Pasternak, Deputy Attorney General, argued the cause for respondent (W. Cary Edwards, Attorney General of New Jersey, attorney).",
    "category": [
      "36",
      "78"
    ],
    "judges": "For reversal and remand -- Chief Justice Wilentz, and Justices Clifford, Handler, Pollock, O'Hern, Garibaldi and Stein. Opposed -- None. The opinion of the Court was delivered by Wilentz, C.J. Handler, J., filed a separate concurring opinion. Handler, J., concurring.",
    "citation_count": 136
  }
}
