{
  "id": "nYCuPWYBTlTomsSBsYGg",
  "document": {
    "title": "United States v. Torres",
    "full_title": "UNITED STATES OF AMERICA v. VICTOR TORRES, GEORGE TORRES, NELSON FLORES, JESUS SANTIAGO, LOUIS RIVERA, NATALIE VAZQUEZ, FERNANDO PADRON, DENNIS RIVERA, REGINALD VELEZ, PEDRO CRUZ, EFRAIN ARCELAY AND RAYMOND E. COFFIE",
    "jurisdiction": "Second Circuit",
    "date": "1990-04-03T00:00:00.000Z",
    "docket": "Nos. 88-1441, 88-1444 to 88-1450, 88-1455, 88-1460, 88-1475, 88-1476",
    "body": "MAHONEY, Circuit Judge:\n\nAppellants Victor Torres (\"V. Torres\"), George Torres (\"G. Torres\") (collectively the \"Torres brothers\"), Nelson Flores (\"Flores\"), Jesus Santiago (\"Santiago\"), Louis Rivera (\"L. Rivera\"), Natalie Vazquez (\"N. Vazquez\"), Fernando Padron (\"Padron\"), Dennis Rivera (\"D. Rivera\"), Reginald Velez (\"Velez\"), Pedro Cruz (\"Cruz\"), Efrain Arcelay (\"Arcelay\") and Raymond E. Coffie (\"Coffie\") appeal from judgments of conviction for various violations of the federal narcotics, firearm and tax laws entered, after a jury trial, in the United States District Court for the Southern District of New York, John M. Walker, Jr., Judge.\n\nA thirty-two count indictment, S 87 Cr. 593,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e filed on January 21, 1988, charged that the twelve appellants\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e were members of a multimillion dollar, street level heroin organization (the \"Torres Organization\" or the \"Organization\") which functioned primarily in the South Bronx. Count one charged all defendants with conspiring to distribute, and to possess with intent to distribute, more than a kilogram of heroin in violation of 21 U.S.C. § 846 (1988). Counts two through four charged V. Torres, G. Torres and Flores, respectively, with operating a continuing criminal enterprise in violation of 21 U.S.C. § 848(a) and (b) (1988). Counts five through eleven charged various defendants with distributing heroin, or possessing heroin with the intent to distribute it, in violation of 21 U.S.C. § 841(a)(1) (1988) and related provisions. Counts twelve and thirteen charged Flores and D. Rivera with possession of cocaine with intent to distribute it in violation of 21 U.S.C. § 841(a)(1) (1988) and related provisions. Counts fourteen through eighteen charged various defendants with using and carrying a firearm in connection with drug trafficking in violation of 18 U.S.C. § 924(c)(1) (1988). Counts nineteen and twenty charged Flores, and count twenty-one charged L. Rivera, with making apartments controlled by them available for the unlawful manufacture, distribution and storage of heroin in violation of 21 U.S.C. § 856 (1988). Counts twenty-two through twenty-nine charged the Torres brothers with tax: evasion for the years 1983 through 1986 in violation of 26 U.S.C. § 7201 (1982). Counts thirty through thirty-two charged the Torres brothers, Flores and N. Vazquez, respectively, with obtaining specified property constituting and derived from proceeds of drug trafficking, and sought forfeiture of that property pursuant to 21 U.S.C. § 853(a) (1988).\n\nFollowing a jury trial, the appellants were convicted on a variety of counts, all of which (together with the sentences imposed) are summarized in the appendix attached to this opinion. In the course of the litigation, the district court rendered two published opinions; a pretrial opinion, reported at 683 F. Supp. 56 (S.D.N.Y. 1988), which denied motions by the Torres brothers and Flores attacking the charges against them under 21 U.S.C. § 848(b) (1988) and seeking a bill of particulars; and a posttrial opinion, reported at 699 F. Supp. 419 (S.D.N.Y. 1988), denying motions by the Torres brothers and Flores attacking the constitutionality of the sentence of life imprisonment without parole mandated by section 848(b), and motions by these defendants and D. Rivera, Velez and Coffie for acquittal on one or more counts pursuant to Fed.R.Crim.P. 29(a), or, in the case of Flores and Coffie, a new trial pursuant to Fed. R. Crim. P. 33.\n\nThe claims on appeal are fully outlined in the discussion that follows. For the reasons set forth therein, we affirm the judgments of conviction, except that (1) we reverse the conviction of Velez on count fourteen for violation of 18 U.S.C. § 924(c)(1) (1988); and (2) we vacate the convictions of the Torres brothers and Flores on counts two through four for violation of 21 U.S.C. § 848(b) (1988), which mandates a sentence of life without parole, and remand for resentencing on these counts pursuant to 21 U.S.C. § 848(a) (1988).\n\nBackground\n\nThe Torres Organization was a highly organized and extremely profitable heroin operation begun by the Torres brothers early in 1981 in the lower east side of Manhattan. Sometime early in the 1980's, the Torres brothers moved this operation into the south Bronx and began distributing the \"Checkmate\" brand of heroin, signified by the sketch of a chess piece -- at times, the rook; at other times, the knight -- which was stamped on each glassine envelope of heroin sold.\n\nThe Torres Organization purchased bulk quantities of unprocessed heroin, which were taken to a network of processing points, referred to as \"mills,\" where the bulk quantities of heroin were \"cut\" or diluted and then packaged in glassine envelopes for street level distribution. Electronic surveillance revealed, for example, that the Torres organization conducted heroin milling operations at at least two locations in May and June of 1987. One was a vacant apartment in the south Bronx that had been rented by Flores. The other was a cooperative apartment in the same area owned by L. Rivera.\n\nAfter the heroin was packaged in the glassine envelopes, the envelopes were repackaged in groups of ten known as \"bundles.\" These bundles were then picked up by \"runners\" who delivered them to the managers of various street locations, where the sales were conducted. The proceeds of the sales were then returned to the overseers at the mills by the runners.\n\nThese transactions were recorded in ledgers. Each street manager was required to provide Flores daily with a slip of paper noting how much heroin had been received that day, how much had been sold, how much money had been deducted for expenses, and how much cash was being remitted with the slip. Flores would then enter the figures in a ledger, and tape the slip of paper over the part of the ledger page containing the entries for that location.\n\nSome of these ledgers were seized in the course of arrests and searches on June 24, 1987 that effectively terminated the operations of the Torres Organization. One was found at Flores' apartment, another was found at Manuel Vazquez' apartment, and a third was found at 2700 Grand Concourse, an apartment leased by Flores. The three ledgers were primarily in Flores' handwriting, identical in appearance and format, and consecutive to one another with respect to the time periods covered, a four-month period ending with the defendants' arrest on June 24, 1987. The expenses reported on the manager's slips included payroll for \"runners,\" \"pitchers\" and \"lookouts,\" money spent for beepers, guns and bail, and losses arising from arrests, near-arrests (during which heroin was jettisoned) and stickups.\n\nMany of the managers' slips included notes regarding operational matters, in addition to the numerical data. For example, one manager assured Flores in a March 29, 1987 slip: \"Don't worry, I will do much better.\" Velez wrote to Flores on May 29, 1987, stating: \"[Maybe] today we could have done more if we get it faster.\" Elsewhere in the ledgers, there is a note from Velez thanking \"Nelson + Crew\" for showing interest in a \"problem\" Velez was encountering; another explaining: \"Nelson we had a bad day . . . cops all over the place;\" and still another stating: \"Nelson look yesterday we had a bad day. My pitcher got caught. The other pitcher I put got beat up by the cops so today I had nobody to work until 2:30 p.m. so we're sorry for the bad day but we'll get it together.\" Similarly, Velez and other street managers sent Flores messages reminding him that he had authorized the taking of a cab, approved the deduction of a particular amount of pay, and delayed another individual's pay.\n\nThe Torres Organization proved highly profitable, with the lion's share of the proceeds going to the Torres brothers. Eventually, they began investing the drug proceeds in homes, and business properties and ventures, in Puerto Rico, including Tower Lanes Plaza, a shopping mall and bowling alley complex in Bayamon, Puerto Rico which opened in the summer of 1986. At about this time, the Torres Brothers relocated to Puerto Rico and Flores took charge, under their supervision, of the day-to-day operations of the Torres Organization in New York.\n\nOn May 27, 1987, the New York Drug Enforcement Task Force (\"NYDETF\") obtained authorization to place a wiretap on Flores' telephone. The wiretap remained in place for twenty-eight days, during which time more than 2,400 telephone calls were made or attempted. The recorded conversations, many of which were played at trial, provided a detailed picture of the ongoing heroin operation conducted by the Torres Organization.\n\nOn June 24, 1987, teams of NYDETF agents in New York and Puerto Rico converged upon various locations controlled by the Torres Organization and arrested appellants and others. Simultaneous searches recovered large quantities of heroin, drug ledgers and other records, drug paraphernalia used for the packaging of heroin, numerous weapons, bullet proof vests, large sums of cash, jewelry and beepers.\n\nThe indictment and superseding indictment hereinabove described were thereafter returned. Trial commenced on April 25, 1988, and the jury returned guilty verdicts on most of the counts of the superseding indictment on July 6, 1988, as detailed in the appendix to this opinion. A separate trial on the forfeiture counts commenced on July 11, 1988 and concluded the next day, when the jury returned verdicts of forfeiture against the Torres brothers, Flores and Vasquez. Sentences were imposed, and judgments of conviction entered, in September and October, 1988. This appeal followed.\n\nFurther factual matters will be set forth in the discussion of the particular issues to which they relate.\n\nDiscussion\n\nAppellants urge numerous grounds for reversal, and most join in each other's arguments, to the extent generally applicable, pursuant to Fed. R. App. P. 28(i). We consider: (a) claims of insufficiency of the evidence as to the convictions of Vazquez, Velez, D. Rivera and Cruz for using and carrying a firearm in connection with drug trafficking, the convictions for narcotics conspiracy of D. Rivera, Cruz, Padron, Arcelay and Coffie, and the convictions for narcotics possession of D. Rivera and Cruz; (b) the ex post facto challenge of the Torres brothers and Flores to their conviction and mandatory life sentence under 21 U.S.C. § 848(b) (1988); (c) the claim by D. Rivera that his trial should have been severed; (d) Flores' contention that certain wiretap evidence should have been suppressed; (e) Coffie's claim that his motion to view the grand jury minutes was improperly denied and that the indictment should have been dismissed as to him (and perhaps all defendants) because of grand jury irregularities; (f) Cruz' claim that his motion for a bill of particulars was improperly denied; (g) contentions that the trial court improperly (1) admitted evidence that guns seized during the searches had previously been fired, (2) admitted evidence concerning an uncharged homicide, (3) admitted testimony by narcotics experts as to the meaning of narcotics related conversations, and (4) excluded exculpatory evidence offered by Cruz; (h) challenges to the trial court's jury instructions concerning (1) the relationship between subsections (a) and (b) of 21 U.S.C. § 848 (1988), (2) the requirements for a firearm conviction pursuant to 18 U.S.C. § 924(c)(1) (1988), (3) the meaning of reasonable doubt, and (4) the meaning of constructive possession, as well as (5) an attack upon its refusal to charge that a conspirator must have a \"stake in the venture\"; (i) claims of improprieties in the government's rebuttal summation; and, finally, (j) claims that the sentences imposed upon the Torres brothers, Flores and Coffie were excessive.\n\nThe Torres brothers and Flores advance a number of other arguments with respect to their convictions under 21 U.S.C. § 848(b) (1988). They contend that this statute, which mandates life imprisonment without parole for certain drug \"kingpins\" under specified conditions, is unconstitutional both on its face and as applied to them. They also claim that the proof as to section 848(b)(2)(B), which requires that a continuing criminal enterprise have gross receipts of $10,000,000 during some twelve-month period, was insufficient. Flores challenges the sufficiency of the proof that he was ever a principal administrator, organizer or leader of the Torres Organization, as required by section 848(b)(1), or in any event that he occupied such a position for a statutorily adequate period of time. Since, as hereinafter appears, we vacate the convictions of the Torres brothers and Flores under section 848(b) and remand for resentencing under section 848(a), on the ground that the jury was not instructed that these defendants had to function as principal administrators, organizers or leaders of the Torres Organization after section 848(b) became effective in order to be subjected to its penalties, we do not consider herein the other challenges which these appellants press with respect to their convictions under section 848(b).\n\nA. Sufficiency of the Evidence.\n\nBefore considering specific claims as to the sufficiency of the evidence, we review the general standards by which these contentions are to be assessed.\n\nAn appellant challenging the sufficiency of the evidence bears \"'a very heavy burden.'\" United States v. Nusraty, 867 F.2d 759, 762 (2d Cir. 1989) (quoting United States v. Young, 745 F.2d 733, 762 (2d Cir. 1984), cert. denied, 470 U.S. 1084, 105 S. Ct. 1842, 85 L. Ed. 2d 142 (1985) (quoting United States v. Carson, 702 F.2d 351, 361 (2d Cir.), cert. denied, 462 U.S. 1108, 103 S. Ct. 2456, 77 L. Ed. 2d 1335 (1983))); see United States v. Buck, 804 F.2d 239, 242 (2d Cir. 1986); United States v. Grubczak, 793 F.2d 458, 462-63 (2d Cir. 1986). In reviewing such claims, we \"view the evidence in the light most favorable to the government and construe all possible inferences in its favor. . . .\" United States v. Badalamenti, 794 F.2d 821, 828 (2d Cir. 1986) (citing United States v. Martino, 759 F.2d 998, 1002 (2d Cir. 1985)).\n\n\"If 'any rational trier of fact could have found the essential elements of the crime,' the conviction must stand.\" Badalamenti, 794 F.2d at 828 (quoting Jackson v. Virginia, 443 U.S. 307, 319, 61 L. Ed. 2d 560, 99 S. Ct. 2781 (1979) (emphasis in Jackson)). \"The test is 'whether the jury, drawing reasonable inferences from the evidence, may fairly and logically have concluded that the defendant was guilty beyond a reasonable doubt.'\" United States v. Chang An-Lo, 851 F.2d 547, 554 (2d Cir.) (quoting Grubczak, 793 F.2d at 463), cert. denied, 488 U.S. 966, 109 S. Ct. 493, 102 L. Ed. 2d 530 (1988). The government is not required to \"preclude every reasonable hypothesis which is consistent with innocence.\" Chang An-Lo, 851 F.2d at 554 (citing United States v. Fiore, 821 F.2d 127, 128 (2d Cir. 1987)). In sum, \"[a] jury's verdict will be sustained if there is substantial evidence, taking the view most favorable to the government, to support it.\" United States v. Nersesian, 824 F.2d 1294, 1324 (2d Cir. 1987) (citing Glasser v. United States, 315 U.S. 60, 80, 86 L. Ed. 680, 62 S. Ct. 457 (1942)), cert. denied, 484 U.S. 957, 958 (1987), 1061 (1988).\n\nWe now turn to appellants' specific claims of insufficiency.\n\n1. Natalie Vazquez\n\nWhile searching an apartment in the Bronx leased by N. Vazquez and apparently shared with a male occupant, agents found a loaded .357 Magnum hand gun under a queen size mattress. The apartment also contained two bundles of heroin, two bulletproof vests, $209,485 in cash, jewelry appraised at $105,695, a $10,000 gold ingot, drug records, rubber stamps and stamp pads, a heat sealer, and several address books containing the telephone numbers of various other members of the Torres Organization. The apartment was also tied to the Torres Organization through a recorded telephone conversation which indicated that a package of heroin was to be dropped off there.\n\nOn this evidence, N. Vazquez was convicted under 18 U.S.C. § 924(c)(1) (1988), which provides criminal penalties for anyone who \"during and in relation to any . . . drug trafficking crime . . ., uses or carries a firearm. . . .\" On appeal, Vazquez claims that the circumstances linking the .357 Magnum to the narcotics activity were too tenuous to sustain a conviction under section 924(c)(1), especially in light of United States v. Feliz-Cordero, 859 F.2d 250 (2d Cir. 1988), a case in which a section 924(c)(1) conviction was reversed because of insufficiency of the supporting evidence.\n\nSpecifically, N. Vazquez claims that (1) since there was another, male occupant of the apartment, and especially since the firearm had \"a strong recoil and a heavy pull-weight\" rendering it more appropriate for use by a man, \"the inference of possession which normally arises when an apartment is inhabited by one person does not apply;\" (2) the evidence established that two men were required to lift the mattress which concealed the gun, precluding any implication that the weapon was readily available to N. Vazquez; (3) there was no evidence that the apartment functioned as a storage location for narcotics on an ongoing basis; and (4) there was no evidence that N. Vazquez ever carried a weapon, or that weapons were kept in the apartment at any time other than the date of the search. All of these circumstances, N. Vazquez claims, provide an even more favorable basis than in Feliz-Cordero for finding, as a matter of law, that the evidence was insufficient.\n\nWe conclude, on the contrary, that our decisions in United States v. Alvarado, 882 F.2d 645 (2d Cir. 1989), cert. denied, 493 U.S. 1071, 110 S. Ct. 1114, 107 L. Ed. 2d 1021 (1990), and United States v. Meggett, 875 F.2d 24 (2d Cir.), cert. denied, 493 U.S. 858, 110 S. Ct. 166, 107 L. Ed. 2d 123 (1989), call for affirmance of N. Vazquez' conviction under section 924(c)(1). See also United States v. Matra, 841 F.2d 837 (8th Cir. 1988).\n\nIn Meggett, we interpreted Feliz-Cordero as holding:\n\nthat a gun found in a dresser drawer of an apartment in which some of the defendants' narcotics paraphernalia was located had not been \"used\" within the meaning of § 924(c)(1). Implicitly recognizing the teaching of the prior case law to the effect that \"use\" requires possession of a gun under circumstances where the weapon is so placed as to be an integral part of the offense, we emphasized the absence of proof that the defendants in Feliz-Cordero had placed the weapon to have it available for ready use during the transaction.\n\nMeggett, 875 F.2d at 29 (citation omitted).\n\nOur holding in Meggett made clear, after a detailed review of the pertinent precedents, that a defendant can \"use\" a gun in violation of section 924(c)(1) \"without firing, brandishing or displaying it.\" Meggett, 875 F.2d at 29; see, e.g., United States v. Robinson, 857 F.2d 1006, 1010 (5th Cir. 1988). In Meggett, we determined that the jury \"could reasonably conclude that the five loaded firearms in [defendant's] apartment were on hand to protect that apartment as a storage and processing point for large quantities of narcotics and that therefore the presence of weapons furthered or facilitated the narcotics operation and was an integral part thereof.\" 875 F.2d at 29.\n\nOur more recent decision in Alvarado is also pertinent, especially in view of N. Vazquez' contention concerning the inaccessibility of the .357 Magnum stored under the mattress. In a somewhat similar situation, we said in Alvarado that \"[although] it is true that these guns were placed in a locked safe, a reasonable jury could infer that the guns were located there to protect both the money and the cocaine in the event that a drug deal went sour and a buyer demanded a return of his cash.\" 882 F.2d at 654. In Matra, the Eighth Circuit upheld a section 924(c)(1) conviction, finding that a machine gun hidden under a waterbed frame in a locked bedroom was \"an integral part of [the] criminal undertaking\" because it served to protect the cocaine and cash stored in the apartment. 841 F.2d at 842-43.\n\nNo different conclusion is required here. The jury was certainly entitled to conclude, in view of the overall physical evidence seized at the N. Vazquez apartment and the recorded telephone conversation regarding a delivery of heroin there, that the apartment was used for narcotics trafficking on a continuing basis, bolstering the likelihood that the weapon seized was used \"during and in relation to any . . . drug trafficking crime\" within the meaning of section 924(c)(1). Testimony that two men were required to lift the mattress which concealed the gun did not preclude the jury from finding that the gun would be available to a person who knew its location, without any need to lift the mattress. Further, there was explicit testimony that a woman would be able to fire the weapon. In any event, we see no merit in N. Vazquez' novel contention that, in effect, a defendant cannot be convicted under section 924(c)(1) if it is likely that a cohort in a narcotics crime, rather than the defendant, will use a particular firearm to further their joint criminal enterprise. Cf. United States v. Rivera, 844 F.2d 916, 926 (2d Cir. 1988) (not necessary that exercise of dominion and control by others be disproved; only necessary that evidence support jury finding that defendant exercised dominion and control over weapon). In sum, we conclude that the evidence amply supported N. Vazquez' conviction under section 924(c).\n\n2. Reginald Velez.\n\nVelez was also convicted of using a firearm in relation to a narcotics trafficking offense in violation of section 924(c)(1). The evidence to support this charge consisted of a slip itemizing receipts and expenses given by Velez to Flores on or about June 17, 1987, one of many submitted by Velez to Flores over the four-month period covered by the seized ledgers, and a corresponding ledger entry by Flores. The slip showed a $150 expenditure for a shotgun with the added notations: \"Bought a shotgun for our protection,\" and \"we had to buy a gun because there [are] a lot of things [happening] so we want to feel safe.\" Flores entered the deduction in his ledger as follows: \"Shotgun -- 150.\" However, the shotgun was not seized or presented as evidence.\n\nOn appeal, Velez claims that this evidence was insufficient to support his conviction (1) where no shotgun was recovered or seen by any witness, (2) because the conviction was based on his uncorroborated admission, and (3) because there was no evidence that he used the weapon for the stated purpose. We agree with Velez' third contention, that the slip and ledger entry fail to establish that the shotgun was used \"during and in relation to any . . . drug trafficking crime\" within the meaning of section 924(c)(1), and accordingly reverse his conviction on the firearm count without considering his other grounds for reversal.\n\nWe stated in Meggett that statutory use \"requires possession of a gun under circumstances where the weapon is so placed as to be an integral part of the offense,\" 875 F.2d at 29 (construing Feliz-Cordero), noting that the reversal of the firearm conviction in Feliz-Cordero resulted from \"the absence of proof that the defendants . . . had placed the weapon to have it available for ready use during the transaction,\" id., even though the weapon in Feliz-Cordero was found together with drug paraphernalia in a defendant's apartment. Here, by contrast, assuming that Velez did purchase the shotgun as reflected by the slip and ledger entry, and assuming further that he intended to use it as stated -- \"for our protection,\" it nonetheless remained to be proved that it was actually so used. There was no evidence as to where the shotgun was placed, and no evidence that the shotgun was ever in fact utilized to protect the narcotics operation or its proceeds. Under these circumstances, both the statutory language and our precedents require the reversal of Velez' conviction under section 924(c)(1).\n\n3. Dennis Rivera.\n\nD. Rivera was convicted on count one, the narcotics conspiracy count, count thirteen for possession of cocaine with intent to distribute it, and count seventeen for a section 924(c)(1) firearm violation. Although he sought acquittal in a postriaI motion pursuant to Fed.R.Crim.P. 29(c) and renews his request for acquittal here, his appellate arguments are directed solely to the convictions on counts thirteen and seventeen. Specifically, he contends that there was an inadequate nexus between him and items of contraband, a quantity of cocaine and a hand gun, seized by the government on June 24, 1987 at 527 East 147th Street in the Bronx.\n\nWe disagree. The nexus was amply established. At trial, the government showed through a number of taped conversations that D. Rivera conducted a narcotics business from that address, which was the situs of a four-story apartment building. According to the testimony of NYDETF agents, the raid on that date on apartment no. 7 in that building yielded a pistol holster; car rental receipts in the names of Flores and Arcelay; two social security cards bearing D. Rivera's printed name and signature; and a scrap of paper with Flores' telephone number.\n\nA search of apartment no. 6, one floor beneath apartment no. 7, was conducted simultaneously. Three individuals were found there, including D. Rivera. The agents also found boxes of glassine envelopes; beepers; a business card bearing Nelson Flores' beeper number and another telephone number next to the word \"Nlson [sic]\" on the reverse side of the card; and approximately $52,160 worth of jewelry. In the kitchen, agents noticed that a door leading to a dumbwaiter shaft was ajar. There was a ladder inside the shaft that began at apartment no. 6 and descended into the shaft. There was also a string hanging down into the shaft from the doorway in the kitchen of apartment no. 6. On a ledge inside the shaft, one floor below apartment no. 6, an investigating agent found 75.5 grams of 92% pure cocaine and a triple-beam O-haus scale. He also found $5,942 in cash and a loaded .38 caliber revolver attached to the string at the bottom of the shaft. According to the agents, all of the shaft doors that led to the other apartments were either painted shut or otherwise sealed, so that there was access to the shaft only from apartment no. 6.\n\nConsidering the evidence provided by the taped conversations that D. Rivera conducted a narcotics operation at this location; the other items seized during the search; and D. Rivera's apprehension in apartment no. 6 at the time of the search, \"the evidence showed far more than [D. Rivera's] mere proximity to the [contraband] and provided an ample basis for a reasonable juror to find that [he] had constructive possession of the [contraband].\" United States v. Tribunella, 749 F.2d 104, 112 (2d Cir. 1984). \"'It is not necessary that such evidence remove every reasonable hypothesis except that of guilt.'\" Id. (quoting United States v. Craven, 478 F.2d 1329, 1333 (6th Cir.), cert. denied, 414 U.S. 866, 38 L. Ed. 2d 85, 94 S. Ct. 54 (1973)). We find no basis to disturb D. Rivera's conviction on counts thirteen and seventeen.\n\n4. Pedro Cruz.\n\nCruz claims that the evidence was insufficient to convict him on count one for narcotics conspiracy, count seven for possession of heroin with intent to distribute it, and count fifteen for a section 924(c)(1) firearm violation. Since Cruz challenges his conviction under count one for narcotics conspiracy, and all the remaining appellants whose insufficiency claims we must consider contest only their convictions under this count, it is appropriate at this juncture to consider the general principles governing sufficiency of the evidence to sustain conspiracy convictions.\n\nSince \"conspiracy by its very nature is a secretive operation,\" United States v. Provenzano, 615 F.2d 37, 45 (2d Cir.), cert. denied, 446 U.S. 953, 64 L. Ed. 2d 810, 100 S. Ct. 2921 (1980), the \"'[existence] of and participation in a conspiracy . . . may be established . . . through circumstantial evidence.'\" United States v. Soto, 716 F.2d 989, 991 (2d Cir. 1983) (quoting United States v. Sanzo, 673 F.2d 64, 69 (2d Cir.), cert. denied, 459 U.S. 858, 74 L. Ed. 2d 111, 103 S. Ct. 128 (1982)). However, \"knowledge of the existence and goals of a conspiracy does not of itself make one a coconspirator.\" United States v. Cianchetti, 315 F.2d 584, 588 (2d Cir. 1963).\n\nSimilarly, \"[association] with a conspirator, without more, is insufficient to establish the requisite degree of participation in a conspiratorial venture. . . .\" United States v. Steinberg, 525 F.2d 1126, 1134 (2d Cir. 1975), cert. denied, 425 U.S. 971, 48 L. Ed. 2d 794, 96 S. Ct. 2167 (1976); see also United States v. Johnson, 513 F.2d 819, 824 (2d Cir. 1975) (\"[guilt] may not be inferred from mere association with a guilty party\"). Moreover, \"'absent evidence of purposeful behavior, mere presence at the scene of a crime, even when coupled with knowledge that a crime is being committed, is insufficient to establish membership in a conspiracy. . . .'\" United States v. Chang An- L o, 851 F.2d 547, 554 (2d Cir.) (quoting United States v. Martino, 759 F.2d 998, 1002 (2d Cir. 1985)), cert. denied, 109 S. Ct. 493 (1988).\n\nThus, evidence of purposeful behavior designed to further a conspiracy must be shown to prove membership in that conspiracy. See United States v. Torres, 519 F.2d 723, 726 (2d Cir.), cert. denied, 423 U.S. 1019, 96 S. Ct. 457, 46 L. Ed. 2d 392 (1975). However, \"once a conspiracy is shown to exist, the evidence sufficient to link another defendant to it need not be overwhelming.\" United States v. Casamento, 887 F.2d 1141, 1156 (2d Cir. 1989), cert. denied, 493 U.S. 1081, 110 S. Ct. 1138, 107 L. Ed. 2d 1043 (1990).\n\nWe now turn to the specifics of Cruz' insufficiency claim. Cruz was arrested on June 24, 1987 when a team of NYDETF agents gained access to an apartment at 2700 Grand Concourse through the use of a battering ram. Agents then entered one of the back bedrooms of the apartment, where they encountered six individuals, four of whom were emptying a duffel bag filled with glassine envelopes out a window. The duffel bag was then flung from the window and was recovered by a NYDETF agent stationed in the courtyard below. The bag contained approximately 6,150 glassine envelopes of heroin packaged in \"bundles\" of ten and weighing a total of approximately 215 grams. An agent also testified that when he entered the room, Cruz was lunging for a loaded nine millimeter semi-automatic weapon lying on a table in the room, but was intercepted by the agent before he reached the gun.\n\nIn addition to the testimony of the arresting officers, the Government presented other evidence linking Cruz with the Torres Organization, including the testimony of agents who surveilled Cruz coming and going from several locations controlled by the Torres Organization, often with packages in hand. In addition, several accounting slips sent to Flores by Velez made reference to a runner named \"Pete,\" which was Cruz' nickname. Further, the government presented a taped conversation between Cruz and Flores in which they discussed the operation of one of the Torres Organization's sales locations.\n\nDespite this evidence, Cruz disavows any involvement in the conspiracy, and contends that his presence in the apartment on the day of his arrest was simply a chance presence in an \"environment of criminality,\" where he was wearing a matching cabana set and asserts that he had made a brief stop en route to an outing at the beach. Cruz also contends that since he was not seen in physical contact with the heroin jettisoned from the window, he cannot be charged with its possession, and further that the act of lunging for the weapon does not meet the requirement of section 924(c)(1) that \"during and in relation to any crime of . . . drug trafficking . . ., [he] use[] or [carry] a firearm.\"\n\nWe conclude, however, that the evidence was sufficient to convict Cruz on all counts. The government's wiretap evidence, the appearance of Cruz' name on the accounting slips, and his presence in the apartment at the time of the raid provided ample evidence for the jury to conclude that he was part of the charged conspiracy. Cruz' conviction on count seven, for possession of heroin with intent to distribute it, was also supported by the evidence.\n\nThere is no requirement that a defendant be observed in physical contact with narcotics in order to be convicted of its possession. Rather, possession of narcotics may be actual or constructive. See United States v. Aiello, 864 F.2d 257, 263 (2d Cir. 1988); United States v. Tribunella, 749 F.2d 104, 111 (1984). \"'Constructive possession exists when a person . . . knowingly has the power and the intention at a given time to exercise dominion and control over an object, either directly or through others.'\" United States v. Pelusio, 725 F.2d 161, 167 (2d Cir. 1983) (quoting United States v. Craven, 478 F.2d 1329, 1333 (6th Cir.), cert. denied, 414 U.S. 866, 38 L. Ed. 2d 85, 94 S. Ct. 54 (1973)). On the facts presented, it was quite reasonable for the jury to have concluded that the heroin jettisoned from the window of the apartment by Cruz' codefendants was within the constructive possession of Cruz.\n\nFinally, Cruz claims with regard to count fifteen that his thwarted effort to reach the semi-automatic weapon when the NYDETF agents entered the apartment does not constitute the \"use\" of that firearm within the meaning of section 924(c)(1). As discussed above, however, section 924(c)(1) has been applied in numerous situations where firearms were simply kept available in locations where narcotics activities took place. See e.g., United States v. Alvarado, 882 F.2d 645, 654 (2d Cir. 1989), cert. denied, 493 U.S. 1071, 110 S. Ct. 1114, 107 L. Ed. 2d 1021 (1990); United States v. Meggett, 875 F.2d 24, 29 (2d Cir.), cert. denied, 493 U.S. 858, 110 S. Ct. 166, 107 L. Ed. 2d 123 (1989); United States v. Robinson, 857 F.2d 1006, 1010 (5th Cir. 1988); United States v. Matra, 841 F.2d 837, 842 (8th Cir. 1988). A fortiori, Cruz' barely thwarted effort to utilize a firearm so located against the NYDETF agents violates the statute. In view of the evidence, furthermore, that the agents announced their presence before battering down the door to the apartment, and that the agent who entered the room was wearing a bulletproof vest with \"DEA\" written across it and had a gold police shield on a chain around his neck, the jury was surely entitled to conclude that Cruz was attempting to use the firearm knowingly against law enforcement officers.\n\n5. Fernando Padron.\n\nPadron claims that the evidence presented was insufficient to support his conviction under count one for narcotics conspiracy. While conceding his knowledge of the existence and goals of the conspiracy, Padron claims that his membership in the conspiracy was improperly presumed because of his association with his roommate, an individual named \"Jimmy,\" who, Padron contends, was the manager of one of the organization's sales locations.\n\nWe disagree. The government contended that Padron comanaged one of the heroin sales locations with his roommate Jimmy. One of the intercepted conversations played for the jury contained the following exchange between Padron and Flores regarding that location:\n\nFLORES: (UI), uh, why didn't you people send money today?\n\nPADRON: Because we, we were in the, uh . . . because we're (UI) here. He beeped and (UI) to beep . . . waiting to (UI) that you had left already. That's why we didn't send it. We had it upstairs.\n\nFLORES: Okay, uh . . . okay. I'm gonna -- you'll be sent goods tomorrow. But you guys have to -- one thing -- you guys have to send everyday . . . You guys have to improve the spot, and you have to send every day, okay?\n\nPADRON: But if -- look, Nelson, let me give you some details. The spot was improving. We were sending you (UI) day everything that . . . everything (UI). Does (UI) think that we don't pay . . . don't pay? Everything we sent was (UI) . . .\n\nFLORES: And it has to be (UI) everyday. See they are complaining that, that . . .\n\nPADRON: That's why we wanted that a higher amount of material be sent, to make a little -- only one payment for the amount of material because this way we . . . [stutters] . . . (UI)\n\nFLORES: Yeah, but since you didn't send, didn't (UI) . . . they're not -- Anyway, that's fine, forget it. We'll . . . open for you tomorrow.\n\nPADRON: Early?\n\nFLORES: Early. Beep . . . beep me. If they don't bring anything over to you in an hour, beep me. I'll get it for you myself.\n\nPADRON: That's fine.\n\nThere was testimony at trial that Padron acknowledged, at the time of his arrest and after receiving Miranda warnings, his participation in the quoted conversation. Padron was also mentioned by Flores in another conversation with Cruz regarding the closing of the heroin sales location. In that conversation Flores was heard to say \"Did you . . . by any chance tell Jimmy or Fernando that we were closing them down.\" Additionally, the jury was presented with drug ledgers containing notations for \"Nando.\"\n\nBased upon this evidence, the jury was justified in concluding that Padron participated in the conspiracy.\n\n6. Efrain Arcelay.\n\nArcelay also contends that the evidence was insufficient to convict him under count one for narcotics conspiracy. He acknowledges that he was the roommate and a close friend of Flores during the period covered by the investigation, and also admits to having been a cocaine dealer. Arcelay claims, however, that the government failed to establish that he was involved in the heroin conspiracy charged, because he lacked the \"specific intent\" to advance the conspiracy to sell heroin, but rather acted solely as a roommate and friend of Flores.\n\nIn support of this claim, Arcelay refers to conversations intercepted by the government between Arcelay and Flores in which Flores assured Arcelay that Arcelay was not under police surveillance. Arcelay contends that Flores knew or suspected that Flores was then under surveillance, and that Flores' lack of concern over surveillance of Arcelay is consistent with Arcelay's claim that Flores did not consider Arcelay a part of the heroin conspiracy. Arcelay also points out that several of the rolodexes seized by the police which listed many members of the Torres Organization did not include Arcelay's name, giving further credence to his claim that he was not a member of the conspiracy.\n\nOn the other hand, the government contends that Arcelay, who had a full-time job at a local hospital, \"while not a full-time employee of the Torres organization, was nonetheless allied with the Torres organization and could be counted on to assist it when needed.\" At trial, the government established that Arcelay allowed V. Torres to purchase and register a car in Arcelay's name, and that this car was used to transport drug proceeds by the Torres Organization. On another occasion, Arcelay allowed Flores to use his name as a reference when Flores purchased a car and when he opened a safe deposit box. On still another occasion, Arcelay cancelled a lease and returned a key to a landlord for an apartment in Queens used by the Torres Organization. Finally, the government also presented evidence that Arcelay frequently relayed messages for Flores to other members of the Organization, and on one occasion assisted Flores in locating a worker for a special assignment.\n\nIn view of Arcelay's conceded knowledge of the existence, purpose and operations of the conspiracy, the foregoing evidence sufficed to establish \"demonstrated awareness of [the] conspiracy's existence coupled with his active participation.\" United States v. Torres, 519 F.2d 723, 726 (2d Cir.), cert. denied, 423 U.S. 1019, 96 S. Ct. 457, 46 L. Ed. 2d 392 (1975). As the government correctly contends, once this was shown, Arcelay's claim that his participation was motivated by friendship with Flores is irrelevant to the question of Arcelay's criminal liability. See United States v. Bagaric, 706 F.2d 42, 53 (2d Cir.), cert. denied, 464 U.S. 840, 917 (1983).\n\n7. Raymond E. Coffie.\n\nCoffie owned a small construction business in the Bronx. He rented beepers to the Torres Organization over a two-year period, and supplied members of the Organization with false income documents such as a paycheck, earning statements, and wage and tax statements. In addition, on one occasion he supplied and delivered an air conditioning unit to one of the locations where heroin was processed. The ledgers of the Torres Organization reflect more than $200,000 in payments to Coffie. He was a participant in a number of intercepted telephone conversations with Flores, in one of which Coffie made reference to a recent telephone conversation he had had with \"Victor.\"\n\nWhile conceding that \"much evidence was offered by the Government to show that . . . Coffie freely associated with members of the conspiracy and that some actions he took actually aided the conspiracy,\" Coffie claims \"that a careful analysis of the proof against him will demonstrate, amply, that the jury did not have sufficient proof before it to find that he knew of the conspiracy or that he willfully associated himself with it.\" Rather, Coffie contends that the prosecution failed to establish the element of guilty knowledge \"that would otherwise transform his routine business activities, such as renting beepers and selling air-conditioners, from unremarkable commerce into the intentional furtherance of a heroin conspiracy.\"\n\nWe disagree. In United States v. Zambrano, 776 F.2d 1091 (2d Cir. 1985), we said:\n\n[Evidence] that a defendant simply supplies goods, innocent in themselves, to someone who intended to use them illegally is not enough to support a conviction for conspiracy. But, if there is something more, some indication that the defendant knew of and intended to further the illegal venture, that he somehow encouraged the illegal use of the goods or had a stake in such use, sufficient evidence has been presented to enable the jury to conclude the defendant had knowledge of and an intent to join in the conspiracy. . . .\n\nId. at 1095 (emphasis added); cf. United States v. Rush, 666 F.2d 10, 11-12 (2d Cir. 1981) (loaning money for purchase of marijuana \"at an exorbitant and usurious profit . . . through a clandestine method\" sufficient to convict for conspiracy; defendant conceded knowledge of illegal use of loan proceeds); United States v. Piampiano, 271 F.2d 273 (2d Cir. 1959) (vegetable dealer supplying sugar to illegal distillery convicted of conspiracy; knowledge implied from circumstances, including departure from normal business and secretive mode of transacting sugar business).\n\nThere was clearly \"something more\" in this case. The jury could properly infer that in supplying false income documents to members of the Torres Organization, Coffie was aware that they required this assistance because they were not engaged in legitimate activities which would routinely provide them with such documents. More to the point, a number of the taped telephone conversations were more than sufficient to warrant a jury conclusion that Coffie knew the business in which the Torres Organization was engaged. When arranging with Coffie to install an air conditioner at one of the heroin processing locations, for example, Flores told Coffie that the installation would have to take place \"late at night or before they start,\" to which Coffie replied \"no problem.\" On another occasion, Flores and Coffie engaged in an extensive discussion of beeper malfunctions from which the jury was entitled to infer that Coffie knew the use to which the beepers were being put. In sum, as the district court concluded, \"While there may be no 'smoking gun' heroin transaction linking Coffie to the conspiracy, there is a wealth of circumstantial evidence that, when viewed together, supports the jury's conclusion and is sufficient as a matter of law to sustain the conviction.\" United States v. Torres, 699 F. Supp. 419, 426 (S.D.N.Y. 1988).\n\nB. Convictions of the Torres Brothers and Flores under 21 U.S.C. § 848(b).\n\nThe Torres brothers and Flores challenge the application of the application of the \"super kingpin\" statute, 21 U.S.C. § 848(b) (1988),\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e pursuant to which all three were sentenced to life imprisonment without parole. Section 848(a) permits the imposition of a life sentence upon a defendant convicted of its violation. Section 848(b) requires the imposition of a life sentence upon a defendant convicted under Section 848(a) if, in addition, the requirements of subsection (b) are satisfied. Section 848(e) precludes the suspension of, or grant of probation with respect to, any sentence imposed under section 848. As stated at the outset of this Discussion, because we agree with these appellants that the jury should have been instructed that the Torres brothers and Flores had to function as principal administrators, organizers or leaders of the Torres Organization after section 848(b) became effective, and therefore vacate their convictions thereunder and remand for resentencing under section 848(a), we do not consider herein their other challenges to their convictions under section 848(b).\n\nSection 848, as applicable here, see supra note 3, read as follows:\n\nContinuing criminal enterprise\n\n(a) Penalties; forfeitures\n\nAny person who engages in a continuing criminal enterprise shall be sentenced to a term of imprisonment which may not be less than 10 years and which may be up to life imprisonment, to a fine not to exceed the greater of that authorized in accordance with the provisions of title 18, or $2,000,000 if the defendant is an individual or $5,000,000 if the defendant is other than an individual, and to the forfeiture prescribed in section 853 of this title; except that if any person engages in such activity after one or more prior convictions of him under this section have become final, he shall be sentenced to a term of imprisonment which may not be less than 20 years and which may be up to life imprisonment, to a fine not to exceed the greater of twice the amount authorized in accordance with the provisions of title 18, or $4,000,000 if the defendant is an individual or $10,000,000 if the defendant is other than an individual, and to the forfeiture prescribed in section 853 of this title.\n\n(b) Life imprisonment for engaging in continuing criminal enterprise\n\nAny person who engages in a continuing criminal enterprise shall be imprisoned for life and fined in accordance with subsection (a) of this section, if --\n\n(1) such person is the principal administrator, organizer, or leader of the enterprise or is one of several such principal administrators, organizers, or leaders; and\n\n(2)(A) the violation referred to in subsection (d)(1) of this section involved at least 300 times the quantity of a substance described in subsection 841(b)(1)(B) of this title, or\n\n(B) the enterprise, or any other enterprise in which the defendant was the principal or one of several principal administrators, organizers, or leaders, received $10 million dollars in gross receipts during any twelve-month period of its existence for the manufacture, importation, or distribution of a substance described in section 841(b)(1)(B) of this title.\n\n(d)\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e \"Continuing criminal enterprise\" defined\n\nFor purposes of subsection (a) of this section, a person is engaged in a continuing criminal enterprise if --\n\n(1) he violates any provision of this subchapter or subchapter II of this chapter the punishment for which is a felony, and\n\n(2) such violation is a part of a continuing series of violations of this subchapter or subchapter II of this chapter --\n\n(A) which are undertaken by such person in concert with five or more other persons with respect to whom such person occupies a position of organizer, a supervisory position, or any other position of management, and\n\n(B) from which such person obtains substantial income or resources.\n\n(e) Suspension of sentence and probation prohibited\n\nIn the case of any sentence imposed under this section, imposition or execution of such sentence shall not be suspended, probation shall not be granted, and the Act of July 15, 1932 (D.C.Code, secs. 24-203 to 24-207), shall not apply.\n\nSection 848(b) was added by the Anti-Drug Abuse Act of 1986, Pub.L. No. 99-570, § 1253, 100 Stat. 3207, and became effective upon the President's approval of that statute on October 27, 1986.\n\nThe district court originally addressed the \"ex post facto\" questions posed by the October 27, 1986 effective date of section 848(b) in its pretrial opinion, stating:\n\nDefendants claim that their indictment under § 848(b) also violates the Ex Post Facto clause of the Constitution, since the continuing criminal enterprise alleged in the indictment began before October 27, 1986, the effective date of § 848(b). For the reasons stated below, the Court denies this motion.\n\nDefendants in their brief fail to discuss the clear and consistent holdings of many courts that in the case of continuing offenses, such as the operation of a continuing criminal enterprise, the Ex Post Facto clause is not violated by application of a statute to an enterprise that began prior to, but continued after, the effective date of that statute. United States v. Johnson, 537 F.2d 1170, 1175 (4th Cir. 1976); United States v. Ferrara, 458 F.2d 868, 874 (2d Cir.), cert. denied, 408 U.S. 931, 92 S. Ct. 2498, 33 L. Ed. 2d 343 (1972). Since the indictment alleges the continuation of a criminal enterprise beyond the effective date of § 848(b), the Court denies this motion. The Court reserves decision on whether income received by the alleged drug enterprise prior to the effective date of the statute may be used to satisfy the requirements of § 848(b)(2)(B). By necessity, the resolution of this issue must await the government's proof at trial and may be handled with in [sic] an appropriate instruction to the jury.\n\nUnited States v. Torres, 683 F. Supp. 56, 62 (S.D.N.Y. 1988) (footnote omitted).\n\nIn their subsequent request to charge, appellants sought the following instruction:\n\n[Even] if you find that the enterprise grossed $10 million in receipts during a 12-month period and that a defendant was a principal administrator, organizer or leader of that enterprise, this $10 million allegation has not been proven unless you further find that the defendant you are considering was a principal administrator, organizer, or leader of the enterprise during the entire period that it took to gross the $10 million. You may not consider the $10 million allegation proven if you find that the defendant was a \"principal administrator, organizer or leader\" for any period of time less than that which it took to gross $10 million. Thus, if the defendant joined the enterprise as a principal administrator, organizer or leader during the twelve month period at issue, you may not find this allegation proven as to that defendant. Also, if the defendant was associated with the enterprise in some subordinate capacity part of the time that the $10 million dollars was being grossed and then eventually assumed the rank of principal administrator, organizer or leader, you may not find this allegation proven as to that defendant.\n\nIn addition, you are not entitled to take into consideration any monies received by the enterprise prior to October 27, 1986. Rather, you must focus on a single 12 month period beginning after that date. Consequently, if you find that the enterprise only received $10,000,000 throughout the course of its entire existence rather than within a specific 12 month period which began after October 27, 1986, then you must find this element not proven.\n\nEmphasis partially added. Flores' counsel reiterated in the charging conference the position that \"for Mr. Flores to be found guilty under 848(b) he has to have been a principal . . . administrator, organizer or leader for the entire time it took the enterprise to earn the ten million dollars.\"\n\nThe district court rejected this request, and charged:\n\nThe second of these additional allegations is that the enterprise described in Counts Two through Four earned at least $10 million in gross receipts from the sale of heroin during a one-year period of its existence -- specifically, the one year period from June 24, 1986 to June 23, 1987, that immediately preceded the arrest of the defendants on June 24, 1987.\n\nFor this element to be satisfied, the government must have also proven beyond a reasonable doubt that the defendant you are considering was a principal administrator, organizer or leader of that enterprise sometime during the 12-month period that the enterprise received at least $10 million in gross receipts.\n\nEmphasis added.\n\nIn addition, the verdict forms provided to the jury included the following questions with respect to the application of section 848(b) to the Torres brothers and Flores:\n\nIf your verdict on [the count charging the particular defendant with a violation of section 848(a)] is Guilty, answer the following question:\n\n1. Was [the particular defendant] a principal administrator, organizer or leader of the continuing criminal enterprise at some time during the one-year period from June 24, 1986 to June 23, 1987?\n\nIf your answer to Question One is Yes, answer the following question:\n\n2. Did the continuing criminal enterprise earn at least $10 million in gross receipts during the one-year period from June 24, 1986 to June 23, 1987?\n\nEmphasis added.\n\nClearly, both the instruction to the jury and the verdict form answered the question posed in the district court's pretrial opinion by allowing evidence of receipts prior to October 27, 1986 to be included in the ten million dollar calculation of gross receipts under section 848(b)(2)(B). Whatever the merits of this determination, we regard as dispositive the fact that both the instruction and the verdict form allowed the application of section 848(b)(1) to the Torres brothers and Flores if they were principal administrators, organizers or leaders of the Organization \"sometime during the 12-month period [from June 24, 1986 to June 23, 1987],\" in the language of the instruction, or \"at some time during the one-year period from June 24, 1986 to June 23, 1987,\" as the verdict form stated the question.\n\nThe district court correctly stated in its pretrial opinion that \"in the case of continuing offenses, such as the operation of a continuing criminal enterprise, the Ex Post Facto clause is not violated by application of a statute to an enterprise that began prior to, but continued after, the effective date of [section 848(b)].\" United States v. Torres, 683 F. Supp. at 62 (citing United States v. Johnson, 537 F.2d 1170, 1175 (4th Cir. 1976); United States v. Ferrara, 458 F.2d 868, 874 (2d Cir.), cert. denied, 408 U.S. 931, 33 L. Ed. 2d 343, 92 S. Ct. 2498 (1972)). Further, \"[it] is well established that a statute increasing a penalty with respect to a criminal conspiracy which commenced prior to, but was continued beyond the effective date of the statute, is not ex post facto as to that crime.\" United States v. Campanale, 518 F.2d 352, 365 (9th Cir. 1975), cert. denied, 423 U.S. 1050, 96 S. Ct. 777, 46 L. Ed. 2d 638 (1976).\n\nThe problem presented here, however, is that both the pertinent instruction and the verdict form allowed the Torres brothers and Flores to be subjected to the enhanced, mandatory life sentence imposed by section 848(b) if they acted as principal administrators, organizers or leaders of the Organization at any time between June 24, 1986 and June 23, 1987, although section 848(b) did not become effective until October 27, 1986. Accordingly, the instruction and verdict form permitted the application of section 848(b) to these defendants even if they did not engage in the specified conduct at any time after that section's enactment.\n\nThis is impermissible, in our view, because such an application of section 848(b) would \"'make[] more onerous the punishment for crimes committed before its enactment.'\" Miller v. Florida, 482 U.S. 423, 435, 96 L. Ed. 2d 351, 107 S. Ct. 2446 (1987) (quoting Weaver v. Graham, 450 U.S. 24, 36, 67 L. Ed. 2d 17, 101 S. Ct. 960 (1981)). Congress is barred from enacting legislation which imposes such a result by the ex post facto clause of U.S. Const. art. I, § 9, cl. 3, and states are so barred by the ex post facto clause of id. art. I, § 10, cl. 1. Since \"'the principle on which the [ex post facto] clause is based -- the notion that persons have a right to fair warning of that conduct which will gave rise to criminal penalties -- is fundamental to our concept of constitutional liberty,'\" United States v. Brown, 555 F.2d 407, 419 (5th Cir. 1977) (quoting Marks v. United States, 430 U.S. 188, 191, 51 L. Ed. 2d 260, 97 S. Ct. 990 (1977)), cert. denied, 435 U.S. 904 (1978), courts are similarly constrained by the due process clauses of the fifth and fourteenth amendments, id.\n\nThe government does not contest these settled principles. Rather, it contends that (1) appellants failed to object to the challenged instruction (and consistent verdict form), \"stating distinctly the matter to which [they objected] and the grounds of the objection\" as required by Fed.R.Crim.P. 30, with the result that (2) we may reverse only if that instruction constituted plain error, see Fed.R.Crim.P. 52(b), which (3) it did not. The government also maintains that under any conceivable view of the evidence consistent with the jury's verdict, the Torres brothers and Flores functioned as principal administrators, organizers or leaders of the Organization after October 27, 1986, so that any error in the instruction and verdict forms was harmless. We are unpersuaded by these arguments.\n\nIt is true that the Torres brothers and Flores did not request an instruction that they could be found in violation of section 848(b)(1) only if they served the Torres Organization as principal administrators, organizers or leaders after October 27, 1986. Rather, they twice sought an instruction that any such determination had to encompass the entire period during which the Organization grossed the $10,000,000 required to satisfy section 848(b)(2)(B). The district court sensibly responded to this request in the charging conference, observing that \"the ten million dollars in the court's view is a description of the kind of organization rather than a predicate to a particular defendant's punishable conduct.\"\n\nThus, appellants' request, and their related request for an instruction requiring satisfaction of the $10,000,000 requirement exclusively by proof of gross receipts after October 27, 1986, did not seek with the precision that rule 30 requires an instruction that these appellants had to be found to occupy the leadership roles specified by section 848(b)(1) on or after October 27, 1986 in order to be found in violation of section 848(b). This is not exactly the situation to which Fed.R.Crim.P. 30 is, by its explicit terms, directed, since appellants \"[stated] distinctly the matter to which [they] [objected] and the grounds of [their] objection,\" id., but stated a ground different from that which they urge on appeal. As in the case of an inexplicit objection, however, this does not suffice to preserve an objection for appeal, absent plain error (which we shall presently consider). See United States v. Jackson, 569 F.2d 1003, 1010 (7th Cir.), cert. denied, 437 U.S. 907, 98 S. Ct. 3096, 57 L. Ed. 2d 1137 (1978); Marbs v. United States, 250 F.2d 514, 516-17 (8th Cir. 1957), cert. denied, 356 U.S. 919, 78 S. Ct. 703, 2 L. Ed. 2d 715 (1958).\n\nThese requests did, however, bring the general \"ex post facto\" matter before the court. As indicated earlier, the district court had previously devoted a portion of its pretrial opinion to this subject. Further, during the argument of appellants' rule 29 motions at the close of the prosecution's case, counsel for the government stated:\n\n[All] that [the] ex post facto clause requires is that the offender be on notice that if he continues his activity past the effective date of the statute he will subject himself to liability for offense. . . . So long as the earning of money continues past October 27, 1986 it clearly satisfies the ex post facto clause.\n\nEmphasis added.\n\nAs a general rule, failure to make an objection with adequate specificity to satisfy rule 30 may be disregarded under the \"plain error\" provision of rule 52 where failure to reverse would result in \"a miscarriage of justice which denied the defendant a fair trial.\" United States v. Civelli, 883 F.2d 191, 194 (2d Cir.) (citing United States v. Kallash, 785 F.2d 26, 29 (2d Cir. 1986) (citing United States v. Frady, 456 U.S. 152, 163, 71 L. Ed. 2d 816, 102 S. Ct. 1584 (1982))), cert. denied, 110 S. Ct. 409 (1989). In making this assessment, \"we are reminded that errors of constitutional magnitude will be noticed more freely under the plain error rule than less serious errors, and that a closer scrutiny may also be appropriate 'when the failure to preserve the precise grounds for error is mitigated by [an objection] on related grounds.'\" United States v. Brown, 555 F.2d 407, 420 (5th Cir. 1977) (quoting United States v. Meadows, 523 F.2d 365, 368 n. 3 (5th Cir. 1975), cert. denied, 424 U.S. 970, 47 L. Ed. 2d 738, 96 S. Ct. 1469 (1976)) (citations omitted), cert. denied, 435 U.S. 904, 98 S. Ct. 1448, 55 L. Ed. 2d 494 (1978).\n\nAs the Civelli formulation makes clear, however, the plain error doctrine is to be used sparingly. See United States v. Young, 470 U.S. 1, 15, 84 L. Ed. 2d 1, 105 S. Ct. 1038 (1985); Kallash, 785 F.2d at 29; United States v. Wilkinson, 754 F.2d 1427, 1432 (2d Cir.), cert. denied, 472 U.S. 1019, 105 S. Ct. 3482, 87 L. Ed. 2d 617 (1985); United States v. London, 753 F.2d 202, 205 (2d Cir. 1985). Despite the inclination to invoke the doctrine more freely where constitutional error might otherwise pass without correction, furthermore, it is established that an ex post facto challenge to a jury instruction can be waived. See United States v. Calabrese, 825 F.2d 1342, 1346 (9th Cir. 1987); United States v. Todd, 735 F.2d 146, 149-51 (5th Cir. 1984), cert. denied, 469 U.S. 1189, 83 L. Ed. 2d 964, 105 S. Ct. 957 (1985); United States v. Panebianco, 543 F.2d 447, 453-54 (2d Cir. 1976), cert. denied, 429 U.S. 1103 (1977).\n\nWe are left with a very close question, especially in view of the evidentiary posture of this case. As the government strenuously contends, it is quite unlikely that the jury would have found a significant difference in the character of these appellants' relationship to, and leadership of, the Torres Organization before and after October 27, 1986. In this connection, the government points out that section 848(d)(2) requires the commission of a \"continuing series,\" (i.e., three or more, see United States v. Jones, 763 F.2d 518, 525 (2d Cir.), cert. denied, 474 U.S. 981, 106 S. Ct. 386, 88 L. Ed. 2d 339 (1985)) of narcotics violations for a violation of section 848. The government further points out that the jury was instructed that the only offenses which they could consider in this regard were those either specified in the indictment or reflected in \"the wiretap conversations you have heard or the various records that were seized.\" The government then notes that all such violations occurred in 1987, compelling the conclusion that \"the defendants . . . in fact continued to operate past October 26, 1986.\"\n\nThe factual premises of the government's position are generally unassailable,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e and the jury determinations of guilt as to the various counts of the indictment lead inescapably to the conclusion that the Torres brothers and Flores were found guilty of at least three narcotics violations occurring after October 26, 1986. We do not accept, however, the government's position that this disposes of the requirement stated in section 848(b)(1) that these defendants act as principal administrators, organizers or leaders of the Organization after October 26, 1986.\n\nThe definition of a continuing criminal enterprise in section 848(d), which includes the \"continuing series\" requirement to which the government points, provides the basis for a determination under section 848(a) that a defendant has engaged in a continuing criminal enterprise, subjecting a first offender to a ten year minimum mandatory sentence and the possibility of life imprisonment. The requirements of section 848(b) are additional to those specified in section 848(a), and result in mandatory life imprisonment if they are satisfied. The government's position reduces to an equation of the section 848(a) and 848(b) requirements, on the theory that the jury, if properly instructed that section 848(b) must be satisfied by proof as to conduct occurring on or after October 26, 1986, would surely have found for the government. Cf. Brennan v. United States, 867 F.2d 111 (2d Cir.) (RICO conviction upheld, despite invalidation of wire fraud convictions as predicate acts, where convictions as to other predicate acts would rationally have required conviction on RICO count), cert. denied, 490 U.S. 1022, 109 S. Ct. 1750, 104 L. Ed. 2d 187 (1989).\n\nWe cannot accept this position. It is clear that (1) it was the government's burden to prove all the elements of section 848(b) beyond a reasonable doubt; (2) the instruction and verdict form allowed a resolution of this issue against the Torres brothers and Flores whether or not they met the requirements of section 848(b)(1) on or after October 27, 1986; (3) the ex post facto rule requires such conduct on or after October 27, 1986, as a constitutional matter, as a basis for a conviction under section 848(b); and (4) as a result of the resolution of this issue adversely to them, these defendants were subjected to the mandatory life sentence imposed by section 848(b), rather than the ten years to life sentence which would otherwise have been applicable under section 848(a).\n\nUnder these circumstances, whatever the likelihood that a properly instructed jury would have ruled against the Torres brothers and Flores as to their violation of section 848(b)(1) on or after October 26, 1986, it is inappropriate to impose a mandatory life sentence upon them where there was an ex post facto violation in the instruction actually given, and the defendants brought the general ex post facto question to the attention of the district court, although without the precision that Fed.R.Crim.P. 30 requires with respect to the specific contention ultimately advanced on appeal and providing the basis for our decision. We therefore conclude that the conviction of the Torres brothers and Flores under section 848(b) must be vacated, and that they must be resentenced under section 848(a).\n\nC. Severance Motion of Dennis Rivera.\n\nD. Rivera, whose motion for severance was denied at trial, claims error in that denial, invoking Fed.R.Crim.P. 14. Rule 14 provides in pertinent part: \"If it appears that a defendant . . . is prejudiced by a joinder of offenses or of defendants in an indictment . . . or by such joinder for trial together, the court may . . . grant a severance of defendants or provide whatever other relief justice requires.\" In denying the pretrial application by D. Rivera and other defendants for a severance, the district court stated in an unpublished opinion:\n\nFirst, although the moving defendants' involvement in the conspiracy and other crimes charged is not alleged to be on a scale with the involvement charged to some of their co-defendants, the moving defendants are themselves charged with serious crimes, including conspiracy to distribute heroin. Further, although defendants' alleged role in the conspiracy \"may have been smaller or less central than that of certain other coconspirators, [that] does not mandate a separate trial.\" [United States v.] Nersesian, 824 F.2d [1294, 1304 (2d Cir. 1987), cert. denied, 484 U.S. 957, 958 (1987), 1061 (1988)]; United States v. Vega, 458 F.2d 1234, 1236 (2d Cir. 1972), cert. denied, 410 U.S. 982 (1973); United States v. Aloi, 511 F.2d 585, 598 (2d Cir.), cert. denied, 423 U.S. 1015, 46 L. Ed. 2d 386, 96 S. Ct. 447 (1975) (\"differences in degree of guilt and possibly degree of notoriety,\" do not necessitate a severance).\n\nLast, although the moving defendants complain that the strength of the Government's evidence against their co-defendants will work to their own substantial detriment, they have overlooked the fact that the Government is entitled \"to show the entire range of evidence of the conspiracy\" against each defendant. Nersesian, 824 F.2d at 1034.\n\nUnited States v. Torres, No. S 87 Cr. 593 (JMW), slip op. at 3-4 (S.D.N.Y. Mar. 30, 1988).\n\nOn appeal, Rivera repeats the contentions to which the district court responded in the quoted passage, but stresses the evidence of wealth introduced as to certain of his codefendants and the thirty-three day length of the trial in contending that he was improperly prejudiced by the denial of a severance. The decision whether to grant a severance, however, is \"committed to the sound discretion of the trial judge.\" United States v. Casamento, 887 F.2d 1141, 1149 (2d Cir. 1989), cert. denied, 493 U.S. 1081, 110 S. Ct. 1138, 107 L. Ed. 2d 1043 (1990); see also United States v. Chang An- L o, 851 F.2d 547, 556 (2d Cir.), cert. denied, 488 U.S. 966, 109 S. Ct. 493, 102 L. Ed. 2d 530 (1988); United States v. Nersesian, 824 F.2d 1294, 1303 (2d Cir. 1987), cert. denied, 484 U.S. 957, 958 (1987), 1061 (1988). \"[A] denial of such a motion will be reversed only upon a showing of clear abuse of that discretion.\" Chang An-Lo, 851 F.2d at 556; see also Casamento, 887 F.2d at 1149; Nersesian, 824 F.2d at 1303. A defendant seeking to overturn a denial of a severance motion, furthermore, must show that he was so severely prejudiced by the joinder as to have been denied a fair trial, \"not that he might have had a better chance for acquittal at a separate trial.\" United States v. Burke, 700 F.2d 70, 83 (2d Cir.) (quoting United States v. Rucker, 586 F.2d 899, 902 (2d Cir. 1978)), cert. denied, 464 U.S. 816 (1983).\n\nIn this case, there has been no such showing. As the district court stated, much of the evidence admitted at trial would have been admissible against D. Rivera even in a separate trial. In any event, \"'differing levels of culpability and proof are inevitable in any multi-defendant trial and, standing alone, are insufficient grounds for separate trials.'\" Chang An-Lo, 851 F.2d at 557 (quoting United States v. Carson, 702 F.2d 351, 366-67 (2d Cir.), cert. denied, 462 U.S. 1108, 103 S. Ct. 2456, 77 L. Ed. 2d 1335 (1983)). Further, the jury acquitted on a number of counts, thus indicating its ability to consider the various defendants and counts separately, as the district court carefully instructed it to do. We conclude that D. Rivera has failed to establish error in the district court's denial of his motion for a severance.\n\nD. Wiretap Evidence.\n\nFlores contends that the district court improperly denied his motion to suppress the fruits of the government's court-authorized wiretap of his home telephone, alleging a failure to comply with 18 U.S.C. §§ 2518(1)(c) and 2518(3)(c) (1988) with respect thereto. Section 2518(1)(c) requires that an application for such an interception shall include \"a full and complete statement as to whether or not other investigative procedures have been tried and failed or why they reasonably appear to be unlikely to succeed if tried or to be too dangerous. . . .\" Similarly, section 2518(3)(c) requires the judge to whom an application for a wiretap is made to determine, as a condition of authorizing the tap, that \"normal investigative procedures have been tried and have failed or reasonably appear to be unlikely to succeed if tried or to be too dangerous. . . .\"\n\nThe application for the wiretap in this case was based upon a thirty-six page affidavit by DEA agent Timothy J. Sullivan dated May 27, 1987. Flores contends that when the application for a wiretap was made, traditional law enforcement methods had already achieved \"extraordinary success . . . in penetrating the deepest reaches of the Torres Organization,\" and that the \"affidavit utterly failed to establish, even on a superficial level, that less intrusive techniques had not been successful and could not be successful.\" In advancing this position, Flores points out that our decision in United States v. Lilla, 699 F.2d 99 (2d Cir. 1983), precludes the authorization of wiretaps based upon \"generalized and conclusory statements that other investigative procedures would prove unsuccessful,\" id. at 104. Flores also argues that it does not suffice to show that a case belongs to some general class of cases which require wiretap investigation, citing United States v. Kalustian, 529 F.2d 585, 589 (9th Cir. 1975) (gambling case).\n\nWe are unpersuaded, and conclude that the application in this case provided a sufficient basis for authorizing the Flores wiretap. Section 2518 \"is simply designed to assure that wiretapping is not resorted to in situations where traditional investigative techniques would suffice to expose the crime.\" United States v. Kahn, 415 U.S. 143, 153 n. 12, 39 L. Ed. 2d 225, 94 S. Ct. 977 (1974). As we have stated:\n\n\"[The] purpose of the statutory requirements is not to preclude resort to electronic surveillance until after all other possible means of investigation have been exhausted by investigative agents; rather, they only require that the agents inform the authorizing judicial officer of the nature and progress of the investigation and of the difficulties inherent in the use of normal law enforcement methods.\"\n\nUnited States v. Vazquez, 605 F.2d 1269, 1282 (2d Cir. 1979) (quoting United States v. Hinton, 543 F.2d 1002, 1011 (2d Cir.), cert. denied, 429 U.S. 980, 97 S. Ct. 493, 50 L. Ed. 2d 589 (1976)), cert. denied, 444 U.S. 981 (1979), 1019 (1980); see also United States v. Fury, 554 F.2d 522, 530 (2d Cir.), cert. denied, 433 U.S. 910, 97 S. Ct. 2978, 53 L. Ed. 2d 1095 (1977).\n\nThe role of an appeals court in reviewing the issuance of a wiretap order, furthermore, \"is not to make a de novo determination of sufficiency as if it were a district judge, but to decide if the facts set forth in the application were minimally adequate to support the determination that was made.\" United States v. Scibelli, 549 F.2d 222, 226 (1st Cir.) (collecting cases), cert. denied, 431 U.S. 960, 53 L. Ed. 2d 278, 97 S. Ct. 2687 (1977). And, as the Scibelli court went on to say:\n\n[In] determining the sufficiency of the application a reviewing court must test it in a practical and commonsense manner. The legislative history makes clear that section 2518(1)(c) is not designed to force the Government to have exhausted all \"other investigative procedures\".\n\n\"The judgment [of the district judge] would involve a consideration of all the facts and circumstances. Normal investigative procedure would include, for example, standard visual or aural surveillance techniques by law enforcement officers, general questioning or interrogation under an immunity grant, use of regular search warrants, and the infiltration of conspiratorial groups by undercover agents or informants. Merely because a normal investigative technique is theoretically possible, it does not follow that it is likely. What the provision envisions is that the showing be tested in a practical and commonsense fashion.\"\n\nS.Rep. No. 1097, 90th Cong., 2d Sess., 1968 U.S.Code Cong. \u0026 Admin.News, p. 2190 (citations omitted).\n\nScibelli, 549 F.2d at 226.\n\nThe affidavit submitted by the government in support of its wiretap application herein described the investigation of the Torres Organization over a fourteen-month period, explaining in detail the traditional investigative techniques employed, including the use of two confidential informants, physical surveillance, record checks and pen registers. The affidavit asserted that these methods only provided a limited picture of the Organization, given the minor role that the two informants played therein and the overall scale of the operation. Moreover, the affidavit provided sound reasons for declining the use of a grand jury or search warrants at that juncture of the investigation.\n\nIn short, unlike the \"bare conclusions\" set forth in the affidavits in Lilla and Kalustian, see United States v. Ruggiero, 726 F.2d 913, 924 (2d Cir.), cert. denied, 469 U.S. 831, 105 S. Ct. 118, 83 L. Ed. 2d 60 (1984), the affidavits here convincingly established that the Torres Organization was a large scale operation which could not be adequately surveilled by traditional investigative methods. In addition, the relocation of the Torres Brothers to Puerto Rico and their direction of the conspiracy's operations from that location evidenced a conspiracy completely distinct in scale from the operation encountered in Lilla. The pen registers alone so indicated. In similar situations, \"the apprehension of so-called 'satellites' involved in the distribution scheme and the determination of the dimensions of an extensive drug conspiracy have been held to justify the use of electronic surveillance.\" United States v. Johnson, 645 F.2d 865, 867 (10th Cir.), cert. denied, 454 U.S. 866, 102 S. Ct. 329, 70 L. Ed. 2d 168 (1981).\n\nWe conclude that the Flores wiretap was authorized in accordance with the pertinent statutory requirements.\n\nE. Alleged Grand Jury Irregularities.\n\nOn the day trial began, Coffie moved that the district court inspect the grand jury minutes, with a view to dismissal of the indictment against Coffie, because the superseding indictment had been redacted to remove (1) a reference to Coffie as a distributor of heroin, and (2) another reference to an intercepted telephone conversation between Flores and Coffie. Initially, the government erroneously concluded that Flores and Coffie had discussed \"pasteles,\" a code word used by the Torres Organization to refer to heroin, in the intercepted conversation, thus providing a basis to deem Coffie a heroin distributor; the government subsequently determined that the discussion concerned \"papeles,\" the Spanish word for \"papers.\"\n\nSubsequently, after more than three weeks of trial, counsel for the Torres brothers objected that no grand jury minutes had been provided to defense counsel for cross-examination of the numerous prosecution witnesses that had by then testified, leading to the implication these witnesses had not testified before the grand jury and that the indictment was thus based, impermissibly in counsel's view, soley upon hearsay testimony.\n\nCoffie reiterates these contentions on appeal, asserting that \"it was error to deny Coffie's timely motion to inspect the Grand Jury minutes and dismiss the indictment,\" and that in view of the prima facie showing that a violation of all defendants' due process rights occurred because the superseding indictment was based upon hearsay, \"it was incumbent upon the District Court to inspect the Grand Jury minutes to determine the extent to which any such violations occurred.\"\n\nWe disagree. Grand jury proceedings carry a \"'presumption of regularity.'\" Hamling v. United States, 418 U.S. 87, 139 n. 23, 41 L. Ed. 2d 590, 94 S. Ct. 2887 (1974) (quoting United States v. Hamling, 481 F.2d 307, 313 (9th Cir. 1973), aff'd, 418 U.S. 87, 41 L. Ed. 2d 590, 94 S. Ct. 2887 (1974)); see also United States v. Calandra, 414 U.S. 338, 345, 38 L. Ed. 2d 561, 94 S. Ct. 613 (1974); Costello v. United States, 350 U.S. 359, 363, 100 L. Ed. 397, 76 S. Ct. 406 (1956); United States v. Ciambrone, 601 F.2d 616, 623 (2d Cir. 1979) (quoting Costello, 350 U.S. at 363). A review of grand jury minutes is rarely permitted without specific factual allegations of government misconduct. See United States v. Wilson, 565 F. Supp. 1416, 1436-37 (S.D.N.Y. 1983). Furthermore, \"as a general matter, a district court may not dismiss an indictment for errors in grand jury proceedings unless such errors prejudiced the defendants.\" Bank of Nova Scotia v. United States, 487 U.S. 250, 254, 101 L. Ed. 2d 228, 108 S. Ct. 2369 (1988).\n\nCoffie contends, nonetheless, that redacting the indictment did not suffice, and that although there is no evidence of bad faith, the government was required to re-present the case to the grand jury prior to trial. Coffie relies principally upon United States v. Basurto, 497 F.2d 781 (9th Cir. 1974), where the court held \"that the Due Process Clause of the Fifth Amendment is violated when a defendant has to stand trial on an indictment which the government knows is based partially on perjured testimony, when the perjured testimony is material, and when jeopardy has not attached.\" Id. at 785. He asks that we apply the same reasoning here.\n\nWe decline to do so on this record. Given the absence of any claims of prosecutorial misconduct or perjury with respect to the grand jury proceedings, there is simply no basis to consider applying Basurto here. This is especially the case since we have concluded hereinabove that there was adequate evidence (obviously aside from the material redacted from the superseding indictment) to convict Coffie, and therefore certainly to indict him. Cf. United States v. Mechanik, 475 U.S. 66, 70, 89 L. Ed. 2d 50, 106 S. Ct. 938 (1986) (where no pretrial objection to indictment, guilty verdict by petit jury means \"any error in the . . . charging decision was harmless beyond a reasonable doubt\").\n\nWe also reject Coffie's claim that the constitutional rights of all defendants were violated because the superseding indictment was based exclusively on hearsay evidence. As we said in United States v. Dyman, 739 F.2d 762 (2d Cir. 1984), cert. denied, 469 U.S. 1193, 105 S. Ct. 969, 83 L. Ed. 2d 973 (1985):\n\nThe use of hearsay testimony before a grand jury raises questions about the validity of an indictment only when the prosecutor misleads the grand jury into thinking it is getting first-hand testimony when it really is receiving hearsay, United States v. Estepa, 471 F.2d 1132, 1137 (2d Cir. 1972), or where there is a high probability that if eyewitness rather than hearsay testimony had been used, the defendant would not have been indicted. United States v. Leibowitz, 420 F.2d 39, 42 (2d Cir. 1969). Neither condition is met here.\n\nId. at 767.\n\nWe have not been presented even with a contention that either condition was met here, or with any showing of the prejudice required by Bank of Nova Scotia, 487 U.S. at 254. Accordingly, Coffie's attack upon the grand jury proceedings provides no basis to disturb any of the convictions on appeal.\n\nF. Bill of Particulars\n\nCruz complains that his motion for a bill of particulars was improperly denied by the district court, necessitating a new trial as to Cruz. The particulars sought by Cruz were:\n\nwhen Pedro Cruz is alleged to have joined the conspiracy charged in Count 1; the identity of those other persons \"known and unknown\" as alleged in paragraph 1 in Count 1 of the indictment; the precise dates and locations that Pedro Cruz is alleged to have \"assisted in the transportation and safe-guarding of heroin, heroin proceeds, and materials for the processing and packaging of heroin\" as alleged in paragraph 3(b)(viii) on page 4 of Count 1 of the indictment; and the precise time of day that Pedro Cruz is alleged to have arrived at apartment 409 of 2700 Grand Concourse.\n\nIn denying the motions for bills of particulars by Cruz and other defendants,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e the district court characterized these efforts as \"ill-disguised attempts at general pre-trial discovery,\" United States v. Torres, No. S. 87 Cr. 593 (JMW), slip op. at 27, adding: \"The indictment adequately advises defendants of the specific acts of which they are accused. Moreover, the defendants have been provided with a wealth of evidentiary detail from the discovery to date, including electronic intercepts, search evidence and exhaustive supporting affidavits.\" Id. at 28.\n\nWe agree. \"The function of a bill of particulars is to provide defendant with information about the details of the charge against him if this is necessary to the preparation of his defense, and to avoid prejudicial surprise at the trial.\" 1 C. Wright, Federal Practice and Procedure § 129, at 434-35 (2d ed. 1982); see also United States v. Bortnovsky, 820 F.2d 572, 574 (2d Cir. 1987). \"A bill of particulars should be required only where the charges of the indictment are so general that they do not advise the defendant of the specific acts of which he is accused.\" United States v. Feola, 651 F. Supp. 1068, 1132 (S.D.N.Y. 1987), aff'd, 875 F.2d 857 (2d Cir.) (mem.), cert. denied, 493 U.S. 834, 110 S. Ct. 110, 107 L. Ed. 2d 72 (1989); see also United States v. Leonelli, 428 F. Supp. 880, 882 (S.D.N.Y. 1977). \"Whether to grant a bill of particulars rests within the sound discretion of the district court.\" United States v. Panza, 750 F.2d 1141, 1148 (2d Cir. 1984) (citing United States v. Burgin, 621 F.2d 1352, 1358-59 (5th Cir.), cert. denied, 449 U.S. 1015, 66 L. Ed. 2d 474, 101 S. Ct. 574 (1980)); see also Bortnovsky, 820 F.2d at 574. \"Acquisition of evidentiary detail is not the function of the bill of particulars.\" Hemphill v. United States, 392 F.2d 45, 49 (8th Cir.), cert. denied, 393 U.S. 877, 21 L. Ed. 2d 149, 89 S. Ct. 176 (1968). \"So long as the defendant was adequately informed of the charges against him and was not unfairly surprised at trial as a consequence of the denial of the bill of particulars, the trial court has not abused its discretion.\" United States v. Maull, 806 F.2d 1340, 1345-46 (8th Cir. 1986), cert. denied, 480 U.S. 907, 94 L. Ed. 2d 522, 107 S. Ct. 1352 (1987).\n\nIn view of the foregoing, .it is clear that the district court acted well within its discretion in denying Cruz' motion for a bill of particulars.\n\nG. Evidentiary Rulings.\n\nFlores, L. Rivera, Cruz and Coffie challenge various evidentiary rulings made by the district court. Before turning to the specific claims, we recognize \"the long held view of this Circuit that the trial judge is in the best position to weigh competing interests in deciding whether or not to admit certain evidence.\" United States v. Moon, 718 F.2d 1210, 1232 (2d Cir. 1983) (citing United States v. Birney, 686 F.2d 102, 106 (2d Cir. 1982)), cert. denied, 466 U.S. 971 (1984). \"Absent an abuse of discretion, the decision of the trial judge to admit or reject evidence will not be overturned by an appellate court.\" Moon, 718 F.2d at 1232.\n\n1. Evidence That Guns Seized Had Previously Been Fired.\n\nL. Rivera claims that reversible error was committed when the district court admitted the testimony of a ballistics expert who testified that some of the guns seized from various defendants had previously been discharged. The government did not charge L. Rivera with possession of a weapon, nor were any weapons seized at L. Rivera's apartment. Rather, the broader focus of L. Rivera's claim is that \"evidence that some guns seized . . . by federal agents had been previously fired had no relevance to the trial . . ., [and] that this evidence served only to inflame and frighten the jury, constituting reversible error.\"\n\nWe disagree. \"'Relevant evidence' means evidence having any tendency to make the existence of any fact that is of consequence to the determination of the action more probable or less probable than it would be without the evidence.\" Fed.R.Evid. 401. \"[Determinations] of relevance are entrusted to the sound discretion of the trial judge, and his decision will not be overturned unless he has acted arbitrarily or irrationally.\" United States v. Cruz, 797 F.2d 90, 95 (2d Cir. 1986) (citing O'Rourke v. Eastern Air Lines, Inc., 730 F.2d 842, 854 (2d Cir. 1984)). Furthermore, \"[experience] on the trial and appellate benches has taught that substantial dealers in narcotics keep firearms on their premises as tools of the trade. . . .\" United States v. Wiener, 534 F.2d 15, 18 (2d Cir.), cert. denied, 429 U.S. 820, 50 L. Ed. 2d 80, 97 S. Ct. 66 (1976). In addition, we have ruled that evidence of possession of ammunition, as well as weapons, may be introduced as proof of a narcotics conspiracy. United States v. Terry, 702 F.2d 299, 318 (2d Cir.), cert. denied, 461 U.S. 931, 103 S. Ct. 2095, 77 L. Ed. 2d 304 (1983).\n\nAgainst this background, the government contends that the testimony of the ballistics expert pertaining to the prior discharge of some of the seized guns was entered to support the proposition that \"the [guns] in question [were] possessed as part of a narcotics conspiracy rather than for some innocent reason, such as as a collector's item.\" This evidence was especially pertinent here in view of the charges against six defendants for violation of 18 U.S.C. § 924(c)(1) for using or carrying a firearm \"during and in relation to any crime of . . . drug trafficking.\" Further, the trial judge gave a limiting instruction that \"there is no allegation in this indictment or in this case that any firearm was actually discharged in furtherance of the conspiracy, . . . [so] the question of prior discharge is only relevant for your consideration as to whether a person who may have possessed that weapon or carried or used that weapon acted in that manner with knowledge and intent.\"\n\nWe are aware, of course, that \"[although] relevant, evidence may be excluded if its probative value is substantially outweighed by the danger of unfair prejudice. . . .\" Fed.R.Evid. 403. Again, however, \"[in] the balancing of probative value against unfair prejudice required by Rule 403, the trial judge has wide discretion . . . and the ruling that he makes will not be disturbed unless such discretion has been clearly abused.\" United States v. Dwyer, 539 F.2d 924, 927 (2d Cir. 1976) (citations omitted). No such abuse appears here.\n\n2. Evidence Concerning an Uncharged Homicide.\n\nFlores claims that the district court committed reversible error by improperly admitting into evidence taped conversations in which Flores discussed a drug-related murder that occurred in the neighborhood of Flores' apartment. Flores also contends that the prejudice was compounded when the prosecution referred to the taped conversations in its cross-examination of Raymond Rivera, a defense witness called by D. Rivera, and in its rebuttal summation.\n\nWe find no merit in these contentions. Fourteen of the taped conversations offered by the government as evidence concern discussions Flores had with Santiago, Arcelay, L. Rivera, Manuel Vazquez (an indicted defendant who pleaded guilty, see supra note 2), Raymond Rivera, a person named \"Mario,\" and one or more additional unidentified males concerning the homicide in question. The conversations reveal that the killing occurred in the course of a narcotics transaction, that the incident involved, in Flores' view, both \"employees\" and \"friends\" of his, and that Flores intended to arrange bail for one \"Carlos\" who was ultimately arrested and charged with the homicide. The district court specifically instructed the jury that no defendant was charged with the homicide, stating:\n\nThere is no allegation in this case that any defendant on trial here or any other defendant involved that you may find to be associated with any of these defendants in this case was involved in this incident, but it is necessary to present this incident in order to give factual background that may have some relevance to a determination that you make. . . .\n\nSo there is no allegation of homicide in this case against any of these defendants.\n\nThe evidence was relevant as background information concerning the Torres Organization and the narcotics conspiracy, and especially concerning Flores' role in both, and the court's limiting instruction was a sufficient safeguard against impermissible prejudice. See United States v. Moon, 718 F.2d 1210, 1232 (2d Cir. 1983), cert. denied, 466 U.S. 971, 80 L. Ed. 2d 818, 104 S. Ct. 2344 (1984). Furthermore, the defense never made an application to exclude or redact the tapes before trial, even though they were given two months notice that the government intended to use the tapes at trial. The only objection arose when the officer who investigated the shooting was called as a witness, at which juncture the defense requested a stipulation that the sales location was inaccessible during the murder investigation, in lieu of admitting the officer's testimony. The district court responded that the numerous tapes which discussed the homicide were already in evidence, rendering the proposed stipulation pointless.\n\nNor was the use of this evidence during the government's cross-examination of Raymond Rivera impermissible. Rivera had maintained on direct examination that he knew Flores only casually, and the government properly inquired concerning the implication of a more intimate relationship arising from their taped conversation concerning the homicide. Especially since \"the scope and extent of cross-examination are generally within the sound discretion of the trial court,\" United States v. Pedroza, 750 F.2d 187, 195 (2d Cir. 1984), cert. denied, 479 U.S. 842, 107 S. Ct. 151, 93 L. Ed. 2d 92 (1986), we see no reversible error here.\n\nFinally, the government's rebuttal summation properly referred to these conversations to rebut Flores' contention, in summation, that Flores was subservient to one \"Mario,\" a nondefendant with whom Flores discussed the homicide in one of the taped conversations. Flores was attempting to establish that Flores answered to Mario within the Torres Organization and the narcotics conspiracy. In view of the section 848 charges against Flores, the government was clearly entitled to respond.\n\n3. Expert Testimony.\n\nCoffie contends that the district court committed reversible error in allowing certain testimony provided by a government expert witness, Sergeant Edward J. Monks of the New York City Police Department. Sergeant Monks had been engaged for sixteen years in carrying out and supervising narcotics related investigations, and gave testimony concerning the meaning of certain of the recorded telephone conversations in evidence. See United States v. Diaz, 878 F.2d 608, 616-17 (2d Cir.) (operations of narcotics dealers a proper subject for expert testimony under Fed.R.Evid. 702) (quoting United States v. Nersesian, 824 F.2d 1294, 1308 (2d Cir.), cert. denied, 484 U.S. 957, 958 (1987), 1061 (1988)), cert. denied, 110 S. Ct. 543 (1989).\n\nThe only testimony provided on Monks' direct examination concerning Coffie related to a taped conversation between Flores and Coffie on June 7, 1987 which included the following discussion of a planned trip by Flores to Puerto Rico to meet with the Torres brothers:\n\nFLORES: Uh, I want to give you that today because I'm leaving today.\n\nCOFFIE: Oh, yeah? Where are you going?\n\nFLORES: Over there.\n\nCOFFIE: Are you going home? Oh, there? For how long, for a few days?\n\nFLORES: Until tomorrow.\n\nCOFFIE: Oh, yeah?\n\nFLORES: Yeah. They don't let me stay (UI).\n\n[Laughter]\n\nFLORES: Everytime I'm trying to get a suntan they go, no-no, you better get back, you better get back.\n\nCOFFIE: [Laughs]. (UI). When do you wanna see me?\n\nMonks was asked on his direct examination \"[w]hat significance, if any, did you attach to this call in relation to the previous calls?\" The following testimony and colloquy ensued:\n\nA. He's telling Coffie that he is going to Puerto Rico. He says he's going over there. Coffie seems to know exactly where he's going without him stating that he's going to Puerto Rico or who he is going to see. It's just an indication that Coffie is part of whatever is happening, or knows what's happened to that.\n\nMR. SERCARZ: Objection.\n\nTHE COURT: I'll strike just the last portion of that sentence.\n\nAt the conclusion of Sergeant Monks' direct testimony, Coffie's counsel moved for a mistrial, as follows:\n\nMR. LESSER: Most respectfully on behalf of Ray Coffie, I'm moving for a mistrial based on the fact that Detective Monks testified and was qualified as an expert on the interpretation of narcotics conversations.\n\nHis testimony regarding not an ultimate conclusion but the ultimate conclusion in this case that Ray Coffie was involved, I think is so severely prejudicial even though the court admonished the jury that it is stricken, I believe that it warrants a mistrial.\n\nTHE COURT: That motion is denied.\n\nCoffie contends on appeal that \"[while] the Court indicated that it would strike the last portion of [the uttered] sentence . . ., it was never made clear what 'portion' the Court referred to.\" No request for clarification was made at trial, however, and as the immediately preceding quotation makes clear, Coffie's counsel, in arguing for a mistrial, conceded that the court had stricken \"the ultimate conclusion in this case that Ray Coffie was involved.\"\n\nA trial court may admit expert testimony if it finds that such testimony \"will assist the trier of fact to understand the evidence or to determine a fact in issue.\" Fed.R.Evid. 702. \"It is well settled that the decision whether to admit expert testimony under Fed.R.Evid. 702 is vested in the broad discretion of the trial court, and that decision will be sustained unless manifestly erroneous.\" Nersesian, 824 F.2d at 1308 (citing United States v. Cruz, 797 F.2d 90, 96 (2d Cir. 1986)). Courts have consistently recognized, moreover, that \"the operations of narcotics dealers are a proper subject for expert testimony under Fed.R.Evid. 702.\" Id. (citing Cruz, 797 F.2d at 96); see also Diaz, 878 F.2d at 617 (quoting Nersesian); United States v. Carmona, 858 F.2d 66, 69 (2d Cir. 1988); United States v. Kusek, 844 F.2d 942, 949 (2d Cir.), cert. denied, 488 U.S. 860, 109 S. Ct. 157, 102 L. Ed. 2d 128 (1988); United States v. Khan, 787 F.2d 28, 34 (2d Cir. 1986).\n\nTested against these standards, we see no error in the court's handling of Monks' testimony concerning Coffie, much less reversible error. It was probably a commendable abundance of caution to strike that portion of the testimony which referred to Coffie's knowledge of and involvement with the heroin conspiracy, since we have permitted conclusory testimony of this nature in the past. See United States v. Scop, 846 F.2d 135, 141-42 (2d Cir.) (reviewing pertinent Second Circuit precedents), rev'd in part on rehearing, 856 F.2d 5 (2d Cir. 1988). In any event, the court's immediate curative instruction concerning Monks' brief testimony about Coffie cured any problem that testimony might otherwise have presented, especially in the absence of any request by counsel for clarification or amplification of that instruction, and counsel's subsequent concession on the record that the court's instruction struck the offending testimony. See United States v. Kiszewski, 877 F.2d 210, 217 (2d Cir. 1989); United States v. Wiley, 846 F.2d 150, 158 (2d Cir. 1988).\n\nCoffie also complains that Monks was improperly allowed to testify to conversations about Flores making a flight reservation for his trip to Puerto Rico, and concerning the purchase of an air conditioner, since neither subject falls within Monks' expertise. This may be true, but the testimony was thoroughly inconsequential. Coffie also argues that he was denied a fair trial because the trial judge importuned his counsel to \"move along\" during counsel's lengthy cross-examination of Monks. It is a sufficient reply that the judge said exactly the same thing to government counsel during her direct examination of Monks. There is no constitutional or other right that a trial be interminable.\n\n4. Excluded Exculpatory Evidence.\n\nPedro Cruz claims that the district court committed reversible error by excluding evidence tending to exculpate Cruz with respect to counts seven (possession of heroin with intent to distribute it) and fifteen (use of a firearm during and in relation to a drug trafficking crime). At trial, Cruz attempted to enter the following evidence: (1) the minutes of a guilty plea by Manuel Vazquez, a codefendant, see supra note 2, who was arrested during the raid at 2700 Grand Concourse; (2) a magistrate's complaint filed against Cruz prior to his indictment; and (3) the testimony of his estranged common law wife, Nancy Curbelo, that Cruz expressed to her, the evening before his arrest, his intention to borrow a car the next day and join her at noon for a planned trip to the beach. The district court denied admission of all this evidence.\n\na. The Plea\n\nIn his plea allocution, Manuel Vazquez admitted that the heroin flung from the window of the apartment at 2700 Grand Concourse during his arrest had been packaged by members of the Torres Organization, and that the semi-automatic weapon in the apartment was there to protect the heroin. Cruz, who was arrested in the same apartment, proffered these plea minutes on the theory that Manuel Vasquez there accepted responsibility for the heroin and the weapon, thereby rebutting the government's contention that Cruz was in constructive possession of these items. Cruz contends that the plea minutes constitute either an admission, see Fed.R.Evid. 801(d)(2), or a declaration against penal interest, see id. 804(b)(3), or were admissible under the general exception to the hearsay rule stated in id. 803(24).\n\nOur review of the plea minutes reveals nothing that would tend to exculpate Cruz. At one point, Vazquez affirmed that he \"possessed together with others with intent to distribute\" (emphasis added) the heroin pitched from the apartment window as the NYDETF agents entered the apartment. At no juncture did Vazquez claim exclusive possession of the heroin or weapon. Cruz was charged on a theory of constructive possession, for which \"[it] is not necessary that the exercise of dominion and control by others be disproved; it is only necessary that the evidence support the jury's finding that [Cruz] exercised dominion and control over the weapon [and heroin].\" United States v. Rivera, 844 F.2d 916, 926 (2d Cir. 1988). In sum, the plea minutes were properly excluded as irrelevant to Cruz' defense.\n\nb. The Magistrate's Complaint.\n\nCruz claims that he was entitled to offer the complaint which was filed against him on June 24, 1987 immediately following his arrest in order to reveal inconsistencies between the information contained in the complaint and the testimony of the arresting officers who entered the apartment and made the arrests. The officer who filed the complaint was not one of the officers who first entered the apartment. In filling out the report, he was only recounting the descriptions given to him by the other officers on the scene. The district court therefore properly excluded this document as hearsay pursuant to Fed.R.Evid. 802. We note also that the NYDETF agents who participated in the raid, as well as the agent who swore to the complaint, testified at trial and were available for cross-examination by Cruz' counsel.\n\nc. The Testimony of Nancy Curbelo\n\nCruz maintains that he was present in the apartment at 2700 Grand Concourse on the day of the arrest in order to borrow a car so he could take his common law wife to the beach, and that he had no involvement with the drug activity taking place there. At the time of the raid, Cruz was arrested clad, according to a government witness, in \"a cabana outfit, a top and a rather loud pair of bathing trunks.\"\n\nCruz' estranged common law wife, Nancy Curbelo, testified as a defense witness in support of this position. She was allowed to testify that Cruz visited her the evening of June 23, 1987, the night before his arrest, that they \"made arrangements to go to the beach the following day\" with their son, and that they were supposed to leave for the beach about noon. The court sustained the government's objection, however, to proffered testimony that \"Cruz told her that he was taking her to the beach the following day and that he had to stop by and pick up a car to drive them to the beach the following day, that he would be by at approximately 12 o'clock the following day.\"\n\nCruz contended that this testimony was permissible under the exception to the hearsay rule first articulated in Mutual Life Ins. Co. v. Hillmon, 145 U.S. 285, 36 L. Ed. 706, 12 S. Ct. 909 (1892), and now set forth in Fed.R.Evid. 803(3), which provides for the admission of \"[a] statement of the declarant's then existing state of mind.\" Cruz cited Hillmon to the court as authority for his position, as well as United States v. DiMaria, 727 F.2d 265, 270-72 (2d Cir. 1984). The district court nonetheless excluded the evidence stating:\n\nWell, it seems to me the level of untrustworthiness of this statement is so great that the court can't permit it as an exception to the hearsay rule under these circumstances. I will preclude it.\n\nThe record can stand the way it is, I'm not going to strike out what's in there, but I'm not going to permit this witness to testify in effect to a purported alibi as to the issue of intent of this witness that is somehow inferred from what this witness may have heard the night before, and my concerns are two-fold.\n\nFirst of all, it is hearsay, and, secondly, the circumstances under which it was made are unreliable in the sense that there was no reason that this witness would necessarily have been told all the details under which Mr. Cruz was going to operate in terms of going to the beach.\n\nTo me its probative force is minimal and it seems rank hearsay, and I will exclude it.\n\nWe disagree with this ruling. Following Hillmon and Fed.R.Evid. 808(3), we have ruled that \"[a] declarant's out-of-court statement of intent may be introduced to prove that the declarant acted in accordance with that intent.\" United States v. Delvecchio, 816 F.2d 859, 863 (2d Cir. 1987); see also United States v. Badalamenti, 794 F.2d 821, 825-26 (2d Cir. 1986); United States v. Cicale, 691 F.2d 95, 103 (2d Cir. 1982), cert. denied, 460 U.S. 1082, 76 L. Ed. 2d 344, 103 S. Ct. 1771 (1983).\n\nIn one case, we said that \"a trial court would have discretion to refuse [Hillmon] evidence where its usefulness to show the victim's state of mind was outweighed by its likely prejudicial effect on the jury. . . .\" United States v. Kennedy, 291 F.2d 457, 459 (2d Cir. 1961) (Friendly, J.); see also J. Weinstein \u0026 M. Berger, 4 Weinstein's Evidence para. 803(3)[04], at 803-121 (1988). Kennedy, however, preceded the adoption of the Federal Rules of Evidence. More recently, construing Fed.R.Evid. 808(3), Judge Friendly said:\n\nIt is doubtless true that all the hearsay exceptions in Rules 803 and 804 rest on a belief that declarations of the sort there described have \"some particular assurance of credibility.\" See Introductory Note, supra. But the scheme of the Rules is to determine that issue by categories; if a declaration comes within a category defined as an exception, the declaration is admissible without any preliminary finding of probable credibility by the judge, save for the \"catch-all\" exceptions of Rules 803(24) and 804(b)(5) and the business records exception of Rule 803(6) . . ., even though this excludes certain hearsay statements with a high degree of trustworthiness and admits certain statements with a low one. This evil was doubtless thought preferable to requiring preliminary determinations of the judge with respect to trustworthiness, with attendant possibilities of delay, prejudgment and encroachment on the province of the jury.\n\nDiMaria, 727 F.2d at 272; see also United States v. Lawal, 736 F.2d 5, 8 (2d Cir. 1984) (\"DiMaria held that relevant declarations which fall within the parameters of Rule 803(3) are categorically admissible, even if they are self-serving and made under circumstances which undermine their trustworthiness.\"); United States v. Harris, 733 F.2d 994, 1005 (2d Cir. 1984) (same) (quoting DiMaria).\n\nIn view of this authority, the district court's exclusion of the proffered testimony on the basis of its likely untrustworthiness and unreliability cannot be affirmed. We nonetheless have no hesitation in deeming this error harmless within the meaning of Fed.R.Crim.P. 52(a). \"[Appraisal] of a particular error's impact necessarily depends on the nature of the violation in the context of a given factual setting.\" Hawkins v. LeFevre, 758 F.2d 866, 878 (2d Cir. 1985). The evidence of Cruz' guilt was strong, Curbelo was allowed to testify concerning the planned outing to the beach, and the excluded testimony was inherently implausible. In light of the substantial evidence of Cruz' participation in the activities of the Torres Organization, reviewed in section A4 of this Discussion, and his aborted effort to turn a semi-automatic weapon on the NYDETF agents when they entered the apartment at 2700 Grand Concourse, we doubt that the jury would have been impressed with the notion that Cruz' presence at this operational location of the Organization resulted solely from his need to borrow a car to go to the beach. In sum, we conclude that \"the trier of fact would have found the defendant guilty beyond a reasonable doubt with the additional evidence inserted.\" United States v. Lay, 644 F.2d 1087, 1091 (5th Cir. Unit A May 1981), cert. denied, 454 U.S. 869, 70 L. Ed. 2d 172, 102 S. Ct. 336 (1981).\n\nH. Jury Instructions.\n\nSeveral appellants claim error in a number of the district court's jury instructions. Before turning to their specific claims, we consider the principles governing our review. It is a \"well established proposition that a single instruction to a jury may not be judged in artificial isolation, but must be viewed in the context of the overall charge.\" Cupp v. Naughten, 414 U.S. 141, 146-47, 38 L. Ed. 2d 368, 94 S. Ct. 396 (1973) (citing Boyd v. United States, 271 U.S. 104, 107, 70 L. Ed. 857, 46 S. Ct. 442 (1926)). \"Moreover, in reviewing jury instructions, our task is also to view the charge itself as part of the whole trial.\" United States v. Park, 421 U.S. 658, 674, 44 L. Ed. 2d 489, 95 S. Ct. 1903 (1975). \"Often isolated statements taken from the charge, seemingly prejudicial on their face, are not so when considered in the context of the entire record of the trial.\" United States v. Birnbaum, 373 F.2d 250, 257 (2d Cir.), cert. denied, 389 U.S. 837, 19 L. Ed. 2d 99, 88 S. Ct. 53 (1967).\n\n1. The Relationship Between Subsections (a) and (b) of Section 848.\n\nFlores contends that section 848(a) is a lesser included offense of section 848(b), and that the district court therefore committed reversible error when it refused to charge the jury, as requested by Flores, that it could consider the lesser included offense only if it first acquitted him of the greater.\n\nThe government contends that section 848(b) is a sentence enhancing provision vis-a-vis section 848(a), and that the premise of Flores' argument is thus undercut. We are inclined, however, to agree with Flores that since section 848(b) requires the jury to find, beyond a reasonable doubt, elements in addition to those stated in section 848(a), section 848(b) resulted in a new offense rather than sentence enhancement. Cf. United States v. Amen, 831 F.2d 373, 381-82 (2d Cir. 1987) (by requiring elements of section 848(a) to be proved to jury beyond reasonable doubt, amendment of original bill transformed section 848(a) from sentence enhancement provision to statement of new offense), cert. denied, 485 U.S. 1021, 108 S. Ct. 1573, 99 L. Ed. 2d 889 (1988).\n\nIt would follow that section 848(a) is a lesser included offense of section 848(b). See Fed.R.Crim.P. 31(c). Under these circumstances, United States v. Tsanas, 572 F.2d 340 (2d Cir.), cert. denied, 435 U.S. 995, 56 L. Ed. 2d 84, 98 S. Ct. 1647 (1978), calls for the court to instruct the jury to consider the greater offense first, id. at 344, and then charge either (1) that it should consider the lesser offense only if it unanimously acquitted on the greater, or (2) that it should consider the lesser offense if it could not agree on the greater, id. at 344-46. We added that neither charge was \"wrong as a matter of law,\" id. at 346, but that the defendant's preference should be honored upon request. Id. at 346-47. Flores contends that in accord with Tsanas, he sought an instruction that section 848(b) should be considered first, and the jury should move on to section 848(a) only if it were unanimous for acquittal on section 848(b). He further contends that since his request was not honored, his conviction on count four, which charged violation of both subsections (a) and (b) of section 848, must be reversed.\n\nThe government contends that United States v. Pforzheimer, 826 F.2d 200, 205-06 (2d Cir. 1987), United States v. Murray, 618 F.2d 892, 895 n. 3 (2d Cir. 1980), and United States v. Stassi, 544 F.2d 579, 583-84 (2d Cir. 1976), cert. denied, 430 U.S. 907 (1977), provide precedent for the procedure followed here: having the jury determine first whether a violation of section 848(a) occurred, and then determine by special interrogatory whether the additional requirements of section 848(b) were satisfied. We are not persuaded. These cases involve the ascertainment of information required for sentencing, and would appear inapplicable where separate offenses, rather than sentence enhancement, are at issue.\n\nIn any event, we do not believe that any error which may have occurred in the district court's instruction calls for reversal. As the foregoing recital should make clear, this is a difficult and unsettled area of the law. The jury found both that there was a violation of section 848(a), and that the additional requirements of section 848(b) were satisfied, with respect to both Flores and the Torres brothers. We see no problem with the sufficiency of the evidence to support all these determinations, and give little credence to Flores' speculation that if the jury had first considered section 848(b), it might have hung on that count and then, given the Tsanas instruction which Flores unavailingly requested, never reached the section 848(a) count. We have already determined to vacate the convictions under section 848(b) and remand for resentencing of Flores and the Torres brothers under section 848(a). See supra, section B of this Discussion. No further relief is appropriate on this record.\n\n2. The Charge on the Firearm Counts.\n\nN. Vazquez, Cruz and Flores assert that the district court's instruction concerning section 924(c)(1) was improper. First, they contend that the jury charge for the section 924(c)(1) violation was too broad because it did not require the jury to find that the defendant in question used the weapon in order to protect the narcotics or to effect an escape. Second, they argue that the jury should not have been allowed to consider the conspiracy in count one as an underlying drug trafficking crime within the meaning of section 924(c)(1). These claims are without merit.\n\nThe district court required the jury to find that:\n\nthe defendant you are considering alone or with others kept [the weapon] in a place where drugs or drug proceeds are stored, packaged or distributed in order to enable drug traffickers to protect the drugs or drug proceeds.\n\nThis instruction is in conformity with the rule of United States v. Meggett, 875 F.2d 24 (2d Cir.), cert. denied, 493 U.S. 858, 110 S. Ct. 166, 107 L. Ed. 2d 123 (1989), which held that a weapon is used in connection with a drug trafficking crime if it is kept \"on hand to protect [an] apartment as a storage and processing point for large quantities of narcotics.\" Id. at 29.\n\nMeggett also disposes of the second stated objection to the district court's instruction concerning the firearm counts. Meggett determined that: \"A heroin conspiracy, punishable under 21 U.S.C. § 846, is a 'drug trafficking crime' and may serve as a predicate offense for purposes of 18 U.S.C. § 924(c).\" Id. at 27 (citing United States v. Diaz, 864 F.2d 544 (7th Cir. 1988), cert. denied, 490 U.S. 1070, 109 S. Ct. 2075, 104 L. Ed. 2d 639 (1989); United States v. Torres, 862 F.2d 1025 (3rd Cir. 1988)).\n\nCruz also asserts that an erroneous instruction concerning constructive possession undermined the section 924(c)(1) convictions. This contention is considered hereinafter. See infra, section H4 of this Discussion.\n\n3. Reasonable Doubt.\n\nFlores claims that the district court committed reversible error in its instruction concerning reasonable doubt. He contends that this instruction improperly shifted the burden of proof to require that the defendants persuade the jurors of a reasonable doubt concerning the defendants' guilt. Flores specifically objects to the instruction that a juror has a reasonable doubt if the juror can \"candidly and honestly say that [he is] not satisfied with the guilt of the defendant, that [he] [does] not have an abiding conviction of the defendant's guilt.\" No objection was made to this instruction at trial.\n\nThe full instruction concerning reasonable doubt was as follows:\n\nNow, the question that naturally arises in a criminal case is: What is a reasonable doubt? What does that term mean? Well, the words almost define themselves. It is a doubt founded in reason and arising out of the evidence in the case or the lack of evidence. It is a doubt that a reasonable person has after carefully weighing all of the evidence in the case. Reasonable doubt is a doubt that appeals to your reason, your judgment, your experience, and your common sense.\n\nIf, after a fair and impartial consideration of all the evidence, you can candidly and honestly say that you are not satisfied with the guilt of the defendant, that you do not have an abiding conviction of the defendant's guilt, in sum, if you have such a doubt as would reasonably cause a prudent person to hesitate in acting in matters of importance in his own affairs, then you have a reasonable doubt, and in that circumstance it is your duty to acquit.\n\nOn the other hand, if, after a fair and impartial consideration of all the evidence, you can candidly and honestly say that you have an abiding conviction of the defendant's guilt, such a conviction as would not cause a prudent person to hesitate in acting in important matters in the personal affairs of his own life, then you have no reasonable doubt, and under such circumstances, it is your duty to convict.\n\nOne final word on this subject: Reasonable doubt is not caprice, whim or speculation. It is not an excuse to avoid the performance of an unpleasant duty. Nor is it sympathy for the defendant. Reasonable doubt does not mean a positive certainty or beyond all possible doubt. After all, it is virtually impossible for a person to be absolutely and completely convinced of any controverted fact which by its nature is not susceptible to mathematical certainty.\n\nIn consequence, the law in a criminal case is that it is sufficient if the guilt of the defendant is established beyond a reasonable doubt, not beyond all possible doubt.\n\nEmphasis added.\n\nSince there was no objection to this instruction at trial, Flores bears the heavy burden of establishing plain error under Fed.R.Crim.P. 52(b). He has not done so. Although, as Flores contends, we have cautioned against departures from the traditional formulations of the reasonable doubt instruction, see, e.g., United States v. Ivic, 700 F.2d 51, 69-70 (2d Cir. 1983), the very sentence to which Flores objects continued, immediately after the language which he denounces, with the traditional definition of a reasonable doubt: \"such a doubt as would reasonably cause a prudent person to hesitate in acting in matters of importance in his own affairs.\" See Ivic, 700 F.2d at 69 \u0026 n. 11 (quoting with approval substantially identical model instruction from 1 Devitt \u0026 Blackmar, Federal Jury Practice and Instructions § 11.14 (3d ed. 1977)); United States v. Magnano, 543 F.2d 431, 436-37 (2d Cir. 1976) (collecting cases approving \"hesitate to act\" formulation), cert. denied, 429 U.S. 1091 (1977). Further, as Flores commendably concedes in his brief, we approved an instruction in Magnano that included almost verbatim the language to which exception is taken here, see Magnano, 543 F.2d at 436 n. 4, although the appellate objection to the jury charge in Magnano did not focus upon that language.\n\nThe substance of Flores' contention is that the district court's instruction concerning reasonable doubt shifted the burden of proof to Flores. As already indicated, we do not believe that the language utilized, even if read only in the context of the sentence in which it appears, can fairly be read to bear that meaning. On at least five separate occasions during the court's charge, furthermore, the jury was specifically instructed that the government had the burden of proving the defendants' guilt beyond a reasonable doubt, both in general and with respect to specific offenses. Reading the instruction as a whole, as we must, see Cupp v. Naughten, 414 U.S. 141, 146-47, 38 L. Ed. 2d 368, 94 S. Ct. 396 (1973); United States v. Bright, 517 F.2d 584, 588 (2d Cir. 1975), we reject the challenge to the district court's instruction concerning reasonable doubt.\n\n4. Constructive Possession.\n\nCruz assails the district court's instruction concerning constructive possession. He contends that an unduly expansive instruction on this subject (1) resulted in his improper convictions for heroin conspiracy and possession of heroin with intent to distribute it; and (2) that, combined with alleged error in the district court's charge concerning section 924(c)(1), considered hereinabove, this instruction also led to his erroneous conviction for violation of section 924(c)(1).\n\nIn addressing the possession counts, the district court stated:\n\nYou will note that I have used the words distribute and possess with intent to distribute. What do these terms mean?. . . .\n\nThe word possess has it's [sic] common everyday meaning, that is, to have something within your control. And to have something within your control does not necessarily mean to have it in your hand or pocket. One possesses drugs either by actually having physical possession of them or by having the power to exercise control over them, even if they are not physically in one's possession. This is called constructive possession. Control may be demonstrated by the existence of a working relationship between the person having such control and the person with actual physical custody. The person having control possesses them because he has an effective working relationship with the people who have actual physical custody of them, and because he can direct the movement or transfer or disposition of those things. In this manner a businessman may possess things that are scattered throughout a number of stores or offices or installations around and about a city or a country.\n\nSimilarly, in any kind of activity or enterprise partners or people who are acting together or as agents of each other may possess things that are not actually in their hands or physical grip at the particular moment. This applies equally in legal and illegal relationships.\n\nYou should use these notions, which are pretty much everyday notions, in applying the concept of possession in this case.\n\nThe law recognizes also that possession may be sole or joint. If one person alone has actual or constructive possession of a thing, possession is sole. If more than one person has possession of it, as I have defined possession for you, then possession is joint.\n\nEmphasis added.\n\nCruz contends that the district court \"utilized an example of civil ownership commensurate with the mercantile world, but wholly unrealistic to resolution of the case at bar.\" We disagree. The quoted instruction correctly stated the concept of constructive possession. See United States v. Rivera, 844 F.2d 916, 926 (2d Cir. 1988); United States v. Tribunella, 749 F.2d 104, 111-12 (2d Cir. 1984). Cruz' objection to the businessman analogy is another example of selecting a single passage of an instruction for exaggerated emphasis and attack, without regard to its inclusion in an overall statement that was both comprehensive and balanced.\n\n5. The Court's Refusal To Charge \"Stake In The Venture\".\n\nArcelay contends that the district court's refusal to charge a \"stake in the venture,\" as Arcelay requested, deprived him of a fair trial. We reject this contention.\n\nArcelay requested an instruction that:\n\nIn order to convict a defendant of conspiracy you must find beyond a reasonable doubt that he or she participated in it with knowledge of its unlawful purpose and with the specific intention of furthering its business or objective.\n\nIn that regard, it has been said that in order for a defendant to be deemed a participant in a conspiracy, he or she must have a stake in the venture or its outcome. You are instructed that while proof of a financial interest in the outcome of a scheme is not essential, if you find that the defendant had such an interest, that is a factor which you may properly consider in determining whether or not the defendant was a member of the conspiracy charged in the indictment. Of course, you may also consider the lack of evidence that a particular defendant had any stake in the outcome of the scheme charged in reaching your determination whether the government has proved beyond a reasonable doubt the membership of any defendant in the conspiracy charged.\n\nEmphasis added.\n\nThe district court declined to give this instruction, instead charging:\n\nTo find that a defendant was a member of a conspiracy, you must find that the government has proven beyond a reasonable doubt that he knowingly and intentionally participated in it. If a defendant, with an understanding of the unlawful character of the conspiracy, intentionally engages, advises, or assists, for the purpose of furthering the illegal undertaking, he thereby becomes a knowing and wilful participant, a conspirator.\n\nI instruct you that it is not necessary that a defendant receive any monetary benefit from his participation in the conspiracy or have a financial stake in the outcome as long as he in fact participated in it in the way I have just explained.\n\nFinally, you may not find that a defendant is a member in a conspiracy merely because of friendship or family relationship or association, or even sexual association, or business association with alleged co-conspirators. Of course, mere presence at the scene of an alleged transaction or mere similarity of conduct among various persons, or mere association, or even mere approval does not establish proof of the membership in a conspiracy. Also a person who has no knowledge of a conspiracy but who happens to act in a way that advances some object or purpose of a conspiracy does not thereby become a conspirator. So too, mere knowledge by a defendant of a conspiracy to commit an illegal act on the part of another does not of itself make the defendant a member. Rather, before you conclude a defendant was a member of the conspiracy, you must be satisfied that he knowingly associated himself with the conspiracy with the intent to aid in the accomplishment of at least one of its unlawful purposes.\n\nEmphasis added.\n\nOnce again, the district court's instruction was balanced and comprehensive. The last quoted paragraph included substantial elements specifically requested by Arcelay, but our precedents counselled against the specific instruction concerning \"stake in the venture\" requested by Arcelay and rejected by the district court.\n\nWe have held that:\n\nIt is not necessary to charge the jury that each conspirator must be found to have a \"stake in the success\" of the conspiracy for the use of such an expression would be misleading as it might infer that there must be a showing of some personal financial interest in the outcome of the conspiracy. It is sufficient that the defendant was not indifferent to the outcome of the venture. United States v. Tramaglino, [197 F.2d 928, 931 (2d Cir.), cert. denied, 344 U.S. 864, 97 L. Ed. 670, 73 S. Ct. 105 (1952). The district court's] charge properly and adequately covered the subject by saying that \"the individual becomes a part of a conspiracy by his intentional participation in it.\" United States v. McKnight, 253 F.2d 817, 819 (2d Cir. 1958); accord, United States v. DeBiasi, 712 F.2d 785, 792 (2d Cir.), cert. denied, 464 U.S. 962, 104 S. Ct. 397, 78 L. Ed. 2d 339 (1983); United States v. Rush, 666 F.2d 10, 12 (2d Cir. 1981).\n\nIn view of these rulings, it was obviously not error for the district court to decline to give the \"stake in the venture\" instruction proposed by Arcelay.\n\nI. The Government's Rebuttal Summation.\n\nCruz claims that several statements by the prosecution during its rebuttal summation were improper. He contends that in the following passage, the prosecution improperly vouched for the credibility of certain of its witnesses:\n\n[Unless] you believe that the agents were lying or unless there were mistakes, there is no room for reasonable doubt because the evidence is clear that the participation of each has been shown.\n\nCruz also asserts that in the following passage, the prosecution misstated the record by mischaracterizing the theory of the defense:\n\nFor Pedro Cruz, his counsel suggested to you, as an initial matter, that the fatal weakness in the government's case against him was an absence of a confession and your own common sense will tell you that is not much of an argument, that if every case depended on a confession there would be few trials, indeed no trials. If there was a confession, there would be no trial.\n\nFinally,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Cruz contends that he was prejudiced by the following statement:\n\nIn analyzing those arguments you can certainly bear in mind that Craig Moruzzi was on the stand. He was the one who made the voice identification of Pedro Cruz and not a single question was asked to him on cross examination about that voice identification. So you ask yourselves how serious is the challenge to that when [no?] cross examination was made.\n\nCruz asserts that the cumulative effect of these allegedly improper statements was to deny him a fair trial. His claims of prosecutorial misconduct are, however, without substance. As to the first challenged passage, it becomes transparently clear that the government was not improperly vouching for the credibility of its witnesses when this statement is placed in the context of the full sentence from which it was taken, which reads as follows:\n\nThe next 3 defendants that you heard about, Dennis Rivera, Pedro Cruz and Jesus Santiago, essentially suggested to you in their summations that the cases against them are either built on lies or multiple mistakes of agents and that should be recognized by you as an argument that itself recognizes that unless you believe that the agents were lying or unless there were mistakes, there is no room for reasonable doubt because the evidence is clear that the participation of each has been shown.\n\nThe second challenged statement was obvious, and permissible, sarcasm in response to a defense contention. See United States v. Bagaric, 706 F.2d 42, 60 (2d Cir.), cert. denied, 464 U.S. 840 (1983). As to the third, \"[an] observation that evidence adduced by the Government was not confronted on cross-examination is entirely proper.\" United States v. Walker, 835 F.2d 983, 989 (2d Cir. 1987).\n\nJ. Sentences.\n\nSeveral appellants claim that the sentences imposed were improper. Before turning to their specific claims, we note that this is a pre-Sentencing Guidelines case in which \"the sentencing court has wide discretion in imposing sentence, and, . . . if a sentence is within the permissible statutory limits and it does not appear that the court took into account any improper factor, the sentence may not be reviewed on appeal.\" United States v. Giraldo, 822 F.2d 205, 210 (2d Cir.) (citing Gore v. United States, 357 U.S. 386, 393, 2 L. Ed. 2d 1405, 78 S. Ct. 1280 (1958)), cert. denied, 484 U.S. 969, 108 S. Ct. 466, 98 L. Ed. 2d 405 (1987).\n\n1. The Torres Brothers.\n\nThe Torres brothers claim that the mandatory life sentence without parole imposed by 21 U.S.C. § 848(b) (Supp. V 1987) is unconstitutional. Since we have vacated their convictions under section 848(b) on another ground, see supra section B of this Discussion, we do not reach this contention. As previously indicated, the Torres brothers must be resentenced under section 848(a) in view of the vacation of their convictions under section 848(b).\n\nThe Torres brothers also assert, however, that they should be resentenced with respect to the other counts on which they were convicted, as to which they were each sentenced to a total of one hundred years imprisonment. They claim that the district court sentenced them with a \"fixed and mechanical approach\" that disregarded favorable personal factors, including their youth, expressions of community support and their lack of any prior criminal record, and took into account only the harm caused by their massive heroin distribution in the south Bronx. In this regard, the district court stated at sentencing:\n\nThe defendants distributed massive quantities of heroin into that neighborhood [the south Bronx] in blatant disregard of the law in order to make a fortune. It was irrelevant to them that they were capitalizing on the despair and lack of hope that lead an individual to a life of dependency on drugs.\n\nThey were unconcerned that the effect of their product was to ravage the bodies and minds of their customers. Instead, with pride and a sense of accomplishment, these defendants spread the blight of drugs throughout their neighborhood.\n\nThe Torres brothers further assert that the case should be assigned to a different judge for resentencing. They contend that because the district court imposed heavy, consecutive sentences upon them with respect to the other counts of which they were convicted, expressed \"no hesitation\" in imposing the life sentences without parole mandated by section 848(b), and concentrated his sentencing comments upon the harm done by their massive heroin operation in the south Bronx, rather than sentencing \"on an individualized basis,\" the applicable precedents call for resentencing by a different judge.\n\nWe reject both contentions. As to the allegedly mechanistic sentencing, we do not regard the focus of the district court's sentencing comments as inappropriate, or even approaching an abuse of discretion. Rather, given the policies underlying the pertinent federal legislation, the court's concern with, and focus upon, the massive damage inflicted by this intensive, lengthy and highly remunerative narcotics operation was thoroughly justified. Especially given the evidence of the conspiracy's scope and duration, and the lack of any expression of remorse by the Torres brothers, the weight to be given the exonerating contentions pressed by these appellants was a matter for the trial judge's informed discretion. See United States v. Salerno, 868 F.2d 524, 542-43 (2d Cir.), cert. denied, 491 U.S. 907, 109 S. Ct. 3192, 105 L. Ed. 2d 700 (1989); United States v. Gaggi, 811 F.2d 47, 62-63 (2d Cir.), cert. denied, 482 U.S. 929, 96 L. Ed. 2d 701, 107 S. Ct. 3214 (1987).\n\nWe turn to the claim that resentencing should be assigned to a different judge. United States v. Robin, 553 F.2d 8, 10-11 (2d Cir. 1977) (per curiam), collects most of the precedents in this circuit where we have followed that course. None are comparable on their facts to the situation presented here. As we have just made clear, there was no impropriety in the sentencing procedures originally followed. Rather, resentencing is required because an instruction that failed adequately to relate these appellants' conduct to the effective date of section 848(b) vitiates their conviction under that section, and the resulting mandatory life sentence without parole. We note in this regard that the challenged instruction concerned a matter of first impression, and that appellants' objection to that instruction at trial did not focus upon the flaw in that instruction which is the basis for our ruling on appeal. Further, as we said in Robins, \"[a] judge who has presided over a lengthy trial often gains an intimate insight into the circumstances of the defendants' crime, which may prove uniquely useful in determining the sentence to be imposed. . . .\" 553 F.2d at 11.\n\nIn sum, no showing has been made which begins to warrant the reassignment urged by these appellants. See United States v. Trzaska, 859 F.2d 1118, 1121 (2d Cir. 1988) (no reassignment where trial judge \"had sufficient legitimate reasons to impose the sentence that he did\"), cert. denied, 493 U.S. 839, 110 S. Ct. 123, 107 L. Ed. 2d 84 (1989); United States v. Bradley, 812 F.2d 774, 782 n. 9 (2d Cir.) (even when sentencing judge shown to have held erroneous views or made incorrect findings, reassignment required only in rare instances in which judge's fairness or appearance of judge's fairness seriously in doubt, citing Robin, 553 F.2d at 10), cert. denied, 484 U.S. 832, 98 L. Ed. 2d 67, 108 S. Ct. 107 (1987).\n\n2. Flores.\n\nFlores makes the same arguments as the Torres brothers concerning the constitutionality of section 848(b), sentencing in a mechanistic manner on the other counts (on which Flores was sentenced to a total of seventy-five years imprisonment), and reassignment to a different judge for resentencing. He also contends that the $2,000,000 fine levied against him was unconstitutionally excessive and imposed in violation of statutory requirements, since he is indigent as a result of the forfeiture effected in this litigation, and the fine thus illegally disregarded his ability to pay.\n\nWe disagree. The fine was the maximum then allowed under section 848(a), but Flores was liable to additional fines for his multiple felony convictions on other counts. Further, a heavy fine was consistent with the pertinent factors set forth in 18 U.S.C. § 3622 (Supp.V 1987),\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e including \"the nature and circumstances of the offense; . . . the history and characteristics of the defendant; [and] . . . the need to deprive the defendant of illegally obtained gains from the offense.\" Id. § 3622(a)(1), (2) and (7).\n\nAs to Flores' asserted indigence:\n\nThe rule in this circuit . . . is that \"[financial] obligations may be imposed upon a defendant who is indigent at the time of sentencing but subsequently acquires the means to discharge his obligations.\" United States v. Brown, 744 F.2d 905, 911 (2d Cir.) (citing Fuller v. Oregon, 417 U.S. 40, 94 S. Ct. 2116, 40 L. Ed. 2d 642 (1974)), cert. denied, [469 U.S. 1089,] 105 S. Ct. 599, 83 L. Ed. 2d 708 (1984). [Such a defendant] may assert a constitutional objection on the ground of his indigency only if the government seeks to enforce the court's order . . . \"at a time when the defendant [is] unable, through no fault of his own, to comply.\" Id. (citing Bearden v. Georgia, 461 U.S. 660, 103 S. Ct. 2064, 76 L. Ed. 2d 221 (1983)).\n\nUnited States v. Hutchings, 757 F.2d 11, 14-15 (2d Cir.), cert. denied, 472 U.S. 1031, 87 L. Ed. 2d 640, 105 S. Ct. 3511, (1985); see also United States v. Atkinson, 788 F.2d 900, 904 (2d Cir. 1986); United States v. Pagan, 785 F.2d 378, 381-82 (2d Cir.), cert. denied, 479 U.S. 1017, 93 L. Ed. 2d 719, 107 S. Ct. 667 (1986).\n\n3. Raymond E. Coffie.\n\nCoffie was sentenced to ten years imprisonment and a $200,000 fine. He contends that this sentence is so disproportionate as to violate the eighth amendment prohibition against cruel and unusual punishment. He also asserts that his presentence report (1) \"failed to include vital information pertaining to available alternative sentencing programs not involving incarceration (Fed.R.Crim.P. 32(c)(2)(E)),\" and (2) improperly included Sentencing Guidelines information, in view of the inapplicability of those guidelines to Coffie.\n\nNone of these contentions has merit. While proportionality in criminal sentences is required, see Solem v. Helm, 463 U.S. 277, 290, 77 L. Ed. 2d 637, 103 S. Ct. 3001 (1983), \"'successful challenges to the proportionality of particular sentences' should be 'exceedingly rare.'\" Hutto v. Davis, 454 U.S. 370, 374, 70 L. Ed. 2d 556, 102 S. Ct. 703 (1982) (per curiam) (quoting Rummel v. Estelle, 445 U.S. 263, 272, 63 L. Ed. 2d 382, 100 S. Ct. 1133 (1980)). This case, where Coffie was convicted of knowing participation in a massive heroin conspiracy and was subject to a maximum penalty of life imprisonment and a four million dollar fine, see 21 U.S.C. §§ 846 and 841(b)(1)(A) (1988), does not arguably approach a constitutional violation.\n\nRule 32(c)(2)(E) calls for the provision of information concerning alternatives to prison \"unless the court orders otherwise.\" The failure to provide this information was called to the attention of the trial judge at the sentencing hearing, and he made it clear that he was not interested in such alternatives for Coffie. Similarly, even assuming some prejudice could result from the provision of advisory Sentencing Guidelines calculations in Coffie's presentence report, the district court specifically disavowed any reliance upon those calculations. See Fed.R.Crim.P. 32(c)(3)(D).\n\nConclusion\n\nThe judgments of conviction are affirmed, except that the conviction of Reginald Velez on count fourteen of the superseding indictment for violation of 18 U.S.C. § 924(c)(1) (1988) is reversed, and the convictions of Victor Torres, George Torres and Nelson Flores on counts two, three and four, respectively, of the superseding indictment for violation of 21 U.S.C. §§ 848(a) and (b) (1982 \u0026 Supp. V 1987) are vacated and remanded for resentencing pursuant to 21 U.S.C. § 848(a) (1982 \u0026 Supp. V 1987).\n\nAPPENDIX\n\nSummary of Sentences Imposed*fn*\n\nVICTOR TORRES:\n\nCount one (21 U.S.C. No sentence imposed.\n\n§ 846 (1988)). Offense included in count two.\n\nCount two (21 U.S.C. Life imprisonment without\n\n§ 848(a) and (b) (1982) parole, two million dollar\n\nSupp. V 1987)). fine.\n\nCount six (21 U.S.C. Fifteen years imprisonment\n\n§ 841(b) and (1)(B) (1988)). , four years supervised release, two million\n\ndollar fine; concurrent with sentence on count\n\ntwo (except as to fine).\n\nCount seven (21 U.S.C. Fifteen years imprisonment\n\n§ 841(b)(1)(B) (1988)). , four years supervised release, two million\n\ndollar fine; consecutive to\n\nsentence on count six but\n\nconcurrent with sentence\n\non count two (except as to fine).\n\nCount eight (21 U.S.C. Twenty years imprisonment\n\n§ 841(b)(1)(A) (1988)). , five years supervised\n\nrelease, four million dollar\n\nfine; consecutive to sentences\n\non counts six and seven but concurrent with\n\nsentence on count two (except as to fine).\n\nCount nine (21 U.S.C. Ten years imprisonment,\n\n§ 841(b)(1)(C) (1988)). three years supervised release, $600,00 fine;\n\nconsecutive to sentences on counts six\n\nsix through eight but concurrent with sentence\n\non count two (except as to fine).\n\nCount ten (21 U.S.C. Ten years imprisonment,\n\n§ 841(b)(1)(C) (1988)). three years supervised release, $600,000 fine;\n\nconsecutive to sentences on counts six through\n\nnine but concurrent with sentence on count two\n\n(except as to fine).\n\nCount eleven (21 U.S.C. Ten years imprisonment,\n\n§ 841(b)(1)(C) (1988)). three years supervised release, $600,000 fine;\n\nconsecutive to sentences on counts six through\n\nten but concurrent with sentence\n\non count two (except as to fine).\n\nCount twenty-two (26 Five years\n\nU.S.C. § 7201 (1982)). $50,000 fine; consecutive\n\nto sentences on counts six\n\nthrough eleven but concurrent\n\nwith sentence on count two (except as to fine).\n\nCount twenty-four (26 Five years imprisonment,\n\nU.S.C. § 7201 (1982)). $50,000 fine; consecutive\n\nto sentences on counts six\n\nthrough eleven and twenty-\n\ntwo but concurrent with\n\nsentence on count\n\n(except as to fine).\n\nCount twenty-six (26 Five years imprisonment,\n\nU.S.C. § 7201 (1982)). $50,000 fine; consecutive\n\nto sentences on counts\n\nthrough eleven, twenty-two\n\nand twenty-four but concurrent\n\nwith sentence on\n\ncount two (except as to fine).\n\nCount twenty-eight (26 Five years imprisonment,\n\nU.S.C. § 7201 (1982)). $50,000 fine; consecutive\n\nto sentences on counts six\n\nthrough eleven, twenty-\n\ntwo, twenty-four and\n\ntwenty-six but concurrent\n\nwith sentence on count two\n\n(except as to fine).\n\nCount thirty (21 U.S.C. Forfeiture of most of the\n\n§ 853(a) (1988)). assets specified in the\n\nsuperseding indictment.\n\nTOTAL SENTENCE: Life imprisonment without\n\nparole, twenty-two years\n\nsupervised release, twelve\n\nmillion dollar fine, forfeiture\n\nof property in count thirty.\n\nGEORGE TORRES:\n\nCount one (21 U.S.C. No sentence imposed.\n\n§ 846 (1988)). Offense included in count three.\n\nCount three (21 U.S.C. Life imprisonment without\n\n§ 848(a) and (b) (1982 \u0026 parole, two million dollar fine.\n\nSupp. V 1987)).\n\nCount six (21 U.S.C. Fifteen years imprisonment\n\n§ 841(b)(1)(B) (1988)). , four years supervised release\n\n, two million dollar fine;\n\nconcurrent with sentence on\n\nthree (except as to fine).\n\nCount seven (21 U.S.C. Fifteen years imprisonment\n\n§ 841(b)(1)(B) (1988)). , four years supervised release,\n\ntwo million dollar fine; consecutive to\n\nsentence on count six but\n\nconcurrent with sentence\n\non count three (except as to fine).\n\nCount eight (21 U.S.C. Twenty years imprisonment,\n\n§ 841(b)(1)(A) (1988)). five years supervised\n\nrelease, four million dollar\n\nfine; consecutive to sentences\n\non counts six and seven\n\nbut concurrent with sentence\n\non count three (except as to fine).\n\nCount nine (21 U.S.C. Ten years imprisonment,\n\n§ 841(b)(1)(C) (1988)). three years supervised\n\nrelease, $600,000 fine; consecutive\n\nto sentences on counts six through eight\n\nbut concurrent with sentence on count three\n\n(except as to fine).\n\nCount ten (21 U.S.C. Ten years imprisonment,\n\n§ 841(b)(1)(C) (1988)). three years supervised\n\nrelease, $600,000 fine; consecutive\n\nto sentences on\n\ncounts six through nine but concurrent\n\nwith sentence on count three\n\n(except as to fine).\n\nCount eleven (21 U.S.C. Ten years imprisonment,\n\n§ 841(b)(1)(C) (1988)). three years supervised\n\nrelease, $600,000 fine; consecutive\n\nsentences on counts six through ten but\n\nconcurrent with sentence on count\n\nthree (except as to fine).\n\nCount twenty-three (26 Five years imprisonment,\n\nU.S.C. § 7201 (1982)). $50,000 fine; consecutive\n\nto sentences on counts six\n\nthrough eleven but concur-\n\nrent with sentence on\n\ncount three (except as to fine).\n\nCount twenty-five (26 Five years imprisonment,\n\nU.S.C. § 7201 (1982)). $50,000 fine; consecutive\n\nto sentences on counts six\n\nthrough eleven and twenty-\n\nthree but concurrent with\n\nsentence on count three\n\n(except as to fine).\n\nCount twenty-seven (26 Five years\n\nU.S.A. § 7201 (1982)). $50,000 fine; consecutive\n\nto sentences on counts six\n\nthrough eleven, twenty-\n\nthree and twenty-five but\n\nconcurrent with sentence\n\non count three (except as\n\nto fine).\n\nCount twenty-nine (26 Five years imprisonment,\n\nU.S.C. § 7201 (1982)). $50,000 fine;\n\nto sentences on counts six\n\nthrough eleven, twenty-\n\nthree, twenty-five and\n\ntwenty-seven but concur-\n\nrent with sentence on\n\ncount three (except as\n\nto fine).\n\nCount thirty (21 U.S.C. Forfeiture of most of the\n\n§ 853(a) (1988)). assets specified in the\n\nsuperseding indictment.\n\nTOTAL SENTENCE: Life imprisonment without\n\nparole, twenty-two years\n\nsupervised release, twelve\n\nmillion dollar fine, forfeit-\n\nure of property in count\n\nthirty.\n\nNELSON FLORES:\n\nCount one (21 U.S.C. No sentence imposed.\n\n§ 846 (1988)). Offense included in count\n\nfour.\n\nCount four (21 U.S.C. Life imprisonment without\n\n§ 848(a) and (b) (1982 \u0026 parole, two million dollar\n\nSupp. V 1987)). fine.\n\nCount six (21 U.S.C. Twelve years imprison-\n\n§ 841(b)(1)(B) (1988)). ment, four years super-\n\nvised release; concurrent\n\nwith sentence on count\n\nfour.\n\nCount seven (21 U.S.C. Twelve years imprison-\n\n§ 841(b)(1)(B) (1988)). ment, four years super-\n\nvised release; consecutive\n\nto sentence on count six\n\nbut concurrent with sen-\n\ntence on count four.\n\nCount eight (21 U.S.C. Sixteen years imprison-\n\n§ 841(b)(1)(A) (1988)). ment, five years supervised\n\nrelease consecutive to sen-\n\ntences on counts six and\n\nseven but concurrent with\n\nsentence on count four.\n\nCount nine (21 U.S.C. Ten years imprisonment,\n\n§ 841(b)(1)(C) (1988)). three years supervised\n\nrelease; consecutive to sen-\n\ntences on counts six\n\nthrough eight but concur-\n\nrent with sentence on\n\ncount four.\n\nCount ten (21 U.S.C. Ten years imprisonment,\n\n§ 841(b)(1)(C) (1988)). three years supervised\n\nrelease; consecutive to sen-\n\ntences on counts six\n\nthrough nine but concur-\n\nrent with sentence on\n\ncount four.\n\nCount eleven (21 U.S.C. Ten years imprisonment,\n\n§ 841(b)(1)(C) (1988)). three years supervised\n\nrelease; consecutive to sen-\n\ntences on counts six\n\nthrough ten but concurrent\n\nwith sentence on count four.\n\nCount eighteen (21 U.S.C. Five years imprisonment,\n\n§ 924(c)(1) (1988)). consecutive to all other\n\nterms of imprisonment.\n\nCount nineteen (21 U.S.C. Ten years imprisonment,\n\n856 (1988)). concurrent with sentences\n\non counts four and six\n\nthrough eleven.\n\nCount twenty (21 U.S.C. Ten years imprisonment,\n\n§ 856 (1988)). consecutive to sentence on\n\ncount nineteen but concur-\n\nrent with sentences on\n\ncounts four and six\n\nthrough eleven.\n\nCount thirty-one (21 Forfeiture of most of the\n\nU.S.C. § 853(a) (1988)). assets specified in the\n\nsuperseding indictment.\n\nTOTAL SENTENCE: Life plus five years impris-\n\nonment without parole,\n\ntwenty-two years super-\n\nvised release, two million\n\ndollar fine, forfeiture of\n\nproperty in count thirty-\n\none.\n\nJESUS SANTIAGO:\n\nCount one (21 U.S.C. Thirty-five years imprison-\n\n§ 846 (1988)). ment.\n\nCount six (21 U.S.C. Twelve years imprison-\n\n§ 841(b)(1)(B) (1988)). ment, eight years super-\n\nvised release; concurrent\n\nwith sentence on\n\none.\n\nCount seven (21 U.S.C. Twelve years imprison-\n\n§ 841(b)(1)(B) (1988)). ment, eight years super-\n\nvised release; consecutive\n\nto sentence on count six\n\nbut concurrent with sen-\n\ntence on count one.\n\nCount fifteen (18 U.S.C. Five years imprisonment,\n\n§ 924(c)(1) (1988)). consecutive to all other\n\nterms of imprisonment.\n\nTOTAL SENTENCE: Forty years imprisonment,\n\nsixteen years supervised\n\nrelease.\n\nLOUIS RIVERA:\n\nCount one (21 U.S.C. Five years imprisonment.\n\n§ 846 (1988)).\n\nCount twenty-one (21 Five years imprisonment,\n\nU.S.C. § 856 (1988)). concurrent with sentence\n\non count one.\n\nTOTAL SENTENCE: Five years imprisonment.\n\nNATALIE VAZQUEZ:\n\nCount one (21 U.S.C. Twenty-two years impris-\n\n§ 846 (1988)). onment.\n\nCount six (21 U.S.C. Ten years imprisonment,\n\n§ 841(b)(1)(B) (1988)). four years supervised\n\nrelease; concurrent with\n\nsentence on count one.\n\nCount ten (21 U.S.C. Five years imprisonment,\n\n§ 841(b)(1)(C) (1988)). three years supervised\n\nrelease; consecutive to sen-\n\ntence on count six, but\n\nconcurrent with sentence\n\non count one.\n\nCount sixteen (18 U.S.C. Five years imprisonment,\n\n§ 924(c)(1) (1988)). consecutive to all other\n\nterms of imprisonment.\n\nCount thirty-two (21 Forfeiture of most of the\n\nU.S.C. § 853(a) (1988)). assets specified in the\n\nsuperseding indictment.\n\nTOTAL SENTENCE: Twenty-seven years impris-\n\nonment, seven years super-\n\nvised release, forfeiture of\n\nproperty in count thirty-\n\ntwo.\n\nFERNANDO PADRON:\n\nCount one (21 U.S.C. Twenty years imprisonment\n\n§ 846 (1988)).\n\nDENNIS RIVERA:\n\nCount one (21 U.S.C. Twenty-two years impris-\n\n§ 846 (1988)). onment.\n\nCount thirteen (21 U.S.C. Ten years imprisonment,\n\n§ 841(b)(1)(C) (1988)). three years supervised\n\nrelease; concurrent with\n\nsentence on count one.\n\nCount seventeen (18 Five years imprisonment,\n\nU.S.C. § 924(c)(1) (1988)). consecutive to sentences on\n\ncounts one and thirteen.\n\nTOTAL SENTENCE: Twenty-seven years impri-\n\nonment, three years super-\n\nvised release.\n\nREGINALD VELEZ:\n\nCount one (21 U.S.C. Twenty-two years impris-\n\n§ 846 (1988)). onment.\n\nCount eleven (21 U.S.C. Ten years imprisonment,\n\n§ 841(b)(1)(C) (1988)). three years supervised\n\nrelease, concurrent with\n\nsentence on count one.\n\nCount fourteen (18 U.S.C. Five years imprisonment,\n\n§ 924(c)(1) (1988)). consecutive to sentences on\n\ncounts one and eleven.\n\nTOTAL SENTENCE: Twenty-seven years impris-\n\nonment, three years super-\n\nvised release.\n\nPEDRO CRUZ:\n\nCount one (21 U.S.C. Twenty years imprison-\n\n§ 846 (1988)). ment.\n\nCount seven (21 U.S.C. Fifteen years imprison-\n\n§ 841(b)(1)(B) (1988)). ment, eight years super-\n\nvised release; concurrent\n\nwith sentence on count\n\none.\n\nCount fifteen (18 U.S.C. Five years imprisonment,\n\n§ 924(c)(1) (1988)). consecutive to sentences on\n\ncounts one and seven.\n\nTOTAL SENTENCE: Twenty-five years impris-\n\nonment, eight years super-\n\nvised release.\n\nEFRAIN ARCELAY:\n\nCount one (21 U.S.C. Four years imprisonment.\n\n§ 846 (1988)).\n\nRAYMOND E. COFFIE\n\nCount one (21 U.S.C. Ten years imprisonment,\n\n§ 846 (1988)). 200,000 fine.\n\n\u003cspan class=\"fn\"\u003e1. This indictment superseded Indictment 87 Cr. 593, filed on July 9, 1987.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The indictment also charged Manuel Vazquez, Carlos Nunez, Efrain Quinones, Irene Quinones, Edwin Colon and Rosa Flores with various crimes. Manuel Vazquez and Carlos Nunez pled guilty to several counts of the indictment prior to trial. The trials of Efrain Quinones, Irene Quinones and Edwin Colon were severed, and they subsequently pled guilty to a count of a superseding indictment. Rosa Flores was acquitted on the sole count in which she was charged at the conclusion of the government's case in the trial from which this appeal is taken.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. All citations to, and quotations from, section 848 hereinafter refer to that statute as applicable here. Section 848 was substantially amended by the Anti-Drug Abuse Act of 1988, Pub.L. No. 100-690, 102 Stat. 4181, but those amendments are not pertinent to this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. There was no subsection (c) of section 848 as applicable here, prior to its amendment by Pub.L. No. 100-690. See supra note 3.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. We note, however, that the \"overt acts\" section of the narcotics conspiracy count includes an allegation that \"[on] at least five occasions in 1986 and 1987, VICTOR TORRES and JORGE TORRES purchased wholesale quantities of heroin for distribution by the Torres organization\" (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Only Cruz pursues this contention on appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Cruz points to one other allegedly prejudicial statement; the \"prejudice\" arises solely from an apparent error in the court reporter's transcription of the government's rebuttal summation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. This provision was repealed effective November 1, 1987. See Comprehensive Crime Control Act of 1984, Pub.L. No. 98-473, Title II, §§ 212(a)(2) and 235(a)(1), 98 Stat. 1987 and 2031.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* In addition to the sentences set forth in this appendix, the district court also imposed, as required by 18 U.S.C. § 3013 (1988), a special assessment of fifty dollars on each count except counts thirty through thirty-two.\u003c/span\u003e\n\n",
    "body_length": 155475,
    "citedas": [
      "901 F.2d 205"
    ],
    "attorneys": "GERALD L. SHARGEL, New York, New York (Alan S. Futerfas, Gail E. Laser, New York, New York, of counsel), for Defendant-Appellant Victor Torres. MICHAEL ROSS, New York, New York (LaRossa, Mitchell \u0026 Ross, New York, New York, of counsel), for Defendant-Appellant George Torres. ABRAHAM L. CLOTT, New York, New York (The Legal Aid Society Federal Defenders Unit, New York, New York, of counsel), for Defendant-Appellant Nelson Flores. THOMAS D. WHITE, New York, New York, for Defendant-Appellant Louis Rivera. MAURICE H. SERCARZ, New York, New York, for Defendant-Appellant Natalie Vazquez. ZOILO I. SILVA, Elmhurst, New York, for Defendant-Appellant Dennis Rivera. THOMAS H. NOOTER, New York, New York (Freeman, Nooter \u0026 Ginsberg, New York, New York, of counsel), for Defendant-Appellant Reginald Velez. ROGER BENNET ADLER, New York, New York, for Defendant-Appellant Pedro Cruz. WILLIAM MOGULESCU, New York, New York, for Defendant-Appellant Efrain Arcelay. ROBERT I. LESSER, New York, New York (McDonough, Marcus, Cohn \u0026 Tretter, New York, New York, of counsel), for Defendant-Appellant Raymond E. Coffie. Robert L. Ellis, New York, New York, for Defendant-Appellant Jesus Santiago. Michelle S. Jacobs, New York, New York, for Defendant-Appellant Fernando Padron. HELEN GREDD, Assistant United States Attorney for the Southern District of New York, New York, New York (Benito Romano, United States Attorney for the Southern District of New York, Celia Goldwag Barenholtz, Assistant United States Attorney for the Southern District of New York, New York, New York, of counsel), for Appellee.",
    "category": [
      "36",
      "75"
    ],
    "judges": "Meskill, Pierce and Mahoney, Circuit Judges.",
    "citation_count": 584
  }
}
