{
  "id": "BoZdP2YBTlTomsSBXmly",
  "document": {
    "title": "Bell v. City of Milwaukee",
    "full_title": "PATRICK BELL, SR., ETC., ET AL. v. CITY OF MILWAUKEE, HOWARD JOHNSON AND EDWIN SHAFFER ; PATRICK BELL, SR., ETC., ET AL. V. THOMAS GRADY, JR. ; PATRICK BELL, SR., ETC., ET AL. V. CITY OF MILWAUKEE, ET AL.",
    "jurisdiction": "Seventh Circuit",
    "date": "1984-09-04T00:00:00.000Z",
    "docket": "Nos. 82-2102, 82-2103, 82-2138",
    "body": "Before CUMMINGS, Chief Judge, CUDAHY, Circuit Judge, and KELLEHER, Senior District Judge.*fn*\n\nCUMMINGS, Chief Judge. The appeals in this extraordinary case present several important issues involving the Reconstruction period civil rights statutes, 42 U.S.C. §§ 1981, 1983, 1985, and 1986, and their interplay with state law, along with procedural and evidentiary issues. Defendants Thomas Grady, Jr., City of Milwaukee, Howard Johnson, and Edwin Shaffer appeal from the jury verdict and judgment of the United States District Court, Eastern District of Wisconsin, in a trial extending more than ten weeks, finding that Grady as an officer of the Milwaukee Police Department deprived Daniel Bell and his family of their constitutional rights by unlawfully shooting and killing Daniel Bell on February 2, 1958, under color of state law. Defendants also appeal the finding that Grady, Chief of Police Johnson, and Detective Sergeant Shaffer unlawfully conspired to conceal the true facts of Daniel Bell's death. Defendants appeal the various components of the judgment of $1,590,670 in favor of plaintiffs Patrick Bell, Sr., Alfonzo Bell, Doffer Bell, Eddie Bell, Ernest Bell, Henry Bell, Jimmy Bell, Joseph Bell, Lawrence Bell, Roosevelt Bell, Sylvia White Bell, and Walter Bell, the brothers and sister of Daniel Bell, as well as to Patrick Bell, Sr. as special administrator of both the estate of Daniel Bell and the estate of Dolphus Bell, Daniel's deceased father. Defendants raise several other issues, and plaintiffs cross-appeal. We affirm in part and reverse in part.\n\nI. FACTS OF CASE\n\nThe rather substantial body of facts, relevant to the many issues raised on appeal, is as follows:\n\nOn Sunday, February 2, 1958, Milwaukee Police Officers Thomas Grady, Jr. and Louis Krause met by chance at approximately 8:30 p.m. at the corner of North 7th Lane and West Wright Street. The officers stopped their motorcycles at the curb (both were assigned to traffic duty at the time) and each smoked a cigarette and talked. Krause claimed that Grady at this time told Krause he needed some more arrests that night, so that he was going to check some vacant homes and arrest some \"niggers.\"\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nGrady saw an automobile pass that did not have a taillight. He started his motorcycle and pursued the car, Krause following close behind. Grady stopped the car east of the above intersection. Grady testified that as he approached the car, he believed that the driver fit the description of a man wanted for armed robbery listed on a Milwaukee Police Department daily bulletin. Suddenly the driver's door swung open and the driver jumped out and ran to the north curb of the West Wright Street and then ran east. The runner, Daniel Bell, said nothing and held nothing in his hands. The officers pursued Bell to the intersection of West Wright and North 6th, where Bell ran north on 6th. In the course of the chase both officers yelled \"halt\" and fired several warning shots upward into the air.\n\nKrause commandeered a car proceeding south on 6th Street, ordered it to turn around at the intersection, proceeded north, and picked up Grady. The driver was behind the wheel, Krause in the middle, and Grady next to the door. Both officers had their revolvers in their hands. When the car was just north of the fleeing Daniel Bell, it slowed down and Grady and Krause jumped out of the car. Grady, running ahead of Krause, mounted a snowbank and yelled at the person to stop running. Bell ran toward the house located at 2650 North 6th Street and then toward the southwest corner of the house. As Grady caught up with Bell, he still had his loaded revolver in his right hand. He extended his right hand to grab the fleeing Bell by the right shoulder and as he did so the gun discharged, shooting Bell in the upper back.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nGrady holstered his revolver, took off his glove and felt the outstretched wrist of Daniel Bell and said \"I think he's dead.\" Krause took off his glove and reached with his right hand to the jugular vein on the neck, felt no pulse, and said, \"I guess you're right. He's dead.\" Krause testified at trial that Grady then said, \"He's just a damn nigger kid anyhow.\" Grady denied making the statement.\n\nAt this time a citizen witness, William Hochstaetter, who lived directly across the street and heard the shot, went outside and across the street to where Bell lay on the service walk in the presence of the two Milwaukee police officers. According to his testimony at the coroner's inquest subsequent to the shooting, Hochstaetter looked at the body and observed no knife in Bell's hands. Hochstaetter, after being told by the officers to move on, watched from his window, but his view of Bell's body was obstructed by the two officers leaning over Bell.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nGrady pulled out a small knife from his pocket, but Krause told him \"that knife isn't big enough, Tom.\" Grady closed the knife, placed it back in his jacket pocket, and produced a larger pocket knife. Krause approached the nearby house in order to call the district station. As Krause was waiting at the front door of the house for someone to answer his knock, he saw Grady place the knife in Bell's right hand and close the hand around the knife. Krause was then let into the house, where he used the telephone to call the district station and to report that someone was shot.\n\nAfter Krause returned, he and Grady had a conversation which \"dealt with the story they would tell people in charge, officials, on what happened.\"\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e They decided to say the fleeing person yelled when he jumped out of the automobile, \"You won't catch me, I'm a holdup man!\", and that he was armed with a knife.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nPolice officers and detectives began to arrive within minutes after the shooting. Among those arriving at the scene were defendant Detective Sergeant Edwin Shaffer and uniformed police officers Detectives Russell Vorpagel and Howard Hughes. Shaffer asked Krause \"what happened\" and Krause responded \"Sarge, we shot a guy.\" Shaffer told Krause to go sit in Shaffer's car. Uniformed officers outlined the body in the snow with chalk and the body was removed by a police ambulance crew. Detectives Vorpagel and Hughes talked to Grady, dispatched officers to canvass the neighborhood for witnesses, took measurements, and made a diagram at the scene. The officers recorded the names and addresses of several persons in the area, but no one interviewed that evening saw or heard anything. (William Hochstaetter was not located until later.)\n\nKrause testified that when Shaffer got into the car Shaffer said, \"Louis, I want to know the truth. I want to know exactly what happened here tonight.\" Krause then told him in a general fashion that Grady spotted a car without a taillight and pursued it, a man jumped out of the car and they caught up with him and Grady had shot him. Plaintiffs claim Krause told Shaffer the knife had been planted, but this claim is not supported by Krause's testimony.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Shaffer testified that at no time did Krause tell him Grady had planted the knife; had Krause done so, Shaffer stated he would have taken Grady into custody.\n\nVorpagel testified that at the scene he asked Krause and Grady what had happened, and that Grady responded that he observed a car with a burned-out taillight, he stopped it, a man jumped out of the car and ran away, Krause commandeered a car and picked Grady up, they drove around the block and again saw Bell. When they jumped out of the car and called for Bell to stop, Grady explained that Bell said \"you won't catch me, I'm a hold-up man.\" Grady stated that Bell fit the description of a man wanted for armed robbery as listed on a police daily bulletin, and that Grady shot him as a fleeing felon.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nVorpagel asked Grady how far he was from Bell when he shot him. Vorpagel stated Grady showed him the spot from which he had fired and Vorpagel marked it with a piece of ice. Vorpagel and Hughes then measured the distance from the piece of ice to the spot where the body was outlined and noted the distance to be 23\"-9\".\n\nAt the police \"safety building\" Grady and Krause talked to various police officials and each was told to write a report which, when later typed, was entitled \"Report of Homicide\". Krause was kept separate from Grady as they wrote the reports. Both incorporated in their respective reports the falsification that Daniel Bell emerged from his vehicle with a knife in his right hand, shouting, \"You son of a bitches won't get me, I'm a holdup man.\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Krause's report specified that when \"Grady fired the fatal shot he was about 10\" to 15\" away from the suspect\" (Exhs. 12, 13).Grady's report did not specify the approximate distance; Vorpagel and Hughes, as noted, had measured the distance based on Grady's account as 23\"-9\".\n\nDetectives Vorpagel and Hughes opened a \"homicide offense file,\" completing several reports which reflected Grady's explanation of the incident. Other police officers supplemented the file with reports. Supervisory officers then released the Grady-Krause story to the newspaper reporters.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nSylvia White Bell, Daniel's sister, heard the news of her brother's death on the 10:00 p.m. television news,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e which announced Daniel Bell had wielded a knife, showing \"the knife\". Daniel Bell's knife was sitting in the bathroom in her house. (Daniel resided with his sister at the time.) Sylvia called her brother Patrick, who along with other brothers went to the police safety building. They were brought to an office in the presence of several officers, where a uniformed officer explained the incident and presented the knife. Sylvia responded, \"no, sir he did not have a knife. Here's my brother's knife right here.\" Sylvia testified the officer demanded she give him the knife, but she refused, exclaiming, \"I am not going to give you anything because my brother didn't have a knife in his hand. And he's left-handed anyway\" (Tr. 3245-3252).\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Sylvia testified further that Patrick Bell queried that if Daniel held a knife when he jumped from his car, why didn't Grady shoot him at that point? The officer allegedly responded, \"You can't tell you niggers nothing. Get out of here or I will throw you in jail.\" Patrick and the others then left the building.\n\nPlaintiffs seek to attribute the above comments to defendant Detective Sergeant Shaffer. Though Shaffer testified he was not positive if he spoke with the Bells that evening, Detective Hughes testified that Shaffer probably did speak with them, but all he overheard was one of the Bell male voices saying, \"Oh, you think it's open season, like on rabbits. We are going to start shooting a few of you cops.\" And Sergeant Shaffer was trying to answer their questions\" (Tr. 3544-3545). Hughes also stated that as a detective sergeant, Shaffer wore civilian clothes and not a uniform.\n\nThe morning after the shooting the initial story authored by Grady and Krause began to unravel in the internal investigation. Detective Vorpagel returned to the detective bureau and the office of Inspector of Detectives Glaser, deceased at the time of this action. Inside his office Glaser was meeting with Captain of Detectives Woelfel, also deceased, Shaffer, and Grady. Krause had also arrived, and both Vorpagel and Krause were called in as Shaffer told Grady to sit outside the office. Glaser, reading the various reports said something to the effect that the reports ere not consistent, and that the reports would be reviewed upstairs in District Attorney McCauley's office. (William McCauley is also now deceased).\n\nAccording to his testimony, Vorpagel, on his way to McCauley's office, ran into Chief of Police Johnson outside Johnson's office and told Johnson at this time that Grady had told him the prior night he shot Bell at a distance measured at 23\"-9\". Vorpagel showed Johnson the diagram drawn by Detective Hughes, showing that Grady shot Bell at the distance, then left Johnson and proceeded to McCauley's office.\n\nGrady then joined Johnson in his office before the meeting in McCauley's office. According to Johnson's testimony, he declared, \"I can't understand how you could shoot a man from some distance away as was in Vorpagel's report\" (Tr. 2823). Grady answered, \"No, we were fighting. It was an accident. He was as close as you to me [a foot or two apart]. What's going to happen to me?\" Johnson answered, \"I don't know. There probably will be an inquest into this thing\" (Tr. 2823-2824).\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nGrady then joined McCauley, Inspector of Detectives Glaser, Captain of Detectives Woelfel, Vorpagel, Shaffer, and Krause in McCauley's office. As Vorpagel testified, Grady told McCauley that Bell had slashed at him with a knife and he shot Bell at a distance of approximately six feet. Vorpagel told McCauley that Grady told him the night before that he shot Bell at a distance that was measured to be 23\"-9\", and that Grady never mentioned being slashed at with a knife. And Krause's report the night of the shooting estimated the distance at ten to fifteen feet. McCauley read over the reports and talked to Woelfel. Woelfel gave Vorpagel the reports and said, \"Your reports are not consistent.\" Woelfel told Vorpagel that he should change the reports to include the fact that Grady had been slashed at with a knife. Woelfel also told Vorpagel that his diagram was incorrect, but Vorpagel refused to change it. Woelfel told Vorpagel that he would have to talk to Glaser about it. Glaser told him he should change his report, but Vorpagel refused, since it conflicted with his understanding based on conversations with Grady and Krause the prior night. McCauley reviewed all the reports for approximately 20 minutes and then said, \"These damn reports have to be consistent. I can't do anything with the case like this.\" McCauley then threw the reports down and handed Vorpagel's report back to him stating, \"I want these reports to be consistent.\"\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Vorpagel refused to change his report and the diagram and left the meeting to attend the autopsy of Daniel Bell.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nAfter Vorpagel left, Woelfel and Glaser left soon thereafter, apparently taking with them the police reports. Grady, Krause, and Shaffer remained with McCauley, and newspaper reporters ere allowed into McCauley's office. The interview lasted 356 minutes and was reported the next day, February 4, in the Milwaukee Journal and the Milwaukee Sentinel. The articles reflect the \"modified\" version Grady proffered at the just prior meeting, i.e., that Bell slashed at him with the knife and Grady shot Bell at a distance of approximately six feet. The Sentinel article quotes Grady as stating, \"We were about six feet apart when he turned and lunged at me again with the knife. I stepped back and he turned and started to run again. Then I shot.\" McCauley allegedly told reporters, \"Under the circumstances, I see no reason at present for a coroner's inquest. In my opinion, the officer had a right to shoot.\"\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e These statements were also reported in the Journal article, in which McCauley was reported as saying, \"Grady was in imminent danger of his life or serious injury due to the knife slashing of that man.\" The Journal article extensively reports the conversation in the interview:\n\nGrady told McCauley that when he stopped Bell's car for a broken taillight, Bell slashed at him with what he believed was a knife. Krause, who was approaching the car, said he saw the glint of something which he took to be a knife. Just before Bell started running, Grady said, he yelled: \"You -- won't get me! I'm a holdup man!\"\n\n\"Did you really think this man a holdup man?\" McCauley asked Krause.\n\n\"Yes, sir,\" he replied. \"From his description, from his running, his telling us, I thought he was.\"\n\nGrady said that when he caught up to Bell, Bell lunged at him again with the knife, from about six feet away. Then Bell turned and started to run again, Grady said. The officer said he yelled \"stop,\" then shot Bell.\n\nKrause gave this version: \"The man kinda made a lunge toward Tom. I though he had a knife. I hollered at Tom. Tom pulled his gun. He stepped back a little bit and shot him.\"\n\n\"What made you fearful for Grady's safety?\" McCauley asked. \"By the lunging he [Bell] made,\" Krause said.\n\nKrause said that as Bell lay in the snow \"he had a knife in his hand and that knife was clenched; it looked long at the time.\"\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThe Journal article also quotes from the Grady and Krause reports written the night of the shooting, noting that \"no mention of Bell's slashing at Grady with a knife was made in written reports by Grady and Krause shortly after the shooting. McCauley said he did not have the written reports [in the interview].\" The article states that McCauley did mention that another potential witness had surfaced, and \"if this fellow's story is different, I'll order a coroner's inquest.\"\n\nVorpagel, after attending the autopsy, was sent by Woelfel to see \"Em\", a victim of a holdup which had occurred two days earlier. Woelfel told Vorpagel to buy Em several drinks and bring her down to see if she could identify Daniel Bell as the man who held her up. Vorpagel visited Em, did not endeavor to buy her drinks, and brought her to the morgue, where she could not identify the body (Tr. 2338-2341). No other recent holdup victim positively identified Bell's body.\n\nAdditional reports authored by Grady and Krause surfaced. Dated February 2, it is unclear when they were written. Defendants claim these reports, each with the title \"Attempted Aggravated Battery\", i.e., against Officer Grady, were written the night of the shooting. Plaintiffs claim they were written after the interview with reporters February 3.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e These reports reflect the modified version of the incident Grady offered at the February 3 meeting in McCauley's office which conflicts with the version offered in the homicide reports. Grady's report states, \"As we approached the wanted man at 2650 North 6th Street the man made a threatening motion at me with the knife in his right hand when I ordered him to stop. At that time I shot\" (Exh. 14). Krause's report provides, \"When we approached the man at 2650 North 6th Street he made another desperate lunge towards Patm. Grady and still with the knife clinched in his hand. Patm. Grady then backed up and fired a shot at him after ordering him to stop\" (Exh. 11). Both reports also state that when Bell leaped from the car, he slashed at Grady with the knife.\n\nThese \"attempted aggravated battery\" reports were not offered to the press until Wednesday, February 5. A Milwaukee Journal article printed that day\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e noted this fact, and that two days earlier when the press asked the detective bureau if there were other reports, the only reports offered to the press were the \"homicide\" reports written by Grady and Krause. According to the article, Shaffer Wednesday refused to permit a reporter to copy the attempted aggravated battery reports verbatim although the reporter had been permitted to copy the \"homicide\" reports. Chief of Police Johnson is reported as saying that originally the incident was \"written up\" as a homicide, but \"I noticed there was more to it and asked for another report, and they provided it.\"\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Johnson allegedly said the two reports were necessary because there were \"two incidents involved, Bell's death and Bell's threats. It appears merely a question of chronological order * * *. It seems there might have been a cart before the horse situation here.\"\n\nTwo new witnesses surfaced Wednesday, February 5, Wesley McCloud and Edward Hammond. In an interview with McCauley they said they did not see Daniel Bell threaten Grady with a knife at the death scene. As reported in the February 5 Journal article, McCauley stated, \"There are variances in the stories between these witnesses and both vary with the police version. I want these witnesses under oath. Under the circumstances, I'm going to ask for an inquest.\"\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nDetective Sergeant Shaffer wrote a memorandum to McCauley dated February 10, entitled \"Police Witnesses: Attempted Aggravated Battery upon Patrolman Thomas Grady.\" The memorandum outlines the shooting as described by Grady at the February 3 McCauley meeting, i.e., that \"Bell slashed at Grady a second time in front of [2650 North 6th Street] and Grady drew his gun and shot Bell * * *.\" The four and one-half page memorandum also lists the police officers who were present at the scene and potential witnesses located in the investigation, and very briefly outlines their statements. No mention is made of the initial indication that Bell did not slash at Grady, and that Grady shot Bell at a distance of 23\"-9\" or possibly, according to Krause, ten to fifteen feet.\n\nThe autopsy had been conducted by the Milwaukee County Medical Examiner, Dr. Van Hecke, in the company of his deputy, Joseph LaMonte, and Detective Vorpagel. The autopsy report, issued on February 13, impugned the credibility of the six-foot shooting distance claim in the Grady-Krause story as modified in the morning after the killing. The report stated that it was Dr. Van Hecke's opinion that, based upon the powder markings on Daniel Bell's coat, the muzzle of Grady's gun was held within several inches of Bell at the time of discharge. Johnson denied receiving this report but admitted meeting with McCauley to discuss the results.\n\nThe inquest into the death of Daniel Bell was held on February 14, 1958. Witnesses were summoned by the medical examiner by subpoena and examined by District Attorney McCauley and Deputy Medical Examiner LaMonte. Police personnel testifying at the inquest in addition to Grady and Krause were Officers Nelson, Demke, Randa, Bucholtz, Hauke and Timm, who had arrived at the scene after the shooting, as well as Shaffer, Vorpagel and Hughes, the investigating detectives. In addition to the police witnesses, all of the civilian witnesses whose existence was known were called to testify at the inquest, namely, Eugene Bradshaw, Wesley McCloud, Jr., Fanny Mae Boss, Anna Mae Hardman, Charles W. Avery, Edward Hammond, and William Hochstaetter. Also testifying were John L. Warnette, who on February 6 drew a scale drawing of the shooting scene, Charles M. Wilson, Superintendent of the Wisconsin Crime Lab, and Dr. Van Hecke. Attorneys representing the Bell family were also present, along with Daniel's brothers Joseph and Walter Bell and sister Sylvia White Bell.\n\nGrady once again amended his explanation of the shooting, again reducing the estimated distance at which he shot Bell, this time to conform with the autopsy report. Grady testified that when he shot Bell, \"we were very close, [Bell] maybe inches away from the end of the gun * * *.Without directly disclosing all the inconsistencies in Grady's prior statements, McCauley at least raised the issue:\n\nQ Do you know a detective by the name of Vorpagel?\n\nA I do.\n\nQ Did you point out to him where you were standing when you shot Mr. Bell?\n\nA I don't believe I did.\n\nQ What? Well, you heard his testimony.\n\nA There must have been some confusion because where I showed him that was where I got out of the car, the commandeered car.\n\nQ Well, you have heard Mr. Vorpagel say that he put a block of ice, I believe it was, at the point where you said you shot -- did he do that?\n\nA He may have put a block of ice there but that was where we got out of the car, that wasn't where I shot from.\n\nQ Are you sure that that shooting took place as you were descending from the snowbank?\n\nA I am.\n\nQ I took a statement from you, didn't I?\n\nA Yes.\n\nQ I asked you how far Bell was from you when he knifed at you the last time, do you remember that?\n\nA I do.\n\nQ And what did you say?\n\nA Isaid six feet, but since that time I have had a chance to go back and check the scene where it was and I realize that he was actually much closer than six feet.\n\nQ You did say six feet at that time --\n\nA I did say but --\n\nQ --now you say that you were practically on top of him or he was close enough to slice at you with his arm outstretched?\n\nA That's correct.\n\nQ But he did not hit you?\n\nA No, sir.\n\nQ Did he come close?\n\nA Very close.\n\nQ By the way, this Exhibit No. 2 -- do you recognize that knife?\n\nA I do.\n\nQ And what knife is that?\n\nA That is the knife that Mr. Bell had in his hand when he attempted to cut me.\n\nQ Are you sure he tried to do it twice?\n\nA I am.\n\nQ How long are your arms, do you know -- what size shirt do you wear?\n\nA About a thirty-three.\n\nMr. LaMonte:\n\nQ That would be your shirt length, not necessarily your arm.\n\nA No, my hand would be another seven, eight inches.\n\nMr. McCauley:\n\nQ That shirt you are wearing now, is that a thirty-three?\n\nA That is right.\n\nQ Were you close enough to him to tackle him or tussle with him?\n\nA Probable [sic] so but I was scared to with a man with a knife in his hand. It was instantaneous, it all happened very fast, almost spontaneously.\n\nMr. McCauley: That's all, Officer.\n\nMr. LaMonte:\n\nQ Any questions by the Jury?\n\nA (None).\n\n(Inquest testimony at 165-167).\n\nGrady also testified that Bell shouted, \"You sons of a bitch aren't taking me, I'm a holdup man,\" and that Bell's color, build, and clothing fitted the description of a felon wanted by the Milwaukee Police Department as noted in the police bulletin.\n\nKrause testified similarly, stating that Grady was four or five feet from Bell at the time of the fatal shot, but the revolver was much closer by virtue of grady's outstretched arm. McCauley did not raise Krause's prior \"homicide\" report, which stated Grady shot Bell at a distance of ten to fifteen feet.\n\nVorpagel testified that he measured the distance from where Daniel Bell's head was marked on the sidewalk to where Grady told him he was standing when he stated he had shot Bell, and found the distance to be 23\"-9\".\n\nShaffer testified that on the night of the shooting Grady told him that Bell announced himself as a \"holdup man\" and that Grady believed him to be a fleeing felon. Shaffer also testified that Grady told him at the police safety building that night that Bell slashed at Grady just before Grady shot Bell, at a distance of six feet, and that Grady's arm was extended.\n\nOther police witnesses testified that upon arriving at the scene they saw the knife in Bell's hand. Of the civilian witnesses who testified, the testimony of Wesley McCloud, Edward Hammond, and William Hochstaetter was potentially the most crucial. McCloud was not asked if he saw a knife in Bell's hand. Hammond testified that Bell did not swing or lunge at Grady. Hochstaetter testified that he heard the fatal shot and saw the body of Daniel Bell immediately thereafter with Bell's hands outstretched but saw nothing in Bell's hands. McCauley and LaMonte subjected McCloud, Hammond, and Hochstaetter to the most stringent questioning of the inquest, delving into collateral matters in an attempt to discredit their testimony.\n\nFinally, Dr. Van Hecke and Charles M. Wilson testified to the substance of the autopsy report, i.e., that the muzzle of Grady's revolver was approximately one inch from Bell's topcoat when the revolver discharged.\n\nThe inquest jury returned a verdict that the killing was justifiable. Grady resigned from the Milwaukee Police Department on November 10 of the same year.\n\nJudicial Proceedings\n\nDaniel Bell's father Dolphus left his home in Louisiana to join many of Daniel's siblings residing in Milwaukee and to expose the truth and seek redress for his son's death. On August 10, 1959, Dolphus Bell filed a claim with the City of Milwaukee, requesting $18,125 in damages for the wrongful death of his son. After that claim was denied by the City, Dolphus Bell commenced an action in Milwaukee County Circuit Court on February 1, 1960, for wrongful death and idemnification against Grady and the City of Milwaukee. Dolphus Bell sought $18,125 in damages, the maximum statutory wrongful death recovery at the time.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The defendants resisted the action on the basis of Grady's false self-defense representations made during the investigation. Defendants' answer states, inter alia, that Bell exclaimed he was a \"holdup man,\" Bell lunged at Grady with a knife, and that the shooting was in self-defense (exh. 508).\n\nAfter a mistrial, Dolphus Bell's state court action was reassigned for trial to Judge Robert L. Landry, who urged the parties to settle. Defendants offered $1,800, and, when asked in court by Judge Landry whether he would accept the sum, plaintiff stated he was so willing (but he never signed a settlement agreement). The case was dismissed on the merits. Subsequently Dolphus Bell refused to accept the settlement check and the money was paid into court, where it remained until Novemer 5, 1965, when it was returned to the City.\n\nDaniel Bell's brother Henry testified that Dolphus returned to Louisiana a broken man, believing the truth would one day surface to vindicate his son. Dolphus Bell died in 1962.\n\nIn 1978 Krause went to successor District Attorney E. Michael McCann and revealed that he and Grady had lied about what occurred during the Bell shooting in 1958. He stated that Bell had made no lunge with a knife toward Grady at any time and that the knife found in Bell's hand was planted by Grady. A wiretap was arranged and Krause engaged Grady in conversation over the telephone on December 1, 2, and 6, 1978. In the conversations Grady admitted planting the knife and maintained the shooting was accidental.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nOn August 29, 1979 Thomas Grady pleaded guilty to homicide by reckless conduct and perjury in connection with the Daniel Bell inquest. He was sentenced to seven years' imprisonment, and was paroled after three years.\n\nThe present action was commenced in October 1979 by Daniel's sister and eleven brothers on behalf of themselves, the estate of Daniel Bell, and the estate of Dolphus Bell, brother Patrick Bell, Sr. acting as special administrator of the two estates. Named as defendants in addition to Grady were the City of Milwaukee, former Police Chief Johnson, and former Detective Sergeant Shaffer. Plaintiffs also attempted to name and hold liable Milwaukee County and the \"Office of Milwaukee County District Attorney\" for the actions of the deceased former District Attorney McCauley. These latter claims were ultimately unsuccessful and are discussed infra.\n\nPlaintiffs based their claims upon the federal civil rights statutes 42 U.S.C. §§ 1981, 1983, 1985, and 1986. The claims can be broken down as follows. First, (a) Daniel Bell's Fourth and Fourteenth Amendment rights were violated in the excessive use of force by Grady in the chase, and (b) his Fourteenth Amendment rights were violated in the unlawful killing. Plaintiffs assert that Section 1983 entitles his estate to recover damages arising from the excessive use of force and the deprivation of life without due process, perpetrated under color of state law. Second, the Fourteenth Amendment rights of Daniel's father Dolphus Bell were infringed by the unlawful killing; specifically, the father allegedly possessed a constitutionally protected liberty interest in the continued association of his child. Where this relationship is interferred with absent due process, under color of state law, plaintiffs contend that Section 1983 allows for damages to be recovered for the injury. Third, Daniel's siblings proffer a Fourteenth Amendment theory similar to that of the father's estate, i.e., that the Fourteenth Amendment and Section 1983 protect the associational relationship of siblings. The type of damages allegedly incurred by the father and siblings is loss of society and companionship--plaintiffs claim no pecuniary injury (other than $670 for the funeral expenses of Daniel Bell). Fourth, the estate of Dolphus Bell and the siblings allege that (a) defendants Grady, Johnson, Shaffer, and others conspired to conceal the facts of the shooting and killing, (b) the conspiracy interfered with their ability to pursue their claims against Grady and the City arising from the killing, (c) such conspiratorial interference deprived them of their due process and equal protection rights, and (d) these deprivations and the concomitant pain, humiliation, and frustration are compensable under Sections 1981, 1983, 19985, and 1986.\n\nThe defendants filed a motion to dismiss on the primary grounds that: (1) under Wisconsin law, which they contend applies; the claims of Daniel Bell's estate did not survive his death, (2) all claims are barred by the three-year or six-year Wisconsin statute of limitations, and (3) the siblings do not state cognizable claims under the federal civil rights statutes. The district court, Chief Judge Reynolds of the Eastern District of Wisconsin, rejected defendants' arguments and therefore denied their motion to dismiss the complaint. Bell v. City of Milwaukee, 498 F. Supp. 1339 (E.D. Wis. 1980) (\"Bell I\").\n\nSubsequently defendants filed an answer and a motion for summary judgment, again raising the statute of limitations defense, along with the argument that the 1960 state court action filed by Dolphus Bell precluded the present action. The district court denied defendants' motion, finding no res judicata effect and once more rejecting the statute of limitations argument. Bell v. City of Milwaukee, 514 F. Supp. 1363 (E.D. Wis. 1981) (\"Bell II\"). These arguments are addressed more extensively infra.\n\nThe trial extended over ten weeks from October through December 1981. As outlined above, substantial testimony was heard from Grady, Krause, Johnson, Shaffer, Vorpagel, Hughes, and Henry Kasza, all members of the Milwaukee Police Department at the time of the shooting. Daniel Bell's brother and sister Henry Bell and Sylvia White Bell testified as to the pain and humiliation suffered by the Bell family as a result of the killing and the alleged conspiracy to distort and conceal the facts of the killing, as well as the loss of society and companionship of Daniel Bell suffered by the siblings and their father before his death. Numerous exhibits were received in evidence, including the police reports, newspaper articles, inquest testimony, and documents arising from Krause's confession in 1978 and Grady's conviction in 1979.\n\nAt trial defendants raised several legal theories which would either nullify plaintiffs' action or limit the amount of recover the jury could award in the special verdict. These theories included:\n\n(1) Wisconsin statute of limitations defense.\n\n(2) Res judicata defense.\n\n(3) Wis. Stat. § 895.01, the Wisconsin survival statute, cannot be construed to allow Dolphus Bell's claims to survive his death.\n\n(4) If Dolphus Bell's claims do survive his death, Wis. Stat. § 895.04, the Wisconsin wrongful death statute, applies, limiting his estate's maximum recovery to $25,000 for loss of society and companionship.\n\n(5) Wis. Stat. § 895.04, which limits siblings' recovery to pecuniary injury and disallows recover to the victim's estate, applies in this action, precluding recover to the estate of Daniel Bell for loss of life and to the siblings for the loss of society and companionship of Daniel Bell.\n\n(6) Wis. Stat. § 895.04 which does not provide for punitive damages precludes punitive damage recovery for the death of Daniel Bell.\n\nThe district court rejected defendants' arguments at trial, and again in ruling upon defendants' post-verdict motions. See Bell v. City of Milwaukee, 536 F. Supp. 462 (E.D. Wis. 1982) (\"Bell III\"). The court submitted special verdict questions to the jury allowing the jury to award damages under any and all of plaintiffs' four primary theories. They jury found the following:\n\n(1) Although Grady did not violate Daniel Bell's rights to the chase, Grady violated Daniel Bell's constitutional rights by shooting and killing him. The jury awarded the estate $100,000 in compensatory damages and $25,000 in punitive damages.\n\n(2) The estate of Dolphus Bell was awarded $75,000 for the loss of society and companionship of Daniel Bell (plus $670 in funeral expenses).\n\n(3) The eleven brothers and one sister were awarded a total of $100,000 for the loss of society and companionship of Daniel Bell.\n\n(4) Defendants Johnson and Shaffer, along with non-defendants Woelfel, Glaser, and McCauley, participated with Grady and Krause in a conspiracy to cover up the facts of the shooting and killing of Daniel Bell. (The court directed a verdict that Grady and Krause conspired to cover up the facts.) The jury found that the race of Daniel Bell was an operative factor in the conspiracy, and that as a result of the conspiracy Dolphus Bell and Daniel Bell's siblings were deprived of due process of law and \"racial equality.\" The jury awarded the estate of Dolphus Bell $75,000 for deprivation of due process and $150,000 for deprivation of racial equality; and to the siblings a total of $240,000 and $300,000, respectively. In addition, the jury assessed the amount of punitive damages appropriate to each conspirator: Grady ($25,000), Johnson ($150,000), Shaffer ($350,000), Woelfel ($75,000), and Glaser ($100,000).\n\nThe court struck the punitive damages assessed against non-parties Captain of Detectives Woelfel and Inspector of Detectives Glaser, and in ruling upon the post-verdict motions upheld the remainder of the jury verdict in the aggregate amount of $1,590,670, for which the City is obligated as indemnitor under Wisconsin law.\n\nDefendants raise several issues on appeal. They raise the above-stated six contentions regarding the application of Wisconsin law to this action, except that regarding (3), they dispute only the survivability of Dolphus Bell's claim arising from Daniel's death, not the concealment conspiracy claim. In regard to the jury finding of conspiracy, defendants conceded Grady and Krause lied extensively but deny any racially-motivated conspiracy was formed or that any rights of plaintiffs were infringed. They specifically challenge the sufficiency of the evidence liking Johnson and Shaffer to the alleged conspiracy and contend the compensatory and punitive damages awarded for the conspiracy are unsupported by the evidence. Grady raises three additional evidentiary issues: (1) whether the district court erred in admitting the criminal complaint against Grady leading to his 1979 conviction of perjury and homicide by reckless conduct; (2) whether the district court erred in admitting and allowing cross-examination upon a 1979 memorandum relating the discussion between retired Police Sergeant Henry Kasza and Investigator Joseph Rogers; and (3) whether the jury should have been informed of the duration of Grady's prison sentence.\n\nThe plaintiffs' cross-appeal raised three arguments: (1) the jury verdict that Grady did not use excessive force in chasing Bell is incorrect as a matter of law; (2) the City of Milwaukee is liable for the punitive damages assessed against Woelfel and Glaser; and (3) Milwaukee County is responsible for the conduct of former District Attorney McCauley.\n\nThe parties also filed motions to strike certain portions of opposing briefs, and the plaintiffs filed a motion to strike an amicus curiae brief\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e submitted by the National Institute of Municipal Law Officers as untimely. We have carefully reviewed these motions and find them without merit, and they are hereby denied. Other subsidiary issues are raised by the parties, which we have considered but do not discuss except when non-frivolous.\n\nII. EFFECT OF THE 1961 SETTLEMENT OF PRIOR STATE SUIT\n\nDefendants argue that this action is barred by res judicata on the basis of the wrongful death action instituted in 1960 by Dolphus Bell in Milwaukee County Circuit Court against Grady and the City of Milwaukee. The record indicates that in October 1961 Dolphus Bell stated in court he would accept the $1,800 settlement offer, and an oral stipulation for dismissal of the action upon the merits was entered into by the attorneys in the presence of the parties and Judge Landry. The oral stipulation for dismissal was reduced in writing and was presented to Dolphus Bell for his signature as a condition for payment of the settlement. Dolphus Bell refused to sign the release. Dolphus Bell's attorney Max Raskin moved for an order to show cause why the defendants should not deposit with the court clerk the $1,800 and why Raskin should not receive his attorney fees out of this sum. On November 21, 1961, Judge Landry ordered that the settlement be disbursed in part to Raskin, in part to Milwaukee County (which had attached part of the settlement for payment of Dolphus Bell's medical bills), and the remainder to Dolphus Bell. Judge Landry also approved the stipulation and order for dismissal of the action with prejudice signed by the attorneys. Dolphus Bell did not sign and refused to endorse his settlement check which was returned to the City of Milwaukee treasury.\n\nIn the instant action the defendants raised the prior settlement/res judicata argument on their motion for summary judgment. The district court pursuant to Fed. R. Civ. P. 56(d) viewed defendants' factual contentions as existing without substantial controversy and accepted them as true, namely, that Dolphus Bell had entered into a binding settlement agreement with Grady and the City of Milwaukee. Notwithstanding this factual finding, the court ruled that res judicata could not be applied to this action, at least on a motion for summary judgment, since the record was \"replete with allegations of fraud, concealment and a broad-based cover-up on the part of the defendants Milwaukee Police Department, Howard Johnson, Edwin Shaffer, Thomas Grady, and the Office of the Milwaukee County District Attorney.\" Bell II, 514 F. Supp. 1363, 1368-1369.\n\nIn ruling upon post-verdict motions, the district court reaffirmed its denial of defendants' motion of summary judgment, observing that:\n\n[T]he fraud in this case is sufficient to nullify an otherwise valid settlement and dismissal. This is not a case in which the defendant simply lied and thereby made the plaintiff's proof of his case difficult. Rather, this is a case of massive conspiracy by high ranking Milwaukee officials to prevent the disclosure of the true facts of the shooting of Daniel Bell. Given the monopoly on force held by the government, this conspiracy prevented the proper functioning of the judicial system.\n\nBell III, 536 F. Supp. 462, 465-466.\n\nAlong with the defendants' post-verdict motions, plaintiffs moved for an evidentiary hearing to consider the district court's earlier finding that Dolphus Bell had entered into a valid settlement of the state court action. The court denied plaintiffs' motion. Since the jury by its special verdict had found the allegations of fraud, concealment, and a broad-based cover-up to be true, the court held that the earlier action did not bar the instant action regardless of whether the earlier settlement was an effective and binding one.\n\nDefendants on appeal again contend that the 1961 settlement precludes this action. We reject this contention and affirm the rulings of the district court.\n\nFederal courts are ordinarily obligated to give full faith and credit to judicial proceedings in state courts of competent jurisdiction and to apply the concepts of res judicata and collateral estoppel which would be employed by the courts of the state in which a proper judgment was rendered. See 28 U.S.C. § 1738; Migra v. Warren City School District Board of Education, 465 U.S. 75, 104 S. Ct. 892, 79 L. Ed. 2d 56 ; Winters v. Lavine, 574 F.2d 46 (2d Cir. 1978). This principle clearly applies in instances where a federal Section 1983 action is brought subsequent to an action in state court based on the same set of operative facts. Migra, supra; Allen v. McCurry, 449 U.S. 90, 66 L. Ed. 2d 308, 101 S. Ct. 411 . The present Section 1983 action is based upon the same factual happening as the 1960 wrongful death action, although many of the operative facts were concealed at the time of the earlier action. In Wisconsin, a state court judgment has no binding effect in subsequent litigation where the plaintiff proposes to rely on evidence that he or she was unable or failed to present in the first action on account of the defendant's fraud or concealment. See, e.g., Hammes v. First National Bank \u0026 Trust, 79 Wis. 2d 355, 363, 255 N.W.2d 555, 559-560 (1977); see also Restatement (Second) of Judgments § 70(1)(b) (1981). The district court applied Hammes and therefore held that the 1961 purported settlement which was entered upon the dismissal of the action on the merits did not bar this subsequent action.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nThe policy of Hammes applies in this case notwithstanding defendants' argument that the Bell family and their attorneys knew from the very beginning that the police must have been lying and covering up the true circumstances of the shooting. The depositions and testimony of Daniel Bell's siblings and the Bell family's attorneys certainly support the proposition that at the time of the state court action they believed Daniel Bell was innocent of any wrongdoing and that the police had lied. But the Bell family, with their beliefs alone, were deprived of a fair opportunity to seek redress by virtue of defendants' fraudulent concealment of facts crucial to the fair disposition of the dispute. Not only did Grady and others cover up what actually happened the night of the shooting, but, according to the testimony of Sylvia White Bell, when some members of the Bell family went to the police that night for an explanation, they were told \"niggers get out of here,\" or be jailed. At the coroner's inquest, conducted as a non-adversarial proceeding without opportunity for cross-examination, Bell family questions were largely ignored.\n\nIn the 1960 tort action, the City and Grady defended the action on the basis of Grady's false representations made during the investigation of the shooting. Defendants' answer there states, inter alia, that Bell announced himself as a \"holdup man,\" Bell lunged at Grady with a knife, and that the shooting was in self-defense (Exh. 508). Moreover, the record indicates that the 1961 settlement offer by the City of Milwaukee was made before any discovery was obtained by Dolphus Bell. Defendants at oral argument stated that Dolphus Bell and his attorney did not seek any discovery in the 1960 action. Even assuming this contention to be true, defendants have not established that would have obtained sufficient documentary and testimonial evidence to overcome the inquest finding of justifiable homicide, a finding facilitated by perjured testimony and the biased examination tack of District Attorney McCauley and Deputy Medical Examiner LaMonte. It was not until Officer Krause came forward in 1978 and revealed the true circumstances that plaintiffs could fairly present their case. Thus regardless of whether the settlement was valid when allegedly entered into, it cannot be used to preclude future claims and in so doing redound to the benefit of defendants.\n\nOf course, there has been a dramatic change in civil rights recovery over the last 25 years which has an ironic impact on the result in this case. At the time of the Bell shooting, just prior to Monroe v. Pape, 365 U.S. 167, 5 L. Ed. 2d 492, 81 S. Ct. 473, a civil rights plaintiff was required to prove that the defendant acted with a specific intent to deny plaintiff his or her constitutional rights, a difficult showing indeed. Moreover, it was not until Terry v. Kolski, 78 Wis. 2d 475, 254 N.W.2d 704 (1977), that the Wisconsin Supreme Court explicitly opened the door to Section 1983 plaintiffs.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Limited to the Wisconsin wrongful death statute and a maximum potential state court recovery of $18,125, Dolphus Bell would have had a difficult time establishing the $15,000 component of pecuniary injury, for the record does not indicate that Dolphus Bell was financially dependent upon his son Daniel. Defendants argue unpersuasively that plaintiffs should not now enjoy the evolved civil rights doctrine. Ironically, the efforts of Grady and others to conceal the facts surrounding the shooting make the expanded civil rights recover available to plaintiffs.\n\nEven if the 1961 settlement and dismissal on the merits were given preclusive effect and it were held that Dolphus Bell could or should have raised civil rights claims on behalf of himself and Daniel Bell's estate in 1960, much of the present action would not be barred. Clearly a civil rights claim would lie for damages arising from defendants' acts of concealment continuing past the prior action. Additionally, it is likely that in any event all claims of Daniel Bell's siblings would not be barred since, although the siblings were extensively involved in assisting Dolphus Bell in the first action, they were not actual plaintiffs; nor have defendants established that defensive collateral estoppel should be applied to bar the siblings' claims.\n\nIII. STATUTE OF LIMITATIONS DEFENSE\n\nThe defendants argue that this action is barred by either the three- or six-year Wisconsin statute of limitations in Section 1983 actions, state statutes of limitations apply unless inconsistent with federal policy. 42 U.S.C. § 1988, discussed infra; Chardon v. Soto, 462 U.S. 650, 103 S. Ct. 2611, 77 L. Ed. 2d 74 ; Board of Regents v. Tomanio, 446 U.S. 478, 484, 64 L. Ed. 2d 440, 100 S. Ct. 1790 . Wis. Stat. § 893.54 (1983) states that an action brought to recover damages for death caused by the wrongful act of another must be brought within three years. Wis. Stat. § 893.93 (1983) states that an action upon a liability created by statute when a different limitation is not prescribed by law must be brought within six years.\n\nThe success of plaintiffs' claims is unaffected by whether Section 893.93 versus Section 893.54 is applied. The crucial issue, at least in regard to the Section 1983 claims, is whether Wisconsin statutes of limitations apply at all. Regarding the conspiracy claims, the district court found the conspiracy to continue as late as 1978, when Krause revealed the cover-up to the district attorney, and this finding is amply supported by the record. Since this action was filed in 1979, the conspiracy claim was filed less than two years after accrual and thus is not barred by either statute of limitations. And for the reasons discussed below, neither statute can be applied to bar the Section 1983 claims.\n\nThe district court first rejected defendants' statute of limitations argument in ruling on defendants' motion to dismiss. The court held:\n\nUnder Wisconsin law, a defendant is estopped from pleading the statute of limitations where his own fraudulent conduct has prevented the plaintiff from filing suit within the applicable time period. Boehm v. Wheeler, 65 Wis. 2d 668, 681, 223 N.W.2d 536 (1974). In this case, plaintiffs have alleged that the defendants intentionally concealed the trust facts concerning the death of Daniel Bell, thereby preventing them from obtaining the knowledge necessary to institute this lawsuit. Only when Louis Krause went to the authorities in August, 1978, were the true facts known. If the jury finds these allegations to be true, the defendants will be estopped from arguing that the claims against them are time barred. At this stage of the proceedings, of course, the allegations of fraudulent concealment must be taken as true. Accordingly, the amended complaint may not be dismissed on the ground that the statute of limitations has expired.\n\nBell I, 498 F. Supp. 1339, 1343-1344.\n\nSubsequently, in defendants' motion for summary judgment they opposed the tolling of either Wisconsin statute of limitations by application of the doctrine of estoppel by fraudulent concealment. The defendants construed Boehm v. Wheeler, 65 Wis. 2d 668, 223 N.W.2d 536 (1974), in their favor. The Wisconsin Supreme Court in Boehm stated:\n\nThis court has recognized that a defendant may in the proper case be estopped from asserting the statute of limitations because of fraudulent conduct. State ex rel. Susedik v. Knutson, 52 Wis. 2d 593, 191 N.W.2d 23 (1971). In that case the court enumerated the following rules to be applied in determining whether the defendant should be estopped from asserting the statute of limitations.\n\n(1) The doctrine of estoppel may be applied to preclude a defendant from asserting the statute of limitations when he has been guilty of fraudulent or inequitable conduct;\n\n(2) the aggrieved party must have failed to commence an action within the statutory period because of reliance upon the representation or acts of the defendant;\n\n(3) the acts, promises or representations must have occurred before the expiration of the limitation period;\n\n(4) after the inducement for delay has ceased to operate the aggrieved party may not unreasonably delay;\n\n(5) affirmative conduct of the defendant may be equivalent to a representation upon which the plaintiff may rely to his disadvantage; and\n\n(6) actual fraud, in a technical sense, is not required.\n\nBoehm v. Wheeler, 65 Wis.2d at 681, 223 N.W.2d at 542.\n\nThe defendants in their motion for summary judgment contended that plaintiffs cannot invoke the doctrine of estoppel by fraudulent concealment to toll the statute of limitations on the ground that plaintiffs do not satisfy the second rule articulated in Boehm, since the record shows that Bell family members did not believe or rely upon the reports and testimony pertaining to the shooting of Daniel Bell and that plaintiffs did not fail to commence an action within the statutory period.\n\nThe district court, interpreting Wisconsin law and the policy underlying the doctrine of estoppel by fraudulent concealment, rejected defendants' argument. Chief Judge Reynolds' interpretation is persuasive wherein he commented:\n\nFirst, the Court is not persuaded that the plaintiffs have failed to meet the requirements enumerated in Boehm. With respect to the defendants' contention that the plaintiffs did not fail to commence an action within the statutory time period, while it is true that Dock [Dolphus] Bell filed a state court action for wrongful death and indemnification, the fact remains that the plaintiffs have alleged that the defendants intentionally concealed the true facts concerning the death of Daniel Bell, thereby preventing them from obtaining the knowledge necessary to institute a lawsuit for the violation of their civil rights. Thus, the plaintiffs have alleged that they failed to commence an action within the statutory period. With respect to the defendants' contention that the plaintiffs did not believe or rely on the reports and testimony concerning the shooting of Daniel Bell, while it is true that the plaintiffs had their doubts concerning such reports and testimony, the fact remains that the plaintiffs have alleged that the defendants caused or permitted the plaintiffs to believe a thing to be true and to act in a manner different than they would have acted. Inaction on the part of the plaintiffs because of what the defendants abstained from doing or saying and what the defendants permitted the plaintiffs to believe as true so closely parallels reliance that any attempt to distinguish the two in the context of this case can amount to no more than semantic legerdemain. It is indeed a subtle notion that the second rule enumerated by the Boehm court speaks to reliance upon what the defendant does or says, while the thrust of this case concerns reliance upon what the defendant abstained from doing or saying, yet to say that Boehm is controlling in the instant case might invite the very intentional concealment alleged to have occurred here. Thus, the plaintiffs' allegations persuade the Court that the defendants conduct was done with the intention or expectation that it would be acted upon by the plaintiffs.\n\nSecond, the Court is not persuaded by the defendants' argument that the six enumerated rules in Boehm constitute the applicable and binding state tolling rule of law, because their interpretation of the Boehm case and the nature and scope of a court's equity powers is exceedingly restrictive. Equitable estoppel, including the doctrine of equitable estoppel by fraudulent concealment, is pre-eminently the creature of equity, recognized by the common law at a very early day. See 3 Pomeroy, Equity Jurisprudence § 802, at 179-81. The doctrine of equitable estoppel was recognized and had its original and far-reaching nature preserved at an early day by Wisconsin courts [citing Union Bank v. Commercial Securities Co., 163 Wis. 470, 157 N.W. 510 (1916)]. That the far-reaching nature of the doctrine of estoppel remains intact after Boehm is demonstrated by that very case. To be sure, after its enumeration of rules intended to demonstrate the propriety of the doctrine of equitable estoppel in the particular case, see State ex rel. Susedik v. Knutson, 52 Wis. 2d 593, 596, 191 N.W.2d 23 (1971), the Boehm court went on to state that the \"* * * issue is whether the conduct and representations of appellant were so unfair and misleading as to outbalance the public's interest in setting a limitation on bringing actions.\" State ex rel. Susedik v. Knuston, supra, page 598, 191 N.W.2d 23.\" Boehm v. Wheeler, 65 Wis.2d 668, 681, 223 N.W.2d 536.\n\nIt is the Court's opinion, then, that the applicable and binding state rule of law on the application of the doctrine of estoppel by fraudulent concealment is not whether each of the six guides enumerated in Boehm is precisely met, but rather is whether the defendants' conduct and representations were so unfair and misleading as to outbalance the public's interest in setting a limitation on an action and thus carve an exception for that action out of the statute of limitations. See State ex rel. Susedik v. Knutson, 52 Wis. 2d 593, 598, 191 N.W.2d 23 (1971).\n\nApplying the above authority to the allegations in this case, it is my opinion that allegations of a broadly based, racially motivated conspiracy by public officials and employees designed to conceal and cover-up the wrongful acts of a City of Milwaukee police officer, if true, are allegations of conduct so unfair, misleading, and outrageous as to outbalance the public's interest [footnote omitted] in setting a limitation on bringing an action and thus carves an exception out of the statute of limitations. See State ex rel. Susedik v. Knutson, 52 Wis. 2d 593, 598, 191 N.W.2d 23 (1971).\n\nBell II, 514 F. Supp. 1363, 1370-1372.\n\nAt trial the jury by its special verdict found that the plaintiffs' allegations that the defendants concealed many of the true facts of the killing were true. As discussed infra, this finding was justified, so that the district court's rejection of the statute of limitations defense is well founded.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nMoreover, one of the primary policies behind statutes of limitations -- to preclude litigation involving lost evidence or distorted testimony of witnesses whose memories have faded -- is not jeopardized by allowing this action. Although McCauley, Woelfel, and Glaser, all potential witnesses as well as defendants, are deceased, extensive testimony as well as defendants, are deceased extensive testimony was heard from Krause, Hughes, Johnson, Saffer, Vorpagel, Grady, members of the Bell family, and other competent witnesses during an extensive ten-week trial. Relevant facts surrounding the shooting and the investigation were well documented in a substantial body of police records. Grady has admitted to Krause and to the district court that he planted the knife in Daniel Bell's hand and that the \"I'm a holdup man\" declaration was false. Finally, statute of limitations concerns posed no barrier to the state's 1979 prosecution of Grady for the reckless homicide and perjury offenses committed in 1958. For these reasons we reject defendants' statute of limitations argument.\n\nIV. BACKGROUND OF SECTIONS 1981, 1983, 1985, 1986 AND 1988 OF THE CIVIL RIGHTS ACTS\n\nWe next discuss the provisions of the Reconstruction period civil rights statutes which are pertinent to the issues raised on appeal. 42 U.S.C. § 1981,\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e which was enacted as Section 1 of the Civil Rights Act of 1866, 14 Stat. 27, protects against discrimination on the basis of race or alienage. Garner v. Giarrusso, 571 F.2d 1330, 1340 (5th Cir. 1978). Section 1981 is not confined to contractual matters, though it is most often invoked in that context. See, e.g., Jones v. Alfred H. Mayer Co., 392 U.S. 409, 20 L. Ed. 2d 1189, 88 S. Ct. 2186 . It deals with the protection of a limited range of civil rights, including the right to make and enforce contracts, to sue, and to give evidence. As the Third Circuit, observed in Hall v. Pennsylvania State Police, 570 F.2d 86, 91 (3d Cir. 1978), \"racially motivated misuse of governmental power\" falls within the ambit of the language of Section 1981 where one of the enunciated rights is denied.\n\n42 U.S.C. § 1983\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e is derived from Section 1 of the Ku Klux Klan Act of 1871, 17 Stat. 13 (the \"Act\"). Generally, Section 1983 creates a cause of action for deprivation of rights secured by the \"Constitution and [federal] laws\" perpetrated under color of state law.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e This rather sketchy provision obviously does not address every issue that may arise in the context of a federal civil rights action. Moor v. County of Alameda, 411, U.S. 693, 702-703. Moreover, as noted in Carey v. Piphus, 435 U.S. 247, 255, 55 L. Ed. 2d 252, 98 S. Ct. 1042, this Section's legislative history is sparse and not very illuminating in determining its exact parameters. For purposes of this action Section 1983 does not provide adequate guidance regarding the survival of claims, who the injured guidance regarding the survival of claims, who the injured parties are when death occurs, and the available measure of damages. It is manifest, however, that Section 1983 was intended to deter, inter alia, officially-condoned lawless conduct directed against newly-freed blacks. See Monroe v. Pape, 365 U.S. 167, 174-175, 5 L. Ed. 2d 492, 81 S. Ct. 473 .\n\n42 U.S.C. § 1985,\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e derived from Section 2 of the 1871 Act, is somewhat more specific, creating a cause of action based on a conspiracy which deprives one of access to justice or equal protection of law. The debates surrounding the passage of the Act expressed concern that conspiratorial and unlawful acts of the Klan went unpunished because Klan members and sympathizers controlled or influenced the administration of state criminal justice. Section 2 was designed to provide civil and criminal remedies in federal court for such conspiratorial activities. Briscoe v. LaHue, 460 U.S. 325, 460 U.S. 325, 103 S. Ct. 1108, 1117-1118, 75 L. Ed. 2d 96 .The current version of Section 1985 creates a federal right of action for damages against conspiracies which deter by force, intimidation, or threat a party or witness in federal court (Section 1985(2), first portion) and against conspiracies which obstruct the due course of justice with intent to deny equal protection (Section 1985(2), second portion). It also creates an action against conspiracies which deprive persons of equal protection or other federal rights or privileges (Section 1985(3)).\n\nTo recover damages under Section 1985(3), plaintiffs must generally establish invidious discrimination, i.e., that the conspiracy was motivated by racial or otherwise classbased\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e animus. Griffin v. Breckenridge, 403 U.S. 88, 100-102, 29 L. Ed. 2d 338, 91 S. Ct. 1790 .And as the Supreme Court held in Kush v. Rutledge, 460 U.S. 719, 460 U.S. 719, 103 S. Ct. 1483, 1488, 75 L. Ed. 2d 413, a showing of discrimination is not required under the first portion of Section 1985(2).\n\nIn addition to Sections 1 and 2 of the Act, codified as Sections 1983 and 1985, respectively, the Act provided a civil penalty against persons who knowingly failed to prevent Section 2 violations, now codified as 42 U.S.C. § 1986.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e 17 Stat. 13 (1871). Section 1986 predicates liability upon (1) knowledge that any of the conspiratorial wrongs are about to be committed, (2) power to prevent or to aid in preventing the commission of those wrongs, (3) neglect to do so, where (4) the wrongful acts were committed, and (5) the wrongful acts could have been prevented by reasonable diligence. A finding of a Section 1985 conspiracy is a necessary prerequisite to a finding of liability under Section 1986. Williams v. St. Joseph Hospital, 629 F.2d 448, 451-452 (7th Cir. 1980); Hamilton v. Chaffin, 506 F.2d 904, 913-914 (5th Cir. 1975).\n\nThe statutory mechanism that authorizes resort to state law to provide enlightenment as to the parameters of actions under these statutes is 42 U.S.C. § 1988\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e which, where the civil rights laws are \"deficient,\" invokes state law unless \"inconsistent with\" the Constitution and federal law. See Robertson v. Wegmann, 436 U.S. 584, 590, 56 L. Ed. 2d 554, 98 S. Ct. 1991 . Thus Section 1988 establishes a three-step process for the selection of the appropriate substantive law in civil rights cases. First, the court must decide whether the civil rights acts are \"deficient\" in furnishing a particular rule. If this inquiry is answered affirmatively, state law is examined to fill the interstices in the federal provisions. Ofter there is no state law directly on point, so that only the provisions most closely analogous to federal civil rights law can be considered. Finally, the state law must be disregarded in favor of the federal law if the state law is inconsistent with the meaning and purpose of federal statutory and constitutional law. See Robertson v. Wegmann, 436 U.S. at 587-590; Heath v. City of Hialeah, 560 F. Supp. 840, 841 (S.D. Fla. 1983). In resolving questions of inconsistency between federal and state law raised under Section 1988, federal statutes and constitutional provisions must of course be considered, but also \"the policies expressed in [them].\" Sullivan v. Little Hunting Park, Inc., 396 U.S. 229, 240, 24 L. Ed. 2d 386, 90 S. Ct. 400 ). Of fundamental importance is whether the application of state law \"would be inconsistent with the federal policy underlying the cause of action * * *.\" Johnson v. Railway Express Agency, Inc., 421 U.S. 454, 465, 44 L. Ed. 2d 295, 95 S. Ct. 1716 .\n\nSince the civil rights acts do not specify the survivability of Section 1983 actions, who the injured parties are when the victim is killed, or the measure of available damages, there must be a reference to state law unless inconsistent with federal law. In regard to the conspiracy claims, state law is relevant only insofar as the survivability of Dolphus Bell's conspiracy claim is concerned, and defendants do not contest the district court's holding that Dolphus Bell's conspiracy claim survives his death.\n\nAlthough the parties vehemently dispute the extent to which state law is inconsistent with the constitutional and Section 1983 policies relevant to this case, no one disputes that Wisconsin law is the only conceivably relevant state law, since the shooting by a Milwaukee police officer occurred in Wisconsin and Daniel Bell, Officer Grady, et al. were Wisconsin residents at the time.\n\nV. SECTION 1983 CLAIM OF DANIEL BELL'S ESTATE\n\nThe district court allowed the plaintiffs to include a special verdict question regarding the violation of Daniel Bell's constitutional rights. The jury found a violation, and awarded $100,000 in damages to the estate of Daniel Bell for the loss of his life and enjoyment thereof. Defendants contend\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e that Wisconsin law does not permit recovery by the estate for the death of Daniel Bell. The district court in ruling upon defendants' post-verdict motions disagreed, holding without explaining that Wis. Stat. § 895.04 allows the personal representative of Daniel Bell's estate to recover for loss of life for the benefit of the estate. The district court also noted that if the Wisconsin wrongful death statute could not be read as allowing the estate to recover, state law would be inconsistent with the deterrent policies of Section 1983 and therefore could not be applied. Bell III, 536 F. Supp. 462, 466-467. While the district court's interpretation of Section 895.04 may be in error, its evaluation of the policies behind Section 1983 in regard to Daniel Bell's estate's claim is correct.\n\nWisconsin survival statute Section 895.01 provides that wrongful death actions survive the death of the victim (as well as the death of the wrongdoer), and wrongful death statute Section 895.04(1) states that \"an action for wrongful death may be brought by the personal representative of the deceased person or by the person to whom the amount recovered belongs.\" What the district court seemingly overlooked, however, is that Wisconsin law does not allow separate recovery for both the estate and the beneficiaries -- the very result obtained below. It is well settled under Sections 895.01 and 895.04, and those Sections' predecessors that recover in a Wisconsin wrongful death action, even if brought in name by the personal representative, cannot include damages for the loss of life itself. The allowed recovery in Wisconsin compensates for the injury to the beneficiaries, within certain statutory recovery limitations discussed infra, and not for the loss of life of the victim. See Prunty v. Schwantes, 40 Wis. 2d 418, 162 N.W.2d 34 (1968); In re Arneberg's Estate, 184 Wis. 570, 200 N.W. 557 (1924); Gores v. Graff, 77 Wis. 174, 46 N.W. 48 (1890).\n\nAlthough the personal representative is entitled to bring an action pursuant to Section 895.04(1), allowing the beneficiaries or the representative to file the claim is merely a statutory measure of procedural flexibility. The prior version of the Wisconsin wrongful death statute allowed only the personal representative to commence the action for the beneficiaries' recovery, and this limited procedure frequently worked to the detriment of the beneficiaries. See Swanson v. State Farm Mutual Automobile Insurance Co., 264 Wis. 274, 278, 58 N.W.2d 664, 666 (1953). If the personal representatives pursues the recovery, the representative \"acts as agent of the persons for whose benefit the action is brought and such agent does not acquire legal title or any interest in the recovery excepting for his fees and expenses * * *.\" Nichols v. United States Fidelity \u0026 Guaranty Co., 13 Wis. 2d 491, 496, 109 N.W.2d 131, 134 (1961) (construing Section 331.04(1), the equivalent provision antedating Section 895.04(1)). See also Prunty v. Schwantes, 40 Wis.2d at 422, 162 N.W.2d at 37 (\"[e]ven when the personal representative brings the action, the damages accrue to the relatives\"). If both the personal representative and the beneficiaries bring separate actions, the two actions are consolidated pursuant to Wis. Stat. § 895.04(3).\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nThe policy behind this rule is that \"the cause of action belongs to the beneficiary * * *.\" Nichols, supra, 13 Wis.2d at 497, 109 N.W.2d at 135. As stated in Prunty v. Schwantes, 40 Wis.2d at 424-425, 162 N.W.2d at 38-39, \"After a person dies, he can no longer be compensated * * * [O]ur legislature has decided that the survivors of the deceased are the ones that should be compensated * * *.\" The rationale implicit in the Wisconsin rule is that the victim once deceased cannot practicably be compensated for the loss of life to be made whole. Thus if the particular compensation policy embodied in Wisconsin wrongful death law were to be applied, Daniel Bell's estate could not raise a claim for loss of life.\n\nThough damages for loss of life are not recoverable by Daniel Bell's estate under Wisconsin law, Wis. Stat. § 895.01 allows the estate to recover for injuries suffered by Daniel Bell prior to death by virtue of, for example, excessive use of force in the court of arrest. See Prunty v. Schwantes, 40 Wis.2d at 422, 162 N.W.2d at 37. Section 895.1 allows survival of actions for \"damage to the person\".\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e The jury considered the question, however, and found no deprivation of Daniel Bell's rights occurring prior to death. (Plaintiffs dispute this finding, which we discuss in Part XII infra.)\n\nIn short, the Wisconsin statutory scheme creates a survival action in favor of the estate for pre-death injuries and a wrongful death action in favor of the victim's survivors, and neither type of action traditionally allows recovery of damages for loss of life itself. See generally W. Prosser, Torts 901-910 (4th ed. 1971). The district court's apparent misconstruction of Wisconsin law, however, has no practical impact on plaintiffs' claims since the application and policy of this point of Wisconsin law are inconsistent with those of Section 1983 and the Fourteenth Amendment protection of life. Therefore, Wisconsin law cannot be applied to preclude the estate's recovery for loss of life, for the reasons set out below.\n\nWhere the constitutional deprivation sought to be remedied in a Section 1983 action causes death and the applicable state law would deem the action to survive or would allow recover for the damage claim at issue, courts generally apply the state law. See, e.g., Moor v. County of Alameda, 411 U.S. 693, 702-703 n.14, 36 L. Ed. 2d 596, 93 S. Ct. 1785 ; Rosa v. Cantrell, 705 F.2d 1208 (10th Cir. 1982), certiorari denied, 464 U.S. 821, 104 S. Ct. 85, 78 L. Ed. 2d 94 ; Spence v. Staras, 507 F.2d 554 (17th Cir. 1974); Brazier v. Cherry, 293 F.2d 401 (5th Cir. 1961), certiorari denied, 368 U.S. 921, 7 L. Ed. 2d 136, 82 S. Ct. 243 . But the more difficult question, the question presented here and addressed by Section 1988 is whether a state law is \"inconsistent\" with federal civil rights law and therefore does not apply where state law would not allow the estate to recover for the loss of life.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e While specifically addressing the Section 1983 claim brought by Daniel Bell's estate, much of our discussion of Section 1983 policy is also relevant to the question whether Wisconsin law governs the Section 1983 claims of Dolphus Bell's estate and of the siblings, discussed infra.\n\nThe Supreme Court has yet to decide squarely this issue. The Court granted certiorari in two state court cases which might have reached the issue, but certiorari was dismissed in both cases. In Jones v. Hildebrant, 191 Colo. 1, 550 P.2d 339 (Colo. 1976), certiorari dismissed, 432 U.S. 183, 53 L. Ed. 2d 209, 97 S. Ct. 2283, which involved a killing by a police officer, the Court dismissed a previously granted writ of certiorari after the issues raised in the oral argument diverged from those stated in the petition. In Jones the Section 1983 claim was brought by the mother of the deceased individually and not in her capacity as administratrix. In Espinoza v. O'Dell, 633 P.2d 455 (Colo. 1981), certiorari dismissed, 456 U.S. 430, 456 U.S. 430, 102 S. Ct. 1865, 72 L. Ed. 2d 237, one of the Section 1983 claims based upon the killing by a police officer was brought on behalf of the victim's estate by the personal representative. Because the Colorado court remanded the case on some other issues, the Supreme Court dismissed the writ of certiorari for lack of finality.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nIn a case where plaintiff dies but not as a result of the putatively unconstitutional act, the Supreme Court has confirmed that restrictive state statutes apply to Section 1983 actions. In Robertson v. Wegmann, 436 U.S. 584, 56 L. Ed. 2d 554, 98 S. Ct. 1991, the plaintiff who brought a Section 1983 action for malicious prosecution died while his suit was pending. The Court held that pursuant to Section 1988 the applicable Louisiana law governed the survivability issue. Under the state law, the decedent's action abated because no person with the requisite relationship to him was alive at the time of his death. Concluding that this outcome was not inconsistent with the policies of Section 1983, the Court ruled that the action did not survive but explicitly declined to express any view on the particular issue before us, i.e., whether a cause of action exists in favor of the estate despite state law which precludes such, where the alleged deprivation of constitutional rights caused death. Robertson v. Wegmann, 436 U.S. at 594. However, the Court specifically admonished that:\n\nA state statute cannot be considered \"inconsistent\" with federal law merely because the statute causes the plaintiff to lose the litigation. If success of the § 1983 action were the only benchmark, there would be no reason at all to look to state law, for the appropriate rule would then always be the one favoring the plaintiff, and its source would be essentially irrelevant. But § 1988 quite clearly instructs us to refer to state statutes; it does not say that state law is to be accepted or rejected based solely on which side is advantaged thereby.\n\nRobertson v. Wegmann, 436 U.S. at 593.\n\nIn a Bivens, action, i.e., an action brought not against state or local officials under Section 1983 but against federal officials directly under the Constitution, the Supreme Court has allowed recover by the estate notwithstanding restrictive state law. Carlson v. Green, 446 U.S. 14, 64 L. Ed. 2d 15, 100 S. Ct. 1468 . Carlson involved a Bivens-type suit (see Bivens v. Six Unknown Name d Agents of Fed. Bureau of Narcotics, 403 U.S. 388), 29 L. Ed. 2d 619, 91 S. Ct. 1999 brought by a mother on behalf of the estate of her deceased son, alleging that federal prison officials grossly neglected his asthmatic condition and administered drugs which worsened his condition, with defendants' indifference in part attributable to racial prejudice. Plaintiff argued that defendants' acts and omissions violated the deceased's Eighth and Fourteenth Amendment rights. Under Indiana law no recovery was available where the acts complained of caused the victim's death. The district court had dismissed the case, this Court reversed the dismissal, and the Supreme Court affirmed. Although not explicitly discussing the component of damages for loss of life, the Supreme Court found that a uniform federal rule was necessary to achieve the Bivens policies of deterring federal officials from violating federal constitutional rights, and held that whenever a state survival statute would extinguish the action brought against defendants whose conduct results in death, federal law permits survival of the action. The Court distinguished Robertson on the rationales that in Carlson the plaintiff's death was caused by the defendant's acts upon which the suit was based, and no state interests are implicated by applying purely federal law to federal officials who violate the \"federal Constitution\". Carlson v. Green, 446 U.S. at 24 and n.11. Thus although Grady was a city and not a federal employee (and Carlson does not therefore control), the Carlson Court's emphasis on the need to deter officials from committing violations of constitutional rights that result in death of the victim suggests that Daniel Bell's estate has a Section 1983 claim for loss of life notwithstanding inhospitable Wisconsin law. Further, both Justices Powell and Stewart explicitly acknowledged in their concurrences that they would reach the same result in Section 1983 cases. Otherwise, different rules governing the liability of federal and state officers for similar constitutional wrongs would operate, an \"unseemly\" result. 446 U.S. at 29-30.\n\nYet despite the implication of Carlson v. Green, the Supreme Court has yet to make a specific pronouncement on the existence of a federal rule allowing the estate of victims killed under color of state law to recover for loss of life in a Section 1983 action notwithstanding restrictive state law. However, Supreme Court precedent expressing the policies underlying Section 1983 and the guarantees of the Fourteenth Amendment indicate that allowing the estate of Daniel Bell to recover is the proper result under federal policy, and that restrictive state law at issue in this case is inconsistent with the federal policy.\n\nIt is axiomatic that the Fourteenth Amendment protects individuals from deprivation by the state of life without due process, Martinez v. California, 444 U.S. 277, 284, 62 L. Ed. 2d 481, 100 S. Ct. 553 . Regarding the egregiousness of Grady's conduct, on the basis of his conviction for reckless homicide and the record in generally, Grady was at least grossly reckless in the commission of the killing. Under Parratt v. Taylor, 451 U.S. 527, 531-535, 68 L. Ed. 2d 420, 101 S. Ct. 1908, in which the Supreme Court held that even a negligent deprivation of a constitutional right is sufficient for plaintiff to invoke that right, Grady's recklessness clearly suffices, and Daniel Bell most assuredly was denied due process in the deprivation of his life.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nFurther, the fundamental policies behind Section 1983 are twofold: compensation for and deterrence of unconstitutional acts committed under state law. Robertson v. Wegmann, 436 U.S. at 590-91. One of the primary reasons Section 1983 was enacted was to remedy and deter racial killing and other acts violative of the Fourteenth Amendment. See Monroe v. Pape, 365 U.S. 167, 5 L. Ed. 2d 492, 81 S. Ct. 473 ; Briscoe v. LaHue, 460 U.S. 325, 460 U.S. 325, 103 S. Ct. 1108, 1116-1117, 75 L. Ed. 2d 96 . The legislative history behind Section 1983 expresses an unequivocal concern for protecting life. President Grant's message to Congress which inspired the Ku Klux Klan Act's passage specifically referred to \"[a] condition of affairs in some States of the Union rendering life and property insecure * * *.\" Cong. Globe, 42d Cong., 1st Sess. 244 (1871) (emphasis added). Floor debates on the bill frequently reflected this theme. See, e.g., Statements of Rep. Stoughton, id. at 321-322 (the purpose of the Ku Klux Klan Act is to provide federal protection for \"life, person and property.\"); Statements of Rep. Lowe, id. at 447 (\"[W]hile murder is stalking abroad in disguise, while whippings and lynchings and banishments have been visited on unoffending American citizens, the local administrations have been found inadequate or unwilling to apply the proper corrective.\").\n\nThe deterrence objective of Section 1983 was not paramount in Robertson v. Wegmann as it is here. In Robertson death was an intervening circumstance, and thus the Court did not perceive any significant loss of deterrence if the restrictive Louisiana statute were applied, commenting that:\n\nIn order to find even a marginal influence on behavior as a result of Louisiana'S survivorship provisions, one would have to make the rather farfetched assumptions that a state official had both the desire and the ability deliberately to select as victims only those persons who would die before conclusion of the § 1983 suit for reasons entirely unconnected with the official illegality and who would not be survived by any close relatives. Robertson, 436 U.S. at 592 n.10. But since in the instant case the killing is the unconstitutional act, there would result more than a marginal loss of influence on potentially unconstitutional act, there would result more than a marginal loss of influence on potentially unconstitutional actors and therefore on the ability of Section 1983 to deter official lawlessness if the victim's estate could not bring suit to recover for loss of life. Moreover, if Section 1983 did not allow recovery for loss of life notwithstanding inhospitable state law, deterrence would be further subverted since it would be more advantageous to the unlawful actor to kill rather than injure.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e As the Supreme Court observed in Carey v. Piphus, 435 U.S. 247, 258, 55 L. Ed. 2d 252, 98 S. Ct. 1042, \"it is not clear * * * that common-law tort rules of damages will provide a complete solution to the damages issue in every § 1983 case.\" Therefore it is appropriate, as the Supreme Court has noted in regard to Section 1983 damage issues, to fashion \"a federal rule responsive to the need whenever a federal right is impaired.\" Sullivan v. Little Hunting Park, Inc., 396 U.S. 229, 240, 24 L. Ed. 2d 386, 90 S. Ct. 400 .\n\nIn sum, we hold that Wis.Stat. §§ 895.01 and 895.04, along with Wisconsin decisions construing those provisions, which would preclude recovery to Daniel Bell's estate for loss of life, are inconsistent with the deterrent policy of Section 1983\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e and the Fourteenth Amendment's protection of life.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e The Wisconsin law therefore cannot be applied to preclude the $100,000 damages recovered by Daniel Bell's estate for loss of life.\n\nRecent federal precedent supports plaintiffs' position with respect to Section 1983 recovery for Daniel Bell's estate. Guyton v. Phillips, 532 F. Supp. 1154 (N.D. Cal. 1981), is directly pertinent. In Guyton the mother of a boy shot and killed by police officers brought suit on behalf of the deceased minor as administratrix of the estate under Section 1983. Under state survival law the estate could not recover for pain and suffering sustained prior to death nor for the loss of life. Citing Carey v. Piphus, 435 U.S. 247, 258, 55 L. Ed. 2d 252, 98 S. Ct. 1042, for the proposition that state common-law tort rules of damages may be inconsistent with the policy underlying Section 1983, the court held that the estate was entitled to recover for loss of life and pain and suffering. Plaintiff could therefore recover under Section 1983.\n\nSimilarly, in Heath v. City of Hialeah, 560 F. Supp. 840 (S.D. Fla. 1983), a Section 1983 action was brought by the estate of a youth who was shot and killed by a police officer. The court held that a Florida law which would preclude survival of the action is inconsistent with Section 1983 policy, and that federal common law which would allow the action to survive governs the estate's recovery. In O'Connor v. Several Unknown Correctional Officers, 523 F. Supp. 1345 (E.D. Va. 1981), death was caused not by shooting but by the alleged negligence of prison officials in treating the deceased's condition. State law only allowed recovery for injuries suffered by the beneficiaries and not by the estate. The court found the state law to be inconsistent with the Section 1983 policy of deterring unconstitutional deprivations of life by state officials, allowing the administratrix of the estate to pursue the estate's Section 1983 claim. Neither Heath nor O'Connor, however, specifically addresses the question whether recovery is allowable for loss of life as well as for the traditional tort measures of damage to the estate, i.e., pecuniary injury and, in some jurisdictions, pain and suffering of the victim prior to death and punitive damages.\n\nSomewhat more specific on the issue of damages in Sanchez v. Marquez, 457 F. Supp. 359 (D. Colo. 1978). There the personal representative of the estate (among other plaintiffs) brought a Section 1983 action against police officers who wrongfully shot and killed the representative's brother. State law permitted survival of the action, but limited recovery to the victim's loss of earnings sustained prior to death. The court, noting that \"it is inconsequential that the actions under color of state law which violate a federally protected right may also constitute a tort,\" held that Section 1983 was not intended to incorporate such restrictive damage limits. 457 F. Supp. at 362. The court did not, however, explicitly state whether the estate could recover for loss of life, but the general nonapplicability of restrictive state damage limitations to an estate's Section 1983 action where the alleged unconstitutional conduct caused the death has been reinforced in subsequent Colorado district court decisions. See Sager v. City of Woodland Park, 543 F. Supp. 282 (D. Colo. 1982); Jackson v. Marsh, 551 F. Supp. 1091 (D. Colo. 1982).\n\nThe above-cited decisions also support plaintiffs' contention that the $25,000 punitive damages awarded against Grady in favor of Daniel Bell's estate should be upheld, even though Wis. Stat. § 895.04 does not allow the victim's estate to recover punitive damages, see Wangen v. Ford Motor Co., 97 Wis. 2d 260, 294 N.W.2d 437 (1980). To disallow punitive damages in Section 1983 actions solely on the basis of restrictive state tort law would seriously hamper the deterrence effect of Section 1983. See McFadden v. Sanchez, 710 F.2d 907 (2d Cir. 1983) (where estate brought Section 1983 action for shooting death by police officer, New York law which would deny punitive damages is inconsistent with Section 1983).\n\nBefore punitive damages can be imposed in a Section 1983 action, this Court has required a showing of \"aggravating circumstances.\" See, e.g., Merritt v. De Los Santos, 721 F.2d 598, 601 (7th Cir. 1983). Plaintiffs adduced sufficient evidence to establish such aggravating circumstances, or, under the standard articulated in Smith v. Wade, 461 U.S. 30, 461 U.S. 30, 103 S. Ct. 1625, 1640, 75 L. Ed. 2d 632, the \"recklessness or callous indifference\" in shooting and killing Daniel Bell.\n\nVI. SURVIVAL OF DOLPHUS BELL'S SECTION 1983 AND CONSPIRACY CLAIMS\n\nPatrick Bell, Sr., as administrator of the estates of Daniel and Dolphus Bell, sought at trial on behalf of Dolphus' estate to recover for those injuries suffered by Dolphus Bell, namely, his loss of the society and companionship of his son, Daniel Bell's funeral expenses, and the deprivation of due process and equal protection Dolphus Bell allegedly suffered as a result of the conspiracy. The district court allowed the jury to consider these claims, the jury re turning a special verdict in favor of Dolphus Bell's estate on each claim. The court rejected defendants' contention that Dolphus Bell's claims do not survive his death according to the Wisconsin survival statute Section 895.01. Bell III, 536 F. Supp. 462, 467-468. Because the recovery for the funeral expenses is not disputed on appeal, and defendants do not appeal the district court's holding that Dolphus Bell's conspiracy claim survives his death, we need consider only the survivability of the Section 1983 claim for loss of society and companionship.\n\nThe district court based its holding that Dolphus Bell's Section 1983 claim survives his death on Wisconsin statutory and case law. Wis. Stat. § 895.01 states that \"in addition to the causes of action which survive at common law,\" many others, including those for \"invasion of privacy\" and \"damage to the person,\" also survive. Regarding Dolphus Bell's Section 1983 claim, his alleged injury is the loss of society and companionship of his son. The district court determined that a Wisconsin court considering the question could reasonably view Dolphus Bell's loss of the companionship and association as an \"invasion of privacy;\" hence the claim would survive Dolphus Bell. Alternatively, the court noted that in Wangen v. Ford Motor Co., 97 Wis. 2d 260, 317, 294 N.W.2d 437, 465 (1980), the Wisconsin Supreme Court characterized a parent's injury of loss of society and companionship as a \"personal injury right[] of action,\" which also survives under Wis. Stat. § 895.01. Although the court's statement in Wangen was made not in the context of survivability but rather in the context of punitive damages considerations, it is undeniable that the Wisconsin Supreme Court takes the position that losses of society and companionship are a type of personal injury.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e We therefore affirm the holding that Dolphus Bell's section 1983 claim survives by virtue of Wis. Stat. § 895.01. (The statutory conflict between survival statute Section 895.01 and wrongful death statute Section 895.04(2) which would operate to reduce or extinguish the claim is discussed in Part VII C infra.)\n\nThe doctrinal basis of Dolphus Bell's Section 1983 and conspiracy claims will now be addressed, in conjunction with the discussion of the claims of Daniel Bell's siblings. The Section 1983 claims will be considered first.\n\nVII. SECTION 1983 CLAIMS OF DOLPHUS BELL'S ESTATE AND THE SIBLINGS\n\nDefendants argue that the district court erred in not applying Wisconsin wrongful death law to the claims of Daniel Bell's siblings and father's estate for the loss of Daniel's society and companionship, for which the jury awarded $100,000 and $75,000, respectively. As more fully discussed infra, Wis. Stat. § 895.04 if applied would preclude the siblings' recovery, and would allow the father's estate to recover only $25,000 or zero, depending upon the interpretation of that provision. Plaintiffs contend that the father and siblings were deprived of a constitutionally-protected liberty interest in the continued society and companionship of Daniel Bell, that this deprivation is fully compensable under Section 1983, and that to apply the restrictive Wisconsin statute would be inconsistent with this federal and civil rights policy.\n\nWe will first consider whether the father or siblings possess such a constitutional liberty interest and then examine the policies behind the Wisconsin law and resolve, assuming a constitutional interest exists as to either or both the father and siblings, whether the Wisconsin law is inconsistent and therefore cannot be applied.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nA. Whether the Father or Siblings Possessed a Constitutional Liberty Interest in Their Association With Daniel Bell\n\nThe Supreme Court has yet to address whether a parent or sibling has a liberty interest in the continued association of a sibling or child, protected from unlawful state interference by the due process clause of the Fourteenth Amendment, in the context of a Section 1983 death action.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e The issue might have been addressed, but certiorari was dismissed as improvidently granted in Jones v. Hildebrant, 191 Colo. 1, 550 P.2d 339 (Colo. 1976), certiorari dismissed, 432 U.S. 183, 53 L. Ed. 2d 209, 97 S. Ct. 2283, and Espinoza v. O'Dell, 633 P.2d 455 (Colo. 1981), certiorari dismissed, 456 U.S. 430, 456 U.S. 430, 102 S. Ct. 1865, 72 L. Ed. 2d 237, both mentioned in Part V supra.\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nIn Jones, plaintiff suing in her own behalf was the mother of a boy who was shot and killed by Hildebrant acting in his capacity as a Denver police officer. Plaintiff's claims were based upon the Colorado wrongful death statute and Section 1983. The statute limited the wrongful death recovery of non-dependents to a maximum of $45,000, and Colorado precedent further limited recovery to \"net\" pecuniary loss. The trial court dismissed the Section 1983 claims, ruling that the mother enjoyed no Section 1983 right independent of state law since any constitutional infringement was really that of her son. Under state law the jury awarded plaintiff $1,500, and the Colorado Supreme Court affirmed. The Supreme Court granted certiorari but, as noted earlier, later dismissed on the ground that the key question presented at oral argument diverged from the question presented in the petition for certiorari and that perceived at issue below.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e\n\nThough explicitly not intimating an opinion on the merits of plaintiff's constitutional liberty claim, the majority remarked that if such a liberty interest exists, \"it would not seem logically to be subject to a damages limitation contained in the statute permitting survivors to recover for wrongs done to property interests of theirs.\" 432 U.S. at 188. The dissent also noted that \"it is far from evident that the Colorado Supreme Court was correct in ruling that a Section 1983 death action is tied to state law.\" 432 U.S. at 190 (White, J., dissenting).\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e\n\nSupreme Court decisions examining the parameters of the constitutional protection afforded the parent-child relationship more forcefully indicate that Daniel Bell's father possessed a constitutional liberty interest in his relationship with his son. The Court has frequently emphasized the primacy of th parent-child relationship. The rights to conceive and to raise one's children have been deemed \"essential,\" Meyer v. Nebraska, 262 U.S. 390, 399, 67 L. Ed. 1042, 43 S. Ct. 625, \"[rights] far more precious * * * than property rights.\" May v. Anderson, 345 U.S. 528, 533, 97 L. Ed. 1221, 73 S. Ct. 840 . \"Marriage and procreation and fundamental to the very existence and survival of the race.\" Skinner v. Oklahoma, 316 U.S. 535, 541, 86 L. Ed. 1655, 62 S. Ct. 1110 .\"It is cardinal with us that the custody, care and nurture of the child reside first in the parents, whose primary function and freedom include preparation for obligations the state can neither supply nor hinder.\" Prince v. Massachusetts, 321 U.S. 158, 166, 88 L. Ed. 645, 64 S. Ct. 438 .\n\nThe due process clause requires that severances in the parent-child relationship caused by the state occur only with rigorous protections for the individual liberty interests at stake. Lassiter v. Department of Social Services, 452 U.S. 18, 27, 68 L. Ed. 2d 640, 101 S. Ct. 2153 ; Little v. Streater, 452 U.S. 1, 13, 68 L. Ed. 2d 627, 101 S. Ct. 2202 : Smith v. Organization of Foster Families, 431 U.S. 816, 842, 846, 53 L. Ed. 2d 14, 97 S. Ct. 2094 ; Stanley v. Illinois, 405 U.S. 645, 651, 31 L. Ed. 2d 551 . The state may not separate the parent from the child, even temporarily, without according them due process of law to protect their liberty interests. See Lassiter, supra; Stanley, supra. Indeed, the Supreme Court has accorded the parent-child relationship these protections whether legitimized by marriage or not, and due process is implicated in state involvement in both the termination and the imposition of those bonds. See Little v. Streater, supra, 452 U.S. at 13 (due process requirements of paternity determinations).\n\nDecisions of this Court also reflect the constitutional protection accorded the parent-child relationship. See Ellis v. Hamilton, 669 F.2d 510, 512 (7th Cir. 1982) (due process clause protects parents' liberty interest in relationship with children), certiorari denied, 459 U.S.1069, 103 S. Ct. 488, 74 L. Ed. 2d 631; Drollinger v. Milligan, 552 F.2d 1220, 1226-1227 (7th Cir. 1977) (due process clause protects interest in the nurturing and development of a child or grandchild).\n\nAdditionally, the legislative history of the Ku Klux Klan Act of 1871, though not expressive on the specific issues, indicates that the Act was meant to create a remedy where the parent-child relationship was interfered with by lawless, racially-motivated violence. Representative Butler described the Act:\n\nThis then is what we offer to the people of the United States as a remedy for wrongs, arsons and murders done. This is what we offer to a man whose house has been burned, as a remedy; to the woman whose husband has been murdered, as a remedy;\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e to the children whose father has been killed, as a remedy.\n\nCong. Globe, 42d Cong., 1st Sess. 807.\n\nAlthough the above-quoted legislative history makes a clearer case for recovery to the child due to loss of support or loss of society and companionship of a parent, recognition of the child's rights vis-a-vis parental loss logically implies the reciprocal recognition of the parent's rights vis-a-vis the loss of a child. In contrast to the mentioning of the parent-child relationship, however, a discussion of intra-sibling interests is lacking in the legislative history of the Ku Klux Klan Act.\n\nOur recognition of a parent's right to recover under Section 1983 for the unlawful breach of the parent-child relationship by virtue of the child's death is buttressed by federal appellate precedent addressing the right to due process in regard to the custody and care of a child in Section 1983 actions. Where custody has been unreasonably denied by officials acting under color of state law, a Section 1983 remedy for injury to the parent-child associational interest has been provided. In Morrison v. Jones, 607 F.2d 1269 (9th Cir. 1979), county officials transported the California plaintiff's son, a German alien and ward of the state, to Germany on the grounds that the mother was incapable of providing requisite special care. The court of appeals reversed summary judgment which was entered in favor of some of the defendants. Citing Stanley v. Illinois, supra, the court held that plaintiff mother was entitled to establish at trial a deprivation of her relationship with her child without due process, the right to which is recognized under the Constitution and protected by Section 1983. Morrison v. Jones, 607 F.2d at 1275; see also Drollinger v. Milligan, 552 F.2d 1220 (7th Cir. 1977) (grandfather's claim that the state of Indiana, by virtue of probation conditions imposed upon his daughter-in-law, deprived him of his constitutionally-protected interest in the care and development of his grandchild was actionable under Section 1983); Duchesne v. Sugarman, 566 F.2d 817 (2d Cir. 1977) (mother's claim that city bureau's failure to obtain judicial approval of its decision to retain custody of children amounted to deprivation of liberty interest remediable under Section 1983).\n\nDefendants point out that Daniel was 23 years old and thus no longer a minor when he was killed. They contend that a parent's interest in the society and companionship of a child is less substantial when the child is an adult and not living with the parent. However, we are unpersuaded that a constitutional line based solely on the age of the child should be drawn. The Supreme Court's decisions protect more than the custody dimension of the parent-child relationship. The protected relationship includes the parent's \"interest in the companionship, care, custody, and management\" of the child. Stanley v. Illinois, 405 U.S. 645, 651, 31 L. Ed. 2d 551, 92 S. Ct. 1208 . The continued interest in the care and companionship of a child is afforded due process protection where the parent raised and nurtured the child, even where the parent has never had legal custody. See Caban v. Mohammed, 441 U.S. 380, 394, 60 L. Ed. 2d 297, 99 S. Ct. 1760 (adoption law which gave unwed fathers less extensive rights than unwed mothers violates equal protection where, inter alia, father has \"manifested a significant paternal interest in the child\"); Quilloin v. Walcott, 434 U.S. 246, 255, 54 L. Ed. 2d 511, 98 S. Ct. 549 (law allowing illegitimate child to be adopted despite objection of father does not violate due process where father at no time had or sought custody).\n\nMoreover, Daniel was single and had no children. He had not become a part of another family unit; his father's family was his immediate family. Wisconsin law permits parents in wrongful death actions to recover damages for loss of society and companionship regardless of the age of the child at death. Wis. Stat. § 895.04(4), discussed infra. Also, there was substantial testimony regarding the warm and close relationship between Daniel Bell and his father. Further, this deprivation was far more substantial than the unlawful removal of a child from the parent's custody; it was the annihilation of the parent-child relationship. The jury was fully aware that Daniel was no longer a minor, and it was appropriate for them to consider that fact (as they were instructed to do) in assessing the damages awarded to Dolphus Bell's estate for loss of Daniel's society and companionship. Daniel's age and separate residence were matters for the jury to consider when determining damages. These were not a bar to any recovery at all.\n\nThe claims of Daniel's brothers and sister for loss of his society and companionship are more problematic. Plaintiffs argue that the federal Constitution protects the \"network of core nuclear family relationships\" (Plaintiffs' Br., p. 29) and thus the siblings are entitled to damages for the termination of their relationships with Daniel.\n\nIt is true that in numerous contexts liberty interests belonging to family members have been accorded constitutional protection. Cases here involved, inter alia, state laws that would affect religious freedoms, the right to live in the same residence, and the right of parents to influence a child's education. See, e.g. Meyer v. Nebraska, supra; Pierce v. Society of Sisters, 268 U.S. 510, 69 L. Ed. 1070, 45 S. Ct. 571 ; Prince v. Massachusetts, supra; Wisconsin v. Yoder, 406 U.S. 205, 32 L. Ed. 2d 15, 92 S. Ct. 1526 ; Moore v. City of East Cleveland, 431 U.S. 494, 52 L. Ed. 2d 531, 97 S. Ct. 1932 .The \"integrity of the family unit\" has been recognized by the Supreme Court. See Moore, supra, 431 U.S. at 503-504 (plurality opinion); Stanley, supra, 405 U.S. at 651.\n\nBut the specific nature of the constitutional rights recognized in these and other decisions is not sufficiently analogous to the right claimed by plaintiffs in regard to the siblings' Section 1983 claim. In Pierce, the Supreme Court reviewed an Oregon statute requiring all children to attend public schools. In Meyer, a teacher had been convicted under a law forbidding the instruction of any modern language other than English in the first eight grades. In both cases the Supreme Court held the statutes to be unwarranted interferences with the liberty permitted parents to exercise in the raising and education of their children, and therefore violative of the due process clause. Pierce, supra, 268 U.S. at 534-535; Meyer, supra, 262 U.S. at 401-403.\n\nOther Supreme Court decisions examining Fourteenth Amendment liberty interests, though alluding to the importance of the integrity of the family unit, similarly base their holdings on the parent's constitutional right to raise, associate with, and to make decisions affecting the family.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e See Caban v. Mohammed, supra; Stanley v. Illinois, supra. In Wisconsin v. Yoder, supra, the law requiring school attendance was found to violate the rights of the parents, while the rights of the children were not addressed (but see Douglas, J., dissenting in part), and the specific right at issue was the free exercise of religion under the First Amendment, not the plaintiffs' alleged constitutional right of society and companionship.\n\nMoreover, in the cases extending constitutional protection in the family context to those other than biological parents, the protected party was acting in the place of biological parents to care for and associate with a child. For example, in Smith v. Organization of Foster Families, 431 U.S. 816, 53 L. Ed. 2d 14, 97 S. Ct. 2094, in which foster parents challenged a law regulating the terms of removal of the child from the foster home, the Court recognized that the parents' right to care for and nurture the child extends beyond natural parents. 431 U.S. at 843 n.49.In Prince, supra, the \"parent\" was the child's aunt and legal custodian, who had a constitutional right to manage the niece's education. In Drollinger v. Milligan, supra, this Court not only recognized the grandfather's liberty interest in the care and development of a grandchild, but acknowledged that the deprivation of this interest is compensable under Section 1983. And in Moore v. City of East Cleveland, supra, the protected relationship was between a grandmother and her grandchildren. There the Court disapproved a city ordinance which limited occupancy of a dwelling unit to members of a single family and defined \"family\" in such a manner that the grandmother could not live with two grandsons who were not brothers. Moore, although only a plurality opinion, is the most supportive of the plaintiffs' argument with respect to the siblings,\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e but without more analogous precedent we cannot attach a constitutional dimension to the siblings' claim for lost society and companionship. Just as the statute in Moore was an arbitrary and unreasonable exercise of legislative power, we can conceive of potential state statutes severing relationships between siblings (though likely not effecting a severance as irreversible and egregious as the one resulting from the shooting and killing at issue). Such statutes should be stricken as being arbitrary and unreasonable, but this approach is not the equivalent of awarding damages under Section 1983 and the Fourteenth Amendment for the loss of society and companionship of a sibling, state law being entirely subsumed in the process.\n\nWe fully recognize the importance of intrafamily relationships generally, including those between siblings. As observed in Smith v. Organization of Foster Families, \"the importance of the familial relationship, to the individuals involved and to the society, stems from the emotional attachments that derive from the intimacy of daily association, and from the role it [the family] plays in \"promoting a way of life\" through the instruction of children, as well as from the fact of blood relationship.\" 431 U.S. at 844 (citation omitted). But the legal consequences of many important relationships, including family relationships, are often governed by state law, and here the Wisconsin legislature has expressly decided that no tort recovery is in order for the loss of society and companionship among siblings. Moreover, if we were to hold that the federal Constitution entitles the siblings to recover for loss of society and companionship, there could be no principled way of limiting such a holding to the immediate family or perhaps even to blood relationships. Obviously many human relationships stem from the \"emotional attachments that derive from the intimacy of daily association,\" but we are unwilling to attach constitutional significance to such attachments outside the closely guarded parent-child relationship. Plaintiffs suggest that we could limit a holding in their favor to blood relatives in the nuclear family, arguing that injury to relationships within the nuclear family is the reasonably foreseeable result of any wrongful death. But in any wrongful death case it is reasonably foreseeable that many persons' relationships with the deceased will end, and the rationale offered for protecting blood relatives within the immediate family also extends beyond the immediate family. Therefore, the proffered limitations in such a holding are not viable; such a holding would require us to wander without principled guidance in deciding which, if any, of a decedent's brothers, sisters, aunts, uncles, cousins or even friends could recover under federal law for the deprivation of their association with the decedent.\n\nOur holding is to some degree influenced by our recognition of the federal right to Section 1983 recovery on behalf of the victim's estate and the victim's parents. Were we also to attach constitutional significance to the siblings' interest in society and companionship of their brother, the added measure of deterrence of unlawful conduct under color of state law is uncertain. Drawing the line here for Fourteenth Amendment purposes is of course a difficult task, but it must be drawn just the same.\n\nA similar line was drawn in Sanchez v. Marquez, 457 F. Supp. 359 (D. Colo. 1978), where a Section 1983 death action was brought by the representative of the victim's estate and the victim's brothers and sisters. Regarding the estate's claim, discussed supra, the court held that recovery under Section 1983 was allowed for the estate's \"constitutional tort\" claim. Sanchez, supra, 457 F. Supp. at 362. But in regard to the siblings' claim, the court held that the Constitution did not extend to them a similar right. Recognizing that the Supreme Court has included in the concept of personal liberty activities relating to family relationships, the court remarked:\n\n[W]here the right to raise, educate and associate with one's own child may rise to constitutional dimensions, the right of siblings to have their brother or sister continue living does not. The relationship between a parent and its offspring and the relationship between brother and sibling is not a difference in degree; it is a difference in kind. Though one has a constitutional right to have or not to have a child, one does not have a constitutional right to have or not have a brother.\n\nThe Fourteenth Amendment of the United States Constitution does not furnish plaintiffs' theory with an anchorage.\n\n457 F. Supp. at 363. This holding was reinforced by the same court subsequently in Sager v. City of Woodland Park, 543 F. Supp. 282 (D. Colo. 1982), where the parents and sister of the deceased alleged a constitutional right to recover under Section 1983. The Sager court, quoting Sanchez, held that the sister could not recover under Section 1983. 543 F. Supp. at 290.Accord, Jones v. McElroy, 429 F. Supp. 848 (E.D. Pa. 1977). See also Mattis v. Schnarr, 502 F.2d 588 (8th Cir. 1974) (parent has standing to seek redress for alleged unconstitutional deprivation of the life of his son; no siblings' claim at issue); Espinoza v. O'Dell, 633 P.2d 455 (Colo. 1981), discussed supra (child has section 1983 right in associational interest with father).\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e We conclude that under present constitutional authorities the siblings cannot recover under Section 1983.\n\nB. Recovery for Lost Society and Companionship and Common Law Remedies\n\nAlthough the due process clause protects a parent's relationship with his child from unlawful interference, and thus the express language of Section 1983 provides a remedy for the deprivation of this constitutional right where the interference is committed under color of state law, this Court should also consider whether there is implicit in Section 1983 a common law limitation on the available remedy.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e This inquiry is somewhat analogous to the recognition of, e.g., the common law fule shielding municipalities from punitive damages incorporated in Section 1983, see City of Newport v. Fact Concerts, Inc., 453 U.S. 247, 69 L. Ed. 2d 616, 101 S. Ct. 2748 ; the common law rule of damages that compensable injury must be established in a Section 1983 action to recover anything more than nominal damages, see Carey v. Piphus, 435 U.S. 247, 55 L. Ed. 2d 252, 98 S. Ct. 1042 ; and the requisite standard of conduct derived from common law regarding the imposition of punitive damages in Section 1983 actions, see Smith v. Wade, 461 U.S. 30, 461 U.S. 30, 103 S. Ct. 1625, 75 L. Ed. 2d 632 .\n\nThe legislative history of the Ku Klux Klan Act of 1871 does not explicitly address whether remedies under Section 1983 encompass lost society and companionship. In regard to the common law existing at or around the time of enactment, many jurisdictions either by statute or by judicially-created rule did not allow recovery for lost society and companionship in a wrongful death action.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e This view was derived from Lord Campbell's Act (1846),\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e which reversed the common law rule creating a civil wrongful death action on behalf of the beneficiaries. That Act does not expressly deny recovery for loss of society and companionship, but the seminal English case of Blake v. The Midland Ry., 18 Q.B. 93, 118 Eng. Rep. 35 (1852) so construed it, and many American courts and legislatures followed suit. Some, however, did not, allowing recovery for the loss of society and companionship in a wrongful death action.\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e And where the state legislature limited recovery to pecuniary injury, many courts broadly construed this category of injury to avoid unjust results, particularly where the deceased was highly regarded and cherished by the beneficiaries, and yet the deceased did not provide substantial financial support.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e\n\nThus even assuming that the drafters of the civil rights acts intended to limit the type of damages recoverable by applying the then-existing tort rules of damages, it cannot be definitively stated which rule the drafters intended to adopt. As Justice O'Connor noted in Smith v. Wade, in attempting to establish the intent of the 42d Congress:\n\nWhen a significant split in authority existed, it strains credulity to argue that Congress simply assumed that one view rather than the other would govern. * * * The battle of the string citations can have no winner.\n\nOnce it is established that the common law of 1871 provides us with no real guidance on this question, we should turn; to the policies underlying § 1983 to determine which rule best accords with those policies.\n\nSmith v. Wade, U.S. at , 103 S. Ct. at 1659 (O'Connor, J., dissenting).\n\nThus it does not appear that any controlling common law rule was operative at the time Section 1983 was enacted that would bar Dolphus Bell's estate's recovery for lost society and companionship. This conclusion is bolstered by the recognition that Section 1983 was enacted not simply to enforce existing wrongful death remedies but to give force to the newly-conceived constitutional amendments, which are remedial in purpose.\n\nC. Wisconsin Wrongful Death Law and the Question of Inconsistency\n\nThe next question to be addressed is the effect of state law on the Section 1983 claims of Dolphus Bell's estate and the siblings were state law to be applied. Wis. Stat. § 895.04(2), the core of the Wisconsin wrongful death statute, provides recovery for the survivors of the victim in a limited and specific fashion:\n\nIf the deceased leaves surviving a spouse, and minor children under 18 years of age with whose support the deceased was legally charged, the court * * * shall determine the amount [of the judgment] to be set aside for the protection of such children * * *. If there are no such surviving minor children, the amount recovered shall belong and be paid to the spouse of the deceased; if no spouse survives, to the deceased's lineal heirs * * *; if no lineal heirs survive, to the deceased's brothers and sisters. If any such relative dies before judgment in the action, the relative next in order shall be entitled to recover for the wrongful death.\n\nThus Section 895.04(2) creates in essence a hierarchy of beneficiaries: parents are entitled to recover for pecuniary injury as well as for loss of society and companionship, only if the victim leaves no children or spouse. The victim's siblings are next in the order of recovery, eligible if the victim leaves no children or spouse. The victim's siblings are next in the order of recovery, eligible if the victim leaves no parents. Those unable to recover because other close family members are alive have been referred to as \"deferred beneficiaries.\" Cincoski v. Rogers, 4 Wis. 2d 423, 425, 90 N.W.2d 784, 786 (1958). As the next beneficiary becomes eligible, the prior beneficiary is ineligible if \"any such relative dies before judgment in the action * * *.\" Section 895.04(2). Note that Dolphus Bell's species of injury -- loss of society and companionship -- is a type which generally \"survives\" his death under the survival statute Section 895.01 (damage to the person), but in a wrongful death action Section 895.04(2) would preclude an award of damages to his estate for Daniel's death.\n\nThe Wisconsin wrongful death statute also limits the recovery for lost society and companionship. Section 895.04(4), though allowing unrestricted recovery for pecuniary injury, states that \"additional damages not to exceed $25,000 for loss of society and companionship may be awarded to the spouse or unemancipated or dependent children, or parents of the deceased.\" Therefore, if Wisconsin law were applied, the siblings could not recover for loss of society and companionship. Since this result is the same as that reached under the constitutional and Section 1983 policies discussed supra, there is no inconsistency. Therefore Wisconsin law applies to the siblings' claim, barring their recovery for loss of society and companionship. With respect to the claim of the father's estate, under Wisconsin wrongful death law the estate is barred from recovery since Dolphus was deceased \"before judgment in the action,\" Section 895.04(2), unless Wisconsin's survival statute Section 895.01 is construed to take precedence over wrongful death statute Section 895.04(2), in which case the estate could recover a maximum of $25,000.\n\nWe next consider whether the operation of Section 895.04(2) which, assuming it takes precedence over Section 895.01 and thus bars any recovery by Dolphus Bell's estate, is inconsistent with constitutional and Section 1983 policy.\n\nDolphus Bell died in 1962, while the defendants' conspiracy to conceal the true circumstances surrounding the shooting began in 1958 and extended into 1978. Section 895.04(2) makes no exception for a situation where, but for defendants' concealment of key evidentiary facts, the individual would have had a reasonable opportunity to present his or her case fairly. That a defendant should not benefit in any way by virtue of an unlawful act to deny others access to justice is fundamental to the policies and purposes of Sections 1983 and 1985, which were enacted to remedy, inter alia, the deprivation of due process by denying access to justice. (See the discussion in Part VIII C infra.) This policy applies where a plaintiff would have been alive at the time the crucial facts underlying a Section 1983 claim were exposed but for defendants' acts of concealment. Thus Section 1983 policy would be subverted if Wis. Stat. § 895.04(2) were applied to bar completely the society and companionship claim of Dolphus Bell's estate.\u003cspan class=\"fnref\"\u003e57\u003c/span\u003e Therefore the estate of Dolphus Bell is at least entitled to $25,000 for the loss of society and companionship under Wisconsin law.\n\nWhether the $25,000 damage limitation of Wis. Stat. § 895.04(4) is consistent with constitutional and Section 1983 policy is a more difficult question. State damage limitations can represent a well-founded concern by the legislature that juries may over-compensate plaintiffs, for such damages as loss of society and companionship, which are inherently difficult to estimate. See generally W. Prosser, Torts 907-908 (4th ed. 1971).This concern may be equally valid in the federal Section 1983 context which reaches killings only where the defendant acted under color of state law. Moreover, if in this case we consider Wis. Stat. § 895.04(4) to be consistent with federal Section 1983 policy, the estate could recover for loss of society and companionship in the not insignificant amount of $25,000.\n\nHowever, in the present case there is no indication that restricting the recovery for loss of society and companionship is necessary to satisfy the concern regarding overcompensation. Plaintiffs proffered substantial evidence regarding the warm and close relationship between Daniel Bell and his father.\u003cspan class=\"fnref\"\u003e58\u003c/span\u003e The jury considered the evidence, awarding Dolphus Bell's estate $75,000 for the loss of society and companionship, and in reviewing the record we cannot say that $75,000 is an unreasonable amount to award for the loss of a son. And as noted above a state law damage rule should not be applied where it is inconsistent with the constitutional right to be protected or the policy underlying Section 1983. Given the egregiousness of Grady's act, committed under color of state law, and the irreversible nature of the unconstitutional deprivation, it would be inconsistent with federal policy to limit the amount of damages awarded to Dolphus Bell's estate solely on the basis of the Wisconsin $25,000 tort law limitation.\n\nA federal policy in favor of compensation for harm resulting from deprivations of constitutional rights was enunciated in Carey v. Piphus, 435 U.S. 247, 55 L. Ed. 2d 252, 98 S. Ct. 1042 .In Carey public school officials on the ground that they had been suspended from school, allegedly without procedural due process. The Supreme Court held that in the absence of provable injury, the students were entitled to recovery only nominal damages. The Court also discussed the legislative history of Section 1983, observing that \"[the] Members of the Congress that enacted Section 1983 did not address directly the question of damages, but the principle that damages are designed to compensate persons for injuries caused by the deprivation of rights hardly could have been foreign to the many lawyers in Congress in 1871\" (footnote omitted). 435 U.S. at 255. The Court reviewed the express language in Sections 1983, 1985, and 1986 providing that defendants \"shall be liable\" for deprivations of rights and making specific references to damages. Against this statutory background, \"[the] Court implicitly has recognized the applicability of [the compensation] principle to actions under § 1983 by stating that damages are available under that section for actions \"found * * * to have been violative of * * * constitutional rights and to have caused compensable injury * * *.\" 435 U.S. at 255 (supplying emphasis, quoting Wood v. Strickland, 420 U.S. 308, 319, 43 L. Ed. 2d 214, 95 S. Ct. 992 ).\n\nAlthough the Court in Carey did not expressly equate compensation for unconstitutional deprivations with full compensation, where the evidence establishing the unconstitutional harm is compelling, such an inference is appropriate in light of Carey's persuasive analysis of the language respecting damages and the legislative history behind Section 1983. And as discussed supra, although the Supreme Court dismissed certiorari in Jones v. Hildebrant, 432 U.S. 183, 53 L. Ed. 2d 209, 97 S. Ct. 2283, and therefore did not decide the issue, both the majority and the dissent questioned the applicability of state damage restrictions on a beneficiary's Section 1983 action where the deprivation of a liberty right caused death. See also Robertson v. Wegmann, 436 U.S. 584, 590-591, 56 L. Ed. 2d 554, 98 S. Ct. 1991 (\"The policies underlying § 1983 include compensation of persons injured by deprivation of federal rights and prevention of abuses of power by those acting under color of state law.\"); Sullivan v. Little Hunting Park, Inc., 396 U.S. 229, 240, 24 L. Ed. 2d 386, 90 S. Ct. 400 (\"As we read § 1983, * * * both federal and state rules on damages may be utilized, whichever better serves the policies expressed in the federal statutes.\"); Bell v. Hood, 327 U.S. 678, 684, 90 L. Ed. 939, 66 S. Ct. 773 (\"Where federally protected rights have been invaded it has been the rule from the beginning that courts will be alert to adjust their remedies so as to grant the necessary relief.\").\u003cspan class=\"fnref\"\u003e59\u003c/span\u003e\n\nThe inapplicability of state law damage restrictions on recovery in favor of the deceased's parent in a Section 1983 action was noted, for example, in Sager v. City of Woodland Park, 543 F. Supp. 282 (D. Colo. 1982), discussed supra. Among the Section 1983 claims was a claim by the parents suing in their own interest for damages resulting from the shooting death of their son by a police officer. The court held that the state law limitations, which would preclude, inter alia, recovery for lost society and companionship, were inapplicable, remarking that the \"[recognition] of the proper function of § 1983, the differences in the policies underlying state law rights and constitutional rights and the particular need to apply these considerations to the more egregious constitutional violations requires application of the generally available § 1983 damage categories in the instant case.\" 543 F. Supp. at 296. But see Jackson v. Marsh, 551 F. Supp. 1091 (D. Colo. 1982) (holding that parents have no constitutionally-protected right of association with their children cognizable under Section 1983).\u003cspan class=\"fnref\"\u003e60\u003c/span\u003e\n\nOn the basis of Carey v. Piphus and decisions congruous with Carey, we therefore affirm the jury award of $75,000 in favor of Dolphus Bell's estate for the loss of society and companionship of Daniel Bell.\n\nVIII. CONSPIRACY CLAIMS OF DOLPHUS BELL AND THE SIBLINGS\n\nThe jury also awarded damages based upon the defendants' conspiracy to cover up the truth about Daniel Bell's death. The trial court, based upon the overwhelming evidence implicating Grady and non-defendant Krause, ruled that they conspired to cover up the true facts of the shooting and killing of Daniel Bell. The remainder of the conspiracy issues were submitted to the jury which found that Grady and Krause were joined in the conspiracy by defendants Milwaukee Chief of Police Howard Johnson and Detective Sergeant Edwin Shaffer, and by non-defendants Inspector of Detective Rudolph Glaser, Lieutenant of Detectives Leo Woelfel, and Milwaukee County District Attorney William McCauley. The jury found that the conspiracy deprived plaintiffs of due process of law and of racial equality, and that race was an operative factor.\u003cspan class=\"fnref\"\u003e61\u003c/span\u003e The jury awarded $75,000 damages against the defendants in favor of the estate of Dolphus Bell for deprivation of due process and $150,000 for deprivation of racial equality, and awarded the brothers and sister a total of $240,000 for deprivation of due process and $300,000 for deprivation of racial equality. In addition, the jury assessed the amount of punitive damages appropriate to each conspirator. Grady ($25,000), Johnson ($15,000), Shaffer ($350,000), Woelfel ($75,000), and Glaser ($100,000).\u003cspan class=\"fnref\"\u003e62\u003c/span\u003e The district court did not include Krause's or McCauley's name in the special verdict question on punitive damages.\u003cspan class=\"fnref\"\u003e63\u003c/span\u003e\n\nOn several grounds the defendants attack the conspiracy finding and the damage awards based on the conspiracy finding and the damage awards based on the conspiracy. Unlike the issues arising from the killing, there is no analogous state law in dispute. Most fundamentally, defendants argue that the conduct of the defendants' did not amount to a conspiracy which deprived Bell family members of any constitutional rights protected under the civil rights statutes. Though defendants concede that Grady and Krause distorted the facts surrounding the shooting of Bell, they also challenge the sufficiency of the evidence linking co-defendants Johnson and Shaffer to Grady's and Krause's efforts to conceal the truth. In addition, the defendants contend that the compensatory damages awards for these alleged deprivations were not supported by evidence of actual injury, and further that separate damages for deprivations of due process and racial equality are redundant. They also argue that the punitive damage awards were excessive and not based upon competent evidence.\n\nAs an introductory matter, to sustain their causes of action for the conspiracy under 42 U.S.C. §§ 1981, 1983, 1985(2) and 1985(3), plaintiffs must show that (1) a conspiracy existed and that (2) the conspiracy deprived them of rights protected by federal law. Regarding (1), the essence of plaintiffs' conspiracy claim is that defendants Grady, Johnson, and Shaffer (along with the non-defendants) concealed and distorted key facts surrounding the shooting and killing of Daniel Bell. Regarding (2), plaintiffs argue that the conspiracy to distort and conceal the facts denied the Bell family equal protection of the laws and interfered with their due process right to pursue their claims against Grady. They contend they are entitled to recover for damages resulting from these violations, which were motivated by invidious racial discrimination, on the basis of Sections 1985(2) and (3) (conspiracy to deprive constitutional rights), 1981 (interference with right \"to sue\" and \"give evidence\"), 1983 (deprivation of constitutional rights under color of state law), and 1986 (neglect to prevent Section 1985 conspiracy).\n\nWith respect to the Bell family's claims against Grady for the shooting, regardless of what a hypothetical court would have held in 1958, we have held above the Daniel Bell's father possessed a valid claim under Section 1983 for the destruction of his parent-child relationship with Daniel. The same facts about Daniel's death gave Dolphus Bell a claim under state law for Daniel's wrongful death, at least for loss of society and companionship allowed under Wisconsin law and for funeral expenses incurred. Of course, Dolphus Bell did file a wrongful death action in state court. But as previously discussed, the defendants' concealment of the truth precludes the application of res judicata and the statute of limitations.\n\nAs we discuss infra, the impact of the conspiracy, if sustainable upon the rights of Daniel Bell's siblings presents a more difficult issue. We have already held that they may not recover for loss of society and companionship under Section 1983. Moreover, even if they had possessed full knowledge of the facts surrounding the shooting, Wisconsin tort law does not give them a right to recover absent proof of pecuniary injury.\n\nA. Conspiracy to Conceal the Facts\n\nIt must first be determined whether plaintiffs adduced sufficient evidence to establish a conspiracy to conceal the facts and to establish that Johnson and Shaffer were members of the alleged conspiracy.\u003cspan class=\"fnref\"\u003e64\u003c/span\u003e As this Court outlined in Hampton v. Hanrahan, 600 F.2d 600 (7th Cir. 1979), reversed in part on other grounds, 446 U.S. 754, 100 S. Ct. 1987, 64 L. Ed. 2d 670:\n\nA civil conspiracy is \"a combination of two or more persons acting in concert to commit an unlawful act, or to commit a lawful act by unlawful means, the principal element of which is an agreement between the parties \"to inflict a wrong against or injury upon another,\" and \"an overt act that results in damage,\" Rotermund v. United States Steel Corp., 474 F.2d 1139 (8th Cir. 1973) (citation omitted).\n\nA plaintiff seeking redress need not prove that each participant in a conspiracy knew the \"exact limits of the illegal plan or the identity of all participants therein.\" Hoffman-LaRoche, Inc., supra, 447 F.2d [872 (7th Cir. 1971)] at 875. An express agreement among all the conspirators is not a necessary element of a civil conspiracy. The participants in the conspiracy must share the general conspiratorial objective, but they need not know all the details of the plan designed to achieve the objective or possess the same motives for desiring the intended conspiratorial result. To demonstrate the existence of a conspiratorial agreement, it simply must be shown that there was \"a single plan, the essential nature and general scope of which [was] known to each person who is to be held responsible for its consequences.\" Id.\n\n600 F.2d at 620-621.\n\nRarely in a conspiracy case will there be direct evidence of an express agreement among all the conspirators to conspire. As the Court also pointed out in Hoffman-LaRoche, Inc. v. Greenberg, 447 F.2d 872, 875 (7th Cir. 1971), \"circumstantial evidence may provide adequate proof of conspiracy.\" This does not imply, however, in an action against government officials, especially against supervisory officials such as Chief of Police Johnson, that one can infer a supervisor's participation in a conspiracy simply on the basis of his supervisory position. In Rizzo v. Goode, 423 U.S. 362, 46 L. Ed. 2d 561, 96 S. Ct. 598, the Court reversed the lower court's grant of injunctive relief against Philadelphia police department officials and the City because the plaintiffs had failed to establish an \"affirmative link between the occurrence of the various incidents of police misconduct and the adoption of any plan or policy by petitioners -- express or otherwise -- showing their authorization or approval of such misconduct.\" Rizzo v. Goode, 423 U.S. at 371. Although Rizzo involved plaintiffs who sought broadbased equitable relief, this same standard has been adopted and applied in cases involving monetary relief brought under Section 1983. E.g., Hays v. Jefferson County, Kentucky, 668 F.2d 869, 873-874 (6th Cir.), certiorari denied, 459 U.S . 833, 103 S. Ct. 75, 74 L. Ed. 2d 73 ; Leite v. City of Providence, 463 F. Supp. 585, 590 (D.R.I. 1978); Perry v. Elrod, 436 F. Supp. 299, 303-304 (N.D. Ill. 1977). Thus \"at a minimum plaintiff must show that the official at least implicitly authorized, approved, or knowingly acquiesced in the unconstitutional conduct of offending officers.\" Hays, supra, 668 F.2d at 874. But in the context of a Section 1985 conspiracy, liability may also be predicated upon not only participation but upon neglect to prevent under Section 1986. The requisite affirmative link under Section 1986 is that the person have \"knowledge that any of the wrongs conspired to be done, and mentioned in section 1985 * * * are about to be committed\", possess the \"power to prevent or aid in preventing\" them, and that the \"reasonable diligence\" of that person could have prevented the commission of any of the wrongs conspired to be done, 42 U.S.C. § 1986. See Vietnamese Fishermen's Association v. Knights of the Ku Klux Klan, 518 F. Supp. 993, 1006 (S.D. Tex. 1981).\n\nWe must consider the conduct of the defendants against these legal standards. It is patently clear that the lies of Officers Grady and non-defendant Krause evidence that they conspired to conceal the facts of the shooting and killing of Daniel Bell. After the shooting they agreed to represent falsely that when Daniel Bell jumped out of his car, he yelled, \"You sons of bitches won't get me, I'm a holdup man.\" They agreed to abide by the claim that they saw a large knife in one of Bell's hands, and that these circumstances, along with Grady's alleged belief that Bell was a fleeing felon, justified the shooting, though they claimed that Grady shot Bell from a distance. No specific finding of fact was made at trial regarding whether Grady's belief on a police bulletin, was reasonable, but the knife and \"holdup man\" contrivances, as Grady and Krause admitted at trial, are patently false.\n\nWhen on the morning after the shooting this initial version of what happened appeared suspect, and the distance discrepancy in their initial reports surfaced, Grady modified the story, reducing the putative distance at which he shot Bell and including the knife slashing. Instead of exposing the falsehoods at this time or disputing the new lies offered by Grady, Krause acquiesced and expressly supported this modified version of the incident. When the autopsy report disclosed that Bell was shot from an even closer distance than proffered in the modified version of the incident, Krause again perpetuated the conspiracy, testifying at the inquest that when Bell was shot Grady's extended arm was within a foot of Bell. Finally, in the 1978 recorded telephone conversations Grady again sought to maintain the conspiracy, urging Krause not to disclose the truth. It is therefore incontrovertible that Grady and Krause conspired to conceal the facts of the shooting of Daniel Bell.\n\nWhether plaintiffs presented sufficient evidence to show that defendants Johnson and Shaffer were participants in the conspiracy initiated by Grady and Krause is a closer question. Plaintiffs did not present any evidence establishing that Johnson or Shaffer actually knew what really happened, or that Grady or Krause informed them they were lying.\u003cspan class=\"fnref\"\u003e65\u003c/span\u003e Grady testified he never told Johnson or Shaffer the truth. The question then becomes, under the standard articulated in Hampton v. Hanrahan, Hays v. Jefferson County, Kentucky, and other cases cited supra, whether sufficient circumstantial evidence exists for a reasonable jury to conclude that Johnson and Shaffer implicitly authorized or approved of the conspiratorial conduct of Grady and Krause and shared the same general conspiratorial objective, thereby becoming participants in the conspiracy.\n\nShaffer was present at the critical February 3, meeting in District Attorney McCauley's office involving McCauley, Glaser, Woelfel, Vorpagel, Grady, and Krause. As Vorpagel testified, the initial distance discrepancy was raised, i.e., Grady had shown Vorpagel the substantial distance from which Grady allegedly shot Bell, measured at 23'9\"; yet Krause's report estimated the distance at ten to fifteen feet. At this time Grady adopted his modified version involving Bell's slashing with a knife and a shooting distance of approximately six feet. Along with McCauley, Shaffer implicitly adopted this modified version, though it obviously conflicted with Vorpagel's understanding of the incident\u003cspan class=\"fnref\"\u003e66\u003c/span\u003e and the police reports written the night before. When reporters were called into McCauley's office (after Vorpagel, Woelfel, and Glasser exited), Shaffer stood by as McCauley staged the explanation of the new version without any hint of the discrepancies.\n\nThe Milwaukee Journal article dated February 5 stated that Shaffer refused to permit a reporter to copy the later \"attempted aggravated assault\" reports verbatim even though the reporter had been permitted to copy the \"homicide\" reports. Additionally, Shaffer's internal memorandum to McCauley dated February 10 described the shooting as follows:\n\nBell slashed at Grady a second time in front of [2650 North 6th Street] and Grady drew his gun and shot Bell as he was turning to flee for a second time. During the course of the pursuit of Bell, Grady and fired one warning shot into the air and Krause fired four warning shots into the air.\n\nThe memorandum does not refer to the discrepancies in the versions of the incident regarding the distance at which Grady shot Bell; nor does it state that on the night of the shooting Grady did not mention the knife slashing.\n\nIn addition, Shaffer's participation in and alignment with the cover-up is shown by his disingenuous testimony at the inquest, wherein he stated that Grady had told him on the night of the shooting that he shot Bell at close range after Bell slashed at him with a knife. Plaintiffs therefore adduced sufficient evidence for the jury reasonably to find Shaffer a member of the conspiracy.\n\nIn regard to Johnson, at trial he characterized his position of chief of police as administrative and separate from the investigatory duties of Woelfel, Glaser, Shaffer, Vorpagel, and other members of the detective bureau. Plaintiffs introduced no evidence establishing that Johnson was present at any meeting with Grady, Krause, and the others from which one might infer conspiratorial agreement. Johnson testified that the only relevant discussion he had after his brief initial meetings with Vorpagel and Grady and with McCauley, wherein McCauley informed Johnson of the autopsy report results. Johnson testified that McCauley simply said that the results indicated Grady shot Bell at \"close\" distance, \"as close as you to me\" (the report actually said the revolver was within inches of Bell's coat), and that this statement supported Grady's earlier explanation of the incident to Johnson. Johnson did not testify at the inquest and claimed in the trial below that his knowledge of the inquest testimony of the police officers and the jury finding of justifiable homicide was based on news articles.\n\nIt is clear that Johnson was at least cognizant of the glaring conflicts in Grady's explanation. Johnson learned from Vorpagel that Grady had indicated where he stood in relation to Bell when the fatal shot was fired, and that this distance measured 23\"-9\".Soon thereafter Grady told Johnson he was within a few feet, and that he and Bell were fighting. No mention of fighting had been made in Grady's initial report. Johnson testified at trial that he never read any of the relevant police reports (except for the diagram of the shooting scene completed by Vorpagel and Hughes) or spoke with reporters. He is quoted, however, in several newspaper articles, including the Milwaukee Journal article dated February 3, the Milwaukee Sentinel article dated February 4, and the Journal article, dated February 5. The article dated February 5 quotes him as saying inter alia, that he did not know exactly when the \"attempted aggravated assault\" reports were written, but after the incident was originally written up as a homicide, \"I noticed there was more to it and asked for another report, and they provided it * * *.\"\n\nBut these articles, even assuming they accurately quote Johnson, merely indicate that Johnson was cognizant of various police reports and to some extent involved in the investigation. Grady, Krause, and the others may have intended to conceal the truth from their chief of police just as they sought to conceal the truth from the public. The jury was free to disbelieve Johnson's rather suspect claim that he never read any of the police reports or spoke with reporters, but even if completely disbelieved, the evidence adduced by plaintiffs does not establish explicit or tacit authorization or approval of the conspiratorial acts of Grady, Krause, Shaffer, and the other alleged conspirators.\n\nThe evidence at trial was, however, sufficient to establish Johnson's liability for the conspiracy under Section 1986.The jury could reasonably conclude Johnson knew of the glaring inconsistencies in the explanation of the shooting, particularly those found in the homicide reports versus the attempted aggravated assault reports. Section 1986 liability is based upon the \"power to prevent or aid in preventing the commission of [any of the wrongs conspired to be done],\" and requires that the prevention of such wrongs could have been accomplished through \"reasonable diligence.\" As chief of police, Johnson had supervisory power over all other alleged conspirators except McCauley. As the ultimate supervisor, cognizant soon after the shooting of both the gravity of the matter and the inconsistencies in the explanations of the shooting, it is an inevitable conclusion that Johnson could have through reasonable diligence prevented or at least aided in preventing Grady, Krause, and others from concealing the truth. Inspector of Detectives Glaser, Captain of Detectives Woelfel, and the patrolmen manipulated the facts and packaged the incident without any apparent interference from their ultimate supervisor. Milwaukee Police Department internal rules require that the chief of police confer regularly with district commanders and the inspector of detectives to be fully advised on all matters of \"serious departmental concern.\" Johnson testified he was cognizant of the internal rules and that the Bell killing was a matter of serious departmental concern; yet he testified he never spoke with district commanders or Inspector of Detectives Glaser with respect to the matter. Johnson's disregard of his obligation under departmental rules evidences his failure to exercise reasonable diligence in connection with the Bell matter. By neglecting to scrutinize and deter the efforts of Grady and the others to conceal the truth, Johnson is liable under Section 1986.\u003cspan class=\"fnref\"\u003e67\u003c/span\u003e\n\nB. Invidious Discrimination\n\nDefendants challenge the jury finding that race was an operative factor in conspiring to obstruct the Bell family's efforts to seek redress. As mentioned earlier, a showing of invidious racial discrimination is required under Section 1985(3). Under the second portion of Section 1985(2), a showing of discrimination is required in the sense that the provision prohibits conspiracies hindering the due course of justice where the conspirators acted \"with intent to deny to any citizen the equal protection of the laws.\" See Griffin v. Breckenridge, 403 U.S. 88, 102, 29 L. Ed. 2d 338, 91 S. Ct. 1790 . It is not necessary to show that discrimination was the sole reason for the defendants' acts. Payne v. Bracher, 582 F.2d 17, 18 (5th Cir. 1978). In contrast, Section 1981 is expressly limited to discrimination based on race or alienage.\n\nThe evidence presented by plaintiffs at trial was sufficient to support an inference that the conspiracy was motivated at least in part by invidious discrimination against blacks. While one of the motives was to protect Grady and the general reputation and perceived integrity of the Milwaukee Police Department, sufficient evidence was presented at trial to support an inference that Grady in particular and the co-conspirators in general sought to prevent the Bell family from asserting their rights because they were black. The defense did not successfully controvert Krause's testimony regarding the racist statements made by Grady the night of the shooting. Further, Vorpagel testified that soon after the shooting Grady showed Vorpagel a letter from \"the citizens of Milwaukee,\" in effect congratulating Grady, an officer who \"knows how to do the job. That's the way to take care of niggers\" (Tr. 2349). Vorpagel testified that Grady's tone of voice was \"that of being proud of what he had done, bragging about what he had done, and feeling good that the citizens of the City of Milwaukee were giving him support\" (Tr. 2350). Finally, on the night of the shooting a police officer allegedly lashed out at members of the Bell family, calling them \"niggers\" and threatening them with jail when they earnestly asked for an explanation. The above statements also indicate that animus was classbased, and not simply evincing a personal dislike for the plaintiffs in particular. And while derogatory references to racial or ethnic background by themselves obviously do not rise to the level of a deprivation of constitutional rights, see Croy v. Skinner, 410 F. Supp. 117 (N.D. Ga. 1976), they do support a finding of racial animus, which is simply a requisite element of some Section 1985 claims. Though the identification of Shaffer as making the above racial epithet is uncertain,\u003cspan class=\"fnref\"\u003e68\u003c/span\u003e the jury could reasonably have chosen to believe that Shaffer did make the statement. Moreover, sufficient evidence of racial animus was adduced as to Grady, and racial animus of a key conspiratorial actor who initiates and maintains the conspiracy is sufficient to establish conspiracy racial animus under Section 1985.\n\nGrady argues that, unlike the others, he and Krause possessed the motivation to save their jobs, and did not act with racial animus. This argument is rejected. As we pointed out supra, under Hampton v. Hanrahan, 600 F.2d 600, 621 (7th Cir. 1979), reversed in part on other grounds, 446 U.S. 754, 100 S. Ct. 1987, 64 L. Ed. 2d 670, the participants in the conspiracy must share the general conspiratorial objective, but they need not know all the details of the plan or possess exactly the same motives as the other conspirators. It was established at trial that the race of the Bell family was an operative factor in the efforts of Grady to conceal the facts surrounding the killing of Daniel Bell; therefore additional personal motivations do not negate the findings of a common general conspiratorial objective and racial animus.\n\nC. Deprivation of Due Course of Justice\n\nWhether the concealment of the facts of the shooting of Daniel Bell deprived Dolphus Bell and the siblings of a federally-protected due process right is the next question for discussion.\n\nThough a conspiracy claim for unconstitutional deprivations committed under color of law can be made under Section 1983 and under Section 1981 (in the latter case where the right \"to sue\" is interfered with on the basis of race), hereinafter we refer to plaintiffs claims for unconstitutional deprivations arising from the conspiracy in terms of Section 1985 for several reasons. First, plaintiffs at trial specifically established an unlawful conspiracy, and Section 1985 explicitly addresses conspiracies which deprive individuals of their federal rights.\u003cspan class=\"fnref\"\u003e69\u003c/span\u003e Second, plaintiffs have successfully established that invidious discrimination was an operative factor in the conspiracy, and such a showing is necessary under certain Section 1983. Further, plaintiffs in this case are not afforded any greater rights under Sections 1981 and 1983 than under Section 1985 which protects, inter alia, plaintiffs' right to due process an equal protection of the laws.\u003cspan class=\"fnref\"\u003e70\u003c/span\u003e\n\nLast year the Fifth Circuit confronted a similar scenario in Ryland v. Shapiro, 708 F.2d 967 (5th Cir. 1983). There the plaintiffs alleged that their daughter had been wrongfully killed by a local prosecutor and that two other prosecutors conspired to prevent a police investigation and to cover up the facts about the death for nearly a year. The conspirators attempted to camouflage the true cause of death by representing that the death was a suicide. The alleged murder cover-up was subsequently exposed by the state attorney general, who obtained a conviction of the local prosecutor for the murder. Plaintiffs brought a civil conspiracy action under Sections 1983 and 1985 on the grounds that defendants' acts wrongfully interfered with their access to state court to pursue their state law wrongful death action. Unlike the instant case, plaintiffs did not claim that the killing was committed under color of state law. The district court dismissed the complaint construing it to allege only a \"generalized grievance,\" namely, \"the enforcement of the criminal laws.\" Ryland, supra, 708 F.2d at 970. The court of appeals reversed and remanded, holding that the district court had failed to recognize plaintiffs' legal theory of the due process right of access to courts. 708 F.2d at 970-975.\n\nWe agree with that holding, and in the case before us, of course, the plaintiffs have gone much further. They have not only alleged but have also satisfied a jury that the conspiracy deprived plaintiffs of their federally-protected due process right of access to the courts.\n\nThe Fourteenth Amendment entitles the individual to a fair opportunity to present his or her claim. Armstrong v. Manzo, 380 U.S. 545, 552, 14 L. Ed. 2d 62, 85 S. Ct. 1187 ; Boddie v. Connecticut, 401 U.S. 371, 28 L. Ed. 2d 113, 91 S. Ct. 780 ; Logan v. Zimmerman Brush Co., 455 U.S. 422, 437, 71 L. Ed. 2d 265, 102 S. Ct. 1148 . Such a right exists where the claim has \"a reasonable basis in fact or law.\" Bill Johnson's Restaurants, Inc. v. N.L.R.B., 461 U.S. 731, 103 S. Ct. 2161, 2173, 76 L. Ed. 2d 277 . Defendants in effect contend that even if we find that the alleged conspirators did conspire to conceal the facts, such concealment does not amount to the deprivation of their constitutional rights. We reject this contention. As the Fifth Circuit held in Ryland v. Shapiro, supra, a conspiracy to cover up a killing, thereby obstructing legitimate efforts to vindicate the killing through judicial redress, interferes with the due process right of access to courts, which is protected by Sections 1985(2) and 1985(3).\u003cspan class=\"fnref\"\u003e71\u003c/span\u003e Judicial access must be \"adequate, effective, and meaningful.\" Bounds v. Smith, 430 U.S. 817, 822, 52 L. Ed. 2d 72, 97 S. Ct. 1491 . To deny such access defendants need not literally bar the courthouse door or attack plaintiffs' witnesses. This constitutional right is lost where, as here, police officials shield from the public and the victim's family key facts which would form the basis of the family's claims for redress. A contrary interpretation of the right to due process would encourage police officials to conceal the circumstances relating the unlawful killings committed under color of state law and other deprivations of federal rights which Section 1983 was designed to remedy. See also Hampton v. Hanrahan, 600 F.2d 600, 628 (7th Cir. 1970), reversed in part on other grounds, 446 U.S. 754, 100 S. Ct. 1987, 64 L. Ed. 2d 670 (directed verdict for defendants in civil rights conspiracy action reversed and remanded because, inter alia, federal law enforcement defendants engaged in \"dilatory and obstructive tactics to conceal evidence\" regarding an unlawful raid); Stone v. City of Chicago,738 F.2d 896 (7th Cir. 1984); Britt v. Suckle, 453 F. Supp. 987 (E.D. Tex. 1978).\n\nThough Dolphus Bell filed a wrongful death claim in state court soon after the killing, the cover-up and resistance of the investigating police officers rendered hollow his right to seek redress, either under Wisconsin wrongful death law or federal civil rights laws. Defendants portray as a natural product of the adversarial system the transformation of a police shooting of an unarmed man in the back into a killing in self-defense of a suspected felon, fleeing after a knife attack on a police officer. So gross a distortion of the facts cannot be countenanced.\n\nThis case is therefore distinguishable from those where a plaintiff simply alleges that law officers were lax in their investigatory duties. See, e.g., Scolnick v. Winston, 219 F. Supp. 836, 841 (S.D.N.Y. 1963)(alleged failure of state attorney general and assistant attorney general to investigate charges by plaintiffs of threats to their lives did not deprive plaintiffs of equal protection), affirmed, 329 F.2d 716 (2d Cir. 1964), certiorari denied, 379 U.S. 825, 13 L. Ed. 2d 35, 85 S. Ct. 49 ; cf. Jackson v. City of Joliet, 715 F.2d 1200 (7th Cir. 1983)(ineffective rescue attempt by city employees does not constitute deprivation of life without due process), certiorari denied, 465 U.S. 1049, 104 S. Ct. 1325, 79 L. Ed. 2d 720; Beard v. O'Neal, 728 F.2d 894 (7th Cir. 1984) (in a Bivens action F.B.I. informant who accompanied the murder did not proximately cause a deprivation of constitutional rights, where the witness did not conspire to commit or approve of the act and did not take dramatic steps to prevent the murder for fear of his own safety).\n\nThis case is especially distinguishable from Jackson v. City of Joliet, supra, since here, unlike Jackson, the underlying injury (i.e., the killing of Daniel Bell) was caused by a governmental official acting under color of law and member of the subsequent conspiracy. Jackson prudently holds that the due process clause does not impose a duty upon a municipal employees to provide flawless and abundant social services. Yet the constitutional \"duty\" imposed in this case is simply the requirement that municipal employees involved in the investigation of a wrong perpetrated by a co-employee under color of state law not conceal the perpetration of that wrong. The facts surrounding the killing were in the sole province of members of the Milwaukee police department. Officers Grady and Krause willfully and intentionally lied and concealed the true facts. Although the record below does not conclusively establish that Johnson, Shaffer, or nondefendants Woelful, Glaser, and McCauley had complete knowledge of what happened the night of the killing, the record does show that they were cognizant of glaring inconsistencies and conflicts in Grady's explanation, and in some instances facilitated an explanation more favorable to the police department. The inquest jury's incorrect finding of self-defense is a partial product of the false testimony of Grady, Krause, and Shaffer, and the biased examination of witnesses by District Attorney McCauley. This finding presented a formidable obstacle to learning the facts and vindicating Daniel Bell's death. From the testimony of Hughes, Vorpagel, Krause, and the extensive body of documentary evidence the jury could reasonably conclude that the concealment interfered with the Bell family's efforts to seek redress, particularly Dolphus Bell's wrongful death action brought against the City of Milwaukee and Grady.\n\nIn regard to the brothers and sister of Daniel Bell, though they were similarly obstructed in learning the truth, the issue arises as to whether the siblings can recover under Section 1985 notwithstanding their lack of recovery under Wis. Stat. § 895.04(4) (recovery only for pecuniary injury) and 42 U.S.C. § 1983 in connection with the killing. Our holding that sibling society and companionship interests do not rise to the level of Fourteenth Amendment protection in the context of Section 1983 actions certainly does not lend support to the siblings Section 1985 claim. However, Section 1985 is not limited to protecting the right of access to justice of only those individuals who will ultimately prevail in the judicial process. It reaches, inter alia, conspiracies to impede the \"due course of justice * * * with intent to deny to any citizen the equal protection of the laws.\" Section 1985(2), second portion. As the Supreme Court enunciated in Wolff v. McDonnell, 418 U.S. 539, 579, 41 L. Ed. 2d 935, 94 S. Ct. 2963, \"the right of access to the courts * * * is founded in the Due Process Clause and assures that no person will be denied the opportunity to present to the judiciary allegations concerning violations of fundamental constitutional rights\" (emphasis added). The right to seek judicial redress is also grounded in the First Amendment. As the Supreme Court observed in California Motor Transport Co. v. Trucking Unlimited, 404 U.S. 508, 510 , 30 L. Ed. 2d 642, 92 S. Ct. 609, \"Certainly the right to petition extends to all departments of Government. The right of access to the courts is indeed but one aspect of the right of petition.\" See also NAACP v. Button, 371 U.S. 415, 9 L. Ed. 2d 405, 83 S. Ct. 328 . These constitutional guarantees are not so narrowly defined as to extend only to those potential litigants who will ultimately prevail. To define them so narrowly would be imprudent and illogical: not only is it often impossible to determine ex post), but only to afford potentially prevailing parties the right of access would stymie the evolutionary process of the law. A contrary rule might create a perverse incentive for litigants who are confident of a favorable outcome to falsify crucial facts, knowing their conduct is insulated from reproach if their outcome prediction turns out to be accurate. Thus the siblings' lack of recovery under Section 1983 does not vitiate their Section 1985 claim. The Fourteenth Amendment confers the right to a fair opportunity to present a claim, and the siblings' Section 1983 claim has \"a reasonable basis in fact or law\" under the standard articulated in Bill Johnson's Restaurants, Inc. v. N.L.R.B., supra; therefore, they are entitled to judicial access that is \"adequate, effective, and meaningful.\" Bounds v. Smith, 430 U.S. 817, 822, 52 L. Ed. 2d 72, 97 S. Ct. 1491 .\n\nThe right of access to the courts also tracks into the language of Section 1985(3), which creates a cause of action against conspiracies designed to deprive \"persons of the equal protection of the laws, or of equal privileges and immunities under the laws * * *.\" The link between Section 1985(3) and the right of access to the courts is supported by the Supreme Court's characterization of the right in Chambers v. Baltimore \u0026 O.R.R., 207 U.S. 142, 52 L. Ed. 143, 28 S. Ct. 34 in the following terms:\n\nThe right to sue and defend in the courts is the alternative of force. In an organized society it is the right conservative of all other rights, and lies at the foundation of orderly government. It is one of the highest and most essential privileges of citizenship, and must be allowed by each state to the citizens of all other states to the precise extent that it is allowed to its own citizens. Equality to treatment in this respect is not left to depend upon comity between the states, but is granted and protected by the Federal Constitution.\n\n207 U.S. at 148. Thus, the Court has viewed the right of access to the courts as one of the privileges and immunities accorded citizens under article IV of the Constitution and the Fourteenth Amendment. See also Ryland v. Shapiro, 708 F.2d 967, 971 (5th Cir. 1983). Section 1985(3) protects such privileges and immunities where, as in the case of Daniel Bell's siblings, the conspirators act with a racial or other class-based animus.\u003cspan class=\"fnref\"\u003e72\u003c/span\u003e\n\nThe jury verdict in favor of Daniel Bell's siblings on the conspiracy claim is also sustainable on the ground that the conspiracy interfered with their federal rights to pursue the Section 1983 claims of the estates of both Daniel and Dolphus Bell. We have held that both Daniel and Dolphus Bell. We have held that both estates had valid causes of action under Section 1983 for the killing itself, apart from the conspiracy. After Dolphus Bell's death in 1962, Patrick Bell, Sr., became the administrator of both estates, and the brothers and sister are the residual beneficiaries of both estates. The brothers and sister therefore have property interests in the estates' causes of action. See Barrett v. United States, 689 F.2d 324, 332-333 (2d Cir. 1982). The conspiracy obstructed the prosecution of those claims for over twenty years, thus making the brothers and sister the ultimate victims of the cover-up conspiracy.\n\nSeveral courts have held in cases involving alleged conspiracies to cover up the truth about police killings that the cover-up does not violate any rights of the deceased. Courts have reasoned that the deceased is no longer a \"person\" within the meaning of Section 1983 and 1985 and therefore has no rights with which a post-death conspiracy could interfere. See, e.g., Guyton v. Phillips, 606 F.2d 248, 250 (9th Cir. 1979), certiorari denied, 445 U.S. 916, 63 L. Ed. 2d 600, 100 S. Ct. 1276 ; Whitehurst v. Wright, 592 F.2d 834, 840-841 (5th Cir. 1979); McQurter v. City of Atlanta, 572 F. Supp. 1401, 1419 (N.D. Ga. 1983). However, these courts have been careful to limit their holdings to claims asserting that cover-up conspiracies violated rights of the deceased. For example, in Whitheurst v. Wright, the Fifth Circuit expressly stated that is was not holding that a cover-up of a death \"is without civil or criminal effect.\" 592 F.2d at 841. In a footnote the court suggested that the cover-up allegation was analogous to interference with a dead body, and the court noted that in such situations the cause of action for the wrong belongs not to the deceased (or even the estate) but instead to the survivor. Id. at 840 n.9. The intimation is clear that a cover-up conspiracy can violate the rights of the deceased's survivors. The Fifth Circuit recently recognized that the holding in Whitheurst did not apply to a case such as this one involving an alleged conspiracy to cover up a death where the conspiracy allegedly violated the victim's parents' rights to bring a wrongful death claim. Ryland v. Shapiro, supra, 708 F.2d at 973 n.6.\n\nThis view is also supported by Barrett v. United States, 689 F.2d 324, 332-333 (2d Cir. 1982). There the administratrix of the deceased's estate brought claims under Section 1983 against state officials (among others) based on an alleged conspiracy to conceal the facts of the death. The Second Circuit held that the individuals represented through the estate could maintain an action based on the conspiracy's alleged interference with the pursuit of wrongful death claims through the estate.\n\nWe think it is clear that the fact that the victim is dead does not mean a cover-up conspiracy does not conceivably have victims. Where the estate of a deceased person has a valid cause of action and where the wrongful actors conspire to prevent the prosecution of the claim in contravention of Section 1985, the conspiracy's victims are the deceased survivors. In this case the conspiracy deprived the heirs of property without due process of law and obstructed their right of access to the courts. The estate might not be a \"person\" and Sections 1983 and 1985, Guyton v. Phillips, supra, but the survivors clearly are. The brothers and sister established all other elements of their Section 1985 claim and were themselves the direct targets of a racially-motivated cover-up conspiracy. The conspiracy deprived them of their right to press valid claims through the estates of Daniel and Dolphus Bell; therefore the siblings properly recovered under Section 1985(2) (second portion) and 1985(3) for the injuries resulting from the conspiracy.\n\nAlthough plaintiffs have established that defendants deprived them of their constitutional rights, remediable under Section 1985, our holding is limited to the particularly egregious set of facts herein. After the reckless and completely inexcusable killing by a police officer, instead of searching for and revealing the true circumstances the conspirators did everything in their power to cover up and conceal the facts within their sole control. Efforts of the Bell family to learn the truth were rebuffed, partly because of racial discrimination. What the Bell family has suffered is qualitatively different than \"[i]solated threats and accusations, coupled with derogatory references to plaintiff's character and ethnic background [which] simply do not state a claim for conspiratorial action in violation of plaintiff's civil rights.\" Croy v. Skinner, 410 F. Supp. 117, 127 (N.D. Ga. 1976). Not every act of deception in connection with a judicial proceeding gives rise to an action under Section 1985. Cf. Brown v. Chaffee, 612 F.2d 497 (10th Cir. 1979) (without a showing of intimidation or threat to deter testimony, no Section 1985(2) (first clause) recovery in order merely because attorneys in prior civil fraud action failed to provide effective defense; state law fraud or malpractice are the only conceivable bases for recovery). Finally, we do not hold that Section 1985 creates a cause of action against all law officers who in the course of an investigation, for legitimate reasons delay judicial proceedings or fail to disclose crucial information. The federal Constitution does not moderate all disputes between individuals and unresponsive law officers. Rather, the political process is the ultimate check on local government.\n\nD. Compensatory Damages\n\nThe appropriate measure of damages for the conspiracy claims presents several issues. While the conspiracy delayed the successful assertion of the Section 1983 claims, it did not permanently prevent their assertion. Therefore, the damages awards for the conspiracy claims -- for the deprivation of due process and equal protection -- must be founded on injuries resulting from the conspiracy itself, including the twenty-year delay in obtaining recovery for Daniel's death, and not upon the presumption that the conspiracy ultimately succeeded in denying any of plaintiffs' rights.\n\nCarey v. Piphus, 435 U.S. 247, 55 L. Ed. 2d 252, 98 S. Ct. 1042, discussed supra, requires that plaintiffs prove legally cognizable injuries resulting from the deprivation of constitutional rights in order to recover anything but nominal damages; in constitutional cases, damages are not presumed. However, the Supreme Court made it clear in Carey that plaintiffs could recover damages for, among other injuries, emotional distress resulting from a deprivation. 425 U.S. at 262-263 and n. 20; see also Mary Beth G. v. City of Chicago, 723 F.2d 1263, 1275-1276 (7th Cir. 1983); Lenard v. Argento, 699 F.2d 874 (7th Cir. 1983), certiorari denied, 464 U.S. 815, 104 S. Ct. 69, 78 L. Ed. 2d 84 ; Ryland v. Shapiro, 708 F.2d 967, 976 (5th Cir. 1983).\n\nAt trial in this case, the plaintiffs introduced substantial evidence of emotional distress suffered by Dolphus Bell and Daniel's siblings resulting from the cover-up. There was substantial testimony of the denial of access to justice as plaintiffs frustratingly and fruitlessly sought to bring out the trust so that they might obtain a fair hearing. Sylvia White Bell testified to the painful experience of the family's efforts to bring out the truth, commencing the night of the killing, continuing on through the inquest, the 1960 action, and on up to the present action. Henry Bell testified to the suffering of Dolphus Bell in his efforts to vindicate the loss of his son's life and to obtain justice in Milwaukee. On the matter of denial of equal protection there was not only indirect evidence of discriminatory treatment but also direct evidence of out-right threats of jail accompanied by racist remarks as the family tried to brink out the facts. Grady created a formidable barrier to the family's efforts to vindicate Daniel Bell's death by lying about having been attacked, and manufacturing false evidence by placing a knife in Daniel Bell's hand.\u003cspan class=\"fnref\"\u003e73\u003c/span\u003e In addition, the jury was surely cognizant of the fact that the conspiracy lasted for at least twenty years until Krause told his story to the district attorney in 1978. The conspiracy succeeded in covering up the truth -- and depriving the plaintiffs of their constitutional rights -- for a generation. While it is exceedingly difficult to place a monetary value on the resulting emotional distress, the jury was well-instructed and made awards well within their discretion. Mary Beth G. v. City of Chicago, supra, 723 F.2d at 1275-1276.\n\nAlthough the compensatory damages awarded the siblings for the conspiracy are substantial in the aggregate, they amount to only $45,000 per each brother and sister, just one-fifth that awarded to the father's estate. Further, no prejudgment interest was allowed for the conspiracy damages even though the injury began approximately 24 years before trial.\n\nThe defendants also argue that the jury should not have awarded separate damages for deprivation of due process and racially-based denial of equal protection, claiming that two separate special verdicts regarding these alleged deprivations are \"redundant\". Defendants seemingly overlook, however, that these two alleged deprivations have distinct roles in the Constitution. Moreover, the federal civil rights laws make separate reference to these constitutional guarantees. Section 1985(2) (second portion) addresses the denial of due course of justice with intent to deny equal protection. Section 1985(3) addresses equal protection and federal privileges and immunities, one of the privileges and immunities being access to the courts. Finally, the evidence produced by plaintiffs supports the jury finding that the Bell family suffered injuries flowing from the infringement of these constitutional rights. The racial animus evinced by the defendants toward the Bell family aggravated the deprivation of due process perpetuated by the suppression of the circumstances surrounding the killing. Such racially-motivated abuse from government officials gave the conspiracy an additional dimension, for it deprived the Bell family of their federal right to racially equal treatment in the investigation of Daniel Bell's death. The jury had substantial grounds for awarding separate damages based on the conspiracy's elements of racial discrimination as well as denial of due process.\n\nE. Punitive Damages\n\nDefendants Grady, Shaffer, and Johnson were assessed damages on an individual basis in the amounts of $25,000, $350,000, and $150,000, respectively, for their participation in the conspiracy. Defendants argue that the punitive damage awards are improper and excessive.\n\nThe Supreme Court has held that a jury may assess punitive damages in a Section 1983 action \"when the defendant's conduct is shown to be motivated by evil motive or intent, or when it involves reckless or callous indifference to the federally protected rights of others.\" Smith v. Wade, 461 U.S. 30, 103 S. Ct. 1625, 1640, 75 L. Ed. 2d 632 . The same standard should apply under Section 1985 as well as Section 1983.It is based upon the recognition that at the time the Ku Klux Klan Act of 1871 was enacted, \"the rule in a large majority of jurisdictions was that punitive damages * * * could be awarded without a showing of actual ill will, spite, or intent to injure,\" and nothing in the policies and purposes of Section 1983 mandates a departure from the common law majority rule. U.S. at , 103 S. Ct. 1632-1637. Since Section 1985 also originates from the 1871 Act, and has no contrary policy or purpose mandating a different approach, the Smith v. Wade standard for assessing punitive damages applies to it as well.\n\nGiven Grady's egregious acts of deceit and distortion, defendants cannot successfully argue that Grady's conduct failed to meet this standard, nor can they establish that the $25,000 punitive damages assessed against him for the conspiracy is excessive. In regard to the $350,000 punitive damages assessed against Shaffer, to some extent the disparity in the amounts is attributable to the evidence adduced at trial of Shaffer's relative wealth and Grady's relative penury. City of New Port v. Fact Concerts, Inc., 453 U.S. 247, 269 and n.30, 69 L. Ed. 2d 616, 101 S. Ct. 2748, indicates that such evidence is admissible with respect to punitive damages. However, this evidence does not justify fully the sizeable punitive damage award against Shaffer. Although the Smith v. Wade standard of \"reckless or callous indifference to the federally protected rights of others\" is met as to Shaffer, it is manifest that punitive damages \"should not go beyond deterrence and become a windfall.\" Lenard v. Argento, 699 F.2d 874, 890 (7th Cir. 1983), certiorari denied, 464 U.S. 815, 104 S. Ct. 69, 78 L. Ed. 2d 84 . This concern is paramount where as here plaintiffs have been awarded substantial compensatory damages in connection with the conspiracy. The evidence presented by plaintiffs simply is insufficient to sustain the full amount assessed specifically against Shaffer. Based upon the evidence establishing that Shaffer conspired with Grady, Krause, and the others to conceal the facts, we hold that a punitive damage award against Shaffer of $50,000 will fulfill the punitive damage policies of punishment and deterrence. We also note that a punitive damage award of $50,000 against Shaffer is in rough conformity with the punitive damage awards assessed against non-defendants Woelfel ($75,000) and Glaser ($100,000) whose conduct in the course of the investigation was, on the basis of the record, more egregious than that of Shaffer.\n\nJohnson's liability for the compensatory damages is predicated upon his neglect to prevent the conspiracy, 42 U.S.C. § 1986, and not on any conspiratorial conduct on his part. His neglect does not amount to the type of conduct warranting punitive damages under Smith v. Wade or under prior decisions of this Court. Section 1986 dramatically expands the scope of liability beyond that under Sections 1985 and 1983, the latter provision being the basis for punitive damage liability under Smith v. Wade.\n\nWhile punitive damages are certainly not per se foreclosed under Section 1986, these plaintiffs have not established that such retribution is in order with respect to Johnson. Plaintiffs argue that Johnson committed gross violations of Milwaukee Police Department internal rules and that these violations support their punitive damage claim. As mentioned supra the internal rules\u003cspan class=\"fnref\"\u003e74\u003c/span\u003e require that the chief of police confer regularly with the district commanders and the inspector of detectives to be fully advised on all matters of serious departmental concern. It is true that Johnson did not comply with the rules, but the rules do not place the duty to confer specifically upon the chief of police. To the contrary, the rules direct the inspector of detectives, i.e., Inspector Glaser, and the district commanders to arrange conferences with the chief of police and to keep the chief of police apprised of the progress made in important investigations. The record indicates that these subordinate officials failed to advise Johnson fully of the course of the investigation. Johnson was cognizant of the inconsistencies in the explanations of Grady and Krause and failed to scrutinize their conduct and the conduct of Glaser and other investigators. He is therefore liable for substantial compensatory damages stemming from the conspiracy under Section 186, but the $150,000 punitive damage award against Johnson individually cannot be similarly sustained.\n\nIX. INDEMNIFICATION AND CITY LIABILITY FOR THE PARTICIPATION OF WOELFEL AND GLASER IN THE CONSPIRACY\n\nThe names of Leo Woelfel and Rudolph Glaser were included in the special verdict as potential co-conspirators, much like unindicted co-conspirators in a criminal context, notwithstanding the fact that they are deceased, they were never named in the complaint and had no opportunity to defend this action. Their names were included in the event that plaintiffs could establish an independent theory by which the City would be liable for their actions in regard to the conspiracy. Bell III, 536 F. Supp. 462, 472. The jury found that Woelfel and Glaser were in fact members of the conspiracy, assessing punitive damages of $75,000 and $100,000 against them, respectively.\n\nThe district court properly held that plaintiffs cannot recover from the City (nor from other defendants) the $175,000 assessed in the names of these non-parties. As the district court noted, the basis of the City's liability for the entire judgment in this case, i.e., the conspiracy damages as well as the damages against Grady arising from the shooting, is the Wisconsin indemnity statute, Wis.Stat. § 895.46,\u003cspan class=\"fnref\"\u003e75\u003c/span\u003e which provides that a defendant public employee against whom a judgment of damages is entered for activities within the scope of employment shall be indemnified by the political subdivision which employed the defendant. The purpose of Section 895.46 is to prevent government employees from having to pay out of their own pockets judgments arising out of their official duties. Horace Mann Insurance Co. v. Wauwatosa Board of Education, 88 Wis. 2d 385, 389, 276 N.W.2d 761, 764-765 (1979). As the district court recognized, this policy is not served in regard to Woelfel and Glaser. No judgment has been entered against them or their estates, and they as non-parties are not liable for anything. Therefore the City bears no obligation to indemnify with respect to this portion of the damages.\n\nNotwithstanding the lack of indemnification, plaintiffs contend that Woelfel's and Glaser's conduct amounted to a municipal policy, practice, custom, or usage, mandating municipal liability under Monell v. Department of Social Services, 436 U.S. 658, 56 L. Ed. 2d 611, 98 S. Ct. 2018 .In the event that Monell conduct is not found, plaintiffs assert that the City can be held liable for punitive damages on a theory of respondeat superior, under 42 U.S.C. §§ 1981, 1985(2), 1985(3), and 1986. We disagree.\n\nRegardless of the disposition of the Monell\u003cspan class=\"fnref\"\u003e76\u003c/span\u003e and respondeat superior\u003cspan class=\"fnref\"\u003e77\u003c/span\u003e issues, the import of City of Newport v. Fact Concerts, Inc., 453 U.S. 247, 69 L. Ed. 2d 616, 101 S. Ct. 2748, precludes plaintiffs from recovering punitive damages against municipalities absent indemnification. There the City of Newport, Rhode Island, cancelled a license for a concert the day before the first scheduled performance on the grounds that one of the acts played rock music rather than jazz, the city council fearing that the act would attract a \"rowdy and undesirable\" audience. City of Newport, 453 U.S. at 250. The concert promoter sued the City under Section 1983, alleging that the City's actions violated his First Amendment rights. The jury awarded both compensatory and punitive damages against the City, and the court of appeals affirmed. The Supreme Court granted certiorari to address the punitive damages issue, holding that a municipality is immune from punitive damages in a Section 1983 action.\n\nAlthough Monell, supra, held that municipalities, like other \"persons\" under Section 1983, may be sued for deprivations of constitutional rights committed under color of law, Justice Blackmun speaking for the Court in City of Newport made clear that:\n\nBy the time congress enacted what is now § 1983, the immunity of a municipal corporation from punitive damages at common law was not open to serious question. It was generally understood by 1871 that a municipality, like a private corporation, was to be treated as a natural person subject to suit for a wide range of tortious activity, but this understanding did not extend to the award of punitive or exemplary damages.\n\nCity of Newport v. Fact Concerts, Inc., 453 U.S. at 259-260 (footnote omitted). The Court, in reviewing the common law surrounding punitive damages, noted that:\n\nThe courts readily distinguished between liability to compensate for injuries inflicted by a municipality's officers and agents, and vindictive damages appropriate as a punishment for the bad faith conduct of those same officials and agents. Compensation was an obligation properly shared by the municipality itself, whereas punishment properly applied only to the actual wrongdoers. The courts thus protested the public from unjust punishment, and the municipalities from undue physical constraints.\n\n453 U.S. at 263 (footnote omitted). While recognizing that \"it is perhaps possible to imagine an extreme situation where the taxpayers are directly responsible for perpetrating an outrageous abuse of constitutional rights,\" 453 U.S. at 267 n.29, the Court explained that:\n\nPunitive damages imposed on a municipality are in effect a windfall to a fully compensated plaintiff, and are likely accompanied by an increase in taxes or a reduction of public services for the citizens footing the bill. Neither reason nor justice suggests that such retribution should be visited upon the shoulders of blameless or unknowing taxpayers.\n\n453 U.S. at 267.\n\nIn this case plaintiffs do not argue that the taxpayers of the City of Milwaukee were directly responsible for the abuse of the constitutional rights of Daniel Bell and his family. Instead plaintiffs seek to limit the punitive damages rule of City of Newport to civil rights actions brought under Section 1983. Because the conspiracy to infringe upon the Bell family's constitutional rights constitutes a violation of Section 1985, and possibly (though we do not decide) Section 1981 as well, plaintiffs contend that the rule of City of Newport does not preclude municipal punitive damage liability under those Sections.\n\nPlaintiffs' contention is without merit. The punitive damages rule of City of Newport is not confined to Section 1983 and applies to Section 1985 as well as to section 1981. The holding in City of Newport is based in part upon the broad-based common law immunity of municipalities from punitive damages: \"[M]embers of the 42d Congress were familiar with common law principles [and] they likely intended these common law principles to obtain, absent specific provisions to the contrary.\" City of Newport, 453 U.S. at 258. This same Congress passed Section 1985; moreover, plaintiffs have not demonstrated that the Congress that passed the 1866 Act, the origin of Section 1981, wished to discard the same common law principle.\n\nAdditionally, the Supreme Court based its holding in City of Newport on the recognition that the goals underlying punitive damages -- retribution and deterrence -- would not be significantly advanced by awarding punitive damages in Section 1983 actions against a municipality. 453 U.S. at 258-260. This is equally true for suits brought under other Sections of the civil rights laws. See Heritage Homes of Attleboro, Inc. v. The Seekonk Water District, 670 F.2d 1 (1st Cir. 1982) (regarding Section 1981), certiorari denied, 457 U.S. 1120, 102 S. Ct. 2934, 73 L. Ed. 2d 1333; Carter v. City of Emporia, 543 F. Supp. 354, 359 (D. Kan. 1982) (regarding Sections 1981, 1985 and 1986).\n\nSimilarly, the Supreme Court's discussion in Smith v. Wade, 461 U.S. 30, 103 S. Ct. 1625, 75 L. Ed. 2d 632, of punitive damages in civil rights actions supports our conclusion that, absent waiver of immunity, municipalities may not be held liable for punitive damages under Sections 1985(2) (second portion) and 1985(3). In an action brought under Section 1983 Smith addressed primarily the conduct that must be proven to sustain punitive damage awards against defendants generally. The Court also commented broadly upon the holding in City of Newport:\n\nIn Newport v. Fact Concerts, Inc. * * * we held that a municipality (as opposed to an individual defendant) is immune from liability for punitive damages under § 1983. A significant part of our reasoning was that deterrence of constitutional violations would be adequately accomplished by allowing punitive damage awards directly against the responsible individuals * * *.\n\nSmith v. Wade, 461 U.S. at n.5, 103 S. Ct. at 1629 n.5 (emphasis added).\n\nIrrespective of the Section of the civil rights statute that plaintiffs invoke in seeking recovery for the denials of due process and equal protection, the well-established policy of municipal immunity from punitive damages cannot be ignored. Accordingly, we affirm the district court's holding that the City of Milwaukee is not liable for the $175,000 assessed in the names of non-parties Woelfel and Glaser.\n\nAlthough the argument in the briefs is imprecise on this point, the City apparently also invokes City of Newport in an effort to avoid indemnification of the punitive damages awarded against defendants Grady, Johnson, and Shaffer in this action.\u003cspan class=\"fnref\"\u003e78\u003c/span\u003e This contention is rejected. Since the punitive damages awarded were improper as to Johnson and excessive as to Shaffer, this issue is relevant only in regard to the $50,000 punitive damages against Shaffer sustained herein and the total of $50,000 punitive damages awarded against Grady. It is well settled that a municipality's immunity from liability, including liability for punitive damages, may be waived by federal or state law. See, e.g., Owen v. City of Independence, Missouri, 445 U.S. 622, 647-648, 63 L. Ed. 2d 673, 100 S. Ct. 1398 . The indemnity afforded governmental employees under Wis. Stat. § 895.46 applies to all \"judgments\", no distinctions being made for compensatory versus punitive damages. As noted earlier, since non-parties are not liable for a judgment, the City cannot be liable for the damages assessed in the names of Woelfel and Glaser. The City does not contend that Section 895.46 does not apply to punitive damages. Rather the City argues that the punitive damages rule of City of Newport precludes municipal liability irrespective of Wisconsin law, so that the City is not responsible for the punitive damages of Grady, Johnson, and Shaffer. This contention, however, directly conflicts with the recognition in City of Newport that some state indemnification statutes exclude indemnification for \"malicious or willful misconduct by employees,\" 453 U.S. at 169 n.30, and that these limited statutes do not shift the liability from the offending official to the municipality for such conduct. Wisconsin does not so limit its indemnification law. The obvious implication is that, regardless of the willfulness of the conduct at issue, an unlimited indemnification statute superimposes upon the common law a state-created rule which shifts the liability to the municipality. Therefore the district court rightly held that the City must indemnify Grady and Shaffer for the punitive damages arising from the shooting and from the conspiracy (Johnson's punitive damages being vacated and Shaffer's reduced in regard to the conspiracy), as well as indemnify all defendants for the compensatory damages arising out of the killing and the conspiracy.\n\nX. LIABILITY FOR THE CONDUCT OF McCAULEY\n\nPlaintiffs appeal of the district court's holding that Milwaukee County cannot be held liable for the conduct of then District Attorney William McCauley. For the reasons set out this holding was proper.\n\nPlaintiffs' second amended complaint added as named defendants Milwaukee County and \"the Office of Milwaukee County District Attorney,\" alleging that the acts of McCauley (who died in 1964) in assisting the cover-up constituted a custom or policy of defendants who are therefore liable for McCauley's participation in the conspiracy under Monell v. Department of Social Services, 436 U.S. 658, 56 L. Ed. 2d 611, 98 S. Ct. 2018 . The motion on behalf of Milwaukee County to dismiss the amended complaint was denied by the district court in an unpublished decision and order, Bell v. City of Milwaukee, 536 F. Supp. 462 (1981). The district court also denied the County's motion for summary judgment, Bell II, 514 F. Supp. 1363, 1372. At the close of all the evidence, the court directed a verdict on this point in favor of Milwaukee County\u003cspan class=\"fnref\"\u003e79\u003c/span\u003e on the ground that the evidence did not indicate that McCauley's conduct constituted a custom, policy, or practice of the county under Monell. The court also noted that the entity denominated by plaintiffs \"Office of the Milwaukee County District Attorney\" was not a proper party to the action. Finally, although not necessary to justify dismissal of the County, the court remarked that McCauley's conduct was related to his prosecutorial duties and is therefore entitled to absolute immunity under Imbler v. Pachtman, 424 U.S. 409, 47 L. Ed. 2d 128, 96 S. Ct. 984 .\n\nAt plaintiffs' request, the district court permitted McCauley's participation in the conspiracy to be determined by the jury in a special verdict to avoid a new trial in the event this court reversed on the Monell issue. However, the court declined to submit a punitive damages question to the fury as to McCauley. After the verdict was returned plaintiffs moved for a partial new trial as to the liability of Milwaukee County and the Office of Milwaukee County District Attorney for punitive damages. The court declined the motion, reaffirming its application of Monell and noting that the inclusion of McCauley's name in the special verdict conspiracy question was a superfluity since none of the defendants could he held liable for McCauley's actions. Bell III, 536 F. Supp. 462, 471-472.\n\nPlaintiffs appeal the finding of non-liability as to Milwaukee County, arguing that, inter alia, McCauley was an authoritative decision-maker for the County and that his conduct constituted a county custom, policy, or practice under Monell. This court has acknowledged that at some level of authority, there must be an official whose acts reflect governmental policy, since the government necessarily acts through its agents. Reed v. Village of Shorewood, 704 F.2d 943, 953 (7th Cir. 1983). Yet as the district court observed, McCauley's participation in the conspiracy was simply conduct in a single case. A custom, policy, or practice of a county under Monell cannot normally be inferred from a single incident of unconstitutional behavior of a district attorney. See Powe v. City of Chicago, 664 F.2d 639 (7th Cir.1981); Sterling v. Village of Maywood, 579 F.2d 1350 (7th Cir. 1978), certiorari denied, 440 U.S. 913, 59 L. Ed. 2d 462, 99 S. Ct. 1227 . Plaintiffs presented no evidence that McCauley's conduct in the Bell matter was indicative of a multi-case pattern of unconstitutional activity on his part, or evidence linking his conduct with the policy of County officials. The district court's ruling on this issue is therefore affirmed.\n\nBecause Milwaukee County and the entity denominated Office of Milwaukee County District Attorney are not liable for McCauley's conduct, it is unnecessary to determine what level of immunity attaches to McCauley's conduct.\n\nXI. GRADY'S ISSUES\n\nDefendant Grady raises three additional issues in his separate briefs.\n\nA. Admissibility of Criminal Complaint\n\nAt trial the court allowed plaintiffs to enter into evidence the criminal complaint filed by the Milwaukee County District Attorney's Office against Grady on August 29, 1979.The complaint charged Grady with one count of homicide by reckless conduct and one count of perjury, in violation of Wis. Stat. §§ 940.06 and 946.31(1)(f), respectively.\u003cspan class=\"fnref\"\u003e80\u003c/span\u003e Those charges arose out of the same circumstances as those underlying this civil case: the 1958 shooting of Daniel Bell and Grady's false statements at the subsequent inquest. The complaint also recited statements of several individuals, including those made by Krause who related in some detail the shooting. According to the complaint Krause stated inter alia that this matter had \"haunted him and deeply troubled him for many years\"; that he felt compelled to tell the truth about what he knew; that on the night of the shooting \"Grady stated that he needed some more arrests that night so that he was going to check some vacant homes around 7th or 8th and Vine Street and arrest some \"niggers\"; and that after the shooting, \"Grady stated that he would \"get some time\" out of this and get fired so they would have to make up some excuse. Grady stated that it was just a \"God damn nigger kid\" anyway\" (Exh. 6).\n\nDefendant Grady alleges that it was improper for the district court to allow plaintiffs to admit the state's criminal complaint on the grounds that the complaint is hearsay, was admitted to inflame and prejudice the jury, and is irrelevant.\u003cspan class=\"fnref\"\u003e81\u003c/span\u003e Plaintiffs contend that the complaint was relevant and that Grady had the opportunity to contradict the statements in the complaint at this civil trial. We first address the hearsay issue, then the relevancy and prejudice issues.\n\nThe bulk of the three and one-half page criminal complaint states facts which form the basis of Grady's convictions for homicide by reckless conduct and perjury. Krause in the complaint recounts the stopping of Daniel Bell's automobile, the chase, the shooting, and Grady's false account of the incident to Milwaukee police officials and to District Attorney McCauley at the inquest. The complaint also contains the conclusions of Medical Examiner Van Hecke and others verifying the identification of Daniel Bell and stating that the cause of death was the bullet fired by Grady. No hearsay objection can be raised as to this evidence because Grady admitted in the district court proceedings that he shot and killed Bell, planted the knife, lied to his superiors, and perjured himself at the coroner's inquest. Essentially the only aspect of the prior convictions that Grady did not admit to at trial is the recklessness element of the homicide conviction, Grady maintaining that the shooting was purely \"accidental.\" This difference, however, is immaterial since (1) none of the statements incorporated in the complaint address the recklessness issue;\u003cspan class=\"fnref\"\u003e82\u003c/span\u003e the complaint merely mentions that Wis. Stat. § 940.06 prohibits homicide by reckless conduct; and (2) Grady pleaded guilty to the homicide by reckless conduct count, see Waldron v. Hardwick, 406 F.2d 86, 90 (7th Cir. 1969) (guilty plea admissible as admission).\n\nThe substance of the remaining portions of the criminal complaint, particularly the racist statements that Krause claimed Grady made the night of the shooting, were not admitted, but rather were denied by Grady at trial. Although Grady pleaded guilty to the charges of homicide by reckless conduct and perjury as specified in the criminal complaint, Grady's attorney did not stipulate that all the allegations in the complaint were truthful. Nonetheless, Grady's alleged racist comments were used against him in the trial below, and therefore constitute admissions of a party, non-hearsay under Fed. R. Evid. 801(d)(2)(A).\n\nThe racist comments Grady allegedly made to Krause the night of the killing are non-hearsay on the alternative ground that they were not \"offered in evidence to prove the truth of the matter asserted\" (Fed. R. Evid. 801(c)) by Grady. See Crawford v. Garnier, 719 F.2d 1317, 1323 (7th Cir. 1983); United States v. McDonnel, 550 F.2d 1010 (5th Cir.1977), certiorari denied, 434 U.S. 835, 54 L. Ed. 2d 96, 98 S. Ct. 123 . For example, the comments were not offered to prove that Grady truthfully did intend to \"check some vacant homes around 7th or 8th and vine Street and arrest some \"niggers,\" but rather to show that he used derogatory language in referring to blacks.\n\nThis Court must also consider the second \"level\" of possible hearsay with respect to Grady's racist comments, viz., Krause's recitation of Grady's comments alleged in the criminal complaint. The record indicates that when the statements were read aloud to Krause while on the witness stand, Krause verified that he did make the statements to Investigator Rogers in 1978 and that Grady did make the underlying comments (Tr. 1232, 1281). Krause's prior statements therefore became part of his oath-supported, court-given testimony subject to cross-examination and are not hearsay. See Fed. R. Evid. 801(d)(1), Notes Of Advisory Committee On Proposed Rules (\"If the witness admits on the stand that he made the statement and that it was true, he adopts the statement and there is no hearsay problem.\"). United States v. Klein, 488 F.2d 481, 483 (2d Cir. 1973); Slade v. United States, 267 F.2d 834, 838-839 (5th Cir. 1959). Krause undeniably affirmed and adopted his prior statements, even though at an earlier point in his testimony he claimed that he could not recall the substance of his conversation with Grady just prior to the shooting (Tr. 1221).\u003cspan class=\"fnref\"\u003e83\u003c/span\u003e\n\nAlthough this court holds that Krause's adoption of his statements embodied in the 1978 criminal complaint defeats Grady's hearsay argument, we must emphasize that because prior statements are not subjected to demeanor observation and often are not made under oath and cross-examination conditions, the prior statements of witnesses present at trial are generally admissible only under specific circumstances. See Fed. R. Evid. 801(d)(1).\u003cspan class=\"fnref\"\u003e84\u003c/span\u003e And even where the witness adopts the prior statement, the wholesale admission of such prior statements (especially statements found in a formal police document such as a criminal complaint) might allow parties to create an unwarranted aura of officiality and credibility surrounding the witness' testimony.\u003cspan class=\"fnref\"\u003e85\u003c/span\u003e See United States v. Bennett, 409 F.2d 888, 894-895 (2d Cir. 1969), certiorari denied, 396 U.S. 852, 24 L. Ed. 2d 101, 90 S. Ct. 113, rehearing denied, 396 U.S. 949, 90 S. Ct. 376, 24 L. Ed. 2d 256. In the instant case we perceive no attempt on the part of plaintiffs to create such an unwarranted aura; consequently the district court acted within its discretion in admitting the criminal complaint in its entirety over defendants' hearsay objection.\n\nTurning now to the relevancy and prejudice issues, there is no prejudice here sufficient to outweigh the racist statements' relevance under a Fed. R. Evid. 403 analysis. Grady's alleged comments on the night of the shooting are highly probative of racial animus, an element of a racially-motivated conspiracy under the civil rights laws. In regard to the bulk of the complaint, which outlines the facts upon which the prior convictions are based, Grady points out that in the trial below he never denied that he killed Daniel Bell, falsified reports or lied at the inquest. According to Grady, most of the complaint therefore was an unnecessary presentation of evidence.\n\nIt was not absolutely necessary to the plaintiffs' case to admit the bulk of the complaint: other sources of testimony, including Grady's own admissions and Krause's and Vorpagel's oral testimony would have sufficed. To some extent admitting the criminal complaint amounted to the needless presentation of cumulative evidence\" pursuant to Fed. R. Evid. 403, and upon such a finding evidence may be excluded. However, the power to exclude such unnecessary evidence is properly vested with the trial court: were this Court to deem the admission of the complaint to be reversible error because it created a minor, unnecessary delay at trial would lead to the absurd result of generating even greater delays in the judicial process. What little time was wasted amounts to harmless error at most, for the other grounds for Rule 403 exclusion -- confusion of the issues, misleading the jury, etc. -- are not applicable.\n\nFinally, we agree with Grady's contention that Krause's statement in the complaint expressing remorse over delaying exposing the alleged true circumstances of the killing and the cover-up is irrelevant to the causes of action herein, but this minute comment by itself is not so highly prejudicial to cause reversal in view of the substantial evidence against defendants.\n\nB. Examination of Kasza\n\nGrady also objects to plaintiffs' examination of retired Milwaukee policeman Henry Kasza. Kasza, a sergeant at the time of the shooting, interviewed Grady that night and prepared a report that mentions that Bell was shot as he was about to jump a snow bank, i.e., the shooting-at-a-distance explanation which was soon abandoned for an account of shooting in close proximity to Bell. This report was entered into evidence, along with a report by Investigator Rogers based on a March 1979 interview with Kasza. The objected-to examination is based on a statement by Kasza in the 1979 interview which was read to the jury:\n\nKasza said he did not know Grady well enough to comment on his feelings toward blacks, but said he (Kasza) thinks they're \"apes\" (Exh. 149).\n\nGrady claims that reading the portion of the 1979 interview to the jury and questioning Kasza on his recollection of the statement and his racial attitudes in 1958 were prejudicial as calculated to inflame the jury. Grady also contends that the statement is irrelevant on the rationale that whatever Kasza's racial biases in 1979, they do not determine Kasza's attitudes in 1958 and, more fundamentally, Kasza's biases do not shed light on Grady's alleged racial motivation in connection with the shooting.\n\nRegarding the relevancy question, it cannot be said that Kasza's racial bias gratuitously manifested in the 1979 interview is not probative of Kasza's attitudes in 1958, particularly in light of Kasza's telling silence and contradictory responses in examination at trial:\n\nQ. Did you have any discussion with Mr. Rogers on March 20, 1979 respecting the race of Daniel Bell?\n\nA. I don't remember.\n\nQ. Did you have any conversation with Mr. Rogers on March 20, 1979 respecting Mr. Grady's feelings towards blacks?\n\nA. I don't remember.\n\nQ. Did you have any conversation with Mr. Rogers on March 20, 1979 respecting your own feelings towards blacks?\n\nA. I don't remember.\n\nQ. If you don't remember that, sir, how do you know that you did not tell him that blacks are apes?\n\nA. That's something that would stand out in any normal human being.\n\nQ. Are you now saying you do remember that you had such a conversation with Mr. Rogers?\n\nA. I am saying I did not make the statement.\n\nQ. How do you know that, sir, if you don't remember whether you had such a conversation?\n\nMR. KONRAD: Objection, he's arguing with the witness.\n\nTHE COURT: Sustained.\n\nQ. Was it your opinion in February of 1958, Mr. Kasza, that blacks were apes?\n\nA. I don't remember (Tr. at 2993-2994).\n\nMoreover, racial bias in 1958 is not the only concern: the Section 1985 claim is based upon the allegedly racially-motivated conspiracy which extended through 1978. Therefore there is no compelling reason to establish Kasza's racial bias solely in 1958.\n\nThe more difficult relevancy question is whether Kasza's purported racial bias even in 1979 is relevant to the racial animus alleged in the Section 1985 claim. Grady contends that plaintiffs sought to establish racial animus on the part of Grady by examining Kasza, and that Kasza's attitudes are not probative of Grady's. If this was in fact the effect of plaintiffs' examination of Kasza, such testimony would not be highly probative. Kasza knew Grady and was a fellow officer at the time of the shooting and some time thereafter, but the record discloses no real relationship between the two officers.\n\nBut plaintiffs' counsel in his examination of Kasza did not even attempt such an inference. Indeed, Kasza's statement in the Rogers report, which was read to the jury, made clear that \"Kasza * * * did not know Grady well enough to comment on his feelings toward blacks * * *.\" It was not incumbent upon plaintiffs' counsel to attempt to establish a direct link between the conduct of Kasza and Grady since it is not Grady's alleged racial animus alone that is of relevance in this case. The Milwaukee Police Department is accused of covering up the true facts surrounding the shooting on the motivation, at least in part, of racial discrimination. Several police department employees in addition to Grady were alleged to be co-conspirators in the cover-up. We cannot accept the proposition that the racial animus of an individual who in the course of his employment is involved with the investigation of an unconstitutional killing and conspiracy to conceal the truth, and who may or may not have knowledge of the racial motivations behind the conspiracy, is irrelevant merely because the individual was not named as a co-conspirator. Moreover, the district court possesses broad discretionary powers in ruling on questions of evidentiary relevance and prejudice, e.g., United States v. Sweeney, 688 F.2d 1131, 1144 (7th Cir. 1982), and we perceive no abuse of discretion in ruling the Kasza testimony to be relevant.\n\nRegarding the question of prejudice to Grady, the trial court also acted within its broad discretion on evidentiary matters in allowing Kasza to be examined regarding the crucial passage of Rogers' report. Fed. R. Evid. 403 operates to exclude, inter alia, evidence whose probative value is substantially outweighed by the danger of unfair prejudice. Yet \"unfair\" is the key aspect of this provision, for the admission of evidence is generally calculated to benefit one side to the prejudice of the other. Unfairness may arise where certain evidence, if admitted, would inflame the jury and hence be given greater weight than it deserves. Identifying these situations is obviously a difficult and uncertain task. Difficult as it may be to draw the line, the probative value of Rogers' report and Kasza's testimony is not substantially outweighed by the danger of unfair prejudice to Grady. Plaintiffs' counsel never attempted to infer any relationship between Kasza and Grady, other than Kasza's well-documented role as an investigating officer. Without such an inferred relationship, it is pure speculation to assume the jury gave Kasza's testimony undue weight vis-a-vis Grady.\n\nC. The Jury's Lack of Knowledge of the Duration of Grady's Prison Sentence\n\nGrady argues that the punitive damages assessed against him for the killing and conspiracy -- a total of $50,000 -- were excessive in that the jury was not made aware of the duration of Grady's seven-year prison sentence.\u003cspan class=\"fnref\"\u003e86\u003c/span\u003e According to Grady the district court's failure to inform the jury resulted in \"double punishment\" which, analogous to the double jeopardy clause of the Fifth Amendment, is improper. There is little merit in Grady's contentions for the following reasons:\n\nFirst, Grady has not shown, in light of his egregious conduct in killing Daniel Bell and lying about the facts, that $50,000 in punitive damages is excessive irrespective of his sentence for the perjury and reckless homicide crimes. Second Grady's counsel actually told the jury in opening argument that his client was serving a seven-year sentence (Tr. 1178-1179). Finally, the trial judge did not abuse his discretion in excluding discussion of sentence duration. The jury was aware of Grady's conviction and incarceration. Plaintiffs argued that if the duration of Grady's sentence were put into evidence, they would then be entitled to prove that Grady's sentence was actually a bargained plea \"down\" from first-degree murder to homicide by reckless conduct. The trial court concluded that Grady's counsel could raise the fact of incarceration, but without opening up the terms of the sentence or the question of plea-bargaining. It was well within the court's discretion under Fed. R. Evid. 403 to make such a ruling.\n\nXII. THE JURY FINDING IN REGARD TO THE STOP, CHASE, AND ATTEMPTED APPREHENSION OF DANIEL BELL\n\nPlaintiffs argue on cross-appeal that Grady and Krause used deadly and excessive force in pursuing and attempting to arrest Daniel Bell, violating Daniel's Fourth and Fourteenth Amendment rights. They urge us to reverse the special jury verdict on question A1 finding that Grady did not violate Daniel Bell's constitutional rights in \"stopping, chasing, and/or attempting to apprehend Daniel Bell * * *.\"\n\nPlaintiffs, however, seemingly overlook the fact that they submitted a separate special verdict question on behalf of Daniel Bell's estate for the violation of Daniel Bell's constitutional rights in the \"shooting and killing\" (Special Verdict Question B1), i.e., the fatal shot and the resulting death. The jury awarded substantial damages under question B1 for the deprivation of Daniel Bell's constitutional rights in the shooting and killing; therefore question A1 encompasses only that conduct of Grady prior to the shooting and killing, i.e., the chase, the four or five warning shots fired upward into the air by Grady and Krause, and the attempted apprehension of Daniel Bell.\n\nDefendants argue that this prior conduct in and of itself does not constitute excessive force, there was sufficient evidence for the jury to reach such a conclusion, and therefore the jury verdict in favor of defendants on question A1 is sustainable. The Fourth Amendment\u003cspan class=\"fnref\"\u003e87\u003c/span\u003e expressly declares the \"right of the people to be secure in their persons * * * against unreasonable searches and seizures.\" An arrest is \"quintessentially a seizure,\" United States v. Watson, 423 U.S. 411, 429, 46 L. Ed. 2d 598, 96 S. Ct. 820 (Powell, J., concurring), and notions of reasonableness under the Fourth Amendment must be adhered to by police officers in accosting or restraining an individual even if the encounter does not culminate in a \"technical arrest\" or \"full-blown search.\" Terry v. Ohio, 392 U.S. 1, 19, 20 L. Ed. 2d 889, 88 S. Ct. 1868 .\n\nThrough special verdict question A1 the question of unreasonable or excessive force was submitted to the jury, the district court providing a substantial instruction on the issue.\u003cspan class=\"fnref\"\u003e88\u003c/span\u003e Plaintiffs do not allege, nor do we hold, that the district court's formulation of the excessive force determination in the jury instructions was inadequate or improper. Instead plaintiffs argue that as a matter of law the warning shots fired by Grady and Krause are per se excessive force. This Court declines to create such a per se rule. The district court did not abuse its discretion in submitting the question of excessive force to the jury, to be resolved in light of all the facts and circumstances. Moreover, the record clearly indicates that the warning shots were fired only after Daniel Bell ignored the officers' repeated requests to stop, and the warning shots were truly warning shots, purposefully fired directly upward into the air.\u003cspan class=\"fnref\"\u003e89\u003c/span\u003e The jury was also free to consider the evidence that Daniel Bell to some extent fit the description of a robbery felon listed on a police bulletin. Therefore under the totality of the circumstances the jury verdict is not unreasonable and is affirmed.\n\nXIII. CONCLUSION\n\nFor the reasons heretofore discussed we hold that:\n\n(1) the judgment in favor of Daniel Bell's estate against Thomas Grady, Jr. in the amounts of $100,000 compensatory damages and $25,000 punitive damages for the shooting and killing of Daniel Bell is affirmed;\n\n(2) the judgment finding no use of excessive force in the stop, chase, and attempted apprehension of Daniel Bell is affirmed;\n\n(3) the judgment in favor of Dolphus Bell's estate against Grady in the amounts of $75,000 compensatory damages and $670 funeral expenses for the shooting and killing is affirmed;\n\n(4) the judgment in favor of the eleven brothers and one sister against Grady in the amount of $100,000 for the shooting and killing is reversed;\n\n(5) the judgment in favor of Dolphus Bell's estate against Grady, Howard Johnson, and Edwin Shaffer in the amounts of $75,000 and $150,000 for deprivations of due process and racial equality, respectively, resulting from the conspiracy is affirmed;\n\n(6) the judgment in favor of the brothers and sister of Daniel Bell against Grady, Johnson, and Shaffer in the amounts of $240,000 and $300,000 for deprivations of due process and racial equality, respectively, is affirmed;\n\n(7) the punitive damage judgment against Grady in the amount of $25,000 in connection with the conspiracy is affirmed, the judgment of $350,000 against Shaffer is vacated and reduced to $50,000, and the judgment of $150,000 against Johnson is reversed;\n\n(8) the district court's holding that the City of Milwaukee is obligated to indemnify defendants Grady, Johnson, and Shaffer for the above damages, which in the aggregate after modifications on appeal amount to $1,040,670, is affirmed; and\n\n(9) the district court's holdings that (a) the City of Milwaukee is not liable for the punitive damages assessed in the names of Leo Woelfel and Rudolph Glaser, and (b) Milwaukee County is not liable for the conduct of William McCauley in connection with the Bell matter, are affirmed.\n\n\u003cspan class=\"fn\"\u003e1. Krause claimed Grady made this statement according to Krause's 1978 affidavit and a 1978 interview which formed the basis of a criminal complaint against Grady resulting in his conviction of perjury and homicide by reckless conduct. At trial, Krause first testified he did not recall the conversation (Tr. 1221), then testified that Grady did make the comment (Tr. 1232). Grady denied making the statement (Tr. 1904).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Plaintiffs claim that Grady intentionally pulled the trigger; defendants refer to Grady's conduct as \"accidental.\" It is also disputed whether Grady intended to apprehend Bell by hitting Bell over the head with his revolver. Grady denied this allegation at trial, but in a recorded telephone conversation between Grady and Krause in 1978 which was admitted into evidence, Grady stated: Now, see, I was going to hit the guy over the head with that thing, see, and it went off. * * * See, I was trying to grab him, you know, and I had the God damn gun in my hand, see, at the same time, and I grabbed him, the gun banged on him and then I suppose my finger must have been on the trigger and off it went, see. (Exh. 79).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. William Hochstaetter died in 1980, one week before plaintiffs were to take his scheduled deposition (Tr. 1893).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Testimony of Grady (Tr. 2192).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The holdup man declaration was contrived by Krause (Tr. 2196).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Krause's testimony at trial does not support plaintiffs' contention and contradicts earlier statements made by him on this point. On October 20, 1978, he told two state investigators that he told Shaffer in the car the knife was planted (Exh. 155, Tr. 1317-1320).In a deposition on May 1, 1981, he admitted the statement but said he was not very positive (Tr. 1321).He then retracted the statement and stated that on the morning of February 3, 1958, he told Shaffer the knife had been planted (Tr. 1548). At trial he retracted all these statements and testified that he never told Shaffer the knife was planted, but that on the morning of February 3, 1958, he told Detectives Vorpagel, Hughes and Captain of Detectives Leo Woelfel the knife was planted (Tr. 1551).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The January 30, 1958, police bulletin relied upon by Grady read: Robb[ery], Armed, CM [Colored Male], 25-28, 5'9\", 155, slim build, light brown skinned, wore brown cap, gray waist length coat, gray or tan pants, had white tape over upper lip, carried a long barreled blue steel revolver, Cpl. [complainant] Harry's Grocery Store 108 W. Garfield Ave, about. 7:00 PM 1-29-58, unknown CM entered and demanded money at gun-point, obtained $81 from cash register, as bandit was leaving store the complainant shot twice at him, the robber returned 2 shots, No one injured. (Exh. 56). Daniel Bell was 5\"-11\", 145 lbs., age 23, and on February 2 was wearing a light tan topcoat, striped brown trousers, and no cap.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The above-quoted language is from Grady's report (Exhs. 15, 16). The language in Krause's report is somewhat different: \"I'm a hold-up man, you sons a bitches will never get me\" (Exhs. 12, 13).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. A Milwaukee Sentinel article dated February 3, 1958, reported an armed man fled from two patrolmen yelling, \"You'll never take me. I'm a holdup man.\" The newspaper article stated the dead man was carrying an open pocket knife in his hand. Detective Lieutenant McClintock is reported as saying that victims of recent robberies who gave descriptions of blacks as their accosters would be asked to identify the body, to confirm or refute Bell's statement that he was a holdup man (Exh. 1007C). The Milwaukee Journal article dated February 3, 1958, also reported the shooting of Daniel Bell by Thomas Grady as set forth in the Grady-Krause reports, which were disclosed to the press. The article states that relatives of Daniel Bell believed Daniel ran from the police because he was fearful of arrest for driving without a driver's license. The article also states that Daniel had a record of nine arrests dating back to 1952, the year he came to Milwaukee from Louisiana, the five most recent arrests involving violations of the driver's license law (Exh. 70A).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. A police officer was dispatched to inform the family, apparently not reaching Patrick Bell's house until immediately after the broadcast.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. As Krause testified, Grady placed the knife in Bell's right hand.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The evidence is not conclusive that this conversation took place on February 3. Contrary to Grady's testimony, Johnson testified that it could have been two days after the incident, i.e., February 4 (Tr. 2823). In any event, plaintiffs claim that at this meeting Grady told Johnson he shot Bell at a distance of six feet, and that Bell slashed at Grady with the knife (Plaintiffs' Br., p. 10). This claim is unsupported by the record.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Krause testified that McCauley's statement was \"bring me one story and it had better be the truth\" or something similar to that\" (Tr. 1393).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Tr. 1392-1393, 2311-2325, 2521, 2574-2575, 2743-2744. Shaffer testified he did not recall McCauley saying that the reports were inconsistent or that McCauley wanted new reports. Grady did not recall the conversation in McCauley's office, other than McCauley's asking him what happened.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Exh. 67A.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Exh. 67B.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. It is undisputed that these reports were written sometime after the initial \"homicide\" reports written the night of the shooting since they refer to the homicide reports.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Exh. 66.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Note that if this statement is accurate, defendants' contention that the attempted aggravated battery reports were written the night of the shooting cannot be believed give Johnson's non-involvement with the investigation the night of February 2. Johnson testified that he never spoke with reporters at any time. Johnson is also quoted in the February 4 Milwaukee Sentinel article (Exh. 67B) as saying, \"Since the shooting was fatal, it was referred to the district attorney's office for investigation as a matter of \"routine procedure.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Exh. 66. On February 6, Detective Hughes located three witnesses to the chase and filed a supplementary report relating what they saw.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The alleged damages include (1) $15,000 for pecuniary injury, Wis. Stat. § 331.04(4)(1957), (2) $2,500 for loss of society and companionship, the maximum recoverable under the earlier version of the statute and recoverable only by the spouse or the parents of the deceased, id., and (3) $625 for funeral expenses incurred, Wis. Stat. § 331.04(5)(1957).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Pertinent portions of the recorded conversations admitted into evidence include: Krause: [T]his thing resurfaced with Bell. And ahh, I'll be very honest with you, Tom, I haven't slept too much. Uhmm. I've gone to the priest, ahh, he referred me and you know I didn't mention names or anything else. Grady: And you know anything up now, ahh repercussions and the problems for everybody way down the line and ohh man. It would be inconceivable what could happen. Krause: Well, you know, that's what I'm thinking of too, but then, you know and as I told a few other people that night. Let's tell the goddamn truth, and let's get it over and done with. Grady: But you know ah how things go. Ahh, do you remember ahh everybody ahh, ahh down there you know ahh. I can't mention all the names now, but, you know, everybody that backed us ahh all the way down the line is ahh, oh man, Christ, there'd be hundred, hundreds of people that'd be in the soup. Krause: See, I can, the more I think about it, Tom, I, I can still see McCauley sitting there the next morning and, you know, throwing the goddamn papers right back and, and to our laps and saying go, and put the goddamn thing together. Grady: ah-huh. Krause: So that we get one story instead of the two or three different stories. Grady: Yeah. Krause: If you remember that. Grady: Ah-huh. Now, sure it's regrettable you know what happened. That darn thing was an accident and you know it and I know it, you know. And there's nothing intentional about it, but ah you know ah, and it's over with and there's you know . . . Krause: Tom, this guy never did say that he was a holdup man. Did he? Grady: I don't remember. Krause: Well, I didn't hear him say anything. I didn't hear this guy say one word when he got out of the car. All he did was run like a big, like a big deer. Grady: I remember we had them daily bulletins. Boy he sure fit some of them descriptions, just right down to a \"T\" and ah remember how many . . . (Exhs. 78-80).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. This Court extends its appreciation to the American Civil Liberties Union and the Chicago Lawyers Committee for Civil Rights Under Law, for their amici briefs in support of plaintiffs, and to the National Institute of Municipal Law Officers, for its amicus brief in support of defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. In order for the rule in Hammes to bar any res judicata effect of the 1960 action, it is only necessary to establish fraud or concealment, not a racially-motivated conspiracy under the civil rights laws. We approve the district court's finding of concealment and reserve discussion of the conspiracy claims infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Because defendants' fraudulent concealment bars the application of res judicata, it is unnecessary to decide whether a Section 1983 and conspiracy claim could or should have been raised by Dolphus Bell in the first action, notwithstanding the unlikelihood of success.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Although our holding on the statute of limitations issue is based on Wisconsin law, we note that the instant case is distinguishable from Sandutch v. Muroski, 684 F.2d 252 (3d Cir. 1982), cited by defendants, where the court held that a Pennsylvania statute of limitations applied to bar plaintiff's civil rights action against public officials arising from the use of a fraudulent statement in the prosection of plaintiff. There the prosecution had introduced the statement of an alleged co-conspirator that directly linked plaintiff to certain crimes. The co-conspirator recanted his prior statement before trial, but the prosecution offered the prior statement as evidence and the trial court excluded the subsequent recantation. The Third Circuit held that plaintiff, who waited four years after his conviction to file the civil rights claim, was time-barred by the state one- and two-year statutes respectively applicable to the torts of false arrest and false imprisonment since he had actual knowledge of the facts constituting the fraud (although not necessarily all the facts necessary to establish a civil rights violation) and thus failed to exercise due diligence. Sandutch v. Muroski, 684 F.2d at 254. In contrast, Daniel Bell, who occupied a factual position analogous to the plaintiff in Sandutch, was killed by virtue of the unlawful act. The Bell family was not in a similar position to learn the facts, which were elaborately concealed and distorted by the defendants and others. Sandutch is clearly inapplicable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. 42 U.S.C. § 1981 provides: All persons within the jurisdiction of the United States shall have the same right in every State and Territory to make and enforce contracts, to sue, be parties, give evidence, and to the full and equal benefit of all laws and proceedings for the security of persons and property as is enjoyed by white citizens, and shall be subject to like punishments, pains, penalties, taxes, licenses, and exactions of every kind, and to no other.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. 42 U.S.C. § 1983 provides: Every person who, under color of any statute, ordinance, regulation, custom, or usage, of any State or Territory or the District of Columbia, subjects, or causes to be subjected any citizen of the United States or other person within the jurisdiction thereof to the deprivation of any rights, privileges, or immunities secured by the Constitution and laws, shall be liable to the party injured in an action at law, suit in equity, or other proper proceeding for redress. For the purposes of this section, any Act of Congress applicable exclusively to the District of Columbia shall be considered to be a statute of the District of Columbia.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Section 1983 does not itself grant any substantive rights, Chapman v. Houston Welfare Rights Organization, 441 U.S. 600, 617-618, 60 L. Ed. 2d 508, 99 S. Ct. 1905, but rather provides a remedy for the deprivation of constitutional and federal rights. The rights at issue in the Section 1983 claims in this case are the due process rights of Daniel Bell and his family under the Fourteenth Amendment (and, with respect to the issue of excessive force in the attempted arrest, Daniel Bell's Fourth Amendment rights); therefore we refer throughout the Section 1983 as securing constitutional rights, implicitly recognizing that Section 1983 secures other federal rights as well.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. 42 U.S.C. § 1985 provides: § 1985. Conspiracy to interfere with civil rights (2) Obstructing justice; intimidating party, witness, or juror. If two or more persons in any State or Territory conspire to deter, by force, intimidation, or threat, any party or witness in any court of the United States from attending such court, or from testifying to any matter pending therein, freely, fully, and truthfully, or to injury such party or witness in his person or property on account of his having so attended or testified, or to influence the verdict, presentment, or indictment of any grand or petit juror in any such court, or to injure such juror in his person or property on account of any verdict, presentment, or indictment lawfully assented to by him, or of his being or having been such juror; or if two or more person conspire for the purpose of impeding, hindering, obstructing, or defeating, in any manner, the due course of justice in any State or Territory, with intent to deny to any citizen the equal protection of the laws, or to injure him or his property for lawfully enforcing, or attempting to enforce, the right of any person, or class of persons, to the equal protection of the laws; (3) Depriving persons of rights or privileges. If two or more persons in any State or Territory conspire * * * for the purpose of depriving, either directly or indirectly, any person or class of persons of the equal protection of the laws, or of equal privileges and immunities under the laws * * * in any case of conspiracy set forth in this section, if one or more persons engaged therein do, or cause to be done, any act in furtherance of the object of such conspiracy, whereby another is injured in his person or property, or deprived of having and exercising any right or privilege of a citizen of the United States, the party so injured or deprived may have an action for the recovery of damages occasioned by such injury or deprivation, against any one or more of the conspirators.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Invidious discrimination other than racially-based animus has been found remediable under Section 1985(3), including but not limited to gender, see Life Insurance Co. of North America v. Reichard T, 591 F.2d 499, 505 (9th Cir. 1979), and national origin, see Cartolano v. Ty r rell, 421 F. Supp. 526, 532 (N.D. Ill. 1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. 42 U.S.C. § 1986 provides: § 1986. Action for neglect to prevent Every person who, having knowledge that any of the wrongs conspired to be done, and mentioned in section 1985 of this title, are about to be committed, and having power to prevent or aid in preventing the commission of the same, neglects or refuses so to do, if such wrongful act be committed, shall be liable to the party injured, or his legal representatives, for all damages caused by such wrongful act, which such person be reasonable diligence could have prevented * * *.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. 42 U.S.C. § 1988 provides: The jurisdiction in civil and criminal matters conferred on the district courts by the provisions of this Title, and of Title \"CIVIL RIGHTS,\" and of Title \"CRIMES,\" for the protection of all persons in the United States in their civil rights, and for their vindication, shall be exercised and enforced in conformity with the laws of the United States, so far as such laws are suitable to carry the same into effect; but in all cases where they are not adapted to the object, or are deficient in the provisions necessary to furnish suitable remedies and punish offenses against law, the common law, as modified and changed by the constitution and statutes of the State wherein the court having jurisdiction of such civil or criminal cause is held, so far as the same is not inconsistent with the Constitution and laws of the United States, shall be extended to and govern the said courts in the trial and disposition of the cause, and, if it is of a criminal nature, in the infliction of punishment on the party found guilty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Defendants do not contend, nor could they realistically, that the shooting and killing were not state action for purposes of the Fourteenth Amendment. Nor do the defendants claim that the shooting and killing were not committed under color of state law. See Screws v. United States, 325 U.S. 91, 107-111, 89 L. Ed. 1495, 65 S. Ct. 1031 .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Section 895.04(3) provides: If separate actions are brought for the same wrongful death, they shall be consolidated on motion of any party. Unless such consolidation is so effected that a single judgment may be entered protecting all defendants and so that satisfaction of such judgment shall extinguish all liability for the wrongful death, no action shall be permitted to proceed except that of the personal objective.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Where the estate has a cause of action for personal injury prior to death, Wis. State § 895.04(6) gives the beneficiaries control over the settlement: Where the wrongful death of a person creates a cause of action in favor of the decedent's estate and also a cause of action in favor of a spouse or relatives as provided in this section, such spouse or relatives may waive and satisfy the estate's cause of action in connection with or as part of a settlement and discharge of the cause of action of the spouse or relatives.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. A shorthand resolution of the inconsistency question, once it is determined that a constitutional right has been deprived, is to label this killing a \"constitutional tort\" (Sanchez v. Marquez, 457 F. Supp. 359, 362 (D. Colo. 1978)), as opposed to a wrongful death action which sounds in tort. But these categorizations, without more, do not provide a complete answer to the question of the consistency of the policies of Section 1983 and state wrongful death statutes. Moreover, the divergence between the nature of a wrongful death tort and a Section 1983 constitutional tort is not always a dramatic one. As observed in Carey v. Piphus, 435 U.S. 247, 257-258, 55 L. Ed. 2d 252, 98 S. Ct. 1042, \"[O]over the centuries the common law of torts has developed a set of rules to implement the principle that a person should be compensated fairly for injuries caused by the violation of his legal rights. These rules, defining the elements of damages and the prerequisites for their recover, provide the appropriate starting point for the inquiry under § 1983 as well.\" (footnote omitted)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. The Colorado court's view was that the personal representative suing on behalf of the estate has no constitutionally protected interest in the life of the decedent; therefore state tort law which would limit damages recoverable by the estate to loss of earnings and expenses incurred prior to death (none existed in this case) was found applicable. Espinoza v. O'Dell, 633 P.2d at 466. The Colorado court found it \"unnecessary to determine whether any inconsistency exists between the state survival statute's damage limitations and the remedies required under § 1983.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Parratt v. Taylor also addressed the impact of state law on a claim of property deprivation without due process. There prison officials negligently lost the respondent prisoner's hobby hit and the respondent sued under Section 1983. The Supreme Court held that the property deprivation in question did not violate respondent's procedural due process rights because state law provided an adequate remedy for the deprivation. 451 U.S. at 537-544. The Supreme Court has also applied the rationale in Parratt to intentional deprivations of property, the Court noting that a predeprivation procedural remedy is impracticable where the deprivation results from the random and unauthorized conduct of a state employee, and that due process was provided by the state law post-deprivation remedy. See Hudson v. Palmer, 468 U.S. 517, 468 U.S. 517, 52 U.S.L.W. 5052, 82 L. Ed. 2d 393, 104 S. Ct. 3194 (July 3, 1984). The defendants do not strenuously argue that under Parratt the killing of Daniel Bell by a governmental actor does not constitute a violation of Fourteenth Amendment due process rights. Defendants' argument is rather that the remedy to be applied is provided by Wisconsin law pursuant to 42 U.S.C. § 1988 (and that the interests of Daniel Bell's father and siblings in the continued association of Daniel Bell do not amount to Fourteenth Amendment liberty interests). Therefore we note only briefly that, although Parratt has been applied to deprivations of life and liberty as well as property, e.g. Wolf-Lillie v. Sonquist, 699 F.2d 864, 871 (7th Cir. 1983); State Bank of St. Charles v. Camic, 712 F.2d 1140, 1147 (7th Cir. 1983), many courts have recognized that Parratt is inapplicable where the plaintiff asserts a violation of substantive constitutional guarantees as distinguished from a violation of procedural due process rights. See Guenther v. Holmgreen \u0026 City of Black River Falls, 738 F.2d 879, slip op. at 5 (7th Cir. 1984); Wolf-Lillie v. Sonquist, 699 F.2d at 871-872; State Bank of St. Charles v. Camic, 712 F.2d at 1147 n.5; Duncan v. Poythress, 657 F.2d 691, 704 (5th Cir. 1981), certiorari dismissed, 459 U.S. 1012, 74 L. Ed. 2d 504, 103 S. Ct. 368 . Nevertheless, under 42 U.S.C. § 1988 the impact of state law on claims brought under the Fourteenth Amendment can be critical. For further discussion of Parratt and its implications in substantive and procedural due process, see Wells \u0026 Eaton, Substantive Due Process And The Scope Of Constitutional Torts, 18 Ga. L. Rev. 201 (1984); Smolla, The Displacement Of Federal Due Process Claims By State Tort Remedies: Parratt v. Taylor And Logan v. Zimmerman Brush Co., 1982 U. Ill. L.F. 831.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In some cases the death of the victim might of course give rise to other claims on behalf of survivors.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Deterrence of wrongful or negligent conduct is also a policy objective of tort law, but as in Wisconsin, survival and wrongful death statutes generally do not seek to deter wrongful deaths through the imposition of damages for loss of life itself. The rationale is typically the extraordinary difficulty in measuring the value of the loss; and in the context of a survival action, there is the additional inability to restore a deceased to the state he would have enjoyed but for his death. See R. Posner, Tort Law: Cases and Economic Analysis 121-122 (1982). Yet given the stated tort policy of deterrence and the conceivable reduction of the incidence of tortious conduct created by the threat of substantial damages, these dilemmas amount to less than a compelling argument against any damages at all for loss of life. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Our holding that Daniel Bell's estate may properly raise a Section 1983 claim is based upon the Fourteenth Amendment's protection of life and the deterrence objective underlying Section 1983; it is unnecessary to address whether Section 1983 compensation policy is necessarily inconsistent with the Wisconsin policy of non-compensation where the victim by virtue of death cannot be made whole.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Many courts have adopted the position that for survivorship or statute of limitations purposes, Section 1983 actions can be viewed as redressing personal injuries. For a comprehensive discussion see Garcia v. Wilson, 731 F.2d 640 (10th Cir. 1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Of course, if judicial economy and federal uniformity were the only goals pursued in civil rights actions, a federal court might simply adopt a federal rule without any consideration of analogous state law. Indeed where state law is inconsistent a federally-created rule is the ultimate result. But this consequence does not imply that state law should not at least be considered. Wholly to ignore state law without a finding of inconsistency would contravene the mandate of 42 U.S.C. § 1988. For a contrary view suggesting that Section 1988 was never intended to apply in civil rights actions, see Eisenberg, State Law in Federal Civil Rights Cases: The Proper Scope of Section 1988, 128 U. Pa. L. Rev. 499 (1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. The critical issue manifestly is not what process is due, but whether the interests of the father and siblings in the first instance were protected by the due process clause, because if either or both interests rise to the level of Fourteenth Amendment guarantees, it is indisputable that the interests were infringed without due process.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. At oral argument petitioner made clear that her Section 1983 case before the Supreme Court was based upon her personal liberty interest in raising and having a child without state interference, but theretofore the claim was apparently based upon her unconstitutional deprivation of property by virtue of state damage limitations. Jones, 432 U.S. at 185-186. The six-member majority believed this divergence wholly pretermitted the underlying question of whether the mother had been deprived of any constitutional liberty interest. 432 U.S. at 188. The three-member dissent led by Justice White disagreed, finding plaintiff's liberty claim to have been properly raised below and properly presented in the petition. 432 U.S. at 189-196.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. In Espinoza v. O'Dell 456 U.S. 430, 456 U.S. 430, 102 S. Ct. 1865, 72 L. Ed. 2d 237, the Supreme Court said nothing on the constitutional liberty interest issues, dismissing certiorari summarily for lack of finality. There Arthur Espinoza was killed by a police officer acting under color of law, and Section 1983 claims were brought by the decedent's children and the personal representative of the estate. The trial court dismissed the claims on the rationale that a federal remedy independent of Colorado wrongful death law did not exist under Section 1983, and since plaintiffs did not file a state law claim, the complaint failed to state a claim under which relief could be granted. Espinoza v. O'Dell, 633 P.2d 455, 459 (Colo. 1981)(discussing trial court proceedings). The Colorado Supreme Court, partially overruling its prior holding in Jones v. Hildebrant, supra, held that Colorado wrongful death damage limitations restricting recovery to net pecuniary loss were inconsistent with the compensation and deterrence policies underlying Section 1983.The court also held that the children enjoyed a constitutional liberty interest, compensable under Section 1983, in their relationship with their father. The court based its holding on Supreme Court precedent, discussed infra, recognizing a parent's Fourteenth Amendment liberty interest in the companionship and care of his or her children. Regarding the Section 1983 claim of the personal representative, the Colorado court followed its prior holding in Jones v. Hildebrant, ruling that no Section 1983 right exists, especially since the children were fully compensated under their separate claim. 633 P.2d at 466. The court did not question whether state law, which would only allow the estate to recover for pecuniary loss incurred prior to death (in that case zero), was inconsistent with Section 1983.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. Because this case does not present the issue, any pronouncement would be unnecessary regarding whether one possesses a constitutional right under Section 1983 to recover for the loss of society and companionship resulting from the death of a spouse.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. In one sense the rights created and guaranteed by these decisions do not stem from relationships per se but are personal and belong to the individual. This view is most evident in Planned Parenthood v. Danforth, 428 U.S. 52, 49 L. Ed. 2d 788, 96 S. Ct. 2831, which held that a law requiring the husband's consent as a precondition to the wife's abortion constitutes an unwarranted intrusion into the wife's right to abort. See also Developments in the Law -- The Constitution and the Family, 93 Harv. L. Rev. 1156, 1164 n.31 (1980); Eichbaum, Toward an Autonomy-Based Theory of Constitutional Privacy: Beyond the Ideology of Familial Privacy, 14 Harv. C.R.-C.L. L. Rev. 361, 366 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Justice Powell in Moore not only recognized the importance of familial relationships but went on to say: Our decisions establish that the Constitution protects the sanctity of the family precisely because the institution of the family is deeply rooted in this Nation's history and tradition. It is through the family that we inculcate and pass down many of our most cherished values, moral and cultural. 431 U.S. at 503-504 (plurality opinion). The plurality did not, however, specify what family relationships it would accord constitutional protection and compensation under Section 1983.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. Our holding diverges from a different Colorado district court's most recent decision regarding Section 1983 death actions. In Jackson v. Marsh, 551 F. Supp. 1091 (D. Colo. 1982), the court held that parents do not enjoy a constitutionally-protected right to the companionship of their children. 551 F. Supp. at 1093-1094. The court based its holding in part upon the rationale that the parental right can only be raised in the context of \"pervasive, broadly-focused governmental activity directed at the family units in the community as a whole,\" and not to \"protect[] individuals from particular acts of governmental agents focusing upon specific family members and potentially affecting the continuity of the intra-family relationship.\" 551 F. Supp. at 1094. See also Evain v. Conlisk, 364 F. Supp. 1188, 1191 (N.D. Ill. 1973) (no deprivation of daughter's constitutional rights arising from shooting death of father under color of state law). But see generally Logan v. Hollier, 711 F.2d 690, 691 (5th Cir. 1983) (remand for determination of mother's right to continued association of child).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. The Supreme Court has read Section 1983 against the \"background\" of common law tort remedies. See Pierson v. Ray, 386 U.S. 547, 556-557, 87 S. Ct. 1213, 18 L. Ed. 2d 288. See generally Nahmod, Section 1983 and the \"Background\" of Tort Liability, 50 Ind. L.J. 5 (1974). Of course this background is not controlling, as in regard to the damages measure for loss of life addressed supra, where the state tort rule derived from common law is inconsistent with the policies underlying Section 1983.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Illinois Central R.R. Co. v. Barron, 72 U.S. 90, 18 L. Ed. 591, 5 Wall. 90 ; Barley v. Chicago \u0026 A. R. Co., 2 F. Cas. 827, 4 Biss. 430, Fed. Cas. No. 997 (NLD. Ill. 1865); Little Rock \u0026 Ft. S. Ry. Co. v. Barker, 33 Ark. 350 (1849); Oldfield v. New York \u0026 H. R.R. Co., 14 N.Y. 310 (1856); Dickens v. New York C. R. Co. , 23 N.Y. 158 (1861); Pennsylvania R.R. Co. v. Ogier, 35 Pa. 60 (1860); Conant v. Griffin, 48 Ill. 410 (1868) City of Chicago v. Scholten, 75 Ill. 468 (1874); Besenecker v. Sale, 8 Mo. App. 211 (Mo. Ct. App. 1880); Steel v. Kurtz, 28 Ohio St. 191 (Ohio 1876); Donaldson v. Mississippi \u0026 M. R.R. Co., 18 Iowa 280 (1865); Carlson v. Oregon Short Line \u0026 U.N. Ry. Co., 21 Ore. 450, 28 P. 497 (1892).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. 9 \u0026 10 Vict., ch. 93 (1846).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. Long v. Morrison, 14 Ind. 595 (1860) (but see Jefferson Ville R.R. Co. v. Swayne's Administrator, 26 Ind. 477 (1866)); Beeson v. Green Mountain Gold Mining Co., 57 Cal. 20 (1880); Matthews v. Warner's Administrator, 70 Va. 570 (1877); Holt v. Spokane \u0026 P. Ry. Co., 3 Idaho 703, 35 P. 39 (1893); In Matthews v. Warner's Administrator, supra, the court noted that other state statutes including those in Kentucky, Connecticut, and California allow the jury to award those damages that are \"fair and just,\" and not necessarily limited to pecuniary injury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. In Whiton v. Chicago \u0026 N.W.R. Co., 29 F. Cas. 1111, 2 Biss. 282, Fed. Cas. No. 17,597 (E.D. Wis. 1870), the jury awarded the statutory maximum of $5,000 for the death of a woman, even though damages were to be limited to pecuniary injury and her prospective earning capacity did not appear to amount to $5,000. The court upheld the award on the ground that the jury could consider her personal qualities, i.e., that \"Mrs. Whitton was a superior woman, as wife, mother, and member of society * * *.\" The Supreme Court affirmed, Chicago \u0026 N.W. R.R. Co. v. Whitton, 80 U.S. (13 all.) 270, 20 L. Ed. 571 . In Barron v. Illinois Central R.R. Co., 2 F. Cas. 934, 1 Biss. 412, Fed. Cas. No. 1052 (N.D. Ill. 1863), affirmed, 72 U.S. 90, 18 L. Ed. 591, 5 Wall. 90, the district court observed that because Illinois statutory damage rules are \"loose and indefinite,\" it is proper for death damages to account for the \"dignity\" and \"character\" of the person. In Searle v. Kanawha \u0026 O. R.R. Co., 32 W.Va. 370 , 9 S.E. 248 ( 1889), the court held that pecuniary injury can include \"loss of bodily care of intellectual culture of moral training which the mother had before supplied * * *.\" In Kansas Pacific Ry. Co. v. Cutter, 19 Kan. 83 (1877), the court held it was not error to instruct the jury that damages can reflect the \"relations between [the deceased] and his children,\" but compensation for the \"wounded feelings of the surviving relatives\" would be improper. This approach retains vitality in some states where the wrongful death statute limits recovery to pecuniary injury. Courts of Delaware, Illinois, Michigan, Minnesota, Montana, Pennsylvania, South Dakota, and Texas have broadly construed pecuniary injury to include loss of society and companionship. See, e.g., Sea-Land Services, Inc. v. Gaudet, 414 U.S. 573, 587, 39 L. Ed. 2d 9, 94 S. Ct. 806 and n.21, 39 L. Ed. 2d 9, 94 S. Ct. 806 (discussing state statutes); see also Bullard v. Barnes, 102 Ill. 2d 505, 82 Ill. Dec. 448, 468 N.E.2d 1228, slip op. at 4 (Ill. Sup. Ct. 1984) (\"Of the 23 jurisdictions with statutes or decisional law limiting wrongful death recoveries to pecuniary loss, 14 now allow parental recovery in a wrongful death action for the loss of society of a child.\"); S. Speisere, Recovery For Wrongful Death § 3:49 (2d ed. 1975). Considering these states and those in which the wrongful death statute more explicitly allows some recovery for loss of society ad companionship, the modern majority rule is in favor of permitting such recovery. S. Speiser, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e57. To the extent that Wisconsin decisions indicate that Wisconsin law would not allow defendants to benefit in any way by virtue of their cover-up in this case, see generally Boehm v. Wheeler, 65 Wis. 2d 668, 681, 223 N.W.2d 536 (1974); State ex rel. Susedik v. Knutson, 52 Wis. 2d 593, 598, 191 N.W.2d 23 (1971); Estate of Wilkins, 192 Wis. 111, 119, 211 N.W. 652 (1927), the fact that Dolphus Bell died \"before judgment in this action\" under Wis. Stat. § 895.04(2) should not operate to deny Dolphus Bell's estate's recovery under Wis. Stat. § 895.04(4).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e58. The district court adequately instructed the jury to take into account the fact that Dolphus Bell died in 1962. Also, we reject without elaborate discussion defendants' contentions that the siblings' testimony regarding Dolphus Bell's close relationship with Daniel is inadmissible, and that plaintiffs' per diem damages argument at trial was per se improper. See Waldron v. Hardwick, 406 F.2d 86, 89 (7th Cir. 1969).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e59. The discussion of remedies in Hudson v. Palmer, 468 U.S. 517, 468 U.S. 517, 52 U.S.L.W. 5052, 82 L. Ed. 2d 393, 104 S. Ct. 3194 (1984), does not require a contrary result. In Hudson the respondent inmate brought a Section 1983 action alleging, inter alia, that the petitioner official destroyed personal property belonging to respondent during a search. The Supreme Court held that petitioner did not deprive respondent of his procedural due process rights under the Fourteenth Amendment where the state provided respondent an adequate remedy for the alleged destruction of property. U.S. at , 52 U.S.L.W. at 5056-5057. The Court also noted that the fact that respondent might recover less in a state action than in a Section 1983 action is not determinative of the adequacy of state remedies. Id. Hudson is not controlling because in the instant appeal defendants do not argue that no procedural due process right was infringed on the ground that the state remedies are adequate under Hudson or Parratt v. Taylor, supra. We have rejected defendants' argument that Dolphus Bell's Fourteenth Amendment rights were not infringed; the question therefore becomes whether Wisconsin damage provisions are consistent with the policies underlying the Fourteenth Amendment and Section 1983.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e60. Needless to say, this area of the law is unsettled and complex, and many decisions are difficult to reconcile and one another. For example, the Wisconsin Supreme Court in Thompson v. Village of Hale Corners, 115 Wis.2d 289, 340 N.W.2d 704 (1983), held that a statutory maximum damage award of $25,000 regarding a dispute between a proprietor and the Village, which allegedly selectively enforced an ordinance to plaintiff's detriment, was inapplicable under Section 1983. The court held that plaintiff's property rights had been deprived by the Village without due process, and that Carey v. Piphus mandated that a federal remedy allowing full compensation ($88,000) should be applied. But see Enright v. Board of School Directors, 118 Wis. 2d 236, 346 N.W.2d 771 (1984), where the court applied the particular Wisconsin statute at issue in this case, Wis. Stat. § 895.04, to limit recovery in a Section 1983 action. There a boy walking from public school toward home on his lunch hour was accosted by a man and strangled to death. Earlier that day school officials had observed the killer lurking suspiciously near the playground but took no immediate action. The boy's parents sued the board of school directors and others under common law negligence and Section 1983. Regarding the Section 1983 claim, the Wisconsin Supreme Court, without deciding whether the parents' constitutional rights had been violated, held that under Parratt v. Taylor, supra, the Wisconsin wrongful death remedy and whatever damages allowed under Wis. Stat. § 895.04 were adequate remedies. Implicit in the Enright court's analysis is the recognition that the underlying harm was perpetrated by a non-governmental actor, and that the facts closely resembled those establishing a traditional state law negligence action based upon the negligent failure to intervene.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e61. This case is distinguishable from e.g., Guyton v. Phillips, 606 F.2d 248 (9th Cir. 1979), certiorari denied, 445 U.S. 916, 63 L. Ed. 2d 600, 100 S. Ct. 1276, which held that the civil rights statutes do not reach conspiracies which ostensibly seek to deprive constitutional rights of a person after death. Here the conspiracy claim is based upon the rights of (1) Dolphus Bell before his death in 1962, whose claim survives under Wisconsin law, and (2) the siblings. We also reject defendant's characterization of the conspiracy claim of nothing more than a defamation action redressing harm to reputation, which, as the Supreme Court held in Paul v. Davis, 424 U.S. 693, 47 L. Ed. 2d 405, 96 S. Ct. 1155, does not rise to the level of liberty or property interests protected by the Fourteenth Amendment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e62. Woelfel and Glaser were deceased at the time of this action. Their estates were never named in the complaint and had no opportunity to defend this action. To protect their due process rights, the district court held that their estates could not be held liable. Bell III, 536 F. Supp. 462, 471-472. Their names were included in the special verdict in the event that plaintiffs could establish an independent theory of liability against the City for their misdeeds. We affirm this holding of non-liability and address infra plaintiffs' claim that the punitive damages assessed against them are recoverable from the City of Milwaukee. While the special verdict question on conspiracy punitive damages does not specify how the damages should be divided between Dolphus Bell's estate and the siblings as a group, this omission is not fatal. First, the siblings are residual beneficiaries of the father's estate. Second, pursuant to Fed. R. Civ. P. 49(a), we may deem the district court to have made a finding in accord with the judgment on the special verdict. See Smallwood v. Pearl Brewing Co., 489 F.2d 579, 606-607 (5th Cir. 1974), certiorari denied, 419 U.S. 873, 42 L. Ed. 2d 113, 95 S. Ct. 134 . Based on the amount of compensatory damages awarded as a result of the conspiracy in favor of the estate and the siblings, and upon our analysis of the jury instructions on damages employed by the district court, we hold that whatever conspiracy punitive damages we sustain on appeal are to be allocated between Dolphus Bell's estate and the siblings as a group in amounts between Dolphus Bell's estate and the siblings as a group in amount pro-rata with their conspiracy compensatory damages awards, i.e., $225,000 and $540,000, respectively.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e63. Along with Woelfel and Glaser, District Attorney McCauley was also deceased at the time of this action, and his estate was not named as a defendant. Plaintiffs' cross-appeal arguments relating to McCauley are discussed infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e64. A conspiracy is not a necessary element for liability under Sections 1981 or 1983. Plaintiffs sought to establish at trial and defendants appeal from a finding of conspiracy, required under Section 1985, that is, a link between the activity of Johnson and Shaffer subsequent to the shooting and the patent misconduct of Grady and Krause. The court submitted to the jury special verdict questions specifically asking whether the defendants participated in a \"conspiracy to cover up the true facts of the shooting of Daniel Bell,\" whether race was \"an operative factor in the conspiracy,\" and the amount of damages to be awarded for any deprivation of constitutional rights as a result of the conspiracy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e65. As mentioned earlier Krause at one point claimed he told Shaffer the night of the shooting that the knife was planted, but Krause completely contradicted himself several times on this claim at trial. Little or nothing can be deciphered from Krause's testimony on this point.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e66. Vorpagel testified that later that day he told Shaffer he was concerned over the fact he was asked to change his report, he would not change it, and asked him what he should do. Shaffer responded, \"you do what you think is right\" (Tr. 2345). Defendants argue this comment evidences Shaffer's willingness to support Vorpagel in Vorpagel's resistance to the cover-up. No such significance should be attached to this ambiguous comment since the record does not disclose that Shaffer at any time openly supported Vorpagel's resistance to the cover-up.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e67. The jury's special verdict linking Johnson to the conspiracy is sustainable even though the special verdict question did not specifically mention Section 1986 liability. Section 1986 is a companion section to Section 1985, predicated upon the finding of a Section 1985 conspiracy, and not a distinct cause of action. The plaintiffs argued Section 1986 liability in addition to liability as a participant in the conspiracy. The district court also instructed the jury that liability could be predicated upon neglect to prevent any of the acts of concealment, i.e., Section 1986 liability. Since the theory of Section 1986 liability was properly before the jury Johnson's liability is sustainable, not as a co-conspirator per se but pursuant to Section 1986.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e68. See note 11 supra and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e69. Section 1985(2) clearly is not limited to the scenario where the defendants act under color a law in hindering or obstructing the \"due course of justice,\" see note 30 supra. The source of congressional authority for Section 1985 and its regulation of the conduct of private actors is generally understood to be Section 5 of the Fourteenth Amendment. See Britt v. Suckle, 453 F. Supp. 987 (E.D. Tex. 1978). With respect to Section 1985(3), which prohibits conspiracies formed for the purpose of depriving any person the equal protection of the laws, the Supreme Court in Griffin v. Breckenridge, 403 U.S. 88, 29 L. Ed. 2d 338, 91 S. Ct. 1790, held that Congress could constitutionally regulate private conduct. The Court based its holding upon the legislative history of Section 1985(3) and upon the absence of \"under color of law\" language in the provision. This Court has interpreted Griffin to eliminate the under color of law requirement only with respect to conspiracies to deny the right of travel and rights based upon the Thirteenth Amendment. See Cohen v. Illinois Institute of Technology, 524 F.2d 818, 828-829 (7th Cir. 1975), certiorari denied, 425 U.S. 943, 96 S. Ct. 1683, 48 L. Ed. 2d 187; see also Bellamy v. Mason's Stores, Inc., 508 F.2d 504, 506 (4th Cir. 1974). Other courts have held that state involvement need not be shown in an action for conspiracy to deprive of equal protection. See e.g., Dry Creek Lodge, Inc. v. United States, 515 F.2d 926, 931 (10th Cir. 1975). Even under Cohen, defendants as employees of the City of Milwaukee acted under color of state law in conspiring to deny plaintiffs of their equal protection rights.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e70. The sue and give evidence clause of Section 1981 in some circumstances provides a special statutory right. See e.g., Pennsylvania v. Local 542, I.U.O.E., 347 F. Supp. 268 (E.D. Pa. 1972) (court enjoined union members from harassing and assaulting parties who had sued the union for racial discrimination; such retaliatory practices against parties exercising their right to sue are prohibited under Section 1981). But in the instant case plaintiff's due process and equal protection rights are central issues, and these rights are addressed by Section 1985 as well as Section 1983, and accordingly the sue and give evidence clause of Section 1981 in this case is to some extent superfluous. See J. Cook \u0026 J. Sobieski, Civil Rights Actions P5.03(B)(1983) (\"[the sue and give evidence clause] is largely superfluous\" because \"the subject is fundamental to the due process and equal protection clauses of the fourteenth amendment,\" and given \"the historical judicial bias in favor of enforcing fourteenth amendment rights over thirteenth amendments rights * * *.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e71. See note 30 supra. Regarding the language in the second portion of Section 1985(2) referring to the obstruction of justice in \"any State or Territory,\" we note that the coroner's inquest at which Grady and several others testified falsely is a state proceeding. Moreover, defendants' obstruction of justice can be considered to have interfered with plaintiffs' rights in state courts, which have jurisdiction over state law wrongful death claims as well as concurrent jurisdiction over constitutional claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e72. We cannot accept defendants' implicit argument that we should impose upon plaintiffs a strict causal showing of exactly what relief plaintiffs would have obtained in court had defendants not concealed the truth. Since defendants did in fact substantially conceal the facts from plaintiffs (despite whatever ambiguities surfaced in particular newspaper articles or at the inquest), this concealment at least in part precludes knowledge of the relief plaintiffs establish that the concealment was a substantial cause of their failure to obtain judicial relief, since defendants' concealment of the facts, false representations in defending the prior state suit, and rebuffs directed at the Bell family in the course of the investigation preclude us from knowing what would have happened otherwise. Plaintiffs have met this burden.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e73. Defendants argue that awarding damages on the conspiracy claims is improper given the holding in Briscoe v. LaHue, 460 U.S. 325, 103 S. Ct. 1108, 75 L. Ed. 2d 96, that witnesses who commit perjury are immune from monetary liability in Section 1983 actions. Defendants completely overlook, however, the substantial evidence proffered by plaintiffs of unlawful conspiratorial conduct other than the false testimony at the coroner's inquest. Moreover, the holding in Briscoe is limited in at least two critical respects. First, Briscoe and many of the decisions upon which Briscoe is based are limited to claims brought under Section 1983, not Section 1985. Although the majority in Briscoe exspressly noted that the issue need not be decided at that juncture (nor do we decide the issue), the Court observed that, in contrast to Section 1983, \"the legislative history and statutory language indicate that Congress intended perjury leading to unjust acquittals of Klan conspirators to be prohibited by Section 2, the civil and criminal conspiracy section of the statute, now codified in relevant part at 42 U.S.C. § 1985(3) (1976) and 18 U.S.C. § 241 (1976).\" U.S. , 103 S. Ct. at 1116. Second, the Court explicitly declined to reach the question of U.S. , n.5 103 S. Ct. at 1112 n.5. The holding of Briscoe v. LaHue is limited in other respects not relevant herein.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e74. Rule 6 states in pertinent part: Section 7. The Captain of Detectives shall report in person daily, at a time directed, to the Chief of Police, and submit to him all matters and information of police interest or importance with relation to the Detective Bureau and the Department generally which may come to his attention. Whenever a crime of great magnitude or importance, or a matter of serious departmental concern, is reported to the Captain of Detectives, he shall immediately advise the Chief of Police of the facts pertaining thereto. Section 8. The Captain of Detectives shall, whenever practicable, personally visit the scenes of unusual and important crimes, and acquaint himself with the location and conditions so he may then better direct investigation in such cases. When advisable, he shall cause photographs to be taken and charts to be made of the scene of any crime for possible use in court, and cause fingerprints to be photographed as evidence in criminal cases whenever obtainable. He shall cause verbatim statements to be taken of all persons involved, or suspected of being involved (including witnesses), in all major and important crimes. He shall obtain descriptions, photographs, and fingerprints of unknown dead for the purpose of identification. He shall cause ante-mortem statements to be taken promptly, properly and carefully. Section 14. The Captain of Detectives shall keep the Chief of Police fully advised about the work of his Bureau, and when important cases are under investigation he shall consult frequently with and advise the Chief of Police of the progress being made. Section 15. The Captain of Detectives shall at least once each week, or oftener [sic] if conditions require, hold conference with the Police Identification Superintendent, lieutenants of detectives, and detective sergeants for the purpose of discussing with them all the work and affairs of the Detective Bureau so far as their duties are concerned, with a view of obtaining information and suggestions for the improvement of the detective service. A written report of all important matters resulting from such conference shall be submitted promptly to the Chief of Police. Section 17. A District Commander shall see that all necessary reports are transmitted promptly to Police Headquarters and shall personally bring to the attention of the Chief of Police the details of any event of grave importance or of unusual character. He shall carefully examine all reports of whatever nature before they are forwarded to headquarters, and shall be held responsible for the accuracy and truth thereof. Exh. 47A. The position of captain of detectives was reclassified as inspector of detectives, held by Glaser in 1958.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e75. Wis. Stat. § 895.46(1)(a) (1983) states in pertinent part: 895.45 State and political subdivisions thereof to pay judgments taken against officers (1)(a) If the defendant in any action or special proceeding is a public officer or employe and is proceeded against in an official capacity or is proceeded against as an individual because of acts committed while carrying out duties as an officer or employe and the jury or the court finds that the defendant was acting within the scope of employment, the judgment as to damages and costs entered against the officer or employe in excess of any insurance applicable to the officer or employe shall be paid by the state or political subdivision of which the defendant is an officer or employe. Agents of any department of the state shall be covered by this section while acting within the scope of any written agreement entered into prior to the occurrence of any act which results in any action or special proceeding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e76. Though not crucial to the outcome of the punitive damages claims, the district court properly held, Bell III, 536 F. Supp. at 472, that plaintiffs have failed to establish that Woelfel's and Glaser's activity in the conspiracy was pursuant to a policy, ordinance, regulation, decision officially adopted and promulgated, or custom, usage, or practice. Plaintiffs had submitted to the jury a special verdict question as to whether the City had a policy, practice, custom, or usage in 1958 of advising its police officers to plant a \"throwaway\" knife on the victim of a police shooting (Special Verdict Question C3), but during the course of jury deliberations plaintiffs moved and were permitted to withdraw the question. No other potential basis for finding Monell conduct has been established regarding Woelfel and Glaser in this case. The situation here contrasts with that in Webster v. City of Houston, 689 F.2d 1220 (5th Cir. 1982), where plaintiffs proffered substantial evidence of a policy or custom of using \"throw down\" weapons. See generally Note, Municipal Liability Under Section 1983: The Meaning of \"Policy or Custom\", 79 Colum. L. Rev. 304 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e77. The district court intimated that in some cases a party may recover damages under the theory of respondeat superior against a municipality for the acts of an employee in an action based upon Section 1981. Bell III, 536 F. Supp. at 474.The court reached this conclusion via a brief review of legislative history and a narrow construction of Monell and its progeny, which have disallowed respondeat superior recovery under other sections of the civil rights laws. See Owens v. Haas, 601 F.2d 1242, 1247 (2d Cir. 1980), certiorari denied, 444 U.S. 980, 62 L. Ed. 2d 407, 100 S. Ct. 483 (applying the Monell standard under Section 1985); Vasquez v. City of Reno, 461 F. Supp. 1098, 1102 (D. Nev. 1978) (same regarding Section 1986). This Court need not resolve this issue, as we hold infra that City of Newport v. Fact Concerts, Inc. precludes recovery from the City under Sections 1981 and 1985 of the punitive damages assessed against Woelfel and Glaser.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e78. If the city is in fact raising the argument, this position directly conflicts with counsel's admission at oral argument on the post-verdict motions that the City is obligated to indemnify Johnson and Shaffer for whatever damages assessed against them. More fundamentally, such an argument creates a conflict of interest because the City Attorney has simultaneously represented the City, Johnson and Shaffer throughout this action. Were we to hold that the City is not obligated to indemnify Johnson and Shaffer for punitive damages, possibly irreparable harm would result due to the conflict. However, as noted in the text, this is a matter of state law, Wis. Stat. § 895.46, and is unaffected by the holding of City of Newport. We therefore reject any such argument, and thus the conflict issue is moot.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e79. Proceedings of Dec. 3, 1981, Plaintiffs' App., pp. 466-477.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e80. The Wisconsin Criminal Code provides: 940.06 Homicide by reckless conduct (1) Whoever causes the death of another human being by reckless conduct is guilty of a Class C felony. (2) Reckless conduct consists of an act which creates a situation of unreasonable risk and high probability of death or great bodily harm to another and which demonstrates a conscious disregard for the safety of another and a willingness to take known chances of perpetrating an injury. 946.31 Perjury (1) Whoever under oath or affirmation orally makes a false material statement which the person does not believe to be true, in any matter, cause, action or proceeding, before any of the following, whether legally constituted or exercising powers as if legally constituted, is guilty of a Class D felony: (f) An officer authorized to conduct inquests of the dead.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e81. Grady also argues that the complaint is inadmissible because it is outside the scope of Fed. R. Evid. 803(22), the hearsay exception applicable to prior criminal judgments of conviction, admissible \"to prove any fact essential to sustain the judgment.\" It is obvious that Rule 803(22), which applies specifically to judgments of conviction, does not operate to admit the statements of complaining witnesses incorporated in a criminal complaint. The statements found in the complaint, however, may be admissible under another hearsay exception, or may not even be hearsay.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e82. On this issue the complaint actually supports Grady. In the complaint Krause mentions that during the recorded telephone conversations between Krause and Grady in 1978 \"Grady stated that * * * the shooting was an accident * * *.\" Exh. 6, p. 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e83. We note that the district court admitted the criminal complaint under Fed. R. Evid. 801(d)(1)(A) as a prior statement of a witness given under oath which is inconsistent with the witness' testimony. Although we need not base the admissibility of Krause's statements in the criminal complaint on this particular ground, Krause's lack of recollection in itself regarding the making of the statements would justify the use of the statements for impeachment purposes, see United States v. Shoupe, 548 F.2d 636, 639-644 (6th Cir. 1977), thus affording Krause the opportunity to affirm and adopt the statements. However, using the statements as substantive evidence, had Krause not adopted his prior statements at trial, rests on shaky ground, since Fed. R. Evid. 801(d)(1)(A) limits the admissibility of prior statements given under oath to those which are \"inconsistent\" with the witness' testimony. Some courts have equated silence with inconsistency, particularly where it appears that the lack of recollection is feigned and the witness is simply taking refuge in a failure to remember. See United States v. Payne, 492 F.2d 449, 452 (4th Cir. 1974), certiorari denied, 419 U.S. 876, 95 S. Ct. 139, 42 L. Ed. 2d 115; United States v. Insana, 423 F.2d 1165 (2d Cir. 1970), certiorari denied, 400 U.S. 841, 27 L. Ed. 2d 76, 91 S. Ct. 83 . But see United States v. Rogers, 549 F.2d 490 (8th Cir. 1976), certiorari denied, 431 U.S. 918, 53 L. Ed. 2d 229, 97 S. Ct. 2182 . There exists another possible barrier to admitting the statements on the rationale of Krause's lack of recollection: prior statements are admissible under Rule 801(d)(1)(A) only if they were given \"under oath subject to the penalty of perjury at a trial, hearing, or other proceeding, or in a deposition * * *.\" Krause made his statements to Investigator Rogers under oath, but it is unclear on this record the extent to which Krause's statements were subject to the penalty of perjury, or whether the Krause-Rogers interview amounts to an \"other proceeding\" under Rule 801(d)(1)(A). See Martin v. United States, 528 F.2d 1157, 1161 (4th Cir. 1975) (sworn statements given federal agents investigating firebombing \"were not made at a trial, hearing or other proceeding * * * and would fail to qualify as substantive evidence under Rule 801.\"). But see United States v. Castro-Ayon, 537 F.2d 1055 (9th Cir. 1976), certiorari denied, 429 U.S. 983, 50 L. Ed. 2d 594, 97 S. Ct. 501 .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e84. In contrast to the limited admissibility of a witness' extrajudicial statements under the Federal Rules of Evidence, the Model Code of Evidence and Uniform Rules of Evidence treat all out-of-court statements of a person present at trial and available for cross-examination as an exception to the hearsay rule, see Model Code Rule 503(b); Uniform Rule 63(1).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e85. As at least one commentator has observed: If any prior statement of a witness is to be regularly admitted, the pressure to secure such statements, which is now substantial will inevitably be increased. The trial will certainly tend to be cluttered with prior statement after prior statement, written and oral, drawn not with a view to preserving the memory of the witness or the lawyer but with a view to making the best case before the jury or to presenting the jury with a written brief. Dow, KLM v. Tuller: A new Approach to Admissibility of Prior Statements of a Witness, 41 Neb. L. Rev. 598, 607 (1962).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e86. Grady was released from prison after serving three years' time.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e87. Analysis of this issue under the Fourth Amendment rather than the Fourteenth Amendment is most appropriate because \"the Fourth Amendment is specifically directed to methods of arrest and seizure of the person.\" Garner v. Memphis Police Dept., 710 F.2d 240, 243 (6th Cir. 1983), certiorari granted and probably jurisdiction noted, 465 U.S. 1098, 104 S. Ct. 1589, 80 L. Ed. 2d 122. The primary issue before the Supreme Court in Garner, to some extent related to the issue in the instant case, is the constitutionality of a state statute authorizing police officers to use deadly force in order to capture unarmed suspects fleeing from non-violent felonies.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e88. The instruction in pertinent part is as follows: The plaintiffs in this action also claim that Thomas Grady violated the constitutional right of the deceased Daniel Bell to be free from unreasonable force and unlawful arrest. Question A1 which reads as follows: Did the defendant Thomas Grady violate the constitutional rights of Daniel Bell in stopping, chasing and/or attempting to apprehend Daniel Bell on February 2nd, 1958? That question inquires of you about this aspect of the case. And I have already defined unreasonable force for you as excessive force. It is the claim of the plaintiffs on behalf of the deceased Daniel Bell that wrongful and excessive and unlawful force was used by the defendant Thomas Grady in connection with the pursuit and attempted apprehension of Daniel Bell. A person, even if he is being lawfully arrested, has a constitutional right to be free of unreasonable and excessive force. A police officer is entitled to use only such force as a reasonable person would think is required to take one arrested into custody. Moreover, an officer is not allowed to use any force beyond that reasonably necessary to accomplish the lawful purpose. The Fourth Amendment to the United States Constitution provides as follows: The ight of the people to be secure in their persons against unreasonable seizures shall not be violated and no warrants shall issue but upon probable cause supported by oath or affirmation, and particularly describing the persons to be seized. As to unlawful arrests, police officers may not arrest a person without an arrest warrant unless they have probable cause to believe that a crime has been committed and that the person in question has committed that crime. Probable cause exists if the facts and circumstances known to the officer and of which he had reasonable trustworthy information are sufficient to warrant a prudent person in believing that the suspect has committed a crime. Tr. 5266-5267.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e89. Under Model Penal Code § 3.11(1) (Proposed Official Draft 1962), deadly force can be inferred in the event that one \"purposely fire[es] a firearm in the direction of another person or at a vehicle in which another person is believed to be\" (emphasis added), but \"[a] threat to cause death or serious bodily harm by the production of a weapon or otherwise, so long as the actor's purpose is limited to creating an apprehension that he will use deadly force if necessary, does not constitute deadly force.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* The Honorable Robert J. Kelleher, Senior District Judge for the Central District of California, is sitting by designation.\u003c/span\u003e\n\n",
    "body_length": 284296,
    "citedas": [
      "746 F.2d 1205"
    ],
    "attorneys": "Walter F. Kelly, 1409 E. Capitol Dr., Milwaukee, WI 53211, Robert G. Ott, Mil. Cnty, Corp. Cnsl., 901 N. 9th St., Milwaukee, WI 53233, for Plaintiff Rudolph M. Konrad, City Atty., 800 City Hall, 200 E. Wells St., Milwaukee, WI 53202, James M. Fergal, Ste. 900, 270 E. Kilbourn, Milwaukee, WI 63202, for Defendant",
    "category": [
      "36",
      "75"
    ],
    "judges": "Before CUMMINGS, Chief Judge, CUDAHY, Circuit Judge, and KELLEHER, Senior District Judge.*fn*",
    "citation_count": 531
  }
}
