{
  "id": "dc_2YWYBTlTomsSBCDmy",
  "document": {
    "title": "Continental Insurance v. Page Engineering Co.",
    "full_title": "CONTINENTAL INSURANCE, FIREMAN'S FUND INSURANCE COMPANY; ST. PAUL INSURANCE COMPANY; ROYAL INSURANCE COMPANY; CENTENNIAL INSURANCE COMPANY; AND AMERICAN HOME INSURANCE COMPANY (PLAINTIFFS), v. PAGE ENGINEERING COMPANY, DOES I-X, INCLUSIVE (DEFENDANTS).",
    "jurisdiction": "Wyoming Supreme Court",
    "date": "1989-12-05T00:00:00.000Z",
    "docket": "No. 87-295.",
    "body": "The essential determination that the court must make in this case is whether tort theories may be invoked by a purchaser of a product in an instance in which the failure of the product causes damage only to the product that failed (economic loss in the parlance of the authorities). An additional issue is raised questioning the propriety of the entry of a summary judgment in favor of the seller when the buyer asserts that a genuine issue of material fact exists concerning the contractual duties owed by the seller to the buyer. The parties also have argued the applicability of the law relating to an insurance company acting as a volunteer in the payment of the claim for insurance proceeds filed by the buyer. The trial court ruled that the complaint of Continental Insurance, Fireman's Fund Insurance Company, St. Paul Insurance Company, Royal Insurance Company, Centennial Insurance Company, and American Home Insurance Company (Appellants collectively referred to as Continental) failed to state a claim in those counts asserting negligence, strict liability, or failure to warn against Page Engineering (Page) because the only damages asserted were the economic loss to Bridger Coal (Bridger), the buyer of the product. With respect to contractual claims that were asserted, the trial court found that the contract was not ambiguous and that Page's duties expired long before any cause of action accrued. In addition, the district court ruled that Continental was a volunteer with respect to its payment of Bridger's insurance claim. We hold that the trial court correctly ruled that Continental's claims of negligence, strict liability, and failure to warn do not state a claim upon which relief can be granted. We are in accord with the district court's ruling that Page had no existing duty under the contract that related to Bridger's loss in this case. Given those determinations, the question of whether Continental acted as a volunteer in paying Bridger's claims for insurance is moot, and we need not address it. We affirm the trial court's entry of summary judgment in favor of Page, recognizing that, in substance, the judgment constituted a dismissal with prejudice of the claims for relief under tort theories and was a true summary judgment with respect to claims based upon breach of an express or implied contract.\n\nThis case arose out of the failure of a reeving block on a very large dragline that Bridger had purchased from Page. A break in the reeving block caused the 100 yard long boom to separate from the rest of the dragline structure and, when it fell, the boom was destroyed. Continental paid Bridger for its damages, which were caused by the collapse of the dragline, and then sought to recover from Page asserting its rights as a subrogee of Bridger.\n\nIn the Appellants' Brief, Continental sets forth five primary issues to be addressed, each of which encompasses several sub-issues and arguments. Those are stated as:\n\n\"A. Whether a district court in treating a Wyoming Rules of Civil Procedure Rule 12(B)(6) motion to dismiss as a summary judgment motion may make factual assumptions as to the type of loss, cause of loss, and insurance coverage for the loss; deny plaintiff the right to conduct further discovery; and then grant summary judgment to defendant on the basis of the assumed type of loss, cause of loss, and insurance coverage?\n\n\"B. Whether a manufacturer who sells heavy machinery in Wyoming and later discovers that one component of said machinery has a correctable unreasonably dangerous defect may escape liability for `negligent failure to warn' under the `economic loss' doctrine when the dangerously defective component fails in a foreseeable manner and destroys a non-defective component of the machinery?\n\n\"C. Whether the `economic loss' limitation on product liability actions should entirely preclude a product liability action which sounds in negligence or strict liability where an unreasonably dangerous defective component of a product fails in a foreseeable manner and destroys a non-defective component?\n\n\"D. Whether the district court may make factual assumptions as to cause of loss and based thereon enter summary judgment that the loss was not covered by insurance and thus that insurers are not entitled to subrogation?\n\n\"E. Whether any continuing obligation should be implied under a contract for sale of heavy machinery where, after the sale, the manufacturer continues to conduct technical, training and assistance visits to the jobsite; and, if there is no such continuing obligation, whether discovery should be allowed to ascertain the obligations and requirements understood by the manufacturer or imposed by industry custom and practice as to the subsequent visits to the jobsite?\"\n\nPage Engineering, in its Brief of Appellee, states the issues presented in this way:\n\n\"I. Whether the trial court properly applied the economic loss doctrine, which is cited with approval by the Wyoming Supreme Court and is the controlling law in a clear majority of jurisdictions, to enter summary judgment for appellee on appellants' tort claims (Counts 1, II, IV-VI) which seek to recover only for loss to the dragline boom?\n\n\"II. Whether any finding of fact was necessary to the district court's award of summary judgment for appellee as a matter of law?\n\n\"III. Whether the courts recognize an exception to the doctrine approved by the United States Supreme Court in the East River decision denying recovery for economic loss (damage to the product itself) when the failure of one component of a product damages another component?\n\n\"IV. Whether the economic loss doctrine bars strict liability claims for damage to the product itself?\n\n\"V. Whether the economic loss doctrine bars claims for negligent failure to warn?\n\n\"VI. Whether the trial court properly awarded summary judgment for appellee on appellants' claim for breach of contract for failure to maintain insurance (Count III), negligent failure to maintain insurance (Count IV) and express indemnity (Count V) where the clear and unambiguous language of the 1974 agreement, the only contract relied on by appellants in the record, provides that appellee's duties to Bridger lapsed under the 1974 agreement eight years before the collapse of the dragline?\n\n\"VII. Whether the trial court properly denied appellants' motion for continuance of discovery where appellants only sought discovery of facts to establish their theory of failure to warn and the trial court had already found this theory legally insufficient?\n\n\"VIII. Whether the trial court properly awarded summary judgment for appellee because appellants were not entitled to subrogation since appellants admitted that the loss to the dragline was due to a latent defect in the dragline and recovery for loss due to a. latent defect was excluded from coverage under appellants' insurance policy.\"\n\nIn 1974, Bridger commenced negotiations with Page to purchase a dragline, to be used in its open pit mining operations in Wyoming, which Page would manufacture. Those negotiations culminated in a Purchase Contract which demonstrates a carefully negotiated and prepared agreement of the parties with respect to the responsibilities of both the buyer and the seller. That Purchase Contract provided for integration with a merger clause, which stated:\n\n\"This Purchase Contract, including these terms and conditions, the specifications attached hereto and any additional terms and conditions incorporated in and attached hereto constitutes the sole and entire agreement between the parties. The Seller's proposal is incorporated in and made a part of this Purchase Contract only to the extent of specifying the nature and description of the Equipment ordered, and then only to the extent that such terms are consistent with the terms of this Purchase Contract. No other items or conditions shall be binding upon Buyer unless accepted by it in writing.\"\n\nIn paragraph ten of the purchase agreement, Page's warranty of the dragline was set forth in this language:\n\n\"Seller warrants that the Equipment and all parts thereof shall be free from defects in design, material, workmanship and title, and shall conform in all respects to the terms of this Purchase Contract, and, if no quality is specified, shall be of the best quality consistent with the nature and type of equipment usual and customary for draglines. If within one (1) year from (a) the date that the equipment is available for commercial operation (capable of stripping overburden) or (b) thirty (30) days after the date the dragline first walks, whichever is earlier, the Equipment, or any part thereof, does not conform to these warranties, and Buyer shall have notified the Seller within a reasonable time after its discovery of such nonconformity, Seller shall thereupon promptly correct such nonconformity at its sole expense. The conditions of any subsequent tests shall be mutually agreed upon and Seller shall be notified of and may be represented at all tests that may be made. In the event that the Equipment or any component parts are replaced pursuant to this warranty, such replacement Equipment and parts shall be warranted and guaranteed as provided herein for a period of one (1) year after such replacement and acceptance thereof by Buyer. The Seller shall not be liable hereunder for any damages as defined and excluded in paragraph 6.0 of this contract [relating to consequential or special damages] nor shall Seller be responsible under any breach of this warranty for any injury to any person proximately resulting from the breach of this warranty. THIS WARRANTY IS THE ONLY WARRANTY MADE AND THERE ARE NO OTHER WARRANTIES OR GUARANTEES, EXPRESSED OR IMPLIED, INCLUDING MERCHANTABILITY OR FITNESS FOR PARTICULAR USE.\"\n\nThe contractual duties which Continental contends were not performed by Page are found in paragraphs eighteen, nineteen, and twenty of the Purchase Contract. According to paragraph eighteen, Page would furnish consultants during the erection, which was defined to terminate when the dragline became operable, and for a period not in excess of sixty days after completion of the erection of the dragline. In paragraph nineteen, Page agreed to \"continuously carry\" insurance on the dragline in the amount of one million dollars \"to protect against and from all loss by reason of injury to persons or damage to property including Seller's own employees and third persons, and property of Buyer and third parties, based upon or arising out of Seller's operations hereunder including the operations of his subcontractors or sub-subcontractors.\" In paragraph twenty, Page agreed that it would indemnify Bridger for any \"damage to or destruction of property\" of Bridger's \"resulting from, arising out of, or in any way connected with Seller's operations hereunder at the job site, excepting only such injury or harm as may be caused solely by the fault or negligence of Buyer, its directors, officers, employees or agents.\"\n\nIn accordance with, and in performance of, the Purchase Contract, Page delivered the dragline to Bridger and placed it in operation by March of 1978. While words may be inadequate to describe this gigantic machine, some idea of its size and function can be gleaned from Page's brief. It is there explained that:\n\n\"* * * The dragline has a boom 100 yards long from which is suspended a bucket capable of holding 50 to 75 cubic yards of material. The bucket scoops up material as it is dragged along the ground. The bucket is then lifted by the boom and the entire dragline, including the housing and boom, then turns so that the contents of the bucket may be dropped into a spoil pile. The dragline then turns back to its original position, the bucket is dropped and dragged again, and the procedure is repeated. The dragline is moved to a new position by `walking' on large legs attached to its sides.\n\n\"The reeving block is a large steel `pulley' through which steel cables pass from a mast to the dragline housing. Other lines run from the mast to the tip of the boom to support the boom. Engines in the housing are used to raise the boom during erection by tightening the lines which pass through the reeving block. After erection of the boom, static lines are attached to the sides of the reeving block to hold the mast and boom in position.\"\n\nThis dragline was used by Bridger in its mining operations, without any apparent complaints, from 1978 until March of 1983. Then Bridger notified Page of several problems that it was experiencing with the machine. One of those complaints related to the reeving block. Bridger had noticed some cracking in that part of the dragline. According to Continental's brief, Bridger had observed the cracking earlier and had welded it. The record supports only a reference in a letter from Page to Bridger referring to a notification by Bridger to Page of cracking in the reeving block in a letter dated March 30, 1983.\n\nBridger requested Page to send personnel to the mine site to inspect the dragline, and Page did that. After completing the inspection, Page sent Bridger a letter which related Page's findings and recommendations. The letter includes advice by Page to Bridger that many of the problems were attributable to improper use and maintenance of the dragline. Specifically with respect to the cracking in the reeving block, Page suggested that those cracks be welded properly. There is no claim by Continental that Page was responsible for accomplishing any of these suggested corrections, and there is no evidence or allegation that Page performed any of the suggested repairs for Bridger.\n\nIn the same month, March of 1983, Page instructed its company engineers to design a reeving block model that would support a greater stress load. Officers of Page stated that this was sheer coincidence because the modifications were requested in response to a purchase order for a dragline that would be required to tolerate greater stress conditions than those of draglines previously manufactured and sold, including the dragline furnished to Bridger. Several structural changes were made in the design of the reeving block that permitted the boom to apply a straight pull on the load. The new design also employed a thicker gauge of steel, providing greater \"impact properties in cold weather.\" Continental, in this action, alleged that the redesign developed not only a more durable reeving block, but a safer one as well, and Continental claims that Bridger should have been told of its availability. It is clear that Page did not advise any of its prior purchasers of the redesign of the reeving block, nor did it recommend to Bridger that it should, or could, replace the reeving block on Bridger's dragline with the redesigned model.\n\nOn February 24, 1986, the reeving block on the Bridger dragline broke at one of the previously welded cracks. Continental alleged that the break in the reeving block caused the boom to. separate from the housing of the dragline resulting in destruction of the boom with damages in excess of $2,500,000. After learning of the collapse of the Bridger dragline, Page notified other purchasers of its draglines that they should inspect their \"super-structure system\" for possible cracking. Several purchasers responded that they had observed cracking in the reeving blocks on their draglines. Page's response to that advice was to recommend to those companies that they replace their reeving blocks with the reeving block model designed in 1983.\n\nAfter the destruction of the boom on its dragline, Bridger filed a claim with Continental for the damages it had suffered. Continental paid Bridger's claim, and it then filed its complaint in the district court seeking to recover from Page for any cause of action that Bridger could have brought against Page on the ground that Continental was subrogated to Bridger's claims. Continental's complaint set forth five claims for recovery that included theories of negligent design of the reeving block, negligent failure to warn Bridger of the redesign of the reeving block, breach of contract for failure to maintain insurance on the dragline, negligent failure to maintain insurance, and express indemnification. Page answered Continental's complaint, and Page and Continental began to pursue discovery.\n\nApproximately one year later, on July 16, 1987, Page filed a Motion to Dismiss and to Stay Proceedings Pending Disposition of This Motion, pursuant to Rule 12(b)(6), W.R.C.P., asserting that (1) an action in tort to recover only economic loss fails to state a cause of action; (2) any contractual duties which Page might have been responsible for under the 1974 contract had ended at least eight years before the collapse of the Bridger dragline; and (3) Continental was a volunteer in making its payment to Bridger, . thereby preventing any claim of Continental to a right of subrogation because the policy which Continental had written for Bridger did not cover the type of damage experienced by the dragline. Continental then filed an Opposition to Defendant's Motion to Dismiss in which it argued that the economic loss doctrine did not apply to a cause of action which alleged a failure to warn or to any cause of action which alleged negligence because the defect in the product created an unreasonably dangerous condition. In addition, continental contended that Page's contractual duties extended beyond the warranty period in the Purchase Contract so that Bridger's claim was covered by the policy or that, in the alternative, Continental had paid Bridger's claim in good faith believing that the claim was covered. Continental therefore asserted that it did have a right of subrogation to any claim Bridger could have brought against Page. Continental also filed a Motion for Leave to File Amended and Supplemental Complaint seeking to amend its complaint by supplementing it to include an additional cause of action for strict products liability.\n\nThe district court then furnished to the parties a decision letter in which the court stated that it intended to treat the Motion to Dismiss filed by Page as a motion for summary judgment and that it would allow Continental two weeks to either approve of or object to the court's proposed action. Continental did not file an objection, but it did file a Motion for Continuance of Discovery in which it was asserted that additional time was necessary to develop its argument that Page should be held strictly liable in tort due to the unreasonably dangerous condition created by the defect in the reeving block. After additional briefing, the trial court entered an order denying Continental's motion. for additional discovery time and its motion to amend the complaint to add an additional claim of strict product liability. The court then entered a Summary Judgment for Page with respect to all pending claims.\n\nInitially, Continental asserts that the district court erred in granting summary judgment because of the existence of genuine issues of material fact relating to the cause of Bridger's damages. Continental quotes language from the decision of the district court that suggests a finding that the damage to the reeving block, which in turn caused the collapse of the boom, was a gradual deterioration caused by a latent defect. It is Continental's contention that such a finding was prejudicial because several courts have distinguished between damages caused by gradual deterioration and those caused by a catastrophic event and also because its insurance policy excluded latent but not patent defects. Continental continues its argument by urging that the error was exacerbated by the district court's denial of its motion to continue discovery to permit it to develop facts showing that the damage of the dragline was not due to gradual deterioration but was, instead, a catastrophic event.\n\nIn a prior case, we reversed the decision of the district court granting a summary judgment prematurely and denying reasonable time for the parties to conduct their desired discovery. Pace v. Hadley, 742 P.2d 1283 (Wyo.1987). It was clear in Pace that the decision of the trial court to convert the defendant's motion to dismiss into a motion for a summary judgment, without giving sufficient notice to the parties and without allowing a reasonable opportunity for discovery, resulted in prejudice to the rights of the parties. We do not retreat from, or diminish, the stance we took in Pace. We continue to recognize the necessity of affording parties adequate time for discovery before a motion for summary judgment may be granted. The difference in this case is that, because of the rule of law followed by the district court, which we espouse, affording an opportunity for additional discovery would be an exercise in futility and would serve only to increase the expense of litigation to the parties.\n\nThe recognized majority rule is that a claim for pure economic loss (the damage is only to the defective product) does not lie on a theory of negligence or strict liability. East River S.S. Corp. v. Transamerica Delaval, Inc., 476 U.S. 858, 106 S.Ct 2295, 90 L.Ed.2d 865 (1986); Aloe Coal Company v. Clark Equipment Company, 816 F.2d 110 (3d Cir.1987), cert. denied 484 U.S. 853, 108 S.Ct 156; 98 L.Ed.2d 111 (1987); Hart Engineering Company v. FMC Corporation, 593 F.Supp. 1471 (D.R.I.1984); Spring Motors Distributors, Inc. v. Ford Motor Company, 98 N.J. 555, 489 A.2d 660 (1985). See also Buckley v. Bell, 703 P,2d 1089 (Wyo.1985) (recognizing the majority rule). This rule is founded on solid policy justifications. The concern of tort law in the area of products liability has focused on the need to protect the purchaser or consumer, who often is not in a position to withstand the financial impact if he, or his property, is damaged by a defective product. The social need to spread the resulting, and often catastrophic, losses across a spectrum of consumers thus increasing the cost of the product is, however, substantially lessened when the injury is only to the product itself. Furthermore, this kind of loss relates essentially to the purchaser's benefit of the bargain which has been made between himself and the seller. The authorities recognize that the law of contracts is far better suited to deal with the dissatisfaction on the part of a purchaser under such circumstances.\n\n\"Contract law, and the law of warranty in particular, is well suited to commercial controversies of the sort involved in this case because the parties may set the terms of their own agreements. The manufacturer can restrict its liability, within limits, by disclaiming warranties or limiting remedies. See U.C.C. §§ 2316, 2-719. In exchange, the purchaser pays less for the product. Since a commercial situation generally does not involve large disparities in bargaining power, cf. Henningsen v. Bloomfield Motors, Inc., 32 N.J. 358, 161 A.2d 69 (1960), we see no reason to intrude into the parties' allocation of the risk.\" East River, 476 U.S. at 873, 106 S.Ct. at 2303.\n\nIn addition, we are in accord with those courts that have concluded it is unwise to intrude, without more justification, into the remedies that legislatures have chosen and which have been provided by the adoption of Article 2 of the Uniform Commercial Code-Sales. Sections 34-21201 through 34-21-299.5, W.S. 1977. See Sacramento Regional Transit District v. Grumman Flxible, 204 Cal.Rptr. 736, 158 Cal.App.3d 289 (Cal.App. 3 Dist., 1984); Clark v. International Harvester Company, 99 Idaho 326, 581 P.2d 784 (1978).\n\nContinental argues vigorously that this court should not espouse the majority rule, but should, instead, adopt the rationale of those courts that permit recovery of economic damages for damage to the product itself when the damage, is caused by a sudden, calamitous event that creates an unreasonably dangerous condition. Those courts which have recognized a distinction between loss caused by gradual deterioration and loss caused by a sudden, catastrophic event producing an unreasonably dangerous condition generally relate the latter situation as being more akin to property than to economic damage. See Pennsylvania Glass Sand Corporation v. Caterpillar Tractor Company, 652 F.2d 1165 (1981); Kodiak Electric Association, Inc. v. Delaval Turbine, Inc., 694 P.2d 150 (Alaska 1984), reh. denied 696 P.2d 665 (1985); Arrow Leasing Corporation v. Cummins Arizona Diesel, Inc., 136 Ariz. 444, 666 P.2d 544 (1983); Roxalana Hills, Ltd. v. Masonite Corp., 627 F.Supp. 1194 (S.D.W.Va.1986), aff'd 813 F.2d 1228 (1987). The Supreme Court of the United States, in a unanimous opinion, found such a distinction not to be persuasive:\n\n\"* * * We realize that the damage may be qualitative, occurring through gradual deterioration or internal breakage. Or it may be calamitous. [Citations]. But either way, since by definition no person or other property is damaged, the resulting loss is purely economic. Even when the harm to the product itself occurs through an abrupt, accident-like event, the resulting loss due to repair costs, decreased value, and lost profits is essentially the failure of the purchaser to recover the benefit of its bargain-traditionally the core concern of contract law. See E. Farnsworth, Contracts Section 12.8, pp. 839-840 (1982).\" East River, 476 U.S. at 870, 106 S.Ct. at 2301.\n\nAfter the Supreme Court articulated its resolution of this issue, the United States Court of Appeals for the Third Circuit reexamined the wisdom of its decision in Pennsylvania, in which that court had held that tort principles could be invoked in an action seeking recovery for damage to the defective equipment when the defect resulted in a hazardous condition and the loss flowing from the defect was caused by an accident that was a sudden and catastrophic event. In that case, the court predicted that the rule ultimately adopted in Pennsylvania would be consistent. In Aloe, however, the court determined that, by applying the concepts of East River, \"a murky trudge through sophisticated nuances gives way an unencumbered flight to basics.\" Aloe, 816 F.2d at 119. The court then held that tort principles could not be invoked if the only damage was harm to the defective product. See also Wisconsin Power Light Company v. Westinghouse Electric Corp., 645 F.Supp. 1129 (W.D.Wis.1986). In his treatise, Professor Keeton also advises against the adoption of a rule that attempts to distinguish \"accidental\" damage to a product from the pure economic loss:\n\n\"Making liability depend upon whether or not the loss results from an `accident' creates a difficult issue and arguably an irrelevant issue with respect to the validity of contract provisions allocating a risk of loss for harm to the defective product itself to the purchaser. Distinguishing `accidental' damage to the product from mere economic loss is difficult in many cases, such as defect in a component of a television set that burns out the tubes, or an electric. connection to the engine of a refrigerator that destroys the engine.\" W. Keeton, Prosser and Keeton on the Law of Torts § 101 at 709 (5th ed. 1984).\n\nFurthermore, drawing a distinction between a sudden, calamitous event and gradual deterioration may simply turn on the arbitrary factor of whether the purchaser noticed the gradual deterioration of a component part that, left unattended, could result in a calamitous occurrence. This difficulty was noted in S.J. Groves \u0026 Sons Company v. Aerospatiale Helicopter Corporation, 374 N.W.2d 431 (Minn.1985).\n\nWe have no quarrel with Continental's contention that there may be no incentive for manufacturers to produce safer products unless they are held liable for those defective products placed in the hands of purchasers and consumers. We are satisfied, as other courts have been, that rules which permit recovery in negligence and strict liability for damage to property other than the product itself or for personal injury adequately serve this social function. See Ogle v. Caterpillar Tractor Company, 716 P.2d 334 (Wyo.1986); O'Donnell v. City of Casper, 696 P.2d 1278 (Wyo.1985); Caterpillar Tractor Co. v. Donahue, 674 P.2d 1276 (Wyo.1983). We are in accord with those courts that have rejected the distinction between circumstances which demonstrate damage to the product itself caused by a calamitous event and the same economic loss due to gradual deterioration.\n\nWe therefore hold that Wyoming does not permit recovery in strict liability or negligence for damage caused to the product itself. The corollary of this rule in context of summary judgment is that, where no cause of action is permitted, there obviously are no material facts. In the context of discovery, if there are no facts which are material, no purpose can be served by further discovery.\n\nIn the alternative, Continental argues that recovery should be permitted when the alleged tort is the failure to warn of a known, or foreseeable, unreasonably dangerous condition. Continental refers us to two cases in which recovery was allowed on the theory of negligent failure to warn when the only damage was to the product itself. Those cases are Miller Industries v. Caterpillar Tractor Company, 733 F.2d 813, 81 A.L.R.Fed. 163 (11th Cir.1984), reh. denied 738 F.2d 451 (1984), and McConnell v. Caterpillar Tractor Company, 646 F.Supp. 1520 (D.N.J.1986). In Miller, Caterpillar manufactured and sold an engine, through one of its dealers, to a company that had contracted to construct a fishing vessel for Miller Industries. After the engine had been sold to Miller Industries, Caterpillar discovered that the model of engine that had been sold contained a defect that could render the engine inoperable. Caterpillar sent warning letters to its dealers advising them of the defect and the procedure for correcting it. No letter was sent to the company that had purchased the engine or to Miller Industries, the purchaser of the vessel in which the engine was installed. What followed was that the engine failed at sea causing a loss of fishing revenue and repair expenses. The court permitted recovery for the economic loss beyond that provided in the warranty invoking the theory of negligent failure to warn. The 11th Circuit Court of Appeals ruled that the general rule, which denies recovery for economic loss beyond that provided for in the warranty, was premised upon a different policy from that invoked when the tort alleged is failure to warn:\n\n\"* * * A duty to warn of a product's defect of which the seller becomes aware goes not to the quality of the product that the buyer expects from the bargain, but to the type of conduct which tort law governs as a matter of social and public policy. See Prosser, Section 92, p. 613; Jig the Third, 519 F.2d at 179, 181 (Gee, J., dissenting). To hold otherwise would impermissibly allow a manufacturer who is aware that it has a defective product on the market to hide behind its warranty while the buyer unknowingly uses it.\" Miller, 733 F.2d at 818.\n\nIn McConnell, 646 F.Supp. 1520, a similar situation was involved. A defective crankshaft was placed in the engine of a fishing vessel while the engine was being repaired. That defect resulted in damage to the engine, towing costs, loss of salaries paid, and loss of revenues paid. The district court, in that instance, adopted the reasoning of Miller and concluded that recovery for the economic loss should be allowed for failure to warn 'of a known defect in a product placed on the market.\n\nThis case is different from those because it involves a single manufacturer that was responsible for a single, integrated product, even though it was made up of several components. Cf. Fordyce Concrete, Inc. v. Mack Trucks, Inc., 535 F.Supp. 118 (D.Kan.1982) (damage to a mixer that was attached to the chassis of a truck was damage to other property). While those cases are factually distinguishable, we rest our rejection of Continental's argument squarely upon the proposition that recovery for pure economic loss should not be permitted when the tort alleged is failure to warn. Recognizing the conclusion to the contrary in Miller, we perceive that both styles of tort concern the conduct of the manufacturer, albeit that conduct may occur at different times in connection with the manufacturer's business. Certainly, it may be argued that the manufacturer who intentionally, or negligently, fails to warn of a known defect in a product that has been placed on the market is more culpable for his actions. The rejection of recovery for pure economic loss under theories of negligence and strict liability, however, has not been because of the absence of culpability, but because of the policy that economic loss is better adjusted by contract rules than by tort principles. What is true with respect to strict liability and negligence, i.e. the risk associated with a product which does not meet the expectations of a buyer is a risk better suited to resolution by agreement between sophisticated bargaining parties rather than shifting the economic burden through tort principles, also is true with respect to the tort of failure to warn. See W. Keeton, Prosser and Keeton on the Law of Torts, § 101 at 709.\n\nRecognition of a cause of action based upon duty to warn, in these circumstances, well could impose a duty on the manufacturer to advise each customer of every change in the design of its product that, in some way, might lengthen the useful life of that product. There does not appear to be any inherent wisdom in imposing such a duty. We also have considered, and rejected, the adoption of any distinction based upon whether the defect could create an unreasonably dangerous condition. Imposing liability for damages caused to the user or consumer or to other property is ample incentive to encourage manufacturers to warn of a dangerous defect of which they are, or should be, aware. To permit recovery in the instance in which the product damages only itself simply because the plaintiff has alleged failure to warn of the defect will only encourage plaintiffs to present \"a products liability argument clothed in 'failure to warn' language,\" if for nothing more than its settlement potential. Zidell, Inc. v. Cargo, Freight and Subfreight of Barge ZPC 404, 661 F.Supp. 960, 964 (W.D.Wash.1987). Stated another way, adoption of the tort theory of failure to warn would simply permit the damage party to reach through a rear door that sanctuary from which he is foreclosed by ; bar on the main entrance.\n\nThis case is a classic example of the proposition that expectancies with respect to the performance of a product should be a matter of contract between the parties If a purchaser desires to extend the warranty period, or obtain some form of insurance as to the reliability or worthiness of the product, that may be done through bargaining for an extended warranty at an increased cost or by payment of premiums for insurance. Bridger decided to obtain insurance from Continental to cover certain defects in the dragline beyond the protection furnished in the warranty provision of its contract with Page. As consideration for that coverage, Continental accepted premium payments in accordance with its insurance policy. That decision to obtain, or provide, additional insurance through contractual arrangements represents the business expectancies of each of the parties with respect to the worthiness of the product. The injection of tort principles into the resolution of that bargain, without any compelling justification for doing so, serves only to obfuscate the decision making process by which sophisticated entities conduct their business. We hold that the district court did not err in dismissing, by the entry of summary judgment, Continental's claims alleging a right to recover economic damages in tort, including the theory of failure to warn.\n\nContinental seeks reversal also upon its right to recover under perceived contractual obligations owed by Page. It contends that there are present in the record genuine issues of material fact which foreclose the entry of summary judgment with respect to contract claims. More specifically, Continental argues that the purchase agreement established a continuing obligation on the part of Page to insure the dragline and to indemnify Bridger against any loss. Alternatively, Continental urges the proposition that, if there was no continuing obligation under the contract, the subsequent actions of Page in inspecting the dragline for defects, at the request of Bridger, created an implied contract between Bridger and Page.\n\nThe rule is clear that the interpretation of an unambiguous contract presents simply a question of law for the court, and disposition of disputes relating to such a contract properly may be accomplished by a summary judgment. See State v. Pennzoil Company, 752 P.2d 975 (Wyo.1988). The existence of an ambiguity in this purchase agreement can be supported only if language is removed from any contextual background. The reading of the agreement that Continental chooses would impose duties on the part of Page to carry insurance and indemnify Bridger for any loss, ad infinitum, despite the express time limitations clearly promulgated in the agreement. The established rule does not support Continental but, instead, requires that the contract be read as a whole. See State v. Moncrief, 720 P.2d 470 (Wyo.1986). Examining this contract as an entity, we are in complete accord with the district court that the language clearly provides that the contractual duties with respect to maintenance of insurance and indemnification of Bridger against any loss terminated at the completion of the period for erection of the dragline or shortly thereafter. We agree with the perceptive observation of the district court that:\n\n\"It is readily apparent from the contract, when it is read as a whole, that Page's `operations' under that contract consisted of erecting the dragline at Bridger, and that once it was erected, Page had no further obligation to maintain insurance for its `operations' under this agreement, as its operations were complete. Also, it was clearly intended by the parties that Bridger would have the benefit of the limited warranty after Page's operations in erecting the dragline under the agreement were completed, and that there would be no further requirement for Page to maintain insurance. Plaintiffs' reading of Paragraph 19 to the effect that Page has to maintain insurance on the dragline `continuously' until the end of the world is a nonsensical reading of that provision which totally ignores the rest of the contract and the context in which it is made.\"\n\nThe assertion of an absurd reading of an unambiguous contract to support a claim does not justify a conclusion of ambiguity in the contract nor require a court to deny summary judgment because a genuine question of material fact exists as to a duty owed under the contract.\n\nInsofar as Continental urges an implied contract between Page and Bridger that extended beyond the period of the express agreement, Continental admits that the terms of such an agreement are unknown to either of the parties. It simply suggests that a jury be allowed to decide what the terms were. It is an axiom of the law of contracts that, in the absence of a meeting of the minds, there is no contract. Thus, in an instance in which the terms of the contract are so uncertain that mutuality of agreement cannot be discerned, the contract is unenforceable because of uncertainty. See Elder v. Jones, 608 P.2d 654 (Wyo.1980); Engle v. First National Bank of Chugwater, 590 P.2d 826 (Wyo.1979). Certainly, parties can create an implied contract by their conduct, but the conduct from which that inference is drawn must be sufficient to support the conclusion that the parties expressed a mutual manifestation of an intent to enter into an agreement. See J. Calamari and J. Perillo, The Law of Contracts § 1-12 at 19-20 (3rd ed. 1987). Although the question of whether particular conduct is sufficient to support a finding that an implied contract exists is generally submitted to a trier of fact, the question may be resolved by summary judgment if reasonable minds could not differ. 1 A. Corbin, Corbin on Contracts, § 18 at 21-22 (1964 \u0026 Supp.1984); cf. Petersen v. Campbell County Memorial Hospital District, 760 P.2d 992 (Wyo.1988).\n\nIn this regard, Continental's reliance is upon Page's response to Bridger's request to investigate certain problems that it was experiencing with the dragline and to offer suggested solutions. This request, and Bridger's response, occurred after the warranty period had expired. We cannot justify a holding that this activity, without more, would serve to extend an express warranty in derogation of the specific terms of a written agreement or result in the creation of a new contract, the terms of which are unknown to either party. Page demonstrated that the only agreement between these parties was that expressed in the written contract, and Continental furnished no evidence which would refute the evidence of Page or, in any way, demonstrate the existence of a genuine issue of material fact in this regard. For this reason, the summary judgment was properly entered on the claims asserted under contract theories.\n\nWhile Continental does present arguments relating to the matter of payment as a volunteer, we see no need to address those contentions. The status of Continental as a volunteer would only serve as a defense to valid claims which might have existed in favor of Bridger assigned by subrogation to Continental. In view of our conclusion that Bridger has no valid claims as a matter of law, Continental's status as a volunteer is not material.\n\nWhile greater precision might have produced an order by the district court granting the motion to dismiss with respect to the tort theories asserted by Continental and then granting summary judgment with respect to contract claims, we have no difficulty in perceiving the premise for the ruling of the district court. Since there are no factual issues which have any materiality, and this case is controlled by principles of law, the denial of further discovery proceedings by the district court was correct. The disposition of the case by the entry of summary judgment in favor of Page is an appropriate resolution. The order granting summary judgment to Page is affirmed.\n\nURBIGKIT, J., filed a dissenting opinion.\n\nURBIGKIT, Justice, dissenting.\n\nDenied completion of discovery and rejected right for leave to amend, appellants lost their product liability damage claims on a granted motion for summary judgment which was never made.\n\nThis appeal should be remanded to permit appellants to amend their complaint and complete their discovery to correct the treatment they received at the hands of the trial court which denied them due process. Procedurally, the trial court improperly treated a motion to dismiss as a motion for summary judgment and then used that summary judgment to foreclose the discovery appellants considered necessary to sustain their claims of contractual right, product strict liability and a post-sale duty to warn.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e What was done procedurally to appellants was not in compliance with procedural rules, accomplished due process or provided justice. Substantively, by incorrect attribution of the existence of a majority rule, this court adopts a minority posture when it holds none of appellants' tort claims as pleaded in this appeal state a claim by an economic loss attribution upon which relief can be granted. Although I believe the majority should not adopt a minority position to exclude product liability, strict liability and negligence to permit damage recovery of over two million dollars sustained by the coal company for which this suit was commenced, that attitude does have some minority support. However, there is essentially no corresponding authority to deny recovery of damages by deprecating the post-sale duty to warn cause of action. From these singular failures in precedent, logic and justice, I strongly dissent.\n\nFirst, I will address the procedural mistreatment inflicted upon the appellants and thereafter substantively address case law and concepts which lead me to reject the majority's holding that appellants' claims of negligence, strict liability, and failure to warn did not state a claim upon which relief could be granted.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nI. PROCEDURAL MISADVENTURES\n\nPage Engineering Company (Page) manufactured and sold a strip mine dragline to Bridger Coal Company (Bridger Coal) for its coal production operation. The two corporations remained in contact during page's periodic inspections of and consultations about the machine's use. During this time, Page came to understand the reeving block equipment was faulty in design and could easily fail, but neglected to warn Bridger Coal. Not surprisingly, the reeving block did fail and brought down the boom.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e This appeal questions who should pay the $2,536,957 following the catastrophic collapse of the boom caused by the failed reeving block.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nSuit was filed June 16, 1986 including allegations of the product liability claims of negligence and defective design, and also failure to warn, failure to maintain insurance, and violation of express warranty. Page answered by general denial and affirmative allegations of failure to state a claim, lack of privity, comparative negligence, assumption of risk and unavoidable accident The lawsuit proceeded normally until July 1, 1987 when the Wyoming attorney for Page suddenly \"took sick\" during a discovery deposition and document production being pursued by Continental Insurance Company (Continental) in Chicago, Illinois. Page brought the depositions to a halt even though the \"ill\" counsel was not lead counsel and then refused Continental the opportunity to copy documents already produced.\n\nBack in Sweetwater County, Wyoming, an ex parte motion was then quickly filed by defendant for a protective order. This motion assured the trial court judge that a motion for Mr. Greenhalgh (Page's Wyoming counsel who became \"ill\" during discovery) to withdraw as counsel would be made as soon as new counsel could be retained. That assurance proved to be false since the \"ill\" Wyoming counsel never withdrew from the case. A restraining order against continued discovery was issued without any apparent opportunity for response or objection by Continental who had been attempting to pursue deposition and documentary examination discovery from Page's personnel and records in Chicago.\n\nWith the ex parte protective order deterring discovery in effect, Page filed its motion to dismiss on July 16, 1987, thirteen months after the commencement of the lawsuit. The brief supporting the motion argued that product liability theories would not support a claim for economic loss. Prominently cited was Buckley v. Bell, 703 P.2d 1089 (Wyo.1985). See McLaughlin v. Michelin Tire Corp., 778 P.2d 59 (Wyo. 1989), Urbigkit, J., dissenting.\n\nThe trial court gave Continental fourteen days to respond to Page's motion to dismiss (less mailing time) and gave Page fifteen days thereafter to reply. Continental responded, including the contention that the motion to dismiss was untimely and Page filed a reply brief on August 21, 1987. Three days later, Continental filed a motion for leave to file an amended and supplemental complaint. Continental also moved to disqualify the previously \"ill\" but never withdrawn local counsel on a conflict basis. The brief supporting this motion stated in part that \"we were given to believe that discovery was aborted at the Page plant in Illinois because [Wyoming counsel] was withdrawing not only not from this case, but from litigation altogether.\" The attached transcript to the brief related what occurred in Chicago on June 30, 1987:\n\n[WYOMING COUNSEL]: I would like to say for the record that I don't feel I can participate in any depositions for health reasons. I have a history of heart problems.\n\n* * * I don't think I can sit through another deposition today.\n\n* * * I am not physically prepared to sit through any more depositions today. * * *\n\nMR. HENSON: Since you spent the weekend on the treadmill at the gym, I don't know that sitting through a deposition would cause any more stress than that.\n\nIf you had told us last Friday that you weren't going to be engaging in depositions here, then we wouldn't have spent the weekend preparing for depositions and spent the weekend here.\n\nMr. Anderson came yesterday at a quarter till 5:00 while we were looking at documents and said that he wanted to get involved in the case and that he was going to have to take some time to become familiar with it and that his client would pay our clients' expenses for having to come back here for these depositions, which were suddenly aborted here at the last minute.\n\nAre you saying that you are withdrawing from the defense of Page Engineering at this point?\n\n[WYOMING COUNSEL]: I intend to notify the insurance company that I am withdrawing for health reasons. (Emphasis added.)\n\nBased on Page's motion to dismiss and faced with a motion for leave to amend, the trial court granted a non-requested summary judgment on September 1, 1987. The sixteen page decision letter concluded:\n\nRule 12(c), W.R.C.P. provides that on a motion for judgment on the pleadings, if matters outside the pleadings are presented, the motion shall be treated as one for summary judgment. I don't think it matters much in this case how it is treated. However, the contract, the insurance policy and the subrogation receipts are all before the Court and have been referred to extensively by all counsel. Inasmuch as the parties have briefed the matter as they have, I am going to answer in kind, and treat the case as though a motion for summary judgment had been filed, pursuant to Rule 56, W.R.C.P., and if anyone chooses to do so, and, as provided by Rule 12(b)(c) \"all parties shall be given reasonable opportunity to present all material made pertinent to such a motion by Rule 56\", assuming there is indeed any more to be said.\n\n[Wyoming counsel] will please prepare an order granting a motion for summary judgment and a summary judgment, submit it to opposing counsel for approval as to form and to me for signature. Opposing counsel have to and including September 15, 1987 to give such approval, or objections thereto, failing in which it will be deemed they have approved\n\nOne last observation. I own a 1978 Oldsmobile on [which] the warranty expired years ago, and I have it insured. Suppose a wheel breaks causing an accident and extensive damage to the car and my insurance company pays me. Is it then \"subrogated\" to my claim against General Motors for negligent design? It appears here that plaintiffs don't seem to understand that machines wear out eventually, somewhat like the \"one hoss shay.\"\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e (Emphasis added.)\n\nProcedurally, Continental was denied the opportunity to object when the trial court converted Page's motion to dismiss into a summary judgment which should have been foreclosed not only by Pace v. Hadley, 742 P.2d 1283, 1286 (Wyo.1987) (completion of discovery), but also the summary judgment notice of conversion case of Torrey v. Twiford, 713 P.2d 1160 (Wyo.1986).\n\nThe trial judge had decided the case and nothing thereafter would change his decision. In his further decision letter of October 21, 1987, the trial judge explained:\n\nI do not believe the decision in Pace v. Hadley (9/22/87) appropriate here. As a matter of fact 1 do not even agree with Pace, supra. In that case the Supreme Court had no difficulty at all in finding what the facts were, (3rd paragraph, page 1 of slip opinion) but also held that the \"plaintiffs were not allowed a reasonable time for discovery.\" If the Court could discern the facts so readily, so could the plaintiffs. In my experience as a lawyer, I never filed a lawsuit until I knew what the facts were as I wanted to be sure I had a cause of action. Today, apparently, the theory is shoot first and ask questions later. The additional discovery requested by plaintiffs is unnecessary and unwarranted. (Emphasis added.)\n\nAfter railing for two full pages against discovery, the trial judge concluded:\n\nPlaintiffs' Motion For Continuance of Discovery is denied. [Wyoming counsel] will please prepare an order denying the motion, an order granting Page's motion for summary judgment and a summary judgment, submit it to opposing counsel for approval as to form, and to me for signature. Opposing counsel have to and including November 2, 1987, within which to give such approval, failing in which it will be deemed they have approved.\n\nResponding to such an untimely and unjustified decision by the trial court to convert a motion to dismiss into summary judgment without notice, Continental filed a declaration of its counsel in support of the motion to reconsider and the motion to allow the continuance of discovery, a motion for continuance of discovery on September 15, 1987, and a memorandum in support of the motion for continuance of discovery with comprehensive attachments.\n\nThe trial court entered an order on September 22, 1987 giving Page until October 5, 1987 to file its brief in answer to the motions for continuance and giving Continental until October 12, 1987 to reply. Resolution, of course, was the second decision letter of October 21, 1987 which denied the motion for leave to amend and the motion for a complete discovery and restated a decision which granted a motion for summary judgment which had never been made.\n\nWe are presented with a very troubling record where a litigant was clearly denied due process and somehow out of that morass, this court is able to perceive that a contractual issue was not created as a matter of partially completed discovery with a motion to file an amended complaint never considered. In view of the obvious resolution by the majority which is, in essence, that due process does not matter, if a substantive right might not exist, I will not pursue the subject of the contractual issues of litigation. It should, however, be noted the Wyoming counsel who \"became ill\" in Chicago never withdrew and, in fact, did appear for oral argument before this tribunal. It must also be recognized that summary judgment disposition of contractual claims has occurred without completion of discovery in contravention of this court's empirical direction to the same trial judge in the earlier case of Pace, 742 P.2d at 1288.\n\nII. SUBSTANTIVE ERROR-DENIAL OF CONSIDERATION OF CLAIM FOR VIOLATION OF DUTY TO WARN POST-SALE (UNWARNED DANGERS KNOW NO MASTER)\n\nAlthough not always a legal duty, the duty to warn can arise from obligations of people on the street to not stand mute while a young woman is brutally killed or the traveler who ignores the missing bridge in an unwillingness to warn anyone who might follow. Here, in an area of responsibility within product liability cases, we encounter manufacturers or vendors who know their products may cause damage or injury but remain stonefaced and silent. These products can range from the exploding lighter to a motor vehicle which tends to roll over easily. Schwartz, The Post-Sale Duty to Warn: Two Unfortunate Forks in the Road to a Reasonable Doctrine, 58 N.Y.U.L.Rev. 892 (1983); Annotation, Failure to Warn as Basis of Liability Under Doctrine of Strict Liability in Tort, 53 A.L.R.3d 239 (1973).\n\nMore egregious is this majority's misappreciation of the problem presented in what it does to disregard or destroy the parallel tort of failure to warn. The doctrine of economic loss has no application or validity to the tort of failure to warn and neither litigant nor this court provide precedent to the contrary.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The tort of failure to warn is parallel to but not intrinsically within product liability case law. Failure to warn liability can arise and frequently does outside of the law in merchant and commercial transaction contract issues. Conversely, failure to warn frequently may not be an issue in product defect strict liability cases. See McLaughlin, 778 P.2d 59, Urbigkit, J., dissenting.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nIn product defect strict liability cases, the failure to warn tort remedy exists in states that have never adopted the Restatement (Second) of Torts § 402A (1965) remedies of strict liability. When the manufacturer knows harm is possible, notice for an opportunity to replace is required. Two examples will serve to illustrate. A broad recall campaign has recently been pursued involving a brand name propane gas control unit for residential furnaces. After a passage of time, perhaps a long time, certain units tend to fail and create an extreme danger of explosion and fire. The manufacturer has made a total effort at identification and recall. See, for example, Young v. Robertshaw Controls Co., 104 A.D.2d 84, 481 N.Y.S.2d 891 (1984). That control unit is a separate part from the house and even from the furnace itself with a separate identifiable manufacturer. Consider then the hypothetical but comparable example of a car fuel pump which may fail in loss of confinement of gasoline and consequently sprays gasoline on the motor of the vehicle. See Capitol Fuels, Inc. v. Clark Equipment Co., 382 S.E.2d 311 (W.Va.1989). Three dangers exist. The fuel pump might cause the vehicle to burn up, it might cause the vehicle to burn up with the garage and house and it might burn up the occupants if the car explodes. Cases in application of the tort of failure to warn present no difference whether the damage resulting from the integrated part destroys the car, the house or a life. Economic loss, consequently, has no significance. Tested by tort is duty from knowledge of danger, failure to warn, and resulting damage and loss.\n\nExisting separately from the faulty manufactured or faulty designed merchandise disputes, the duty to warn has two separately identified applications. The first, which is not presented here, is the vendor/manufacturer responsibility upon initial sale if the product or its intended use is intrinsically dangerous and that danger may not be equally known to the user. This sale date duty to warn tort responsibility has an extensive and long-standing history.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Conversely, as presented here, the post-sale duty to warn cause of action as a more recently developing theory of liability now has a significant litigation impact. However, until East River S.S. Corp. v. TransAmerica Delaval, Inc., 476 U.S. 858, 106 S.Ct. 2295, 90 L.Ed.2d 865 (1986) and its protegee, the differentiation of elements of damage between the sale time duty and the post-sale acquired knowledge duty had not occasioned particularized discussion. \"The duty to warn is an independent duty not determined by the contractual agreement between the predecessor-seller and successor-buyer corporations. L.R. Fumes, M.I. Friedman, Products Liability, § 2.06[5] (1988). The duty may arise despite `the nature of the transfer.' Id.\" Florom v. Elliott Mfg., 879 F.2d 801, 802 (10th Cir.1989). The character of the post-sale duty to warn is illuminated in that case where the tort is asserted against a business successor to the vendor.\n\nWhere such a duty arises, it stems from the existence of the relationship between the successor and the customers of the predecessor. Polius v. Clark Equipment Co., 802 F.2d 75, 84 (3rd Cir.1986); accord Mozingo v. Correct Manufacturing Corp., 752 F.2d 168, 177 and n. .12 (5th Cir.1985) (duty arises from continuation of relationship between successor and predecessor's customers); Travis v. Harris Corp., 565 F.2d 443, 448-49 (7th Cir.1977). \"The successor corporation's liability stems not from its status as a successor, but from its establishment of a relationship with the customer that imposes certain duties and responsibilities.\" Polius, 802 F.2d at 84; Mozingo, 752 F.2d at 177; Travis, 565 F.2d at 449.\n\nThe court must look at factors such as the succession to service contracts, coverage of the particular machine by a contract, service of that machine by the successor, and the successor's knowledge of the defect and of the machine owner's location. Polius, 802 F.2d at 84; Mozingo, 752 F.2d at 177; Travis, 565 F.2d at 449; see also Downing v. Overhead Door Corp., 707 P.2d 1027, 1033 (Colo. App.1985) (duty to warn exists where a danger concerning the product becomes known to the manufacturer subsequent to the sale and delivery of the product, even though it was not known at the time of the sale). Florom v. Elliott Mfg., 867 F.2d 570, 577, reh'g denied 879 F.2d 801 (10th Cir.1989).\n\nIn Florom, which involved a \"cherry picker\" as equipment not totally dissimilar from the crane involved here, the Tenth Circuit Court of Appeals further recognized:\n\nThe claim of breach of the duty to warn was not proper for disposition by summary judgment. Leannais [v. Cincinnati, Inc.], 565 F.2d [437] at 442 [ (7th Cir. 1977) ]. While our conclusion is based on the federal rules of procedure, we note that Colorado's procedural and substantive law mandates the same result. E.g., Union Supply v. Pust, 196 Colo. 162, 583 P.2d 276, 279, 283 (1978) (failure to warn is jury question and \"trial judge should only invade the fact-finding function of the jury in the clearest cases when the facts are not in dispute.\"). Thus the summary judgment on this claim must be reversed. Florom, 867 F.2d at 577.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nThe principal case considered as precedent on the function and criteria of the post-sale duty to warn is Cover v. Cohen, 61 N.Y.2d 261, 473 N.Y.S.2d 378, 461 N.E.2d 864 (1984), where an accelerator problem on a Chevrolet caused bystander injury. That case addressed admissibility of post-sale technical service bulletins issued by the manufacturer in conjunction with consideration of the cause of action of negligent failure to warn, including inadmissibility of evidence of any \"failure to warn cause of action insofar as it turned on the design and risk status of the vehicle at the time of delivery.\" Id. 461 N.E.2d at 871 (emphasis added).\n\nThe court went on to discuss:\n\nA manufacturer or retailer may, however, incur liability for failing to warn concerning dangers in the use of a product which come to his attention after manufacture or sale, through advancements in the state of the art, with which he is expected to stay abreast, or through being made aware of later accidents involving dangers in the product of which warning should be given to users * * *.\n\nAlthough a product be reasonably safe when manufactured and sold and involves no then known risks of which warning need be given, risks thereafter revealed by user operation and brought to the attention of the manufacturer or vendor may impose upon one or both a duty to warn * * *.\n\nWhat notice to a manufacturer or vendor of problems revealed by use of the product will trigger his post-delivery duty to warn appears to be a function of the degree of danger which the problem involves and the number of instances reported * * *.\n\nThe nature of the warning to be given and to whom it should be given likewise turn upon a number of factors, including the harm that may result from use of the product without notice, the reliability and any possible adverse interest of the person, if other than the user, to whom notice is given, the burden on the manufacturer or vendor involved in locating the persons to whom notice is required to be given, the attention which it can be expected a notice in the form given will receive from the recipient, the kind of product involved and the number manufactured or sold, and the steps taken, other than the giving of notice, to correct the problem * * *. Id. 461 N.E.2d at 871-72.\n\nAmong other cases cited by the New York court involving the post-sale failure to warn cause of action include Comstock v. General Motors Corp., 358 Mich. 163, 99 N.W.2d 627 (1959), which involved an automobile brake failure and quoted the seminal case of MacPherson v. Buick Motor Co., 217 N.Y. 382, 111 N.E. 1050 (1916). In Comstock, Buick Motors had ample warning of a serious brake problem. The duty to provide a post-sale warning was derived from the earlier Michigan case of Gerkin v. Brown \u0026 Sehler Co., 177 Mich. 45, 143 N.W. 48 (1913):\n\n\"When the fact is once established and demonstrated by experience that a certain commodity apparently harmless contains concealed dangers, and when distributed to the public through the channels of trade and used for the purposes for which it was made and sold is sure to cause suffering to, and injure the health of, some innocent purchaser, even though the percentage of those injured be not large, a duty arises to and a responsibility rests upon the manufacturer and dealer with knowledge to the extent, at least, of warning the ignorant consumer or user of the existence of the hidden danger. Failing to do so, the dealer, as well as the manufacturer, who has the knowledge and does not impart it, is liable to a subsequent, ignorant purchaser, reasonably within contemplation of the parties to the original sale, for injuries sustained through such hidden dangers. This is by reason of the duty the dealer owes to the public generally, which includes all whom it may concern, to give notice of any concealed dangers in the commodity in which he traffics, and to exercise a reasonable precaution for the protection of others commensurate with the peril involved. We think this principle applicable to the case at bar and fairly deducible from the many authorities touching manufacture and sale of dangerous commodities.\" Comstock, 99 N.W.2d at 634 (quoting Gerkin, 143 N.W. at 53). See likewise Bottazzi v. Petroleum Helicopters, Inc., 664 F.2d 49 (5th Cir.1981) and Braniff Airways, Inc. v. Curtiss-Wright Corp., 411 F.2d 451 (2nd Cir.), cert. denied 396 U.S. 959, 90 S.Ct. 431, 24 L.Ed.2d 423 (1969), reh'g 424 F.2d 427 (2nd Cir.), cert. denied, 400 U.S. 829, 91 S.Ct. 59, 27 L.Ed.2d 59 (1970).\n\nIn Braniff Airways, Inc., 411 F.2d at 453, the court first adduced that claims based on warranty were barred by the appropriate contract action statute of limitations and then said, in regard to the airplane:\n\nIt is clear that after such a product has been sold and dangerous defects in design have come to the manufacturer's attention, the manufacturer has a duty either to remedy these or, if complete remedy is not feasible, at least to give users adequate warnings and instructions concerning methods .for minimizing the danger. See John Deere Co. v. May, 773 S.W.2d 369, 378 (Tex.App.1989) and Bell Helicopter Co. v. Bradshaw, 594 S.W.2d 519 (Tex. Civ.App.1979).\n\nIn John Deere Co., 773 S.W.2d at 378, a $2,652,000 judgment was awarded as the price for \"the tragic result of its failure to act [warn].\"\n\nA fishing vessel engine damage resulted from failure of an unsupported oil line in Jones v. Bender Welding \u0026 Mach. Works, Inc., 581 F.2d 1331 (9th Cir.1978). Liability was justified by a finding of negligent notification where the problem had been bulletined to dealers but not to boat owners:\n\nNor can Caterpillar avoid liability by contending that it had no duty to inform its dealers of the bracket. While it is arguably true as Caterpillar contends that the lack of a bracket did not cause a safety hazard to the ship's passengers, the danger posed to the engine and the ship itself, if not the shipper's lost profits, is sufficient to create a duty to act in a reasonable fashion. ' * ' In light of the comparable development at common law of the duty to inform as reasonable conduct by a manufacturer and the clear implication of our recent opinion in Pan Alaska Fisheries, Inc. v. Marine Construction \u0026 Design Co., supra [565 F.2d 1129 (9th Cir.1977) ], we also reject Caterpillar's argument that the duty to inform dealers is not enforceable by the ultimate consumer. Id. at 1335.\n\nA product similar in commercial scope of limited unit production as canning or packaging equipment produced the litigation in Kozlowski v. John E. Smith's Sons Co., 87 Wis.2d 882, 275 N.W.2d 915 (1979) where, while in operation and under maximum pressure, a piston in the machine jetted beyond the safety line of the machine, fractured safety rings and killed the operator. The appellant contended the machine was defective by design when permitting the existence of an unreasonably dangerous condition. It was argued there was a substantial risk the safety ring (as it did) would fracture when continually struck by the piston while in operation. At issue was the non-installation of a post-sale safety device raising the duty of warning by the manufacturer of an allegedly defective condition in light of the improvement which would have avoided occurrence of the accident. In analysis, that court found:\n\n[A] jury could find it persuasive that prior to the accident, a Smith's sales representative made only two visits to the Cudahy plant. On each occasion he failed for one reason or another to inform Cudahy of the safety by-pass valve and the hazard it was designed to prevent. The representative's own testimony is that these sales calls were made after 1971 when the safety by-pass valve had become standard equipment on all new machines. Id. 275 N.W.2d at 923.\n\nThe differentiation between incidents of initial sale and subsequent post-sale duty to warn were related in Miller Industries v. Caterpillar Tractor Co., 733 F. 2d 813, 818, reh'g denied 738 F.2d 451 (11th Cir.1984):\n\n[T]he argument for finding that a warranty was not intended to preclude a negligence action is even more compelling here than in Jig the Third In Jig the Third [Jig the Third Company v. Puritan Marine Insurance Underwriters Corporation, 519 F.2d 171 (5th Cir. 1975) ], the plaintiff's claim was premised on the negligent design and manufacturing of the product and thus was closely related to the quality of the product and the plaintiff's expectations of how the product would perform. Here, however, the gravamen of the plaintiffs' complaint is that the defendant failed to properly warn of defects that it discovered after the engine was already on the market. Whatever the merits of adopting a rule that views defects in a product as part of the parties' bargain and thus within the law of sales, it is much less tenable to presume that the buyer has bargained away the manufacturer's obligation to warn of defects that later come to the manufacturer's attention. A duty warn of a product's defects of which the seller becomes aware goes not to the quality of the product that the buyer expects from the bargain, but to the type of conduct which tort law governs as a matter of social and public policy. * * * To hold otherwise would impermissibly allow a manufacturer who is aware that it has a defective product on the market to hide behind its warranty while the buyer unknowingly uses it.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nOverspeed of an airplane propeller occasioned consideration of the failure to warn liability in Noel v. United Aircraft Corp., 342 F.2d 232 (3d Cir.1964), where the court found the danger of the occurrence and its effects not hypothetical but a generally recognized danger. Evidence of post-sale safety improvements was admissible to establish the manufacturer's duty, if any, to warn the purchaser of commercial iron of any deficiency in the ironer's safety features in doCanto v. Ametek, Inc., 367 Mass. 776, 328 N.E.2d 873, 878 (1975):\n\nThere was evidence from which the jury could have found that the machine was negligently designed and its braking capacity misrepresented. When the manufacturer of such a machine learns or should have learned of the risk created by its fault, it has a duty to take reasonable steps to warn at least the purchaser of the risk. * * * One such reasonable step may be to warn at least the purchaser of changes which eliminate or tend to eliminate the risk created by the manufacturer's initial fault.\n\nIn Labelle v. McCauley Indus. Corp., 649 F.2d 46, 49 (1st Cir.1981), the court stated:\n\nThe manufacturer's duty to warn of a defect or dangerous condition extends, however, to the purchaser of its product, * * *, even if defects are discovered after the initial sale. * * *\n\nTo be adequate, a warning must reasonably apprise the purchaser of the danger by direct notice or by an indirect notice which gives warning or eliminates the danger. That an indirect warning fails to reach a particular purchaser does not alone render the manufacturer negligent if the method of warning be adequate. Restatement (Second) of Torts, § 388 Comment c (1965).\n\nA question of fact was created by issuance of a revision to the service manual. The airplane was damaged when the propeller blade sheared and created the inquiry of a duty to warn post-sale cause of action for which plaintiff's favorable jury verdict had been initially entered. That verdict for the damage to the airplane resulting from the propeller blade provided sufficient evidence to support a finding of negligent failure to warn about a defective condition in the product. Bottazzi, 664 F.2d 49 likewise raised the duty to warn as a post-sale failure which similarly justified recovery from an accident caused by a power shaft failure on the helicopter. The manufacturer knew of the potential problem and failed to warn customers of the potential danger and to specify corrective action in its overhaul manual.\n\nThe analysis that a breach in the duty to warn is different from the duty breached by manufacturing a defective product and is also different from a breach in a post-sale duty to warn of a known danger, is well-stated in Nicor Supply Ships Associates v. General Motors Corp., 876 F.2d 501, 504 (5th Cir.1989) (footnotes omitted):\n\nTwo courts, the Eleventh Circuit in Miller Industries v. Caterpillar Tractor Co., [733 F.2d 813 (11th Cir.1984) ] acting before East River, and a New Jersey District Court in McConnell v. Caterpillar Tractor Co., [646 F.Supp. 1520, 1526 (D.N.J.1986) ] acting after East River, have distinguished between a manufacturer's negligence occurring \"as part of the manufacturing process\" and a manufacturer's negligent failure to warn of a known defect. * * * Both courts reasoned that a manufacturer's negligence after manufacture has been completed \"goes not to the quality of the product that the buyer expects from the bargain, but to the type of conduct which tort law governs as a matter of social and public policy.\"\n\nIn both Miller Industries and McConnell, the failure-to-warn claim was predicated on knowledge gained by the manufacturer after the product had been delivered. * * *\n\nWhile failing to warn a purchaser of a defect in a product known at the time of manufacture is, of course, different from manufacturing a defective product, both negligent acts occur during the manufacturing process and before delivery of the product to the buyer. We are unable to assign to either act a relatively higher level of consciousness of wrongdoing, and thus do not discern a meaningful legal difference between them.\n\nExamination of the cited cases supports the thesis presented. In McConnell v. Caterpillar Tractor Co., 646 F.Supp. 1520, 1526 (D.N.J.1986), the court said:\n\nPlaintiffs allege that both Caterpillar and Giles \u0026 Ransome were negligent in failing to notify them of the defect in the crankshaft. We first note that the East River decision, as we read it, does not bar plaintiffs' negligence claim. It is true that in East River, plaintiff-charterers, in the fifth count of their complaint, alleged that the defendant negligently supervised the installation of a valve, and that the Supreme Court disallowed recovery on this count as well as on the strict products-liability counts because the losses sustained were purely economic. However, in East River, plaintiffs alleged that the negligence occurred \"as part of the manufacturing process.\" 106 S.Ct. at 2297. The alleged negligence in the instant case is distinguishable; plaintiffs here assert, not that defendants negligently manufactured the crankshaft, but that they negligently failed to warn plaintiffs of a known defect in the crankshaft.\n\nIn Strauch v. Gates Rubber Co., 879 F.2d 1282 (5th Cir.1989), hose was purchased from Gates Rubber Co. for ammonia transfer purposes. The manufacturer failed to warn its customer the product had an average service life of thirty months. When use continued by the customer beyond the non-communicated service life, the hose burst and injury and damage resulted. Absent communication of the useful life limitation, liability could result from product failure.\n\nIt was reasonable for the jury to conclude from this evidence that the hose failed on June 28, 1985 because it had been in service longer than its useful life and that defendant's failure to warn of its product's truncated serviceable life was a proximate cause of its failure. Id. at 1286.\n\nThe post-sale duty to warn negligence tort is the result of a circumstance but not a function of the sales transaction. 1A L. Frumer \u0026 M. Friedman, Products Liability § 2.22 (1987). The initiating factors arise when first the manufacturer or supplier comes to recognize that a previously sold product produces an unreasonable risk of injury or damage to the user or bystander. Secondly, the possessor of the information makes no reasonable effort to meet its duty of due care to provide the information to the possessor of the product so that potential damage can be avoided by disuse or correction. Finally, the user, unaware of the danger, continues use of the faulty product and, within the reasonably expected circumstances, an event of loss occurs from which damage and injury result.\n\nIt is first apparent the duty is to communicate the warning. This provides the user opportunity to avoid the harm. Consequently, the duty itself has nothing to do with statutes of limitation triggered by negligence or warranty from the initial sales transaction. Contractual terms of implied warranty, express warranty and waiver of warranty are likewise not functional factors in the existence of the tort or related to a remedy from a failure to warn. Additionally, with one differentiated case, Bell Helicopter Co., 594 S.W.2d 519, avoidance of the commission of the tort is accomplished by reasonable efforts to communicate under the circumstances and what, if anything, the user does thereafter to take heed remains no responsibility for the manufacturer or supplier. In Rekab, Inc. v. Frank Hrubetz \u0026 Co., 261 Md. 141, 274 A.2d 107, 111 (1971), the court found the replacement of the ferris wheel shaft with agreement to install at the convenience of the operator constituted a \"tintinabular message\" sufficient to avoid post-sale failure to warn tort liability. For this cause of action derived from product liability cases, the existence of the sale of the tangible object subjects the parties to duties that are independent of the sales transaction in its initially executed terms. It is a positive duty independent of the contract although arising out of a state of facts created by the contract. The court in Tomlinson v. Armour \u0026 Co., 75 N.J.L. 748, 70 A. 314, 317 (1908) related:\n\n[T]he existence of the contract creates a situation that subjects the parties to duties that are independent of the obligation to perform the contract * * *.\n\nAmong the most fundamental of personal rights, without which man could not live in a state of society, is the right of personal security, including the \"preservation of a man's health from such practices as may prejudice or annoy it\" (1 Black.Com. 129, 134)-a right recognized, needless to say, in almost the first words of our written Constitution (Const. art. 1 par. 1). To assert, therefore, that one living in a state of society, organized, as ours is, according to the principles of the common law, need not be careful that his acts do not endanger the life or impair the health of his neighbor seems to offend against the fundamentals.\n\nIn the earlier case of Tomlinson, diseased and unfit food was sold. A more current example of the ignored duty to warn is found in Young, 481 N.Y.S.2d 891. Robertshaw Controls Company is a nationally established vendor of control units for propane furnace and water heaters. The court, in Young, 481 N.Y.S.2d at 893-94, described that:\n\n[E]vidence tendered by the plaintiff indicates, that for a number of years prior to decedent's death defendant was aware its control valve was defective and represented a real danger to the public (there had apparently been more than 100 accidents resulting in 32 deaths and 77 injuries), yet it did not recall the controls nor attempt to alert the public to the risk, but embarked instead upon an affirmative course of conduct designed and calculated to conceal the problems with the control. Allegedly this concealment, which continued for several years after decedent's death, was undertaken with the intention of deceiving the public at large as to the continued fitness for use of this control valve which defendant had placed in commerce and minimizing recoveries in lawsuits generated by the faulty control. Although generally nondisclosure or concealment alone does not equate to actionable fraud * * *, it is a principle of long standing that \"one who sells an article knowing it to be dangerous by reason of concealed defects is guilty of a wrong, without regard to the guilty contract, and is liable in damages to any person, including one not in privity of contract with him, who suffers an injury by reason of his willful and fraudulent deceit and concealment\" (Knelling v. Lean Mfg. Co., supra, 183 N.Y. p. 89, 75 N.E. 1098).\n\nOf similar intelligence is a case which is the factual converse of Buckley, 703 P.2d 1089. In American Oil Co. and Capitol Oil Co. v. Nicholas, 156 Va. 1, 157 S.E. 754 (1931), gasoline was delivered rather than the ordered kerosene. Gasoline was a faultless product, but not when used by the unsuspecting purchaser to start a fire in his coal stove with a result which burned more than desired in the resulting explosion. As a matter of fact, serious injuries resulted. The Virginia court, in finding a duty on the distributor to warn about the improperly delivered fuel quoted an even earlier Virginia case, Standard Oil Co. v. Wakefield's Adm'r, 102 Va. 824, 47 S.E. 830 (1904):\n\n\"It seems to be a well-settled rule of the common law that a person who negligently uses a dangerous instrument or article, or causes or authorizes its use by another in such a manner or under such circumstances that he has reason to know that it is likely to produce injury, is responsible for the natural and probable consequences of his act to any person injured who is not himself at fault.\"\n\nIn the same case Judge Buchanan quotes with approval from Thompson on Negligence, vol. 1, § 821, as follows:\n\n\"The doctrine of these cases, stated in a general way, is that, if a person sells goods, chattels, or machinery which posses some concealed defect, or tendency to do harm, such as will, according to the probabilities of ordinary experience, do harm to innocent persons, he must respond in damages if such harm ensue without the intervention of the negligence or fault of others; and upon principle it would be immaterial whether the knowledge of the concealed vice or defect was withheld from the purchaser through the vendor's unskillfulness, ignorance or fraud.\" American Oil, 157 S.E. at 757-58.\n\nPresented here is a post-sale duty when the manufacturer or vendor comes to know that a danger from continued use may exist to the product as well as other property. A post-sale duty to warn concept is an emerging tort concept founded upon a concept that any choice requires the knowledge to chose and the originator of the product retains a responsibility to furnish that information which permits the user to exercise a choice.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e See differentiation and distinguishment of the post-East River case in Zidell, Inc. v. Cargo, Freight and Subfreight of Barge ZPC 404, 661 F.Supp. 960 (W.D.Wash.1987) and McConnell, 646 F.Supp. 1520. Non-communicated knowledge is the tort foundation. Schwartz, supra, 58 N.Y.U.L.Rev. at 896-97; Annotation, Strict Products Liability: Liability for Failure to Warn as Dependent on Defendant's Knowledge of Danger, 33 A.L.R.4th 368 (1984). See also Annotation, Discovery, In Products Liability Case, of Defendant's Knowledge As To Injury To or Complaints by Others Than Plaintiff, Related to Product, 20 A.L.R.3d 1430 (1968).\n\nThe fallacy in this majority is in collapsing this post-sale duty to inform into concepts of product liability recovery limitation where only economic damage results from usage of a faulty product. A contractual thesis with corollary attributes of statute of limitations or limited time of warranty has nothing to do with the societal danger from a faulty product where the knowledge necessary to protect is encased in the hands of the originator. The authority supporting this misapplication of a differing responsibility to protect society from injury as a product liability concept is a current case from an intermediate appellate court which makes the same mistake repeated by this majority. Utah Intern., Inc. v. Caterpillar Tractor Co., 108 N.M. 539, 775 P.2d 741, cert. denied 108 N.M. 354, 772 P.2d 884 (1989).\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e The New Mexico court opined that the commercial transaction factor was determinative in denial of recovery for economic damage. That court then said \"[w]e specifically do not address the question of whether the same rule should apply to non-commercial consumers who suffer similar injuries.\" Id. 775 P.2d at 744. In regard to the separate claim for negligent failure to warn, that court then said:\n\n[W]e believe that the same policy considerations which apply to defects in manufacturing also apply to failure to warn of defects. Post-East River cases other than McConnell appear to apply broadly the rule prohibiting tort recovery for economic. loss. * * * Thus. we hold that in commercial settings claims for economic loss from a product injuring itself due to negligent failure to warn are also precluded from recovery. Id 775 P.2d at 745.\n\nThis quotation reflects how bad law results from misquotation or improper examination of cases. The federal district judge in Frey Dairy v. A.0. Smith Harvestore Products, Inc., 680 F.Supp. 253 (E.D.Mich. 1988) (also a company that is a frequent visitor to these product liability cases), without discussion or analysis about the duty to warn which was claimed, stated the economic damage rule precluded plaintiff's recovery on all tort remedies by citation of a federal and a Michigan state case. On appeal, the Sixth Circuit Court of Appeals took a completely novel approach in affirming the bad decision of the trial court, neither of which fit Michigan case law by discerning that tort remedies were waived by contractual exclusion. Frey Dairy v. A.0. Smith Harvestore Products, Inc., 886 F.2d 128 (6th Cir.1989). The Michigan case, McGhee v. GMC Truck \u0026 Coach Division, 98 Mich.App. 495, 296 N.W.2d 286 (1980), did not involve or raise any issue of a duty to warn as a recovery claim. See, moreover, Mulholland v. DEC Intern. Corp., 432 Mich. 395, 443 N.W.2d 340 (1989). Likewise, S.M. Wilson \u0026 Co. v. Smith Intern. Inc., 587 F.2d 1363 (9th Cir. 1978) did not present a duty to warn claim either. Florida Power \u0026 Light Co. v. Westinghouse Elec. Corp., 510 So.2d 899 (Fla.1987) involved nuclear steam supply systems and provided no issue or discussion of a post sale unmet duty to warn.\n\nThe Tenth Circuit Court of Appeals in Smith v. FMC Corp., 754 F.2d 873 (10th Cir.1985) considered a safety device to protect a crane from \"two-blocking.\" Reversal of a defendant's verdict came by decision of the appellate court on the improper inclusion of an assumption of risk instruction and in regard to a contested instruction on defective product liability where the appellate court directed that \"the district court may wish to review this instruction upon remand, inasmuch as a manufacturer has a responsibility to warn of a defective product at any time after it is manufactured and sold if the manufacturer becomes aware of the defect.\" Id. at 877.\n\nThe FMC Corporation crane accident illustrates the theoretical invalidity of this court's economic damage adaptation when applied to a post-sale duty to warn cause of action claim. In that case, the faulty device on the crane boom caused the death of two innocent bystanders. In this case, it was only by blind luck that no one was killed when the reeving block failed, destroying the boom and the dirt bucket. The differentiation in thesis that no viable claim of negligent violation of the duty to warn after sale can be stated here and one could be stated in FMC Corporation is simply absurd. Sales contract conditions and warranties have absolutely nothing logically to do with the existence of the same tort in both cases. One only needs to recognize the absolute axiom of accidents that if a gamble is made from which damage and loss result to the product itself, sooner or later, if not most of the time, someone will be injured or killed or, at least, other property damaged. The comparison of happenstance is illustrated in Suich v. H \u0026 B Printing Machinery, Inc., 185 Ill.App.3d 863, 133 Ill.Dec. 768, 541 N.E.2d 1206 (1989), where lacking appropriate warning, the gantry crane collapsed resulting in damage award to the injured worker of $2,800,707. The only difference is that here, no one was in the way when the machine collapsed. Again, in H \u0026 B Printing Machinery, Inc., the injured worker was in the wrong place at the wrong time.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nThe text authorities recognize a duty to warn even if the damages are what has been referred to generally as economic damage. The premises for recognizing this tort are spelled out in 1 M. Madden, Products Liability § 10.13 at 453-55 (2d ed. 1988) (footnotes omitted):\n\nA post-sale duty to warn may attach even if the product was, at the time of manufacture and sale, reasonably safe for use (or arguably so), but through use or operation, has betrayed hazards not earlier known to the seller, or to other sellers of like products.\n\nAs is equally true of the duty to warn at the point of sale, the doctrinal underpinning of the manufacturer's post-sale informational obligation is the commitment to remedying the asymmetry of information held by the seller, on the one hand, and by the consumer on the other. The object, in general terms, is to encourage manufacturers to impart to consumers that information the manufacturers receive in the ordinary course of their business, germane to product safety and technological advances and to the performance and accident histories of those products sold and in use. See likewise, 1A L. Frumer \u0026 M. Friedman, supra, at 2-1071.\n\n\"Even if there is no duty to warn at the time of the sale, facts may thereafter come to the attention of the manufacturer which make it imperative that a warning then be given.\" Id. at 21071. See also 1 American Law of Products Liability 3d, § 1:67 at 71 (1987) and 3 American Law of Products Liability 3d, § 32:6 at 20 (1987). \"Thus, a manufacturer must warn of dangers inherent in its product that it knew or should have known about during the time the plaintiff used the product.\" Id. at 21.\n\nThe majority offers no real authority to deny recovery for a breach of post-sale duty to warn. As the authorities reflect, the issue is a responsibility to share information in order to afford the purchaser an opportunity to avoid damage and loss. Page could easily have warned Bridger Coal the reeving block was defective. Bridger Coal could have replaced the defective reeving block for $80,000-$150,000 or continued using the old reeving block and risked the catastrophic loss that followed. The point is they would have been allowed to make an informed decision and determined whether to buy safety with a replacement product.\n\nThe majority is wrong in precedent, wrong in theory, and wrong in rejection of its obligation to contribute to the effectiveness and efficiency of the nation's economic institutions.\n\nIII. PRODUCT LIABILITY-PROPERTY DAMAGE\n\n(WHAT IS ECONOMIC DAMAGE?)\n\nThis court is presented with a clearly defined substantive appeal determination whether the economic loss doctrine bars recovery where the reeving block failed and caused damage to the boom and shovel of the drag line equipment. Disregarding all contractual issues by-passed by denied discovery and the substantively significant concerns of implied warranties of merchantability and fitness for the purpose intended, we are presented under economic loss doctrine topics of (a) what is economic damage; (b) proper viability of the economic loss doctrine for application under these circumstances as it should properly be confined and defined within current literature when the occurrence is catastrophic and life threatening; and (c) constituent damage to other parts of the equipment.\n\nBefore distilling the three substantive mistakes in analysis and precedent made by this court, it helps to set out what is meant by the terms used by courts.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Claims for a negligently manufactured or improperly designed product potentially include three kinds of damage: (1) economic loss; (2) property damage (each of which may be direct or indirect); and (3) personal injury.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Case confusion and judicial delusion results from the frequent mischaracterization between these three kinds of damage. A direct property damage claim is made when the claim is for repair or replacement of the damaged item. An indirect property damage claim is made when the claim is made to recover damages to additional property owned by the user or a third party. Economic loss, which addresses the different dimension of damage, is also divided into direct and indirect damages. Direct economic loss considers the diminished performance factor of that specific faulty product in the diminished value which results from unmet expectancy in performance and includes replacement or cost of repair. Indirect economic loss is the down time and the loss of use which includes loss of profits during repair or replacement. Comment, The Vexing Problem of the Purely Economic Loss in Products Liability: An Injury in Search of a Remedy, 4 Seton Hall L.Rev. 145, 154-55 (1972).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e Additionally, of course, a product liability claim may be made for physical injury. There also is found in some cases to be a difference whether the product is commercial or consumer in nature.\n\nThese economic loss product cases apparently address direct product damage and economic loss, as long as no indirect property damage results and no personal injuries are sustained by users or other persons. Opinion writers and scholars do not make clear what happens if there is also indirect property or injury damages. That confusion is engendered by indecision of whether the inquiry is the existence of an available theory of tort recovery or only a limitation on recoverable damage without regard for the availability of the recovery theory. Differentiation between strict liability and negligence adds further misconstruction and confusion. See Gaebler, Negligence, Economic Loss, and the U. C. C., 61 Ind.L.J. 593 (1986).\n\nThe significance of a proper use of terms and determination of theory can be quickly recognized if economic and non-economic damage is considered. That would have been the case here if other property or an employee had been in the way when the boom folded like a windblown match-stick house. Whether or not there was injury or property damage alongside economic loss raises the inquiry of where recovery is authorized-under the Uniform Commercial Code and contract theory or under the tort claims of negligence and strict liability. Common sense indicates the existence of other damage should not determine whether a tort was committed. Consequently, to understand the structure of the cases, it is helpful to consider recoverability for kinds of damage and not fence with a decision of whether the tort exists. This is the only justification for comparing strict liability and negligent product liability cases to those of the independent violation of a duty to warn where separately located in product sales obligation and liability cases.\n\nA tort is an act that wrongfully invades the rights of other persons-either negligent, willful or founded on strict liability. In order for actionable results to follow from the occurrence of a tort, there is additionally required proximate cause and compensable damage. This case raises the recoverability for damage from a defective product which was put into the stream of commerce whether damage results to itself, to the balance of the machine to which it is attached, or to a person or other property. The conduct of the \"wrongful action\" does not change by a difference in damage. Consequently, the proper inquiry in product liability cases is not whether there was a tort definable by resulting damage, but when the tort exists, what resulting damages are compensable.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThis court is asked to determine the relation of what it calls economic damage with the determination of when recovery for damages can be obtained. The question can be phrased in analysis that either the tort does not exist if a particular character of damage is produced or, alternatively, the tort exists but a particular character of damage is not recoverable. The first construction operates from result to justification and, in my opinion, is faulty reasoning. I perceive the tort existed without regard for differentiation of economic or non-economic results, such as personal injury damages. I would apply the question of recovery to the analysis of what character of rights flow from the committed wrong. One approach is only result-oriented while the other seeks some principle or at least direction within this disorganized field of law.\n\nA theory of tort law is invoked in second approach and a concept of a way to limit recovery by the first. Clearly, the conflict, confusion and illogical reasoning was fertilized by the United States Supreme Court in East River SS S. Corp., 476 U.S. 858, 106 S.Ct. at 2295 by adaptation of its result-oriented effort to limit damages by denial that a responsive tort theory exists for recovery of economic damages (in the commercial transaction?).\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nA careful and comprehensive review of the many cases establishes a persuasive thesis in recognizing the second approach should be used to achieve decision. That is to simply first determine, \"is there a tort?\" If so, what damages can be recovered. It may be more provident to analyze losses for which tort liability will not be recoverable. Nearly unanimously, damages in defective product liability cases are not recoverable where the loss is a failure of bargain resulting from an unmet expectancy in product performance. This is not tort, it is contract. Conversely, the majority of the cases and the most pervasive reason find the tort and accompanying right to recover for any resulting damages in failure of a product unreasonably dangerous and the loss event is sudden, unexpected, calamitous or accidental rather than developmental.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Appended to these concepts is the relation of the failed part to the productive unit as intrinsic or attached and whether the damage is to that part or to the entire unit, e.g., the wrist pin that destroys the motor or the turbine blades that eat up the generator. Another example is the broken truck frame that causes the separately installed cement mixer to break loose and damage the truck cab.\n\nAll of these conflicts develop from the required delineation of what is recoverable damage from any product liability tort. States which apply any of these concepts agree unanimously the right to recover for sustained damage exists if personal physical injury results from the product failure. This is the typical bad tire and rollover bar user injury cases. Nearly as unanimous, recovery is permitted if the failed part causes \"other property damage.\" The exploding refrigerator in Largoza v. General Elec. Co., 538 F.Supp. 1164 (E.D.Pa.1982) and the blown up television set in Romano v. Westinghouse Elec. Co., 114 R.I. 451, 336 A.2d 555 (1975) when the resulting fire destroyed the residence serve as examples.\n\nTo the other extreme, if the damage is only to the part or if the problem is essentially a failure in expectancy, few if any cases find recoverable damage. This leaves the unusually dangerous or calamitous event. occurrence as unsettled subjects. I find within this analysis that this majority adopts an obviously minority posture, which is a clearly regressive aptitude for Wyoming product liability law. Good reason for rejection of that misapplication can be found in the many thoughtful discussions in the multitude of cases. One of the clearest and best reasoned is the recent Washington case of Washington Water Power Co. v. Graybar Elec. Co., 112 Wash.2d 847, 774 P.2d 1199, amended 779 P.2d 697 (1989). We are reminded again that only by first recognition of the factors from which the decision should be made can a rational and reasonable analysis be applied.\n\nIV. APPROACHES TO ECONOMIC DAMAGE RECOVERY IN PRODUCT LIABILITY CASES: THE THREE DIVERGENCES\n\nA. General Standards\n\nThere are three possible standards to pick from to decide when recovery can be had where the loss is said to be \"economic loss\".\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\n1. Santor Standard: In addition to contractual remedies, obsolescence and wear out. recovery may be obtained by product liability theories of tort of strict liability for design or manufacturing defect and duty to warn upon initial sale. (Obsolescence and wear out damage, failure of the bargain.)\n\n2. Catastrophic Loss for Use of Unreasonably Dangerous Product Standard Recovery is permitted for those tort theories if the event of loss was sudden or catastrophic and by some application the product was unreasonably dangerous within which the unexpected loss resulted. (Accidental loss, unreasonably dangerous nature of the occurrence and defective product.)\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\n3. East River Standard: The East River standard denies recovery for loss of economic damage from a defective product except when provided by contract. East River is binding in admiralty cases and the federal courts split with review of diversity and other non-admiralty applications. These are the cases that deny recovery whether or not the event was catastrophic or unreasonable danger was created in product failure.\n\nThere is a further divergence in the application of East River. Some cases follow the East River justification and result to apply the economic damage rule to non-consumer transactions for bargaining equals.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e If the transaction is not commercial in nature, the rule to be applied is in a no man's land where this concept is utilized. The other divergence from East River is to ignore the justification factor and apply the thesis uniformly that with internal product failure, equipment confined damage is not recoverable in tort.\n\nPermitting recovery when the loss is catastrophic and a product is unreasonably dangerous to use is the predominant standard for non-admiralty cases which is contrary to the assertions made by the majority.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e With the emergence of this standard, the Santor approach which permitted recovery for obsolescence and wear out was generally discarded. This is true even in New Jersey where Santor had initially enunciated the principal argument for a better coverage of product liability responsibility in tort to the manufacturer or supplier of the product.\n\nThe conflict of which standard to apply is between one which allows only those remedies contracted for and one which allows a tort claim of negligence or strict liability when the loss is catastrophic and a product is unreasonably dangerous to use. Under this tort standard, it is not relevant that the damage was to other property or to human life.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nThe East River standard line of cases may or may not be confined to commercial transactions where there is equal bargaining power between the purchaser and vendor or manufacturer.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Unfortunately, commentators and opinion writers do not know what to do if it is not a commercial transaction and they still want to follow the non-tort recovery precept of East River. Admiralty law is not a good foundation from which to build the law to control the American economic system. What may be appropriate for shipping may not exactly fit the farmer who is given bad fuel or the commercial establishment which is provided a faulty propane heating system regulator. I can leave for the United States Supreme Court its continued derivation of common law for admiralty.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nB. Extraordinary Dangers-Catastrophic Event-The Majority Standard\n\nThe most recent adjudication providing the clearest persuasion is the Washington Supreme Court decision in Washington Water Power Co. v. Graybar Elec. Co., 112 Wash.2d 847, 774 P.2d 1199, amended 779 P.2d 697 (1989),\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e in recognition of the countervailing concept of East River. That court defined East River:\n\nIn its opinion, the Court assessed the relative merits of several different conceptions of economic loss. For purposes of the law of admiralty, it chose the conception that defendants urge us to adopt under the WPLA. When a product damages only itself, and not persons or other property, the Court held, the proper remedy lies in contract, not in tort, no matter what risk of harm the product defect poses, and no matter how the product injury occurred. Washington Water Power Co., 774 P.2d at 1208.\n\nRecognizing that denial of remedy might provide greater certainty, the Washington court rejected East River:\n\nIn our opinion, however, this increased certainty comes at too high a price. If manufacturers can contract successfully around liabilities for product injuries, a principal deterrent to unsafe practices-the threat of legal liability-will be lost. See Cloud v. Kit Mfg. Co., 563 P.2d 248, 250-51 (Alaska 1977); Salt River Project Agricultural Imp. - \u0026 Power Dist. v. Westinghouse Elec. Corp., 143 Ariz. 368, 694 P.2d 198, 211 (1984); Mid Continent Aircraft Corp. v. Curry [Cy.] Spraying Serv., Inc., 572 S.W.2d 308, 316-18 (Tex. 1978) (Pope, J., dissenting). Washington Water Power Co., 774 P.2d at 1209.\n\nIn conclusion, the court compared the reason for rejection:\n\nThe Court's analysis in East River, we believe, unjustifiably dismisses the safety concerns attendant to product injuries caused by hazardous defects. For this reason, we find East River's approach to economic loss unsuited to what the Legislature intended under the WPLA. Product injuries, the Court says, do not raise safety concerns, but are \"essentially\" a performance problem. Id. 774 P.2d at 1209.\n\nWashington Water Power Co. does not stand alone. While the Washington court used risk of harm as the basis of economic damage liability for a defective product, Oregon courts use a strict liability standard which applies if the defect is \"unreasonably dangerous to the user.\" Brown v. Western Farmers Assoc., 268 Or. 470, 521 P.2d 537, 540 (1974). See Heaton v. Ford Motor Co., 248 Or. 467, 435 P.2d 806 (1967). Since East River, the federal courts have continued to apply the Oregon law for diversity cases as shown by Bancorp Leasing and Financial Corp. v. Agusta Aviation Corp., 813 F.2d 272 (9th Cir.1987). The basis of Oregon law in Brown, 521 P.2d at 540 is justification for the imposition of strict liability upon suppliers of defective products when creating hazard to life and health by sale of a product which presents danger in defect. Oregon differentiated this dangerously defective product argument from the disappointed buyer, Price v. Gatlin, 241 Or. 315, 405 P.2d 502 (1965), and denied product liability relief to the purchaser of chicken feed which, although arguably defective, was not unreasonably dangerous. The court left open the unreasonably dangerous test whether to be applied only to persons or to be applied to property. Brown, 521 P.2d at 542. It is noteworthy that the special concurrence in Brown, 521 P.2d at 543 based denial of the claim on being \"purely economic, loss of profits\" and, secondly, the loss was not \"accidental.\" Brown cited Wulff v. Sprouse-Reitz Co., 262 Or. 293, 498 P.2d 766 (1972), where the defective electric blanket burned up the house.\n\nThe issue left open in Brown, 521 P.2d 537 of attribution of unreasonable dangerousness to only person or also to property was resolved in Russell v. Ford Motor Co., 281 Or. 587, 575 P.2d 1383 (1978) as man endangering. Certainly, a reeving block on a large crane equally meets the test with the defective weld on the axle housing in Russell.\n\nInsofar as the premise of responsibility for the marketing of a dangerously defective product states a norm for the producer and seller, that norm either has or has not been met at the time the product is sold. Whether the seller has met this responsibility cannot depend on the fortuitous extent of the damage done when the danger created by the defect subsequently comes to pass. Moreover, if a plaintiff is able to trace the damage to the seller's negligence, he may recover for economic losses of a kind that the seller should have been able to foresee. Id. 575 P.2d at 1386-87.\n\nThat court again distinguished between disappointed user and the endangered one:\n\nThe premise of his liability also controls its extent. The loss must be a consequence of the kind of danger and occur under the kind of circumstances, \"accidental\" or not, that made the condition of the product a basis for strict liability. This distinguishes such a loss from economic losses due only to the poor performance or the reduced resale value of a defective, even a dangerously defective, product. It is the distinction between the disappointed users in Price and Brown, and the endangered ones in Brownell v. White Motor Corp. [260 Or. 251, 490 P.2d 184 (1971)] and Wulff v. Sprouse-Reitz Co. Id. 575 P.2d at 1387.\n\nThe relation between the terms given to damaged property and the ability to maintain a tort action under Illinois law was well illustrated in Kishwaukee Community Health Services Center v. Hospital Bldg. and Equipment Co., 638 F.Supp. 1492 (N.D.Ill.1986). Kishwaukee Community Health Services Center analyzed the lead case in Illinois, Moorman Mfg. Co. v. National Tank Co., 91 III-2d 69, 61 Ill.Dec. 746, 435 N.E.2d 443 (1982). That court said Moorman Mfg. Co. could be read to approve one (or more) of three tests. The \"bright line \" test-this is the East River denial of recovery unless there is injury beyond the product-allows a suit in tort if the damage involves anything other than the product itself. The \"commercial expectation \" test allows a suit in tort if the damage caused by a product's failure was unexpected. The \"sudden and dangerous \" test allows a suit in tort if the damage occurred suddenly and dangerously. Kishwaukee Community Health Services Center, 638 F.Supp. at 1497. Under Washington law, categories two and three would fall as a character risk of harm. The federal judge in Kishwaukee Community Health Services Center, 638 F.Supp. at 1499, under a post-East River exception in the Seventh Circuit Court of Appeals, observed \"[t]he Seventh Circuit appears to reject the bright line test in favor of a commercial expectation approach and to be undecided in its views toward the sudden and dangerous test.\"\n\nThis case becomes complicated because the judge seems to reject recovery which East River would have permitted as damage to other property. Obviously, damage to other property is not economic damage within the linguistic adaptations found on the subject in these cases. Kishwaukee Community Health Services Center is one of the few cases where recovery is denied and which East River would have permitted.\n\nMoorman Mfg. Co., 435 N.E.2d 443 is compatible with Washington Waterpower Co., 774 P.2d 1199 when it is cited for a result not recognized in Kishwaukee Community Health Services Center. The majority in Moorman Mfg. Co., 435 N.E.2d at 451 denied tort relief where the defect was qualitative and the harm related to the consumer expectancy of fitness for purpose:\n\nThe policy considerations against allowing recovery for solely economic loss in strict liability cases apply to negligence actions as well. When the defect is of a qualitative nature and the harm relates to the consumer's expectation that a product is of a particular quality so that it is fit for ordinary use, contract, rather than tort, law provides the appropriate set of rules for recovery.\n\nThat court further observed:\n\nThe demarcation between physical harm or property damage on the 'one hand and economic loss on the other usually depends on the nature of the defect and the manner in which the damage occurred. Id. at 449.\n\nCited as respectable authority was Cloud v. Kit Mfg. Co., 563 P.2d 248, 251 (Alaska 1977), which originated the sudden and calamitous damage factor. The special concurrence in Moorman Mfg. Co., 435 N.E.2d at 455 questioned defining economic loss based on absence or appearance of physical harm. That judge made an interesting comment which, if true, may account for the obvious trend toward the Washington Water Power Co., 774 P.2d 1199 risk of harm concept.\n\nOne should not have to choose wholesale between Santor v. A \u0026 M Karagheusian, Inc. (1965), 44 N.J. 52, 207 A.2d 305, and Seely v. White Motor Co. (1965), 63 Cal.2d 9, 403 P.2d 145, 45 Cal.Rptr. 17; 1 believe the proper approach is to adopt the valid concerns behind each. Moorman Mfg. Co., 435 N.E.2d at 456.\n\nScott \u0026 Fetzer Co. v. Montgomery Ward \u0026 Co., 112 111.2d 378, 98 Ill.Dec. 1, 493 N.E.2d 1022 (1986) clarified that non-product property damage did not come within the economic loss doctrine of non-recoverable economic damage. The nature of the fire as sudden and dangerous was emphasized. The economic loss doctrine applied neither to fire damage to adjacent tenants nor to deny contribution to Montgomery Ward \u0026 Co. against the fire service equipment supplier. Lack of an accident in water damaged apartments denied punitive damages for any tort claim in Morrow v. L.A. Goldschmidt Associates Inc., 112 111.2d 87, 96 Ill.Dec. 939, 492 N.E.2d 181 (1986). Similarly, faulty workmanship with damage not occurring from a sudden and dangerous occurrence bespoke to recovery denial within the economic damage doctrine in Foxcroft Townhome Owners Ass'n v. Hoffman Rosner Corp., 96 Ill.2d 150, 70 Ill.Dec. 251, 449 N.E.2d 125 (1983). See Redarowicz v. Ohlendorf, 92 Ill.2d -171, 65 Ill.Dec. 411, 441 N.E.2d 324 (1982). See likewise the recognition of the difference between deterioration and sudden and calamitous damage, Chicago Heights Venture v. Dynamit Nobel of America, Inc., 782 F.2d 723 (7th Cir.1986) (Illinois law), in finding economic loss within a qualitative defect reducing the consumer's expectation of a product's fitness.\n\nThe admiralty rule of East River compared to state law standards of product responsibility was defined in City of Greenville v. W.R. Grace \u0026 Co., 827 F.2d 975 (1987), reh'g denied 840 F.2d 219 (4th Cir.1988), which provided further authority for the Washington Water Power Co., 774 P.2d 1199 differentiation.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e City of Greenville supplied Monokote fireproofing for the city hall construction. Six months after the manufacturer developed an asbestos free product, it continued to supply the old Monokote which contained the dangerous asbestos material. The circuit court affirms substantial judgments for both actual and punitive damages on a product liability basis. East River was largely inapposite when lacking claim of injury or threat of injury to persons or other property. Conversely, the asbestos contained insulation material was a \"product [which] threatens a substantial and unreasonable risk of harm * * *.\" City of Greenville, 827 F.2d at 978. It was noted the defense could not be justified on the basis that no one had \"yet developed an asbestos-related disease.\" Id. at 978. See also Board of Educ. of City of Chicago v. A, C \u0026 S, Inc., 171 Ill.App.3d 737, 121 Ill.Dec. 643, 525 N.E.2d 950 (1988), which is also a school asbestos material case. Comparable to City of Greenville is 2000 Watermark Ass'n, Inc. v. Celotex Corp., 784 F.2d 1183 (4th Cir.1986), where asphalt shingles were poorly but not dangerously manufactured and installed. The shingles might not shed the rain so long nor look so good as desired and expected when blistered, but they did not threaten life or other property.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nThe product failure similar to Washington Water Power Co., 774 P.2d 1199 was litigated in Salt River Project Agr. Imp. and Power Dist. v. Westinghouse Elec. Corp., 143 Ariz. 368, 694 P.2d 198 (1984) claiming tort liability of a commercial seller to a commercial buyer. The district purchased a gas turbine generator which proved to have problems within its operating P-50 computer. A course of trouble lead to the purchase of a manual control LMC (Local Maintenance Controller) unit. The LMC malfunctioned when installed and 1.9 million dollars damage to the entire turbine resulted. In searching the interaction of tort and contract law, the court reached for definitional limitations where tort recovery for internal product damage might occur. The manner in which the loss occurred was next considered whether in accident or calamity.\n\nDifferentiated was the nature of the defect as defective in a way that poses an unreasonable danger to those that use or consume it or only found to be not fit for the intended purpose without unreasonable danger of causing injury to person or property. Last then considered was the type of loss or damage. The Arizona court recognized the fire and explosion was \"not merely a commercial defect or `non-dangerous impairment of quality\"' and recognized the endangered persons and other property from the accident for which tort law provides a proper rationale. Salt River Project Agr. Imp. and Power Dist., 694 P.2d at 210 (quoting Posttape Associates v. Eastman Kodak Co., 537 F.2d 751, 755 (3rd Cir.1976)). Salt River Project Agr. Imp. and Power Dist. also cited Arrow Leasing Corp. v. Cummins Arizona Diesel, Inc., 136 Ariz. 444, 666 P.2d 544 (1983) and Cloud, 563 P.2d at 251. That court then determined \"[w]hether the major item of property damage is classified as a loss to other property of the plaintiff or a loss only to the defective product itself, [plaintiff] has a claim in tort * * *.\" Salt River Project Agr. Imp. and Power Dist., 694 P.2d at 210-11.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e The court in Salt River Washington Water Power Co. and Salt River Project Agr. Imp. and Power Dist. both cited with approval and followed the name case on this subject from Alaska, Cloud, 563 P.2d 248, which is the progenitor of the economic damage recovery rule where unreasonable danger exists from faulty products. In Cloud, a rug pad ignited and caused a fire which destroyed the trailer house. Suit was filed in theories of strict liability, negligence and implied warranty. That court first recognized that property and personal physical injury should be similarly treated in the adaptation of product liability litigation. The question then was to distinguish between economic loss and direct property damage. The court, in adaptation of terms, defined that sudden and calamitous damage would almost always result in property damage as distinguished from deterioration, internal breakage and depreciation which that court defined as economic loss. The sudden, violent and calamitous harm justified tort recovery for the damaged trailer house and its contents.\n\nWest Virginia followed the same principle after review of nationwide precedent by statement in Star Furniture Co. v. Pulaski Furniture Co., 297 S.E.2d 854, 859 (W.Va.1982):\n\nPhysical harm to the defective product belongs with tort principles; reduction in value merely because of the product flaw falls into contract law. See, e.g., Gherna v. Ford Motor Co., 246 Cal.App.2d 639, 55 Cal.Rptr. 94 (1966); Gibson v. Reliable Chevrolet, Inc., 608 S.W.2d 471 (Mo. App.1981); Russell v. Ford Motor Co., 281 Or. 587, 575 P.2d 1383 (1978).\n\nTherefore, we reject the line of cases begun by Santor v. A \u0026 M Karagheusian, Inc., 44 N.J. 52, 207 A.2d 305 (1964), which have permitted use of strict liability to recover the difference between the value of the product received and its purchase price in the absence of a sudden calamitous event. See, e.g., Cova v. Harley Davidson Motor Co., 26 Mich. App. 602, 182 N.W.2d 800 (1971); Air Products \u0026 Chemicals, Inc. v. Fairbanks Morse, Inc., 58 Wis.2d 193, 206 N.W.2d 414 (1973) (applying Pennsylvania law). In West Virginia, property damage to defective products which results from a sudden calamitous event is recoverable under a strict liability cause of action. Damages which result merely because of a \"bad bargain\" are outside the scope of strict liability.\n\nStar Furniture Co. was followed by a federal court certification request in Basham v. General Shale, 377 S.E.2d 830 (W.Va.1988), where the defective bricks in deterioration did not produce the required calamitous event.\n\nIn a most recent analysis, the West Virginia court effectively and directly considered East River and Star Furniture Co. where a 475B Michigan front-end loader was burned up by an alleged hydraulic fuel leak in its system (comparable to the fuel pump example, infra). Capitol Fuels, Inc., 382 S.E.2d 311. The strict liability based verdict for the buyer for the value of the destroyed machine was affirmed. That court continued its \"intermediate position, * * *, where recovery is permitted for a defect in the product if it is dangerous to the users and destroys the product in a sudden calamitous event, * * *.\" Id. at 312.\n\nWhat appears obvious from Star Furniture is that under the \"bad bargain\" concept, the fact that the product may be flawed or defective, such that it does not meet the purchaser's expectations or is even unusable because of the defect, does not mean that he may recover the value of the product under a strict liability in tort theory. The purchaser's remedy is through the Uniform Commercial Code. See Kesner v. Lancaster, W.Va. -, 378 S.E.2d 649 (1989). In order to recover under Star Furniture, the damage to the product must result from a sudden calamitous event attributable to the dangerous defect or design of the product itself.\n\nIn this case, we reaffirm our decision in Star Furniture. The front-end loader was not merely an ineffective product which failed to meet the customer's expectations. A defect in the front-end loader caused an abrupt fire which continued to burn until the loader was destroyed. The operator of the loader escaped without injury. The defect in the front[-]end loader created a potentially dangerous situation and the risk associated with the defect was not one ordinarily contemplated by a purchaser. Clearly, this is the type of property damage resulting \"from a sudden calamitous event\" which is recoverable under Star Furniture, -W.Va. at -, 297 S.E.2d at 859. Id. at 313.\n\nAlaska's Cloud, 563 P.2d 248 was also followed in Georgia for a federal certification question in Vulcan Materials Co., Inc. v. Driltech, Inc., 251 Ga. 383, 306 S.E.2d 253, 257 (1983) (quoting Flintkote Co. v. Dravo Corp., 678 F.2d 942, 948 (11th Cir. 1982)):\n\n\"The economic loss rule prevents recovery in tort when a defective product has resulted in the loss of the value or use of the thing sold, or the cost of repairing it. Under such circumstances, the duty breached is generally a contractual one and the plaintiff is merely suing for the benefit of his bargain. The rule does not prevent a tort action to recover for injury to other property and persons because the duty breached generally arises independent of the contract. Nor does it preclude recovery for damages to the defective product itself, where the injury resulted from an accident.\" (Footnote omitted.) (Emphasis supplied.) See also Watkins v. Barber-Colman Co., Inc., 625 F.2d 714 (5th Cir.1980), where injuries resulted.\n\nComparable in result is City of Franklin v. Badger Ford Truck Sales, Inc., 58 Wis.2d 641, 207 N.W.2d 866 (1973), although the court did not make a specific finding of dangerousness of wheels that fell off of a fire engine when it was being driven around a corner. Confusion in terminology again is recognized in Cova v. Harley Davidson Motor Co., 26 Mich. App. 602, 182 N.W.2d 800 (1970) permitting tort recovery for the damaged product but perhaps not loss of profits in consequential damages. See, however, Mulholland, 443 N.W.2d 340. City of La Crosse v. Schubert, Schroeder \u0026 Associates, Inc., 72 Wis.2d 38, 240 N.W.2d 124 (1976) followed City of Franklin, 207 N.W.2d 866 in tort recovery for other property as well as the faulty and damaged roof. Cova, 182 N.W.2d 800 was also cited with approval. Compare Sunnyslope Grading, Inc. v. Miller, Bradford and Risberg, Inc., 148 Wis.2d 910, 437 N.W.2d 213 (1989), where dangerousness was not an issue and the decision was premised on the nature of the transaction as commercial with pure economic loss where adverse warranty terms existed. Sunnyslope Grading, Inc. was distinguished and the unreasonably dangerous rule applied in Tony Spychalla Farms, Inc. v. Hopkins Agr. Chemical Co., 151 Wis.2d 431, 444 N. N.W.2d 743 (App.1989). Defectiveness and unreasonable dangerousness to the user or his property was the test applied for tort liability to a product purchased as a sprout suppressant for potatoes after an awarded and affirmed judgment of $227,050 for crop damage.\n\nThe potentially hazardous product was recognized in Pennsylvania in Industrial Uniform Rental Co., Inc. v. International Harvester Co., 317 Pa.Super. 65, 463 A.2d 1085 (1983), overruled sub nom. REM Coal Co., Inc. v. Clark Equipment Co., 563 A.2d 128 (Pa.Super.1989), but the law of that state today seems less than definitive. Compare the federal court analysis in Pennsylvania Glass Sand Corp. v. Caterpillar Tractor Co., 652 F.2d 1165 (3rd Cir. 1981) with Aloe Coal Co. v. Clark Equipment Co., 816 F.2d 110 (3rd Cir.), cert. denied 484 U.S. 853, 108 S.Ct. 156, 98 L.Ed.2d 111 (1987). However, in the latter case, the unreasonable dangerous nature of. defect was not a considered issue.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nThe Nebraska court has employed the unreasonably dangerous test in discussion and case analysis. In recent opinion, it said by quotation in National Crane Corp. v. Ohio Steel Tube Co., 213 Neb. 782, 332 N.W.2d 39, 43 (1983) to be followed in Nerud v. Haybuster Mfg., Inc., 215 Neb. 604, 340 N.W.2d 369, 375 (1983):\n\nA majority of courts that have considered the applicability of strict liability to recover damages to the defective product itself have permitted use of the doctrine, at least where the damage occurred as a result of a sudden, violent event and not as a result of an inherent defect that reduced the property's value without inflicting physical harm to the product. See Star Furniture Co. v. Pulaski Furniture Co., 297 S.E.2d 854 (W.Va.1982). In essence, this court has reached the same result. See Morris v. Chrysler Corp., 208 Neb. 341, 303 N.W.2d 500 (1981).\n\nIn most recent decision, the Ohio Supreme Court forsook a Santor v. A \u0026 M Karagheusian, Inc., 44 N.J. 52, 207 A.2d 305 (1965) posture, but moved no further than the Cloud, 563 P.2d 248 fortuity and dangerousness status. Chemtrol Adhesives, Inc. v. American Mfrs. Mut. Ins. Co., 42 Ohio St.3d 40, 537 N.E.2d 624 (1989). Lacking a defect with an unreasonable risk of harm, strict liability would not lie. See, however, Mead Corp. v. Allendale Mut. Ins. Co., 465 F.Supp. 355 (N.D. Ohio 1979); Iacono v. Anderson Concrete Corp., 42 Ohio St.2d 88, 326 N.E.2d 267 (1975); and Note, Recovery of Direct Economic Loss: The Unanswered Questions of Ohio Products Liability Law, 27 Case W. Res. L. Rev. 683 (1977).\n\nThe New Jersey court \"readjusted\" its posture originally adopted in Santor, 207 A.2d 305 to create a differentiated rule for commercial transactions where tort remedies would be denied for the economic damage internal product defects and loss in Spring Motors Distributors, Inc. v. Ford Motor Co., 98 N.J. 555, 489 A.2d 660 (1985). However, neither that case nor more recent opinions from New Jersey have addressed the risk of harm-unreasonable danger or calamitous event subjects which are now before this court. See also Perth Amboy Iron Works, Inc. v. American Home Assur. Co., 226 N.J.Super. 200, 543 A.2d 1020 (1988). Cf. Dreier Co., Inc. v. Unitronix Corp., 218 N.J.Super. 260, 527 A.2d 875 (1986).\n\nWithin the volume of cases considered, an almost exact duplication in kind of equipment damage occurred in John R. Dudley Const., Inc. v. Drott Mfg. Co., 66 A.D.2d 368, 412 N.Y.S.2d 512 (1979). The crane boom suddenly collapsed without injury to people or damage to other property. The first inquiry was strict product liability recovery, although the only property damage was to the crane itself. The court distinguished the benefit of the bargain cases demonstrated by Santor, 207 A.2d 305 and granted relief by virtue of the nature of the accidental collapse and dangerous character of the alleged product defect. John R. Dudley Const., Inc. was followed by a number of New York cases which defined its scope to the same principles later enunciated in Washington Water Power Co., 774 P.2d 1199 and somewhat earlier in Cloud, 563 P.2d 248. In confinement of the principle involved in support for the decision made, see Schiavone Const. Co. v. Elgood Mayo Corp., 81 A.D.2d 221, 439 N.Y.S.2d 933 (1981), rev'd 56 N.Y.2d 667, 451 N.Y.S.2d 720, 436 N.E.2d 1322 (1982), Silverman, J., dissenting, with dissent adopted in Trustees of Columbia University v. Exposaic Industries, Inc., 122 A.D.2d 747, 505 N.Y.S.2d 882 (1986); Hartford Ins. Group v. Curry Chevrolet Sales \u0026 Service, Inc., 119 A.D.2d 546, 500 N.Y.S.2d 720 (1986); and Schiavone Const. Co. v. Elgood Mayo Corp., 56 N.Y.2d 667, 451 N.Y.S.2d 720, 436 N.E.2d 1322 (1982). Cf. Graham v. Rockwell Intern. Corp., 135 A.D.2d 1128, 523 N.Y.S.2d 992 (1987) (dissent which compared factually the case with those where only the benefit of the bargain issues were presented, e.g., Hemming v. Certainteed Corp., 97 A.D.2d 976, 468 N.Y.S.2d 789 (1983)). See also other economic damage cases where clearly neither dangerousness nor calamitous events occurred, Krzys v. American Honda Motor Co., Inc., 124 A.D.2d 947, 508 N.Y.S.2d 355 (1986) and Cayuga Harvester, Inc. v. Allis-Chalmers Corp., 95 A.D.2d 5, 465 N.Y.S.2d 606 (1983).\n\nThe convergence of three cases provides for California a posture which is perhaps different on the subject of economic damages resulting from the damage to the product itself than perhaps exists in any other state. These cases are J'Aire Corp. v. Gregory, 24 Cal.3d 799, 157 Cal.Rptr. 407, 598 P.2d 60 (1979); Cronin v. J.B.E. Olson Corp., 8 Cal.3d 121, 104 Cal.Rptr. 433, 501 P.2d 1153 (1972); and Seely v. White Motors Co., 63 Cal.2d 9, 45 Cal.Rptr. 17, 403 P.2d 145 (1965). In Seely, Justice Traynor initiated the counterpoint rule to Santor, 207 A.2d 305 in directing recourse to contract. Seely did not resolve nor consider the unreasonably dangerous, non-accidental divergence later developed for permitted recovery in tort as now most clearly identified in Washington Water Power Co., 774 P.2d 1199. Cronin, 501 P.2d 1153 deleted the requirement in California product liability cases to prove the factor of unreasonably dangerousness. See Recent Development, Products Liability-Strict Liability in Tort: Defect Need Not Render Product \"Unreasonably Dangerous\" -Cronin v. J.B.E. Olson Corp., 8 Cal.3d 121, 104 Cal.Rptr. 433, 501 P.2d 1153 (1972), 49 Wash. L. Rev. 231 (1973). See also Barker v. Lull Engineering Co-, Inc., 20 Cal.3d 413, 143, Cal.Rptr. 225, 573 P.2d 443 (1978). J'Aire Corp., 598 P.2d 60 provided a broad territory for recovery of economic damages under California law, including contractual and implied contractual proceedings as well as negligence claims. In result from these three cases, faulty product internal damage litigation has, as expressed by one commentator, tended to be targeted within theories of contractual adaptation. Rabin, Tort Recovery for Negligently Inflicted Economic Loss: A Reassessment, 37 Stan. L. Rev. 1513 (1985). See however Franklin, When Worlds Collide: Liability Theories and Disclaimers in Defective-Product Cases, 18 Stan. L. Rev. 974 (1966).\n\nIn California, economic recovery is permitted in negligence actions where the economic loss is especially foreseeable despite the absence of physical injury or property damage. Ales-Peratis Foods Intern., Inc. v. American Can Co., 164 Cal.App.3d 277, 209 Cal.Rptr. 917 (1985). Consequently, the case is balanced upon a result which was clearly foreseeable rather than the product which was unreasonably dangerous. Pisano v. American Leasing, 146 Cal.App.3d 194, 194 Cal.Rptr. 77 (1983). Compare,. however, Kaiser Steel Carp. v. Westinghouse Elec. Corp., 55 CaI.App.3d 737, 127 Cal.Rptr. 838 (1976); Gherna v. Ford Motor Co., 246 Cal.App.2d 639, 55 Cal.Rptr. 94 (1966); and Fentress v. Van Etta Motors, 157 Cal.App.2d Supp. 863, 323 P.2d 227 (1958).\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nThe incongruity of the California law and any logical validity to a commercial setting dichotomy is currently illustrated by GEM Developers v. Hallcraft Homes of San Diego, Inc., 213 Cal.App.3d 419, 261 Cal.Rptr. 626 (1989). That case should be carefully reviewed before adaptation of any California case is currently pursued to justify this majority opinion. The significant difference in GEM Developers is the insurance carrier paid part of the economic loss damages owed from a judgment based on strict liability, negligence and warranty and assigned its subrogation claims to the buyer. Here, Continental paid the damages and took the subrogation claim from the buyer.\n\nC. The East River-Minority Adaptations.\n\nThe contrary minority posture has been adopted by some states which do not follow the risk of injury status of Washington Water Power Co., 774 P.2d 1199 or its constituents of calamitous events or unreasonableness of danger. Apparently, five jurisdictions, by most recent case law, do follow East River through calamitous event and unreasonableness of danger from the product to tort claim denial. These jurisdictions include Missouri as determined in Sharp Bros. Contracting Co. v. American Hoist \u0026 Derrick Co., 703 S.W.2d 901 (Mo.1986), with the decision created by the court's opinion of two members, two members specially concurring and three members dissenting. The dissent noticed the violent occurrence divergence from previous Missouri law. See Gibson v. Reliable Chevrolet, Inc., 608 S.W.2d 471 (Mo.App.1980), which cited Cloud, 563 P.2d 248 with approval and recognized that in Clevenger and Wright Co. v. A.0. Smith Harvestore Products, Inc., 625 S.W.2d 906 (Mo.App.1981), the calamitous event was not an external tornado. The court's opinion in Sharp Bros. Contracting Co., 703 S.W.2d 901 apparently adopted the conservative posture of Dean Keeton and denied consideration whether an accident should be a factor. See W. Prosser and W. Keeton, Law of Torts § 81 (5th ed. 1984). Another justice concurring in Sharp Bros. Contracting Co. found a basis for agreement by virtue of the commercial nature and equal bargaining power of the participants. The confusion engendered by the decision as to whether the exclusion of the violent occurrence factor related both to commercial and consumer purchasers was cogently recognized in Note, Is the Ordinary Consumer Left With a Damaged Product and No Remedy? 52 Mo. L. Rev. 961 (1987).\n\nThe second state that appears to have adopted the same posture, although the sporadic adaptations in the cases leaves this conclusion far from certain, is Minnesota. The lead case was Superwood Corp. v. Siempelkamp Corp., 311 N.W.2d 159 (Minn.1981). Superwood Corp. responded to a federal certification where the cylinder on a hot plate press failed. The premise of denial of tort remedies arose out of the commercial nature of the transaction. In Superwood Corp., the question of a calamitous event or exceptional dangerousness of the product was not considered. Superwood Corp. was followed by St. Paul Fire and Marine Ins. Co. v. Steeple Jac, Inc., 352 N.W.2d 107 (Minn.App.1984), where, with like result following litigation, a window washing unit had collapsed without personnel injury or other property damage. The appellate court noted \"[t]he majority of the jurisdictions that follow Seely exclude from the definition of economic loss damages arising from an unreasonably dangerous defect. They characterize these damages as physical damage or physical injury. Damages caused by defects which are not unreasonably dangerous are defined as economic loss.\" Id. at 109 (emphasis in original and footnote omitted). The court said it had to follow Superwood Corp. to denial, but thought the United States Supreme Court should clarify their opinion. St. Paul Fire and Marine Ins. Co. provided no issue of dangerousness and was followed by Minneapolis Soc. of Fine Arts v. Parker-Klein Associates Architects, 354 N.W.2d 816 (Minn.1984). The tort denial adaptation was again followed in S.J. Groves \u0026 Sons Co. v. Aerospatiale. Helicopter Corp., 374 N.W.2d 431 (Minn. 1985), where a helicopter collapsed. In dissent, it was recognized that \"[t]he majority reads this language [Superwood Corp.] to prevent recovery of those types of damages, even in cases involving `sudden and calamitous events.' Such a holding puts Minnesota very much in the minority. Superwood never intended such result.\" Id. at 435. Alabama also follows the East River rule, Lloyd Wood Coal Co. v. Clark Equipment Co., 543 So.2d 671 (Ala.1989); Dairyland Ins. Co. v. General Motors Corp., 549 So.2d 44 (Ala.1989).\n\nThe fourth state which may follow the same persuasion, or at least the dissent in the case thinks so, is Texas through Mid Continent Aircraft Corp. v. Curry County Spraying Service, Inc., 572 S.W.2d 308 (Tex.1978). The difficulty in perception is both the majority and the minority cited the same case with approval, Nobility Homes of Texas, Inc. v. Shivers, 557 S.W.2d 77 (Tex.1977), which clearly recognized unreasonably dangerous criteria permitting tort claims. At this time by the decision involving Clark Equipment Co. in REM Coal Co., Inc. v. Clark Equipment Co., 563 AN 128 (Pa.Super.1989), the Pennsylvania law is similarly directed. To recognize the complexities, compare Construction Associates, Inc. v. Fargo Water Equipment Co., 446 N.W.2d 237 (N.D.1989) with Frey Dairy, 886 F.2d 128.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nV. OTHER PROPERTY\n\n(FOR APPLICATION OF ANY EAST RIVER RULE)\n\nA final aspect of this case remains. Realistically, at least for this subject, this court can claim case support not found for the other issues in its decision. We still need to consider the determination of what is other property when a constituent part of the equipment malfunctions and causes general damage. Specifically, this is the present case where the break up of the reeving block destroyed the crane boom. On duty to warn, this court had almost no authority to support its decision. On non-recognition of the risk of harm differentiation from economic damage recovery limitations, a clearly present minority view was selected. However, here on definition of other property, I would argue for what is probably an academic attainment if the other proper rules were followed, but in absence thereof, a minority posture among the many cases.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nCurrently illustrative for an East River (admiralty) approach is Nicor Supply Ships Associates, 876 F.2d 501. The issues of the case and the singular amount of damage were arguably caused by a faulty fuel pump on the ship. The basic off-shore supply ship was modified by structural changes costing more than 7.8 million dollars by the time charterer who was then engaged in seismic activities with the modified ship. A fire at sea caused more than two million dollars damage to the vessel and about eight million dollars damage to the installed equipment. Owner Nicor Supply Ships and charterer Digicon sued General Motors Corporation which had produced the installed fuel pump. Nicor Supply Ships lost on a lack of proof on its failure to warn post-sale tort thesis.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nDigicon, as the time charterer, was granted the right by appellate decision to pursue loss or damage for what it had put on the ship and loss of profits from inability to use this \"other property\" unless the entire installation was a total loss. In distinguishing the case from Louis Dreyfus Corp. v. 27,946 Long Tons of Corn, 830 F.2d 1321 (5th Cir.1987), where loss of cargo and not other property had occurred, the Nicor Supply Ships Associates court informatively added for analysis of precedential value:\n\nIn a parenthetical description of another case, contained in a footnote, this court recently stated in Employers Ins. of Wausau v. Suwannee River Spa Lines, Inc. [866 F.2d 752, 763 n. 16 (5th Cir.1989) ] that the \"loss of cargo is not damage to `other property' within [the] meaning of East River.\" That statement relies upon a similar observation in our earlier opinion in Louis Dreyfus Corp. v. 27,946 Long Tons of Corn. To the degree, if at all, that these statements suggest that the additions to the vessel involved in this case are not \"other property,\" they are obiter dicta, not precedent. They may help to explain the rationale of the particular opinion in which they were uttered, but they do not bind us as the law of the circuit. Nicor Supply Ships Associates, 876 F.2d at 506 (footnotes omitted).\n\nThe review justification is limited by the probability of dangerousness and calamitous event circumstance whenever a part damages a significant contingent of the remaining machine. Be that as it may, I remain convinced that rights of recovery should not be defined by the accident of the company of installation of a particular part on the operational machine. How should it differ whether the furnace control unit came with the furnace or was later installed if thereafter to malfunction and cause damage to the entire furnace, the entire house or injury to the owner or house occupants? If the reeving block had been replaced by Ajax or Ho-Hum Manufacturing resulting in machine damage, why should it differ from the status where the reeving block had been left on the machine by Page? We opine to a very involved economic concept by differentiating rights of recovery, although the faulty part did the same thing and caused the same damage following installation by whoever. Fondyce Concrete, Inc. v. Mack Trucks, Inc., 535 F.Supp. 118 (D.Kan.1982); Largoza, 538 F.Supp. 1164; Hales v. Green Colonial, Inc., 490 F.2d 1015 (8th Cir.1974); Firestone Tire \u0026 Rubber Co. v. Hall, 152 Ga.App. 560, 263 S.E.2d 449 (1979).\n\nIt is highly unlikely that for most integrated machines, the manufacturer actually fabricated most of the composite parts. I would consequently limit the scope of a single part defect--non-tort recovery--to whatever originally failed and not what it did to the other parts of the machine in failing. The courts that have declined this rational approach have espoused the intent to limit tort recovery. To reach a result by redefinition is, to me, unnecessary subterfuge. If the failed part is not unnecessarily dangerous or damage in occurrence reflects deterioration and depreciation as a denied benefit of the bargain, I would leave adjudication between the parties on straight contract or warranty standards no matter how much or how little of the entire machine was damaged.\n\nHowever, where as here, the decisive factor is the character of the occurrence and the nature of the fault in the product. The standard to be followed should include recovery for all damage however incurred. I find it to be linguistically improper and logically unsound to call the crane damage in this case economic loss after the reeving block came apart and dumped the boom unit. Undoubtedly, there were significant additional economic losses sustained from down time and repair complexities, but these costs were neither claimed nor a part of this two million dollar damage litigation. Consequently, even if the minority rule on tort remedy availability is now adopted as proposed by this majority, I would leave application of the resulting economic damage limitation to the failed part and not deny recovery for other damage done to the balance of the machine, as well as other external property losses or personal injuries, if any are incurred.\n\nVI. CONCLUSION\n\nIt is fair to conclude that Washington Water Power Co., 774 P.2d 1199 (Washington), Cloud, 563 P.2d 248 (Alaska), Salt River Project Agr. Imp. and Power Dist., 694 P.2d 198 (Arizona), John R. Dudley Const., Inc., 412 N.Y.S.2d 512 (New York), and Capitol Fuels, Inc., 382 S.E.2d 311 (West Virginia), as well as the other authorities noted reflect not only the developing direction of case law but socially appropriate engineered philosophy directed toward better product and a safer environment. Neither the pure East River idiom nor its half of a loaf commercial transaction offspring as a minority posture deserve adaptation for either consumer or commercial purchasers in this jurisdiction.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Confining recovery to contractual remedies makes no real sense. Today the reeving block, tomorrow the heating unit control or the vehicle fuel pump. Sometimes by fortuity, other property or personal injury will not result but, unfortunately, fortuity is not continuity and with faulty and dangerous products, there will inevitably be injury and other property damage in time.\n\nFinding error by this court in both misunderstanding the duty to warn claim and denial of access to the product liability claim, I respectfully dissent.\n\n\u003cspan class=\"fn\"\u003e1. Denying appellants' motion for leave to amend, which was contemporaneous to the motion to dismiss/summary judgment, cannot be justified under Wyoming precedent. This majority violates the express terms of W.R.C.P. 15 and permits the trial court to flaunt Pace v. Hadley, 742 P.2d 1283 (Wyo.1987); Torrey v. Twiford, 713 P.2d 1160 (Wyo.1986); and Kimbley v. City of Green River, 663 P.2d 871 (Wyo. 1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Appropriately to be realized is: For whatever reason, be it an unacknowledged endorsement of caveat emptor, a quiet deference to the legislative enactment of the U.C.C., or a more fundamental inability to study and understand the issue, the. courts have made a mess. The courts fail to consider, for instance, the definition of economic loss and whether the definition fits the facts in any given case. The courts generally disregard the basic policies which support imposition of strict liability in tort and their application to the question of economic loss recovery. The differences between the opposing theories of recovery are either ignored, assumed, or hopelessly confused, as is the question whether it makes any difference which theory is applied. Comment, Agristor Leasing v. Spindler. Economic Loss, Strict Liability and the U.C.C.-- What a Mess, 34 S.D.L. Rev. 101, 103-04 (1989) (footnotes omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The reeving block costs approximately $80,000 to replace; the improved model was available for approximately $150,000. After the reeving block broke apart and caused the boom to collapse, the damage to the boom and bucket was $2,536,957. Replacement cost of the earth digging equipment was approximated to be $16,000,000 with its seventy-five cubic yard bucket and lifting capacity rated for 290,000 pounds or 145 tons per load. Reeving blocks are holders of cable pulleys used in the boom operation, lifting and movement processes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Continental Insurance Company and other insurance companies (designated collectively as Continental) paid for repair and present this litigation pursuant to a subrogation receipt. The appropriateness of the subrogation rights and process is not considered by the majority in its opinion and will not be pursued in this dissent. See Compass Ins. Co. v. Cravens, Dargan and Co., 748 P.2d 724 (Wyo. 1988) (Urbigkit, J., dissenting). Not pleaded and consequently not considered is whether some theory of equitable indemnity could have been pursued either by denial and litigation of the Bridger Coal claims or in this proceeding. See GEM Developers v. Hallcraft Homes of San Diego, Inc., 213 Cal.App.3d 419, 261 Cal.Rptr. 626 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. I do not perceive the majority correctly references the next to the last paragraph of the decision letter for what it actually served to be. That sentence considers the approval as to form subject to Uniform Rules for the District Courts 404, which states: Written judgments or orders shall be presented to the court within 20 days after its decision is made known. Before submitting the judgment or order the party drafting it shall secure the written approval of the opposing parties not in default. In lieu of securing the approval of the opposing parties the party proposing the form of judgment or order may forward the original to the court and serve a copy on the other parties with a notice advising objections must be made within 5 days. If no objection is timely made, the court may sign the judgment or order. If objection is made, the court will resolve the matter. Further right for Continental to make substantive argument was not addressed or provided by the foreclosing decision as then announced. This court should take heed of advice given by one of the most thoughtful and scholarly appellate tribunals in this nation in an eighteen page extended tort case review: The importance of today's decision lies not so much in its explication of the principles of tortious interference and defamation as in its signal to trial courts to approach with great caution applications for dismissal under [a motion to dismiss] for failure of a complaint to state a claim on which relief may be granted. We have sought to make clear that such motions, almost always brought at the very earliest stage of the litigation, should be granted in only the rarest of instances. If a complaint must be dismissed after it has been accorded the kind of meticulous and indulgent examination counseled in this opinion, then, barring any other impediment such as a statute of limitations, the dismissal should be without prejudice to a plaintiffs filing of an amended complaint. Printing Mart-Morristown v. Sharp Electronics Corp., 116 N.J. 739, 563 A.2d 31, 48 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Since the opinion was written, an intermediate appellate court case has appeared deciding non-recovery for economic damages will similarly apply to failure to warn for strict liability in product liability within commercial transactions. Utah Intern., Inc. v. Caterpillar Tractor Co., 108 N.M. 539, 775 P.2d 741, cert. denied 108 N.M. 354, 772 P.2d 884 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Failure to warn liability may arise from spectators watching alligators in a pond when they see wayward small children approach to swim. A bridge ahead is out occurrence likewise provides a cogent example. Inevitably presented is the legalistic and societalistic differences between a moral and legal duty to fellow humans. However, in product liability cases, the duty to warn also achieves two faces with first application to the dangerous product on initial sale and a different obligation for a previously sold product when the manufacturer or merchant comes to know that a failure of replacement or repair creates an unreasonable risk of danger of damage. The moral duty achieves a legal-tort status-liability responsibility.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Hopkins v. Chip-In-Saw, Inc., 630 F.2d 616 (8th Cir.1980); Gordon v. Niagara Mach. \u0026 Tool Works, 574 F.2d 1182, reh k denied 578 F.2d 871 (5th Cir. 1978); Griggs v. Firestone Tire \u0026 Rubber Co., 513 F.2d 851 (8th Cir.), cert. denied 423 U.S. 865, 96 S.Ct. 124, 46 L.Ed.2d 93 (1975); Sliman v. Aluminum Co. of America, 112 Idaho 277, 731 P.2d 1267 (1986), cert. denied - U.S. -, 108 S.Ct. 2013, 100 L.Ed.2d 601 (1988); West v. Broderick \u0026 Bascom Rope Co., 197 N.W.2d 202 (Iowa 1972); Connelly v. General Motors Corp., 184 Ill.App.3d 378, 132 Ill.Dec. 630, 540 N.E.2d 370 (1989); Byrne v. SCM Corp., 182 Ill.App.3d 523, 131 Ill.Dec. 421, 538 N.E.2d 796 (1989); Seibel v. Symons Corp., 221 N.W.2d 50 (N.D. 1974); Glittenburg v. Wilcenski, 174 Mich.App. 321, 435 N.W.2d 480 (1989); and Binder v. Jones \u0026 Laughlin Steel Corp., 360 Pa.Super. 390, 520 A.2d 863 (1987). Of interest is Hiigel v. General Motors Corp., 190 Colo. 57, 544 P.2d 983 (1975), where negligent failure to warn justified recovery of cost of product destroyed, but not commercial or business losses; Hill v. Air Shields, Inc., 721 S.W.2d 112, 119 (Mo.App.1986), where it was recognized: \"Admittedly, if there is no warning, the manufacturer may reasonably assume that the user will neither read nor heed it.\"; Restatement (Second) of Torts, supra, § 388; and Wade, On the Nature of Strict Tort Liability for Products, 44 Miss. L.J. 825, 842 (1973). See Lambert, Tom on Torts, 32 ATLA Law Rep. 228, 235 (1989) and Annotation, Latent Danger Incident to Article Sold, 86 A.L.R. 947 (1933). See also Talmadge, Washington's Product Liability Act, 5 U. Puget Sound L. Rev. 1 (1981) which discusses the Washington statute where a specified post-manufacture duty to warn provision was also included in the statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The Tenth Circuit Court of Appeals panel on rehearing added as a pertinent subject of review for this case: The petition for rehearing has not convinced us that we should revise our opinion and require that any duty to warn claim be based solely on negligence principles. Moreover, under Rule 18, Fed.R.Civ.P., \"A defendant cannot compel a plaintiff to choose at his peril the theory upon which he intends to rely and thereby possibly defeat a recovery where two consistent, concurrent or cumulative theories can be urged without prejudice to the defendant's ability to defend:\" Senter v. B E Goodrich Company, 127 F.Supp. 705, 707-708 (D.Colo.1954); see also Rule 318(a), Colorado Rules of County Court Civil Procedure (1970) (adopting Federal Rule 18 on joinder of independent or alternate claims); Fumer, Products Liability § 16.02[l] at 16111, 16-112 (doctrine of election remedies has no place in products liability area as plaintiff should be allowed to submit to the jury all claims on which there is sufficient evidence). There is no evidence of prejudice here. On remand, the plaintiff may pursue duty to warn claims under both negligence and strict liability in tort theories. Florom, 879 F.2d at 803. See likewise in tort theory pleading, Printing Mart-Morristown, 116 N.J. 739, 563 A.2d 31.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. An issue of unknown user duty to warn inquiry is not presented in this case because the sales transaction was between Page and Bridger Coal. Tate v. Robbins \u0026 Myers, Inc., 790 F.2d 10 (1st Cir.1986). A continued business relationship existed here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. As William James said, the truth of an idea is not a stagnant property inherent in it. Truth happens to an idea. It becomes true. It is made true by events. Its verity is, in fact, an event, a process. The process namely of verifying itself is verification. Its validity is the process of its validation. Here, the duty to warn speaks to practical and moral desirability of avoided harm. To know is to have an intelligible choice. To deny knowledge is to withhold both intelligence and choice. The duty to warn as a moralistic responsibility is not limited to continued use of a dangerous product. By legend in the old west, it was called putting caution before foolhardy courage or, if you do it, that may be the last mistake you will ever make.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Caterpillar Tractor Company is a frequent visitor to these industrial product liability cases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Compare the defective milking machines where there was only economic damage in Mulholland, 443 N.W.2d 340, where this preclusive issue was not even considered in the first series of appeals.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See Bland \u0026 Wattson, Property Damage Caused by Defective Products: What Losses are Recoverable? 9 Wm. Mitchell L. Rev. 1, 4-5 (1983) (footnote omitted), which states: The line between non-recoverable economic loss and recoverable property damage is not easy to draw. The courts have had difficulty defining \"economic loss\" in a manner which preserves the warranty concepts embodied in the Uniform Commercial Code as well as the tort concepts of negligence and strict liability. To classify a certain type of loss as \"economic,,\" however, is to predetermine its recoverability in negligence or strict liability. It is the central strain of this dissent that adjudicatory deliberation is in many cases first made as to recoverability and then the curse of economic damage is thrown at the opinion to justify the predetermined denial. A large majority of economic loss denial cases involve direct property damage and not economic loss within any realistic definition of terms to determine. It is interesting to note that those authors state \"Texas is the only state to expressly refuse to allow recovery of damages for injury to the product itself, even if the injury results from an unreasonably dangerous defect in the product.\" Id. at 14. They then state \"[t]he law of Minnesota is unclear as to the recoverability of damages for an injury to the product itself.\" Id. at 16. See, however, the definition in Note, Economic Loss in Products Liability Jurisprudence, 66 Colum. L.Rev. 917, 918 (1966) (quoting from Fentress v. Van Etta Motors, 157 Cal.App.2d Supp. 863, 866, 323 P.2d 227, 229 (1958)) (footnotes omitted): Property damage is usually readily distinguishable from economic loss. For example, operation of a defective radiator causes property damage when it results in a fire which destroys the plaintiffs store and economic harm when it results in conditions so uncomfortable that it causes the loss of customer patronage. At times, however, the distinction may be more difficult to draw. If A manufactures paste which it sells to B who uses it to cement shoes which he sells to C, a failure of the paste to properly adhere causes economic loss if it does not physically damage the shoes but merely renders them unsaleable; on the other hand, a defect in the paste which physically damages the shoes causes property loss. If the damage is to the defective product itself, similar distinctions must be drawn. When the defect causes an accident \"involving some violence or collision with external objects;\" the resulting loss is treated as property damage. On the other hand, when the damage to the product results from deterioration, internal breakage, or other non-accidental causes, it is treated as economic loss. It is also important to distinguish between \"direct\" and \"consequential\" economic loss. Direct economic loss may be said to encompass damage based on insufficient product value; thus, direct economic loss may be \"out of pocket\"--the difference in value between what is given and received-or \"loss of bargain\"-the difference between the value of what is received and its value as represented. Direct economic loss also may be measured by costs of replacement and repair. Consequential economic loss includes all indirect loss, such as loss of profits resulting from inability to make use of the defective product. A somewhat different definitional approach is stated in Note, Products Liability: Expanding the Property Damage Exception in Pure Economic Loss Cases, 54 Chi-Kent L. Rev. 963 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. \"[N]o precise distinction can be made between property damage and economic loss.\" Ribstein, Guidelines for Deciding Product Economic Loss Cases, 29 Mercer L. Rev. 493, 511 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Conversely defined, the author in Comment, supra, 4 Seton Hall L. Rev. at 154-55 (emphasis added and footnote omitted) states: Purely economic losses may be classified into two basic categories: direct economic losses and indirect or consequential economic losses. A direct economic loss includes a diminution in the value of the product as measured by the difference between the purchase price or value of the product as represented to the purchaser and the value of the product after discovery of the defect. This type of direct economic loss is known as a loss of bargain. A direct economic loss also includes whatever repair costs may be incurred in repairing the defective product and any direct incidental expenditures which may be incurred in replacing a defective product which cannot be repaired. On the other hand, indirect or consequential economic losses include both losses of future business profits and business opportunities. Such losses are commonly referred to as expectation losses. Consequential economic losses also include any indirect loss resulting from the consumer's inability to secure an effective cover or replacement for the defective product. It is noted the author concluded \"the manufacturer should generally be held liable for the full extent of [what he classified as] direct economic loss:\" Id. at 182. The genius of the common law lies in its ability, when presented with a new problem, to provide a remedy and, thereafter, to find or to develop a legal theory to justify it. When the problems of direct and consequential economic loss were first seriously proposed as compensable injuries, the courts had difficulty finding an acceptable legal basis upon which to justify recovery. As a result, sympathetic courts were forced to justify recovery upon that old standby, public policy, and numerous other legal fictions. This ad hoc approach has developed into a hopeless morass of conflicting legal rationales and theories of recovery. Id. at 183 (footnote omitted). See likewise Note, supra, 54 Chi-Kent L. Rev. 963 with the broad expansive rule then confined by a consumer expectation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. This analysis attunes to the direction of some cases in analysis parallel with East River SS Corp., 476 U.S. 858, 106 S.Ct. at 2295 that the character of the buyer and his purpose of using may determine compensability in any particular case. The arbitrary differentiation of users into either a commercial or consumer buyer as the test of providing litigative protection is, in itself, an interesting due process and equal protection inquiry not pursued here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The recovery denial cases provide another incongruity which results from using justification in East River to create a rule for application. It is stated \"in commercial settings when there is no large disparity in bargaining power, economic losses from a product injuring itself cannot be recovered in actions for strict products liability or negligence in manufacture or failure to warn.\" Utah Intern, Inc., 775 P.2d at 745. Consequently, this adaptation adds two additional factors to the rule. First, the principle is limited to commercial transactions, whatever that means, and to equals in bargaining power, however that is to be judged or computed. How this rule is to be differently applied to the leaking fuel pump that burns up the car, house and maybe the owner as compared to the commercial trucker where the truck, the garage and perhaps the driver are similarly at risk is not logically established. Cf. Nicor Supply Ship Assoc., 876 F.2d 501.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. A well-cited review, Note, Privity Revisited: Tort Recovery by a Commercial Buyer for a Defective Product's Self-Inflicted Damage, 84 Mich.L.Rev. 517, 521 (1985), finds within the cases \"four different approaches to determining whether a tort recovery is available for a product's self-inflicted damages.\" That author states: 1. Deny recovery for a defective product's self-inflicted damages for the reason that economic loss is coincidental with physical damage. Note, supra, 84 Mich.L.Rev. at 521 (citing Mid Continent Aircraft Corp. v. Curry County Spraying Service, Inc., 572 S.W.2d 308 (Tex.1978)). See, however, Note, Torts-Strict Product Liability-Strict Liability in Tort Allows Recovery for Physical Harm to the Product Itself Unless Parties of Equal Bargaining Strength Expressly Waive Tort Liability. Mid Continent Aircraft Corp. v. Curry County Spraying Service, Inc., 553 S.W.2d 935 (Tex.Civ.App.-Amarillo 1977, writ granted), 9 Tex.Tech L.Rev. 733 (1978). 2. \"[T]he fact that a defective product's self-inflicted damage is coincident with economic loss does not make it any the less physical damage,\" and, consequently, recovery is justified in tort. Note, supra, 84 Mich.L.Rev. at 521 (citing Santor v. A \u0026 M Karagheusian, Inc., 44 N.J. 52, 207 A.2d 305 (1965)). 3. The third rule stated is: \"Not surprisingly, a majority of courts have turned to a third approach, based upon the landmark decision of Seely v. White Motor Co., [63 Cal.2d 9, 45 Cal.Rptr. 17, 403 P.2d 145 (1965) ]. The Seely court reasoned that a requirement for the imposition of strict tort liability is the existence of an unreasonably dangerous defect, so that only contractual remedies should be available for ordinary qualitative defects.\" Note, supra, 84 Mich.L.Rev. at 522 (footnote omitted). (The author is dead wrong in analysis of Seely, but the statement is clearly applicable to Washington Water Power Co. v. Graybar Elec. Co., 112 Wash.2d 847, 774 P.2d 1199, amended 779 P.2d 697 (1989).) 4. The fourth approach turns to contract law and introduces as a key factor the existence of privity. Note, supra, 84 Mich.L.Rev. at 523. Realistically, few cases are confirmable in result by use of this definitional analysis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Confusion still remains as to what constitutes the defined economic damage for which the rules will be applied. The subject of a proper definition of economic damage will be considered in the fifth major segment of this dissent regarding \"Other Property.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. There are a line of cases where dangerousness is absent that apply the rule of no recovery for economic loss unless contractual provisions would allow such recovery. These are the contra-Santor cases. See Note, Manufacturers' Liability to Remote Purchasers for \"Economic Loss\" Damages-Tort or Contract? 114 U.Pa.L.Rev. 539 (1966). Cf. Wade, Tort Liability for Products Causing Physical Injury and Article 2 of the U.C.C., 48 Mo.L.Rev. 1 (1983) where, without unreasonable dangerousness, the buyer cannot achieve the benefit of his anticipated bargain by any non-contractual theory. This is the \"damned poor product, so what?\" application of law to the American industrial product arising from the generation of greed and the era of irresponsibility. See Hart Engineering 'Co. v. FMC Corp., 593 F.Supp 1471, 1483 (D.R.I.1984), where that court stated:: There is no parallel rationale, however, for extending this special prophylaxsis to provide relief for mere disappointment in product performance. In such circumstances, the same imbalance is not present; and the need for an expansive rendering of legal rights and remedies is considerably less. As the Purvis [Purvis v. Consolidated Energy Products Co., 674 F.2d 217, 222-23 (4th Cir.1982)] court remarked: All products carry the risk that they will serve their intended function poorly. In this sense, the risk of \"ordinary\" malfunctions is well within the contemplation of the average purchaser. The author then quotes from Jones \u0026 Laughlin Steel Corp. v. Johns-Manville Sales Corp., 626 F.2d 280, 288-89 (3rd Cir.1980): [T]he Third Circuit phrased the ratio decidendi for the rules as follows: The rationale behind strict liability in personal injury situations is not well-suited to claims alleging only economic loss. Economic loss results from the failure of the product to perform to the level expected by the buyer and the seller. Such loss is most frequently measured by the cost of repairing the infirmity or by the difference in the value of the product as it exists and the value it would have had if it performed as expected. Thus, economic loss is almost always incurred by the owner of the product, not by persons who merely use it or come into contact with it. Hart Engineering Co., 593 F.Supp. at 1483. In sum, the better rule seems undeniably, to be that the law of contracts is the vehicle of choice to redress a purchaser's unrequited expectations of product efficacy, at least where (as here) the parties are in privity of contract and have had ample opportunity to allocate the risks involved. In those regrettable instances where the product turns sour and proves to be a lemon, dulcification should flow from the terms of the bargain, not from the vagaries of negligence law. To permit recovery of purely economic losses in such circumstances would, unless by happy coincidence such recovery was consistent with the agreement between the contracting parties, undermine the very foundations upon which business transactions have historically been built. Thus, to couple product disappointment with traditional notions of tort recoupment in such a context would be to mix matter and anti-matter; the resultant amalgam would be much too volatile to make sense in a commercial setting. Id at 1484. The sewer sludge pump did not perform. Richard O'Brien Companies v. Challenge-Cook Bros., Inc., 672 F.Supp. 466 (D.Colo. 1987) (the concrete pumps did not perform); Copiers Typewriters Calculators, Inc. v. Toshiba Corp., 576 F.Supp. 312 (D.Md.1983) (the photocopiers did not reproduce); Frey Dairy, 680 F.Supp. 253 (the feed silos worked improperly); Allen v. Toshiba Corp., 599 F.Supp. 381 (D.N.M. 1984) (the photocopiers did not reproduce); Anglo Eastern Bulkships, Ltd. v. Ameron, Inc., 556 F.Supp. 1198 (S.D.N.Y.1982) (the tank coating did not protect the ship container facilities); Cincinnati Gas \u0026 Elec. Co. v. General Elec. Co., 656 F.Supp. 49 (S.D.Ohio 1986) (the nuclear plant material could not handle temperatures and forces involved); Argo Welded Products, Inc. v. IT. Ryerson Steel \u0026 Sons, Inc., 528 F.Supp. 583 (E.D.Pa.1981) (the steel did not meet fabrication requirements); Klo-Zik Co. v. General Motors Corp., 677 F.Supp. 499 (E.D.Tex. 1987) (the truck motors did not perform); and Roxalana Hills, Ltd. v. Masonite Corp., 627 F.Supp. 1194 (S.D.W.Va.1986), aff'd a' 813 F.2d 1228 (4th Cir.1987) (the stucco did not last in West Virginia weather). We can set aside, for the purpose of this drag line collapse, those industry failure cases since. immediate catastrophic events here did directly threaten greater damage where product failure put other property or life at risk.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See Note, supra, 9 Tex.Tech.L.Rev. 733 and Note, Products Liability in Commercial Transactions, 60 Minn.L.Rev. 1061 (1976). See also Note, supra, 84 Mich.L.Rev. 517.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Significant federal case law supports tort remedies for unreasonable danger. Product damage cases are the moderate majority posture. See, as examples, Dixon v. International Harvester Co., 754 F.2d 573 (5th Cir. 1985); Two Rivers Co. v. Curtiss Breeding Service, 624 F.2d 1242, reh'g denied 629 F.2d 1350 (5th Cir.1980), cert. denied 450 U.S. 920, 101 S.Ct. 1368, 67 L.Ed.2d 348 (1981) (defective bull semen); and Texsun Feed Yards, Inc. v. Ralston Purina Co., 447 F.2d 660 (5th Cir.1971) (Texas law applied to weight gain of product-fed cattle).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. During a period in which the law is constantly expanding to protect new interests, the loudest debate is too often between those advocating no change at all and those demanding substantial revision of the legal fabric; too often ignored are the narrow distinctions of degree which make the law rational and coherent. Yet in the area of economic loss no fruitful inquiry is possible without close consideration of underlying factors which do, in fact, dictate the drawing of fine distinctions. Hopefully, in deciding whether to expand manufacturer's liability to encompass economic loss, courts will not reach results by inadvertence, but instead will focus on the policies to be furthered by each decision. Note, supra, 66 Colum.L.Rev. at 966.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The commercial enterprise justification or limitation is the most confusing and logically irrational factor of East River. If a product is dangerous, it will be dangerous to people even if purchased by large corporations. How can a rule be properly injected between one of the few remaining American (or more prevalent foreign) manufacturers and a mom and pop small business corporation or the family farmer? The thesis of justified dangerousness in commercial activity as an acceptable risk lacks any conceivable logic. It is here the inquiry of whether there is a tort without damage or lacking remedy is jost visibly presented. The factual and principled justification for East River rests with the character of seller-buyer relationship, but case application tends to suggest that the justification may be disregarded and the concept applied even if either a \"consumer\" transaction exists or the bargainers are not equal in economic muscle.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. In academic analysis, the economic damage case law, decisions and discussion line up in the following array of concepts. Uniformity of result does not exist and little consistency to decision can be perceived. California law, as discussed infra, probably does not fall within any of these categories as apparently applying a particularized contract approach. 1. Santor-economic damage recoverable in tort including obsolescence and wear out. Generally abandoned concept. 2. No unreasonable danger or catastrophic event failure. Relief confined to contract. This includes obsolescence, wear out and insufficiencies of performance cases. The predominate rule denies tort recovery by general citation of the California case of Seely, 403 P.2d 145. 3. Unreasonable dangerousness and/or catastrophic event failure. This, as the case at hand in majority perspective, permits recovery for economic damages. This is the Cloud v. Kit Mfg. Co., 563 P.2d 248 (Alaska 1977); Washington Water Power Co., 774 P.2d 1199; and Star Furniture Co. v. Pulaski Furniture Co., 297 S.E.2d 854 (W.Va.1982) liability principle. 4. East River totally applied. No economic damage is recoverable if damage results only to the equipment machine or entire facility of which the faulty part is a constituent part. 5. East River-commercial purchaser-bargain equal adaptation where the East River denial rule is applied but only to commercial transactions as distinguished from consumer transactions and buyer and seller are bargaining equals. Clearly, the essential issue presented here is whether the reeving block failure brings Continental into a category three standard as the majority rule or whether this court elects to adopt either the fourth or fifth East River applications. It is absolutely impossible to tell from East River and succeeding federal case law whether that finite authority is category four or five. Obviously, most admiralty cases would likely be more commercial than consumer, whatever the difference may be.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. In an even more case of curious text is the most recent case of Mulholland, 443 N.W.2d 340. The case involved what is generally classified as economic loss, but the differentiated economic loss rules were not discussed. At issue was an alleged faulty milking system supplied by the defendant. Purchaser sued for breach of warranty, negligence in design and manufacture and failure to warn. An expert witness was rejected as unqualified and a directed verdict for defendant granted on failure of Proof of casual relation between alleged faulty product and the economic damages sustained of damage to the milk herd and loss of milk production. A Michigan court of appeals decision affirmed the trial court and the Supreme Court reversed. The direct issue advised was qualification of the expert witness. It is clear in case discussion that the court, in analysis, perceived a claim was stated in tort as well as contract. The validity of the economic damage claims in tort seems to have been assumed by the discussion and decision which generally reversed the directed verdict.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. City of Greenville should have particular present pertinence to the City of Casper where a major high school was closed and school sessions put on split shift because of asbestos contamination recently discovered in the building. It may seem sometimes that jurists write for academia beyond the real world. Product liability and asbestos problems contra-indicate and demonstrate that a real world exists for opinion discussion. See, however, Comment, Asbestos in Schools and the Economic Loss Doctrine, 54 U.Chi.L.Rev. 277 (1987).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. A substituted used repair part which caused a converted aircraft engine to explode resulting in severe damage to the engine produced an interesting by-play in expression between the majority and minority in Consumers Power Co. v. Curtiss-Wright Corp., 780 F.2d 1093 (3rd Cir. 1986). The majority said: It is pure fortuity that the explosion that reduced Consumers Power's engine to scrap did not damage any person or property nearby. The defective compressor disc did not lead merely to a loss of efficiency or a decline of profits; the disc's failure caused a sudden, violent and calamitous accident which posed a serious threat to persons and property. The damage caused by the explosion is property damage, not economic loss. Id. at 1099. The dissent then said: The fortuity that personal injury or outside property damage might occur in addition to injury to the defective product does not require a different rule with respect to economic loss. To deviate from the basic rule would lead to speculation and inquiry unrelated to the negotiations between the commercial entities. Id at 1102. How fortuity is a proper concept defining an exploding motor and consequent risk to persons or property is unexplained.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. In its analysis to draw the line between contract and tort, the Arizona tribunal developed five hypotheticals to illustrate the problems addressed. In all five hypotheticals, a new LMT unit with an unreasonably dangerous and undiscovered defect was installed in the previously purchased turbines. Subsequently, the unit malfunctioned causing the losses and damage illustrated: At Plant # 1, the defect caused the LMC to malfunction at a time when the plant engineer was aloft on a catwalk inspecting one of the turbines controlled by the LMC. The force of the resulting explosion (accident) knocked the engineer to the floor, injuring him. At Plant # 2, the same malfunction affected only one turbine, which accidentally caught on fire and was completely destroyed. At Plant # 3, the defect caused the LMC to malfunction and burn. The fire department responded quickly, so none of the turbines or other property located near the LMC was damaged in the accident. At Plant # 4, the plant engineer discovered the defect in the LMC and was able to shut down the turbines and replace the LMC before any damage occurred. However, the LMC replacement cost to [plaintiff] is $50,000, including shutdown, start-up and testing costs. At Plant # 5, during a peak demand period, the LMC malfunctioned and failed to start all four of the gas turbines. The plant was down for twenty-four hours. As a result, [plaintiff] could not deliver electricity to its numerous commercial and residential users. [Plaintiff] not only lost all the profits anticipated from the sales to those consumers but must replace the LMC and faces lawsuits by some of its large commercial users. Salt River Project Agr. Imp. and Power Dist., 694 P.2d at 208. From the illustration, the court found unanimous authority that the damages at plant one and plant two were recoverable, a split of authority in plant three determined by the unreasonably dangerousness rule in application or rejection, and a majority rule for denial of economic losses in plants four and five. The turbine in Salt River Project Agr. Imp. and Power Dist. and the reeving block in Continental have identical placements within the hypotheticals as a plant three occurrence dependent on definition of \"other property.\" Project Agr. Imp. and Power Dist then explored a further contention which apparently arises here of possible denial of tort remedy to a commercial user. The court found no justified reason for commercial user-consumer differentiation in right of tort remedy access.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The court in Aloe Coal Co., 816 F.2d at 119 (quoting East River S.S. Corp., 106 S.Ct. at 2303), in making its \"studied conclusion\" or more accurately an \"educated guess,\" related that \"[i]n our present analysis, a murky trudge through sophisticated nuances gives way to an unencumbered flight to basics. Damage to a product means simply that the customer has received 'insufficient product value.\"' That court also related \"[w]e recognize that our conclusion may not be considered congruent with two recent cases in the Pennsylvania intermediate appellate court. * * * These pronouncements have made our task more uncertain than it otherwise would be, yet do not dissuade us from our ultimate conclusion\" in review of Industrial Uniform Rental Co., Inc., 463 A.2d 1085, which embraced Pennsylvania Glass Sand Corp., 652 F.2d 1165 and Johnson v. General Motors Corp., 349 Pa.Super. 147, 502 A.2d 1317 (1986), overruled sub nom. REM Coal Co., Inc. v. Clark Equipment Co., 563 A.2d 128 (Pa.Super.1989). Aloe Coal Co., 816 F.2d at 118. See likewise King v. Hilton-Davis, 855 F.2d 1047 (3rd Cir. 1988), cert. denied - U.S. -, 109 S.Ct. 839, 102 L.Ed.2d 971 (1989). While this dissent was in preparation for publication, the Superior Court of Pennsylvania released REM Coal Co., Inc. v. Clark Equipment Co., 563 A.2d 128 (Pa. Super.1989). REM Coal Co., Inc. follows Aloe Coal Co., 816 F.2d 110 in intermediate court reversal of Johnson, 502 A.2d 1317 and Industrial Uniform Rental Co., Inc., 463 A.2d 1085. Pennsylvania law will probably remain unsettled in historical progression until the supreme court of that state determines whether and how far it will follow East River or follow the persuasion of the lead cases from Alaska, Washington and West Virginia in considering dangerousness and sudden catastrophe, e.g., Washington Water Power Co., 774 P.2d 1199; Cloud, 563 P.2d 248; and Star Furniture Co., 297 S.E.2d 854.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. In East River S.S. Corp., 476 U.S. at 869 n. 4, 106 S.Ct. at 2301 n. 4, the United States Supreme Court took notice of the New Jersey and California developments: Interestingly, the New Jersey and California Supreme Courts have each taken what appears to be a step in the direction of the other since Santor and Seely. In Spring Motors Distributors, Inc. v. Ford Motor Co., 98 N.J., at 579, 489 A.2d, at 672, the New Jersey court rejected Santor in the commercial context. And in J'Aire Corp. v. Gregory, 24 Cal.3d 799, 157 Cal.Rptr. 407, 598 P.2d 60 (1979), the California court recognized a cause of action for negligent interference with prospective economic advantage.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. There are a significant number of cases where denied recovery of economic damages were either clearly within the unachieved benefit of the bargain classification or exceptional dangerousness did not exist or was never considered by the litigants or appellate court. Twin Disc, Inc. v. Big Bud Tractor, Inc., 772 F.2d 1329 (7th Cir.1985) (Wisconsin law); Purvis v. Consolidated Energy Products Co., 674 F.2d 217 (4th Cir.1982) (diversity case, South Carolina law); S.M. Wilson \u0026 Co., 587 F.2d 1363 (California law, diversity case); Posttape Associates, 537 F.2d 751 (law of Pennsylvania, diversity case); Hart Engineering Co., 593 F.Supp. 1471; Arrow Leasing Corp., 666 P.2d 544; Sacramento Regional Transit Dist. v. Flxible, 158 Cal.App.3d 289, 204 Cal.Rptr. 736 (1984); Kaiser Steel Corp., 127 Cal.Rptr. 838; Florida Power \u0026 Light Co., 510 So.2d 899; Clark v. International Harvester Co., 99 Idaho 326, 581 P.2d 784 (1978); Alfred N. Koplin \u0026 Co., Inc. v. Chrysler Corp., 49 Ill.App.3d 194, 7 Ill.Dec. 113, 364 N.E.2d 100 (1977); Prairie Production, Inc. v. Agchem Division-Pennwalt Corp., 514 N.E.2d 1299 (Ind.App.1987); McGhee, 296 N.W.2d 286; Clevenger and Wright Co., 625 S.W.2d 906; Hagert v. Hatton Commodities, Inc., 350 N.W.2d 591 (N.D.1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. A number of cases provide an easy factual answer to the defective product causing damage to other property categorization. Hales v. Green Colonial, Inc., 490 F.2d 1015 (8th Cir.1974) (defective heater burned up building); Largoza, 538 F.Supp. 1164 (refrigerator caught fire and burned up house); Romano, 336 A.2d 555 (television set exploded and set fire to the house). Not so clearly identified was the concrete mixer that fell off of the truck chassis and caused damage to both the chassis and mixer. A successful claim was made for recovery under negligence for all damage. United States Fidelity \u0026' Guar. Co. v. Truck \u0026 Concrete Equipment Co., 21 Ohio St.2d 244, 257 N.E.2d 380 (1970). See also Fondyce Concrete, Inc. v. Mack Trucks, Inc., 535 F.Supp. 118 (D.Kan.1982) and Wulff, 498 P.2d 766. The differentiation of recoverability is between the bucket on the drag line and the wheelbarrow on the ground if destroyed when the reeving block disintegrates. See Firestone Tire \u0026 Rubber Co. v. Hall, 152 Ga.App. 560, 263 S.E.2d 449 (1979) (defective tire destroyed truck).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Miller Industries, 733 F.2d 813 and McConnell, 646 F.Supp. 1520 were consequently inapplicable as a matter of presented evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Otherwise, we fail to: Rather than contribute yet another unexplained and unreasoned decision to the economic loss pile, the court could instead carefully consider the problems of definition and commercial transactions. The court could base its decision on a carefully articulated argument that the public policy which supports strict liability does or does not extend to economic loss. Comment, supra, 34 S.D.L.Rev. at 136. 1 would hope with that author for \"something better.\"\u003c/span\u003e\n\n",
    "body_length": 187691,
    "citedas": [
      "783 P.2d 641"
    ],
    "attorneys": "Vincent J. Horn, Jr., Cheyenne, and Larry D. Henson, Henson \u0026 Henson,San Francisco, Cal., for appellants. Gary M. Greenhalgh, Greenhalgh, Bussart, West \u0026 Rosetti, Rock Springs,and John H. Anderson, Seyfarth, Shaw, Fairweather \u0026 Geraldson, Chicago,Ill., for appellees.",
    "category": [
      "8",
      "242",
      "252",
      "184"
    ],
    "judges": "Before Cardine, C.J., Thomas, Urbigkit, and Macy, JJ., and Brown, J.,Retired.",
    "citation_count": 4
  }
}
