{
  "id": "WK3XSmYBTlTomsSBPZmm",
  "document": {
    "title": "Territory of Hawaii v. Crowley",
    "full_title": "TERRITORY OF HAWAII v. LEO F. CROWLEY; TERRITORY OF HAWAII V. HAWAII SENTINEL PUBLISHING COMPANY, LIMITED",
    "jurisdiction": "Hawaii Supreme Court",
    "date": "1939-02-04T00:00:00.000Z",
    "docket": "Nos. 2371, 2372",
    "body": "OPINION OF THE COURT BY CIRCUIT JUDGE CRISTY. (Peters, J., dissenting.)\n\nThese cases are on writ of error from convictions of plaintiffs in error for publishing in a weekly paper a criminal libel. Separate informations were filed against the Hawaii Sentinel Publishing Company, Limited, an Hawaiian corporation, as owner and publisher of \"The Hawaii Sentinel\" and against Leo F. Crowley as editor and author of the article complained of. The two cases were, by stipulation of the parties, tried together in the circuit court.\n\nBoth defendants were convicted and separately prosecuted error. The cases were consolidated in this court.\n\nSection 6050, chapter 196, R. L. 1935, defines libel as \"a publication in writing, print, or * * * other than by words merely spoken, which directly tends to injure the fame, reputation or good name of another person, and bring him into disgrace, abhorrence, odium, hatred, contempt or ridicule, or to cause him to be excluded from society.\" (Emphasis added.) This statute has existed in Hawaii without amendment since the Penal Code of 1869.\n\nThe printed article in question was in the form of a front page \"editorial.\" Its essential features are emphasized in the marginal quotation (omitting names, there being no dispute as to identity of \"blank\").\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e It needs no lengthy citation of authority to demonstrate that the above editorial article, in its entirety and as illustrated by the indicated assertions (claimed to be comment on the past event of a strike settlement on one of the private sugar plantations on the Island of Maui), invents an opportunity to make a vicious personal attack on the character, motives and integrity of one individual who at the time was engaged as a private citizen in a private commercial enterprise. This article comes directly within the definition\n\nof criminal libel as set out in section 6050, above quoted.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nUnder the cited authorities, where the article, as published, is libelous per se, the complaint containing it is good against demurrer.\n\nSection 6052 provides: \"The making of a libel is the writing, printing, devising, or in any way forming the same; or aiding or assisting therein, with the intent in any case that it shall be published.\" Penal Code, 1869. And section 6053 provides: \"The publishing of a libel is the maliciously putting of it into circulation, or the promulgating, exhibiting or distributing of it for the purpose of making it known to others; and thereby in fact making it known to others; or aiding or assisting therein, or the causing or promoting thereof.\"\n\nAt the trial it was proved by extrinsic evidence and defendant-appellant Crowley admitted that he was editor and acting manager of the defendant corporation and did in fact knowingly participate in preparing the article for printing, publishing and circulation as acting editorial manager of the other defendant corporation and that the article was intentionally printed, published and widely circulated under his direction in the weekly paper owned and operated by defendants.\n\nSection 6054 further provides: \"Malice is shown, in respect of libel, by making a publication or communicating it to others, wilfully and purposely to the prejudice and\n\ninjury of another. Hatred or ill will towards the party injured is not essential to libel.\" (Emphasis added.) Hence, the \"malice\" required in connection with \"malicious publication\" is legal malice, which means merely the \"intent to publish.\" (See note in 19 A. L. R. 1485.)\n\nUnder the admissions of defendant-appellants, the making and publishing of the above article, which was libelous per se, was therefore not in issue, and legal malice was inherent in the defendants' admissions of willful and purposive publication and circulation. Hence, all instructions on presumptions of innocence and reasonable doubt relative to the defendants as perpetrators of the libel were surplusage.\n\nThe only possible issue left in the case under the record of the trial involves the application of section 6055. This provides in a criminal prosecution something analogous to the issue of a plea of justification in civil libel. It reads: \"Truth as defense. In every prosecution for writing or publishing a libel, the defendant may give in evidence in his defense upon the trial the truth of the matter contained in the publication charged to be libelous; provided, however, that such evidence shall not be deemed a justification, unless it shall be further made to appear on the trial that the matter was published with good motives and for justifiable ends.\" (Emphasis added.) Obviously, the attempt to take advantage of such a statute, in effect, operates as a confession and avoidance.\n\nIt might be well to inspect this section a little more closely. It is simply put. It needs no distortion to support preconceived notions. It starts out quite simply and directly: \"In every prosecution for * * * libel, the defendant may give in evidence * * * upon the trial the truth.\" This is the grant of a clear right to the defendant to offer legal\n\nevidence, the purpose of which is to support an attempt to show the truth of the statements he has made, as the preliminary foundation for a grant of immunity from the natural consequence of a use of defamation. Implicit in this first approach of a trial right, a procedural right, the trial court is obligated to permit the introduction of any otherwise legal evidence offered clearly for such a purpose. Given such evidence to prove truth, prima facie, then it may also, in the very truth and the occasion for it, contain elements bearing on good motives and justifiable ends. But if no evidence to support the truth of substantial parts of the libelous charges is in the case when defendants cease their efforts to \"give in evidence * * * the truth,\" what then? And if under any rational view of the concept of the \"truth of a fact\" there is not even a scintilla of evidence which would justify a reasonable man to say \"the truth of the defamatory assertions prima facie appears from these facts,\" what then?\n\nIt is well to note that the statute only speaks of \"good motives and justifiable ends\" at the end thereof, where the question is finally reached as to what use is to be made of any such evidence, if the truth might reasonably appear, as to whether and when even the truth will justify acquittal from responsibility. Even if the defendant should take advantage of the privilege \"to give in evidence * * * the truth,\" yet \" such evidence shall not be deemed a justification, unless * * *.\" This is the order of the statute. Why distort it? It presupposes that in the trial, some substantial evidence of truth has been offered and received. It says simply and plainly: \" provided, however, that such evidence * * *.\" And then the section goes on to define a further requirement and necessity before even the truth can bar conviction for the offense.\n\nWhere the defamatory assertions are false, honest mistake of fact is immaterial.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nAt common law, truth was no defense to criminal prosecution for libel.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Hence, logically we start out, in applying this statutory \" justification \" in the instant case with the existence of an article that is a libel per se, that has been admittedly published, willfully and purposely, therefore legally malicious. Or, in other words, in the case at bar the statutory offense of criminal libel is admitted and conviction necessarily follows from such admissions unless the defendants show a legal justification created by section 6055, to wit: (1) the truth and further (2) \"that the matter was published [a] with good motives and [b] for justifiable ends.\"\n\nThis at once raises the question: What is meant in law by \"a justification\"? There is a clear distinction between a \"legal justification\" and a \"legal excuse.\" In connection with a \"justification\" the benefit under consideration runs to the State or to the social community as a whole. In such a case the question arises as to whether or not the specific wrong done to an individual is offset or nullified by facts of a greater benefit to society as a whole, so that it becomes of greater moment to society as a whole that a particular instance be condoned if the defendant shows that it happened under the statutory conditions of privilege, whereas a \"legal excuse\" such as self-defense recognizes the benefit passing directly to the individual for his personal self-protection.\n\nThe field of criminal libel illustrates the concept of \"justification\" very well. At common law truth of defamatory publications was no defense at all to prosecution and\n\npunishment. The theory is obvious that prosecution by the State was preferable to violent retribution by the injured party or his friends.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Then the recognition grew that society might be interested in the truth about the facts involving the acts of public officials or candidates for public office, however damaging, if published in good faith under circumstances recognized in law as privileged occasions. This was extended to protect fair comment as to acts really provable in matters where in fact a public interest really existed, but did not recognize as \"legally justifiable\" venomous attacks on the personal integrity or character of either public or private individuals.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nIn other words, the subject of a \"plea of justification,\" as it had grown up in the civil law, was gradually brought over by variously worded statutes as a grant of a privilege to nullify and avoid criminal responsibility and was offered to defendants, otherwise guilty, who themselves might show affirmatively that what they published as fact was (1) true; (2) was published with \"good motives\" and (3) for \"justifiable ends.\" The latter, also, related to benefits to society at large. If the triers of the fact, representing society, found that a defendant came within these three barriers to the \"place of refuge\" they could stay the punishment.\n\nIn the case at bar error is assigned to the giving of instructions over the objections of the defendants relating to this defense. This centers about the giving of prosecution's instruction number 3: \"You are instructed that the burden is on the Territory in these cases to prove beyond\n\na reasonable doubt that defendants (or either of them) published, or aided in the publication of, a libelous article as charged; but once such publication is proved to your satisfaction beyond a reasonable doubt, the burden is thereafter upon such defendant or defendants to prove to your satisfaction, by a preponderance of the evidence, that the charges of lying and deceit contained in the article were, at the time of its publication, true and, further, that they were published with good motives and for justifiable ends.\"\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nLet it be remembered that the article is libelous per se and that its intentional publication by the defendants was admitted. The identity of the victim was undisputed. There was no request for, nor did the court give, any instruction\n\ncharacterizing \"preponderance of evidence\" for creating a belief in the truth of the assertions of base motives and perfidious conduct laid out in the article. Hence, as a practical matter under instruction number 3 and the marginal instructions the jury were left to find their own standards of \"belief.\" They were told in other instructions that the credibility of the witnesses and the weight to be given their testimony was within their exclusive province. However, let us deal with the question raised by the last part of instruction number 3. Is it really erroneous as a matter of law?\n\nBefore proceeding, however, notice must be taken of a trap to the unwary that exists if the search for authorities on this issue is carelessly done. Counsel for the Territory have called attention to the existence of this trap. In many jurisdictions, the very definition of a criminal libel characterizes it as the publication of \" false and defamatory\" matter.\n\nObviously, the prosecution which starts from such a necessary preliminary ingredient is under the burden from the outset and throughout its case to prove beyond a reasonable doubt that the article is in fact false. In such cases and under such statutes a failure on the part of the prosecution to produce some evidence of actual falsity might even lead to a directed verdict for the defendant. Under such a statute, defining what is a libel, obviously the language of instruction number 3 would be erroneous. Cases from such jurisdictions are cited in the margin.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e In such a\n\ncase any evidence, raising a reasonable doubt as to whether the assertions were true or false, would go to the essence of the crime.\n\nHence, not only must such cases be eliminated from consideration at the outset, but also care must be taken that the manner of argument and approach contained in them does not impel one into a fallacious form of analysis. A discussion of \"legal malice\" and \"actual malice\" can easily lead to such a result. One can get into concepts there, as a result of which one really arrives at supplying unconsciously into the statute itself a thought as if the word \"falsity\" really were in the statutory definition of libel itself. A construction, amounting to placing the burden on the prosecution to rebut truth beyond a reasonable doubt, amounts to reading into the statutory definition of libel that the defamation must be \"false.\" That is not our statute. Proof of truth and good motives and justifiable ends is, in Hawaii, a grant of a privilege of immunity to persons who themselves prove to the trier of the facts that they are entitled to such treatment by the community whose citizen they have attacked. If the quality and effect of all the evidence bearing upon truth (whether appearing in the prosecution's case or elsewhere) preponderates in the minds of the jury, then the truth can be said by a reasonable man to\n\nhave been made to appear. If not, then the defense has failed to pass the first barrier to immunity from the consequences of an admitted defamation.\n\nIt can serve only to confuse by attempting to draw analogies to cases involving the defense of insanity. In all prosecutions for criminal acts where intentional conduct is an element, mental responsibility to harbor such an intent ab initio is a material factor. If questioned at all, the burden to establish it beyond a reasonable doubt rests upon the prosecution.\n\nBut malice in fact is not an ingredient of the statutory offense itself of criminal libel in Hawaii. It becomes a matter of inquiry only after the defense has proved truth and then has proceeded to \"make it appear\" that the offense should be condoned by affirmatively showing \"good motives\" and \"justifiable ends.\" No manner of argument ought to be indulged in to becloud this clear \"burden upon the defendant to prove,\" if the immunity from punishment is to be claimed as his right.\n\nIn the instant case that was the effect of the instructions re the statutory \"justification.\" Theoretical inconsistencies of instructions were created, if at all, by those consented to by defendants' counsel. Hence, discounting cases from jurisdictions where \"falsity\" is an ingredient of the crime itself, what do the authorities say? This justification is obviously taken bodily over from the civil plea as an enlargement of an immunity to be granted if the defendants show that (1) the publication is true; (2) that their motive was good; and (3) that the ends were justified. Mere belief in truth, though an elementary foundation in some States wherethe occasion is privileged, is not enough.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIt would seem obvious that some standard of proof\n\nknown to the law was implicit in this \"offer of immunity\" under the circumstances characterized in section 6054 above quoted. The minimum standard for accepting a fact as \"proved\" or \"made to appear\" is that the evidence in favor of the existence of the fact preponderates in quality and effect over any circumstances or evidence against it. It is difficult to follow the argument that the placing of such a minimum burden of proof on the defendants \"requires that they prove their innocence.\" Rather, they are given an opportunity to prove to a jury or other trier of the facts that, because of the truth and their good motives and the general occasion, society is more interested in their immunity from suffering the consequences of their defamation of another. If proof of any of these factors is wholly missing, the whole defense falls as a matter of law.\n\nYet, under the clear words of the statute, the defense may as of right put in evidence the truth. In the civil law truth is proved by a preponderance of the evidence. Hence, the cases relative to the right of the defendant to escape punishment use the phrase \"the burden is upon the defendant to prove \" the truth. \"The statute intended to put upon the party making the charge * * * the responsibility of making strict proof of the facts imputed.\"\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e And when a court says the \"burden of proof\" is on the defendant, it is submitted that in connection with immunity in libel cases it means the burden to prove, by a fair preponderance of credible evidence sufficient to guide one in the ordinary affairs of life.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nBut, still another element for sustaining the court below appears. A mere inspection of the portions of the article in issue in the instant case, re \"General 'Blank' Fans Far East Fires,\" which have been emphasized in the marginal note, supra, will objectively disclose the extent of proof which must be sought for in the instant record to present even a scintilla of evidence of actual conduct on the part of the victim ofthis article, justifying a reasonable person even suspecting that he was participating or had participated in base conduct creating an international tension from base motives, had dishonored his former uniform, was a lackey, was a liar, a persecutor for greed, unprincipled, seizing public power to terrorize innocent men, etc.\n\nWhat does the record in the case at bar show in connection with the right given under section 6055? \"The defendant may give in evidence in his defense upon the trial the truth of the matter contained in the publication charged to be libelous.\"\n\nDIGEST OF RECORD, RE ISSUE OF TRUTH.\n\n(1) PROSECUTION'S CASE IN CHIEF.\n\nAt the very outset of the trial the first witness called on behalf of the prosecution was the individual who was singled out as the object of attack in the article complained of. On direct examination he testified that he had served in the United States Army for forty-four and one-half years. He outlined his career up to his retirement, being then of the rank of major general. He was honorably retired within a year of the age when retirement would have been compulsory. He then became in 1935 and thereafter acted as the civilian secretary and treasurer of the Hawaiian Sugar Planters Association, a private commercial enterprise, familiarly known as the HSPA.\n\nFrom April to sometime in July, 1937, there had been a laborers' strike on some of the Maui plantations, which\n\nended about July 23, 1937, for those laborers who were satisfied with the agreement worked out in conferences between the representatives of the laborers and those of the employers, the terms of which were embodied in writing in a memorandum signed by all of the negotiators on July 15, 1937. The witness as secretary of the HSPA attended and acted in these conferences. These conferences occurred July 1, 2, 3, 6, 8, 10, 13, 14 and 15, at which time a written agreement was suggested by the strikers which was signed to settle the strike on the 15th of July, 1937.\n\nUpon cross-examination defense counsel sought to anticipate his defense of \"truth\" and asked the witness whether at any time in these conferences prior to July 15 he promised the labor leaders or told them \"as the official secretary of the H.S.P.A. that you would not prosecute certain Filipinos in a criminal indictment of conspiracy.\" The answer: \" I never did tell them any such a thing. On the contrary, I told them just what might happen. I told them I had nothing to do with the trial; that I had nothing to do with the prosecution; they had offended the Territorial law; they were in the hands of the officers of the Territory. They had been arraigned over on Maui and the jury had been assembled before I ever went to Maui. They did ask if these men went back to work what about the trial, and I told them I had nothing to do with it, but I said, I gave my opinion of why they had gone on strike. I said 'You went on strike when you were in a frenzy. You did everything that you could to pull the men out. You misrepresented the provisions of the Wagner Act; you lied to the working men; you told them that all they had to do was to demand of their employers anything they wanted and that the employers had to give it to them, because the Wagner Act said so, and that that was not the truth. In other words, you did anything you could, and while in that state of mind you kidnapped this man out of the field, tied him hand and foot, threw him in an automobile and took him to your strike headquarters. Now since we have been sitting here in many conferences and arriving at an amicable settlement of this strike I am willing to admit that you have returned to reason, and that this incident was a by-product of the strike, but while I have nothing to do with what the officers of the law may do, if you have these men back to work in a peaceful settlement on a permanent basis so that the men who have been on strike do not harass those who did not go on strike, or vice versa, but return to a happy life, I will use my utmost endeavor to see that you get leniency.' And I explained to them what leniency was, and on several occasions. The first day I made no such explanation, but the meeting after that, after I had consulted a lawyer, I said to him, 'These men will have to plead guilty or not guilty, won't they?' and he said 'There is another, one other thing they can plead, and that is nolo contendere,' and I said 'What does that mean?' and he told me, and at another meeting of these men I pointed out to them 'You can plead guilty or not guilty or nolo contendere,' and I said 'I would not ask you to plead guilty, and your lawyer Grover Johnson would not let you, and I don't think you want to plead guilty, but if you plead nolo contendere my understanding of it is,' -- and I said I didn't know about this nolo contendere until I had talked to a lawyer and asked the meaning of it of a lawyer, 'and I am explaining to you the best I can what it means, and if you plead that way it means you throw yourselves on the mercy of the court, and in my opinion you will get a suspended sentence, but I don't know.' And then I said 'I have done the best I can to explain that to you, and if you are not satisfied I will bring in a lawyer and let him explain it,' And Cabe said to me, 'General, you explain well. We understand. You do not need to bring a lawyer.'\" This explanation was given in the conferences of the 6th and 8th\n\nof July, 1937. (Tr. 20-23, 29.) The witness denied that the word \"dismissed\" was used relative to the criminal prosecution. \"I distinctly told them when they asked me, time and time again, 'Do we have to go to Honolulu?', I said 'As far as I know you do. There has been a change of venue and the court will meet over there.'\" The witness denied that the labor leaders said \"they would not settle the strike unless their criminal cases were dismissed or 'pau.'\" Referring to these labor leaders the witness said: \"They understood completely. They asked me time and time again if they had to come over here \" (meaning to Honolulu) \"and I told them 'yes.' When they came over here they came to call on me in my office and asked me if they had to go to trial, and I said 'How many times do I have to tell you that I haven't anything to do with that,' and they asked me if I would see the attorney general and have it stopped, and I told them I would not, 'How many times did I have to tell them?' and they asked me again, and I said 'What business have I to go to the attorney general and ask him; he would ask me what right I had to interfere with the course of the law.' When Verona, who was Quezon's representative, came, he told me he had heard so many things one way or the other about this trial that he would like to bring Fagel and Cabe and Damaso and Quicio up to my office, and ask me what had happened on Maui, and have me answer him in their presence, which we did.\" This happened in August.\n\nAt other places in the cross-examination the same witness said in re the pending criminal proceedings (of July, 1937), against the strikeleaders: \"It was made perfectly plain in numerous other conferences what that status was, so far as I was concerned.\" \"On the 10th, as I recall it, when we went over the various terms of the agreement, I explained to him [ Fagel ] about the trial, and asked him if he understood it, and he told me yes, and it was satisfactory * * * and I said, 'You insisted on investigations of a number of Filipino policemen on Puunene Plantation, and a number of camp bosses on Paia, and you asked me to conduct those investigations, have a trial, and listen to the complaints against these men, and I have done that. I have given you a letter signed by myself giving my findings, because you and the plantation agreed you would abide by my findings. You have that paper. What more do you want?' And they said, 'Oh,' they wanted a paper giving all the terms, so I called in a stenographer and I dictated in their presence, this statement, and I asked them if they understood it, and if it was satisfactory and they all said yes, and I told the stenographer to go out and write it and she did and brought it back, and I said 'Now, you men, I am going to read this now. I am going to read it slowly so you will all understand it. You wanted the paper,' and I did that, and they said they understood it and it was all right, and so I signed it and turned it over to Mr. Austin, and he signed it, and I handed it to them, and they backed off a little. Fagel said, 'Do you want me to sign that?' and I said 'Sure. Why not? You asked for it.' 'Why' he said, 'We have to go out and see the men about it.' I said 'What do you want to see the men about it for? You asked for a statement and said it was correct, and that is what we agreed to. Is there any correction you want to make in it?' And he said 'No, we just wanted to take it out,' and I said 'Sign it and you can take it anywhere you want to, but you can not take it out of this office until you have signed it.' They said they would not sign it. I went to tear it up and I said, 'If you don't want it, why I will just tear it up,' and Cabe just jumped up and said 'Don't. Don't do that. We asked for that,' and I said, 'Sign it,' and he said 'Oh, we go out and talk,' and that afternoon they came back and I pulled out the paper and I said, 'Are you going to sign this paper? If you are not, I am going to tear it up. Is there\n\nanything the matter with it?' and I said 'Sit down there and sign it,' and they sat mute and I took it to tear it up and Cabe jumped and said 'Don't do it, General. We sign it,' and Cabe and they signed it.\" \"Q Don't you recall, General, that the reason they did not want to sign it was because of the 'leniency'? A I have no idea why they did not want to sign it. Q Didn't someone, Fagel and these other men, say they would not sign it because you and Austin had promised them their suit would be pau? Dismissed? And in the contract you had this phrase here, paragraph 4, 'It was agreed that if and when the men returned to work on the Central Maui Plantations, General \"Blank,\" the representative at the conference, of the Hawaiian Sugar Planters Association, would use his endeavor with the Territorial officers of the law to exercise leniency in the cases of the nine men now under charges for third degree conspiracy.' Do you remember them objecting to that? A They never gave any reason of that kind at all. On the contrary, they said all they wanted to do is to take the paper out, they are going to have a meeting, they wanted to show it to the men, and I said they could show it to the men as soon as they signed it. * * * They said it was perfectly satisfactory.\" Commencing August 6, 1937, these nine laborers were being tried in Honolulu on the conspiracy charges, the change of venue from Maui to Honolulu having been granted about June 23, before the general got to Maui.\n\nThe witness (still on cross-examination by defendants' counsel) was asked whether there had not been a second strike \"in protest to this prosecution\" and was requested to give his opinion as to trouble on one plantation. He said: \"You could get many Filipinos to come in here and say that I had double-crossed them. That is because Fagel would never tell them the truth, when he left our conferences, of what had happened in those conferences. He would\n\ngo out and hold meetings and tell them that they were not going to be tried, or that it was just going to be a formality, and then he would come and tell me 'These men believe me that I am not going to be tried,' and I said 'Yes, I know they do, and I know why they do, and you told them,' and I said to Fagel, 'That is a characteristic of your tactics, when you can't get from me what you want you go out to the meeting and build up a case with your men, and then come and tell me that you cannot do this or that because the men won't let you,' and he said 'Hundreds of men believe that you said we are not to be tried,' and I said 'I know it; because you lied to them.'\"\n\nThen in August (1937) came Francisco Verona. He had formerly been instrumental in getting certain contracts between the HSPA and certain Filipinos who had previously had contracts. He was a prominent newspaperman in the Philippines. He came to Hawaii in August as the personal representative of President Quezon, having no official standing but coming to \"investigate conditions,\" \"listen to grievances\" and to report.\n\nAt the request of Mr. Verona that he might bring the Filipino leaders before the general so as to ask him in their presence what had happened over on Maui with reference to the trial as he \"would like to know my [the general's] version of it,\" \"I told him I would be glad to have him bring them in and he did bring them in, Fagel, Cabe, Damaso and Quicio, the men who signed that document. He then asked me would I kindly tell him what happened over there with respect to the trial. I told him that on the 3rd of July Fagel had asked 'How about our trial?' and that I had told him that I had nothing to do with it, I hadn't considered it; that they had offended the Territorial law and they would have to answer for it, and that I had told them about the state of mind that Fagel and these men were in at the time they got them out on strike, whereupon is there anything more that I can do?' and he said, 'It seems to be satisfactory,' and thereupon Fagel said I would say how the strike was called, and I said 'Yes, I said it and say it now as my opinion.' Q And your opinion was that Fagel was a liar, * * * General, or words to that effect? A Why, it is not my opinion, -- it is my knowledge ; I know he is. Q You called him a liar? A I didn't call him a liar, no; I did say this, I said he stated in that meeting 'There are hundreds of men who believe I will not be tried,' and I said, 'I know it, because you went out and lied to them.' I said 'That is characteristic of your tactics in all of our conferences here. You do not get anything out of me that you want to get and you go out and hold a meeting under a banyan tree or where not and talk in Ilocano, and tell them whatever you please, tell them something, and arrange it the way you want it, and then you come in and tell me you are willing to do this, but the men won't let you.' Q Fagel said, did he not, that your expression of your opinion to Verona was not true? A No, he did not. Q Didn't he use the words 'Not true?' A He said 'Where you say we went on strike without any complaints, that we were satisfied, that we were perfectly satisfied with our pay and with our housing and with our treatment, that is not so,' he said; 'that is not so,' he said. I told him, I said, and that is my opinion, 'You went on strike because you had a lot of rabble-rousers down here who fired you up, and you went down and misrepresented the Wagner Act. The Wagner Act in itself, I have no complaint about it at all, but you did not tell the truth about it. You took a lot of haoles over there and represented them to be agents of the Federal Government, which they were not, and they made very radical speeches, speeches which were really a violation of the criminal syndicalist Act, if any language could have been.' Q And this conversation that you have just narrated now, General, took place in the presence of Verona? A Yes. Q And\n\nwas anything said at this conference by Fagel and the other Filipinos, of the agreement that you had promised, and Austin had promised, that their case or trials would be pau, given there? A Fagel might have said that, but when he said, or he started todo it, the other three men sat with their heads hanging in shame at Fagel's conduct and they reached up like this two or three times (illustrating) to pull him down. Q That is your opinion, General? A My opinion? It is my knowledge. I saw them do it. * * * When I asked each one of them, 'Have I told him truthfully,' they all said 'Yes, General.' Q And Fagel still stood his ground? A Fagel sat there spinning around, yes. Q He still claimed you and Austin had promised him - - -. A He was not claiming any such thing. Q What was he claiming? A He was claiming that when I said the strike was called not because of insufficient pay or treatment, that I was wrong ; that that was not the truth; that they had gone on strike because they wanted better wages, that he was claiming that. I said 'That is your opinion, Fagel. You are\n\nentitled to your opinion and I am entitled to my opinion; that has nothing to do with it. I stated my opinion over on Maui and state it again.' Q And in spite of that, didn't Fagel still claim that Austin and yourself had promised that the trials would be pau? A Yes, he said that, but I told him it wasn't true.\"\n\nThis conference with Mr. Verona was on August 12. Questioned as to whether, at this conference, anything was said about a second strike having been called on Maui as a \"protest strike,\" the general answered: \"I don't recall any statement being made about that. Fagel might have said that the so-called second strike, I believe he did say was because of the fact that they were going to be tried, and I told him that they could not help it if they did; he was not making good on his promise; I had never promised him that they would not be tried. He had gone out and said\n\nthat, but if that were the reason that they had gone out on the second strike, I don't know; that might be one reason, but as the reports came in, that was not the reason at all. There was a man named Fredrico Sebastian who had insulted a luna over there, and they had had a row which continued on for two or three days until Sebastian had said 'I guess I had better leave this plantation,' and they said 'I guess you better had,' and he did, and there were a number of men not turning up for work, and it resulted in about twelve other men being discharged, and they stuck out; the other men went back to work. I don't know to the present time whether that had anything to do with it or not. Q But Fagel made that representation or claim, didn't he? A Yes, sure. * * * Q When this gentleman, representative Verona, spoke to you, General, in the presence of these men, as the duly qualified representative of the President of the Philippine Islands, didn't he say something to this effect: that Quezon had heard rumors, or that it was printed in the Filipino papers, that you had promised these strike leaders to dismiss their case, and that he was delegated to find out about it? A No, he didn't say anything about it having been printed in the papers. Q What did he say about that, about that matter? A He didn't say anything. He asked me, he said he had heard here in Honolulu when he got here different tales from various Filipinos about an agreement that had been effected in Maui. He asked me if he could bring these men up and ask me what happened in Maui, and would I tell him in their presence, and that is all he said, and I did it.\"\n\n\"Verona told me that he had no official status ; that he was the personal representative of President Quezon, and asked by President Quezon to come here to investigate conditions and make a report to him. Q He did not say that President Quezon was disturbed by the Maui strike in the Philippine Islands? A No, he did not.\"\n\n\"Q General, did you have anything to do with signing these complaints to prosecute these labor leaders, or whoever these nine defendants were on Maui? A You mean the ones who were tried? Q Yes? A Absolutely nothing to do with it. * * * I never complained.\" (Tr. 37-50.)\n\nOn redirect examination of this same witness he was asked: \"Q Was there any time after July 3rd, that you told any Filipino or any representative of the Filipino strikers or workers, that if they would go back to work and call off the strike, that you would see to it that there would be no prosecution? A I never told any Filipino that there would never be a prosecution. On the contrary, I told them time and time again, so far as I knew, the case would go on; that I had promised if they went back to work to use my endeavor to get leniency for them, and explained what leniency was, and told them what they would have to plead, one of three things; told them I was giving them the best advice I could, or how they would get off the easiest, which was nolo contendere, and told them to go to Judge Bevins if they wanted to and ask him what his advice was, and they said they would go to him and ask him. There never was a time when Fagel or any other man ever thought in his own mind that there was any doubt about what my attitude was, or about what that written agreement said.\" (Referring to defendants' exhibit 1.) \"Q Can you state definitely whether in your hearing Mr. Austin ever did or did not make that statement [ referring to the prosecution being dropped ]? A He never did make that statement in my presence. Q That you know? A Yes. As I recall it, the only statement that he ever made was something to the effect that they go ahead and plead, and it was a matter of formality, and they would get off with practically nothing; a suspended sentence was mentioned by myself several times and I think by Austin, but I can't recall just what\n\nAustin said, but I don't think that Walter Cameron, the other one there who was mentioned by Fagel, I don't remember hearing him say anything * * * and I am quite sure that in any of our conversations he said nothing; what he might have said outside, I don't know.\"\n\nAfter the trial of these men, ending in September, Mr. Fagel and seven others were convicted of third degree conspiracy. Relating to this, the general was asked on further redirect: \"Q And after these men were convicted and before they were sentenced, did you express your wish so far as you could, as a citizen, with respect to the punishment of those people; whether they should be on a suspended sentence or what? A I did. I felt really that I was absolved from any promise that I had made even with respect to leniency, because of the way these men had acted. But in order to be perfectly fair and honest and just with them, I communicated to you, as the assistant prosecutor, that I wanted leniency extended as far as you could get it from the Judge, and recommended or asked you to recommend leniency. Q Meaning thereby a suspended sentence? A Meaning thereby a suspended sentence. Q And you know, do you not, as a matter of history, that that recommendation was made by me as assistant prosecutor, and that all were placed on a suspended sentence, except Fagel who refused to accept it? A Yes.\"\n\nFurther recross-examination of the generalserved to bring out more detail in the same tenor as the testimony above quoted. When asked as to whether he, the general, had engaged the special prosecutor of the kidnapping conspirators, he answered: \"I did not send him over there. * * * I did not engage [him].\" (Tr. 52-60.) (See, post, that much of the above testimony was later expressly confirmed by defense witness and much left absolutely uncontradicted.)\n\nIt was stipulated at the trial: that the cases be consolidated for trial (tr. 4); that Hawaii Sentinel Publishing\n\nCompany, Limited, is a corporation and publishes the \"Hawaii Sentinel,\" a newspaper printed, published and circulated as such in September and October, 1937, and up to date. (Tr. 8 and 89.) A copy of the issue of the Hawaii Sentinel, published under date of September 9, 1937, and carrying on the front page the article complained of, was admitted.\n\nThe prosecution produced witnesses who testified to the effect that the defendant Crowley admitted to them that he, as acting editor of the \"Hawaii Sentinel,\" had revised the article, authorized it and issued it for publication and circulation in the paper.\n\nThe prosecution further introduced additional issues of the paper both before and after the date of the offending article bearing primarily on the issue of \"intentional\" publication, and incidentally on actual malice and ill will should that stage be reached.\n\nThis was the substantial state of the record when the prosecution rested its opening case. If the defendants had then rested, the court would have been justified in charging the jury to this effect: (1) that the article was libelous per se ; (2) that, if the jury believed from the evidence beyond a reasonable doubt that the article as appearing in exhibit A was published or given for publication with the intent that it be published and circulated by the defendant corporation and that it was so published and circulated, their verdict should be guilty as charged.\n\nBut the situation went further. In the instant case the defendants not only sought to take advantage of their statutory right to offer evidence of the truth but they sought to anticipate such a right in the cross-examination of the general himself. In doing so they were met by the most detailed exposition of dates and events, prima facie demonstrating the utter falsehood of every assertion in the article, if the jury were to believe his testimony. In face of this, at\n\nleast prima facie, proof of falsity and keeping in mind that, under the statute, a libel is not defined as the publication of \"false\" statements derogatory to the good name of another, hence at no time until the truth affirmatively appeared was the prosecution under the burden to rebut any inference or presumption of truth as a material element of the offense, -- what did the defendants offer on the issue of truth?\n\n(2) THE CASE FOR THE DEFENSE.\n\nThe defense first called Antone Fagel as a witness. On direct examination he described himself as an organizer \"for the welfare of my countrymen who would follow the organization * * * at first in Maui, but I expect to spread it throughout the Territory.\" A strike of plantation laborers started on Maui April 20, 1937. After several days Fagel put his organization in control of the striking workers. Fagel became the leader of the strike laborers. The strike involved about 800, later about 1200, on one plantation. The strike spread to other plantations on the Island of Maui, involving about 4000 laborers. As president of his organization hevolunteered his services as leader of the strike.\n\nOn or about July 1, 1937, he began to confer with the \"General,\" who was secretary of the HSPA. In the conferences were about 10 Filipino leaders, including Fagel, the witness, and four gentlemen representing the employers, including the \"General.\" Fagel claimed that in July he was the chairman of the laborers' negotiating committee.\n\nIn May, 1937, Fagel and others had been arrested and charged with third degree conspiracy in connection with the kidnapping of a fellow laborer. A mainland attorney represented to be from the International Labor Defense and CIO came over to defend the alleged conspirators, arriving on Maui about June 18. Shortly thereafter a change of venue was granted to Honolulu.\n\nFrom July 1 to July 15 many conferences were had between the labor committee and the employers headed by the \"General.\" On the 15th an agreement was signed. The \"General\" did most of the talking for the employers. \"About the second or third days of the conference, I [Fagel] asked General 'Blank' what would happen to our case in case we settled the strike, we reached a settlement of the strike, and General 'Blank' said, 'Don't worry, your case is a by-product of the strike, an outgrowth of the strike, and when the strike is settled, your case will be dismissed or dropped.' He told us that. * * * Mr. Austin says, 'Yes, don't worry about your case, it will be pau.'\"\n\nThe negotiators reported their conference to their mainland attorney. The Filipino negotiators finally insisted on a written agreement being drawn up, which was signed July 15. \"We heard him [ the general ] dictate it * * * we didn't want to sign right away at that morning, and they put, -- Mr. Austin put it on his desk.\" Fagel and his fellow negotiators read the agreement. \"The 'General' said 'if you sign, you can have a copy, but not before you sign.' * * * When still we don't want to sign, he got angry, and he said he want to tear the agreement.\"\n\nThis agreement is defendants' exhibit 1. Fagel read paragraph 4 of the agreement, which speaks about leniency, before he signed it. When asked about it he said: \"This whole agreement does not mean much to me. I always took the words of a big man, this great General, and so even if I signed that or even if there is no agreement, it is the same to me. * * * Q Did you know at the time what this meant, 'It was agreed that if and when the men returned to work on the central Maui plantations, General \"Blank,\" representative at the conference of the Hawaiian Sugar Planters Association, would use his endeavor with the Territorial officers of the law to exercise leniency in the case of the nine men now under charges for third degree conspiracy.' What\n\nwas your understanding of that statement? A Well, I can't all understand that, but I understand he will try his best to have our case dropped. Q That was your understanding? A Yes. Q Did you ask General 'Blank' about it; did you make any talk about leniency and what it mean when you signed the contract? A We did not discuss that before we signed the contract. Q Did anyone of the committee on negotiations discuss this paragraph 4? A No.\"\n\nIn the afternoon of July 15, after talking with the men, the negotiators signed the agreement (defendants' exhibit 1). Shortly after that the strikers went back to work.\n\nSummoned to Honolulu, August 3, for the trial of the conspiracy case, Fagel went to see the \"General,\" with Cabe, Damaso and Quicio. \"We asked him about our case, why they are going to continue? Q Yes? A And he said, 'They will not continue; it will not be continued, and it will be finished right away quick if we pleaded nolo contendere.' Q Did you understand what nolo contendere meant? A Well, even in Wailuku he told us about that plea, after we signed the contract.\" (The witness disclosed no conference with the general on Maui after signing the agreement.) \"He talked about the pleading of nolo contendere and plead guilty, but that there will be no jail sentence * * *. In Honolulu * * * he called a lawyer. * * * He said that if you plead nolo contendere that means I was not contest, I did not contest, you are in the mercy of the court; that is what he said. * * * We didn't want to pleaded not guilty, I mean to pleaded guilty or nolo contendere, and then at that time I asked General 'Blank' if they were going to continue the trial, and because we were not going to plead guilty or nolo contendere, and request him to drop * * * [the] special prosecutor.\"\n\n\"He said, you better plead nolo contendere so that the case finish quick. * * * I told him no. * * * Q Did you say anything about the promise he gave you before in July,\n\nwhen he said the case would be pau or dismissed? A Yes, I told him many times that. Q What did the General say about that? A Well, he said he promised leniency but -- Q What? A He just simply said he promised leniency. Q He said he promised leniency? A Yes, what is in the contract, that is what he stand for ; he does not seem to remember what he promise in the beginning of the conference. Q Did he ever call you a liar on this day in question, or a deceiver? A I didn't hear him tell me that at that time.\"\n\nArraignment of the conspiracy defendants took place in Honolulu on August 4 and all pleaded not guilty. The trial before a jury started August 6. Fagel acted as his own lawyer. Also, Cabe. The mainland lawyer acted for the rest of the defendants. While the trial was in progress Mr. Verona came to Honolulu. Fagel met him at the pier. Several days after he arrived in Honolulu, Mr. Verona arranged a meeting in the \"General's\" office. Fagel, Cabe, Quicio and Damaso went with Mr. Verona. Another gentleman was present with the \"General.\" \"Q What was said by you and what was said by [the general] if anything? A Well, I tried to repeat what I used to tell General 'Blank,' that because the trial was proceeding he did not fulfill his verbal promise to us. I repeat that in Mr. Verona's presence and the presence of the others, and General 'Blank' kind of got heated a little bit and he told me I lied. Q * * * What were the exact words? A That I am a liar. Q And what did you say to that, if anything? A Well, I told him that he is not telling the truth, or that he, -- that he does not fulfill his promise. * * * Well, General 'Blank' was explaining to Mr. Verona about that we should have pleaded nolo contendere so that the case, the trial, would not be continued, but I told him that we did not want, and Mr. Verona told him that well, they did not want that kind of pleading, that is what Mr. Verona told;\n\nwe just have some kind of conversation like that. * * * I have express the opinion that our countrymen in Puunene is going to have some kind of trouble, or now having some kind of unrest, because of the continuance of our trial. * * * Q Did you refer to the protest strike they had sometime in August? A Yes. Q Some of the laborers? A Yes.\"\n\nThen Fagel was questioned about talking toMr. Crowley, the defendant in the instant case, and to another \"reporter\" for the Sentinel; that he told him of the alleged promise of the general. The trial of the conspirators was over on September 8 and the defendants were found guilty. The assistant prosecutor recommended suspended sentences for all of the defendants. Fagel refused the suspension claiming innocence and was given and served four months. The others accepted the suspension. (It is to be remembered that all of the examination and answers of the witness were conducted in the English language.) (See tr. 91-142.) He had a grammar school and a high school education in California schools. (Tr. 148.)\n\nUnder cross-examination Fagel admitted that in March of 1937 he got acquainted with labor agitators, on April 10 instruction on the Wagner Act and the strike on Maui (his place of residence and \"fraternal organization\" activities) was started April 20. \"Then Mr. Paredes, our commissioner in Washington, D. C. notify the strikers or cable here, that the strikers must return to their jobs without any settlement, and also supplemented by Mr. Quezon, then I told the associated members that my answer to Paredes and Quezon is to strike on the entire Maui, and I called the strike on the entire Maui ; that is the time I called the strike, but I never called the strike at the first day. Q After the President of the Philippines, Quezon, then, had sent word to the Filipinos here, to go back, pending settlement, had, -- your answer was that there was going to be a bigger strike than ever, is that it? A Yes, they wanted the suckers to go back to work without any settlement. Q Yes, pending settlement. I understood you to say, in your direct examination, that the strike started on April 20, and that 'after several days I put the organization into the strike and took the leading part.' A Yes, sir. * * * Q And then by about June 5 to June 10, all the whole island was involved? A About, yes; about that. Q And then you got the Hawaiian Pineapple in ; that got in to the strike too, didn't it? A All the pineapple, I mean, except Haiku. * * * Q There was one time when you were talking about the wages, and so forth, not being satisfactory to the strikers, and the strikers said the pineapples were very ripe and the sugar cane was ripe and ready for milling, and that the thing to do was to not give in but to stand out, because the pines were very ripe and the sugarcane was dried, and that was the time to have the big strike? A Yes. * * * It was in July, during the negotiations of the strike, during our conference * * *. Q Between July 1st and July 15th. * * * Q Well * * * did it ever strike you that maybe General 'Blank' could not keep that agreement, that maybe General 'Blank' did not run the courts over there, or what did you think about that? A Well, I thought that he could do it because he is a big General. * * * Q You thought if he was a big enough General, he could drop any case in the Territory if he wanted to, and you didn't think that you ought to go and speak to Mr. Bevins, the prosecuting attorney, the official right there in Wailuku, and make sure that this sort of thing was all right; you never thought of that? A No. Q You know, do you not, that Mr. Bevins and myself were prosecuting in Maui, both Bevins and I? A Yes, I know. * * * Q But you didn't think you better go and find out from the people in the courts, ask Judge -- and ask Mr. Bevins [the prosecuting attorney on Maui]? A No, I didn't take that pains.\n\n* * * Q You got this notice [ as to setting the conspiracy case for trial ] on the 15th of July? A Yes. * * * Q [Then] did you see Bevins at all; I mean about this case and about this trial. Did you talk to him? A We went to his office. * * * Q And did you on that occasion tell him that it had been promised you that there would be no trial? A No. * * * Q Didn't he tell you then [ on July 30th ] that if you wanted to plead nolo contendere, that he would recommend a suspended sentence, and had every reason to know that the court would give you a suspended sentence; didn't he tell you that in the office? A I don't quite remember. * * * Q You would not deny it? * * * A He might have said that.\" In response to a question from the court, Fagel admitted that he was served with the notice of motion (to set the conspiracy case for trial) at noon on July 15, before the agreement (defendants' exhibit 1) was signed by him and the other Filipino negotiators. (Tr. 167.) \"Mr. Egan, the prosecutor of the National Labor Relations Board * * * gave me [Fagel] many good advice, and also gave me a copy of the Wagner Act * * * said, you study this Act * * * said that he doesn't know whether the whole employees of the sugar industry would be included in the Wagner Act, but he is sure that the workers in the mill is under the Wagner Act.\" (Tr. 170.)\n\nThe next witness for the defense was Florentino Cabe, another member of the negotiating committee mentioned by the prosecution's witness. After many days of conference, said Cabe, \"I heard once Fagel been asked General 'Blank' what will become of the case in which we were arrested; that is when I heard General 'Blank' said that the case in which we were arrested was a by-product of the strike, so I did understand, or thought, we come to a settlement of the strike the case will be automatically dismissed. * * * I heard that Fagel asked * * * what will become of our case, and General 'Blank' answered him that he would not be\n\nworried about the case because that case was only a by-product of the strike, and was in such words as I heard, I understand that if we come to a settlement of the strike it will be automatically dismissed.\" (Tr. 181, 182.)\n\nThen being asked about the agreement of July 15, the witness answered: \"In the morning of July the 15th, General 'Blank' dictated to the secretary, and she write in shorthand, the agreement we had. As soon as he was through he sent inside her office and type them up. After about 15 minutes I think she came out with the agreement, typewritten. * * * Q He refused to give you a copy. * * * A He said that if we was not going to sign the agreement he was going to tear them up.\" (Tr. 185.) \"Q Did I understand you to testify just now that the beginning, -- in the morning of the 15th, General 'Blank' dictated the contract that was typed by his secretary? A Yes. Q Or was it a day or two before? A It was two days before the 15th of July, was when the contract was typewritten. * * * We was supposed to sign the contract on the morning of July the 15th, but were not still obliged to sign the contract. * * * We refused to sign because we can't have any copy to show to the strikers, and we were afraid in case of anything will happen. * * * Q Did you eventually sign the contract? A We did. * * * Around 3 o'clock in the afternoon.\" Then the witness, after confirming the general's version of the actualsigning, was asked: \"Q Now was anything said that day * * * about that clause of lenience, or about the promise to automatically dismiss the criminal cases pending? A That is all I remember.\" (Tr. 189.)\n\nDuring the conspiracy trial Cabe acted as his own attorney ; he talked the strike over in the court corridor with the Hawaii Sentinel write-up people. He was asked about the conference with Mr. Verona in the general's office. \"Fagel said that General 'Blank' was not telling the truth, he was not keeping his promise, and what he had promised\n\non the settlement of the strike. Q And what did General 'Blank' say? A General 'Blank' jumped up in the air, he stand up, and called Fagel a liar. * * * Q Do you recall in that conference Major General 'Blank' not only called Fagel a liar but said that he was a cheater or deceiver, something like that, about the Wagner Act? A I understand; I heard that.\" (Tr. 193-197.)\n\nOn cross-examination Cabe testified that Fagel was organizing the laborers on Maui before the strike to demand higher wages. Cabe attended about seven conferences before July 15. He remembered being served by the county attorney with notice for setting the conspiracy case for trial. \"Q On July the 15th, about dropping this case; just what were the words the General used? A When Fagel asked General 'Blank' what will become of our case, the General answered him, not to worry about the case because that case was only a by-product of the strike. * * * That is all I remember.\" Cabe was then shown defendants' exhibit 1, the contract of July 15, a copy of which he had in his own possession, and his attention was drawn to paragraph 4, re leniency. He read it before he signed, also heard it dictated and heard it read after it was typed. \"Q Did you ask anybody what 'leniency' meant? A I did not. * * * Q But General 'Blank' did not use that word, he did not say that the case was going to be dropped, did he? A During my presence I did not hear it.\" (Tr. 207.) Cabe and three other Maui laborers were the \"Big Four\" leaders, who acted with Fagel who was not a worker. As to whether the general had explained about a plea of nolo contendere before July 15, Cabe said: \"I don't remember.\"\n\nFour or five days after beginning to select a jury in Honolulu in the conspiracy case, and about August 11 or 12, Cabe attended the conference in the general's office with Mr. Verona.\n\nShortly after the agreement of July 15 was signed Cabe and the other \"leaders\" called at the office of the government prosecuting attorney Bevins. He was asked whether Mr. Bevins explained the plea of nolo contendere and that he would recommend a suspended sentence. He answered: \"I don't remember. * * * Maybe he did, I don't know.\" Nor did Cabe then go to the general to ask why the case was not being dropped. Cabe remembered Bevins explaining about pleas and recommendations later, that he Cabe favored this but wanted to talk with Fagel. (Tr. 216-217.) \"Q Now, Mr. Cabe, haven't you told Mr. Staff Austin, more than once, that all this talk about General 'Blank' having promised to drop this case was not true; that all that General 'Blank' had said was that he would exercise leniency. Haven't you told Mr. Staff Austin that more than once? A Yes, I have said, what I have heard, is what I told Mr. Stafford.\" (Tr. 217.)\n\nOn redirect, Cabe said he was a high school graduate in the Philippines. At first Fagel did not want a \"black and white, written contract,\" but the majority convinced him \"so we have something to show to the strikers.\" In the conference with Verona and the general \"did you do anything with reference to Mr. Fagel, tell him to sit down? A I pulled his coat.\" In re Bevins's explanation to Cabe re pleas, he was asked, on redirect, \"Q He [Bevins] was pretty anxious that you plead nolo contendere? A No, sir.\"\n\nOn recross, re his conviction for conspiracy to kidnap, Cabe was asked: \"Q And is it not true, Mr. Cabe, to your knowledge, that the jury consisted of one Japanese, one Chinese, two Portuguese, two Hawaiians, one Labor Union man, and five ordinary haoles, isn't that right? A That is what I remember. Q And none of them owned one share of sugar stock, isn't that right? A Yes, sir.\"\n\nThen Mr. Cruz, one of the strike leaders, testified, on direct, that on the second or third conference in July, \"Mr. Fagel asked him [the 'General'] if in case the strikers go back to work, or it will be settled, what will become of the case of the nine men, and he said, you will not worry about that because it is a by-product, outgrowth of the strike, and Mr. Austin said, or General 'Blank' said that it will be dropped or dismissed, and then Mr. Austin says also that it will be pau.\" (Tr. 238.) The witness was not there when the contract was signed, or at any later conference.\n\nMrs. Crowley appeared as a defense witness, stating that she was the wife of defendant Crowley and owned about ninety-five per cent of the stock of the Hawaii Sentinel, a corporation. She used her maiden name as the published name of the editor. On September 9, 1937, Mr. Crowley was in charge of the paper, having \"supervision over the printing and publishing of this paper as the editor.\" She read all the articles appearing in the issues of the Sentinel after they were published.\n\nLeo F. Crowley, one of the defendants, became a witness in his own behalf. On September 9, 1937, he was the president of this Hawaii Sentinel Publishing Company, Limited, and acting editor. He admitted the truth of the prosecution's witness's story that he, Crowley, had supervised, cut down, and authorized the printing of the editorial in issue in this case (\"General 'Blank' Fans Far East Fires\"), claiming that it was within the privileges of a free press. He admitted full responsibility in fact for the printing, publishing and circulating of the article. (Tr. 255-256.) \"We are going to continue to do it, because it is the privilege of the free press.\" He stated that he had never met the general. \"I did not know the man personally.\" Mr. Crowley had talked to Mr. Fagel, during the trial of the conspiracy\n\ncase, about a week before the article of September 9 was published. Mr. Fagel claimed that he had been double-crossed, \"that Major General 'Blank' had promised to dismiss the case if they made peace, if they settled the strike, and he went into some details which I don't remember now.\" (Tr. 259.) He knew of Fagel before. He knew before the article was written and published that the conspirators had been found guilty by a jury.\n\nIn cross-examination, by the prosecution, Mr. Crowley was asked: \"Q In other words, if a statement of alleged fact is set out in a paper, which is false, you do not think a free press has a right to do that, do you? A If it is an honest opinion based upon a belief that is honest, the facts may even be, in honesty, -- might be even twisted a little. They have been. * * * Q So that if I met you at five o'clock in the morning out here on Kalakaua Avenue and told you that I had just seen Mr. rob the Bank of Hawaii, and you got out a newspaper, a special edition, and stated as a fact that Mr. had robbed the bank, without investigating, you would think that was the freedom of the press? A No, I would not. That would be ridiculous. Newspaper men don't do that. Q When Fagel told you that General 'Blank' had lied to him you immediately made that statement in the press, didn't you? A No, I did not. Q How much of an investigation did you make? A I talked to Mr. Fagel. He told Mr. Verona ; and there was a statement made in court [note: no evidence of such was produced but the prosecution proved the contrary -- exhibit F] and that was brought in by the reporter covering it, a man of integrity as a newspaper man. Q Well, you didn't think that you should give General 'Blank' a chance to be heard on that, did you? A The fact covering this subject of the criticism, and the editorial, had previously been published and never denied, in the paper, -- If that had been denied, the facts of the court case had been denied [note:\n\nno evidence was produced by the defense of any statement in court; the prosecution proved the contrary without contradiction], there would never have been this criticism of General 'Blank' but it remained undenied. Q Were you in court when anything was said about General 'Blank'? A No, I was not. * * * Q In this article in September 9, this statement * * * 'This man, Major General \"Blank,\" for money, shed his country's uniform to don a lackey's livery,' do you call that criticism or comment or a statement of a fact, Mr. Crowley? * * * A That is opinion. * * * Q And then, 'And as a lackey for the HSPA he has trafficked with the honor, credit and reputation of the United States Army,' is that a statement of fact? A Opinion. * * * Q And on the last page here, 'Now with open charges, undenied, that General \"Blank\" lied and deceived the workers,' you mean, the meaning of that, from your angle, is that you were conveying to the world that there are open charges undenied that General 'Blank' has lied, is that about it, a fact? A No, that is, -- that was another opinion.\" In a later issue of the Sentinel, Crowley admitted that the following language was aimed directly at the general: \"This once slim-waisted model to his subalterns degenerated into a paunch-bellied stooge of the * * *.\"\n\nAfter Mr. Crowley left the stand the defense rested.\n\nLet us analyze this record to this point. Boiled down, the entire testimony, offered by the defense through the witnesses Fagel, Cabe and Cruz, \"to give in evidence the truth of the matter contained in the publication charged to be libelous,\" in fact corroborates in all essential details the previous testimony of the prosecuting witness tending to show the falsity of the facts asserted in the article. The greatest height to which the defense evidence comes on the question of truth is that there might have existed some misunderstanding resting with Mr. Fagel as to just what the general had said relative to the continuance of the prosecution\n\nof the conspiracy case for kidnapping prior to the signing of the contract of July 15, 1937.\n\nBut it was undisputed that paragraph 4 of this contract, a simple one-page document which states: \"It was agreed that if and when the men returned to work on the central Maui Plantations, General 'Blank,' representative at the conferences of the Hawaiian Sugar Planters Association, would use his endeavor with the Territorial officers of the law to exercise leniency in the cases of the nine men now under charges for third degree conspiracy,\" was dictated in the presence of the workers' negotiating committee, including Fagel, Cabe, Damaso and Quicio; was read to them aloud after it was typed; and was read by them personally before they signed it on the afternoon of July 15, 1937. This contract further recites: \"At a conference of representatives of the central Maui Plantations and the strike leaders of central Maui, held on Saturday, July 10th, 1937, which was the sixth meeting held for the purpose of discussing differences, it was finally agreed as follows.\" At the bottom of the sheet, in typewriting, occur the words: \"This document made in duplicate, consists of one sheet.\" The document itself is dated July 15, 1937.\n\nIt was admitted by Fagel and Cabe that, on the very day this document was dictated, read and signed, and between morning and afternoon sessions of the conference, they were served with a notice to appear in court to set this very conspiracy case for trial. It was admitted that the Maui prosecuting officer discussed with them the possible pleas and his willingness to recommend a suspended sentence on pleas of \"nolo contendere\" and that he had every reason to expect that his recommendation would be acceptable to the presiding judge. It was admitted by the defense witnesses in the instant case that the jury which convicted the conspirators was a mixed jury, no member of which owned one share of sugar stock.\n\nThis was the status of the case at bar when the defense rested. There was not one iota of proof of any fact justifying, rationally, the truth of any inference contained in the title of the editorial complained of that \"General 'Blank' Fans Far East Fires\"; which title connected with the supporting articles justifies in toto the meaning supplied by the innuendo of the complaint.\n\nThere was nothing in said evidence justifying by the faintest imagination the statements: \"Fascist Hawaii defies the President of the United States. It slaps Secretary of State Cordell Hull in the face. It laughs in scorn and derision at Secretary of War Harry Woodring. Deliberately, maliciously, in the face of fair warning and despite the pleas of our country's leaders, it acts to win for America the hatred of a nation whose good will is vital to our nation now. That nation is the new Philippine Nation, eighteen millions of people whose friendship today is essential to us, and whose good will Washington is striving to hold. Fascist Hawaii is making the name American a hissing in the Philippines, aiding there the aims of propagandists of Asian imperialism. By that our fascists have brought new peril into the American situation in the Far East. * * * For the crux of the peril of today is that the man who brought about the new danger is none other than a once-honored chief of the United States Army.\" While it might be quibbled that isolated parts of the above assertions of fact are not, separately considered, definitely up to this point libelous, and hence, in offering evidence of truth, the defendants were not required to substantiate them, yet the tenor of the whole article, as directed against one individual, is so cohesive in its obvious endeavor to \"injure the fame, reputation or good name of another person, and bring him into disgrace, abhorrence, odium, hatred, contempt or ridicule\" that the absence of one iota of fact to support these introductory assertions in the article justifies the libelous meaning\n\ninherent and intended to be imputed in them and becomes relevant in determining if there was any defense amounting in law to a defense of truth to submit to the jury.\n\nConsidering all of this evidence in its most favorable light to the original defendants, now plaintiffs in error, there is not the slightest showing of any act done or performed by the victim, against whom this article was directed, even to indicate in the slightest degree conduct justifying an accusation that he had, for base motives, severed his connection with the army to become a subservient tool of private business interests. There was not even a scintilla of evidence to justify the following slanderous assertions or imputations: that \"trading on his military title\" he \"lied and deceived workers who trusted to the honor of the U.S. Army\"; that he \"swings the * * * sword, hurls * * * mercenaries * * * to convict\" innocent workers; that he is a party to \"persecution\" with \"unprincipled and revengeful men\"; that his conduct justifies the belief in the homeland of the workers \"that American Generals are liars and deceivers, schemers to oppress and imprison Filipinos who are innocent\"; that he, \"for money, shed his country's uniform to don a lackey's livery\"; that \"as a lackey * * * he has trafficked with the honor, credit and reputation of the United States Army to stir up international strife that his employers might profit\"; that he is furthering the schemes of \"kings of fascism intent on their works of greed and power\"; that his conduct in handling his employers' private business is such that it shows that \"public power has been seized and used ruthlessly for private terrorism and revenge\"; that \"America's * * * prestige * * * has been put on the auction block for profit by HSPA's lackey general.\" Each and every part of the foregoing assertions or imputations in the article is libelous per se. The printing\n\nand publishing of it was admitted to have been intentionally done.\n\nIn other words taking each assertion of fact in the article, as well as the article as a whole, and comparing the assertions there and its whole tenor with the proof as summarized above, there was at the time in which the defense rested not only no \"substantial\" evidence supporting the truth of the facts upon which the article purports to be based, but there was no evidence at all of the substantial truth of anything purporting to be a basis for this uncalled-for and vicious attack on a private citizen.\n\nNo effort to check the truth was shown. No evidence that any person who made the slightest effort to check had found the slightest basis even for suspicion against the victim of this article. On the contrary, even Mr. Verona was apparently satisfied with the \"General's\" absolute integrity.\n\nIt is regrettable that so much laborious effort seems to be required to demonstrate the utterly defenseless situation. But when it is asserted that a piece of gold (the truth) is really concealed in what appears to be a ton of sawdust, the only way to exhibit the fallacy of such an assertion seems to be to rake over every bit of sawdust openly and to demonstrate for independent check that every glint of yellow that might appear comes no closer to the semblance of the gold being searched for than a handful of scattered grains of \"iron pyrites.\"\n\nIncidentally it might be touched upon here that it is alleged to have been error on the part of the prosecution to introduce, as exhibits, other issues of the Hawaii Sentinel published before and after the date of the article in question. Whatever may have been the reasons for permitting the introduction of these exhibits by the trial court at the stage of the trial procedure at which they were introduced, it can be said that the burden was then upon the prosecution\n\nto show that the publishing and circulating of the article complained of was intentionally and not inadvertently done. Prior to the admission by the defendant Crowley that he consciously and knowingly corrected and issued for publication the article in question, this intentional publication was a matter for the prosecutor to show. These samples of the workmanship of the Sentinel, bearing upon the same charges and accusations, were relevant to that issue of intentional publication.\n\nThe prosecution might well have rested at the close of the defendants' case and requested an instruction forthwith to the effect: \"The printed article in question is libelous per se ; the defendants admit that it was published and circulated by them; there is no evidence of the truth of the facts asserted which would justify such a publication if made intentionally and not inadvertently; therefore if you believe beyond a reasonable doubt that the publication and circulation was intentionally made then legal malice is inferred and you should convict.\" But the prosecution did not then rest, nor did it then request such an instruction. It introduced witnesses in rebuttal who gave further testimony re the facts of the labor conferences, thus affording the defendants by cross-examination a further opportunity to refine out a possible grain of truth to support the truth (?) of the defamatory assertions.\n\n(3) REBUTTAL.\n\nMr. Pflueger testified. He has been the assistant secretary of the HSPA, connected with it since 1922. He was examined as to the open conference between Mr. Verona, the general and the four Filipino strike leaders in August of 1937. Asked to tell what occurred, in his own way, he confirmed throughout, without repeating it, the general's version of this conference. (Tr. 291-294.)\n\nMr. Pflueger was thoroughly cross-examined by the\n\ndefense. It can be summarized in the witness's words: \"General 'Blank' repeated his story and asked the other strike leaders if his story was correct * * * that if they got these men back to work peacefully that he would use his endeavor to have the officers of the law exercise leniency * * * asked each one in turn, * * * directly, if that story that he just told them was correct * * * it was not a long story * * * it took me five minutes to tell you * * * they said that the way he told it was correct. * * * They did agree to it. They said 'yes.' * * * He went through this whole piece again, and then he asked each one a second question, 'Did I say anything here that I did not say on Maui, or did I leave anything out?' and they said, 'No.'\" (Tr. 294-300.)\n\nStafford Austin was produced as a witness for the prosecution in rebuttal and subjected to cross-examination. He identified himself as manager of the Wailuku Sugar Company since 1932. He attended all the labor conferences on Maui, about ten in all, starting July 1. In re alleged promises of the general as to the criminal cases pending the witness said: \"On a number of occasions * * * Mr. Fagel would say, 'What is going to happen to our case?' and the General said that the case was now in the hands of the Territory and government, in the hands of the government, and he had no jurisdiction over the case, but he would use his good offices to try to get them leniency in this case, and in one meeting he explained the word 'nolo contendere' to these men, wrote it out on a piece of paper and then explained it, said it meant that they would throw themselves on the mercy of the court, and they would probably get a suspended sentence.\" (Tr. 306.) Then the witness continued re the meeting of the morning and afternoon of July 15, the dictating, reading and signing of the written agreement, thoroughly confirming the version given in the case in chief by the \"General.\" The witness stated\n\nthat the \"General\" never stated that the pending criminal case would be \"dropped\" or \"dismissed.\" (Tr. 309-311.) The witness denied ever using the word \"pau\" in relation to the case, always referred questioners to the \"General,\" but he did often say \"Well, now, if this is agreeable to everybody, why I hope that the strike is pau and that all the men will go back to work.\" (Tr. 311.) In cross-examination he said: \"I could not have used the word pau for the trial, because I did not have anything to say about the trial.\" (Tr. 320.)\n\nThe court reporter at the trial of the \"conspiracy case\" was examined, testifying that no reference to any purported \"broken promises\" came out in open court during that conspiracy trial, -- this to rebut one element of Crowley's so-called investigation of the truth, also there was no evidence at that trial that the general attempted to have anything to do with the conduct of the conspiracy case.\n\nThe naive assumption that these high school graduates, who were active members of the \"Big Four\" leaders of the Filipino workers, really in fact were misled to believe that the retired general as secretary of the HSPA was the dictator as to the enforcement of territorial laws beyond the transparently simple language of their own agreement that he \"would use his endeavor with the Territorial officers of the law to exercise leniency,\" remains as the sole \"gilded\" grain after all this sifting. To justify this as legally sufficient under any theory of the law to submit to a jury on a defense of truth for such a scurrilous article as the one in question sufficient to justify acquittal would be a travesty on the concept of truth. While in the rush and pressure of trial procedure, a trial court may be exonerated for leaving the legal issue open when no request was directly and clearly presented curtailing the issues, this court would not be so excused, in face of a record so lacking in any defense. It is not a question of credibility of\n\nwitnesses or weight of testimony, but one of the existence or not of any truth at all.\n\nAttention is hereby called to section 3744, R. L. 1935, relative to the powers of the court in charging the jury: \"The court shall instruct the jury regarding the law applicable to the facts of the case, and may, in a criminal case, make such comment on the evidence and the testimony and credibility of any witness as in its opinion is necessary for the proper determination of the case.\" The only qualification, if the court does comment, is to inform the jury that they are the exclusive judges of all questions of fact. And under section 3742: \"The court may, however, charge the jury whether there is or is not evidence (indicating the evidence, if any) tending to establish or rebut any specific fact involved in the case.\" (Emphasis added.)\n\nOne further assignment of error remains to be dealt with. The defense makes a claim of \"qualified privilege\" said to be guaranteed under article I of the amendments to the Constitution of the United States relating to \"freedom of speech, or of the press.\" Unless a special privilege affecting the press itself is granted by local statute (as, e.g., in North Carolina, supra, marginal note 8), there is no \"freedom of the press\" beyond the ordinary \"freedom of speech\" accorded to the humblest citizen.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e It is a right subject to punishment for its abuse under the police power.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e Untrue defamatory statements (or imputations) of fact even against a public servant or candidate for office are never privileged, except under special local statutory extensions of special privilege clearly bordering on so-called\n\nfair comment.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Criticism and fair comment carry to the public acts proved or admitted, not to the motives and character of a private citizen.\n\nThe law has been heretofore referred to, that this does not cover abuses of \"freedom\" nor is it synonymous with \"unrestrained license\" so as to prevent punishment for false defamation, or for true defamation published without legal justification from \"good motives or justifiable ends.\"\n\nDefendant Crowley, as a witness, made the claim and his counsel argues in the briefs that the article comes under the guise and privilege of \"fair comment.\" It is suggested that a strike or relations of capital and labor are the subject of \"fair comment.\" Granted as a general abstract principle, but this article is not directed to such relations in general nor to the Maui strike in particular, but to alleged base motives, perfidious character, alleged deceit and lies, greed and persecution in connection with the supposed conduct and acts of a definite individual, -- and not one act by such individual is given in evidence in the trial justifying a reasonable man even to suspect, much less assert, that such defamatory accusations bore the slightest semblance of truth. False charges are asserted in the form of statements of fact directed to the alleged conduct of a definite man.\n\nAgain, it is suggested that the subject of international relations and their possible impairment is a matter of public interest, hence subject to \"fair comment.\" Granted again as an abstract theory. But nowhere in the record is any fact shown even faintly indicating that the victimof this attack was actually a party to any act, or himself initiated any, that even touched upon international relations in any respect, much less in the base setting impugned.\n\nThe dragging into the case of the incidents with the personal representative of the president of the Philippine government developed no dissatisfaction on his part or of any other \"international\" person, with the conduct of the individual traduced by the defendants.\n\nFrom the mouths of the defense witnesses themselves, admitting the satisfaction with the strike settlement and their signatures to the agreement of July 15, placed there when they had just been served with notice of further proceedings in the pending criminal case; from their admitted talks with the government's prosecuting attorney; from their conduct when faced with the facts in the presence of Mr. Verona; from their conviction by due process of law before an impartial jury; from the recommendation of suspension of sentence and the granting of it; from these admitted facts and the affirmative showing of nothing else; from the uncontradicted detail of other conduct of the general and his associates, the falsehood is shown as to every assertion in the article. Far from being comment or criticism, the article is an unprincipled parade of defamatory falsehood printed and published under the guise of facts. The \"wagon\" may be dressed up in argument with fancy trimmings disguised as \"matters of public interest,\" but the cargo is composed of \"unadulterated garbage,\" the property of the writers and publishers, who show no justification for depositing it on the \"head of their victim.\" It needs purification in the cleansing fires of conscience before it is fit even for the roots of the \"tree of knowledge.\"\n\nIn addition to all the grounds heretofore stated, one further factor exists for sustaining the result in the court below. Under section 3563: \"The supreme court may affirm * * * judgment or sentence of the trial court * * *. But no order, judgment or sentence shall be reversed or modified unless the court is of the opinion that error was committed which injuriously affected the substantial rights of the plaintiff in error.\"\n\nIn regard to the sentence imposed the trial judge had the defendants before him. He had the opportunity to observe the demeanor of the defendant Crowley while a witness. He had means of observation denied to this court, as to what correction appeared to be necessary to strike through the morbid egotism of the defendant, who embellished the unchecked complaints of the childish egotism of a convicted conspirator, so as to awaken defendant's conscience and free his talent from a blindness that lets him resort to attempted \"assassination\" of the character of a private citizen, to an awareness that his conduct is an abuse of the real guarantee of liberty established by the Constitution over a free people. From the record before us, the trial judge used great restraint in a flagrant abuse of sacred rights of a private citizen. To reverse such a case, under such clear evidence of violation of the criminal laws, on such a flimsy, imaginative, so-called defense, would be a travesty of justice.\n\nNo substantial rights of the plaintiff in error are shown to have been \"injuriously affected.\" They obtained a submission to the jury that was not only not in error but was beyond what the record in this case shows they were entitled to under the libel proved and callously admitted when the publication was admitted (and for good measure proved to have been clearly intentional) and with a record showing a total absence of proof of truth, or of circumstances making it \"appear\" that the inexcusable slander \"was published with good motives and for justifiable ends.\" On the contrary the record shows a malicious imagination presently running riot with a total disregard for truth.\n\nWe have carefully considered all of the assignments of error and find them without merit. The judgment of the lower court is affirmed.\n\nDISSENTING OPINION OF PETERS, J.\n\nI respectfully dissent.\n\nBoth defendants should be granted a new trial. The trial court committed reversible error by instructing the jury as requested by the prosecution that it was incumbent upon the defendants to prove justification by a preponderance of the evidence.\n\nThe court, at the request of the prosecution, charged the jury as follows: \"You are instructed that the burden is on the Territory in these cases to prove beyond a reasonable doubt that defendants (or either of them) published, or aided in the publication of, a libelous article as charged; but once such publication is proved to your satisfaction beyond a reasonable doubt, the burden is thereafter upon such defendant or defendants to prove to your satisfaction, by a preponderance of the evidence, that the charges of lying and deceit contained in the article were, at the time of its publication, true and, further, that they were published with good motives and for justifiable ends.\" (Prosecution's Requested Instruction No. 3.)\n\nThe following instruction, requested by the defendants, was refused: \"I instruct you, that after considering all the evidence and the surrounding circumstances attending the publication of the said article in question, you are convinced beyond all reasonable doubt, that a libel was published of and concerning Major General Wells; you will next consider the matters of defense, and in this regard I charge you, that defendants under their plea of not guilty, have introduced evidence of the truth of the statement of facts published in said opinion and criticism of the publication in question. I instruct you, that Truth is a complete defense to a charge of Criminal Libel if made in good faith or for justifiable ends; and in this connection, I instruct you, that in criminal law, the defendants are not bound to prove that the publication was made in good faith to entitle them to an acquittal, nor are the defendants\n\nrequired by law to introduce any evidence tending in that direction. If the statement of facts, published in the opinion and criticism of said publication, were, in fact, true, the defendants are not guilty of the crime charged. Further I instruct you, that under the law, the defendants are not required to prove the truth of the publication, or to prove anything for that matter, to entitle them to an acquittal. The question for your consideration in this regard, is this, that, if from all the evidence introduced in this case, a reasonable doubt arises in the minds of the jury, as to the truth of the statement of facts published, then I charge you, that you should resolve that doubt to the benefit of the defendants and you will find the defendants not guilty.\" (Defendants' Instruction No. 22.)\n\nThe only other instructions given by the court upon the burden of proof were as follows: \"I instruct you that the elements necessary to make out a case of criminal libel are a publication in writing, print or by picture, statute, sign or representation, other than by words merely spoken, which directly tends to injure the fame, reputation or good name of another person, and bring him into disgrace, abhorrence, odium, hatred, contempt or ridicule or cause him to be excluded from society. If you find beyond a reasonable doubt that the defendants, or either of them, maliciously put into circulation the newspaper article set out in these charges (which, taken as a whole, is a libelous article) or promulgated, exhibited or distributed the same for the purpose of making it known to others, and have thereby in fact made it known to others -- or have in any way aided or assisted in so doing -- I instruct you that they have published a libel.\" (Prosecution's Requested Instruction No. 5.) \"I instruct you that unless you believe that the allegation that * * *\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e lied and deceived workers (as\n\ncontained in the newspaper article of September 9th, 1937) is true, there is no privilege or freedom of the press that will condone the publication of that statement. But if you believe from all the evidence that * * * did lie and deceive as alleged in said publication, then the privilege or freedom of the press applies.\" (Prosecution's Requested Instruction No. 19.) \"I instruct you that the issue which you are to try is that presented by the information, and the defendants' plea of not guilty in this case. For be it remembered, that the plea of not guilty puts in issue and requires the prosecution to prove each and every material allegation in the information beyond all reasonable doubt.\" (Defendants' Instruction No. 2.) \"The burden of proof, as those words are understood in criminal law, is never upon the accused to establish their innocence or to disprove the facts necessary to establish the crime for which they are charged. It is on the prosecution from the beginning to the end of the trial and applies to every element necessary to constitute the crime.\" (Defendants' Instruction No. 6.)\n\nIt is axiomatic that in a criminal case it is incumbent upon the prosecution to prove all of the essential ingredients of the offense charged beyond a reasonable doubt.\n\nIn order to constitute the statutory offense of publishing a libel the defamatory matter must be published maliciously. \"The publishing of a libel is the maliciously putting of it into circulation, or the promulgating, exhibiting or distributing of it for the purpose of making it known to others; and thereby in fact making it known to others; or aiding or assisting therein, or the causing or promoting thereof.\" R. L. 1935,  6053. One of the essential ingredients of the offense of publishing a libel therefore is malice. Malice is of the essence of the offense. The corpus delicti of the offense of publishing a libel is the malicious publication\n\nof the libelous language. The malice to which I here refer is malice in its legal sense meaning a wrongful act intentionally done without any justification or excuse and not malice in its popular sense meaning hatred or ill will. The statute declares: \"Malice is shown, in respect of libel, by making a publication or communicating it to others, wilfully and purposely to the prejudice and injury of another. Hatred or ill will towards the party injured is not essential to libel.\" R. L. 1935,  6054.\n\nBut the legal inference that may be drawn from the making of a publication willfully and purposely to the prejudice and injury of another without justification or excuse is not conclusive or irrebuttable. On the contrary, the presence or absence of malice is a rebuttable inference. And from whatever source the evidence may emanate, whether from the prosecution or from the defense or both, absence of legal malice is a complete defense. Truth which is inconsistent with malice is also a complete defense if published with good motives and for justifiable ends. The statute recognizes this. It provides: \"In every prosecution for writing or publishing a libel, the defendant may give in evidence in his defense upon the trial the truth of the matter contained in the publication charged to be libelous; provided, however, that such evidence shall not be deemed a justification, unless it shall be further made to appear on the trial that the matter was published with good motives and for justifiable ends.\" R. L. 1935,  6055.\n\nA \"motive\" is what induces action; it is the specific mental cause of bodily action. Motives may be good or bad. \"End\" is a general term signifying the thing that ends one's wishes or endeavors; the consummation of a scheme. The \"end\" is that which terminates any course or proceeding. The \"end\" may or may not justify the action or the means employed for its attainment. The meanings and connotations of the phrases \"good motives\" and \"justifiable State of New York in its opinion by Kent, J., as a perfectly correct, comprehensive and accurate definition of the true standard of the freedom of the American press. No case has been called to my attention and personal industry has developed none where any question has arisen as to the meaning of those terms or their application. The cases cited in the accompanying marginal note\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e are instances of the acceptance of those terms in all their historical and legal significance and their application to the defense of justification under statutes similar to ours where truth of the matter contained in the publication charged to be libelous was a complete defense where it also appeared that the libelous matter was published with good motives and for justifiable ends. From the English and American authorities to which I have had access, in which the same or similar terms have been construed, I conclude that as applicable to truth as a defense, the term \"good motives\" means that the publisher was not motivated by malice but, on the contrary, was motivated by good motives consistent with the relations the publisher bore to others and that the term \"justifiable ends\" means that the end was justified by\n\nthe occasion which motivated the publication, to wit, matters giving rise to privileges, including fair comment upon matters of public concern. The phrases \"good motives\" and \"justifiable ends,\" as adopted by Hawaii and incorporated in the libel law, must be taken with their respective accepted legal meanings. ( Seven Cases v. U. S., 239 U.S. 510, 517.)\n\nIt must be apparent that \"good motives\" are the antitheses of legal malice. \"Justifiable ends\" rebut malice. And where, as here, truth as a justification presupposes falsity, that truth is inconsistent with malice when published with good motives and for justifiable ends.\n\nThe trial court admitted evidence offered by the defendants of the truth of that portion of the defamatory article which charged that the person defamed had \"lied and deceived workers.\" (Prosecution's Requested Instruction No. 19.) A showing that the defamatory matter was published with good motives and for justifiable ends is, under the statute, a condition precedent to the receipt by the court of evidence of the truth of the matter contained in the publication charged to be libelous. The receipt by the court of evidence offered by the defendants of the alleged truth of the matter referred to and contained in the publication charged to be libelous was tantamount to a conclusion by the trial judge that as a matter of law the occasion of the publication was a matter of public concern and subject to fair comment and that if the defamatory matters contained in the article were true, the publication was made with \"good motives\" for \"justifiable ends\" and hence privileged. And rightfully so. Whether or not a publication is privileged is a question of law for the court. The subjects of the article in which the defamatory matter referred to was included were clearly matters of public concern. The article referred to the present political relations between the government of the United States and the government of the Philippine Islands; to negotiations had between employers\n\nand workmen which subsequently upon the trial developed to have been negotiations had to settle a strike between the managers of three sugar plantations on the Island of Maui, represented by the secretary of the Hawaiian Sugar Planters Association, a voluntary association composed of practically all of the sugar plantations in the Territory, including the three plantations involved, and a committee representing four thousand striking Filipinos formerly in the employ of the three plantations; and to a criminal prosecution which was the outgrowth of the strike then pending before the circuit court of the second circuit, the parties defendants to which included members of the committee representing the strikers and the dismissal of which, it was claimed by the latter, was promised by the secretary of the Hawaiian Sugar Planters Association, upon the occasion of which it was charged that the secretary of the Hawaiian Sugar Planters Association had \"lied and deceived the workers.\" The truth of the charge that the secretary of the Hawaiian Sugar Planters Association had lied and deceived the workers became an issue of fact, not as truth in the abstract but as evidence of the absence of malice.\n\nMoreover, the prosecution did not abide the inference of legal malice that the statute afforded. It introduced extrinsic evidence of actual malice or malice in fact in the form of publications appearing in the Hawaii Sentinel relating to the same subject matter published before and after the time of publication of the article, which was the basis of the prosecution. Actual malice or malice in fact is usually referred to as \"express malice\" to distinguish it from \"implied malice\" or the malice in law whichis presumed to exist from the publication of defamatory matter without justification or excuse. This evidence of actual malice was pertinent only to the defense of justification. \"Justifiable ends\" neutralize the inference of legal malice. And failing to prove legal malice, it was incumbent upon\n\nthe prosecution that it prove actual malice. The prosecution introduced this evidence not by way of rebuttal but as a part of its case in chief in anticipation of the defense of truth. To meet the situation as thus presented by the prosecution, the defendants, as a part of their defense, offered evidence of the absence of actual malice.\n\nHence it was that upon the conclusion of the case the issue of malice was in the following situation: The language included in the article to which I have heretofore referred was libelous of itself and gave rise to the inference of legal malice. The prosecution had also introduced evidence of actual malice. There was evidence offered by the defense tending to show good motives and justifiable ends. This evidence tended to prove absence of legal malice. There was also evidence introduced as a part of the defense tending to prove the truth of the libelous charge. This evidence of truth tended to rebut legal malice. But neither good motives nor justifiable ends nor truth constituted a defense if the defendants were actuated by actual malice. The defendants offered evidence tending to show the absence of actual malice. Upon the Territory rested the burden of proving legal malice. Failing this, there also rested upon it the additional duty of showing actual malice. Against this evidence was evidence of good motives, justifiable ends, truth and absence of actual malice. Obviously there was a sharp conflict between the prosecution and the defense upon the issues of legal and actual malice. Proof beyond a reasonable doubt of the affirmative of the issues of legal and actual malice and every essential element of the offense included in those terms devolved upon the prosecution. Any doubt redounded to the benefit of the accused. It was immaterial whence that doubt arose. Further it was immaterial as to the weight of the evidence that might create a reasonable doubt.\n\nMany of the cases cited by the prosecution refer to the\n\nburden of proof being on the defendant when truth is interposed as a defense. This expression, however, means nothing more than that that burden rested upon the defendant when interposing such defense of going forward. Where the prosecution in a case for libel makes out a prima facie case of malicious publication of a defamatory libel, the burden of going forward, usually characterized as the burden of proof, rests upon the defendant. But the burden of proof, strictly speaking, that is, proof of the essential ingredients of the offense, never shifts in a criminal case. It abides with the prosecution throughout the case. It never shifts to the defendant. And where the prosecution makes out a prima facie case and the defendant assumes the burden of proof of justification, the burden of proof of malice still abides with the prosecution and it must prove malice and all the elements involved therein beyond a reasonable doubt. Where the inference of malice is offset by evidence of truth, with good motives and for justifiable ends, the burden remains with the prosecution to prove actual malice and the falsity of the defamatory charges. It was not the duty of the defendants to prove by any degree of evidence, call it preponderance of evidence or what you will, that the defamatory article was true and published with good motives or for justifiable ends or to show that it was not published with actual malice. It was the duty of the prosecution to prove the opposite. And this, beyond a reasonable doubt.\n\nThe vice of prosecution's instruction number 3 is obvious. It was prima facie prejudicial. As an instruction on the civil side for damages, it was applicable. But to a criminal prosecution it had no application. It is diametrically opposed to every theory of proof in criminal cases beyond a reasonable doubt. And its effect was to deprive the defendant of a fair trial.\n\nDefendants' requested instruction number 22, though faulty in some respects, substantially sets forth the correct\n\nrule. Nor can it be said that any of the instructions given cured the error committed in giving prosecution's requested instruction number 3. Taken in connection with the prosecution's requested instruction number 5, all that was necessary for the prosecution to prove under its requested instruction number 3 was publication. Whereupon, under instruction number 5, the burden of proof of the defense of truth lay with the defendants; and proof by a preponderance of the evidence. Nor did the defendants' instructions numbers 2 and 6, given by agreement, cure the error. To instruct the jury, in the face of instructions numbers 5 and 3, that the burden of proof was not on the accused but rested upon the prosecution from the beginning to the end of the trial and applied to every element to constitute the crime, was inconsistent, conflicting and misleading.\n\nThis is a matter of first impression in this jurisdiction. Other jurisdictions, however, have solved the problem against the propriety of an instruction imposing the duty upon the defendant in the case of criminal libel of proving justification by a preponderance of the evidence. In the case of State v. Wait, 44 Kan. 310, 24 Pac. 354, the defendant was charged with criminal libel. The Kansas bill of rights provided that in all civil or criminal actions for libel the truth might be given in evidence to the jury and if it should appear that the alleged matter was published for justifiable ends the accused party should be acquitted. The statutes of Kansas also contained the provision that in all prosecutions or indictments for libel the truth thereof might be given in evidence to the jury and if it appeared to them that the matter charged as libelous was true and was published with good motives and for justifiable ends, the defendant should be acquitted. That portion of the statute requiring the defendant, in order to make good his defense, to prove that the alleged libelous matter was published with \"good motives,\" had been held to be violative of the\n\nconstitutional provision pertaining to the same subject matter so that the statute, to the extent that it exceeded the provisions of the Constitution, was not applicable and that proof of truth for justifiable ends was sufficient to enable a defendant to acquittal. Error was assigned to the giving of certain instructions on the defense of justification. In considering the instructions given, the court held: \"Where the defendant in a criminal prosecution for libel justifies upon the ground that the alleged libelous matter was and is true, and was published for justifiable ends, he is required to prove, or in some manner to show only its substantial truth, and that it was published for justifiable ends; and he is not required to prove or show the truth of any of the alleged libelous matter except such as wouldin fact be libelous if not true; and he is not required to prove or show the truth of even that portion of the alleged libelous matter by a preponderance of the evidence, but only by evidence sufficient to create a reasonable doubt in the minds of the jury.\"\n\nIn State v. Bush, 122 Ind. 42, 23 N. E. 677, the trial court charged the jury that if they found that the defendants published the words charged, it was their duty to find them guilty unless they further found that they had proved that the words spoken were true and that the publication was made in good faith. The appellate division held that the defendants \"were not required to prove the truth of the publication to entitle them to an acquittal, if from all the evidence before the jury, a reasonable doubt arose in the minds of the jury as to the truth of the publication, the appellees are entitled to the benefit of that doubt, and, therefore, to a verdict of not guilty.\"\n\nThe issue here presented is not unlike that arising in prosecutions for murder where the defense is insanity. In murder, malice is presumed from certain facts and persons are held responsible for the consequences of their acts upon presumes that every one charged with crime is sane, and thus supplies in the first instance the required proof of capacity to commit crime. It authorizes the jury to assume at the outset that the accused is criminally responsible for his acts. But that is not a conclusive presumption, which the law upon grounds of public policy forbids to be overthrown or impaired by opposing proof. It is a disputable or, as it is often designated, a rebuttable presumption resulting from the connection ordinarily existing between certain facts. * * * In a certain sense it may be true that where the defence is insanity, and where the case made by the prosecution discloses nothing whatever in excuse or extenuation of the crime charged, the accused is bound to produce some evidence that will impair or weaken the force of the legal presumption in favor of sanity. But to hold that such presumption must absolutely control the jury until it is overthrown or impaired by evidence sufficient to establish the fact of insanity beyond all reasonable doubt or to the reasonable satisfaction of the jury, is in effect to require him to establish his innocence, by proving that he is not guilty of the crime charged. * * * Strictly speaking, the burden of proof, as those words are understood in criminal law, is never upon the accused to establish his innocence or to disprove the facts necessary to establish the crime for which he is indicted. It is on the prosecution from the beginning to the end of the trial and applies to every element necessary to constitute the crime. Giving to the prosecution, where the defence is insanity, the benefit in the way of proof of the presumption in favor of sanity, the vital question from the time a plea of not guilty is entered until the return of the verdict, is whether upon all the evidence, by whatever side adduced, guilt is established beyond reasonable doubt. * * * How then upon principle * * * can a verdict of guilty be properly returned, if the jury entertain a reasonable doubt as to the existence of a fact which is essential to guilt,\n\nnamely, the capacity in law of the accused to commit that crime?\"\n\nIn State v. Greenville Pub. Co., 102 S. E. 318, the court said: \"In order to a conviction of libel by reason of a defamatory publication of this character, it must be shown that it is both false and malicious, and our decisions on the subject are to the effect further that the 'falsity of the charge is not of itself sufficient to establish malice, there being a presumption that such a publication is made in good faith.' True, the malice referred to is not necessarily that of personal ill will or malevolence; it may be said to exist when it is shown that the publication is made from some ulterior motive, and it may be inferred where a defamatory statement is knowingly false or made without any fair or reasonable grounds to believe in its truth, or, at times, from the character and circumstances of the publication itself, but with the exception, probably, that a man's general moral character is presumed to be good until the contrary is shown; this being, as stated, a case of qualified privilege, the burden is on the state to show, and, in a criminal prosecution, to show beyond a reasonable doubt, that the defamatory charge is both false and malicious.\" In Graham v. State, 7 Ga. App. 407, 66 S. E. 1038, the syllabus opinion is as follows: \"The prosecutor and the defendant were members of the same secret fraternal benevolent order, called 'The Supreme Circle.' The defendant made a written accusation against the prosecutor, charging him with aiding and abetting a felonious assault made upon the person of a brother member. The accusation was made within the order, in strict accordance with the rules, and apparently for the sole purpose of having the charges investigated by the members of the lodge, under its rules. Held : (1) The written accusation was one of qualified privilege. (2) The burden was on the prosecutor to show that the accusation was both false\n\nin fact and malicious in purpose.\" In the case of Kelly v. State, 195 S. W. (Tex. Cr. App.) 853, 854, the court held: \"A paragraph of the court's charge submitting the issue to the jury is as follows: 'If you believe from the evidence that Earnest Kelly, in Hunt county, Texas, on or about the 1st day of December, 1916, did orally, falsely, maliciously, and wantonly impute a want of chastity to Mrs. Will Tingle, you will find the defendant guilty; and if you do not so believe from the evidence, you will return a verdict of not guilty.' This is criticized as susceptible of the construction that it required the appellant to prove his innocence. On another trial the court will doubtless frame his charge so as to avoid this criticism, and to clearly place upon the state the burden of proof throughout the case to prove the appellant's guilt beyond a reasonable doubt.\"\n\nDefendants' instructions 2 and 3, which were given by agreement, are stock instructions upon burden of proof. Prosecution's requested instruction number 5 refers primarily to malice. The court had instructed the jury elsewhere that under section 6054 malice was presumed. Although the court had instructed the jury that the article was libelous per se, it included in the instruction the statutory definition of libel. Taking the prosecution's instructions as a whole, the only issue of fact presented to the jury was that of publication. But prosecution's instruction number 3 singled out justification and made it the basis of a special instruction upon the weight of the evidence necessary for the defendants to sustain the defense of justification. And, taken with prosecution's instruction number 19, it in effect charged the jury that unless they believed that the person defamed had lied and deceived workers as contained in the newspaper article of September 9, 1937 (the article made the basis of the prosecution), by a preponderance of the evidence there was no privilege or freedom of the press that would condone the publication of that statement.\n\nThe obvious effect of these instructions was to impress upon the minds of the jury that before they could acquit the defendants, it was incumbent upon them to prove their innocence by a preponderance of the evidence.\n\nWhile the jury was correctly instructed upon the general rule of burden of proof, it was not told to disregard the objectionable instruction charging it that it was incumbent upon the defendants to prove the defense of justification by a preponderance of the evidence. Prosecution's instruction number 3 was clearly prejudicial. \"An erroneous instruction, clearly prejudicial, cannot be cured by another instruction which correctly states the law, but does not call the attention of the jury to the erroneous instruction.\" Ter. v. Kaeha, 24 Haw. 467, 471. (See also Territory v. Richardson, 17 Haw. 231, 237.)\n\nTo briefly summarize: Where, as here, the jury is correctly instructed generally upon the burden of proof obtaining in criminal cases but is also instructed by way of qualification of an instruction upon the degree of proof devolving upon the prosecution to prove publication that \"once such publication is proved to your satisfaction beyond a reasonable doubt, the burden is thereafter upon such defendant or defendants to prove to your satisfaction, by a preponderance of the evidence that the charges [here follows the libelous matter] at the time of its publication, true and, further, that they were published with good motives and for justifiable ends\" such instruction is reversible error. (Prosecution's Requested Instruction No. 3.)\n\nIn every criminal prosecution the defendant is presumed to be innocent of the crime charged until the contrary is shown. To overcome this presumption of innocence and to establish guilt, every element necessary to constitute the crime must be proved beyond a reasonable doubt. Where, in a prosecution for publishing a libel, the defendant introduces evidence tending to prove the truth of the defamation\n\nand that it was published with good motives and for justifiable ends, it is incumbent upon the prosecution to prove beyond all reasonable doubt the falsity of the defamatory matter and that it was not published with good motives and for justifiable ends. Conversely if, from all the evidence before the jury, a reasonable doubt arises in the minds of the jury as to the truth of the publication and that it was published with good motives and for justifiable ends, the defendant is entitled to the benefit of that doubt and to an acquittal.\n\nConcluding as I do that the giving of prosecution's requested instruction number 3 was reversible error, it becomes further necessary to express my views upon the following contentions of the plaintiffs in error: 1. that the article complained of was not libelous; 2. that the alleged libelous matter is fair comment upon a matter of public interest; and 3. that the provisions of chapter 196, sections 6050 to 6059, both inclusive, hereinafter referred to as the \"libel law,\" are unconstitutional and void upon the several grounds urged. None of the other errors assigned except those herein expressly referred to are passed upon.\n\n1. First, as to the claim that the article is not libelous. It is quoted in full in the margin as published, omitting the name of the person defamed.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e person and bring him into disgrace, abhorrence, etc., proof of a libel is complete. The statutory definition incorporates into the body of the laws of the Territory a declaration of that which was a misdemeanor at common law. It may be said to be declaratory of the common law. The reason why the publication of a libel is condemned and made a criminal offense is its tendency to provoke a breach of the peace. In the case of Commonwealth v. Clap, 4 Mass. 163, 3 Am. Dec. 212, the court said: \"The cause why libellous publications are offences against the state, is their direct tendency to a breach of the public peace, by provoking the parties injured, and their friends and families, to acts of revenge, which it would not be easy to restrain, were offences of this kind not severely punished. And every day's experience will justify the law in attributing to libels that tendency which renders the publication of them an offence against the state.\" (See also Newell, Slander and Libel [4th ed.],  809, p. 917,  807, p. 916,  828, p. 934,  830, p. 935, and cases cited; 3 Col. L. Rev. 546; 18 The Laws of England [Halsbury], T. Libel, p. 605; Coleman v. MacLennan, 78 Kan. 711, 98 Pac. 281; State v. Levand, 37 Wyo. 372, 262 Pac. 24; State v. Gardner, 112 Conn. 121, 151 Atl. 349.)\n\nCivil and criminal prosecutions are obviously different in their purpose and end. In the former an individual invokes a remedy for the invasion of a personal right; in a criminal prosecution the public \"seeks to restrain and prohibit acts, which would destroy the peace and harmony of society.\" Commonwealth v. Snelling, 15 Pick. (Mass.) 337. Nor in a criminal prosecution for the publication of a libel is it considered whether the publication be true or false \"because a man may maliciously publish the truth against another, with the intent to defame his character, and if the publication be true, the tendency of it to inflame the passions, and to excite revenge, is not diminished, but may sometimes be strengthened.\" Commonwealth v. Clap, supra. ( Commonwealth v. Blanding, 3 Pick. [Mass.] 304, 15 Am. Dec. 214, 217; State v. Burnham, 9 N. H. 34, 31 Am. Dec. 217, 220; Newell, Slander and Libel [4th ed.],  700, p. 768.) Hence it is that falsity of the alleged libelous charge need not be alleged in an indictment or information. ( Robinson v. State, 108 Md. 644, 71 Atl. 433; State v. Fosburgh, 32 S. D. 370, 39 Am. \u0026 Eng. Ann. Cas. [1916A] 424; State v. Lomack, 130 Iowa 79, 106 N. W. 386.)\n\nWhere a defamatory article is libelous, truth in the first instance is immaterial and upon proof of a malicious publication there is a prima facie case of violation of the statute. It is only when the defendant interposes the defense of justification that truth with good motives and for justifiable ends comes in issue and its proof is subject to the general rules applicable to libel.\n\nIt is well-settled that \"to impute to another in libelous form conduct which tends to lower the other's reputation for veracity or honesty, irrespective of whether such conduct constitutes a criminal offense and irrespective of whether it tends to affect the trade, business, or profession\" is libelous per se. (Restatement, Law, T. Torts,  569 [comm. g], p. 169. See also Commonwealth v. Wright, 1 Cush. [Mass.] 46;\n\nRichardson v. State, 66 Md. 205, 7 Atl. 43; State v. Mayberry, 33 Kan. 441, 6 Pac. 553; Commonwealth v. Clap, supra; Colvard v. Black, 110 Ga. 642, 36 S. E. 80; Paxton v. Woodward, 31 Mont. 195, 78 Pac. 215; Johnson v. Commonwealth, 10 Sad. [Pa.] 514; Farley v. Publishing Co., 113 Mo. App. 216, 87 S. W. 565; Commonwealth v. Damon, 136 Mass. 441.) Whatever may be characterized civilly as libelous per se is criminally libelous within the definition of criminal libel defined by section 6050.\n\nThe imputation of falsehood and deceit which runs through the entire article is clearly libelous. The language employed is plain and unambiguous. The import of the term employed is clear and unequivocal. No innuendos were required to explain their meaning. The allegations of extrinsic facts were unnecessary for the purpose of showing the application to the party libeled of the defamatory matter on which the information was founded, further than to state generally that the same was published concerning him. The tendency of the language referred to tended to subject the person condemned to the ignominy characterizing the offense ( 6050) and in the absence of justification was sufficient without more to sustain a verdict of guilty of the offense of publishing a libel.\n\n2. As heretofore stated the article complained of had reference to matters of public interest and concern. As such it was a legitimate subject of fair and reasonable comment. (Newell, Slander and Libel [4th ed.],  477, p. 516,  481, p. 520; Gott v. Pulsifer, 122 Mass. 235, 238; Flanagan v. Nicholson Pub. Co., 137 La. 588, 68 So. 964, 968, and cases cited; Commonwealth v. Pratt, 208 Mass. 553, 95 N. E. 105, 106; Conroy v. Pittsburgh Times, 139 Pa. 334, 337; Scripps v. Foster, 41 Mich. 742, 3 N. W. 216; Peoples v. Detroit Post \u0026 Tribune, 54 Mich. 457, 20 N. W. 528.) Comment may descend to ridicule, sarcasm and even invective, without sacrifice of the immunity of the privilege. ( Gott v. Pulsifer, supra; Hubbard v. Allyn, 200 Mass. 166, 170, 86 N. E. 356, 358.) Criticism of the truth may be severe, harsh, bitter or sarcastic; even caustic if the facts warrant it.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e But the right of discussing matters of public interest does not extend to the making of false statements of fact. (Newell, Slander and Libel [4th ed.],  483, p. 521; Ferguson v. Houston Press Co., 1 S. W. [2d] [Tex. Civ. App.] 387; Hubbard v. Allyn, supra; Dow v. Long, 190 Mass. 138, 141, 76 N. E. 667.) Freedom of discussion rather than of statement is the criterion. The right to comment does not include the right to make false statements. Nothing short of the truth will suffice. As said in the case of Burt v. Advertising Newspaper Co., 154 Mass. 238, 28 N. E. 1, 4, \"We agree with the defendant, that the subject was of public interest, and that in connection with the administration of the custom-house the defendant would have a right to make fair comments on the conduct of private persons affecting that administration in the way alleged. But there is an important distinction to be noticed between the so called privilege of fair criticism upon matters of public interest, and the privilege existing in the case, for instance, of answers to inquiries about the character of a servant. In the latter case a bona fide statement, not in excess of the occasion is privileged, although it turns out to be false. In the former, what is privileged, if that is the proper term,is criticism, not statement, and however it might be if a person merely quoted or referred to a statement as made by others, and gave it no new sanction, if he takes upon himself in his own person to allege facts otherwise libellous, he will not be privileged if those facts are not true.\"\n\nThe gist of the libelous charges in the instant case is that one of the terms of the agreement under which the strikers returned to work was a promise made by the prosecutor as the agent of the employers that a pending criminal case in which strikers were defendants would be discontinued but that despite such promise the prosecution had not been discontinued, on the contrary, had proceeded to conclusions at the instance of the attorney employed by the Hawaiian Sugar Planters Association, of which the employers were members; and thus the prosecutor had lied and deceived the workers. This is a statement of fact and not of criticism upon facts. And if the statement were untrue, even if the occasion of its publication were privileged, justification would not exist. The justification however need be no broader than the libelous charges. This is the general rule. \"Proof of the substance of the defamatory charge is a justification and it is not necessary that every immaterial portion of the charge be proved true.\" 37 C. J., T. Libel and Slander,  508, p. 87.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The provisions of section 6055 are confirmatory of the general rule. Were all references to falsehood and deceit on the part of the prosecutor withdrawn from the article, the article would not be libelous. It is the truth of the \"libelous charges\" contained in the article and not the truth of immaterial nonlibelous matters that, under the statute ( 6050), constitutes justification. If there is evidence, more than a mere scintilla, tending to prove the substance of the \"libelous charges\" the defense of justification has been sustained.\n\nMoreover truth is a question of fact and not of law. So long as there is evidence, more than a mere scintilla, tending\n\nto show the truth of the \"libelous charges\" its weight and credibility is for the jury and not a question of law for the court. It is for the trier of the facts to decide whether the truth of the defamatory matter is established by the evidence.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nIn this case there was evidence, more than a mere scintilla, tending to prove the truth of the \"libelous charges\" contained in the article. Whether or not that evidence was true or false is not for this court to say.\n\n3. Little need be said in defense of the constitutionality of the territorial libel law. Defendants claim that the law is unconstitutional for the reason that it fails to commit to the jury the determination of the law as well as the facts. Many of the State constitutions contain such a provision in their bill of rights. Many State statutes so provide. The Croswell case was the motive of the adoption of a constitutional provision to that effect by the State of New York. But no case has been called to my attention and I know of none that holds that the failure to so provide violates the guaranty of freedom of the press of the first amendment or those of the fifth or fourteenth amendments of the Constitution. Neither the right of trial by jury nor due process is violated by the power reserved to the court to instruct the jury upon the law of the case. The same may be said of the claim that the libel law is unconstitutional for the reason that under the provisions of section 6055, where truth is a defense, there is committed to the court as a question of law\n\nand not to the jury as a question of law and fact, the issue whether the alleged defamatory matter is published with good motives and for justifiable ends.\n\nNor does the failure of the libel law to impose upon the prosecution the duty of proving the falsity of the alleged defamatory matter violate the guaranties referred to. As heretofore pointed out, falsity of the defamatory matter is not an element of the statutory offense of publishing a libel and need not be proved except upon the introduction by the defendant of evidence of truth in support of the defense of justification. It was not at common law. And I see nothing in the guaranty of freedom of the press inhibiting the legislative adoption of the common-law offense of publishing a libel. Massachusetts did so and the supreme court of that State held that it was not violative of the State guaranty of freedom of the press. (See Commonwealth v. Blanding, supra, cited with approval in Near v. Minnesota, 283 U.S. 697, 714.) The same may be said of the provisions of the statute in respect to truth as a defense. The libel law does not impose upon the defendant the duty of proving the truth of the alleged defamatory matter. On the contrary, wheretruth is interposed as a defense, the burden is upon the prosecution to prove its falsity. Nor does the law impose upon the defendant by the provisions of section 6054 the burden of rebutting malice. The statute imposes no duty upon the defendant of rebutting anything. The section is merely a statutory rule of evidence that ordinarily obtains where the unlawful act imputes an unlawful intent in the absence of justification or lawful excuse. Where an article is libelous, malice is a reasonable inference arising from publication. The statutory rule is but confirmatory of the general rule applicable to libel in the absence of statute. (Wharton's Crim. Ev. [11th ed.],  353, pp. 534, 535; Commonwealth v. Snelling, supra.) The rule of evidence\n\nin that regard is based upon reason. The libel law contains no limitation upon the general rule that burden of proving malice is upon the prosecution. Nor does the libel law as a whole impose any unreasonable restrictions upon the right of a free press.\n\nConceding freedom of the press to be a natural and inherent right, it is not, however, absolute and is subject to restriction and limitation. ( Schenck v. United States, 249 U.S. 47; Debs v. United States, 249 U.S. 211; Abrams v. United States, 250 U.S. 616; Gilbert v. Minnesota, 254 U.S. 325, 332.)\n\nLibel statutes are passed in the exercise of the recognized police power of the State for the peace, morals and good order of society. \"But it is recognized that punishment for the abuse of the liberty accorded to the press is essential to the protection of the public, and that the common law rules that subject the libeler to responsibility for the public offense, as well as for the private injury, are not abolished by the protection extended in our constitutions.\" Near v. Minnesota, supra, p. 715. Liberty of the press is not an absolute right and the State may punish its abuse. ( Near v. Minnesota, supra; Stromberg v. California, 283 U.S. 359, 368.) Included in the power to impose reasonable restrictions upon free speech is the power to limit truth as a defense. The limitations upon truth as a defense imposed by section 6055 are in effect substantive provisions qualifying the offenses defined by sections 6050, 6052 and 6053 and limiting the effect of the inference of law created by section 6054. There is no constitutional right to publish a fact merely because it is the truth. Hence it cannot be said that under the provisions of section 6055 the truth is unreasonably limited and restricted to those occasions only where the defamatory matter complained of is published with good motives and for justifiable ends.\n\nFinally as to the objection that the terms \"good motives\" and \"justifiable ends\" contained in section 6055 are vague and indefinite, as a result of which defendant in a prosecution for libel cannot be advised of the cause and nature of the accusation against him. Sufficient has been said to show the fallacy of this contention. These terms were incorporated in our libel law similarly as they have been adopted elsewhere with a full appreciation of their meaning and connotation. As said by Mr. Chief Justice Hughes in the case of Connally v. General Const. Co., 269 U.S. 385, 391: \"[They] are well enough known to enable those within their reach to correctly apply them.\" (See also Hygrade Provision Co. v. Sherman, 266 U.S. 497, 502; Omaechevarria v. Idaho, 246 U.S. 343, 348.)\n\nIn conclusion let me say that the scope of the statutory defense of justification permitted by section 6055 is as broad as the concepts of the term \"freedom of the press\" itself. Mr. Justice Kent defined \"liberty of the press\" as follows: \"The liberty of the press consists in the right to publish, with impunity, truth, with good motives, and justifiable ends, whether it respects government, magistracy or individuals.\" People v. Croswell, supra. Mr. Justice Story defined \"liberty of the press\" thus: \"It is neither more nor less, than an expansion of the great doctrine, recently brought into operation in the law of libel, that every man shall be at liberty to publish what is true, with good motives and for justifiable ends. And with this reasonable limitation it is not only right in itself, but it is an inestimable privilege in a free government. Without such a limitation, it might become the scourge of the republic, first denouncing the principles of liberty, and then, by rendering the most virtuous patriots odious through the terrors of the press, introducing despotism in its worst form.\" Story's Commentaries, Constitution,  993, p. 704. \"Nay; it has farther been held, that the truth of the facts is not alone\n\nsufficient to justify the publication, unless it is done from good motives, and for justifiable purposes, or, in other words, upon an occasion, (as upon the canvass of candidates for public office,) when public duty, or private right requires it.\" Story's Commentaries, Constitution,  996, p. 707. Story is cited with approval in the dissenting opinion of Mr. Justice Butler in Near v. Minnesota, supra, p. 733.\n\nConstrued in its broadest sense \"freedom of the press\" consists of no more than \"the right, without any previous license or censorship, to publish the truth with good motives and for justifiable ends.\" 11 Am. Jur., T. Const. Law,  320, p. 1111, citing People v. Croswell, 3 Johns. Cas. 337-393; Cincinnati Gazette Co. v. Timberlake, 10 Ohio St. 548, 555; Ex Parte Meckel, 87 Tex. Cr. Rep. 120, 220 S. W. 81, 82.\n\nConsistently with the view herein expressed the judgments and sentence entered in both cases should be vacated and set aside and the causes remanded for a new trial.\n\n\u003cspan class=\"fn\"\u003e1. \"Gen. 'Blank' Fans Far East Fires Fascist Hawaii defies the President of the United States. It slaps Secretary of State Cordell Hull in the face. It laughs in scorn and derision at Secretary of War Harry Woodring. Deliberately, maliciously, in the face of fair warning and despite the pleas of our country's leaders, it acts to win for America the hatred of a nation whose good will is vital to our nation now. That nation is the new Philippine Nation, eighteen millions of people whose friendship today is essential to us, and whose good will Washington is striving to hold. Fascist Hawaii is making the name American a hissing in the Philippines, aiding there the aims of propagandists of Asian imperialism.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. This conclusion is in harmony with the law in Hawaii and the common law. ( Ter. of Haw. v. Wong Shui King, 14 Haw. 612, 620; Kahanamoku v. Advertiser, 25 Haw. 701; Baldwin v. Tribune-Herald, 30 Haw. 610, 617; Cooley, Torts [3d ed.], p. 402; 3 Greenleaf, Evidence [16th ed.],  164; Newell, Slander and Libel [4th ed.],  804, 806, 827, 828, 830; McLain, Crim. L., ch. 45; Washington Post Co. v. Chaloner, 250 U.S. 290, 293; Pollard v. Lyon, 91 U.S. 225, 230, 23 L. ed. 308, 311, 312; Colvard v. Black, 36 S. E. [Ga.] 80; State v. Sterman, 202 N. W. [Iowa] 222; State v. Cooper, 116 N. W. 691, 692; Cole v. Commonwealth, 300 S. W. [Ky.] 907; State v. Norton, 36 Atl. 394, 395; Commonwealth v. Wardwell, 136 Mass. 164; Paxton v. Woodward, 78 Pac. [Mont.] 215; Johnson v. Commonwealth, 14 Atl. [Pa.] 425; Van Ness v. Hamilton, 19 Johnson's [N. Y.] 296; and many others.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. ( State of Iowa v. Haskins, 109 Iowa 656, 80 N. W. 1063; State v. Wait, 44 Kan. 310, 24 Pac. 354; Richardson v. State, 66 Md. 205, 7 Atl. 43; Commonwealth v. Snelling, 15 Pick. [Mass.] 337; State v. White, 29 N. C. [7 Ired. L.] 180; State v. Colby, 126 Atl. [Vt.] 510; note 74 A. L. R. 733.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. (See Newell, Slander and Libel [4th ed.],  575, 700; Odgers, Libel and Slander, p. 538.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. (See Newell, Slander and Libel [4th ed.],  807, 809, 828, 830; State v. Gardner, 112 Conn. 121, 151 Atl. 349; Coleman v. MacLennan, 78 Kan. 711, 98 Pac. 281; Commonwealth v. Clap, 4 Mass. 163, 3 Am. Dec. 212; Commonwealth v. Snelling, 15 Pick. [Mass.] 337; State v. Levand, 37 Wyo. 372, 262 Pac. 24.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. For the history of this development in Massachusetts see Perry v. Porter, 124 Mass. 338; Newell, Slander and Libel (4th ed.),  658, 715; Dorr v. United States, 195 U.S. 138, 49 L. ed. 128.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In addition to this instruction the court gave other instructions re burden of proof as follows: \"I instruct you that the elements necessary to make out a case of criminal libel are a publication in writing * * * which directly tends to injure the fame, reputation or good name of another person, and bring him into disgrace, abhorrence, odium, hatred, contempt or ridicule or cause him to be excluded from society. If you find beyond a reasonable doubt that the defendants, or either of them, maliciously put into circulation the newspaper article set out in these charges (which, taken as a whole, is a libelous article) or promulgated, exhibited or distributed the same for the purpose of making it known to others, and have thereby in fact made it known to others -- or have in any way aided or assisted in so doing -- I instruct you that they have published a libel.\" (Prosecution's Requested Instruction No. 5.) And further, the court instructed the jury with the consent of the defendant: \"I instruct you that unless you believe that the allegation that General 'Blank' lied and deceived workers (as contained in the newspaper article of September 9th, 1937) is true, there is no privilege or freedom of the press that will condone the publication of that statement. But if you believe from all the evidence that General 'Blank' did lie and deceive as alleged in said publication, then the privilege or freedom of the press applies.\" (Prosecution's Requested Instruction No. 19, given by agreement.) Also, the court instructed the jury: \"I instruct you that the issue which you are to try is that presented by the information, and the defendants' plea of not guilty in this case. For be it remembered, that the plea of not guilty puts in issue and requires the prosecution to prove each and every material allegation in the information beyond all reasonable doubt.\" (Defendants' Instruction No. 2.) And further: \"The burden of proof, as those words are understood in criminal law, is never upon the accused to establish their innocenceor to disprove the facts necessary to establish the crime for which they are charged. It is on the prosecution from the beginning to the end of the trial and applies to every element necessary to constitute the crime.\" (Defendants' Instruction No. 6.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. ( McArthur v. State, 59 Ark. 431, 27 S. W. 628; Graham v. State, 7 Ga. App. 407, 66 S. E. 1038; State v. Pierce, 12 Pac. [2d] [Ore.] 320; Kelly v. State, 195 S. W. [Tex.] 853.) Considerable discussion has been indulged in as to State v. Publishing Co., 179 N. C. 720, 102 S. E. 318. The citations in this case are from civil cases showing a doctrine existing in North Carolina in civil suits prior to 1891 (see Ramsey v. Cheek, 109 N. C. 270, 273), that \"if the words are actionable per se, the law presumes malice * * * unless the communication is privileged.\" At least as of 1901 there appears in the laws of North Carolina that a special procedure applied re newspapers. (See 1 Cons. Stat. of N. C. 1919,  2429-2432.) These sections have been continuously applied, re analogy to civil suits, as creating a qualified privilege re public officials and candidates for public office, requiring proof of falsity or of actual malice. Section 4229 of said laws also provides: \"If any person shall * * * transmit * * * any false and libelous statement * * *.\" (See also section 4230 re slander of \" innocent \" woman.) In other words by long precedent in North Carolina, proof of a qualified privilege in connection with newspapers presents a special situation coloring all the decisions from that State. In regard to State v. Bush, 122 Ind. 42, 23 N. E. 677, a study of the cases cited to support the \"reasonable doubt of truth\" rule, will easily dispose of it. They are cases of murder trials involving defense of insanity. After the Bush case, the Indiana legislature passed legislation re libel, requiring that the defamation be false as a primary ingredient of the existence of a criminal libel, not as part of an affirmative immunity, for an admitted libel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. ( State v. Bienvue, 43 La. 239 [36 La. Ann. ed. 378]. See also, State v. Conable, 81 Iowa 60, 46 N. W. 759; State v. Cooper, 138 Iowa 516, 520, 116 N. W. 691.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Commonwealth v. Snelling, 15 Pick. (Mass.) 337. (See also People v. Strauch, 93 N. E. [Ill.] 126, 132; People v. Fuller, 238 Ill. 116; Perry v. Porter, 124 Mass. 338; United States v. Sotto, 38 Philip. 666, 673; State v. Fosburgh, 32 S. D. 370; 37 C. J. 153; 17 R. C. L. 420; Newell, Slander and Libel [4th ed.], p. 765.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. (See The King v. Gibson, 6 Haw. 310, 312, 313; Commonwealth v. Snelling, supra; State v. Gardner, 112 Conn. 121, 151 Atl. 349, 350; State v. Bienvue, 43 La. 239 [note 9] [36 La. Ann. ed. 378]; Commonwealth v. Bonner, 9 Metc. 410; Pickerell v. State, 198 S. W. [Tex.] 303; Browning v. Strauch, 93 N. E. [Ill.] 126, 132; People v. Fuller, 238 Ill. 116; Perry v. McClure, 3 W. N. C. [Pa.] 58; United States v. Ocampo, 18 Philip. 1, 55.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. (See Wright v. Tribune-Herald, 31 Haw. 128, 139; Lyman v. Hilo Tribune, 13 Haw. 453; Schenck v. U. S., 249 U.S. 47; Debs v. United States, 249 U.S. 211; Abrams v. United States, 250 U.S. 616; Gilbert v. Minnesota, 254 U.S. 325, 332; People v. Croswell, 3 Johns. Cas. 337-393; Cincinnati Gazette Co. v. Timberlake, 10 Ohio St. 548, 555.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. (See In re Nelson, 103 Mont. 43, 60 Pac. [2d] 365, 371-372; Robertson v. Baldwin, 165 U.S. 275; Near v. Minnesota, 283 U.S. 697, 708, 713-715; Stromberg v. California, 283 U.S. 359, 368; Commonwealth v. Blanding, 3 Pick. [Mass.] 304, 15 Am. Dec. 214.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. (See Wright v. Tribune-Herald, 31 Haw. 128; Burt v. Advertiser Newspaper Co., 154 Mass. 238; Commonwealth v. Duncan, 127 Ky. 47, 104 S. W. 997; Oakes v. State, 98 Miss. 80, 54 So. 79; 25 Harv. L. Rev., p. 475; Odgers, Libel and Slander, p. 37; and other cases heretofore cited in the notes.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* * * What is Washington going to do about it? Will it step in to save American prestige in the Far East now, to save the honor of the United States Army, as it once stepped into Hawaii to defend the good name of the navy? For the crux of the peril of today is that the man who brought about the new danger is none other than a once-honored chief of the United States Army. This man, Major General 'Blank,' for money shed his country's uniform to don a lackey's livery. And as a lackey for the HSPA he has trafficked with the honor, credit and reputation of the United States Army to stir up international strife that his employers might profit. A series of events reveals the perfidy of the 'Blank' strategy and betrayal of American aims. Two months ago President Roosevelt, vetoing the bill Delegate Sam King, HSPA stooge, put in to ban entry of Filipinos to Hawaii, declared the bill menaced American weal in the Philippines. Behind the President stood the State Department, with all its knowledge of our Far Eastern needs. Behind him stood, also, the War Department with all its keen interest and experience in Philippine matters. \"'Hands off the Filipinos,' was Mr. Roosevelt's dictum. But General 'Blank' vetoed the president. 'To hell with the Filipinos and Philippine good will,' and he said it with action. General 'Blank' it was who, trading on his military title and prestige, made peace with the 4,500 Filipino workers on Maui two months ago. Promised by him, say Filipino leaders, was end of HSPA war upon workers, end of court persecution. Now, with open charges, undenied, that General 'Blank' lied and deceived workers who trusted to the honor of the U.S. Army, Maui is again on the verge of ferment. Instead of peace, General 'Blank' swings the HSPA sword, hurls HSPA mercenaries into the court to convict the Filipino leaders. And 60,000 Filipino workers cry out, send word to Manila, and all over their homeland, that America is a land of persecution, ruled by unprincipled and revengeful men. Over all their homeland goes word that American generals are liars and deceivers, schemers to oppress and imprison Filipinos who are innocent. How can America answer? How can it deny? How can it meet the whisper of the Pan-Asian advocate? The schemes of anti-American agitators and propagandists? America, by act of our kings of fascism intent on their works of greed and power, becomes a hateful thing to millions, and thereby the works of our President and our State, Navy and War Departments are nullified. What is Washington going to do about it? The Maui case has been a disgrace to the people of Hawaii. It has been a travesty on American justice, for in it public power has been seized and used ruthlessly for private terrorism and revenge. It has been a shame to the Roosevelt administration through connivance for wrong by the highest governmental powers in the Territory, the governor and the attorney general of Hawaii. It has been a signal to the Filipino people that their sons here will be victimized, abused, robbed of their rights and liberties under pretense of law and order. America's waning prestige in the Far East has been put on the auction block for profit by HSPA's lackey general. What is Washington going to do about it?\" (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Name of prosecutor deleted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. (Rev. Code Ariz. [1928],  4618; Const. Calif., art. 1,  9, Deering's Penal Code of Calif.,  251; Code D. C. [1929], T. 6,  40; Idaho Compiled Stats. [1919], T. 59, ch. 302,  8256; Const. Ill. [1870], art. II,  4, Ill. Rev. Stats., c. 38,  400; Const. Iowa [1931], art. 1,  7; Gen. Stats. Kan. [1915],  3769; Const. La. [1920],  989, p. 491; 2 Mass. Stats. [1932], ch. 278,  8, p. 3255; Const. Mich. [1908], art. II,  18; 2 Mason's Minn. Stats. [1927], ch. 92,  9904; Hemingway's Ann. Miss. Code [1917],  1008, p. 720; 4 Rev. Codes Mont. [1921], ch. 22,  10992, p. 88; Const. Neb. [1920], art. 1,  5; Const. Nev., art. 1,  9, 2 Rev. Laws Nev. [1912],  6428; Const. N. J. [1884], art. 1,  5; Const. N. M. [1912], N. M. Stats. [1929], art. II,  17; Const. N. Y., art. 1,  8, Cahill's Cons. L. of N. Y.; Compiled Laws Ann. N. D. [1913],  9552; Const. Okla., art. II,  22, Compiled Stats. [1921],  1803; Lord's Oregon Laws [1909],  2387; Comp. Laws S. D. [1929],  4085; Rem. Stat. Wash. [1922],  2425; Const. W. Va. [1872], art. III,  8; Const. Wis., art. I,  3.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. ( Near v. Minnesota, 283 U.S. 697; State v. Chase, 94 Fla. 1071, 114 So. 856; Eldridge v. State, 27 Fla. 162, 9 So. 448; People v. Strauch, 247 Ill. 220, 93 N. E. 126; La Monte v. Kent, 163 Ill. App. 1; People v. Spielman, 318 Ill. 482, 149 N. E. 466; People v. Fuller, 238 Ill. 116, 87 N. E. 336; State v. Conable, 81 Iowa 60, 46 N. W. 759; Coleman v. MacLennan, 78 Kan. 711, 98 Pac. 281; State v. Brady, 44 Kan. 435, 24 Pac. 948; Castle v. Houston, 19 Kan. 417; State v. Verry, 36 Kan. 416, 13 Pac. 838; Perret v. New Orleans Times Newspaper, 33 La. Ann. 170; Commonwealth v. Clap, 4 Mass. 163, 3 Am. Dec. 212; Commonwealth v. Snelling, 32 Mass. 337; Commonwealth v. Blanding, 3 Pick. [Mass.] 304; Commonwealth v. Bonner, 9 Metcalf's [50 Mass.] 410; State v. Mays, 57 Wash. 540, 107 Pac. 363; State v. Pioneer Press Co., 100 Minn. 173, 110 N. W. 867; Oakes v. State, 98 Miss. 80, 54 So. 79; Wirtz v. Sprecher, 82 Neb. 834; 118 N. W. 1071; State v. Burnham, 9 N. H. 34, 31 Am. Dec. 217; Benton v. State, 59 N. J. L. 551, 36 Atl. 1041; Drake v. State, 53 N. J. L. [24 Vroom] 23, 20 Atl. 747; People v. Croswell, 3 Johns. Cas. [N. Y.] 337; People v. Simons, 1 Wheeler Crim. Cas. [N. Y.] 339; State v. Mason, 26 Ore. 273, 38 Pac. 130; State v. Putnam, 53 Ore. 266, 100 Pac. 2; Respublica v. Dennie, 4 Yeates' [Pa.] 266, 2 Am. Dec. 402; United States v. Bustos, 13 Philip. 690; Saunders v. Baxter, 53 Tenn. [6 Heisk.] 302; Sweeney v. Baker, 13 W. Va. 158, 31 Am. Ref. 757.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. \"Gen. * * * Fans Far East Fires. \"Fascist Hawaii defies the President of The United States. It slaps Secretary of State Cordell Hull in the face. It laughs in scorn and derision at Secretary of War Harry Woodring. Deliberately, maliciously, in the face of fair warning and despite the pleas of our country's leaders, it acts to win for America the hatred of a nation whose good will is vital to our nation now. That nation is the new Philippine Nation, eighteen millions of people whose friendship today is essential to us, and whose good will Washington is striving to hold. Fascist Hawaii is making the name American a hissing in the Philippines, aiding there the aims of propagandists of Asian imperialism. By that our fascists have brought new peril into the American situation in the Far East. What is Washington going to do about it? Will it step in to save American prestige in the Far East now, to save the honor of the United States Army, as it once stepped into Hawaii to defend the good name of the navy? For the crux of the peril of today is that the man who brought about the new danger is none other than a once-honored chief of the United States Army. This man * * * for money, shed his country's uniform to don a lackey's livery. And as a lackey for the HSPA he has trafficked with the honor, credit and reputation of the United States Army to stir up international strife that his employers might profit. A series of events reveals the perfidy of the * * * strategy and betrayal of American aims. Two months ago President Roosevelt, vetoing the bill of Delegate Sam King, HSPA stooge, put in to ban entry of Filipinos to Hawaii, declared the bill menaced American weal in the Philippines. Behind the President stood the State Department, with all its knowledge of our Far Eastern needs. Behind him stood, also, the War Department with all its keen interest and experience in Philippine matters. 'Hands off the Filipinos,' was Mr. Roosevelt's dictum. But * * * vetoed the president. 'To hell with the Filipinos and Philippine good will,' and he said it with action. * * * it was who, trading on his military title and prestige, made peace with the 4,500 Filipino workers on Maui two months ago. Promised by him, say Filipino leaders, was end of HSPA war upon workers, and of court persecution. Now, with open charges, undenied, that * * * lied and deceived workers who trusted to the honor of the U.S. Army, Maui is again on the verge of ferment. Instead of peace, * * * swings the HSPA sword, hurls HSPA mercenaries into the court to convict the Filipino leaders. And 60,000 Filipino workers cry out, send word to Manila, and all over their homeland, that America is a land of persecution, ruled by unprincipled and revengeful men. Over all their homeland goes word that American generals are liars and deceivers, schemers to oppress and imprison Filipinos who are innocent. How can America answer? How can it deny? How can it meet the whisper of the Pan-Asian advocate? The schemes of anti-American agitators and propagandists? America, by act of our kings of fascism intent on their works of greed and power, becomes a hateful thing to millions, and thereby the works of our President and our State, Navy and War Departments are nullified. What is Washington going to do about it? The Maui case has been a disgrace to the people of Hawaii. It has been a travesty on American justice, for in it public power has been seized and used ruthlessly for private terrorism and revenge. It has been a shame to the Roosevelt administration through connivance for wrong by the highest governmental powers in the Territory, the governor and the attorney general of Hawaii. It has been a signal to the Filipino people that their sons here will be victimized, abused, robbed of their rights and liberties under pretense of law and order. America's waning prestige in the Far East has been put on the auction block for profit by HSPA's lackey general. What is Washington going to do about it?\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. (36 C. J., T. Libel and Slander,  287, p. 1282; Oklahoma Publishing Co. v. Kendall, 96 Okla. 194, 221 Pac. 762, 767; Cherry v. Des Moines Leader, 114 Iowa 298, 86 N. W. 323, 325, 89 A. S. R. 365, 54 L. R. A. 855; Addington v. Times Pub. Co., 138 La. 731, 70 So. 784, 786; Ruhland v. Cole, 143 Wis. 367, 127 N. W. 959, 961.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. ( Stow v. Converse, 4 Conn. 17, 31; Blodgett v. Des Moines Daily News Co., 113 N. W. [Iowa] 821, 822; Golderman v. Stearns, 7 Gray's 181, 182; Reynolds v. Publishers Geo. Knapp \u0026 Co., 155 Mo. App. 612, 617, and cases cited, 135 S. W. 103; Beecher v. Press Pub. Co., 69 N. Y. S. 895, 898; Heilman v. Shanklin, 60 Ind. 424, 441; Watson v. Herald-Despatch Co., 221 Ill. App. 557, 560.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. (37 C. J., T. Libel and Slander,  552, p. 106; Brothers v. Brothers, 208 Ala. 258, 94 So. 175, 177; Dowie v. Priddle, 216 Ill. 553, 75 N. E. 243, 3 Am. \u0026 Eng. Cas. Ann. 526; White v. Bourquin, 204 Ill. App. 83, 94; Inland Printer Co. v. Economical Half Tone Supply Co., 99 Ill. App. 8, 17; Compton v. Wilkins, 164 Ky. 634, 176 S. W. 36, 38; Warner v. Fuller, 245 Mass. 520, 139 N. E. 811, 815; Van Lonkhuyzen v. Daily News Co., 195 Mich. 283, 161 N. W. 979, 982, L. R. A. [1917D] 855; Minter v. Bradstreet Co., 174 Mo. 444, 73 S. W. 668, 680; Russell v. Brooklyn Daily Eagle, 153 N. Y. S. 450, 452; Remsen v. Bryant, 62 N. Y. S. 434, 438, 439; Willetts v. Scudder, 72 Ore. 535, 144 Pac. 87, 90; Ecuyer v. New York Life Ins. Co., 101 Wash. 247, 172 Pac. 359, 362, L. R. A. [1918E] 536; Wilson v. Sun Publishing Co., 85 Wash. 503, 148 Pac. 774, 779; Quinn v. Review Publishing Co., 55 Wash. 69, 104 Pac. 181, 183.)\u003c/span\u003e\n\n",
    "body_length": 157154,
    "citedas": [
      "34 Haw. 774"
    ],
    "attorneys": "J. V. Esposito (also on the briefs) for the defendants. W. B. Lymer, Special Prosecutor (C. E. Cassidy, Public Prosecutor, with him on the brief), for the Territory.",
    "category": [
      "252",
      "75"
    ],
    "judges": "Peters, J., Circuit Judge Cristy in Place of Coke, C. J., Disqualified, and Circuit Judge Case in Place of Kemp, J., Disqualified. Opinion of the Court by Circuit Judge Cristy. (Peters, J., Dssenting.) Dissenting Opinion of Peters, J.",
    "citation_count": 2
  }
}
