{
  "id": "IIH5PWYBTlTomsSBEoUi",
  "document": {
    "title": "Hurley v. Atlantic City Police Department",
    "full_title": "SERGEANT DONNA M. HURLEY; PATRICK K. HURLEY, HUSBAND AND WIFE, v. THE ATLANTIC CITY POLICE DEPARTMENT, A SUBDIVISION OF THE CITY OF ATLANTIC CITY; HENRY MADAMBA; NICHOLAS V. RIFICE; JOHN MOONEY; JOHN DOES 1 THROUGH 50 INCLUSIVE, FICTITIOUS NAME JOINTLY, SEVERALLY, AND IN THE ALTERNATIVE (CAMDEN NEW JERSEY DISTRICT CIVIL NO. 93-260) SERGEANT DONNA M. HURLEY; PATRICK K. HURLEY, WIFE AND HUSBAND v. THE ATLANTIC CITY POLICE DEPARTMENT, A SUBDIVISION OF THE CITY OF ATLANTIC CITY; HENRY MADAMBA; NICHOLAS V. RIFICE; JOHN MOONEY; JOHN DOES 1 THROUGH 50, INCLUSIVE, JOINTLY, SEVERALLY, AND IN THE ALTERNATIVE (CAMDEN, NEW JERSEY DISTRICT CIVIL NO. 94-1122) ATLANTIC CITY POLICE DEPARTMENT NO. 96-5633 SERGEANT DONNA M. HURLEY; PATRICK K. HURLEY, HUSBAND AND WIFE, v. THE ATLANTIC CITY POLICE DEPARTMENT, A SUBDIVISION OF THE CITY OF ATLANTIC CITY; HENRY MADAMBA; NICHOLAS V. RIFICE; JOHN MOONEY; JOHN DOES 1 THROUGH 50, INCLUSIVE, FICTITIOUS NAME JOINTLY, SEVERALLY, AND IN THE ALTERNATIVE (CAMDEN NEW JERSEY DISTRICT CIVIL NO. 93-260) SERGEANT DONNA M. HURLEY; PATRICK K. HURLEY, WIFE AND HUSBAND v. THE ATLANTIC CITY POLICE DEPARTMENT, A SUBDIVISION OF THE CITY OF ATLANTIC CITY; HENRY MADAMBA; NICHOLAS V. RIFICE; JOHN MOONEY; JOHN DOES 1 THROUGH 50, INCLUSIVE, JOINTLY, SEVERALLY, AND IN THE ALTERNATIVE (CAMDEN, NEW JERSEY DISTRICT CIVIL NO. 94-1122) HENRY MADAMBA NO. 96-5634 SERGEANT DONNA M. HURLEY; PATRICK K. HURLEY, HUSBAND AND WIFE, v. THE ATLANTIC CITY POLICE DEPARTMENT, A SUBDIVISION OF THE CITY OF ATLANTIC CITY; HENRY MADAMBA; NICHOLAS V. RIFICE; JOHN MOONEY; JOHN DOES 1 THROUGH 50, INCLUSIVE, FICTITIOUS NAME JOINTLY, SEVERALLY, AND IN THE ALTERNATIVE (CAMDEN NEW JERSEY DISTRICT CIVIL NO. 93-260) SERGEANT DONNA M. HURLEY; PATRICK K. HURLEY, WIFE AND HUSBAND v. THE ATLANTIC CITY POLICE DEPARTMENT, A SUBDIVISION OF THE CITY OF ATLANTIC CITY; HENRY MADAMBA; NICHOLAS V. RIFICE; JOHN MOONEY; JOHN DOES 1 THROUGH 50, INCLUSIVE, JOINTLY, SEVERALLY, AND IN THE ALTERNATIVE (CAMDEN NEW JERSEY DISTRICT CIVIL NO. 94-1122) DONNA M. HURLEY, AND PATRICK K. HURLEY NO. 96-5661 SERGEANT DONNA M. HURLEY; PATRICK K. HURLEY, HUSBAND AND WIFE, v. THE ATLANTIC CITY POLICE DEPARTMENT, A SUBDIVISION OF THE CITY OF ATLANTIC CITY; HENRY MADAMBA; NICHOLAS V. RIFICE; JOHN MOONEY; JOHN DOES 1 THROUGH 50, INCLUSIVE, FICTITIOUS NAME JOINTLY, SEVERALLY, AND IN THE ALTERNATIVE (CAMDEN NEW JERSEY DISTRICT CIVIL NO. 93-260) SERGEANT DONNA M. HURLEY; PATRICK K. HURLEY, WIFE AND HUSBAND v. THE ATLANTIC CITY POLICE DEPARTMENT, A SUBDIVISION OF THE CITY OF ATLANTIC CITY; HENRY MADAMBA; NICHOLAS V. RIFICE; JOHN MOONEY; JOHN DOES 1 THROUGH 50, INCLUSIVE, JOINTLY, SEVERALLY, AND IN THE ALTERNATIVE (CAMDEN, NEW JERSEY DISTRICT CIVIL NO. 94-1122) DONNA M. HURLEY, AND PATRICK K. HURLEY NO. 96-5738",
    "jurisdiction": "Third Circuit",
    "date": "1999-03-18T00:00:00.000Z",
    "docket": "Nos. 96-5633, 96-5634, 96-5661, 96-5738",
    "body": "Argued May 4, 1998\n\nReargued October 5, 1998\n\nOPINION OF THE COURT\n\nThis is an appeal by defendants Henry Madamba and the Atlantic City Police Department (ACPD) from an amended judgment entered upon a jury's determination that Madamba discriminated against plaintiff Donna Hurley on the basis of her sex in violation of the New Jersey Law Against Discrimination (LAD), N.J. Stat. Ann. 10:5-1 et seq., and that the ACPD discriminated against her on the basis of her sex in violation of the LAD and Title VII of the Civil Rights Act of 1964 (Title VII), 42 U.S.C.§ 2000e et seq. Donna Hurley cross-appeals from an amended judgment entered upon the jury's determination that defendant Nicholas Rifice did not discriminate against her in violation of the LAD. She also cross-appeals from the district court's order granting defendant John Mooney's motion for summary judgment and the district court's order denying her motions for prejudgment interest and an additur and granting her motion for attorney's fees subject to a reduced hourly rate. In addition, plaintiff Patrick Hurley appeals from the district court's order granting defendants' motion for summary judgment on his loss of consortium claim.\n\nBecause the harassing conduct tolerated by the ACPD was longstanding and egregious, and because the trial court did not commit reversible error in its evidentiary decisions or its jury instructions, we will affirm the amended judgment insofar as it imposes liability and compensatory damages on the ACPD. However, because the punitive damages instructions did not require actual participation by upper management or willful indifference as required by New Jersey law, we will vacate the amended judgment to the extent it imposes punitive damages against the ACPD and order a new trial on that issue.\n\nOur recent decision in Failla v. City of Passaic, 146 F.3d 149 (3d Cir. 1998), set forth our understanding of liability for aiding and abetting under the New Jersey LAD. In light of Failla, it is evident that the jury instructions on aiding and abetting erred in two critical respects. We will therefore reverse the amended judgment entered against Madamba because the instructions failed to require a finding that Madamba substantially assisted the harassment. We will also vacate the judgment entered in favor of Rifice because the instructions wrongly directed the jury to absolve Rifice unless he took affirmative harassing acts. However, we will affirm the district court's order granting Mooney's motion for summary judgment because, as we understand New Jersey law, he could not, as a nonsupervisory employee, be liable for aiding and abetting the ACPD's failure to prevent and redress harassment even if he affirmatively harassed Donna Hurley. We will also affirm the district court's order denying plaintiff's motions for prejudgment interest and an additur and granting plaintiff's motion for attorney's fees subject to a reduced hourly rate.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nI. Facts and Procedural History\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nPlaintiff Donna Hurley has been an officer with the ACPD since February of 1978. She joined the force shortly after becoming the first female graduate of the Atlantic City Police Academy. Her husband, plaintiff Patrick Hurley, is also an officer with the ACPD. For purposes of clarity, we will refer to Donna Hurley as \"Hurley,\" to Patrick Hurley as \"Mr. Hurley,\" and to Mrs. and Mr. Hurley collectively as the \"Hurleys\" or \"plaintiffs.\" The Hurleys met while training at the Police Academy and married in 1980. Hurley alleges that she was subjected to sexual harassment as early as her training at the Police Academy in the late 1970s. In 1981 her then-supervisor, Sergeant Walter Reay, harassed her by making sexually derogatory comments about her hygiene during roll call, disturbed her while she was changing in the drill room, spoke to her in condescending tones during radio transmissions, and held her to stricter standards than male officers. During that year, fellow officers allegedly referred to Hurley as \"the cunt\" and placed a tampon and a copy of Hustler magazine in her squad car.\n\nDespite these and other obstacles,\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Hurley was promoted in November of 1987 and became the first female sergeant at the ACPD. Although her title changed as a result of this promotion, Hurley claims that her assignments continued to be menial and provided no useful experience. At one point, for example, Hurley was assigned to the Juvenile Truancy Task Force, where her job was to keep statistics on juvenile truants and where, although a sergeant, she supervised no one.\n\nThe ACPD divides its officers into three shifts: 8:00 a.m. to 4:00 p.m., or \"Alpha Platoon\"; 4:00 p.m. to 12:00 midnight, or \"Bravo Platoon\"; and midnight to 8:00 a.m., or \"Charlie Platoon.\" After working approximately two years as a sergeant on Alpha Platoon, Hurley was transferred in January 1990 to desk sergeant of Charlie Platoon, where she came under the direct command of defendant Captain Henry Madamba. The events at the core of this case occurred while Hurley worked in Charlie Platoon. During her first week on this assignment, Madamba allegedly told plaintiff that upper management sent a woman to his unit to \"break his balls,\" and that he \"did not expect [her] to be here on this shift very long.\" App. at 2749-50. Madamba also allegedly advised Hurley to request a hardship transfer out of Charlie Platoon and gave a male officer with less seniority a more favorable schedule.\n\nHurley testified that she was sexually harassed throughout her entire tour on Charlie Platoon by her superiors and her co-workers. This harassment included \"keying out\" her radio transmissions,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e demeaning comments by Madamba during roll call, and exclusion from sergeants' meetings. In addition, officers placed a sanitary napkin with sergeant's stripes over the roll call podium and affixed a dildo either to the wall or the podium in the roll call room. Finally, she was the subject of sexually explicit graffiti and drawings of herself at three locations on city property: the roll call room, the roll call bathroom, and the bathroom of the Masonic Temple, a building used by both employees and the public. Several of the most egregious examples of the offensive material, of appallingly low character, are set forth in the margin.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nHurley also testified that Madamba personally harassed her while she was on Charlie Platoon. In addition to the insults he directed at her during roll call and his decision to exclude her from sergeants' meetings, Captain Madamba allegedly refused to take action against officers who \"keyed out\" plaintiff's radio transmissions, and told her that she was \"too emotional\" about the sanitary napkin incident. At one point, he reacted to the latest sexually explicit graffiti by rushing to see it and laughingly informing Hurley, in front of her colleagues, that \"it's really bad,\" but he took no action to remove or prevent the appearance of the graffiti. In September of 1990, he sent a memorandum to defendant Rifice, an Inspector at the time, stating that Hurley had abused her sick leave. As a result, then-Chief of Police Robert McDuffie sent Hurley a memorandum requiring her to produce a doctor's note every time she took sick leave.\n\nHurley testified that when she complained to Madamba that the harassment at Charlie Platoon was becoming too much for her, he replied that women in the private sector are protected against such harassment because they\"sleep with their bosses.\" App. at 2776-77. When she attempted to change the topic of conversation and commented on Madamba's apparent weight loss, he stated that he lost weight by \"having sex a few times a day,\" and that women came to him \"when they're ready.\" App. at 2498-2508. Hurley interpreted this entire conversation as a solicitation for sex.\n\nHurley also testified that another sergeant on Charlie Platoon, defendant John Mooney, sexually discriminated against her in two ways. First, Mooney made several sexually derogatory comments to her, some of which Madamba witnessed yet did nothing to stop. For example, Mooney remarked that he had heard that Hurley \"liked it hard and stiff,\" and suggested that, when Hurley met with Police Captain McKenna, she was actually performing oral sex on him. See X App. at A2516, A2514. On another occasion, when Hurley was unable to locate her coffee mug, Mooney asked her if she wanted to drink out of his jock cup. See id. at A2514. Second, Mooney used his influence, which far exceeded his position as sergeant, to transfer Hurley to an undesirable assignment because of her sex.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e In particular, Hurley claims that Mooney was responsible for her transfer from her position as Court Liaison Officer to the Juvenile Truancy Task Force.\n\nAfter Mr. Hurley's efforts to intervene on his wife's behalf failed, Hurley submitted a memorandum to Madamba on November 1, 1990, detailing the harassment she experienced during her tour on Charlie Platoon and requesting a transfer. Madamba forwarded Hurley's memo to the Chief of Police along with a memo of his own requesting that Internal Affairs conduct an investigation of Hurley for allegedly lying in the memo as part of a conspiracy to get money from the ACPD. No investigation along these lines was ever conducted.\n\nShortly thereafter, Hurley was transferred to the Alpha Platoon shift of the Property and Evidence Unit. Although she had requested a transfer out of Charlie Platoon, Hurley alleges that this particular transfer constituted retaliation for her sexual harassment memorandum because the Property and Evidence Unit was widely regarded as an undesirable position, and the Alpha Platoon was incompatible with the personal schedule to which she had become adjusted while working on Charlie Platoon. Hurley also alleges that when she was transferred to the Property and Evidence Unit, she was denied a three percent pay increase that ACPD officers receive when transferred to plain clothes duty. She eventually received this increase on April 20, 1993, retroactive to November 8, 1990. Hurley contends that the harassment continued even after she left Charlie Platoon.\n\nFor example, the graffiti apparently remained on the walls well after her transfer. Rifice, who had been promoted to Police Chief, testified at trial that he heard complaints about the graffiti as late as March of 1992, and Mr. Hurley took photographs of the graffiti in the summer of 1992. In addition, an EEOC investigation concluded that there was sexual graffiti in Hurley's work area as late as June of 1993. Moreover, on June 13, 1992, while Hurley was attending a police seminar, Mooney, then Captain of Charlie Platoon, allegedly approached her and called her \"the ass up from the Property Room\" in front of two other sergeants.\n\nHurley further avers that the Chief of Police, defendant Rifice, was aware of her plight and failed to take steps to protect her and discipline the perpetrators. She also testified that Rifice personally committed several affirmative acts of sexual discrimination against her. These acts included: (1) transferring her to the Property and Evidence Unit; (2) denying her access to Chief McDuffie; (3) denying her a three percent pay raise when she transferred to plainclothes duty; (4) denying her request for funeral leave; and (5) condoning an improper Internal Affairs investigation into her conduct while she was assigned to the Property Room.\n\nHurley worked continuously until July 26, 1994, after which she went on an extended paid sick leave. She asserts that, as a result of the harassment, she has suffered severe emotional distress that has interfered with her work, her personal life, and her family life. Mr. Hurley alleges that the harassment has detrimentally affected his relationship with his wife.\n\nOn July 10, 1992, Hurley filed complaints with both the United States Equal Employment Opportunity Commission (EEOC) and the New Jersey Department of Law and Public Safety, Division of Civil Rights (DCR). Both complaints named the ACPD as the sole respondent and alleged that Hurley had been harassed while on Charlie Platoon. Hurley submitted an affidavit in connection with her EEOC complaint alleging that Madamba and Mooney harassed her during her tour on Charlie Platoon. She claimed that obscene drawings of her remained visible as late as March of 1992, and that her transfer to the Property and Evidence Unit and denial of the three percent pay raise were in retaliation for her complaints of sexual harassment.\n\nOn January 30, 1993, before the EEOC had issued plaintiff a right to sue letter pursuant to 42 U.S.C. § 2000e-(f)(1), the Hurleys filed the district court complaint which stated all of Hurley's instant claims. Subsequently, on October 12, 1993, the EEOC issued a determination on Hurley's charge. The EEOC investigator found probable cause to believe that Hurley had been sexually harassed while she was on Charlie Platoon, but no probable cause on retaliation charge regarding the transfer to the Property and Evidence Unit and the denial of the three percent pay increase. On March 7, 1994, the Hurleys filed a second complaint. This complaint relied on the facts stated in the previous complaint and alleged discrimination pursuant to 42 U.S.C. § 2000e-2 and retaliation pursuant to 42 U.S.C. § 2000e-3(a). The district court subsequently consolidated these two complaints.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nFollowing extensive discovery, each of the defendants moved for summary judgment. The district court granted Mooney's motion for summary judgment, and dismissed all claims against Madamba and Rifice with the exception of Hurley's aiding and abetting claims under the LAD. Additionally, the court dismissed all claims against the ACPD except for Hurley's hostile work environment claim under Title VII, Section 1983, and the LAD.\n\nThe jury trial lasted more than two months. At the Conclusion of the liability portion of the trial, the jury rendered a verdict against Madamba and the ACPD but found Rifice not liable. The jury awarded $575,000 in compensatory damages and awarded punitive damages against the ACPD but not against Madamba. A punitive damage hearing was conducted before the jury, at the end of which the jury awarded Hurley $700,000 in punitive damages.\n\nThe ACPD and Madamba moved for judgment as a matter of law or, in the alternative, a new trial or a remittitur. Hurley moved for a new trial as to Rifice, and an additur with respect to the entire damages award. In addition, Rifice and Mooney, as well as Hurley, moved for attorneys' fees and costs.\n\nThe district court denied defendants' motion for a new trial and for a remittitur as to punitive damages and also denied plaintiff's motion for an additur. However, the court granted defendants' motions for a remittitur with respect to the compensatory damages award, which the court remitted to $175,000. The court also denied the defendants' fee petitions, but granted plaintiff's petition, subject to a reduced hourly rate and the exclusion of hours spent in pursuit of unsuccessful claims. Hurley accepted the remittitur, and the court awarded counsel fees and costs in favor of Hurley in the amount of $516,046 and $70,135, respectively. The court then entered an amended judgment. This appeal and cross-appeals followed.\n\nII. The ACPD's Liability\n\nThe ACPD argues that it is entitled to a new trial for five reasons. First, it contends that the district court abused its discretion under Rule 403 of the Federal Rules of Evidence by admitting \"highly inflammatory and largely irrelevant evidence regarding alleged misconduct at the ACPD to which the plaintiff was not exposed.\" ACPD's Br. at 2. Second, it contends that the district court's ruling that plaintiff's psychiatric expert could testify about a second diagnosis that was not contained in his reports \"result[ed] in prejudicial surprise `inconsistent with substantial Justice.' \" Id. at 40 (quoting Conway v. Chemical Leaman Tank Lines, Inc., 687 F.2d 108, 111-12 (5th Cir. 1982)). Third, the ACPD asserts that the punitive damage award of $700,000 against it is so excessive that it creates an inference that the jury's liability verdict \"resulted from its passion and prejudice toward the City of Atlantic City.\" Id. at 46 (citing Dunn v. HOVIC, 1 F.3d 1371, 1382 (3d Cir.) (en banc), modified on other grounds, 13 F.3d 58 (3d Cir. 1993)). Fourth, the ACPD claims that the district court's jury charge under the LAD was misleading, confusing, and contrary to the law. Finally, on reargument, which we held in the wake of the recently decided Supreme Court cases of Burlington Industries, Inc. v. Ellerth, 524 U.S. 742, 118 S. Ct. 2257 (1998), and Faragher v. City of Boca Raton, 524 U.S. 775, 118 S. Ct. 2275 (1998), the ACPD submits that these cases entitle it to a new trial on liability. We will address these arguments in turn.\n\nA. Evidence Not Obviously Linked to Hurley's Experience in Charlie Platoon\n\nDuring trial, and over defendants' objections, the district court permitted a number of witnesses to testify about alleged incidents of harassment and retaliation that were either remote in time from the \"accrual date\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e or involved matters of which Hurley was unaware until after shefiled suit. This testimony can be divided into three categories: (1) testimony by four women who were associated with the ACPD about incidents of sexual harassment and retaliation of which Hurley had no knowledge until after commencing suit; (2) testimony by eight male police officers about \"locker-room\" conversations between men outside the presence of women; and (3) testimony by Patrick and Donna Hurley about several incidents of sexual harassment against Mrs. Hurley between 1978 and 1981.\n\nThe ACPD raises several arguments to support its contention that the district court abused its discretion by admitting this testimony. First, the ACPD points out that Hurley was unaware of most of these comments until after she filed suit. Thus, the comments could not possibly contribute to a hostile work environment for her. Second, it argues that it was impossible to rebut most of the alleged incidents at trial because they occurred at unspecified times and locations. Third, the ACPD asserts that incidents from 1978 to 1981 were too remote in time to be probative. Finally, the ACPD maintains that the district court's limiting instructions regarding this evidence were insufficient to offset the unfair prejudice resulting from these rulings.\n\n1. The Challenged Evidence\n\nThe district court permitted four women who had been associated with the ACPD to testify regarding the harassment of women within the department. Hurley did not witness any of these incidents, nor did she become aware of the alleged harassment until after she commenced suit.\n\nMartha Donovan, a municipal prosecutor for the City of Atlantic City, testified about some mistreatment of Hurley that she had observed and also testified about an incident involving Sergeant Edward Yard of the ACPD. According to Ms. Donovan's testimony, in the summer of 1989 Sergeant Yard called Ms. Donovan a \"cunt\" and stated that he \"ought to slap [her] face\" for giving him an order; the incident occurred in front of fifty other people, including other police officers, in the hallway of the courthouse. See IV App. at A31. Donovan immediately complained to her supervisor and the officer ultimately apologized. At some point thereafter, Sergeant Yard's responsibilities were changed, and he had minimal contacts with Ms. Donovan thenceforth. Ms. Donovan never reported the incident to the ACPD supervisory staff.\n\nJulia Cardy and Lisa O'Keefe, two civilian employees of the ACPD in the payroll department, testified that they were generally dissatisfied with their male ACPD supervisors. Ms. Cardy testified that in 1992, as a result of reporting her supervisor, Sergeant Griggs, to his immediate supervisor, Captain MacDonald, for his misbehavior, she was retaliated against and subjected to chauvinistic remarks. Ms. Cardy further testified that women were treated \"pretty poorly\" if they \"spoke out\" against the mistreatment. V App. at A1166, A1171.\n\nMs. O'Keefe stated that Sergeant Griggs and Captain MacDonald treated her with disrespect over a long period of time extending to at least 1992, when there was apparently some ill-feeling towards female employees as a result of Hurley's lawsuit. See IV App. at A858-60. She also testified that complaints to Rifice received no response, see id. at A862, although she ultimately filed a union grievance and the offending officers were removed from authority over the payroll department.\n\nOfficer Deborah Rando of the ACPD testified about the derogatory and sexually demeaning statements made to her in 1992 by her supervisor, defendant Mooney. At one point, Mooney referred to her conduct in profane terms and, when she objected, informed her that no one would believe her if she complained. See id. at A943. Despite this, she did complain to Mooney's supervisor, who warned her to think about her career and told her not to repeat her allegations to anyone. See id. at A948-50.\n\nThe district court permitted eight male police officers from the ACPD to testify at trial about derogatory comments made about women generally. These officers testified that, at least from 1990 to the time of trial, women were commonly referred to as \"cunts,\" \"douche bags,\" \"broads,\" \"bitches,\" and, as a group, \"the crack troop.\" App. at A413, A768. In addition, one officer testified that most inspectors and captains commonly referred to Hurley as \"the whacky [sic] cunt.\" Id. at 443. These same officers testified, however, that these comments were always made outside the presence of women. Hurley was unaware of these comments until after she commenced suit.\n\nFinally, the district court permitted both Patrick and Donna Hurley to testify, over objection, about events occurring well before the January 20, 1987 accrual date. For example, Mr. Hurley testified about alleged acts of discrimination against his wife dating back to her tenure at the Police Academy in 1978. He also testified about comments allegedly made by Hurley's supervisor, Sergeant Walter Reay, between 1978 and 1980. Reay supposedly asked Hurley about her personal hygiene and made weekly comments during roll call.\n\nHurley also testified about various incidents that allegedly occurred in 1981, when she was a patrol officer and Louis Rivera was her partner. Hurley testified that she \"heard\" that she was referred to as a \"cunt.\" Id. at 2388-90. The court also permitted her to testify that, during 1981, a Hustler magazine was left on her patrol car seat and a tampon was hung from her rear view mirror.\n\n2. Admissibility of the Evidence\n\nIn the district court's view, all of the evidence was admitted for the same purpose: to \"permit[ ] the jury to more intelligently evaluate the evidence that did create liability.\" Hurley, 933 F. Supp. at 411. The court reasoned that permitting\n\n\"evidence of other women's experiences at the ACPD, of the attitudes of male officers towards women generally, and of Hurley's experiences prior to 1987 served several important purposes in this trial. It allowed the jury to gain insight into the motives, attitudes, and intentions of the defendants. It gave them the opportunity to evaluate the adequacy of management's response to Hurley's complaints during the statutory period. It provided the jury with a sense of whether the events that took place during the statutory period were anomalous or accidental, or instead were part of a \"pervasive and severe\" pattern.\n\n\"Plaintiff's treatment during the statutory period was unquestionably influenced by and related to her treatment throughout the course of her career at the ACPD. Plaintiff's experience was reflective of the general attitudes of the men around her; those attitudes also influenced, and were revealed in, the treatment of other women in the ACPD.\" Id.\n\nAlthough the district court believed that evidence of past harassment was \"crucial to the jury's evaluation of the work environment at the ACPD,\" id. at 410, the court instructed the jury not to consider the evidence directly for purposes of liability. See id. at 411. Specifically, the court stated:\n\n\"You are to consider whether each defendant has engaged in sexual discrimination for the period from January 20, 1987, through January 20, 1993. You may consider evidence from before and after these dates to help you evaluate the defendants' conduct from January 20, 1987, through January 20, 1993, but liability attaches, if at all, only to defendants' conduct during this period.\" Id. (alteration removed).\n\nThe court believed that, \"[b]y admitting the evidence but forbidding the jury to consider it as directly relating to liability, [it was] able to balance the interests of the plaintiff and the defendants.\" Id. In addition, the court instructed the jury that, in determining whether or not a hostile work environment existed, it could only consider conduct that actually altered Hurley's own work environment during the relevant period. See App. at A5278.\n\nThe evidence issues fall largely within the ambit of Federal Rule of Evidence 401, which defines relevant evidence as \"evidence having any tendency to make the existence of any fact that is of consequence to the determination of the action more or less probable than it would be without the evidence.\"\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Rule 401 does not raise a high standard. See In re Paoli R.R. Yard PCB Litig., 35 F.3d 717, 782-83 (3d Cir. 1994). Also implicated in our Discussion is Rule 403, which provides, in pertinent part, that \"[relevant] evidence may be excluded if its probative value is substantially outweighed by the danger of unfair prejudice, confusion of the issues, or misleading the jury . . . .\" We review evidentiary rulings for abuse of discretion, see Ryder v. Westinghouse Elec. Corp., 128 F.3d 128, 132 (3d Cir. 1997), with substantial deference under Rule 403.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e We conclude that the district court did not abuse its discretion under Rules 401 or 403 by admitting most of the challenged evidence, and that the error with respect to a portion thereof was harmless.\n\nEvidence that women other than the plaintiff were subjected to a hostile work environment clearly meets Rule 401's requirements in a number of situations. For example, a plaintiff may show that, while she was not personally subjected to harassing conduct, her working conditions were nevertheless altered as a result of witnessing a defendant's hostility towards other women at the workplace. See Lehmann, 626 A.2d at 457 (\"A woman's perception that her work environment is hostile to women will obviously be reinforced if she witnesses the harassment of other female workers.\").\n\nA plaintiff's knowledge of harassment or pervasively sexist attitudes is not, however, a requirement for admitting testimony on those subjects in a harassment suit. Evidence of harassment of other women and widespread sexism is also probative of \"whether one of the principal non-discriminatory reasons asserted by [an employer] for its actions was in fact a pretext for . . . discrimination.\" Glass v. Philadelphia Elec. Corp., 34 F.3d 188, 194 (3d Cir. 1994); see also Heyne v. Caruso, 69 F.3d 1475, 1480 (9th Cir. 1995). In Glass, we found reversible error where the plaintiff attempted to introduce evidence of past racial harassment to explain negative evaluations and the trial court excluded it because it was time-barred. Glass relied on Estes v. Dick Smith Ford, Inc., 856 F.2d 1097, 1103 (8th Cir. 1988), adopting its holding that circumstantial proof of discrimination, including evidence of past harassment and evidence of discrimination against others in the protected class, is admissible. Moreover, in Rule 403 terms, this evidence is highly probative, hence it is unlikely that any putative prejudice therefrom will be unfair or will outweigh its value.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe principles established by our precedent apply to this case. Evidence of other acts of harassment is extremely probative as to whether the harassment was sexually discriminatory and whether the ACPD knew or should have known that sexual harassment was occurring despite the formal existence of an anti-harassment policy. See West v. Philadelphia Elec. Co., 45 F.3d 744, 752 (3d Cir. 1995). Neither of these questions depends on the plaintiff's knowledge of incidents; instead, they go to the motive behind the harassment, which may help the jury interpret otherwise ambiguous acts, and to the employer's liability. This kind of evidence is particularly important given the ACPD's main defenses at trial, which were that the incidents of abuse Hurley suffered were trivial horseplay to which both men and women were subjected and that its written sexual harassment policy was sufficient to insulate it from liability. Contrary to the ACPD's position, it is implausible in the extreme that Hurley was somehow immune from the pervasive sexism at the ACPD, as it was described by both female and male officers. See Hurley, 933 F. Supp. at 411; see also Josey v. John R. Hollingsworth Corp., 996 F.2d 632 (3d Cir. 1993) (holding that employees' remarks and racially derogatory notes sent by unidentified people were circumstantial evidence that management permitted an atmosphere of prejudice to infect the workplace).\n\nThe challenged evidence creates a basis for an inference that Hurley was targeted for abuse because she was a woman. It also gives reason to infer that the ACPD knew or should have known not only what was happening to its female officers but also, and most importantly, that the written sexual harassment policy was ineffective, and patently so. Indeed, it is hard to imagine evidence more relevant to the issue of whether a sexual harassment policy was generally effective than evidence that male officers did not respect it and that female officers were not protected by it.\n\nOfficer Rando and Ms. Cardy, for example, both testified about the dismissive and even retaliatory treatment they experienced when they reported male officers' misbehavior, and this was relevant, probative evidence that the ACPD was consistently insensitive to female employees' experiences of harassment. See Hunter v. Allis-Chalmers Corp., 797 F.2d 1417 (7th Cir. 1986) (evidence of frequent misconduct against plaintiff and others was \"pertinent, perhaps essential\" to the employer liability determination); Vinson v. Taylor, 753 F.2d 141, 146 (D.C. Cir. 1985) (same), aff'd sub nom. Meritor Sav. Bank, FSB v. Vinson, 477 U.S. 57 (1986). This evidence remains highly relevant under Ellerth and Faragher. See Faragher, 118 S. Ct. at 2293 (discussing evidence of city's general failure to disseminate and enforce its sexual harassment policy in rejecting the availability of the affirmative defense in a particular case of harassment).\n\nAside from its relevance to the issue of whether the ACPD is liable for the hostile environment Hurley encountered, the evidence is also relevant to her intentional sex discrimination, quid pro quo, and retaliation claims. The general atmosphere of sexism reflected by the challenged evidence is quite probative of whether decisionmakers at the ACPD felt free to take sex into account when making employment decisions, when deciding whether to abuse their positions by asking for sexual favors, and when responding to sexual harassment complaints. As Glass held, evidence of pervasive sexual harassment makes retaliation claims more credible, because harassers may be expected to resent attempts to curb their male prerogatives. See Glass, 34 F.3d at 195; see also Hawkins v. Hennepin Technical Ctr., 900 F.2d 153, 156 (8th Cir. 1990).\n\nEvidence of sexually derogatory and sexist harassment makes disparate treatment claims more credible as well, since such discriminatory acts stem from similar motives. See Glass, 34 F.3d at 192; Josey, 996 F.2d at 641; Hawkins, 900 F.2d at 155; Hunter, 797 F.2d at 1421. Other courts have found similarly with respect to quid pro quo claims. See Heyne, 69 F.3d at 1479-80; Phillips v. Smalley Maintenance Servs., Inc., 711 F.2d 1524, 1532 (11th Cir. 1983); Sowers v. Kemira, Inc., 701 F. Supp. 809, 816 (S.D. Ga. 1988). In this case, because of its high probative value, there was no abuse of discretion in admitting the challenged testimony from other officers.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Any putative prejudice was not unfair, and at all events was outweighed by the probative value. Nor are any of the other Rule 403 factors present to counsel exclusion.\n\nWe do believe that evidence of events from 1979 to 1981 was improperly admitted because it was too distant in time from the events at the center of the ACPD's liability. Hurley did not claim a continuing violation from 1979 to 1992, and the district court abused its discretion when it admitted evidence from that distinct period in Hurley's career. We may find such error harmless only if \"it is highly probable that the error did not affect the outcome of the case.\" Lockhart v. Westinghouse Credit Corp., 879 F.2d 43, 53 (3d Cir. 1989); see also McQueeney v. Wilmington Trust Co., 779 F.2d 916, 924, 927-28 (3d Cir. 1985). In this case, the error was harmless. As the district court noted:\n\n\"This is a case where the plaintiff was compelled to attend roll call in front of a life-size drawing of herself performing oral sex as her supervisor, Madamba, sat eight feet away; where, in addition to pervasive graffiti directed at plaintiff, a sanitary napkin bearing sergeant's stripes dangled over the podium from which she spoke, and a dildo was affixed to a wall or ceiling nearby; and where plaintiff's professionalism and performance were constantly undermined because the men on the force could not tolerate a women among them. It is a case where the plaintiff's supervisor responded to plaintiff's entreaties by insinuating that he might be able to help her if only she would sleep with him.\" Hurley, 933 F. Supp. at 413 (citations omitted).\n\nWhen viewed against the uncontestably relevant and admissible evidence, it is highly improbable that the improperly admitted evidence affected the judgment in this case. Indeed, were we to hold all of the evidence challenged by the ACPD inadmissible, we believe that its admission would still amount to harmless error, so clear is the evidence of the harassment Hurley experienced.\n\nFor the foregoing reasons, the ACPD's Rule 403-based evidentiary arguments fail.\n\nB. Dr. Hoyme's \"Surprise\" Testimony\n\nDr. Hoyme, plaintiff's psychological expert, issued his first report on November 16, 1994. In that report, he wrote that \"[m]y diagnosis [of Donna and Patrick Hurley] is Adjustment Disorder with mixed features of anxiety and depressed mood (309.28 DSM IV) . . . . This diagnosis carries an implied causal connection between their traumatic experiences (sexual harassment, hostile work environment, and subsequent harassment) and their symptoms.\" App. at 5387. Subsequently, on February 20, 1995, Dr. Hoyme submitted another report in response to a report issued by defendants' psychological expert, Dr. Toborowsky. According to Dr. Hoyme's rebuttal report:\n\n\"Mrs. Hurley has experienced severe emotional injury and pain as the result of sexual harassment in the course of her work in the Atlantic City Police Department. Contrary to Dr. Toborowsky's stance, it is not necessary to prove that she has developed diagnosable psychiatric disorder in order to recognize or validate this substantial harm.\" Id. at 5849.\n\nOn March 2, 1995, the magistrate Judge ordered that Dr. Hoyme's rebuttal report be barred as untimely. Hurley appealed this decision to the district court, and the court initially upheld the magistrate's decision. The court also ruled, however, that Hurley could renew this motion at trial when the court \"would have a better sense of the significance of the testimony.\" Hurley, 933 F. Supp. at 408. Hurley renewed her motion at trial, and the district court overruled the magistrate's decision \"[b]ecause [the court was] concerned that the magistrate Judge's sanctions against the plaintiff cut too close to the essential truth-seeking function of the Court . . . .\" Id. At trial, Dr. Hoyme testified about \"another diagnosis that didn't neatly fit into the DSM criteria\": a reaction to a \"psychological assault.\" App. at 1667-68. He further testified that the defendants' conduct constituted an \"aggressive attack on her\" and a kind of \"sexual assault\" which caused severe pain comparable to a physical touching. Id. at 1726-29. In closing, Hurley's counsel also referred to Dr. Hoyme's \"psychological assault\" testimony as a basis for awarding damages.\n\nThe ACPD argues that Dr. Hoyme's reference to a \"second diagnosis\" regarding a \"psychological assault\" on Donna Hurley constituted unfair surprise because the testimony was materially different from that offered previously and provided the defendants with no meaningful opportunity for rebuttal. This unfair surprise, according to the ACPD, was \"inconsistent with substantial Justice\" and warrants a new trial. We disagree.\n\nA district court's decision to allow an expert to testify beyond the scope of his report is reviewed under an abuse of discretion standard. See Greate Bay Hotel \u0026 Casino v. Tose, 34 F.3d 1227, 1236 (3d Cir. 1994). \"We determine whether there has been an abuse of discretion by considering four factors: `(1) the prejudice or surprise in fact to the opposing party, (2) the ability of the party to cure the prejudice, (3) the extent of disruption of the orderly and efficient trial of the case, and (4) the bad faith or willfulness of the non-compliance.' \" Id. (quoting Beissel v. Pittsburgh \u0026 Lake Erie R. Co., 801 F.2d 143, 150 (3d Cir. 1986)).\n\nWe cannot conclude that the district court abused its discretion by permitting Dr. Hoyme's so-called \"second diagnosis.\" First, notwithstanding Dr. Hoyme's rebuttal report, his initial report hinted strongly at this \"second diagnosis,\" because it contained an explanation of the severe harm inflicted by the extensive sexual harassment Hurley experienced. Second, the defendants actually received the rebuttal report and were unquestionably aware of the appealability of the magistrate Judge's order. Moreover, the defendants had several weeks after Dr. Hoyme's testimony to prepare rebuttal testimony and, thus, cure any possible prejudice. Indeed, Dr. Toborowsky testified that he had previously read both the deposition and courtroom testimony of Dr. Hoyme. Third, there was no need to call any witnesses out of order or any other disruptions at trial. Finally, while this evidentiary dispute might have been the product of \"discovery-based bickering between the lawyers\" and the \"institutional differences between lawyers, who demand unvarying precision, and psychiatrists,\" see Hurley, 933 F. Supp. at 408, there is no evidence of bad faith.\n\nC. Inference of Jury Prejudice and Passion\n\nThe ACPD contends that the $700,000 punitive damage award was the \"product of the same abandonment of`cool reason' in favor of `outrage and disgust' which shocked the trial court's conscience with respect to the compensatory damages.\" ACPD Br. at 46. Indeed, the ACPD argues that this \"award was so excessive as to give rise to a clear inference that the jury verdict was the result of mistake, passion, prejudice or partiality.\" Id. at 43. Therefore, according to the ACPD, we must set aside the jury's verdict and order a new trial. Once again, we disagree.\n\nIn Dunn, we observed that a defendant would be entitled to a new trial, rather than remittitur, upon showing that \"the jury verdict resulted from passion or prejudice.\" Dunn, 1 F.3d at 1383; see also 11 Charles Alan Wright et al., Federal Practice and Procedure § 2815, at 165 (2d ed. 1995) (remittitur is \"not proper if the verdict was the result of passion and prejudice, since prejudice may have infected the decision of the jury on liability, as well as on damages\"). We further rejected the argument, however, that\"the size of the award alone was enough to prove prejudice and passion.\" Dunn, 1 F.3d at 1383; see also Mason v. Texaco, Inc., 948 F.2d 1546, 1561 (10th Cir. 1991) (reducing a punitive damage award of $25 million by one-half because it shocked the court's conscience, but upholding the jury's liability determination because there was no evidence it was tainted). Here, as in Dunn, the defendant's only evidence of jury prejudice and passion is the amount of the punitive damage award itself. This is insufficient, and the ACPD's argument cannot prevail.\n\nD. Jury Charge on Hostile Work Environment\n\nThe ACPD also argues that it is entitled to a new trial because the district court erred in its charge to the jury on hostile work environment by mixing different concepts from Title VII and the LAD. Specifically, defendant contends that the district court strayed from Lehmann v. Toys`R' Us, Inc., 626 A.2d 445 (N.J. 1993), in which the New Jersey Supreme Court formulated the basic standard for determining whether acts of harassment in the workplace constitute invidious discrimination in violation of the LAD. Under the Lehmann standard, a plaintiff must demonstrate that \"the complained-of conduct (1) would not have occurred but for the employee's gender; and it was (2) severe or pervasive enough to make a (3) reasonable woman believe that (4) the conditions of employment are altered and the working environment is hostile or abusive.\" Id. at 453.\n\nThe ACPD argues that the district court erred when it instructed the jury to consider ten factors, which the district court primarily derived from the ABA Model Charge\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e and Title VII caselaw, when determining whether the ACPD was liable under the LAD. Finally, the ACPD argues that the district court failed to instruct the jury as to precisely how each of the factors bore on the issue of sexual harassment. \"We generally review jury instructions for abuse of discretion to determine whether they are misleading or inadequate.\" Woodson v. Scott Paper Co., 109 F.3d 913, 929 (3d Cir.), cert. denied, 118 S. Ct. 299 (1997). \"However, when the question is whether the instructions misstate the law, our review is plenary.\" Id. (citing Saverese v. Agriss, 883 F.2d 1194, 1202 (3d Cir. 1989)). We review jury instructions to determine whether, \"taken as a whole, they properly apprised the jury of the issues and the applicable law.\" Dressler v. Busch Entertainment Corp., 143 F.3d 778, 780 (3d Cir. 1998) (quotation marks omitted).\n\nUnder the first prong of the Lehmann test, a plaintiff must show \"by a preponderance of the evidence that she suffered discrimination because of her sex.\" Lehmann, 626 A.2d at 454. Because the LAD is not a fault or intent-based statute, a plaintiff \"need not show that the employer intentionally discriminated or harassed her, or intended to create a hostile work environment.\" Id. at 454.\n\nThe second prong requires that the objectionable conduct be sufficiently \"severe or pervasive\" to state an actionable claim. See id. at 455 (\"We emphasize that it is the harassing conduct that must be severe or pervasive, not its effect on the plaintiff or on the work environment.\" (citing Ellison v. Brady, 924 F.2d 872, 878 (9th Cir. 1991))). In adopting this test, the court expressly rejected the \"regular and pervasive\" standard set forth by this court in Andrews, 895 F.2d at 1482. The New Jersey Supreme Court concluded that the Andrews test strayed from the United States Supreme Court's standard in Meritor and \"would bar actions based on a single, extremely severe incident or, perhaps, even those based on multiple but randomly-occurring incidents of harassment.\" Lehmann, 626 A.2d at 455. Indeed, the New Jersey Supreme Court recently concluded that a plaintiff created a triable issue based on a single racial slur. See Taylor v. Metzger, 706 A.2d 685 (N.J. 1998).\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe third prong of the Lehmann test considers the harassment from the perspective of a reasonable woman (or man, as the case may be). Such an objective, gender-specific standard, according to the court, \"provides flexibility\" by \"incorporating community standards\" and focuses attention \"on the nature and legality of the conduct, rather than on the reaction of the individual plaintiff,\" Lehmann, 626 A.2d at 458, and it also \"recognize[s] and respect[s] the difference between male and female perspectives on sexual harassment.\" Id. at 459. \"Only an idiosyncratic response of a hypersensitive plaintiff to conduct that a reasonable woman would not find harassing is excluded by the reasonable woman standard.\" Id. at 458-59.\n\nFinally, under the fourth Lehmann prong, a plaintiff must show that \"her working conditions were affected by the harassment to the point at which a reasonable woman would consider the working environment hostile.\" Id. at 457. A plaintiff need not demonstrate psychological harm or economic loss.\n\nIn this case, the district court's hostile work environment sexual harassment charge provided as follows:\n\n\"It is important to understand that, in determining whether a hostile work environment existed at the Atlantic City Police Department, you must consider the evidence from the perspective of a reasonable woman in the same position. You must look at the evidence from the perspective of a reasonable woman's reaction to a similar environment under similar circumstances. That is, you must determine whether a reasonable woman would have been offended or harmed by the conduct in question. You must evaluate the total circumstances and determine whether the alleged harassing behavior could be objectively classified as the kind of behavior that would seriously affect the psychological or emotional well-being of a reasonable woman. The reasonable woman is simply an average woman of normal sensitivity and emotional make-up.\n\n\"It is equally important to understand, however, that the reasonable woman standard applies only to the issue of liability for hostile work environment sexual harassment. It does not apply to liability for intentional sexual harassment, retaliation, or quid pro quo harassment, nor to the calculation of damages.\n\n\"Plaintiff has alleged that she has been subjected to a hostile work environment because of harassment based on her sex. To prevail on this theory, she need not demonstrate any job benefits were conditioned on submitting to hostile sexual conduct or were denied because of refusing to give in to that conduct. Rather, to establish a claim of hostile work environment sexual harassment, plaintiff must prove by a preponderance of the evidence that the conduct about which she complains, one, would not have occurred but for the employee's gender, and it was, two, severe or pervasive enough to make a, three, reasonable woman believe that, four, the conditions of employment are altered and the working environment is hostile or abusive.\n\n\"The more severe the conduct, the less extensive it need be for you to find it is hostile.\n\n\"Conversely, the less severe the conduct, the more persuasive [sic] or regular it should be in order for you to find that it is hostile.\n\n\"Plaintiff's hostile work environment claim must be related to conditions which actually altered her own work environment. Statements, actions, or conditions which occurred at the Atlantic City Police Department outside the presence of plaintiff and plaintiff was unaware [sic] cannot be considered part of the hostile work environment, unless you find such statements, actions or conditions affected the plaintiff's own work environment.\n\n\"In evaluating plaintiff's hostile work environment claims you should consider the following factors: one, plaintiff's reasonable expectation upon entering the workplace; two, the total physical environment of the area in which plaintiff worked; three, whether plaintiff was exposed to sexually explicit words or comments, drawings, graffiti, or obscenity in the workplace, and, if so, the degree, persistence, and type such [sic] obscenity to which exposed; four, whether the sexually explicit words or comments, drawings, graffiti or obscenity were directed at plaintiff, and, if so, the frequency of the offensive encounters; five[,] severity of the conduct and the context in which it occurred; six, whether the conduct was unwelcome, that is, conduct plaintiff regarded as unwanted or unpleasant; seven, the likely effect on a reasonable woman's psychological well-being; eight, whether the conduct reasonably[sic] interfered with plaintiff's work performance; nine, the extent to which supervisors upon learning of sexually harassing conduct, acted promptly and effectively to respond to such conduct; [ten], whether the complained of conduct was directed at men and woman alike.\n\n\"It is not enough that the work environment was generally harsh, friendly [sic], unple[a]sant, crude or vulgar to all employees of both sexes. In order tofind a hostile work environment sexual harassment, you must find that plaintiff was harassed because she is a woman. The harassing conduct may, but need not be sexual in nature. Rather, its defining characteristic is that the harassment occurs because of the victim's sex.\" App. at 5276-79.\n\nWe conclude that the district court's hostile work environment charge, taken as a whole, properly apprised the jury of the issues and law under the LAD. The charge clearly and accurately set forth the four-prong test set forth in Lehmann. Moreover, the court's list of factors provided additional guidance to the jury for its consideration of whether the requisite elements of liability had been established. Although this nonexhaustive list was largely derived from the ABA Model Charge and Title VII caselaw, we believe that the New Jersey Supreme Court wouldfind many of these factors useful and relevant for deliberations in a hostile work environment sexual harassment claim under the LAD.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e See Lehmann, 626 A.2d at 452 (\"In construing the terms of the LAD, this Court has frequently looked to federal precedent governing Title VII . . . as a key source of interpretive authority.\" (citation and quotation marks omitted)). As a result, we reject the ACPD's argument.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e We also find no merit in the ACPD's contention that one of the factors referenced in the charge, the plaintiff's reasonable expectation upon entering the workplace, is inconsistent with Lehmann's requirement that the finder of fact consider workplace hostility \"from the perspective of a reasonable woman.\" ACPD's Br. at 49 (quoting Lehmann, 626 A.2d at 457-58). In this case we do not see the harm from the shifting reference. Indeed, we fail to see how this distinction could aid the ACPD since, if anything, the \"reasonable expectation upon entering the workplace\" factor seems to give an employer extra leeway when a woman enters what she knows to be a traditionally male preserve, whereas the generalized reasonable woman standard is less concerned with what a workplace has traditionally been like and focuses on what a reasonable woman may rightfully expect from her employers. Finally, we reject the ACPD's contention that the district court erred in failing to instruct the jury as to precisely how each of the factors bore on the issue of sexual harassment.\n\nE. Faragher v. City of Boca Raton and Burlington Industries v. Ellerth\n\nAfter the initial oral argument on this appeal, the Supreme Court decided Faragher v. City of Boca Raton and Burlington Industries v. Ellerth. These decisions substantially changed the law of Title VII on employer liability. The ACPD contends that it is entitled to a new trial under the Ellerth/Faragher standards. For a variety of reasons, however, we conclude that the new structure and taxonomy of Title VII liability makes no difference to the outcome in this case. We first address the ACPD's claim that it was entitled to an affirmative defense, and then discuss the effects of Ellerth and Faragher on the \"quid pro quo\" claims in the case.\n\n1. The Affirmative Defense\n\nThe ACPD claims that the trial court's jury instructions were defective because the jury was instructed that the existence of an effective sexual harassment policy was merely a factor to be considered in imposing liability and not an absolute defense. There are four problems with this claim.\n\nFirst, Ellerth and Faragher do not, as the defendants seem to assume, focus mechanically on the formal existence of a sexual harassment policy, allowing an absolute defense to a hostile work environment claim whenever the employer can point to an anti-harassment policy of some sort. The necessary elements of a defense are \"(a) that the employer exercised reasonable care to prevent and correct promptly any sexually harassing behavior, and (b) that the plaintiff employee unreasonably failed to take advantage of any preventive or corrective opportunities provided by the employer or to avoid harm otherwise.\" Ellerth, 118 S. Ct. at 2270. A stated policy should be \"suitable to the employment circumstances.\" Id.\n\nThe proof at trial focused extensively on what the ACPD did and failed to do about the harassment--issuing written policies but not enforcing them, painting over offensive graffiti every few months only to see it go up again in minutes, failing to investigate sexual harassment as it investigated and punished other forms of misconduct. Although it diligently attempted to convince the jury that its policies and procedures protected it, the ACPD failed to make a colorable case that its policies met the Ellerth/Faragher standards. See Hurley, 933 F. Supp. at 419; cf. Payton v. New Jersey Turnpike Auth., 691 A.2d 321 (N.J. 1997) (holding that a slow remedial process or one that leaves an employee exposed to harassment cannot be effective). In Faragher, in fact, the Court found it unnecessary to remand for consideration of the newly codified defense, since the record established that Boca Raton failed to disseminate its policies or monitor the acts of its employees, so that as a matter of law it could not prevail on the defense. See Faragher, 118 S. Ct. at 2293; see also Booker v. Budget Rent-a-Car Sys., 17 F. Supp. 2d 735 (M.D. Tenn. 1998) (rejecting the affirmative defense on a summary judgment motion because the employer had notice of incidents of discrimination but failed to act on it).\n\nA similar analysis applies here. The district court commented extensively on the ACPD's failure to implement anti-harassment policies or to inquire into the harassing behavior of any of its employees. It was evident that Madamba, a supervisor with the duty to stop harassment, was aware of much of the harassment, even that which he did not himself inflict. The ACPD insists that there were five mechanisms that Hurley should have explored in full before suing: her direct supervisor, Internal Affairs, the Affirmative Action Officer, the Chief through his \"open door policy,\" and the union grievance procedure. See ACPD Letter, July 16, 1998, at 5. However, there was extensive testimony at trial about the ineffectiveness of these mechanisms. Moreover, Hurley had no obligation to try all these mechanisms, because her immediate supervisor, who was responsible for preventing and redressing harassment pursuant to the ACPD's own policy, was on notice of the harassment. An employer cannot \"use its own policies to insulate itself from liability by placing an increased burden on a complainant to provide notice beyond that required by law.\" Williamson v. City of Houston, 148 F.3d 462, 467 (5th Cir. 1998).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nSecond, the ACPD apparently misreads the jury instructions. The liability instructions first stated that the ACPD would be liable for acts within the scope of a supervisor's employment, which was to be Judged by the time, place, and foreseeability of the harassing acts. See XXII App. at A5281-82. The instructions continued that the existence of \"a widely-disseminated anti-harassment policy or a well-publicized and an effective formal or informal complaint structure, training or monitoring mechanisms\" would be evidence that sexual discrimination was not within the scope of employment. Id. at A5282.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Then, the instructions set forth the standard agency law on which Faragher and Ellerth relied--the employer is not liable for acts outside the scope of employment unless (1) the employer intended the conduct; (2) the employer was negligent or reckless in that it knew or should have known about the supervisor's actions and failed to take prompt and effective remedial measures; or (3) the supervisor was purporting to act as a supervisor, he had authority to control the employee's working environment, and his actions were aided and abetted by the authority delegated by the employer. See XXII App. at A5282-83 (tracking Lehmann, 626 A.2d at 461-62).\n\nNext, the instructions listed factors to consider when determining whether the employer's negligence contributed to a supervisor's sexual discrimination: the existence of a formal anti-harassment policy; the presence of effective formal or informal complaint structures, training, and/or monitoring mechanisms; the extent to which the employee used the existing complaint procedures; and whether the employer took prompt and effective remedial action in response to complaints. According to the instructions, these factors should be evaluated together. See id. at A5283 (tracking Lehmann, 626 A.2d at 463). Finally, the instructions stated that the ACPD would be responsible for harassment by non-supervisory employees if it knew or should have known that such harassment was occurring and failed to take preventive or curative measures when it had reason to believe that harassment may have occurred; the jury was instructed to consider whether the ACPD took \"all reasonable steps necessary to address sexual harassment.\" Id. at A5284.\n\nThe ACPD has failed to identify how these instructions conflict with Faragher and Ellerth, which relied on the same agency principles as Lehmann. Indeed the able trial Judge quite presciently anticipated Faragher and Ellerth. The ACPD argues that the instructions allowed the jury to find it liable if the jury concluded that some factors outweighed the existence of an effective sexual harassment policy. See ACPD Letter, July 16, 1998, at 8. The ACPD presumably means that the jury could have used the extent of the harassment to discount the ACPD's anti-harassment policy, although the ACPD is not clear on this issue. Of course, under Faragher, the extent of the harassment would be helpful evidence of the actual effectiveness of a formal policy, which is a necessary element of the Faragher defense. But that is beside the point, as the ACPD has confused the part of the instructions that sets forth a ten-factor test for determining whether a hostile environment existed, see supra Section II.A.4, with the part of the instructions that dealt with the ACPD's liability assuming that the jury found a hostile environment existed, see XXII App. at A5282-84. If anything, the ACPD got to double-dip on its harassment policy, because the jury was told to factor it into the initial hostile environment determination and then to use it again when considering liability. See Payton, 691 A.2d at 327 (approving this dual use).\n\nA third reason to reject the ACPD's contention is that Faragher and Ellerth establish that the defense of employer due care is an affirmative one. See Ellerth, 118 S. Ct. at 2270. Thus, the employer bears the burden of proof. The instructions given at trial put the burden on Hurley to prove that the ACPD was liable for negligence despite its harassment policy and other remedial measures. Any error, therefore, worked in favor of the ACPD and could not justify a new trial.\n\nFinally, Faragher and Ellerth do not necessarily control this case, which was also brought under the New Jersey LAD. Even if the jury instructions are not quite right with respect to Faragher, there is no colorable argument that they misstated New Jersey law. For all these reasons, we conclude that these recent additions to Title VII jurisprudence do not require us to reverse the judgment of the district court.\n\n2. The Quid Pro Quo Instruction\n\nHurley's quid pro quo claim was based on Madamba's alleged sexual invitations to her. She testified that when she complained about harassment to Madamba, he replied that women in the private sector avoided harassment because they \"sleep with their bosses.\" When she attempted to change the subject and commented on Madamba's apparent weight loss, he stated that he lost weight by \"having sex a few times a day,\" and that women came to him \"when they're ready.\" Hurley interpreted this entire conversation as a solicitation for sex.\n\nThe Dissent argues that Ellerth and Faragher require us to reverse because those cases held that there could be no quid pro quo claim as such if the plaintiff neither submitted to sexual demands nor suffered retaliatory action when she refused to submit. The jury instructions, however, required only that the jury find either that a supervisor conditioned tangible job benefits on submission to unwelcome sexual conduct, or that a supervisor penalized Hurley for refusing to participate in such conduct. It is possible, though not certain, that such instructions could be read to cover threats that were not acted upon. We agree with the Dissent that Ellerth and Faragher largely eliminated the distinction between hostile work environment claims and quid pro quo claims, focusing instead on the presence or absence of tangible adverse employment actions. See Durham Life Ins. Co. v. Evans, ___ F.3d ___, 1999 U.S. App. LEXIS 587 (3d Cir. Jan. 22, 1999). However, we conclude that the judgment should nonetheless be upheld.\n\nThe Dissent persuasively identifies the reasons that the quid pro quo claim was the least tenable of Hurley's claims, at least under Faragher and Ellerth. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e In fact, the conduct of which she complained was part of the hostile work environment she experienced, and this would necessarily have been apparent to the jury.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e But in light of the total record here, we are satisfied that no jury would have found the defendants liable solely on the basis of the quid pro quo instruction. Multiple sources--including physical evidence --corroborated the most egregious examples of sexual harassment, including the tampon incident and the obscene graffiti, see, e.g., infra n.5, while the only evidence of Madamba's suggestion came from Hurley's testimony. To us, it is inconceivable that a jury would have believed her testimony on this one issue, concluded that the ACPD was vicariously liable for one advance, and discounted the other incidents, which were sufficiently pervasive to consitute a hostile environment. Juries may be unpredictable, but we are not willing to posit total illogic, which would be contrary to our faith in the jury system as a whole. We are thus persuaded that any error was harmless.\n\nWe addressed a similar issue in Murray v. United of Omaha Life Insurance Co., 145 F.3d 143 (3d Cir. 1998):\n\n\"We agree that the jury charge as given by the district court did not conform to New Jersey law as we predict it. Nonetheless, we will not reverse a judgment where \"it is highly probable that the error did not contribute to the judgment,\" McQueeney v. Wilmington Trust Co., 779 F.2d 916, 924 (3d Cir. 1985), i.e., where the challenged error was harmless.\" Id. at 156 (footnote omitted).\n\nAn issue similar to that in this case arose in American Airlines, Inc. v. United States, 418 F.2d 180 (5th Cir. 1969), in which the District Court instructed the jury that it could return a verdict for the plaintiff if it found negligence in any one or more of thirty particulars. Each was supported by substantial evidence except one, and on that one count it was factually impossible that liability could appropriately be found. The court found that \"it is . . . inconceivable that in the mass of testimony so clearly establishing negligence in thirty other particulars this issue could have influenced the verdict against American.\" Id. at 195 (citing Fed. R. Civ. P. 61). Although there were fewer than thirty viable theories in this case, the weight of evidence and argument on the other theories of liability leads us to the same Conclusion here.\n\nWe concede the general correctness of the Dissent's proposition that faulty instructions on which a general verdict could have been based require reversal. The foundational case of Maryland v. Baldwin, 112 U.S. 490 (1884), addressed itself equally to faulty instructions and to erroneous admission of evidence, and announced that such errors require reversal. See id. at 493 (\"If . . . upon any one issue error was committed, either in the admission of evidence or in the charge of the court, the verdict cannot be upheld . . . .\"). It has long been acknowledged, however, that Baldwin does not speak to the harmless error situation. See Asbill v. Housing Auth. of the Choctaw Nation, 726 F.2d 1499, 1504 (10th Cir. 1984) (\"We note[Baldwin] does not paint with as broad a brush as appears from the language quoted. As with all errors committed at trial, a litmus test for reversal is whether the appellant was thereby unjustly prejudiced.\"). Evidentiary errors are subject to harmless error analysis, and the same is true for errors in instruction. See id.\n\nGiven Federal Rule of Civil Procedure 61's command to disregard \"any error\" that does not affect \"the substantial rights of the parties,\" and the authorities set forth in the margin,\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e we do not believe that we are creating a new rule. The cases cited by the Dissent for the proposition that we must reverse are distinguishable because they deal with instances in which the record rendered it impossible to determine the basis for the jury's decision. We discuss them, too, in the margin.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e To the extent that the Dissent is concerned about broad application of the harmless error rule, we agree entirely, and emphasize that our decision is founded on the extreme facts of this case. Because any error in the quid pro quo instruction could not by any stretch of the imagination change the verdict, we need not reverse.\n\nIII. Punitive Damages\n\nThe ACPD argues that the district court erred by failing to instruct the jury that punitive damages could only be awarded against the ACPD \"if there was `actual participation by upper management or willful indifference.' \" ACPD's Br. at 12 (quoting Lehmann, 626 A.2d at 464).\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Because the ACPD did not object to the district court's charge on this ground, we will review this claim for plain error.\n\nThe ACPD asserts that our plain error analysis should be guided by the New Jersey Appellate Division's decision in Maiorino v. Schering-Plough Corp., 695 A.2d 353 (N.J. Super. Ct. App. Div.), certif. denied, 704 A.2d 19 (N.J. 1997). In Maiorino, the court observed that\"a jury charge on punitive damages must include the instruction that upper management has to have . . . participated in or shown willful indifference to the situation.\" Id. at 368-69 (emphasis added) (citing Rendine v. Pantzer, 661 A.2d 1202 (N.J. 1995)). In fact, the court held that this concept is so essential to a fair trial that \"the failure to charge the jury with the necessity of finding upper management's involvement to justify a punitive award is such a fundamental flaw that [an appellate court] must recognize it as a matter of plain error.\" Id. at 368 (citation omitted). While the Maiorino decision provides persuasive authority regarding the substantive correctness of a jury charge in a diversity case such as this, it is well established that the question of whether error is plain is one of federal law. See Hinds v. General Motors Corp., 988 F.2d 1039, 1046 (10th Cir. 1993) (discussing harmless error); see also Beardshall v. Minuteman Press Int'l, Inc., 664 F.2d 23, 27 (3d Cir. 1981) (\"[T]he failure to object to jury instructions and the consequences thereof are procedural and are to be governed by federal law.\"). Accordingly, we must look to this court's plain error jurisprudence when considering the ACPD's appeal with respect to the punitive damage award.\n\nWe have repeatedly stated that, \"[i]n the absence of a party's preservation of an assigned error for appeal, we review only for plain error, and our power to reverse is discretionary.\" Chemical Leaman Tank Lines, Inc. v. Aetna Cas. \u0026 Sur. Co., 89 F.3d 976, 993 (3d Cir.) (quoting Fashauer v. New Jersey Transit Rail Operations, Inc., 57 F.3d 1269, 1289 (3d Cir. 1995)), cert. denied sub nom. Jackson v. Chemical Leaman Tank Lines, Inc., 117 S. Ct. 485 (1996). However, we should exercise our discretion sparingly so that Rule 51 and the beneficial policy goals it serves are not emasculated. See Chemical Leaman, 89 F.3d at 993-94; McAdam v. Dean Witter Reynolds, Inc., 896 F.2d 750, 770 n.31 (3d Cir. 1990). \"Thus, we should notice the error only if [it] is fundamental and highly prejudicial or if the instructions are such that the jury is without adequate guidance on a fundamental question and our failure to consider the error would result in a miscarriage of Justice.\" Fashauer, 57 F.3d at 1289 (quoting Bereda v. Pickering Creek Indus. Park, Inc., 865 F.2d 49, 53 (3d Cir. 1989)) (alteration in original) (internal quotation marks omitted).\n\nIn the present matter, there can be no doubt that the district court's charge was erroneous. The New Jersey Supreme Court has instructed that two distinct conditions must be satisfied before punitive damages may be awarded under the LAD. First, \"punitive damages can only be assessed against an employer if there was `actual participation by upper management or willful indifference.' \" Maiorino, 695 A.2d at 368 (emphasis added) (quoting Lehmann, 626 A.2d at 464); see also Maczik v. Gilford Park Yacht Club, 638 A.2d 1322, 1326 (N.J. Super. Ct. App. Div. 1994). Second, a plaintiff must also set forth \"proof that the offending conduct [is] `especially egregious.' \" Rendine, 661 A.2d at 1215 (quoting Leimgruber v. Claridge Assocs., Ltd., 375 A.2d 652 (N.J. 1977)). Conduct may be sufficiently egregious if it is \"intentional, malicious, and`evil-minded.' \" Gares v. Willingboro Twp., 90 F.3d 720, 728 (3d Cir. 1996) (quoting Rendine, 661 A.2d at 1215); see also Rendine, 661 A.2d at 1215 (\"Our cases indicate that the requirement [of willfulness or wantonness] may be satisfied upon a showing that there has been a deliberate act or omission with knowledge of a high degree of probability of harm and reckless indifference to consequences.\" (citation and internal quotation marks omitted)).\n\nBy contrast, the district court's punitive damage charge clearly failed to instruct the jury on the upper management requirement:\n\n\"If you find that plaintiff has established that either the Atlantic City Police Department or Henry Madamba is responsible for having engaged in acts of sexual discrimination against the plaintiff, you must consider whether to award punitive damages. You are not to consider the issue of punitive damages against Nicholas Rifice.\n\n\"It is not sufficient to award punitive damages solely on the basis that a defendant has engaged in acts of sexual discrimination.\n\n\"You may award plaintiff punitive damages solely on the basis that a particular defendant maliciously or wantonly violated plaintiff's rights, and an act is done maliciously if it is prompted by ill will or spite toward the injured person, an evil-minded act. An act is done wantonly if it is done with a reckless, callous or deliberate disregard of the injured person's rights. The plaintiff must prove by a preponderance of the evidence that the defendant acted maliciously or wantonly.\n\n\"In making your decision you should consider the purpose of punitive damages. You may consider whether the punitive damages are appropriate in order to punish the defendant adequately, whether punitive damages are necessary to prevent the defendant from committing these acts again, or whether punitive damages are likely to prevent others from committing similar acts.\n\n\"If you find the plaintiff is entitled to an award of punitive damages, the court will hold a further proceeding to determine the amount of that award.\" App. at 5287-89 (emphasis added).\n\nWe conclude that the district court committed plain error when it failed to instruct the jury that punitive damages could only be assessed if there was \"actual participation by upper management or willful indifference.\" The court's instructions failed to provide proper guidance for the jury on a fundamental question. Moreover, our failure to consider the error would result in a miscarriage of Justice. There was also serious disagreement at oral argument and in the parties' briefs about whether Madamba was actually part of upper management during the relevant times. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Accordingly, we will vacate the punitive damage award against the ACPD.\n\nIV. The Individual Defendants\n\nA. Madamba\n\n1. Assorted Challenges\n\nMadamba raises a number of arguments on appeal. First, he contends that he was entitled to judgment as a matter of law because the jury's finding of individual liability under N.J.S.A. 10:5-12(a) was against the weight of the evidence. Implicit in this argument is Madamba's assumption that the jury returned a verdict of individual liability under N.J.S.A. 10:5-12(a). We do not agree with this assumption. The district court's charge in this case clearly stated that the individual defendants were liable, if at all, for aiding and abetting the employer's violation of the Act.\n\nHurley argues that supervisors may be individually liable as employers under the LAD. The New Jersey courts have not specifically addressed the issue. The Dissent makes a cogent argument for individual liability, and it is clear that reasonable people can disagree on this point. But the New Jersey decisions cited by the Dissent, see Dissent at 74-77, did not rule on individual supervisory liability, and hence we do not find them controlling. Nor do we think the statutory text offers guidance. While an \"employer\" may be \"one or more individuals\" under N.J.S.A. 10:5-5(a), that does not necessarily mean that supervisors, themselves employed by individuals or corporations, are \"employers.\" Title VII defines \"employer\" to include \"a person . . . who has fifteen or more employees\" or \"any agent\" of such a person, 42 U.S.C. § 2000e(b), and it could be subjected to the same analysis the Dissent uses to find individual liability possible under LAD.\n\nWe also note that imposing direct liability on supervisors, who are likely to be substantially judgment-proof, will not significantly add to the force of anti-discrimination law, which already gives employers incentives to ban discrimination and monitor supervisors' activities. We think that there is insufficient reason to predict that New Jersey would diverge from the federal scheme on this point. See, e.g., Sheridan v. E.I. DuPont de Nemours \u0026 Co., 100 F.3d 1061, 1077-78 (3d Cir. 1996). In sum, while the point is close, as well as unclear, we are simply not willing to predict that New Jersey would include supervisors in the statutory definition of \"employer.\"\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nSecond, Madamba joins the ACPD's evidentiary challenges and its attack on the hostile work environment charge, which we have already rejected. Third, he objects that the court permitted the jury to find liability against Madamba on four separate theories of liability when they should have only considered liability for hostile work environment sexual harassment. We do not agree, because the various theories of liability were properly submitted to the jury. There was sufficient evidence on all theories to go to the jury, and the instructions clearly indicated that the mere presentation of a possible theory to the jury did not mean that any defendant was liable on that theory, or on any theory. We reiterate that the instructions indicated that the individual defendants were liable, if at all, for aiding and abetting the employer's violation of the Act. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nFourth, Madamba argues that the court's compensatory damages charge failed to instruct the jury \"that it cannot award damages for any conduct that plaintiff was not subjected to, aware of, or with respect to Madamba, which occurred prior to 1990.\" Madamba Br. at 49-50. But the relevant section of the instructions adequately limited Madamba's exposure by setting forth the time limits on recovery and the purposes for which the jury could use evidence of acts not directed at Hurley, even though it did not specifically mention Madamba at that point. See supra Section II.B.\n\n2. Aiding and Abetting\n\nFinally, Madamba contends that the court's aiding and abetting instruction permitted the jury to impose individual liability under an erroneous standard. The LAD provides that it is unlawful for \"any person, whether an employer or an employee or not, to aid, abet, incite, compel or coerce the doing of any of the acts forbidden under this act, or to attempt to do so.\" N.J.S.A. 10:5-12(e). In our decision in Failla v. City of Passaic, issued after the verdict in this case, we held that individual supervisors may be liable for aiding and abetting under the LAD. In reaching this Conclusion, we predicted that the New Jersey Supreme Court would follow the Restatement (Second) of Torts § 876(b) to define aiding and abetting liability under the LAD. See Failla, 146 F.3d at 158. That section provides \"that a person is liable for harm resulting to a third person from the conduct of another when he `knows that the other's conduct constitutes a breach of duty and gives substantial assistance or encouragement to the other so to conduct himself . . . .' \" Id. (quoting Restatement (Second) of Torts § 876(b)). We also predicted that, under New Jersey law, \"inaction can form the basis of aiding and abetting liability if it rises to the level of providing substantial assistance or encouragement.\" Id. at 158 n.11 (citing Dici v. Pennsylvania, 91 F.3d 542, 553 (3d Cir. 1996)).\n\nWhile we have rejected a requirement that an individual and an employer share the same discriminatory intent in order to find aiding and abetting liability, see Failla, 146 F.3d at 157, we have not fully elucidated the principles that might allow a harassing supervisor to be individually liable for aiding and abetting the actionable conduct of his employer, when the challenged conduct is failing to stop the supervisor's own harassment. Cf. United States v. Sain, 141 F.3d 463, 474 (3d Cir. 1998) (finding that a person can aid and abet a corporation that he or she fully owns and controls). This is a somewhat awkward theory of liability. We believe, however, that it can be explained in this manner: A supervisor, under New Jersey law, has a duty to act against harassment. See Taylor, 706 A.2d at 691. This duty can be violated by deliberate indifference or affirmatively harassing acts. When a supervisorflouts this duty, he subjects himself and his employer to liability. Cf. Judson v. Peoples Bank \u0026 Trust Co., 134 A.2d 761 (N.J. 1957) (holding that both agent and principal will be liable when the agent acts within the scope of his employment but for his own purposes).\n\nThe ACPD's wrongful conduct in this case was inaction -- its tolerance of sexual harassment. The jury had evidence before it that Madamba assisted this tolerance by tolerating and even encouraging the harassment. As part of the chain of command that Hurley was expected to follow, he controlled her access to the most effective potential solutions to the harassment. Instead of taking steps to assist her, he told her that she should stop complaining or it would only get worse; he suggested that sleeping with him might protect her; he laughed at the drawings and graffiti about her; and he demeaned her as an officer on a daily basis. When she finally went over his head and requested a transfer because of the harassment, he gave his superior a memo accusing her of lying. We are also mindful of the moral authority of a police captain over his officers. When Madamba laughed at Hurley's discomfort and denigrated her, his officers could easily learn the lesson that harassing women was part of being an ACPD officer.\n\nMadamba arguably failed to stop the harassment because he wanted it to continue. But, as Failla held, there is no requirement of \"shared intent\" between the primary wrongdoer and the aider and abettor. If Madamba's malice substantially assisted the ACPD's inaction, then he is an aider and abettor despite any difference in state of mind, assuming that the ACPD can be said to have a mental state. His liability can be grounded in his failure to stop the harassment, which included both active and passive components.\n\nBecause we conclude that Madamba could be liable for aiding and abetting, we must decide whether the jury instructions adequately set forth the applicable law. Based on Restatement § 876(b), courts have determined that the tort of aiding and abetting involves three elements: \"(1) the party whom the defendant aids must perform a wrongful act that causes an injury; (2) the defendant must be generally aware of his role as part of an overall illegal or tortious activity at the time that he provides the assistance; (3) the defendant must knowingly and substantially assist the principal violation.\" Halberstam v. Welch, 705 F.2d 472, 477 (D.C. Cir. 1983); see also In re Temporomandibular Joint (TMJ) Implants Prods. Liab. Litig., 113 F.3d 1484, 1495 (8th Cir. 1997); Metge v. Baehler, 762 F.2d 621, 624 (8th Cir. 1985).\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The district court provided the following charge for aiding and abetting:\n\n\"[I]ndividual defendants . . . may be held liable only for their individual, affirmative wrongful acts. They may not be held liable for the conduct of others, nor for their inaction or delay in responding to such conduct. An individual defendant may be held liable, however, if he aids, abets, incites, compels or coerces another person's unlawful acts of discrimination.\n\n\"Aid is defined as meaning to assist, support or supplement the efforts of another. Abet is defined as meaning to encourage, counsel, incite or instigate the commission of unlawful conduct.\n\n\"In order the [sic] aid or abet another to commit an unlawful act, it is necessary that the defendant willfully and knowingly associate himself in some way with the unlawful act, and that he willfully and knowingly seek by some act to make the unlawful act succeed.\" App. at 5284, 5314.\n\nAlthough the district court's charge is compatible in some respects with the substance of section 876(b), the court misstates the law in two crucial respects: First, the charge does not allow for liability based on inaction. To be sure, Madamba can hardly claim he was prejudiced by this particular omission, because the jury concluded that he committed affirmative, harassing conduct. But the instructions also allowed the jury to impose liability for mere assistance, rather than substantial assistance. This was incorrect. Moreover, we cannot conclude that it is highly probable that the absence of a substantial assistance requirement did not affect the jury's verdict. See McQueeney, 779 F.2d at 924. Accordingly, we must vacate the judgment against Madamba and order a new trial. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nB. Rifice\n\nHurley argues in her cross-appeal that the district court's aiding and abetting charge misstated the law under the LAD by requiring a finding of affirmative sexual harassment before Rifice could be found individually liable. She also argues that the district court erred by striking her punitive damage claim against Rifice. We agree.\n\nAs noted above, the district court's aiding and abetting charge provided that the \"individual defendants such as Nicholas Rifice and Henry Madamba . . . may only be held liable for their individual, affirmative wrongful acts.\" XXII App. at 5284. However, in Failla, we expressly rejected this view and concluded that \"inaction can form the basis of aiding and abetting liability if it rises to the level of providing substantial assistance or encouragement.\" Failla, 146 F.3d at 158 n.11. Accordingly, the district court's charge misstated the law under the LAD. The district court noted that the charge might well have determined the jury's verdict. See Hurley, 933 F. Supp. at 417-18.\n\nThe evidence against Rifice mainly concerned his awareness of and apparent indifference to the harassment. Rifice testified that he did nothing to stop the harassment because the harassers should already have known better and he did not believe that he could do anything about it. This kind of knowing inaction by a high-level employee with responsibility over Hurley and her harassers could, we think, rise to the level of substantial assistance. We will therefore vacate the judgment in favor of Rifice and the district court's order striking plaintiff's punitive damage claim against Rifice.\n\nC. Mooney\n\nHurley next argues that the district court erred by granting summary judgment in favor of defendant Mooney.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Mooney argued, and the district court agreed, that he was entitled to summary judgment on Hurley's LAD claim because, as a non-supervisory co-employee, he was not an \"employer\" for purposes of N.J. Stat. Ann.§ 10:5-5(e).\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e See Hurley v. Atlantic City Police Dept., 1995 WL 854478, at *10 (D.N.J. Aug. 4, 1995). The court reached this Conclusion, in part, because \"non-supervisory co-employees cannot be held liable under Title VII, and New Jersey courts have often looked to that statute to resolve questions under the NJLAD.\" Id. (citing Lehmann, 626 A.2d at 452). Although Mooney may have had considerable unofficial power because of his well-known promotion prospects and high-ranking relatives, he was not an \"employer.\" Hurley argues that § 10:5-5(e) is not relevant because Mooney was individually liable under the LAD as an aider and abettor. We predict that, under New Jersey law, a nonsupervisory employee cannot be held liable as an aider and abettor for his own affirmative acts of harassment, because such affirmative acts do not substantially assist the employer in its wrong, which is its failure to prevent and redress harassment by individual employees. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Rather, a nonsupervisory employee's harassment takes advantage of the employer's wrongful conduct; it is the employee who seems to be \"aided and abetted\" by the employer.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e A supervisor, by contrast, may be liable as an aider and abettor for active harassment or knowing and willful inaction, because in either case the supervisor violates his or her duty as a supervisor to prevent and halt harassment.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nV. The Hurleys' Remaining Claims\n\nHurley argues that the district court abused its discretion by denying her motion for an additur. While the basis for her claim is not entirely clear, she appears to suggest that she is entitled to an additur because the district court's jury charge erroneously limited liability to the accrual period (January 20, 1987 through January 20, 1993), even though there was ample evidence in the record that defendants continued to harass her through the end of trial. Although she has filed a related action to include these later claims, she has advised the court \"that she would be willing to forego her compensatory claims in that other action were this Court to exercise its appellate jurisdiction in the form of an additur.\" Appellee's Br. at 38-39. Yet the Hurleys filed their original complaint in this action on January 20, 1993. Since that date, they have not amended their complaint to include any claims for conduct that occurred after that time; those claims remain in their related action. Clearly, the district court did not abuse its discretion by denying an additur based on claims that were never before the court.\n\nHurley next claims that the district court erred by denying her prejudgment interest on the remitted compensatory award. In Coleman v. Kaye, 87 F.3d 1491 (3d Cir. 1996), cert. denied, 117 S. Ct. 754 (1997), we considered whether a plaintiff could recover prejudgment interest against the County of Monmouth after a jury found the County liable under the LAD for intentional sexual discrimination. In rejecting such an award, we observed:\n\n\"Nor can prejudgment interest be assessed against the County of Monmouth. The court rule that Coleman invokes expressly provides that prejudgment interest will not be awarded against a public entity \"[e]xcept where provided by statute . . . .\" N.J. Ct. R. 4:42-11(b). There is no statutory authorization in New Jersey for such an award. To the contrary, as the New Jersey Appellate Division stated in Maynard v. Mine Hill Township, 244 N.J. Super. 298, 582 A.2d 315, 318 (App. Div. 1990), the New Jersey Tort Claims Act \"specifically prohibits prejudgment interest against government tortfeasors.\" Id. at 1511-12 (citation omitted).\n\nAccordingly, we will affirm the district court's denial of plaintiff's motion for prejudgment interest.\n\nMr. Hurley argues that the district court erred by granting summary judgment on his loss of consortium claim under the LAD. Specifically, he asserts that the LAD permits recovery of all damages available under the common law, and a claim for loss of consortium is\"more accurately described as an element of damage rather than a separate cause of action . . . .\" Appellee's Br. at 42. He further asserts that a claim for loss of consortium under the LAD effectuates the remedial purposes of the statute by providing compensation for the damage done to his marital relationship.\n\nAlthough the New Jersey Supreme Court has not answered the question of whether per quod damages for loss of consortium are recoverable under the LAD, the Superior Court of New Jersey, Appellate Division,firmly rejected such a claim in Catalane v. Gilian Instrument Corp., 638 A.2d 1341 (N.J. Super. Ct. App. Div. 1994). Specifically, the court held that \"the Legislature did not intend to establish a cause of action for any person other than the individual against whom the discrimination was directed.\" Id. at 1353 (citing N.J. Stat. Ann. § 10:5-3); cf. Flaherty v. Enclave, 605 A.2d 301, 305 (N.J. Super. Ct. Law Div. 1992) (per quod damages are not recoverable under the Conscientious Employee Protection Act, or \"whistleblower\" statute). In reaching this Conclusion, the Catalane court reasoned that \"[i]f per quod claims were to be allowed under the Act, the Legislature would have so noted in light of its careful recitation of the damages it intended to allow.\" Catalane, 638 A.2d at 1353.\n\nBecause the court's holding rests on a sensible reading of the LAD, we predict that the New Jersey Supreme Court would follow Catalane and conclude that the LAD makes no provision for such an ancillary claim. Accordingly, the district court properly granted summary judgment as to Mr. Hurley's loss of consortium claim.\n\nFinally, plaintiff's counsel argues that the district court erred by setting his hourly rate at $200, rather than his requested hourly rate of $300. Counsel contends that, although his requested rate was supported by an independent affidavit, the court instead relied on \"an unsworn hearsay letter from a senior partner in a law firm that routinely defends Atlantic City Police Department representatives.\" Appellee's Br. at 40. Counsel further contends that the court based the $200 rate on a generalized sense of what is customary and proper, rather than on appropriate record evidence.\n\nWe review the reasonableness of an award of attorney's fees for an abuse of discretion.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e See Smith v. Philadelphia Housing Auth., 107 F.3d 223, 225 (3d Cir. 1997); Washington v. Philadelphia County Ct. of Common Pleas, 89 F.3d 1031, 1034 (3d Cir. 1996). As we observed in Smith:\n\n\"[A] district court may not set attorneys' fees based upon a generalized sense of what is customary or proper, but rather must rely upon the record. The plaintiff bears the burden of producing sufficient evidence of what constitutes a reasonable market rate for the essential character and complexity of the legal services rendered in order to make out a prima facie case. Once the plaintiff has carried this burden, defendant may contest that prima facie case only with appropriate record evidence. In the absence of such evidence, the plaintiff must be awarded attorney's fees at her requested rate. If the hourly rates are disputed, the district court must conduct a hearing to determine the reasonable market rates.\" 107 F.3d at 225 (quotation marks and citations omitted).\n\nIn the present matter, the district court found that the proposed fees of plaintiff 's counsel were excessive for the following reasons:\n\n\"The defendants have submitted an affidavit accompanied by a letter from Jack Plackter, Esq., of the law firm of Horn, Goldberg, Gorny, Daniels, Plackter \u0026 Weiss. Mr. Plackter writes that his firm charges the following rates: partners, $95-$225; associates, $85-$150; paralegals, law clerks, and other unlicensed legal assistants, $50-$70.\n\n\"We believe that Mr. Plackter's submitted rates provide a more suitable framework in which to set fees. Based on Mr. Plackter's letter, the other evidence in the record, the Court's close familiarity with the New Jersey legal market, our direct experience with Mr. Van Syoc and his employees, and applicable case law, we will apply the following hourly rates: Mr. Van Syoc: $200.00; Mr. Folkman: $150.00; Mr. Blaker: $115.00; Junior Associates (Allen, Kopelson, Erdek, Byler): $85.00; Law Clerks and Paralegals: $50.00.\" 933 F. Supp. at 428.\n\nTo the extent that the district court's calculation of hourly rates was based on a \"generalized sense of what is customary and proper,\" rather than on evidence in the record, it was error. Smith, 107 F.3d at 225. However, because defendants submitted an affidavit to contest the hourly rates, and because plaintiff's counsel waived any right to a hearing on this issue,\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e we cannot conclude that the district court abused its discretion in concluding that the $200 hourly rate is proper under the circumstances. Accordingly, we will affirm the district court's order granting plaintiff attorney's fees subject to a reduced rate. However, in light of our decisions with respect to the individual defendants in this case, we will vacate the fee award order insofar as it established the total hours worked on successful claims and the total fee award and remand for reconsideration.\n\nVI.\n\nFor the foregoing reasons, we will affirm the amended judgment insofar as it imposes liability on the ACPD. However, we will vacate the amended judgment to the extent it awards punitive damages against the ACPD and order a new trial on this issue. Moreover, we will vacate the amended judgments entered against defendant Madamba and in favor of defendant Rifice, but affirm the district court's order granting Mooney's motion for summary judgment. Finally, we will affirm the district court's orders dismissing Mr. Hurley's loss of consortium claim, denying plaintiff's motions for prejudgment interest and an additur, and granting plaintiff's motion for attorney's fees subject to a reduced hourly rate.\n\nCOWEN, Circuit Judge, Concurring in part, and Dissenting in part.\n\nI agree with the majority that a new trial is necessary with respect to defendants Madamba and Rifice. I also agree that the District Court's instruction to the jury regarding liability for punitive damages under the New Jersey Law Against Discrimination (\"LAD\") constituted plain error, and that the District Court properly dismissed Mr. Hurley's loss of consortium claim, denied plaintiff's motion for prejudgment interest and an additur, and granted plaintiff's motion for attorneys' fees subject to a reduced hourly rate.\n\nI must respectfully part company with the majority, however, insofar as they affirm the judgment of liability against the ACPD. The District Court instructed the jury that it could find Madamba and the ACPD liable based on, among other theories, quid pro quo sexual harassment. But the District Court's instruction on this subject was erroneous because it did not require that the juryfind that plaintiff suffered a tangible employment action as a result of her refusal to submit to her supervisor's sexual demands. Moreover, even if the jury instruction was correct, there is simply no evidence to support plaintiff 's quid pro quo claim. Because the jury was asked only to return a general verdict as to the defendants' liability without specifying which theory of liability it credited, it is possible that the jury assessed liability against the ACPD based on a legally and factually flawed theory. Under these circumstances, both Supreme Court and Third Circuit authority require that we vacate the judgment against the ACPD. The majority's adoption of a harmless error doctrine to salvage the tainted general verdict in this case is both contrary to precedent and exceedingly unwise.\n\nI also Dissent from the majority's prediction of New Jersey law that there is no cause of action against individual supervisors for their own acts of sexual harassment under LAD § 10:5-12(a). Numerous decisions of the New Jersey courts, including the New Jersey Supreme Court itself, support Hurley's contention that supervisors such as Rifice and Madamba are \"employer[s]\" within the meaning of § 10:5-12(a). The majority's holding to the contrary erroneously substitutes our assessment of the LAD in place of the New Jersey courts' interpretation of their own statute. Finally, because there is sufficient evidence from which a jury could conclude that defendant Mooney aided and abetted Madamba and the ACPD in creating a hostile work environment, I would reverse the District Court's grant of summary judgment in his favor.\n\nI. Quid Pro Quo Liability\n\nThe District Court charged the jury that the ACPD and Madamba could be liable based on four separate and distinct theories of sex discrimination: (i) intentional discrimination; (ii) hostile work environment; (iii) retaliation; and (iv) quid pro quo. With respect to quid pro quo sexual harassment, this court has held:\n\n\"[U]nwelcome sexual advances, request for sexual favors, and other verbal or physical conduct of a sexual nature constitute [quid pro quo] sexual harassment when (1) submission to such conduct is made either explicitly or implicitly a term or condition of an individual's employment [or] (2) submission to or rejection of such conduct by an individual is used as the basis for employment decisions affecting such individual.\" Bonenberger v. Plymouth Township, 132 F.3d 20, 27 (3d Cir. 1997) (internal quotation omitted).\n\nSimilarly, the New Jersey Supreme Court, interpreting the LAD in Lehman v. Toys `R Us, 626 A.2d 445 (1993), stated that\"quid pro quo sexual harassment occurs when an employer attempts to make an employee's submission to sexual demands a condition of his or her employment. It involves an implicit or explicit threat that if the employee does not accede to the sexual demands, he or she will lose his or her job, receive unfavorable performance reviews, be passed over for promotions, or suffer other adverse employment consequences.\" Id. at 452.\n\nOur understanding of quid pro quo sexual harassment has been altered by the Supreme Court's decision in Burlington Indus., Inc. v. Ellerth, 118 S. Ct. 2257 (1998). In Ellerth, the Court granted certiorari to decide whether a plaintiff may state a claim for quid pro quo sexual harassment \"where the plaintiff employee has neither submitted to the sexual advances of the alleged harasser nor suffered any tangible effects on the compensation, terms, conditions, or privileges of employment as a consequence of a refusal to submit to those advances?\" 118 S. Ct. at 2265. Notwithstanding this question, the Court determined that the critical issue in the case was the scope of employer liability, not the contours of quid pro quo sexual harassment. As the Court made clear, for the purposes of determining employer liability, the categories of quid pro quo and hostile work environment are not controlling. Id. Still, the Court acknowledged that the categories\"are relevant when there is a threshold question whether a plaintiff can prove discrimination\" to the extent that \"they illustrate the distinction between cases involving a threat which is carried out and offensive conduct in general.\" Id. According to the Supreme Court, cases such as Ellerth, which involve only unfilled threats and no tangible employment action, are properly categorized as hostile work environment claims, not quid pro quo claims. Id. Accordingly, to prove a claim of quid pro quo sexual harassment, a plaintiff must demonstrate either that she submitted to the sexual advances of her alleged harasser or suffered a tangible employment action as a result of her refusal to submit to those sexual advances. See Newton v. Cadwell Labs., 156 F.3d 880, 883 (8th Cir. 1998) (discussing quid pro quo claims after Ellerth); Ponticelli v. Zurich American Ins. Group, 16 F. Supp. 2d 414, 428 (S.D.N.Y. 1998) (same).\n\nIn this case, the District Court instructed the jury regarding quid pro quo sexual harassment as follows:\n\n\"Finally, quid pro quo sexual harassment. Loosely translated, quid pro quo means, this for that. To prove quid pro quo sexual harassment, plaintiff must prove by a preponderance of the evidence that someone with supervisory authority over her engaged in conduct that conditioned tangible job benefits including compensation, promotion, and other terms, conditions or privileges of employment on submission to unwelcome sexual conduct or penalized her for refusing to participate in such conduct.\" App. at A5280.\n\nAlthough the District Court's instruction would have been acceptable under Bonenberger and Lehman, it fails under Ellerth. Most problematically, the instruction did not require that plaintiff prove that she actually suffered a tangible employment action as a result of her refusal to submit to her supervisor's sexual advances. As the majority acknowledges, Maj. Op. at 37, the instruction permitted the jury to find liability for quid pro quo sexual harassment if a supervisor conditioned a tangible job benefit on plaintiff 's submission to a sexual demand, even if the supervisor never actually penalized plaintiff for her failure to submit. Because quid pro quo liability based on such unfulfilled threats is incompatible with Ellerth, the District Court's instruction on this subject was erroneous.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nEven if the District Court's quid pro quo instruction could be read to require a finding that plaintiff actually suffered a tangible employment action as a result of her refusal to submit to her supervisor's sexual demands, the claim should not have been submitted to the jury because there is no evidence to support it. The only factual basis for plaintiff's quid pro quo claim is Madamba's statement to Hurley that women frequently sleep with their bosses in order to gain protection against sexual harassment. In the same conversation, Madamba also told plaintiff that he had lost weight by \"having sex a few times a day\" and that women came to him \"when they're ready.\" Plaintiff contends, quite plausibly, that this conversation was a solicitation for sex. But this does not establish a quid pro quo claim unless plaintiff also proves that she suffered a tangible employment action as a result of her refusal to submit to Madamba's advances. There is simply no proof of this. Plaintiff has never even alleged that there is a causal connection between her failure to submit to Madamba's advances and any tangible employment action that she may have suffered.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e In light of Ellerth, plaintiff cannot maintain a quid pro quo claim, and defendants were entitled not to have this unsubstantiated theory submitted to the jury.\n\nThe majority, while conceding that plaintiff's quid pro quo claim is \"the least tenable of Hurley's claims,\" Maj. Op. at 37, nevertheless attempts to justify its submission by suggesting that a reasonable jury could have determined that Madamba had plaintiff transferred from Charlie Platoon to a less desirable position in the Property and Evidence Unit because she refused his sexual advances. Id. at n.26. This theory, while imaginative, is without foundation in the record. Plaintiff has never argued, either to this Court or the District Court, that there was a nexus between that transfer and her failure to submit to Madamba's sexual advances.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e And for good reasons. According to plaintiff, Madamba's sexual overtures to her occurred on March 26, 1990. Plaintiff testified that this date stood out in her mind because it was her husband's birthday. App. at A2497:4-6. But plaintiff was not transferred to the Property and Evidence Unit until November 8, 1990, approximately one week after she submitted a memorandum in which she detailed the harassment that she suffered at Charlie Platoon and requested a transfer. Hurley, 933 F. Supp. at 406. In addition, the transfer was authorized by the Acting Chief of Police, not by Madamba, who as a captain did not have the authority to transfer plaintiff or anyone else. Accordingly, while plaintiff has argued, and a reasonable jury could conclude, that plaintiff 's transfer to the Property and Evidence Unit was in retaliation for her sexual harassment complaints, the notion that the transfer was somehow connected to plaintiff 's failure to submit to Madamba's sexual advances over seven months earlier is implausible in the extreme, and no reasonable jury could so find based on the present record.\n\nWe are thus presented with a situation where a jury has returned a general verdict of liability against the defendants, but one of the theories on which that verdict may have rested was both improperly presented and was not supported by the evidence. Under these circumstances, our precedents could not be more clear. \"Where a jury has returned a general verdict and one theory of liability is not sustained by the evidence or legally sound, the verdict cannot stand because the court cannot determine whether the jury based its verdict on an improper ground.\" Wilburn v. Maritrans GP Inc., 139 F.3d 350, 361 (3d Cir. 1998); see also Brokerage Concepts v. U.S. Healthcare, Inc., 140 F.3d 494, 534 (3d Cir. 1998); Limbach Co. v. Sheet Metal Workers Int'l Assoc., 949 F.2d 1211, 1217-18 (3d Cir. 1991) (\"Under this court's jurisprudence, we must set aside a general verdict if it was based on two or more independent grounds one of which was insufficient, and we cannot determine whether the jury relied on the valid ground.\"), aff'd on rehearing en banc, 949 F.2d 1241 (3d Cir. 1991); Carden v. Westinghouse v. Electric Corp., 850 F.2d 996, 1000 (3d Cir. 1988); Avins v. White, 627 F.2d 637, 646 (3d Cir. 1980); Simko v. C \u0026 C Marine Maintenance Co., 594 F.2d 960, 967 (3d Cir. 1979); Albergo v. Reading Co., 372 F.2d 83, 86 (3d Cir. 1967).\n\nOur decision in Carden, 850 F.2d at 996, is illustrative. In that case, plaintiff sued his former employer for age discrimination. At trial, plaintiff pressed two different theories: first, direct evidence of intentional discrimination; and second, circumstantial evidence of discrimination under the burden-shifting analysis of McDonnell Douglas v. Green, 411 U.S. 792 (1973). The jury returned a general verdict in plaintiff 's favor. On appeal, defendants successfully argued that the only testimony supporting plaintiff's intentional discrimination claim was erroneously admitted into evidence by the district court, and that without such testimony, there was insufficient evidence to support the claim of intentional discrimination. Although we recognized that there was more than sufficient evidence to support plaintiff's McDonnell Douglas claim, we nonetheless concluded that the general nature of the jury's verdict necessitated a new trial:\n\n\"Significantly, the jury's liability interrogatory, and hence the jury's answer, is in effect a general verdict. It did not distinguish between the two theories on which the district court charged: i.e. liability predicated on a finding of intentional discrimination, or liability predicated on an indirect finding grounded in the three-part McDonnell Douglas formula. Thus, unless we are satisfied that Carden proved both direct and indirect liability on the part of Westinghouse, we are compelled to reverse the judgment because the jury's verdict, general in nature, may have rested exclusively on a ground that is not supported by evidence. . . . In our jurisprudence it has been established that a general verdict must be set aside where the jury has been instructed that it could rely on two or more independent grounds or claims and one of those grounds or claims turns out to be insufficient.\" Id. at 999-1000 (emphasis added) (internal citations omitted).\n\nThe Supreme Court has been equally consistent in holding that a general verdict in a civil case must be reversed if any of the claims submitted to the jury are found to be unsound. Over a century ago, the Court explained that the general verdict's \"generality prevents us from perceiving upon which plea they found. If, therefore, upon any one issue, error was committed, either in the admission of evidence or in the charge of the court, the verdict cannot be upheld . . ..\" Maryland v. Baldwin, 112 U.S. 490, 493 (1884). Since Baldwin, the Supreme Court has reaffirmed this rule, without exception, on at least three separate occasions. See Sunkist Growers, Inc. v. Winckler \u0026 Smith Citrus Prods. Co., 370 U.S. 19, 29-30 (1962); United New York \u0026 New Jersey Sandy Hook Pilots Assoc. v. Kalecki, 358 U.S. 613, 618-19 (1959); Wilmington Star Mining Co. v. Fulton, 205 U.S. 60, 78-79 (1907). Applying this well-settled principle to the facts of this case leads to the inevitable Conclusion that the verdict against the ACPD and Madamba should be vacated because we do not know whether those defendants were found liable based on a quid pro quo theory that is both legally and factually defective.\n\nFaced with the clear command of our prior cases, as well as the governing Supreme Court doctrine, the majority holds that even if plaintiff's quid pro quo claim was erroneously presented to the jury and lacked evidentiary support, the judgment against the ACPD should still be affirmed because, the majority declares, \"no jury would have found the defendants liable based solely on[the] quid pro quo\" claim, and therefore, \"any error was harmless.\" Maj. Op. at 38. Although the majority claims that this is not a new rule, the fact of the matter is that prior to today's decision, this court has never relied on a harmless error analysis to affirm a general verdict that may have rested on an improper ground.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e It is remarkable that after more than one hundred years of reviewing civil judgments founded on general verdicts, the majority believes that we have only now come upon the case that calls for such drastic action. I do not believe that that day has arrived.\n\nThe majority concludes that the evidence to support plaintiff's hostile work environment claim -- the sexually explicit graffiti and the sanitary napkin incident, in particular -- is so strong that there is no possibility that the jury assessed liability against the ACPD based solely on Madamba's alleged sexual advances. No one, save the defendants perhaps, would dispute that plaintiff presented substantial evidence in support of her hostile work environment claim. But can any of us really purport to know how the jury viewed the evidence in this case? Any experienced trial lawyer can attest to the fact that juries sometimes view cases in suprising ways. Although one would not know it from the majority's opinion, according to the District Court, the facts in this matter were \"hotly contested, and at trial there was conflicting evidence with respect to almost everything.\" Hurley, 933 F. Supp. at 404 n.4. For example, the defendants produced evidence that the graffiti, though by all accounts appalling, was promptly removed when ACPD supervisory personnel learned of its existence. There was also evidence that the graffiti was directed at both male and female officers. The sanitary napkin incident was the subject of conflicting testimony as well: several police officers testified that Madamba, upon seeing the display, immediately had it taken down and adamantly instructed his officers to cease such behavior. The point, of course, is not whether my colleagues or I would have credited these explanations if we were jurors; it is that the actual jurors in this case, consistent with their oaths and the instructions of the District Court, could have accepted the ACPD's defense to the hostile work environment claim, but still assessed liability on the faulty quid pro quo claim because they were convinced that Madamba propositioned Hurley for sex and threatened to retaliate if she did not submit. To recognize that this scenario may have occurred does not presume \"total illogic\" on behalf of the jury, as the majority asserts. Maj. Op. at 38. To the contrary, it assumes only that the jury carefully considered the evidence and followed the instructions of the District Court.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nThe invocation of a harmless error rule in this case is particularly misguided because it will produce no benefit to either the judicial system or the parties. As the Supreme Court has recognized, the chief justification of the harmless error doctrine is the conservation of judicial resources. See United States v. Hastings, 461 U.S. 499, 509 (1983) (quoting R. Traynor, The Riddle of Harmless Error 81 (1970)); see also 11 Wright et al., Federal Practice and Procedure § 2881 at 443 (\"The theory of the harmless-error rule generally is that procedure is a practical means to an end, the requirements of which should be no more exacting than efficiency requires.\"). But in this case, as a consequence of our decision to vacate the punitive damages award against the ACPD and the liability judgments against Madamba and in favor of Rifice, the entire matter will have to be re-presented to a new jury. There is thus no efficiency advantage to support the majority's approach. Nor will the parties themselves be well-served by today's decision. The ACPD, for obvious reasons, would rather present their evidence to a new jury without defending against an unsubstantiated claim. Even the plaintiff, however, by being deprived of an opportunity to have a single jury review all of her claims and, if appropriate, assess both compensatory and punitive damages, will be disadvantaged by the majority's limited affirmance of only the remitted compensatory damages award against the ACPD.\n\nFinally, I am very concerned that the majority's newly-minted harmless error analysis will invite further efforts by appellate Judges, in even more difficult cases, to divine what a jury may have been thinking when it rendered a general verdict. Although the majority emphasizes that their decision to employ a harmless-error doctrine is founded upon the \"extreme\" facts of this case, Maj. Op. at 41, that is simply to say that we will only affirm a tainted general verdict in the future where we believe that the jury has reached an obviously correct result. Because I believe that we have no role in speculating how a jury might have viewed the evidence presented at trial, and that such attempts at judicial telepathy are unwise and contrary to our precedents, I respectfully Dissent from the majority's decision to affirm the judgment against the ACPD.\n\nII. Individual Liability Under the New Jersey Law Against Discrimination\n\nA.\n\nIn ordering a new trial for defendants Rifice and Madamba, the majority has concluded that the only basis for individual liability under the LAD is § 10:5-12(e), which prohibits any person from aiding and abetting an act prohibited by the LAD. In reaching this Conclusion, the majority has predicted that the New Jersey Supreme Court would not recognize a cause of action against an individual supervisor under § 10:5-12(a), which makes it unlawful for any \"employer\" to discriminate on the basis of, among other things, sex. Maj. Op. at 45-46. The majority believes that interpreting § 10:5-12(a) to provide for individual liability of supervisors would not substantially further the purposes of anti-discrimination law and would be inconsistent with the prevailing interpretation of Title VII, which does not give rise to individual liability. See Sheridan v. E.I. DuPont de Nemours \u0026 Co., 100 F.3d 1061, 1077-787 (3d Cir. 1996). Because I find these reasons unconvincing in light of the many New Jersey state court cases which strongly suggest that New Jersey law recognizes a cause of action against individual supervisors for their own acts of discrimination, I Dissent from the majority's holding to the contrary.\n\nAt the outset, it is worth noting that, viewed purely as a matter of statutory construction, there is a more than credible argument that the term \"employer,\" as used in N.J.S.A. § 10:5-12(a), was intended to encompass individual supervisors. The governing definition of \"employer\" under the LAD is found at N.J.S.A. § 10:5-5(e) and provides as follows:\n\n\" `Employer' includes all persons as defined in subsection a. of this section unless otherwise specifically exempt under another section of this act, and includes the State, any political or civil subdivision thereof, and all public officers, agencies, boards or bodies.\"\n\nSubsection (a) of § 10:5-5, in turn, states:\n\n\"`Person' includes one or more individuals, partnerships, associations, organizations, labor organizations, corporations, legal representatives, trustees, trustees in bankruptcy, receivers, and fiduciaries.\"\n\nBased on these definitions, which indirectly define an \"employer\" as \"one or more individuals,\" it is reasonable to conclude, as plaintiff urges, that the New Jersey legislature intended to include individuals acting on behalf of their employer (i.e., supervisors) within the coverage of the statute. This is particularly so given the legislature's instruction that the LAD is to be \"liberally construed,\" N.J.S.A. § 10:5-3, and the New Jersey Supreme Court's repeated recognition that \"the goal of the LAD[is] `nothing less than the eradication of the cancer of discrimination.' \" See Taylor v. Metzger, 706 A.2d 685, 693 (N.J. 1998) (quoting Hernandez v. Region Nine Hous. Corp., 684 A.2d 1385 (N.J. 1996)) (additional citations omitted). Indeed, in this case, plaintiff has an especially compelling argument that defendants Rifice and Madamba ought to be subject to liability under § 10:5-12(a) because \"public officers\" are specifically included in the § 10:5-5(e) definition of \"employer.\" Although \"public officers\" is not defined in the LAD, it is difficult to conceive of a definition of that term that does not encompass a police inspector and a police captain, which are, respectively, the second and third highest ranking positions in the Atlantic City Police Department.\n\nAll of this is to say that, even if we did not have the benefit of New Jersey state court decisions and were completely left to our own devices, the question of whether Rifice and Madamba could be liable under LAD § 10:5-12(a) is, as the majority acknowledges, a close one. Maj. Op. at 45-46. But see Tyson v. Cigna Corp., 918 F. Supp. 836, 839 (D.N.J. 1996) (holding that § 10-5:12(a) does not provide for individual liability because it \"does not include any of the phrases that so clearly provide a basis for individual liability under other subparts\" of LAD). In matters involving state law, however, our role is not to interpret a statute as we deem it appropriate; instead, we must apply the law in a manner that is consistent with the interpretation given to it by the state's highest court. Where, as here, the New Jersey Supreme Court has not explicitly addressed the issue, we must \"forecast the position\" of that court. Clark v. Modern Group Ltd., 9 F.3d 321, 326 (3d Cir. 1993). In doing so, we should consider, inter alia, decisions of the New Jersey intermediate appellate courts as well as\"[t]he `carefully considered statement[s]' of the Supreme Court in dicta.\" Travelers Indem. Co. of Illinois v. DiBartolo, 131 F.3d 343, 348 (3rd Cir. 1997) (quoting McKenna v. Ortho Pharm. Corp., 622 F.2d 657, 662 n. 21 (3d Cir. 1980)).\n\nThere have been at least four decisions of the New Jersey Supreme Court in which individual supervisors were sued under the LAD for their own discriminatory acts. See Taylor v. Metzger, 706 A.2d 685 (N.J. 1998); Payton v. New Jersey Turnpike Authority, 691 A.2d 321 (N.J. 1997) (employee brought LAD action against her employer and two of her supervisors for sexual harassment); Montells v. Haynes, 627 A.2d 654 (N.J. 1993) (employee brought suit against employer, supervisor, and others asserting claims for personal injuries and sexual harassment under the LAD); Lehman v. Toys `R' Us, Inc., 626 A.2d 445 (N.J. 1993) (former employee brought action against employer, supervisor, and personnel director, alleging hostile work environment sexual harassment in violation of the LAD). Most recently, in Taylor, 706 A.2d 685, the Supreme Court permitted plaintiff, a county sheriff's officer, to sue the county sheriff, her supervisor, for creating a racially hostile work environment based on the sheriff's use of the term \"jungle bunny\" to describe plaintiff. The central legal issue addressed in Taylor was whether the utterance of a single derogatory racial comment by a supervisor could support a hostile work environment claim under the LAD, but implicit in the decision is the proposition that a supervisor is liable for his or her own discriminatory behavior. This follows from the court's observation that: \"[a] supervisor has a unique role in shaping the work environment. Part of a supervisor's duty is to prevent, avoid, and rectify invidious harassment in the workplace.\" Id. at 691. Although the majority relies on Taylor for its Conclusion that a supervisor can be liable as an aider and abettor of discrimination under LAD § 10:5-12(e), nowhere in the Taylor opinion does the court characterize the defendant as an aider and abettor or suggest that any other individual or entity is principally liable. Given this omission, the more reasonable inference to draw from Taylor, as well as the other cases in which supervisors were sued in their individual capacities under the LAD, is that the Supreme Court has endorsed the concept of supervisory liability under LAD § 10:5-12(a).\n\nThe decisions of the Appellate Division support an identical Conclusion. Muench v. Township of Haddon, 605 A.2d 242 (App. Div. 1992), is particularly instructive. In that case, plaintiff alleged that while working as a probationary dispatcher with the Haddon Township Police Department, she was subjected to a hostile work environment by Joseph Tortoreto, a police officer who had been assigned to train her. Despite plaintiff's complaints to Chief of Police Robert Saunders and Tortoreto's supervisor, Sergeant Walter Aaron, the harassment continued until plaintiff was forced to resign. Plaintiff then brought suit under the LAD against Haddon Township, the Haddon Police Department, Chief Saunders, Sergeant Aaron, and Tortoreto. While the main legal issue in the case was whether plaintiff could maintain a hostile work environment claim in the absence of overt sexual conduct, the court's opinion, which cites, quotes, and discusses § 10:5-12(a), id. at 246, but not the aiding and abetting provision of§ 10:5-12(e), makes plain that supervisors are individually liable under the LAD. As the court stated:\n\n\"[T]here is no question that `management-level employees,' Chief Saunders and Sergeant Aaron, had been told by plaintiff of Tortoreto's conduct during plaintiff 's probationary period, and that no corrective steps were taken. Indeed, the trial court found that plaintiff complained to the chief `on two occasions' and the chief did nothing about it. Since the evidence established that supervisory personnel were on notice of the alleged harassment and failed to take corrective steps, defendants, including Haddon Township, are subject to liability under the LAD.\" Id. at 249.\n\nOther decisions of the Appellate Division likewise support the notion of individual supervisory liability under LAD § 10:5-12(a). See Maiorino v. Schering-Plough Corp., 695 A.2d 353 (App. Div. 1997) (affirming judgment of compensatory damages in LAD action against plaintiff's former employer and supervisors); Herbert v. Haytaian, 678 A.2d 1183 (App. Div. 1996) (state employee brought LAD claim for sexual harassment against the State of New Jersey and former speaker of the General Assembly); Wilson v. Parisi, 633 A.2d 113 (App. Div. 1993) (reversing grant of summary judgment to defendants in LAD sexual harassment claim brought by high school teacher against high school principal and board of education).\n\nIn sum, the above cases provide more than ample evidence that, under LAD § 10:5-12(a), a supervisor may be individually liable for his or her own discriminatory acts. I would therefore hold that on remand, defendants Rifice and Madamba are subject to individual liability under LAD § 10:5-12(a), as well as the aiding and abetting provision of LAD § 10:5-12(e). While I do not reject the possibility that the New Jersey Supreme Court, when squarely presented with this issue in a future case, could decide otherwise, I am convinced that, given our obligation to be sensitive to the doctrinal trends of the state courts in the application of state law, the majority has erred in its prediction on this subject. I therefore Dissent.\n\nB.\n\nFinally, I do not agree with the majority's decision to affirm the District Court's grant of summary judgment to defendant Mooney. LAD § 10:5-12(e) provides that it is unlawful \"for any person, whether an employer and employee or not, to aid, abet, incite, compel or coerce the doing of any of the acts forbidden under this act, or attempt to do so.\" This provision could not be more clear in creating liability for any person who aids and abets a violation of the act, whether the individual is a supervisor, a nonsupervisory employee, or even an individual who is not an employee of the entity that is principally liable for discrimination.\n\nDespite the broad scope of the statute, the majority takes the position that a nonsupervisory employee cannot be liable as an aider and abettor for his own affirmative acts of harassment because \"such affirmative acts do not substantially assist the employer in its wrong, which is its failure to prevent and redress harassment by individual employees.\" Maj. Op. at 53 (emphasis in original). This statement is correct as far as it goes, but it overlooks the fact that in many sexual harassment cases, including this one, the employer's wrong is not only its failure to prevent and redress harassment by individual employees. An employer also commits a wrong when its supervisors, whose conduct is generally attributable to an employer because of their position in the organization, engage in harassing behavior. See Ellerth, 118 S. Ct. at 2270; Faragher v. City of Boca Raton, 118 S. Ct. 2275, 2292 (1998). It follows then that anyone who aids and abets harassment perpetrated by a supervisor that is attributable to an employer can themselves be liable under LAD § 10:5-12(e).\n\nAccordingly, while I agree with the majority that, as a nonsupervisory employee, Mooney cannot be said to have aided and abetted the ACPD in failing to respond to his own acts of sexual harassment, that lone observation does not settle the question of Mooney's liability. Contrary to the majority's view, the ACPD is not liable to plaintiff solely for its failure to prevent and remedy a hostile work environment; a reasonable jury could also find that the ACPD is liable to plaintiff on her hostile work environment claim based on Captain Madamba's affirmatively harassing actions, which, given his high rank, are attributable to the ACPD. To the extent then that Mooney aided and abetted Madamba in creating a hostile work environment, Mooney should be subject to liability under LAD § 10:5-12(e). Under our decision in Failla v. City of Passaic, 146 F.3d 149 (3d Cir. 1998), the relevant inquiry is whether Mooney \"knowingly [gave] substantial assistance or encouragement\" to Madamba's alleged discriminatory actions. Id. at 158. In my view, the evidence in the record is sufficient to support such a finding. For example, plaintiff testified that Mooney, in Madamba's presence, remarked that he had heard that Hurley \"liked them hard and stiff.\" On another occasion, when plaintiff complained to Madamba that someone had stolen her coffee cup, Mooney asked plaintiff whether she wanted to drink out of his jock cup. App. at A2514. Madamba apparently did not rebuke Mooney at all for this behavior. Viewing this evidence in a light most favorable to plaintiff, a reasonable jury could find that Mooney gave substantial assistance or encouragement to Madamba's unlawful acts of harassment. The District Court's grant of summary judgment to Mooney should therefore be reversed.\n\nIII.\n\nFor the reasons stated above, I would vacate the judgment against the ACPD and remand for a new trial. In addition, while I agree that the case should be retried with respect to defendants Rifice and Madamba, on retrial, I would permit plaintiff to proceed against them under N.J.S.A. § 10:5-12(a) as well as N.J.S.A.§ 10:5-12(e). I would also reverse the grant of summary judgment in favor of defendant Mooney. I respectfully Dissent.\n\nA True Copy: Teste:\n\nClerk of the United States Court of Appeals for the Third Circuit\n\n\u003cspan class=\"fn\"\u003e1.. The district court had jurisdiction over this case pursuant to 28 U.S.C. §§ 1331, 1343, and 1367. We have jurisdiction over this appeal pursuant to 28 U.S.C. § 1291.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2.. The facts recited were all adduced at trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3.. In addition to the harassment, Hurley testified that, prior to January of 1987, she was given \"lowly positions that offered no useful experience or potential for advancement.\" Hurley v. Atlantic City Police Dep't, 933 F. Supp. 396, 405 (D.N.J. 1996). For example, she testified that she was assigned to the Records Bureau to perform menial copying tasks. See App. at 2420. She also testified that she was assigned to security desk duty, which consisted of signing civilians in and out of the department building, and fire watch, which consisted of watching one particular building for an outbreak of fire. Hurley did not, however, include a failure to train or promote claim in her complaint.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4.. \"Keying out\" or \"clicking out\" consists of depressing the \"On\" and \"Off \" buttons of a radio transmitter to block the communications of the officer who is using the airway.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5.. Hurley was compelled to attend roll call in front of a life-size drawing of herself performing oral sex as her supervisor, Madamba, sat eight feet away. In addition, the following graffiti appeared on a wall in the roll call bathroom, which was commonly used and open to the public: Oh sweet Donna Hurley With cunt hair so curley Your blond hair seems so soft and stays in place When I toss off my cookies in your face I'd like to stick my cock in your ass But when I think of Lt. Andros my cock gets soft fast So keep up your spirits and don't get depressed Cause even though your a cunt I'd like to press yourflesh Though in uniform your rude and brass Your just another sex machine with my cock in your ass Next to this was a graphic drawing of a naked women labeled \"Donna Hurley\" and bearing sergeant's stripes. Near the drawing, and apparently written by several different hands, were the scrawled phrases \"just another fuck doll,\" \"she should look this good.\" and \"Lt. Andros was here.\" Lieutenant Andros was a co-worker with whom Hurley was rumored to have had an affair.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6.. Although Hurley and Mooney shared the same rank at that time, she alleges that Mooney had obtained power far beyond that which would otherwise be expected to be held by a mere sergeant. As a result of his years of acting as the former chief's aid and confidant, the political prominence of his councilman father, the high position of his brother-in-law, Inspector Polk, who is married to Mooney's sister, Captain Michelle Polk, and the widespread perception in the department that Mooney was destined to become the Chief, Mooney was in a position to abuse his real authority without fear of consequences. Appellee's Br. at 37.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7.. We note that the Hurleys' retaliation claims, arising from the ACPD's acts after this lawsuit was filed, are not part of this appeal.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8.. In its August 4, 1995 opinion and order, the district court concluded that the claims that formed the basis of plaintiff's sexual discrimination allegations began in late 1989 or early 1990, upon plaintiff's transfer to Charlie Platoon. App. at 5752. However, at the beginning of trial, the court expanded the time frame from which plaintiff could assert claims of sexual discrimination to January 20, 1987, based upon the court's Conclusion that such claims would have been within the six-year statute of limitations that the court found applicable to claims under the LAD. In Montells v. Haynes, 627 A.2d 654, 659 (N.J. 1993), the New Jersey Supreme Court adopted a two-year statute of limitations for claims under the LAD. However, the Montells court also held that its decision did not apply to cases pending at that time or to cases in which the operative facts arose before the date of the court's decision, see id. at 662, circumstances present here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9.. The parties have not argued that we need apply New Jersey procedure to the New Jersey claims, and we will apply the federal rules to both. See Purgess v. Sharrock, 33 F.3d 134, 139-40 (2d Cir. 1994); cf. Wm. T. Thompson Co. v. General Nutrition Corp., Inc., 671 F.2d 100, 104 (3d Cir. 1982) (holding that the federal rule favoring admissibility of relevant evidence applies to state law claims in federal cases to which state law privileges might otherwise apply); Salas by Salas v. Wang, 846 F.2d 897, 905-06 (3d Cir. 1988) (discussing the standard for applying state evidentiary rules in pure diversity cases). Nor is there any indication that New Jersey admissibility rules differ in any relevant respect, as we think New Jersey's law recognizes the same principles we discuss in text. See Rendine v. Pantzer, 648 A.2d 223, 237-38 (N.J. Super. Ct. App. Div. 1994) (discussing the admissibility of evidence of discrimination against other people to prove motive or intent under N.J.R.E. 404(b)), aff'd in relevant part, 661 A.2d 1202, 1213 (N.J. 1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10.. We have held that a trial Judge is given very substantial discretion when striking a Rule 403 balance, see United States v. Eufrasio, 935 F.2d 553, 572 (3d Cir. 1991), and that \"a trial Judge's decision to admit or exclude evidence under Fed. R. Evid. 403 may not be reversed unless it is arbitrary and irrational.\" Bhaya v. Westinghouse Elec. Corp., 922 F.2d 184, 187 (3d Cir. 1990) (quotation marks omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11.. We note that, but for these precepts, clever discriminators might isolate each instance of discrimination and make it seem trivial or neutral. See Glass, 45 F.3d at 195; see also Aman v. Cort Furniture Rental Corp., 85 F.3d 1074, 1082 (3d Cir. 1996) (evidence of time-barred harassment and discrimination against others in the plaintiff's class was relevant); Vance v. Southern Bell Tel. \u0026 Tel. Co., 863 F.2d 1503, 1511 (11th Cir. 1989) (acts directed at others can be evidence of discrimination against the plaintiff). We also note apposite New Jersey precedent that a plaintiff may present evidence about the harassment of other women to establish employer liability. See Lehmann v. Toys `R' Us, Inc., 626 A.2d 445, 462 (N.J. 1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12.. We also note that the alleged vagueness in the testimony, which the ACPD emphasizes, is limited to the testimony about general conditions in the ACPD and not to the many specific incidents to which the witnesses testified. This \"vagueness\" stems from the fact that male officers' misconduct was apparently so common as to blend into the background except when something particularly egregious occurred. The extent to which witnesses' inability to identify dates and places affected the witnesses' credibility could be, and was, addressed on cross-examination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13.. Section 104[2][b] of the ABA Model Charge provides the following list of factors that must be considered in hostile work environment claims: (1) the total physical environment of the plaintiff's work area; (2) the degree and type of obscenity that filled the environment of the workplace, both before and after the plaintiff arrived; (3) the reasonable expectations of the plaintiff upon entering the environment; (4) the nature of the unwelcome sexual acts or words; (5) the frequency of the offensive encounters; (6) the severity of the conduct; (7) the context in which the sexual harassment occurred; (8) whether the conduct was unwelcome; (9) the effect on the plaintiff's psychological well-being; (10) whether the conduct was physically threatening; (11) whether it was merely an offensive utterance; (12) whether it unreasonably interfered with the plaintiff's work performance. ABA Model Charge § 104[2][b] (1994).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14.. In Taylor, the plaintiff presented evidence that her chief ranking supervisor called her a \"jungle bunny\" in the presence of another supervising officer. The court concluded that these circumstances \"were sufficient to establish the severity of the harassment and alter the conditions of plaintiff's work environment.\" Id. at 693. Severity is measured by surrounding circumstances, see id. at 692, and \" `[t]he required showing of severity or seriousness of the harassing conduct varies inversely with the pervasiveness or frequency of the conduct.' \" Lehmann, 626 A.2d at 455 (quoting Ellison, 924 F.2d at 878).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15.. Because certain factors may or may not be relevant in any given case, our Conclusion is necessarily limited to the facts of this case. Moreover, we do not suggest that the New Jersey Supreme Court would only look to the ABA Model Charge and Title VII caselaw when fashioning a set of factors to guide the jury in its deliberations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16.. Because we conclude that the ACPD remains liable under the LAD, we need not consider whether the district court's charge misstated the law under Title VII.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17.. See also Distasio v. Perkin Elmer Corp., 157 F.3d 55 (2d Cir. 1998) (holding that, if a direct supervisor who had the responsibility to stop harassment knew of and failed to act against it, the plaintiff has no further obligation to bring it to the employer's attention); Young v. Bayer Corp., 123 F.3d 672, 675 (7th Cir. 1997) (finding it sufficient for a plaintiff to give notice to someone who should reasonably be expected to stop the harassment or refer the complaint up the chain of command to someone who can stop it).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18.. The Ellerth/Faragher defense applies only to harassment occurring outside the scope of employment. See Ellerth, 118 S. Ct. at 2267. For harassment to fall within the scope of employment, the harasser must be furthering the employer's purposes or acting in what he believes to be his employer's interests. See id. at 2266. The Court did not discuss how such motivations were to be determined, and we need not today address whether a patently ineffective harassment policy might communicate to male employees that harassment was an acceptable, expected means to interact with female officers. Rather, if the jury decided that the lack of an effective harassment policy justified holding the ACPD liable under a scope of employment theory, the same result would have been mandated under the Ellerth/Faragher standards for holding employers liable for negligence or for imposing vicarious liability when supervisory harassment creates a hostile work environment. The overlap between the standards was made clear by the instructions on negligence, which we describe infra in text. Thus, although this section of the instructions would no longer be appropriate to describe the scope of employment in a Title VII case, it did not mistakenly allow liability to be imposed in any circumstances in which an employer should properly be absolved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19.. We have no doubt that Madamba's suggestive remarks could be interpreted as a threat, and we do not mean to suggest that remarks of this sort cannot found a quid pro quo claim, though we agree with the Dissent that the evidence of retaliation for refusal to accede is gossamer. Nor need we predict how New Jersey will react to Faragher and Ellerth. The LAD is a remedial statute, in some respects broader and more flexible than Title VII. See Lehmann, 626 A.2d at 452; id. at 460 (holding employers strictly liable for equitable damages and relief). This is so even though New Jersey often looks to the federal system for interpretive authority. See id. at 452. We thus believe it quite possible that New Jersey might retain a quid pro quo cause of action as such even after Ellerth and Faragher. The District Court's instructions, as the Dissent notes, see Dissent at 66, are consistent with Lehmann. See Lehmann, 626 A.2d at 452; see also Pukowsky v. Caruso, 711 A.2d 398, 403 (N.J. Super. Ct. App. Div. 1998).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20.. Madamba's alleged conduct is the kind of conduct for which the ACPD could attempt to interpose its affirmative defense, but, as we have already held, that defense would fail because the ACPD's dereliction was even worse than that in Faragher, in which the Court declined to offer the defendants an opportunity to make out the defense on remand.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21.. See also Pressley v. Haeger, 977 F.2d 295, 298 (7th Cir. 1992) (applying harmless error analysis to faulty instructions that, given the evidence, were unlikely to have influenced the jury); Kern v. Levolor Lorentzen, Inc., 899 F.2d 772, 777 (9th Cir. 1990) (where the relevant facts were the same for all theories, the evidence and argument focused on a legally correct theory, and it was unlikely that the incorrect theory influenced the jury, a verdict could be upheld despite one erroneous instruction); Kassel v. Gannett Co., 875 F.2d 935, 950 (1st Cir. 1989) (invoking harmless error rule for faulty instructions but rejecting it on the merits because of the evidence and arguments at trial); Lusby v. T.G. \u0026 Y. Stores, Inc., 796 F.2d 1307, 1310 (10th Cir. 1986) (finding that an improper instruction, identical to one rejected by the Supreme Court because it did not contain all the necessary elements, did not mandate reversal because there was \"substantial evidence\" supporting the correct theory of liability, and holding harmless error analysis appropriate to jury instructions \"when the erroneous instruction could not have changed the result of the case\"); Square Liner 360, Inc. v. Chisum, 691 F.2d 362, 377 (8th Cir. 1982) (applying Baldwin with harmless error analysis); Horne v. Georgia S. \u0026 Fla. Ry. Co., 421 F.2d 975, 980 (5th Cir. 1970) (finding a charge, if erroneous, harmless because the underlying facts so firmly supported the verdict on a proper charge); Roginsky v. Richardson-Merrell, Inc., 378 F.2d 832, 837-38 (2d Cir. 1967) (applying similar reasoning when one theory was improperly submitted to the jury); 11 Wright et al., Federal Practice \u0026 Procedure § 2886, at 467-70 (\"Errors in instructions routinely are ignored if a motion for a directed verdict should have been granted, or if the erroneous instruction went to an issue that is immaterial in light of the jury's verdict, or if it is otherwise apparent that the error could not have changed the result.\" (footnotes omitted)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22.. See Brokerage Concepts, Inc. v. U.S. Healthcare, Inc., 140 F.3d 494, 534 (3d Cir. 1998) (portion of instructions invited the jury to use impermissible factors, and, given the focus of the trial evidence, \"such infection almost certainly occurred\"); Wilburn v. Maritrans GP Inc., 139 F.3d 350, 361 (3d Cir. 1998) (jury could have based liability on incidents of alleged negligence for which the standard of care was beyond common knowledge, and there was no expert testimony to guide them as to those incidents); Avins v. White, 627 F.2d 637, 646 (3d Cir. 1980) (reversing a judgment based on the \"distinct possibility\" that the jury imposed liability based on incidents of defamation that should not have been submitted to the jury); cf. McKenna v. Pacific Rail Serv., 32 F.3d 820, 831-32 (3d Cir. 1994) (reversing judgment when an erroneous portion of the jury instructions \"more than likely\" guided the jury's deliberations). Carden v. Westinghouse Electric Corp., 850 F.2d 996 (3d Cir. 1988), on which the Dissent relies, concerned a situation in which the verdict could have been based on erroneously admitted \"direct\" evidence of discrimination; here, the instructions did not require the jury to look at evidence it should not have considered. Indeed, even Simko v. C \u0026 C Marine Maintenance Co., 594 F.2d 960 (3d Cir. 1979), while setting forth the general rule that errors in instruction require reversal, also cited with approval Morrissey v. National Maritime Union, 544 F.2d 19, 26-27 (2d Cir. 1976), describing its holding as follows: \"[T]he general rule . . . must be followed unless it can be stated with confidence that the same verdict would have been returned even if the invalid claim had not been submitted to the jury.\" Simko, 594 F.2d at 967.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23.. The ACPD raises two other arguments concerning the punitive damage award, but they need not detain us long. First, the ACPD argues that plaintiff's punitive damage award must be vacated as a matter of law because \"both public policy and the most reasonable interpretation of the statutes [i.e., the Tort Claims Act and the LAD] support the Conclusion that punitive damages should not be available against a public entity under the [LAD].\" ACPD's Br. at 20. However, we explicitly rejected this argument in Gares v. Willingboro Township, 90 F.3d 720 (3d Cir. 1996), and we are unaware of any developments that call this decision into question. Second, the ACPD contends that the punitive damage award must be vacated because the jury acted inconsistently when it imposed punitive damage liability on the ACPD but not on Madamba, the principal upper manager who was involved. This argument is also without merit. Punitive damages are awarded to deter and punish, and the jury could easily have concluded that the ACPD should pay punitive damages because both its potential for harm and its responsibility for the widespread harassment were far greater than Madamba's alone. Contrary to the ACPD's portrait of the facts, the testimony indicated that Madamba was far from a lone bad apple poisoning the ACPD. Moreover, the district court properly instructed the jury that an award of punitive damages was purely discretionary. We need not inquire further about why the jury chose to exercise its discretion in this manner.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24.. On remand, the district court must determine whether Madamba was part of upper management. The ACPD claims that Madamba was a captain, along with numerous others with that rank. Although Madamba clearly was a supervisor of the personnel under his command, the ACPD contends that he did not establish policy and was not at the top tier of the department so as to be part of upper management. If a factual dispute should arise, however, the issue would be reserved for the jury.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25.. Trends may change, however, and a panel looking at this issue a year from now might see New Jersey pursuing a different course on supervisory liability through section 10:5-5(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26.. Madamba particularly assails the availability of a quid pro quo instruction, which we discuss in greater detail supra Section II.E.2. The evidence to support Hurley's quid pro quo theory was a conversation she had with Madamba in which she complained about harassment and he responded that women in the private sector protect themselves from harassment by \"sleeping with\" their bosses and that women approached Madamba for sex \"when they're ready.\" After she made no response to these suggestive comments, he allegedly took further discriminatory action against her by transferring her to a less desirable position. However, as we suggested above, this is less a quid pro quo case than a hostile environment case, inter alia because it seems more plausible that the transfer, if retaliatory, was based on Hurley's memo alleging harassment and not on her rejection of Madamba's putative advances. At all events, as discussed below in Section IV.A.2, we conclude that a reasonable jury could impose aiding and abetting liability on Madamba for his substantial contribution to the hostile work environment; his putative advances could be evidence of aiding and abetting.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27.. To determine whether a defendant provided \"substantial assistance,\" the comments to section 876 of the Restatement provide a list of five factors: \"the nature of the act encouraged, the amount of assistance given by the defendant, his presence or absence at the time of the tort, his relation to the other and his state of mind.\" Restatement (Second) of Torts § 876(b) cmt. d. (1979). Additionally, the court in Halberstam provided a sixth factor, the duration of the assistance provided. See Halberstam, 705 F.2d at 484.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28.. Madamba additionally argues that the jury instructions were flawed because they covered aiding and abetting \"another person's unlawful acts\" and then, when the jury inquired further, the court stated that the defendant had to \"willfully and knowingly associate himself with the unlawful act.\" Madamba Letter at 8. He argues that this is erroneous because the instruction should have required association with the employer and not the act. This is a misreading of Failla, which rejected a shared intent requirement. Moreover, Madamba was associated with his employer as a matter of course. Finally, the New Jersey Appellate Division case of Baliko v. Stecker, 645 A.2d 1218 (N.J. Super. Ct. App. Div. 1994), undermines Madamba's position. Baliko held that aiding and abetting liability could exist when one union member aided other union members and the sum total of acts was sufficient to cause the union to be liable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29.. We review the district court's decision granting summary judgment de novo, and we apply the same test the district court should have applied in the first instance. See Olson v. General Elec. Astrospace, 101 F.3d 947, 951 (3d Cir. 1996); Helen L. v. DiDario, 46 F.3d 325, 329 (3d Cir. 1995). We must determine, therefore, whether the record, when viewed in the light most favorable to Hurley, shows that there is no genuine issue of material fact and that Mooney was entitled to summary judgment as a matter of law. See, e.g., Celotex Corp. v. Catrett, 477 U.S. 317, 322-23 (1986); Anderson v. Liberty Lobby, Inc., 477 U.S. 242, 249-50 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30.. The Act provides that an employer \"includes all persons as defined in subsection a. of this section unless otherwise specifically exempt under another section of this act, and includes the State, any political or civil subdivision thereof, and all public officers, agencies, boards or bodies.\" N.J. Stat. Ann. § 10:5-5(e). Subsection (a) provides that the term \"[p]erson includes one or more individuals, partnerships, associations, organizations, labor organizations, corporations, legal representatives, trustees, trustees in bankruptcy, receivers, and fiduciaries.\" N.J. Stat. Ann. § 10:5-5(a).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31.. The Dissent argues that the employer's wrong can also consist of the wrongs of its supervisors who commit willful harassment. This is a thorny question of agency law; usually, the employer is said to be vicariously liable for certain acts of its agents, as in Ellerth and Faragher, and directly liable for its own negligence, if any, in allowing its agents to behave badly. Query whether vicarious liability means that a person who aids and abets an agent also aids and abets the principal? We need not resolve this nice question, however, because the Dissent's argument presupposes that Madamba can be held individually liable as a harasser under N.J.S.A. § 10:5-5(a), a proposition we have already predicted that New Jersey courts would reject. Moreover, if the claim were that Mooney substantially assisted Madamba's harassment, no reasonable jury could find that Mooney's conduct rose to the level of substantial assistance based only on the two incidents recited by the Dissent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32.. Mooney claims that a nonsupervisor cannot aid and abet because only supervisors can create liability for an employer. As cases imposing liability for co-worker harassment demonstrate, that statement of the law is erroneous. We also note that, under the LAD, \"any person\" may aid and abet; no ability to bind the employer is necessary. New Jersey may ultimately decide, contrary to our prediction, that harassment by a nonsupervisory employee can constitute aiding and abetting, in which case we would of course follow its interpretation of state law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33.. We note that the claims against the individual defendants are largely symbolic. Hurley's monetary recovery will come from the ACPD, and in practical terms the liability of the individual defendants is not that significant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34.. Although \"[t]he New Jersey approach to the issue of contingency enhancement under the LAD is a marked departure from the Supreme Court's interpretation and application of federal fee-shifting statutes,\" Coleman, 87 F.3d at 1511 (citing Rendine v. Pantzer, 661 A.2d 1202 (N.J. 1995)), the New Jersey Supreme Court's approach to reviewing the calculation of hourly rates under the LAD is generally similar to the approach taken by this court when reviewing the calculation of hourly rates under federal fee-shifting statutes. See Rendine, 661 A.2d at 1227 (citing Rode v. Dellarciprete, 892 F.2d 1177, 1183 (3d Cir. 1990)). Accordingly, we will review the district court's hourly-rate calculation in light of federal precedent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35.. The district court explicitly provided that the parties could have a hearing on the attorney's fee issue if they requested one, see Hurley, 933 F. Supp. at 429 n.31, but the record does not reveal that any such hearing ever occurred. Moreover, plaintiff's counsel has not argued for a hearing on appeal. Instead, he continues to argue that he is entitled to his proposed hourly rate of $300 because defendants have not submitted appropriate record evidence to challenge this rate. This amounts to a waiver. See Williams v. Butler, 802 F.2d 296, 301 (8th Cir. 1986) (en banc), vacated on other grounds sub nom. City of Little Rock v. Williams, 485 U.S. 931 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36.. Citing the fact that the LAD is \"in some respects broader and more flexible than Title VII,\" the majority suggests that the New Jersey Supreme Court may reject Ellerth and Faragher v. City of Boca Raton, 118 S. Ct. 2275 (1998), and adhere to the view that the loss of a tangible employment benefit is not an essential element of a quid pro quo claim under the LAD. Maj. Op. at n.19. I wholeheartedly agree with the majority that the LAD is a remedial statute that should be liberally construed, but presented with no evidence that the New Jersey Supreme Court would reject two widely-heralded and watershed opinions of the United States Supreme Court, I believe the wiser course is to assume that the New Jersey Supreme Court will follow Ellerth and Faragher. Ironically, the majority abandons its expansive view of the LAD when it comes to predicting whether New Jersey law recognizes a cause of action against individual supervisors for their own acts of discrimination, even in the face of substantial evidence that New Jersey courts already recognize such a claim. See Infra Section II.A.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37.. The District Court suggested that there was sufficient evidence to support plaintiff 's quid pro quo claim because plaintiff 's refusal to submit to Madamba's advances arguably resulted in the loss of the \"tangible job benefit of being free from harassment.\" Hurley v. Atlantic City Police Dep't, 933 F. Supp. 396, 408 (D.N.J. 1996). This is a misapprehension of the concept of a tangible employment action, as Ellerth makes clear. \"A tangible employment action constitutes a significant change in employment status, such as hiring, firing, failing to promote, reassignment with significantly different responsibilities, or a decision causing a significant change in benefits.\" Ellerth, 118 S. Ct. at 2268. \"Being free from harassment\" does not equate to any of these categories.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38.. Plaintiff argued to the District Court that the \"transfer was in retaliation for complaints of harassment.\" App. at A5428 (plaintiff's statement of contested facts). Likewise, plaintiff has argued to this court that the transfer resulted from her \"complain[ts] of sexual harassment.\" Hurley Letter, July 20, 1998 at 2.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39.. The single Third Circuit decision cited by the majority in support of its position is inapposite. In Murray v. United of Omaha Life Ins. Co., 145 F.3d 143 (3d Cir. 1998), our prediction of New Jersey law rendered the district court's jury charge erroneous, but we concluded that the jury verdict should nonetheless be affirmed because\"the findings necessarily implied by the jury's verdict under the incorrect instructions make clear that the jury would have reached the same Conclusion under the correct instructions . . ..\" Id. at 145-46. Here, in contrast, there is nothing in the jury's general verdict that would support the notion that they would have reached the same result had the matter been submitted without the faulty quid pro quo claim. In addition, Murray was not a case involving a general verdict that may have been predicated on erroneous grounds, and it accordingly sheds no light on the issue presented herein. I recognize that on rare occasion, some of our sister circuits, utilizing a harmless error analysis, have affirmed general verdicts that were tainted by defective claims. See Kern v. Levolor Lorentzen, Inc. 899 F.2d 772 (9th Cir. 1990); Traver v. Meshriy, 627 F.2d 934 (9th Cir. 1980); Collum v. Butler, 421 F.2d 1257 (7th Cir. 1970); American Airlines, Inc. v. United States, 418 F.2d 180 (5th Cir. 1969). Most of the circuits, however, have strictly adhered to the general rule announced in Baldwin. See Kern, 899 F.2d at 790 (Kozinski, J., Dissenting) (citing cases). In particular, I note that Asbill v. Housing Authority of Choctaw Nation of Oklahoma, 726 F.2d 1499 (10th Cir. 1984), relied on by the majority for the allegedly \"long [ ]acknowledged\" proposition that Baldwin does not preclude the possibility of harmless error review, no longer represents the prevailing view of the Tenth Circuit. See Anixter v. Home-Stake Production Co., 77 F.3d 1215, 1229 (10th Cir. 1996) (\"Although in the past we allowed jury verdicts to stand if the improper instruction was harmless . . . more recently we have adhered strictly to the general rule and have remanded cases where we could not say`with absolute certainty' that the jury was not influenced by the submission of improper and erroneous instruction.\") (citations omitted); Farrell v. Klein Tools, Inc., 866 F.2d 1294, 1299-1301 (10th Cir. 1989) (acknowledging harmless error Discussion in Asbill, but concluding that more recent cases left \"no room for harmless error analysis,\" even though it was \"very unlikely\" that the erroneous jury instruction prejudiced defendant's \"substantial rights\"). In light of these cases, as well as the Supreme Court and Third Circuit precedents discussed in the text, I believe the majority's reliance on the sporadic harmless error cases from other circuits to be misplaced.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40.. Even assuming that the jury did not find the ACPD and Madamba liable solely on the defective quid pro quo claim, its submission could have effected the jury's deliberations in less obvious ways. For example, the jurors may have been inclined to award more compensatory damages because they wrongly believed that the defendants had committed multiple forms of sexual harassment against plaintiff. The fact that the District Court felt compelled to remit the compensatory damages award from $575,000 to $175,000 is some indication that this may have occurred.\u003c/span\u003e\n\n",
    "body_length": 162305,
    "citedas": [
      "174 F.3d 95",
      "79 Fair Empl.Prac.Cas. (BNA) 808"
    ],
    "attorneys": "Clifford L. Van Syoc, Esq. (Argued) Van Syoc Law Offices 200 Lake Drive East, Suite 110 Woodland Falls Park Cherry Hill, New Jersey 08002 Counsel for Plaintiffs-Appellees/Cross-Appellants Dennis M. Tuohy, Esq. (Argued) Tuohy \u0026 Tuohy 20 South Tennessee Avenue Atlantic City, New Jersey 08401 Counsel for Defendant-Appellant/Cross-Appellee, Atlantic City Police Department Mark Falk, Esq. (Argued) Barry \u0026 McMoran One Newark Center, 18th Floor Newark, New Jersey 07102 Counsel for Defendant-Appellant/Cross-Appellee, Henry Madamba Richard L. Goldstein, Esq. (Argued) Marshall, Dennehey, Warner, Coleman \u0026 Goggin Three Greentree Center, Suite 304 Marlton, New Jersey 08053-3405 Counsel for Defendant/Cross-Appellee, Nicholas V. Rifice Thomas F. Bradley, Esq. (Argued) Hankin, Sandson \u0026 Sandman 30 South New York Avenue Atlantic City, New Jersey 08401 Counsel for Defendant/Cross-Appellee, John J. Mooney",
    "category": [
      "128",
      "36"
    ],
    "judges": "Before: Becker, Chief Judge, Scirica and Cowen, Circuit Judges",
    "citation_count": 364
  }
}
