{
  "id": "CLTnTGYBTlTomsSBNC-y",
  "document": {
    "title": "08/07/87 JACK SMITH v. STATE MICHIGAN",
    "full_title": "JACK SMITH v. STATE OF MICHIGAN, DEPARTMENT OF PUBLIC HEALTH, ET AL ; RAY EUGENE WILL CROSS-APPELLANT, V. DEPARTMENT OF CIVIL SERVICE, ET AL AND DEPARTMENT OF STATE POLICE, ET AL CROSS-APPELLEES",
    "jurisdiction": "Michigan Supreme Court",
    "date": "1987-08-07T00:00:00.000Z",
    "docket": "Docket Nos. 71016, 76838",
    "body": "Memorandum Opinion.\n\nThese consolidated cases require us to decide the following questions: (1) whether the state is a \"person\" for purposes of a damage suit under 42 USC 1983; (2) whether a state official, sued in an official capacity, is a \"person\" for purposes of a damage suit under 42 USC 1983; (3) whether there is an \"intentional tort\" exception to governmental immunity; and (4) whether a plaintiff may sue the state for damages for violations of the Michigan Constitution.\n\nA majority of the Justices are of the opinion that:\n\n1) The state is not a \"person\" for purposes of a damage suit under § 1983.\n\n2) A state official, when sued in an official capacity, is not a \"person\" for purposes of a damage suit under § 1983.\n\n3) The allegation of false imprisonment in Smith does not avoid governmental immunity.\n\n4) There is no \"intentional tort\" exception to governmental immunity.\n\n5) Where it is alleged that the state, by virtue of custom or policy, has violated a right conferred by the Michigan Constitution, governmental immunity is not available in a state court action.\n\n6) A claim for damages against the state arising from violation by the state of the Michigan Constitution may be recognized in appropriate cases.\n\n7) In Will, the plaintiff failed to preserve for appeal any claim for damages for violations of the Michigan Constitution.\n\nIn Smith, we reverse those portions of the Court of Appeals judgment that reinstated the plaintiff's false imprisonment claim and affirmed the denial of summary judgment on the plaintiff's § 1983 claim. The defendants were entitled to summary judgment as to both claims. We affirm the Court of Appeals affirmance of the denial of summary judgment as to the plaintiff's Michigan constitutional claims, and direct the Court of Claims, on remand, to determine whether a violation of the Michigan Constitution by virtue of a governmental custom or policy has been alleged; whether such a violation occurred; and, if it occurred, whether it is one for which a damage remedy is proper.\n\nIn Will, we reverse that portion of the Court of Appeals judgment that remanded this case to the Court of Claims for further proceedings regarding the liability of the Director of State Police, and we remand to the Court of Claims for entry of judgment in favor of the defendant Director of State Police. In all other respects, we affirm the judgment of the Court of Appeals.\n\nThis memorandum opinion is signed by the six participating Justices. There are separate Concurring and Dissenting opinions. However, at least four Justices concur in every holding, statement, and Disposition of this memorandum opinion.\n\nBrickley, J.\n\nThese cases require that we decide whether the state and its officials, sued in their official capacities, are \"persons\" in a suit for damages under 42 USC 1983, whether an intentional tort is an exception to governmental immunity, and whether there is an implicit right to sue the state for damages for violations of the Michigan Constitution. We would find that the state and its officials, sued in their official capacities, are not persons under 42 USC 1983, that there is no intentional-tort exception under the governmental immunity act, and that there is no implicit right to sue the state for damages on the basis of violations of art 2, §§ 1 and 16 of the 1908 Michigan Constitution.\n\nI. FACTS\n\nA. WILL v DEP'T OF CIVIL SERVICE\n\nThe plaintiff had been in the employ of the State of Michigan since 1969 when the following facts occurred, as set forth by the Court of Appeals:\n\nIn the latter half of 1973, plaintiff sought opportunities to advance to data systems analyst 11, and one of these opportunities arose with the state police. Although plaintiff was ranked number two on the promotional register and the number one candidate withdrew, plaintiff was not hired by the state police that summer. He subsequently obtained a data systems analyst 11 position with the Highway Department in November, 1973.\n\nUnbeknownst to plaintiff, when the defendant department ran a security check on plaintiff, information about plaintiff's student activist brother, Charles, was released. Charles' file contained the notation, \"Subject's brother Ray Eugene DOB 2-27-44 made application for employment with MSP. Personnel advised 8-9-73.\" Plaintiff did not learn of this until 1977, when legislation providing for maintenance of the so-called \"red squad\" files, 1950 (Ex Sess) PA 38, 39, and 40, was declared unconstitutional and Charles obtained his file and showed it to his brother, plaintiff. [ Will v Dep't of Civil Service, 145 Mich App 214, 217-218; 377 NW2d 826 (1985).]\n\nUpon learning that information regarding his brother's political activities may have influenced the decision to not promote him, Will, in 1977, filed a grievance with the Civil Service Commission. It was denied as untimely. In January, 1978, in a three-count complaint, he commenced suit against various state defendants \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e in the Ingham Circuit Court. Count I alleged that the CSC's refusal to hear plaintiff's grievance denied him due process of law in violation of the United States and Michigan Constitutions; count II alleged various violations of the United States and Michigan Constitutions as grounds for asserting a claim pursuant to 42 USC 1983; and count III alleged that defendants' determination of plaintiff's qualification for promotion, on the basis of his brother's political activities rather than on merit, \"denied Plaintiff's right to due process of law and rights created under Const 1963, Art XI, Section 5,\" entitling him to damages. The state defendants did not answer plaintiff's complaint, but instead moved to remand the case to the CSC for a grievance hearing. In June of 1978, the motion was granted. The court retained jurisdiction to review any appeal from the decision of the CSC.\n\nIn November, 1978, while awaiting action on his grievance before the CSC, plaintiff filed suit in the Michigan Court of Claims. His complaint consisted of two counts, essentially identical to counts II (§ 1983 claim) and III (Michigan constitutional claim) of his circuit court complaint. In response, state defendants on December 5, 1978, moved for summary judgment on count I (§ 1983 claim) and accelerated judgment on count II (Michigan constitutional claim) of plaintiff's Court of Claims complaint. On May 7, 1979, the Court of Claims granted the state defendants' motion for accelerated judgment on count II because of the pending administrative proceedings, but denied defendants' motion for summary judgment on plaintiff's § 1983 claim \" there a question of fact.\" The Court of Claims also granted plaintiff's motion to consolidate the Court of Claims and circuit court cases.\n\nIn the meantime, a fourth-step grievance hearing was conducted on plaintiff's charges. In June of 1980, the Civil Service Commission hearing officer found that the state had violated both Const 1963, art 11, § 5 (the civil service provision) and Civil Service Rule 1.2 in making its decision regarding Mr. Will's promotion on the basis of \"partisan considerations.\" The CSC affirmed the decision in January of 1981. Neither the state defendants nor the plaintiff appealed the CSC decision in the circuit court.\n\nNearly two years later, in November of 1982, Judge Thomas L. Brown rendered a decision on plaintiff's § 1983 claim for both the Ingham Circuit Court and the Court of Claims. First, he decided that the CSC's decision provided sufficient grounds for finding that defendants had violated plaintiff's federal civil rights, under § 1983.\n\nThe violation of state law by a state official of itself is insufficient to state a violation of a federal right. . . . Under [§ 1983], liability is imposed on any \"person\" who deprives another person's federally protected rights. Such rights have been construed by the courts to include the protection of life, liberty and property under the Fourteenth Amendment of the Federal Constitution. It is Plaintiff's position that the Due Process Clause protects his property right as a public employee to fair treatment.\n\nPlaintiff argues that the State having established a system of merit, [under Const 1963, art 11, § 5] the denial of plaintiff's promotion based on Plaintiff's brother's political persuasion violates due process. The Court agrees.\n\nSecond, Judge Brown determined that the real party in interest was the State of Michigan, and that the Michigan Department of State Police and its director, sued in his official capacity, were persons for purposes of suit under § 1983. The civil service defendants were dismissed. Finally, after considerable Discussion of federal constitutional immunity under the Eleventh Amendment, the circuit court held that the state had consented to be sued in the Court of Claims by virtue of the Court of Claims Act, MCL 600.6401 et seq.; MSA 27A.6401 et seq., but could not be sued in the circuit court.\n\nSeeking to have the court's decision include a finding that defendants' actions also violated the state constitution, on March 17, 1983, plaintiff unsuccessfully moved to clarify the court's November, 1982, decision to include state constitutional grounds as a basis for its decision. On October 25, 1983, the court, on the basis of its November, 1982, opinion, awarded plaintiff money damages against the State Police and its director. The remaining State Police defendants then appealed the Court of Claims judgments in the Court of Appeals. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nIn July, 1985, the Court of Appeals entered a decision only addressing the plaintiff's § 1983 claims. The Court disallowed suit against the state, concluding that § 1983 did not include states as persons. As for the plaintiff's claims against the Director of State Police, the Court remanded the case for a determination of his potential liability, given the possibility of immunity from suit for § 1983 actions.\n\nThe state defendants then applied to this Court for leave to appeal the Court of Appeals judgment dealing with the issue of the State Police director's potential liability. Plaintiff cross-appealed, and, on September 25, 1985, this Court granted leave to appeal to resolve, inter alia, a Court of Appeals conflict on the question whether the state is a person for purposes of suit under § 1983.\n\nB. SMITH v STATE OF MICHIGAN\n\nOn February 4, 1925, the Probate Court for Mecosta County committed Minnie Smith to the state mental hospital at Traverse City. She was admitted on February 10 and two days later gave birth to her son, Jack, the plaintiff. Ms. Smith died following that birth. In June of 1925, Jack Smith was transferred to the State Public School in Coldwater, a state orphanage, pursuant to a May 15, 1925, commitment order issued by the Grand Traverse County Probate Court. The superintendent of the state school believed Jack Smith to be feeble-minded and sought to transfer him and two other infants to the Michigan Home and Training School (MHTS) in Lapeer, an institution for the retarded. In November of 1926, Jack was transferred to the MHTS pursuant to an order issued by the Director of the Welfare Department, who supervised both the Michigan Home and the State Public School. No court order was entered authorizing Jack Smith's commitment to the Michigan Home in Lapeer.\n\nIn October of 1937, the Grand Traverse County Probate Court officially committed Jack Smith to the Michigan Home and Training School, where he had resided for the previous eleven years. The Michigan Home in Lapeer remained Jack Smith's home until 1964. In June of that year, Mr. Smith was transferred, allegedly pursuant to court order, to the Traverse City State Hospital, the place of his birth. He was released from the state hospital nine years later in May of 1973, and lived in foster care homes until his death in February of 1984.\n\nIn February, 1979, Mr. Smith filed suit in the Michigan Court of Claims. His complaint contained four counts.\n\nCount I alleged false imprisonment due to his improper commitment to MHTS; Count II alleged negligent, reckless, intentional breaches of defendants' duty to care for, treat, and educate plaintiff; Count III alleged that his due process and equal protection rights under the Michigan Constitution had been violated; Count IV sought damages under 42 USC 1983 for violation of his federal constitutional rights. [ Smith v Michigan, 122 Mich App 340, 342; 333 NW2d 50 (1983).]\n\nIn response, state defendants moved for summary or accelerated judgment. In a January, 1981, opinion, the Court of Claims determined, first, that plaintiff suffered from a continuing mental infirmity, thus tolling the applicable statute of limitations and making his action timely. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Second, the court granted defendants' motion for summary judgment as to count I (false imprisonment) and count II (negligent care), holding that the state enjoyed immunity from suit on both counts. Third, the court denied defendants' motion to dismiss count III (Michigan constitutional claims). Finally, as to count IV, the court disagreed with defendants' contention that § 1983 did not include states as persons and so denied defendants' motion to dismiss. Therefore, of plaintiff's original four counts, only two remained: the § 1983 and the Michigan constitutional claims.\n\nPlaintiff then sought leave to appeal in the Court of Appeals. Defendants sought leave to cross-appeal. In June of 1981, the Court of Appeals granted leave. Approximately a year and a half later, the Court issued its opinion, ruling on all four of plaintiff's original claims in the Court of Claims.\n\nOn plaintiff's first count, the Court of Appeals reinstated plaintiff's claim of false imprisonment. As to count II, the Court agreed with the Court of Claims dismissal, stating that governmental immunity shielded state defendants from liability for negligence. The Court of Claims judgment on counts III and IV was affirmed. As to plaintiff's Michigan constitutional claim for damages (count III), the Court basically reiterated the Court of Claims finding that governmental immunity did not apply to constitutional claims. Finally, as to count IV (the § 1983 claim), the Court concluded that for the purpose of § 1983, the state was indeed a person.\n\nOne of the main purposes behind § 1983 was to enforce the provisions of the Fourteenth Amendment. Although many disagree about the Fourteenth Amendment's effect and purpose, all agree that it was passed to ensure the constitutionality of the Civil Rights Act of 1866. The Civil Rights Act of 1866 was designed to eliminate the black codes. As such, we conclude that Congress must have intended that states be included as \"persons.\" [ Smith, supra at 352.]\n\nIn response to the Court of Appeals decision, state defendants sought leave to appeal in this Court the false imprisonment, § 1983, and state constitutional claims. The plaintiff cross-appealed the dismissal of his negligent-care claim. In September of 1984, this Court granted defendants leave to appeal in order to resolve the conflict in the Court of Appeals whether the state is a person under § 1983, but denied plaintiff leave to cross-appeal.\n\nII. IS THE STATE A PERSON?\n\nThe central issue presented to this Court in both Smith and Will is whether an individual may sue the state for damages pursuant to § 1983 or, more specifically, whether the word \"person,\" in § 1983, includes states. Section 1983 provides:\n\nEvery person who, under color of any statute, ordinance, regulation, custom, or usage, of any State or Territory or the District of Columbia, subjects, or causes to be subjected, any citizen of the United States or other person within the jurisdiction thereof to the deprivation of any rights, privileges, or immunities secured by the Constitution and laws, shall be liable to the party injured in an action at law, suit in equity, or other proper proceeding for redress. For the purposes of this section, any Act of Congress applicable exclusively to the District of Columbia shall be considered to be a statute of the District of Columbia. [42 USC 1983.]\n\nA brief history of § 1983 is beneficial as background for an analysis of that statutory section.\n\nOn March 23, 1871, President Ulysses S. Grant delivered a message to Congress requesting its immediate attention to legislation aimed at curbing the lawlessness then rampant in the Southern states. In a brief message to Congress, President Grant stated:\n\nA condition of affairs now exists in some States of the Union rendering life and property insecure . . . . That the power to correct these evils is beyond the control of State authorities I do not doubt; that the power of the Executive of the United States, acting within the limits of existing laws, is sufficient for present emergencies is not clear. Therefore, I urgently recommend such legislation as in the judgment of Congress shall effectually secure life, liberty, and property, and the enforcement of law in all parts of the United States. [Cong Globe, 42nd Cong, 1st Sess, 244 (1871).]\n\nCongress moved quickly on the President's request. In April of that same year, it passed the Civil Rights Act of 1871, also known as the Ku Klux Klan Act. Although the act generated much controversy and debate, § 1, now codified at 42 USC 1983,\n\ncaused the least concern, as it only added civil remedies to the criminal penalties established by the 1866 Civil Rights Act. [Note, Developments in the law: Section 1983 and federalism, 90 Harv L R 1133, 1155 (1977).]\n\nIn fact, § 1 of the act created no new substantive rights. Enacted to enforce the provisions of the Fourteenth Amendment, it merely \" a remedy for the violation of rights created elsewhere.\" Day v Wayne Co Bd of Auditors, 749 F2d 1199, 1202 (CA 6, 1984). See, also, Chapman v Houston Welfare Rights Organization, 441 U.S. 600, 616-618; 99 S Ct 1905; 60 L Ed 2d 508 (1979).\n\nAs originally enacted, § 1 of the act conferred jurisdiction on federal district and circuit courts to hear claims such as may be brought pursuant to § 1983. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Congress recognized the failure of the state courts to adequately protect federal rights and so specifically created a right to sue in federal court for violation of those rights.\n\nTo the Reconstruction Congress, the need for some form of federal intervention was clear. It was equally clear, however, that Congress had neither the means nor the authority to exert any direct control, on a day-to-day basis, over the actions of state officials. The solution chosen was to involve the federal judiciary. At the time this Act was adopted, it must be remembered, there existed no general federal-question jurisdiction in the lower federal courts. Rather, \"Congress relied on the state courts to vindicate essential rights arising under the Constitution and federal laws.\" . . . With the growing awareness that this reliance had been misplaced, however, Congress recognized the need for original federal court jurisdiction as a means to provide at least indirect federal control over the unconstitutional actions of state officials. [ District of Columbia v Carter, 409 U.S. 418, 427-428; 93 S Ct 602; 34 L Ed 2d 613 (1973), reh den 410 U.S. 959 (1973).]\n\nTherefore, faced with the unwillingness or inability of state courts to vindicate federally guaranteed rights, Congress enacted § 1983 and created a federal avenue of relief.\n\nAlthough the cases before us occur in state court, the Eleventh Amendment of the United States Constitution, which bars suit by a citizen against a state in a federal court, is the backdrop to the development and, to some extent, the confusion in the case law on the meaning of \"person\" in § 1983. This Eleventh Amendment issue arises when a § 1983 action is brought in federal, rather than state court; however, as will be seen, the United States Supreme Court eventually merged the question of the effect of Eleventh Amendment immunity on suit against a state in a federal court with the question whether the term \"person\" includes a state in a § 1983 action.\n\nThe Eleventh Amendment is the product of a controversy created by an early United States Supreme Court decision, Chisholm v Georgia, 2 U.S. (2 Dall) 419; 1 L Ed 440 (1793). Chisholm involved a suit brought by a citizen of South Carolina against the State of Georgia to collect a debt incurred by the state during the Revolutionary War. The Supreme Court interpreted the clause in US Const, art III, § 2, extending the judicial power of the United States \"to Controversies . . . between a State and Citizens of another state . . .\" to allow a private citizen to sue another state before the United States Supreme Court. This decision created such controversy that the Eleventh Amendment was proposed and ratified by 1798. The language of the amendment had the technical effect only of reversing the holding of the Chisholm decision by barring those suits brought by citizens of one state against another state.\n\nThe Judicial power of the United States shall not be construed to extend to any suit in law or equity, commenced or prosecuted against one of the United States by Citizens of another State, or by Citizens or Subjects of any Foreign State. [US Const, Am XI.]\n\nBut in Hans v Louisiana, 134 U.S. 1; 10 S Ct 504; 33 L Ed 842 (1890), the Court gave an expansive interpretation to the amendment. Hans involved a suit by a citizen of Louisiana against his own state. The Court applied the Eleventh Amendment, holding that its prohibition extended to suits against one's own state as well as against other states. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nThe United States Supreme Court began its struggle with the issue of a state's immunity in federal court in several cases dealing with federal statutes other than § 1983. See Parden v Terminal Railway of Alabama State Docks Dep't, 377 U.S. 184; 84 S Ct 1207; 12 L Ed 2d 233 (1964), reh den 377 U.S. 1010 (1964), and Employees v Missouri Dept' of Public Health \u0026 Welfare, 411 U.S. 279; 93 S Ct 1614; 36 L Ed 2d 251 (1973). In Parden, a suit in federal court under the Federal Employers' Liability Act against Alabama's state-owned railroad, the Court gave a somewhat confusing analysis of the question of Congress' power to subject states to suit. The Court held that Congress could subject a state to suit, despite its claim of Eleventh Amendment immunity, because the states, in ratifying the constitution, had surrendered a portion of their sovereignty to the national government. But the Court also required the state's consent before allowing imposition of suit. The Court concluded that Alabama had consented to suit when it began operation of its railroad some twenty years after passage of the FELA. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nIn Employees, a fair labor standards case in federal court, the United States Supreme Court held that, even though the statute literally included the state as an employer, Congress did not by \"clear language\" intend to lift the Eleventh Amendment immunity in its adoption of that act. Although Congress possessed the power to abrogate the states' Eleventh Amendment immunity, absent evidence indicating Congress' intent to do so, the Court would not allow suit to proceed against a state in federal court.\n\nUnlike Parden and Employees, the Court's opinion in Edelman v Jordan, 415 U.S. 651; 94 S Ct 1347; 39 L Ed 2d 662 (1974), reh den 416 U.S. 1000 (1974), on remand Jordan v Trainor, 405 F Supp 802 (ND Ill, 1975), rev'd 551 F2d 152 (CA 7, 1977), on reh 563 F2d 873 (CA 7, 1977), aff'd Quern v Jordan, 440 U.S. 332; 99 S Ct 1139; 59 L Ed 2d 358 (1979), incorporated both Eleventh Amendment and § 1983 issues. Edelman involved a suit in federal court pursuant to the Social Security Act and § 1983 against Illinois state officials responsible for administering one of the Social Security Act's categorical assistance programs, the federal-state program of Aid to the Aged, Blind or Disabled (AABD). The Court reversed that part of the Seventh Circuit Court of Appeals decision ordering the payment of retroactive benefits by Illinois state officials, holding that such an award, requiring the payment of funds from the state treasury, constituted an action against the state itself and was barred by the Eleventh Amendment.\n\nMoreover, the Court would not allow the state's participation in the AABD program to suffice as evidence of the state's consent to suit in federal court. The Court concluded that it would find a waiver of immunity\n\nonly where stated \"by the most express language or by such overwhelming implications from the text as leave no room for any other reasonable construction.\" [ Id. at 673. Citation omitted.]\n\nThe Court then concluded that Congress did not abrogate the states' Eleventh Amendment immunity in passing § 1983 and, consequently, that the Eleventh Amendment barred retroactive relief against the state, pursuant to § 1983, in federal court.\n\nhas not heretofore been suggested that § 1983 was intended to create a waiver of a State's Eleventh Amendment immunity merely because an action could be brought under that section against state officers, rather than against the State itself. Though a § 1983 action may be instituted by public aid recipients such as respondent, a federal court's remedial power, consistent with the Eleventh Amendment, is necessarily limited to prospective injunctive relief, Ex parte Young, [209 U.S. 123; 28 S Ct 441; 52 L Ed 714 (1908)], and may not include a retroactive award which requires the payment of funds from the state treasury, Ford Motor Co v Dep't of Treasury, [323 U.S. 459; 65 S Ct 347; 89 L Ed 389 (1945)]. [ Edelman, supra at 675-677.]\n\nFitzpatrick v Bitzer, 427 U.S. 445; 96 S Ct 2666; 49 L Ed 2d 614 (1976), added yet another aspect to the analysis of Eleventh Amendment doctrine -- the relationship between Congress' enforcement power pursuant to § 5 of the Fourteenth Amendment and the concept of state sovereignty embodied in the Eleventh Amendment. Fitzpatrick involved suit in federal court against the State of Connecticut by a class of male employees alleging sex discrimination pursuant to title VII of the 1964 Civil Rights Act. Petitioner employees sought both prospective injunctive relief and a retroactive monetary award. The Court held that the Eleventh Amendment did not bar the collection in federal court of retroactive benefits to petitioners when Congress acted to enforce the \"substantive guarantees of the Fourteenth Amendment.\"\n\nThe Court recognized that a special relationship existed between Congress' enforcement powers pursuant to § 5 of the Fourteenth Amendment and a state's sovereignty embodied in the earlier-adopted Eleventh Amendment, and the Court concluded that the enabling provisions of § 5 of the Fourteenth Amendment limited the scope of the Eleventh Amendment.\n\nBut we think that the Eleventh Amendment, and the principle of state sovereignty which it embodies . . . are necessarily limited by the enforcement provisions of § 5 of the Fourteenth Amendment. In that section Congress is expressly granted authority to enforce \"by appropriate legislation\" the substantive provisions of the Fourteenth Amendment, which themselves embody significant limitations on state authority. When Congress acts pursuant to § 5, not only is it exercising legislative authority that is plenary within the terms of the constitutional grant, it is exercising that authority under one section of a constitutional Amendment whose other sections by their own terms embody limitations on state authority. We think that Congress may, in determining what is \"appropriate legislation\" for the purpose of enforcing the provisions of the Fourteenth Amendment, provide for private suits against States or state officials which are constitutionally impermissible in other contexts. See Edelman v Jordan, 415 U.S. 651 (1974); Ford Motor Co v Dep't of Treasury, 323 U.S. 459 (1945). [ Fitzpatrick, supra at 456.]\n\nTherefore, without ever explicitly addressing the state's consent to suit, the Court allowed retroactive relief against the state on the basis of congressional abrogation of the state's Eleventh Amendment immunity. See also Atascadero State Hosp v Scanlon, 473 U.S. 234, 237-238; 105 S Ct 3142; 87 L Ed 2d 171 (1985).\n\nThen in Monell v New York City Dep't of Social Services, 436 U.S. 658; 98 S Ct 2018; 56 L Ed 2d 611 (1978), the Court held that the term \"person\" in § 1983 included local governmental units, thus overruling the Court's earlier decision to the contrary in Monroe v Pape, 365 U.S. 167; 81 S Ct 473; 5 L Ed 2d 492 (1961). Monell involved a suit in federal court against the City of New York by a class of female employees aggrieved by their employer's official pregnancy policy. The employees brought suit pursuant to § 1983, seeking both injunctive relief and back pay for periods of forced leave.\n\nThe Court's analysis basically consisted of a reexamination of the congressional debates surrounding the passage of the Civil Rights Act of 1871. The Court rejected the Monroe Court's Conclusion that congressional failure to adopt the first conference revision of the Sherman amendment \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e indicated congressional intent to exclude municipalities from the scope of the term \"person\" in § 1983. The Monell Court concluded:\n\nconstitutional objections raised against the Sherman amendment -- on which our holding in Monroe was based . . . -- would not have prohibited congressional creation of a civil remedy against state municipal corporations that infringed federal rights. [ Monell, supra at 669.]\n\nThe Court reached this Conclusion by determining that Congress objected to the Sherman amendment because it created new obligations for municipalities, not because it imposed civil liability for the violation of obligations already imposed. Unlike the imposition of financial liability on municipalities, creation of new obligations by the federal government interfered with the state's power to govern itself.\n\nas instrumentalities through which States executed their policies could be equally disabled from carrying out state policies if they were also obligated to carry out federally imposed duties. . . . Thus, there was ample support for view that the Sherman amendment, by putting municipalities to the Hobson's choice of keeping the peace or paying civil damages, attempted to impose obligations on municapalities by indirection that could not be imposed directly, thereby threatening to \"destroy the government of the States.\" [ Id. at 678-679.]\n\nMoreover, imposition of liability on municipalities did not interfere with the notion of state sovereignty because the federal government, in protecting federal constitutional rights in this manner, did not need to engage the states in any \"positive\" action.\n\nAfter concluding that congressional failure to adopt the first conference version of the Sherman amendment did not mean that Congress meant to shield municipalities from financial liability, the Court turned to the question whether the term \"person\" in § 1983 included municipalities. The Court noted the remedial nature of the Civil Rights Act of 1871.\n\n\"This act is remedial, and in aid of the preservation of human liberty and human rights. All statutes and constitutional provisions authorizing such statutes are liberally and beneficently construed.\" [ Monell, supra at 684.]\n\nThe Court viewed such snippets from the legislative history as indicative of Congress' intent to give the term \"person\" in § 1983 a broad interpretation. Consequently, the Court saw no reason not to extend the Dictionary Act's definition of person to the statutory language of § 1 of the Ku Klux Klan Act. Congress had passed the Dictionary Act a few months prior to enacting the Ku Klux Klan Act. The Dictionary Act stated that\n\n\"the word 'person' may extend and be applied to bodies politic and corporate . . . .\" [ Id. at 688.]\n\nSince the phrase \"bodies politic and corporate\" applied to municipal corporations in 1871, and since the legislative history indicated Congress desired a liberal construction of § 1 of the Ku Klux Klan Act, the Court concluded that the term \"person\" in § 1983 included municipalities. The Court, however, expressly limited its holding to local government units \"not considered part of the State for Eleventh Amendment purposes.\" Monell, supra at 690, n 54.\n\nHutto v Finney, 437 U.S. 678, 98 S Ct 2565; 57 L Ed 2d 522 (1978), reh den 439 U.S. 1122 (1979), raised two further issues of interest to the development of Eleventh Amendment doctrine and § 1983 case law. First, the Court seemed to soften the strict standard for congressional abrogation of the Eleventh Amendment enunciated in its earlier decision in Edelman. Second, Justice Brennan, in concurrence, raised, but did not answer, the question whether the Court's earlier decisions in Fitzpatrick and Monell left states open to suit for damages pursuant to § 1983.\n\nHutto involved a challenge to conditions in the Arkansas penal system. The federal district court found that conditions in the state prisons constituted cruel and unusual punishment and entered a number of corrective remedial orders. The Commissioner of Corrections and the Arkansas Board of Corrections, challenged an award of attorney fees payable from Department of Correction funds. The commissioner and board argued that a federal court could not, consistent with the Eleventh Amendment, award attorney fees payable from state funds. The Supreme Court, however, found the Eleventh Amendment no bar to an award of fees pursuant to the Civil Rights Attorney's Fees Awards Act of 1976, 42 USC 1988.\n\nReiterating the reasoning of its Fitzpatrick decision, the Court held that Congress has \"plenary power\" to lift the states' Eleventh Amendment immunity when acting to enforce the provisions of the Fourteenth Amendment. In enacting § 1988 Congress exercised that power and abrogated the states' immunity.\n\nThe Court then examined whether Congress intended to subject states to the fee award provisions of § 1988. Although the \"express language\" of the act did not authorize awards against the states, the legislative history specifically addressed the question of awarding attorney fees against state governments. This failure to satisfy what Justice Powell labeled a \"clear statement\" rule, however, did not prevent the Court from awarding fees to the prevailing party.\n\nThe Attorney General that the statute itself must expressly abrogate the States' immunity from retroactive liability . . . . Even if we were not dealing with an item such as costs, this reliance would be misplaced. . . .\n\nThe present Act . . . a history focusing directly on the question of state liability; Congress considered and firmly rejected the suggestion that States should be immune from fee awards. . . . , the claims asserted in Employees and in Edelman v Jordan. . . were based on a statute rooted in Congress' Art I power. . . In this case, as in Fitzpatrick v Bitzer. . ., the claim is based on a statute enacted to enforce the Fourteenth Amendment. . . . Applying the standard appropriate in a case brought to enforce the Fourteenth Amendment, we have no doubt that the Act is clear enough to authorize the award of attorney's fees payable by the State. [ Hutto, supra at 698-699, n 31.]\n\nPerhaps of greater interest, however, was the Discussion between Justice Brennan, in his concurrence, and Justice Powell, in his partial concurrence and partial Dissent, of the effect of the Court's decisions in Fitzpatrick and Monell on the states' liability for damages pursuant to § 1983. Justice Powell argued that the Eleventh Amendment barred any award of attorney fees against a state absent \"an express statutory waiver\" of immunity in the Civil Rights Attorney's Fees Awards Act.\n\nJustice Brennan took issue with Justice Powell's claim that § 1988 did not authorize fee awards against the states. Although Concurring in the Court's opinion, Justice Brennan issued a separate opinion to address arguments put forth by Justice Powell.\n\n\"Mr. Justice Powell takes the view . . . that unless 42 USC § 1983 also authorizes damages awards against the States, the requirements of the Eleventh Amendment are not met. Citing Edelman v Jordan, 415 U.S. 651 (1974), he concludes that § 1983 does not authorize damages awards against the State and, accordingly, that § 1988 does not either. There are a number of difficulties with this syllogism, but the most striking is its reliance on Edelman v Jordan. . . . [ Hutto, supra at 700.]\n\nJustice Brennan questioned the continued vitality of Edelman's Conclusion that § 1983 did not abrogate the states' Eleventh Amendment immunity, expressing the view that the issue whether § 1983 included states as persons was \"an open question.\"\n\nJustice Brennan, as well as numerous state and lower federal court Judges, claimed the Court finally answered this question in Quern v Jordan, supra. Quern was actually a sequel to the Court's earlier decision in Edelman. Quern involved the question whether the Eleventh Amendment precluded a federal court from ordering state officials to mail explanatory notices to plaintiff class members advising them of procedures available to secure a determination of their entitlement to past welfare benefits. The Supreme Court held that it did not, viewing the notice as ancillary to prospective relief already ordered by the lower federal court.\n\nThe Court never explicitly addressed the question whether the term \"person\" in § 1983 included states. But, in his Concurring opinion, Justice Brennan argued that the majority had\n\nout to decide an issue unnecessary to its holding . . . , in what patently dicta, that a State not a \"person\" for purposes of 42 USC § 1983 . . . . [ Quern, supra at 350 (Brennan, J., Concurring).]\n\nUnfortunately, the ambiguity of the Court's decision only further complicated the already confused body of case law dealing with § 1983 claims against the state to the extent that all parties in this suit attempt to bend it to their point of view.\n\nThe majority in Quern focused on the issue of congressional intent to abrogate the Eleventh Amendment. The Court began its analysis by reaffirming its holding in Edelman, the continued vitality of which Justice Brennan questioned in his concurrence in both Hutto and Quern. In doing so, the Court adopted the reasoning of Justice Powell in his Concurring opinion in Hutto to refute Justice Brennan's claim that the Court's opinions in Fitzpatrick and Monell undermined the premise of its opinion in Edelman, that § 1983 did not abrogate the historic immunity of the states from suit in federal court.\n\nMr. Justice Brennan's opinion Concurring in the judgment states that \" Edelman v Jordan. . . had held that § 1983 did not override state immunity, for the reason, as the Court later stated in Fitzpatrick, that ' Civil Rights Act of 1871 . . . had been held in Monroe v Pape. . . to exclude cities and other municipal corporations from its ambit; that being the case, it could not have been intended to include States as parties defendant.'\" . . . Since Monell overruled Monroe's holding that cities and other municipal corporations are not \"persons\" within the meaning of § 1983, Mr. Justice Brennan's opinion argues that the \"premise\" of Edelman has been \"undercut.\" . . . The fallacy of this line of reasoning was aptly demonstrated last Term by Mr. Justice Powell in his Concurring opinion in Hutto, where he stated: \"The language in question from Fitzpatrick was not essential to the Court's holding in that case. Moreover, this position ignores the fact that Edelman rests squarely on the Eleventh Amendment immunity, without adverting in terms to the treatment of the legislative history in Monroe v Pape. . . .\" . . . In fact Monroe v Pape is not even cited in Edelman. [ Quern, supra at 339, n 7.]\n\nTherefore, finding nothing in Eleventh Amendment case law subsequent to Edelman that undermined either its holding or reasoning, the Court rejected Justice Brennan's contentions that Edelman was, in essence, no longer good law.\n\nThe Court in Quern went on to address Justice Brennan's concerns about the validity of the Edelman holding that § 1983 did not abrogate the historic immunity of the states from suit in federal court. Justice Brennan argued that the history of the Fourteenth Amendment, which worked a great transformation on the nation's federalist system, the Dictionary Act's reference to \"bodies politic\" in its definition of \"person,\" and the language and legislative history of § 1983 supported his argument that the term \"person\" in § 1983 encompassed states. The Court acknowledged these arguments, but framed its response in terms of the states' Eleventh Amendment immunity.\n\nour Brother Brennan, we simply are unwilling to believe, on the basis of such slender \"evidence,\" that Congress intended by the general language of § 1983 to override the traditional sovereign immunity of the States.\n\nlogic, the circumstances surrounding the adoption of the Fourteenth Amendment, nor the legislative history of the 1871 Act compels, or even warrants, a leap from this proposition to the Conclusion that Congress intended by the general language of the Act to overturn the constitutionally guaranteed immunity of the several States. In Tenney v Brandhove, 341 U.S. 367 [71 S Ct 783; 95 L Ed 1019] (1951), the Court rejected a similar attempt to interpret the word \"person\" in § 1983 as a withdrawal of the historic immunity of state legislators. . . .\n\nthe importance of the States' traditional sovereign immunity, if in fact the Members of the 42d Congress believed that § 1 of the 1871 Act overrode that immunity, surely there would have been lengthy debate on this point and it would have been paraded out by the opponents of the Act along with the other evils that they thought would result from the Act. Instead, § 1 passed with only limited debate and not one Member of Congress mentioned the Eleventh Amendment or the direct financial consequences to the States of enacting § 1. We can only conclude that this silence on the matter is itself a significant indication of the legislative intent of § 1. [ Quern, supra at 341-343.]\n\nMoreover, the Court reiterated the fact that it consistently required a clearer manifestation of congressional intent to abrogate the states' historic immunity than demonstrated by Justice Brennan. While equivocating on the question whether Congress had to expressly abrogate the states' Eleventh Amendment immunity, \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e the Court concluded that neither the language nor the legislative history of § 1983 indicated an intent on the part of Congress to lift the states' historic immunity from suit in federal court.\n\n1983 not explicitly and by clear language indicate on its face an intent to sweep away the immunity of the States; nor it have a history which directly on the question of state liability and which that Congress considered and firmly decided to abrogate the Eleventh Amendment immunity of the States. Nor our reaffirmance of Edelman render § 1983 meaningless insofar as states concerned. See Ex parte Young, 209 U.S. 123 (1908). [ Quern, supra at 345.]\n\nTherefore, absent any evidence indicating congressional intent to lift the states' immunity, the Court in Quern reaffirmed its holding in Edelman that § 1983 did not abrogate the states' Eleventh Amendment immunity.\n\nQuern remains an ambiguous decision. Justice Brennan's analysis appeared to merge the issues of \"person\" and immunity, arguing that\n\na State were a \"person\" for purposes of § 1983 . . . its immunity under the Eleventh Amendment would be abrogated by the statute. [ Quern, supra at 350-351.]\n\nThe majority, on the other hand, found the evidence offered by Justice Brennan to support a Conclusion that § 1983 encompassed states as persons too slender to warrant a Conclusion that Congress intended to abrogate the states' Eleventh Amendment immunity. So while the majority spoke in terms of abrogation of immunity, Justice Brennan claimed the Court actually decided the issue whether the state was a person for purposes of suit pursuant to § 1983.\n\nObviously, Quern has definitively answered the Eleventh Amendment question as to the intention of Congress in adopting § 1983, but it left without a definite answer the question whether it intended the term \"person\" to include states for purposes of § 1983 actions in state courts in which the Eleventh Amendment would not apply. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Thus, Quern further complicated the\n\nunfortunate marriage of section 1983 doctrine eleventh amendment doctrine . . . . [Eisenberg, Section 1983: Doctrinal foundations and an empirical study, 67 Cornell L R 482, 518 (1982).]\n\nThe Court's ambiguous decision in Quern, coupled with its less than consistent decisions on Eleventh Amendment immunity, has left the commentators and the state and lower federal courts speculating whether Quern did, in fact, resolve the \"person\" issue. In fact, a number of commentators equivocate on the question, noting the different interpretations accorded Quern.\n\nIn Quern v Jordan, the Court subsequently may have held generally that states are not suable persons under § 1983. However, because Quern involved a federal court action, it is also possible to read Quern more narrowly as an Eleventh Amendment case. [Nahmod, Civil Rights and Civil Liberties Litigation (2d ed), § 6.20, p 388.]\n\nSome commentators even argue that Quern determined that states were persons for purposes of § 1983.\n\nIn Quern v Jordan, the Court reaffirmed the Edelman rule, although it was not clear whether the Court was holding that states are not persons for section 1983 purposes, or that states are persons but that they can raise the Eleventh Amendment as a bar to suit in federal court. [Mahoney, \"The Prima Facie Section 1983 Case,\" in Freilich \u0026 Carlisle, eds, Section 1983: Sword and Shield, p 121 (1983).]\n\nA number of federal courts and state supreme courts have concluded, on the basis of Quern, that Congress did not intend the term \"person\" in § 1983 to include states and state agencies. See, e.g., Ruiz v Estelle, 679 F2d 1115, 1137 (CA 5, 1982), modified on other grounds 688 F2d 266 (CA 5, 1982), cert den 460 U.S. 1042 (1983) (\"Congress in enacting § 1983, did not intend 'to override the traditional sovereign immunity of the states.' Thus neither states nor state agencies are 'persons' within the meaning of § 1983\"); Vermett v Hough, 606 F Supp 732, 743 (WD Mich, 1984) (\"Moreover, neither a state nor its departments and agencies are 'persons' within the meaning of § 1983, and thus are not subject to suit under this statute\"); Merritt v Idaho, 108 Idaho 20, 26; 696 P2d 871 (1985) (\"We interpret Quern v Jordan to hold not only that § 1983 does not abrogate the states eleventh amendment immunity, but also as holding that states are not 'persons' for purposes of § 1983\"); State v Green, 633 P2d 1381, 1382 (Alas, 1981) (\"We interpret Quern v Jordan as holding not only that section 1983 does not abrogate the state's eleventh amendment immunity, but as holding that states are not 'persons' within the meaning of the section\"); Woodbridge v Worchester State Hosp, 384 Mass 38, 44-45, n 7; 423 NE2d 782 (1981) (\"As is made clear by the Concurring opinions of Justices Marshall and Brennan in Quern v Jordan. . . the majority reaffirmed the Court's prior holding in Edelman v Jordan. . . that States are not 'persons' for purposes of § 1983, and thus are not liable for retroactive awards of damages in suits based on the statute\"); Boldt v Wisconsin, 101 Wis 2d 566, 584; 305 NW2d 133 (1981), cert den 454 U.S. 973 (1981) (\"The United States Supreme Court has held that a state is not liable under sec. 1983 because a state is not a 'person' within the meaning of sec. 1983. According to Quern v Jordan. . ., the immunity of the states to suit is not destroyed by sec. 1983 and a state may not be sued even in a sec. 1983 action without its consent\"); Edgar v Washington, 92 Wash 2d 217, 221; 595 P2d 534 (1979), cert den 444 U.S. 1077 (1980) (\"The question before the court in Quern, as Justice Brennan's Dissent quite clearly points out, was whether the word 'person' as used in [§ 1983] included states. It is the inescapable holding of the court that it did not\"); Hampton v Michigan, 144 Mich App 794, 799-800; 377 NW2d 920 (1985) (\" is our opinion based on Quern and decisions of other states that the term 'person' in § 1983 was not intended to include states and state agencies\").\n\nOther post- Quern courts still conclude that the state is a person for purposes of § 1983. Most then address the question of immunity, either allowing suit to proceed or barring suit or liability on the basis of the absence or presence of Eleventh Amendment or state nonconstitutional, sovereign immunity, depending on whether the action is in a federal or a state court. See, e.g., Della Grotta v Rhode Island, 781 F2d 343, 347, 349 (CA 1, 1986) (\"Della Grotta is not barred by the eleventh amendment from bringing this section 1983 action against the State itself.\" \" [where,] as here, a state has waived its eleventh amendment immunity, there is no principled reason to distinguish between states and municipalities as 'persons' suable under section 1983\"); Weisbord v Michigan State Univ, 495 F Supp 1347, 1354, 1355, 1357 (WD Mich, 1980) (citations omitted) (\"This Court is of the opinion that [state agencies] are 'persons' within the meaning of 42 USC § 1983.\" \" the state is found to have waived its Eleventh Amendment immunity . . . or Congress has specifically abrogated that immunity . . . a suit for retrospective relief against state officials would be barred.\" \"Accordingly, plaintiff's attempt to secure money damages or other retrospective relief from defendants is precluded by the Eleventh Amendment . . . \"); Uberoi v Univ of Colorado, 713 P2d 894, 904 (Colo, 1986) (\"We . . . hold that the eleventh amendment does not apply to Uberoi's § 1983 claim because that amendment is jurisdictional in that it prohibits citizens from bringing suit against states in federal courts. Uberoi initiated the suit in state court, not federal court. We also hold that the university is a 'person' under § 1983\"); Karchefske v Dep't of Mental Health, 143 Mich App 1, 7; 371 NW2d 876 (1985) (citations omitted) (\"Not only are we persuaded that Quern does not hold that a state is not a § 1983 'person,' but we find within the Quern opinion some evidence that the state in fact is such a person\").\n\nIn three early pre- Quern and pre- Monell cases, this Court, the United States District Court for the Western District of Michigan, and the Sixth Circuit Court of Appeals concluded that § 1983 did not include states as persons. All three premised their reasoning on Monroe's holding that § 1983 did not include municipalities as persons.\n\nIn Hirych v State Fair Comm, 376 Mich 384, 394; 136 NW2d 910 (1965), this Court stated that\n\nthe construction given the Federal civil rights act in [such cases as Monroe ], the fair authority and the State of Michigan are . . . clearly not within the purview of [§ 1983].\n\nTwo years later, in Deane Hill Country Club, Inc v Knoxville, 379 F2d 321, 324 (CA 6, 1967), cert den 389 U.S. 975 (1967), the Court of Appeals also decided that the term \"person\" in § 1983 did not include states. After discussing Monroe's application to a suit against the city of Knoxville, the court concluded that\n\nthe State of Tennessee not liable as a \"person\" within the meaning of [§ 1983] . . . . [Citation omitted.]\n\nFinally, in Glancy v Michigan Dep't of Corrections Parole Bd, 287 F Supp 34, 36 (WD Mich, 1968), the court found that a state agency did not fall within the statutory language of § 1983.\n\nIt is also clear that § 1983 is directed at \"persons\" . . .; § 1983 is not directed at governmental agencies or units. Monroe v Pape. . . .\n\nBecause the rationales of Hirych, Deane Hill, and Glancy were premised on the Supreme Court's decision in Monroe, which was overruled by Monell, the value of these cases as precedent for the proposition that § 1983 does not include states as persons is questionable.\n\nIt is unfortunate that the Supreme Court's pronouncements on this subject were not rendered in § 1983 actions arising in state courts so that the \"person\" issue could have been decided on its own merits, rather than as a reflection of an Eleventh Amendment analysis. Nonetheless, we do think a direct answer to the \"person\" question is discernible and much needed to resolve the conflicting Court of Appeals views before us.\n\nAn historical analysis of the reasons why Congress enacted the Ku Klux Klan Act of 1871 provides some support for the idea that Congress' failure to abrogate the states' Eleventh Amendment immunity indicated it never intended to subject states to suit as persons pursuant to § 1983. Section 1 of the Ku Klux Klan Act, the precursor of § 1983, specifically conferred jurisdiction on the lower federal courts to hear claims on the basis of deprivations of federal rights. In fact, in 1871, the lower federal courts did not yet have federal question jurisdiction. Congress granted jurisdiction to the federal courts, much to the outrage of many congressmen, in order to afford state citizens a forum to rectify violations of federal rights not adequately redressed by state courts.\n\n\"I stand here this day to affirm that [the courts of my home state of Ohio] will give fair and impartial redress to any man whose rights under the Constitution have been violated by anyone whomsoever. I am unwilling to say to the people of Ohio that the Congress of the United States thinks their judiciary so unsafe or so unworthy of trust that the people must seek redress in the courts of the United States.\" [Zagrans, \" Under color of \" what law: A reconstructed model of section 1983 liability, 71 Va L R 499, 557, n 312, citing Cong Globe, 42nd Cong, 1st Sess, App 216 (1871) (comments of Senator Thurman of Ohio).]\n\nBut in 1871, the Eleventh Amendment barred suit against a state in federal court, and, in Quern, the Supreme Court held that Congress did not abrogate the states' Eleventh Amendment immunity when it enacted § 1983. Thus, Congress contemplated that, at the very least, states would not be subjected to suit as persons in federal court.\n\nIn Marrapese v Rhode Island, 500 F Supp 1207, 1212, n 11 (D RI, 1980), however, the court suggested that\n\nCongress' refusal to force a waiver of Eleventh Amendment immunity would not necessarily render meaningless the inclusion of states within the ambit of § 1983 even in cases where voluntary waiver was not forthcoming. In states where sovereign immunity has been legislatively or judicially abrogated, § 1983 plaintiffs could take their claims against the state into state court.\n\nThis statement, however, completely fails to take account of the historical circumstances surrounding the enactment of § 1983. Congress specifically conferred jurisdiction on the federal courts because the state judicial system had failed in the enforcement of federal constitutional rights. To argue that aggrieved plaintiffs could seek relief in state courts is to ignore the historical motivation behind enactment of § 1983. Congress was\n\n\"driven by existing facts to provide for the several states in the South what they unable to fully provide for themselves; i.e., the full and complete administration of Justice in the courts.\" [ Mitchum v Foster, 407 U.S. 225, 241; 92 S Ct 2151; 32 L Ed 2d 705 (1972), citing Cong Globe, 42nd Cong, 1st Sess, 653 (1871) (comments of Senator Osborn).]\n\nFurthermore, as fully quoted above, ante, p 554, President Grant said that \"the power to correct these evils is beyond the control of State authorities I do not doubt\"; and the United States Supreme Court in District of Columbia v Carter, supra at 427, said \" solution chosen was to involve the federal judiciary. . . . Congress recognized the need for original federal court jurisdiction . . . .\" It was quite obvious that, in enacting the predecessor of § 1983, the Forty-second Congress intended to provide a remedy in federal, not state courts.\n\nWe cannot improve on the Conclusion of our own Court of Appeals in Hampton v Michigan, supra at 797-800, when it said:\n\nAlthough Quern involved Eleventh Amendment immunity, which, of course, is inapplicable to suits brought in state court, other appellate courts have interpreted the Quern language that § 1983 was not intended to abrogate existing immunity of the states, as tantamount to a holding that a state is not a \"person\" within § 1983.\n\nIt is true that Quern may be interpreted as dealing only with the states' Eleventh Amendment immunity, thus leaving open the possibility that Congress intended to permit § 1983 actions against states in state courts. We find it unlikely, however, that Congress would have intended to enact a statute creating a remedy for violation of civil rights, while at the same time precluding private individuals from bringing actions under the statute against states in federal court but permitting such actions against states in state courts.\n\nis our opinion based on Quern and decisions of other states that the term \"persons\" in § 1983 was not intended to include states and state agencies.\n\nMoreover, the circumstances surrounding passage of § 1983 further support our Conclusion that, in enacting § 1983, Congress did not intend to subject states to suit as persons. To begin with, § 1 of the Ku Klux Klan Act, now § 1983, occasioned very little debate, suggesting that the provisions of that section were considered fairly noncontroversial.\n\nDebate on the [Ku Klux Klan Act] was extensive. Over one hundred members of both houses presented speeches, most of them opposing passage. Only twenty-eight speakers, less than one-third of those addressing the Act, mentioned section 1. Of those, about half opposed the section; four who opposed the bill in general nonetheless approved of section 1. [Zagrans, (supra) at 549-550.]\n\nLifting the states' Eleventh Amendment immunity and exposing them to suits for damages, however, was a controversial proposition in 1871. In fact, the absence of debate on a proposition as controversial as directly interfering with state treasuries is indeed \"amazing.\" See Nowak, The scope of congressional power to create causes of action against state governments and the history of the Eleventh and Fourteenth Amendments, 75 Colum L R 1413, 1467, n 257 (1975).\n\nIn none of the debates was it argued that state governments would be hurt because the section imposed financial liability upon them for violations of the amendment, and at no point in the debates did the proponents of the bill mention that such a provision was contained therein. [Nowak, (supra) at 1465-1466.]\n\nThus, the limited debate on § 1 indicates that, in enacting § 1983, Congress did not intend to abrogate the states' Eleventh Amendment immunity and expose the states to suit for damages pursuant to § 1983. See also Quern, supra at 355, n 10.\n\nIn addition, the Dictionary Act, enacted two months prior to the Ku Klux Klan Act, does not preclude the Conclusion that Congress did not intend § 1983 to include states as persons. The Dictionary Act, providing a few general rules of statutory construction, stated that the word \"person\" could apply to \"bodies politic and corporate.\" But the Dictionary Act was enacted five years after the model for § 1 of the Ku Klux Klan Act, § 2 of the Civil Rights Act of 1866.\n\nWhile [the Dictionary Act] was enacted two months before the enactment of the 1871 Civil Rights Act, it came more than five years after passage of § 2 of the Civil Rights Act of 1866, 14 Stat 27, which served as the model for the language of § 1 of the 1871 Act. Cong Globe, 42d Cong, 1st Sess, App 68 (1871) (remarks of Rep. Shellabarger) . . . . [ Quern, supra at 341, n 11. Citation omitted.]\n\nSee also Zagrans, (supra) at 550.\n\nIn Conclusion, we agree with the majority in Quern that it was not the intention of the Forty-second Congress that states could be sued in a federal § 1983 action and with Concurring Justice Brennan that that was tantamount to deciding that the word \"person\" as used in § 1983 was not intended in any action to include a sovereign state. The circumstances surrounding passage of § 1983 further support this Conclusion. Therefore, on the states-as-persons issue, we would affirm the decision of the Court of Appeals in Will, and reverse the decision of the Court of Appeals in Smith.\n\nIII. ARE STATE OFFICIALS PERSONS?\n\nWe next consider the status and liability of the Director of State Police as a party, in light of our holding that the state and its departments are not proper parties to a § 1983 lawsuit.\n\nIn his brief to this Court, plaintiff does not claim that he sued the director in his personal capacity. In fact, in framing his second issue -- whether § 1983 included the state and its agencies and officials as persons, Will states:\n\nThe State of Michigan, its department of state police, and its officers acting in their official capacities are \"persons\" under 42 USC 1983.\n\nHe further states:\n\nThere is no question that a lawsuit against the Director of State Police would be proper under 42 USC 1983. Individuals are definitely \"persons\" for purposes of 42 USC 1983 even where they are also officials of the government. . . . In this case Plaintiff sued the Director of the State Police, as well as his department. Since the Court of Claims can render a judgment in an action \"ex delicto\" against the State based on the acts of the Director of the State Police acting in his official capacity, it is logical to conclude that this same official ought to bind the State when sued for official actions accomplished in violation of 42 USC 1983. [Emphasis added.]\n\nMoreover, the early pleadings in the Will case indicate that Mr. Will sued the Director of State Police in his official capacity. Neither Mr. Will's complaint in the Ingham Circuit Court nor in the Court of Claims named the Director of the Michigan State Police personally. All references to the director related only to the office of the Director of State Police. In fact, the Director of State Police is mentioned in only one count, the Michigan constitutional claim, in both the Ingham Circuit Court and Court of Claims complaints. Neither reference, however, names the director personally.\n\nThe state in its brief in this Court, aptly points out that\n\naction was not brought against the Director by name, it was brought against the Director by official title only.\n\nIt is apparent that Mr. Will brought suit for damages under § 1983 against the Director of the Michigan State Police in his official capacity. Nothing in the record suggests otherwise.\n\nWe deal then only with the question whether a state official being sued in an official capacity for retroactive relief is a person for purposes of § 1983. We would answer in the negative, substantially on the basis of the same analysis employed in part II.\n\nEx parte Young, supra, helped to lay the groundwork for the Supreme Court's development of the concept of official-versus personal-capacity suits. In Young, the Court carved out an exception to the Eleventh Amendment's prohibition against suing a state in federal court. The Court found the Eleventh Amendment to be no bar to an official-capacity suit for injunctive relief against the Attorney General of Minnesota, Edward Young. Though not identified as an official-capacity suit by the Court, the form of relief sought, an injunction, indicated the nature of the action. After all,\n\ndirected against officials in their individual capacity, injunctions would be useless . . . because the purpose of such relief is to change unconstitutional official acts or practices. [Nahmod, (supra) , § 6.04, p 343, n 48.]\n\nDespite the obvious effect on the state, the Court claimed that the injunction operated only against the person of Mr. Young. By \"stripping away\" the official or representative character of the state attorney general, the Court created the legal fiction that the plaintiffs in Young actually sought relief against Mr. Young, not against the state itself.\n\nIf the act which the state Attorney General seeks to enforce be a violation of the Federal Constitution, the officer in proceeding under such enactment comes into conflict with the superior authority of that Constitution, and he is in that case stripped of his official or representative character and is subjected in his person to the consequences of his individual conduct. [ Young, supra at 159-160.]\n\nBut in Ford Motor Co v Indiana Dep't of Treasury, 323 U.S. 459; 65 S Ct 347; 89 L Ed 389 (1945), the Supreme Court found the Eleventh Amendment to be a bar to the recovery of monetary damages from state officials sued in their official capacities. The Court viewed such relief as operating against the state itself, despite the fact that individual state officials were sued.\n\nthe action is in essence one for the recovery of money from the state, the state is the real, substantial party in interest and is entitled to invoke its sovereign immunity from suit even though individual officials are nominal defendants. [ Ford Motor, supra at 464. Emphasis added.]\n\nThe Supreme Court, therefore, found that the Eleventh Amendment did not preclude official-capacity suits for injunctive relief because such suits \"stripped\" an official of his \"official or representative character,\" thus exposing only the individual occupying the office to liability. But the Eleventh Amendment did bar official-capacity suits for monetary relief because such actions were, in effect, suits against the state itself, despite the presence of individual officials as nominal defendants.\n\nIn Edelman, supra, the Court sought to clarify its earlier holdings in Ex parte Young and Ford Motor, analyzing a lower federal court's order of relief in light of those two decisions.\n\nrelief awarded in Ex parte Young was prospective only; the Attorney General of Minnesota was enjoined to conform his future conduct of that office to the requirement of the Fourteenth Amendment. . . .\n\nBut the retroactive portion of the District Court's order here, which requires the payment of a very substantial amount of money which that court held should have been paid, but was not, stands on quite a different footing. These funds will obviously not be paid out of the pocket of petitioner Edelman. Addressing himself to a similar situation in Rothstein v Wyman, 467 F2d 226 (CA 2, 1972), cert den 411 U.S. 921 (1973), Judge McGowan observed for the court:\n\n\"It is one thing to tell the Commissioner of Social Services that he must comply with the federal standards for the future if the state is to have the benefit of federal funds in the programs he administers. It is quite another thing to order the Commissioner to use state funds to make reparation for the past. The latter would appear to us to fall afoul of the Eleventh Amendment if that basic constitutional provision is to be conceived of as having any present force. . . .\"\n\nWe agree with Judge McGowan's observations. The funds to satisfy the award in this case must inevitably come from the general revenues of the State of Illinois, and thus the award resembles far more closely the monetary award against the State itself, Ford Motor Co v Dep't of Treasury, supra, than it does the prospective injunctive relief awarded in Ex parte Young. [ Edelman, supra at 664-665.]\n\nThe Court therefore rejected any distinction between equitable and monetary relief as the line separating permissible versus prohibited relief in official-capacity suits in a federal court. Instead, the Court looked to the prospective versus retroactive nature of the relief sought.\n\nAs in most areas of the law, the difference between the type of relief barred by the Eleventh Amendment and that permitted under Ex parte Young will not in many instances be that between day and night. The injunction issued in Ex parte Young was not totally without effect on the State's revenues, since the state law which the Attorney General was enjoined from enforcing provided substantial monetary penalties against railroads which did not conform to its provisions. Later cases from this Court have authorized equitable relief which has probably had greater impact on state treasuries than did that awarded in Ex parte Young. . . . But the fiscal consequences to state treasuries in these cases were the necessary result of compliance with decrees which by their terms were prospective in nature. State officials, in order to shape their official conduct to the mandate of the Court's decrees, would more likely have to spend money from the state treasury than if they had been left free to pursue their previous course of conduct. Such an ancillary effect on the state treasury is a permissible and often an inevitable consequence of the principle announced in Ex parte Young, supra. [ Edelman, supra at 667-668. Citation omitted.]\n\nFinally, Alabama v Pugh, 438 U.S. 781; 98 S Ct 3057; 57 L Ed 2d 1114 (1978), made clear that the Court's distinctions between prospective and retroactive relief only applied to suits against state officials in their official capacities. In Pugh, the Court held that issuance of a mandatory injunction against the State of Alabama ran afoul of the Eleventh Amendment. Since the Eleventh Amendment prohibited suit against the state in federal court, any form of relief sought against the state as a named defendant was barred.\n\nUnless a State has waived its Eleventh Amendment immunity or Congress has overridden it, . . . a State cannot be sued directly in its own name regardless of the relief sought. Alabama v Pugh. . . . Thus, implementation of state policy or custom may be reached in federal court only because official-capacity actions for prospective relief are not treated as actions against the State. See Ex parte Young. . . . [ Kentucky v Graham, 473 U.S. 159, 167, n 14; 105 S Ct 3099; 87 L Ed 2d 114 (1985). Citations omitted.]\n\nIn Conclusion, an individual may not sue a state as a named defendant in a federal court either for prospective or retroactive relief. A party may institute suit in federal court against a state official in his official capacity for prospective relief, on the basis of a violation of federal law, but the Eleventh Amendment would bar any action seeking retroactive relief. But, see, Pennhurst State School \u0026 Hosp v Halderman, 465 U.S. 89; 104 S Ct 900; 79 L Ed 2d 67 (1984).\n\nBy the same Eleventh Amendment rationale that led us to conclude that a state is not a person and not liable regardless of the forum, we conclude that a state official sued in an official capacity for retroactive relief is not a person under § 1983.\n\nThe case law supports this extension of the distinction between official- and personal-capacity actions to suits in which the Eleventh Amendment does not apply. In Brandon v Holt, 469 U.S. 464; 105 S Ct 873; 83 L Ed 2d 878 (1985), the Supreme Court addressed the liability for damages under § 1983 of a municipal police director sued in his official capacity. In dicta, the Court noted that before Monell, its decision in Monroe precluded suit against a municipal official in his official capacity because Monroe did not recognize municipalities as persons for purposes of suit under § 1983.\n\nIn Monroe v Pape, . . . the Court held that a city was not \"a person\" within the meaning of 42 USC § 1983. That construction of § 1983 protected municipalities from liability in cases of this kind until June 6, 1978, when we decided Monell v New York City Dep't of Social Services. . . . The complaint in this case was filed on February 22, 1978, before Monroe v Pape was overruled; this explains why the city of Memphis was not named as a defendant in this case. The timing of the complaint may also explain why petitioners did not expressly allege at the outset of the litigation that they were suing Chapman in his official capacity as Director of Police of the Memphis Police Department. [ Brandon, supra at 469. Citations omitted, emphasis added.]\n\nSee, also, Nahmod, (supra) , § 6.04, pp 343-344.\n\nThe Court of Appeals decision in Will, however, confused the differences between official- and personal-capacity suits. At first, while discussing the Court of Claims jurisdiction over § 1983 damage actions against state officials, the Court noted that Mr. Will sued the Director of State Police in his official capacity.\n\nmust be noted that plaintiff did not sue the state officials in their individual capacities, so a suit against them in federal court for damages would be barred by the Eleventh Amendment because the state would be the party in fact. [ Will, supra at 220-221. Citations omitted.]\n\nThe Court then concluded that the state was not a person for purposes of § 1983, but at the same time remanded to the trial court the question of the state director's possible immunity from liability for § 1983 damage actions. Since the state and, therefore, the director, sued in his official capacity, is not a person under § 1983, Mr. Will's suit seeking retroactive relief from the state director must fail, and the question of immunity in any form is then irrelevant. As the Supreme Court noted in Kentucky v Graham, supra at 166,\n\n[an official-capacity suit] is not a suit against the official personally, for the real party in interest is the entity. Thus, while an award of damages against an official in his personal capacity can be executed only against the official's personal assets, a plaintiff seeking to recover on a damages judgment in an official-capacity suit must look to the government entity itself.\n\nIn Conclusion, we would reverse the decision of the Court of Appeals in Will allowing suit against the Director of State Police and remanding to the trial court the question of the state director's immunity from liability for § 1983 damage actions.\n\nIV. DOES SMITH'S \"FALSE IMPRISONMENT\" ESCAPE GOVERNMENTAL IMMUNITY?\n\nWe next deal with the issue raised in Smith as to whether an intentional tort, such as false imprisonment, \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e is an exception to governmental immunity either because it is not included within the meaning of the word \"tort\" in § 7 of the governmental immunity act, MCL 691.1401 et seq.; MSA 3.996(101) et seq., or because it is not an exercise of a \"governmental function\" under § 7 of that act. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Section 7 of the governmental immunity act provided:\n\nExcept as in this act otherwise provided, all governmental agencies shall be immune from tort liability in all cases wherein the government agency is engaged in the exercise or discharge of a governmental function. Except as otherwise provided herein, this act shall not be construed as modifying or restricting the immunity of the state from tort liability as it existed heretofore, which immunity is affirmed. [MCL 691.1407; MSA 3.996(107).] \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nA plaintiff must plead facts in his complaint in avoidance of immunity, indicating that the alleged tort falls outside the protection afforded by sovereign or governmental immunity. See Ross v Consumers Power (On Rehearing), 420 Mich 567, 621, n 34; 363 NW2d 641 (1984); Galli v Kirkeby, 398 Mich 527, 532, 540-541; 248 NW2d 149 (1976); McCann v Michigan, 398 Mich 65, 77; 247 NW2d 521 (1976) (opinion of Ryan, J.). \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nThis may be accomplished by stating a claim which fits within one of the statutory exceptions or pleading facts which demonstrate that the tort occurred during the exercise or discharge of a non-governmental or proprietary function. [ Ross, supra at 621, n 34.]\n\nMr. Smith's claim of false imprisonment, however, does not fit within one of the statutory exceptions to the governmental immunity act. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Therefore, the facts of his complaint must demonstrate that the state defendants' actions in falsely imprisoning him did not involve the exercise or discharge of a governmental function unless, of course, there is a specific exemption for an intentional tort.\n\nThe Court of Claims in granting summary judgment for defendant recognized no such exception for an intentional tort, finding that an act \"may be an exercise or discharge of a governmental function even though it amounts to an intentional tort.\" That court further held:\n\nCourt is of the opinion the alleged confinement is protected by governmental immunity. The care, treatment, and custody of Plaintiff, whether as a ward of the state at a state orphanage or mental facility, were governmental functions. The MHTS transfer and confinement of Plaintiff in furtherance of his care and treatment were \"sufficiently related\" to the custodial function of the orphanage or mental facility to be in the exercise or discharge of these governmental functions. . . . There exists no allegation that Plaintiff's confinement resulted from a malicious or improper motive completely unrelated to the treatment and care of Plaintiff. See McCann, supra. Nor does the intentional tort alleged reach the assaultive level of obviously unlawful conduct found in Kriger [ v South Oakland Co Mutual Aid Pact, 399 Mich 835; 250 NW2d 67 (1977), rev'g 49 Mich App 7 (1973)] or Lockaby [ v Wayne Co, 406 Mich 65; 276 NW2d 1 (1979)].\n\nThe Court of Appeals, however, reversed, remanding the false imprisonment claim to the parties for reformulation of their pleadings consistent with its test that unjustified intentional acts did not constitute the exercise or discharge of a governmental function.\n\nThus, whenever a plaintiff in a complaint alleges an intentional tort, a defendant may answer arguing that the allegation should be dismissed due to governmental immunity because the action was justified under the particular facts of the case. If the plaintiff does not contest these facts, the allegation would subsequently be dismissed. However, if the plaintiff does contest the facts underlying the justification, the case would proceed to trial. [ Smith, supra at 346.]\n\nWe agree with the reasoning of the Court of Claims; no intentional tort exception exists, and an act \"may be exercise or discharge of a governmental function even though it results in an intentional tort.\" As will be seen, a majority of this Court has never expressly recognized an intentional tort exception to the governmental immunity act. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e But, in several cases involving intentional torts, the Court has allowed suit to proceed against the state or local agency despite the presence of governmental immunity.\n\nIn McCann v Michigan, supra, the plaintiff, a newspaper publisher, instituted suit against the State of Michigan, its Department of Mental Health, and the Traverse City State Hospital, alleging that hospital officials and employees wilfully and maliciously engaged in a campaign to destroy plaintiff's newspaper business. Plaintiff McCann filed suit for damages against the state in the Court of Claims, alleging various intentional torts, including interference with existing and future economic relations, libel, slander, and defamation. The Court of Claims, however, granted the defendants' motion for summary judgment on the basis of governmental immunity, and the Court of Appeals affirmed. This Court, though issuing four separate opinions, reversed and remanded the case to the Court of Appeals, unanimously agreeing that the activities involved did not constitute the exercise or discharge of a governmental function. However, not one member of the Court rested a decision on an explicit \"intentional tort\" exception to the governmental immunity act. Chief Justice Kavanagh and Justice Levin concluded that the governmental immunity act did not apply because the day-to-day operation of a hospital did not constitute a governmental function.\n\nJustice Williams found that\n\ndefendant state agency's employees were clearly engaged in ultra vires activity and were not, therefore, involved \"in the exercise or discharge of a governmental function.\" [ McCann, supra at 73-74.]\n\nJustice Ryan, using the pre- Ross \"common good of all\" test for determining a governmental function, concluded that Mr. McCann's complaint alleged facts which, if proved, justified the Conclusion that the activities of the state and its agencies did not constitute a governmental function.\n\nFinally, Justices Fitzgerald, Coleman, and Lindemer summarily concluded that the complained-of activity did not involve the exercise or discharge of a governmental function. These three Justices, however, would have remanded the case to the Court of Claims for an entry of dismissal. They concluded that although a court could impose vicarious liability on an employer for the intentional torts of its employees, the facts of the McCann case would not support an imputation of liability to the state or its agencies.\n\nApproximately one month later, this Court decided another intentional tort case, Galli v Kirkeby, supra. Galli involved an action instituted against Arthur Kirkeby, an elementary school principal, Olin Adams, Supervisor of the Warren school system, and the Board of Education of the Warren Consolidated Schools by the parents of a student sexually assaulted on numerous occasions by Kirkeby. Summary judgment was denied, the Court of Appeals denied leave to appeal, and this Court remanded the case to the trial court for further proceedings.\n\nAlthough three opinions were issued, again no Justice found that proof of an intentional tort, in and of itself, removed a state or local agency's immunity under the governmental immunity act. Chief Justice Kavanagh and Justices Levin and Fitzgerald concluded that the day-to-day operation of a school did not constitute the exercise or discharge of a governmental function.\n\nJustices Williams and Ryan argued that the appeal involved questions both of direct liability against the school board for its negligence in screening and supervising personnel and of vicarious liability for its employee's assaults upon a student. By examining the specific activity alleged against the governmental defendant, Justices Williams and Ryan concluded that the trial court erred in refusing to grant the school board's motion for summary judgment on the issue of the board's negligence because the board's actions in screening and supervising its personnel involved the exercise or discharge of a governmental function. But they agreed with the denial of summary judgment as to the board's vicarious liability for the intentional tort because such activity clearly did not constitute a governmental function.\n\ntest of whether a governmental agency can claim immunity under the statute is whether the specific activity alleged against the governmental defendant falls within \"the exercise or discharge of a governmental function.\"\n\nWe first address the question of whether the school board is immune from suit for its own negligence in allegedly failing to exercise due care in the hiring and supervision of Mr. Kirkeby.\n\nWe next consider whether the school board is immune from suit with respect to the alleged tortious activity of its employee. No one will seriously argue that the intentional homosexual assault of a school principal upon a student falls within \"the exercise of a governmental function.\" We hold it does not.\n\nThe intentional homosexual assault of a school principal upon a school boy even on school time and on school property is not the same thing as negligent tunneling in road construction as in Thomas [v Dep't of State Highways, 398 Mich 1; 247 NW2d 530 (1976)]. Rather the facts of this case are clearly analogous in principle to the facts in McCann.\n\nIn both this case and McCann a governmental agency is involved whose normal operation is \"the exercise or discharge of a governmental function.\" However, in both cases an employee of the governmental agency engages intentionally in allegedly tortious action that bears no arguable relationship to the agency's function. [ Galli, supra at 536-538.]\n\nFinally, Justices Coleman and Lindemer Dissented from the result, concluding that the trial court erred in denying defendants' motion for summary judgment on the basis of the governmental immunity act.\n\nThe school board and Mr. Adams at all times were acting within the exercise of their duties. The applicable statute grants immunity to school districts from tort liability in all cases in which it is acting within its governmental function with certain exceptions, none of which apply to these facts. We must not confuse Mr. Kirkeby's personal liability with that of the others. In clear language, the Legislature has spoken. If it finds it better public policy to exclude governmental units from immunity in cases where employees act outside of their scope of employment and commit personal offenses, the Legislature should act accordingly. [ Galli, supra at 545.]\n\nBut, in Lockaby v Wayne Co, 406 Mich 65; 276 NW2d 1 (1979), three members of the Court interpreted McCann, supra, as recognizing an intentional tort exception to the governmental immunity act, claiming such a tort could never constitute a governmental function. The case involved a suit instituted against the Wayne County Sheriff, the Administrator of the Wayne County jail, and various city and county governmental agencies by James Lockaby, who suffered injuries rendering him a quadriplegic while incarcerated in the Wayne County jail and hospitalized at Detroit General Hospital. Mr. Lockaby eventually filed a five-count amended complaint in the Wayne Circuit Court, the dismissal of which formed the basis for his appeal. Only count I of that complaint, alleging \"intentional infliction of injury,\" which was dismissed on the grounds of governmental immunity, is of interest here.\n\nThe Court unanimously agreed to reinstate Mr. Lockaby's claim of intentional infliction of injury, although once again it failed to reach a consensus on the reasons for doing so. Justice Levin, in an opinion joined by Justices Kavanagh and Fitzgerald, concluded that plaintiff's claim of intentional injury survived dismissal on the basis of the governmental immunity act because an intentional tort did not constitute the exercise or discharge of a governmental function.\n\nLockaby also claims that he was intentionally injured by agents of the county. While the county is constitutionally immune from \"\" for the sheriff's \"acts\" that immunity does not extend to the acts of others in its employ. In McCann v Michigan, 398 Mich 65; 247 NW2d 521 (1976), in separate opinions, a majority of the Court agreed that an intentional tort was not in the exercise or discharge of a governmental function; the cause was remanded, as it is here, for further proceedings. [ Lockaby, supra at 77.]\n\nJustice Coleman also agreed to reinstatement of plaintiff's count I, basically referring to Justice Williams' separate opinion for her reasons for doing so.\n\n[Plaintiff's] allegations state a claim in avoidance of governmental immunity against the named defendants. Liberally construed and viewed in the light most favorable to the plaintiff, they make out a possible case of intentionally tortious acts committed by agents of the defendants, thus potentially not within \"the exercise or discharge of a governmental function.\" [ Lockaby, supra at 78.]\n\nJustice Williams concurred in the result reached in Justice Levin's opinion, but clarified his understanding of the Court's decision in McCann, supra. Justice Williams did not interpret McCann as establishing the proposition that governmental agencies that commit intentional torts never enjoy the protection of the governmental immunity act.\n\nAs in Count I, I concur in the result advanced in Justice Levin's opinion but I would add a caveat. Count I is captioned \"Intentional Infliction of Injury.\" The opinion, citing McCann v Michigan, 398 Mich 65; 247 NW2d 521 (1976), states that \"a majority of the Court agreed that an intentional tort was not in the exercise or discharge of a governmental function.\" The statement is not incorrect as explaining the ultimate holding under the facts of McCann, but I do not read McCann as authority for the broad proposition that intended conduct which harms another is never protected by governmental immunity. A tort is a civil wrong and conduct which is wrong within one setting can be permissible within another. For example, a police officer may not intentionally strike a citizen peacefully walking down the street, but his duty may require the police officer to intentionally strike another citizen to prevent him from murdering a third peaceful citizen. Further, McCann clearly sets limits that the conduct must be without and not within the scope of the exercise and discharge of a governmental function. As stated in my sole opinion in McCann, it is the ultra vires activities of public employees which are not protected by the doctrine of governmental immunity.\n\nWhile Count I is not well pleaded with respect to McCann, because I find that ultra vires conduct may be possibly proven, within the inartful language, I concur with Justice Levin that it was erroneously dismissed. [ Lockaby, supra at 82-83.]\n\nFinally, Justice Moody, although voting to reinstate plaintiff's claim for intentional infliction of injury, did not discuss the relevance of the governmental immunity act.\n\nIt would appear from the foregoing that no member of this Court has directly said that there is an intentional tort exception to governmental immunity, as such, although three members in Lockaby said an intentional tort could never involve the exercise or discharge of a governmental function. It would also appear, on reexamination, that contrary to the view of three Justices in Lockaby, a majority of the Court in McCann did not agree \"that an intentional tort was not in the exercise or discharge of a governmental function.\"\n\nSimilarly, the Court of Appeals, in Smith, supra, did not establish a blanket intentional tort exception to the governmental immunity act. Instead, the Court developed a test that turned on whether the governmental agency's intentionally tortious activities were justified under the circumstances of the case. The Court sought a middle ground, attempting to integrate the two basic positions in Lockaby -- Justice Levin's exception for all intentional torts with Justice Williams' Conclusion that only intentional torts that are ultra vires remove a governmental agency's immunity from liability.\n\nThree Justices on the Supreme Court have stated that the government is not immune from an intentional tort. . . .\n\nOn the other hand, three other Justices have held that an intentional tort allegation takes the parties outside governmental immunity only if the intentional tort is ultra vires. . . .\n\nDespite this apparent conflict, we believe that the two views can be reconciled. If a police officer lawfully arrests an individual, he may use reasonable force if that individual resists. . . . Both sides would agree that the police officer is immune by governmental immunity from any suit alleging an intentional tort. However, both sides would also agree that the police officer is not immune if he uses force if the arrestee did not resist or if the officer used unreasonable force.\n\nUnderlying Justice Levin's opinion (in Lockaby) is the argument that the state is never in the business of committing intentional torts. Justice Williams' opinion clearly states a concern that the state not be liable where a public employee is required to commit an intentional tort to carry out his duty to the public. Both views recognize the reasons for governmental immunity and define immunity within its own perception of what the state's duty may entail. Both concerns may be met in a test which grants governmental immunity where the employee's actions were justified under the case's circumstances. Thus, a police officer's \"assault\" on a person attempting murder is justified by the overriding necessity of protecting the potential victim. The officer's duties include this protection and sometimes require extraordinary measures. An attendant at a state mental hospital may be justified in \"assaulting\" a patient where the patient threatens the safety of himself or others but would not be justified in assaulting the same patient where the patient is merely recalcitrant in dressing. Justice Levin's concern that the state not be privileged in abusive behavior does not apply where the circumstances require such extraordinary actions and so justify taking the measures. Likewise, Justice Williams' concern that the state not be punished for acting where it must is also met. [ Smith, supra at 345-346.]\n\nIn order to now decide whether to recognize any form of intentional tort exception to the governmental immunity act, this Court must first determine whether the Legislature intended the term \"tort liability\" in § 7 of the act to exclude intentional torts. We conclude that nothing on the face of the statute indicates an intent to create such an exception.\n\nimmunity from tort liability provided by § 7 is expressed in the broadest possible language -- it extends immunity to all governmental agencies for all tort liability whenever they are engaged in the exercise or discharge of a governmental function. This broad grant of immunity, when coupled with the four narrowly drawn statutory exceptions, suggests that the Legislature intended that the term \"governmental function\" be interpreted in a broad manner. [ Ross, supra at 618. Emphasis added.]\n\nMoreover, as the state defendants aptly note, the Michigan Legislature's response to this Court's decision in Maki v East Tawas, 385 Mich 151; 188 NW2d 593 (1971), indicates that the Legislature intended the immunity conferred by the governmental immunity act to extend to intentionally tortious, as well as negligent, activity.\n\nThe history of the governmental immunities act indicates that the Legislature clearly envisioned that intentional torts would be within the ambit of the immunity conferred by the act. In Maki, . . . this Court examined the governmental immunity act as it then existed. At that time, the operative section of the act, MCL 691.1407; MSA 3.996(107) provided immunity from tort liability. The title of the act, however, referred to immunity from negligence liability. The Court held that the act was unconstitutional as then written because the body of the act, in providing immunity from tort liability, was much broader than the immunity from negligence liability referred to in the title of the act, thus violating Const 1963, art 4, § 24. In the course of its opinion, the Court made the following observation:\n\n\". . . It is apparent from even a cursory examination of any legal encyclopedia or dictionary that an action based on 'negligence' is a species of a generic action based in torts. As the trial Judge pointed out, the headings in Prosser on Torts refer to actions based on nuisance, direct trespass, assault and battery, false arrest, deceit, defamation, abuse or process, malicious prosecution and economic duress -- all of which are tort actions apart from negligence and all of which might be brought against a governmental body.\"\n\nThe types of actions mentioned in the statement of the Court are what are commonly referred to as intentional torts.\n\nFollowing the Court's decision in Maki, the Legislature amended the act, not by changing the language of MCL 691.1407; MSA 3.996(107) to say \"negligence,\" but rather by amending the title of the act by eliminating the reference to \"negligence.\" Therefore, the act, as amended, was intended by the Legislature to cover intentional torts and not to apply solely to negligence actions. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nWe agree and restate, it is hoped in clearer fashion than heretofore, that the Legislature did not intend to exclude intentional torts when committed by governmental agencies in the course of a governmental function. It only remains then to decide if an intentional tort can arise out of the exercise of a governmental function.\n\nIt is obvious, from the review of our struggles with the intentional tort issue and the Court of Appeals attempt in this case to reconcile our efforts, that a clearer standard is needed to decide this issue, as well as to assist the bench and bar. Our previous multiopinion decisions have shown the difficulty of that task. In the McCann, Galli, and Lockaby trilogy, the Court was not so much divided with regard to the answer to the intentional tort question as it was fractionalized with regard to how to pose the question. The analyses behind this trilogy centered on three aspects of the problem. In each case, there were at least two Justices who viewed the governmental mission out of which the activity in question arose as being a non-governmental function, thereby ending their inquiry. This was part of the then-uncertain state of the law as to the meaning of governmental function. In Galli, there was Discussion by several Justices who found the governmental units vicariously liable, even though they were not directly liable, because the employees' tortious acts did not amount to a governmental function. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Finally, there was present in each case Discussion by some Justices as to what level of activity to examine in determining the governmental function question, i.e., the general activity of the unit of government and its programs or the specific conduct that was underway when the alleged tort occurred.\n\nFortunately, since we last visited the intentional tort issue, we have clarified and resolved the first two aspects of the problem. In Ross, we more clearly set forth a criterion for determining what constitutes a governmental function. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e We also, in Ross, definitively established the parameters for vicarious liability. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e What we have not yet definitively decided is at what level of activity -- governmental mission, general activity, or the alleged tortious conduct -- to apply the governmental function test. Only this determination will make it possible to decide if an intentional tort can arise out of an exercise of a governmental function. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nPlaintiff argues that this Court should focus on the specific conduct of the state or its officers, agents, or employees.\n\nIn short, Plaintiff in this case was transferred on the strength of an administrative order while the statutes on the books clearly required a court adjudication and order. The one issuing the order should have known he had no authority to do so, and the ones who physically transferred Plaintiff to the mental institution acted in reliance on an order that was void on its face. It would be a perversion of the English language to say that this transfer, in clear violation of law, was \"authorized by law.\" Because the transfer was not authorized by law, it was ultra vires. And because it was ultra vires, Defendants are not protected by governmental immunity.\n\nState defendants, on the other hand, focus on the general activity engaged in by the state or its officers, agents, or employees at the time the tort occurred.\n\nIn the present case, the activity complained of in Count I of plaintiff's complaint was his confinement by the defendants in state mental institutions. The confinement of individuals in state institutions for the mentally disabled was, during the time of plaintiff's confinement, expressly authorized under the provisions of 1923 PA 151, the predecessor to the present Mental Health Code. Section 1 of that act (formerly MCL 330.11 [MSA 14.801]) provided that the Department of Mental Health and its predecessor agencies shall maintain certain institutions, including a state home and training school to be located at Lapeer, Michigan \"for the humane, scientific, educational and economical treatment\" of mentally handicapped persons, and a hospital at Traverse City, Michigan, for the \"humane, scientific and economical treatment of mentally ill persons. . . .\" The remaining sections of 1923 PA 151 went on to define in more detail the standards for commitment and care of individuals in state institutions.\n\nThere was, therefore, express legislative authorization for the defendants to operate institutions for the mentally disabled and to confine individuals in those institutions. That being the case, the operation of those institutions, including confining people therein, was a governmental function, and the immunity conferred by MCL 691.1407; MSA 3.996(107) clearly applies.\n\nRoss indicates that state defendants have the better argument. First, this Court defined governmental function in that case as \"an activity\" authorized by law. Second, in discussing a governmental agency's vicarious liability, the Court noted:\n\nWhere the individual tortfeasor is acting on behalf of an employer, the focus should be on the activity which the individual was engaged in at the time the tort was committed. [ Id. at 625. Emphasis added.]\n\nThird, although not dispositive, the Court's Discussion of individual immunity later in the Ross opinion indicates that we defined governmental function in terms of the general activity, as opposed to the specific conduct, involved at the time the alleged tort occurred. In distinguishing individual immunity, where governmental function was not a criterion, we said:\n\nTherefore, to determine the existence and scope of the individual's immunity from tort liability in a particular situation, the specific acts complained of, rather than the general nature of the activity, must be examined. [ Id. at 635. Emphasis added.]\n\nMoreover, in applying the principles enunciated in Ross to the nine cases then before it, the Court focused on the activity, not the specific conduct, of the governmental defendants at the time the alleged torts occurred. See, e.g., id. at 638, 640-643, 645-647 (Willis v Dep't of Social Services, Siener v Dep't of Mental Health, and Rocco v Dep't of Mental Health).\n\nFinally, in Ross, immediately after expounding our theory of vicarious liability, we cited Sherbutte v Marine City, 374 Mich 48, 50; 130 NW2d 920 (1964), asserting that a\n\ncity cannot be held vicariously liable for torts of its police officers committed during the course of an arrest because the officers were engaged in police activity, which is a governmental function entitled to immunity. [ Ross, supra at 625.]\n\nTherefore, in Ross, we focused on the general activity, not the specific conduct, involved at the time the alleged tort occurred.\n\nMoreover, the opinion of the federal district court in Smith v Yono, 613 F Supp 50, 53-54 (ED Mich, 1985), provides further support for the general activity standard. In Smith, in a suit against municipal defendants and individual police officers for torts committed during the course of an arrest, the court said:\n\nPlaintiff resists summary judgment in favor of the municipal defendants arguing that the conduct of the individual police officers was nongovernmental. Plaintiff's argument on this point is that the conduct of the officers in using excessive force during the arrest was non-governmental and beyond the scope of immunity protection. This argument must fail, however, as a clear reading of the Ross opinion militates against such an analysis. In Ross, the Michigan Supreme Court focused upon the activity being engaged in at the time the tort was committed to determine the existence of a governmental function. \"However, if the activity in which the tortfeasor was engaged at the time the tort was committed constituted the exercise or discharge of a governmental function (i.e., the activity was expressly or impliedly mandated or authorized by constitution, statute, or other law), the agency is immune pursuant to § 7 of the Governmental Immunity Act.\" Ross v Consumers Power, 420 Mich at 625; 363 NW2d 641 (emphasis supplied). Here, the activity being engaged in by the officers at the time the alleged torts were committed was the arrest of the plaintiff. Thus, as defendants were engaged in police activity at the time the tort was committed, the municipalities are protected by governmental immunity. As such, state law claims against the municipal defendants should be dismissed.\n\nSee also Beasley v East Detroit Police Dep't, 626 F Supp 1251 (ED Mich, 1986).\n\nWe think that to use anything other than the general activity standard would all but subvert the broad governmental immunity intended by the Legislature. As those Justices in Lockaby indicated when they looked only to the tortious act, it would be difficult to envision a tortious act that is a governmental function. The Court of Appeals definition in Smith of a \"justified act\" as the criterion, runs into the same difficulty. Not only is it difficult to envision a justified act as tortious or a tortious act that is justified, but under that standard, a court would be focusing on the nature of the conduct, rather than the function from which it arises.\n\nOn the other hand, a governmental body could intentionally embark on a tortious course of conduct which would abrogate the immunity of its activity, not because it is tortious, but because it is presumably unauthorized by law and, accordingly, not a governmental function. And, of course, a governmental body could be embarked on an activity not authorized by law that is not in and of itself tortious. If, in the course of carrying out such an activity, a tort was committed, even unintentionally, it would not be immune, because the general activity is not a governmental function.\n\nIn more specific terms, if in Smith it was the intent \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e of the defendant mental health department to confine plaintiff, knowing a court order could not be obtained, in order to accomplish illegally what it could not accomplish legally, the activity would be ultra vires and, therefore, a non-governmental function and immunity would be lost. But if, in bypassing the legislatively prescribed procedure for plaintiff's commitment, it was not the intent of the defendant to confine someone who could not properly be confined, but rather the confinement was occasioned by time constraints or a desire to cut costs, it would still be within its governmental purpose, even if it resulted in someone being confined who would not have been confined had the correct procedure been followed. In the first instance, the purpose was to accomplish the commitment of one who was not intended to be committed under the governmental plan, whereas, in the second instance, the purpose was to be about the business of the agency, although there was an intent to cut corners.\n\nThe element of intent, then, is utilized under this standard not to distinguish the nature of the tort, but to distinguish a governmental function from a non-governmental function.\n\nWe conclude this inquiry by finding that intentional torts are immune if committed within the scope of a governmental function; however, the intentional use or misuse of a badge of governmental authority for a purpose unauthorized by law is not the exercise of a governmental function.\n\nIn the case before us, Smith did allege the intentional failure to utilize the proper procedures, but he did not allege it was for a non-governmental purpose. Plaintiff also alleged that it was for the purpose of confining him, but he did not and presumably could not allege that it was not within the scope of the defendant's authority to confine him under proper circumstances. He did not allege that the defendants were pursuing a non-governmental purpose.\n\nOn this issue, the decision of the Court of Appeals should be reversed and the judgment of the Court of Claims granting defendants' motion for summary judgment, reinstated. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nV. MAY PLAINTIFFS RECOVER DAMAGES FOR CONSTITUTIONAL VIOLATIONS?\n\nFinally, we consider whether an implicit right to sue for damages for violations of either the federal or state constitution exists. Both plaintiffs, as well as the amicus curiae, raise this issue, although all three expound different theories of recovery. Since neither Mr. Will's nor amicus curiae's argument is properly before us, we only address the substantive merits of Mr. Smith's claim for damages against the state on the basis of Michigan's 1908 Constitution. We decline to infer any right to sue the state for damages on the basis of violations of art 2, §§ 1 and 16 of the 1908 Constitution.\n\nIn Bivens v Six Unknown Federal Narcotics Agents, 403 U.S. 388; 91 S Ct 1999; 29 L Ed 2d 619 (1971), on remand 456 F2d 1339 (CA 2, 1972), in a 5-1-3 decision, the Supreme Court, for the first time, found an implied right to sue federal officials in federal court for damages on the basis of violations of the federal constitution. The case involved a suit for damages instituted by Webster Bivens against federal narcotics officers on the basis of alleged violations of Mr. Bivens' Fourth Amendment rights. The federal district court dismissed the case on the ground that Mr. Bivens failed to state a cause of action, and the Court of Appeals for the Second Circuit affirmed. The United States Supreme Court reversed, holding that Mr. Bivens could recover monetary damages for any injuries resulting from the violation of his Fourth Amendment rights by federal narcotics officers.\n\nThe Court asserted that a damages remedy for injuries resulting from a violation of the Fourth Amendment by federal officials was not an especially \"surprising proposition.\"\n\nHistorically, damages have been regarded as the ordinary remedy for an invasion of personal interests in liberty. . . . Of course, the Fourth Amendment does not in so many words provide for its enforcement by an award of money damages for the consequences of its violation. But \"it is . . . well settled that where legal rights have been invaded, and a federal statute provides for a general right to sue for such invasion, federal courts may use any available remedy to make good the wrong done.\" [ Bivens, supra at 395-396. Citation omitted.]\n\nThe Court saw no reason to not conclude that Mr. Bivens' complaint stated a cause of action under the Fourth Amendment for which he could recover monetary damage. Even though Congress had not acted to provide such a remedy, the Bivens case did not involve \"special factors counseling hesitation,\" such as questions of federal fiscal policy, requiring greater caution on the part of the Court in inferring a private cause of action. Moreover, Congress had not explicitly prohibited private damage suits against federal officials for violations of the Fourth Amendment. Therefore, the Court concluded that Mr. Bivens could sue for and recover monetary damages for injuries sustained as a result of federal officials' violation of his Fourth Amendment rights.\n\nIn his Concurring opinion, Justice Harlan agreed with the Court's decision to allow Mr. Bivens' recovery of monetary damages for the violation of his Fourth Amendment rights. Although Bivens made out a claim for damages, Justice Harlan noted that the appropriateness of money damages for other constitutionally protected interests might \"well vary with the nature of the personal interest asserted.\" Bivens, supra at 408-409, n 9.\n\nBut three members of the Court, Chief Justice Burger and Justices Black and Blackmun, Dissented. Although authoring separate opinions, all Dissented on similar grounds: the Court should leave to Congress the creation of private causes of action under the constitution. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nThere can be no doubt that Congress could create a federal cause of action for damages for an unreasonable search in violation of the Fourth Amendment. Although Congress has created such a federal cause of action against state officials acting under color of state law [(§ 1983)], it has never created such a cause of action against federal officials. If it wanted to do so, Congress could, of course, create a remedy against federal officials who violate the Fourth Amendment in the performance of their duties. But the point of this case and the fatal weakness in the Court's judgment is that neither Congress nor the State of New York has enacted legislation creating such a right of action. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e [ Bivens, supra at 427-428 (Black, J., Dissenting).]\n\nTherefore, Justice Black viewed either the Congress or the state legislatures as the appropriate fora for resolving the complex policy questions involved in deciding whether to create a private cause of action for damages under the federal constitution.\n\nIn Davis v Passman, 442 U.S. 228; 99 S Ct 2264; 60 L Ed 2d 846 (1979), in a 5 to 4 decision, the Supreme Court extended the rationale of Bivens, recognizing an implicit right to sue federal officials for damages for violations of the Fifth Amendment's Due Process Clause. The case involved a lawsuit instituted by Shirley Davis against her employer, United States Congressman Otto E. Passman, for damages on the basis of sexual discrimination in violation of the Fifth Amendment. The Fifth Circuit Court of Appeals, sitting en banc, concluded that no cause of action under the Due Process Clause of the Fifth Amendment could be inferred to exist on the basis of the criteria established in Cort v Ash, 422 U.S. 66; 95 S Ct 2080; 45 L Ed 2d 26 (1975), for determining whether to infer a cause of action under a federal statute. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e The Supreme Court reversed the Court of Appeals decision, holding that Ms. Davis had a cause of action under the Fifth Amendment and could recover money damages for any injuries resulting from the violation of her Fifth Amendment rights.\n\nIn its opinion, the Court distinguished between the concepts of \"cause of action\" and \"relief\" awarded.\n\nof action is a question of whether a particular plaintiff is a member of the class of litigants that may, as a matter of law, appropriately invoke the power of the court; and relief is a question of the various remedies a federal court may make available. [ Davis, supra at 240, n 18.]\n\nThe Court first concluded that Ms. Davis had a cause of action under the Fifth Amendment. The Court asserted that the Court of Appeals erred in basing its analysis of a constitutional cause of action on the factors enunciated in Cort v Ash for determining whether to infer a cause of action under a federal statute. The Supreme Court noted that such a statutory inquiry differed fundamentally from an inquiry into whether to infer a cause of action under the federal constitution.\n\nBut though the Court recognized that Ms. Davis had a cause of action under the Fifth Amendment Due Process Clause, it still needed to address the propriety of awarding money damages. The Court provided four reasons for endorsing the notion of monetary awards for injuries resulting from violations of the Fifth Amendment Due Process Clause. First, absent an award of damages, Ms. Davis' injury would go unredressed. Since her case did not present complicated questions of valuation or causation, a court could easily determine an appropriate amount of damages to remedy the violation of her federal constitutional rights.\n\nSecond, unless the Speech and Debate Clause protected Congressman Passman's actions, the Court concluded that no \"special factors counseling hesitation\" precluded an award of damages.\n\nThird, no congressional enactment prohibited persons in Ms. Davis' position from recovering monetary awards for the violation of their rights under the Fifth Amendment Due Process Clause. Absent explicit congressional language precluding persons in Ms. Davis' position from instituting private damage suits in federal court, the Court concluded that Ms. Davis could pursue monetary relief for Congressman Passman's unconstitutional federal employment discrimination.\n\nFourth, the Court did not seem exceedingly concerned that recognition of an implicit right to sue for damages pursuant to the Fifth Amendment Due Process Clause would deluge the federal courts with claims. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e But even recognizing the possibility of such a problem, the Court concluded that this did not warrant automatic preclusion of a damages remedy. In short, the Court saw no reason to not allow recovery of damages in a federal court suit for violations of Ms. Davis' rights under the Due Process Clause of the Fifth Amendment.\n\nThen in Carlson v Green, 446 U.S. 14; 100 S Ct 1468; 64 L Ed 2d 15 (1980), in a 5-2-2 decision, the Supreme Court recognized an implicit right to sue for damages under the Eighth Amendment, despite the presence of a statutory cause of action under the Federal Tort Claims Act (FTCA), 28 USC 2671. In Carlson, the mother of Joseph Jones instituted suit against federal prison officials claiming that their inattention to, and inadequate treatment of, Mr. Jones' asthma condition caused his death, thus violating his Eighth Amendment rights.\n\nThe Court began its analysis with a recapitulation of the principles enunciated in Bivens, supra.\n\nBivens established that the victims of a constitutional violation by a federal agent have a right to recover damages against the official in federal court despite the absence of any statute conferring such a right. Such a cause of action may be defeated in a particular case, however, in two situations. The first is when defendants demonstrate \"special factors counseling hesitation in the absence of affirmative action by Congress.\" . . . The second is when defendants show that Congress has provided an alternative remedy which it explicitly declared to be a substitute for recovery directly under the Constitution and viewed as equally effective. [ Carlson, supra at 18-19.]\n\nBut, no special factors, such as the Court's reluctance to intrude upon activities accorded constitutional status, indicated that the Court should move with caution in recognizing an implicit right to sue for damages under the Eighth Amendment. After all, the federal officials involved did not enjoy the protection of constitutional provisions such as the Speech and Debate Clause as alleged in Davis, supra. Moreover, the qualified immunity accorded such officials in Butz v Economou, 438 U.S. 478; 98 S Ct 2894; 57 L Ed 2d 895 (1978), on remand 466 F Supp 1351 (SD NY, 1979), provided sufficient protection to prevent officials from feeling inhibited in the discharge of their duties.\n\nIn addition, although Ms. Green could sue for damages for her son's death pursuant to the FTCA, nothing in the statutory language or the legislative history of the act indicated an intent on the part of Congress to make the FTCA an exclusive remedy. The Court focused its inquiry on whether Congress intended the FTCA to replace, rather than complement, a Bivens remedy. The Court concluded that Congress intended the FTCA and Bivens to serve as \"parallel, complementary causes of action.\"\n\nMoreover, the Court noted four additional factors, suggesting that a Bivens action was a more effective remedy than a suit pursuant to the FTCA. The Court found that these factors further supported its Conclusion that Congress did not intend to limit persons like Ms. Green to relief under the FTCA. First, since a Bivens action operated against individual federal officials and not the federal government as an entity, it effectively deterred tortious activity. After all, the threat of individual liability provided a greater incentive to individual officials to act responsibly. Second, while the FTCA prohibited an award of punitive damages, the case law suggested that an aggrieved plaintiff could recover punitive damages in a Bivens action. Third, in a Bivens action, an aggrieved plaintiff could request a trial by jury, but could not do so when suing under the FTCA. Finally, under the FTCA, liability of the United States turned on the laws of the state in which the tortious activity occurred. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The Bivens action labored under no such restriction. As a result, recognition of a Bivens action for Eighth Amendment violations actually promoted a more uniform system of liability for federal officials. Therefore, the Court concluded that the\n\nFTCA not a sufficient protector of the citizens' constitutional rights, and without a clear congressional mandate [the Court could not] hold that Congress relegated [Ms. Green] exclusively to the FTCA remedy. [ Carlson, supra at 23.]\n\nIn a lengthy critique of the Bivens decision, Justice Rehnquist Dissented from the Court's opinion in Carlson. He argued that the constitution did not confer on the judiciary the power to create private damage remedies under specific constitutional provisions and prohibitions; only the legislature possessed that authority.\n\nis obvious that when Congress has wished to authorize federal courts to grant damages relief, it has known how to do so and has done so expressly. For example, in 42 USC § 1983 Congress explicitly provided for federal courts to award damages against state officials who violate an individual's constitutional rights. With respect to federal officials, however, it has never provided for these types of damages awards. Rather, it chose a different route in 1974 by eliminating the immunity of federal officials under the FTCA. [ Carlson, supra at 40-41.]\n\nSee n 24. Therefore, according to Justice Rehnquist, absent congressional authorization, the courts could not award monetary relief to plaintiffs aggrieved by violations of their federal constitutional rights.\n\nBut in two cases, decided in 1983, Chappell v Wallace, 462 U.S. 296; 103 S Ct 2362; 76 L Ed 2d 586 (1983), and Bush v Lucas, 462 U.S. 367; 103 S Ct 2404; 76 L Ed 2d 648 (1983), the Supreme Court apparently curtailed the scope of its earlier opinions in Bivens, Davis, and Carlson.\n\nIn these two newest cases, Chappell v Wallace and Bush v Lucas, the Supreme Court substantially raised the barriers to federal court recognition of certain causes of action for money damages arising directly under the Constitution. The Court did so without acknowledging that this was the purpose or effect of its line of reasoning, and without proffering any cogent explanation or justification for this change in the law. [Steinman, Backing off Bivens and the ramifications of this retreat for the vindication of First Amendment rights, 83 Mich L R 269 (1984).]\n\nChappell involved Navy enlisted men who instituted a suit for damages against certain of their commanding officers for alleged racial discrimination in violation of rights guaranteed under the federal constitution. The Court rested its decision not to create a Bivens -style remedy on the presence of two \"special factors counseling hesitation.\" First, the Court called attention to the unique relationship between a soldier and his commanding officer and the distinctive demands of military discipline. Second, the Court took note of US Const, art I, § 8, explicitly granting Congress plenary authority over the military, and Congress' exercise of that authority in establishing a \"comprehensive internal system of Justice to regulate military life.\" The Court concluded that, taken together, these two factors made it \"inappropriate to provide enlisted military personnel a Bivens -type remedy against their superior officers.\" Chappell, supra at 302, 304 (citation omitted).\n\nBut the Court's Discussion of the second factor counseling hesitation indicated a retreat from the broad remedial scope of its earlier opinions in Bivens, Davis, and Carlson. See Steinman, (supra) at 285-291; see also Note, Two approaches to determine whether an implied cause of action under the constitution is necessary: The changing scope of the Bivens action, 19 Ga L R 683 (1985) (hereinafter cited as Two approaches). To begin with, the Court noted that Congress provided aggrieved military personnel with relief alternative to a Bivens -style remedy. But, in examining the congressional remedies provided, the Court failed to apply Carlson's test of an equally effective alternative remedy explicitly created by Congress as a substitute for Bivens relief. Moreover, in both Bivens and Carlson, the Court indicated that the provision of an \"equally effective alternative remedy\" and \"special factors counseling hesitation\" served as two distinct reasons for not creating a Bivens -style remedy. In Chappell, the Court used the existence of alternative remedies as a special factor counseling hesitation, thus blurring the distinction between the two.\n\nAlthough it is unclear what special factors counsel hesitation, it should at least be clear that the existence of a legislative remedial scheme is not one such factor -- for the existence of such legislation is the subject of the one other situation expressly postulated as defeating the implication of a Bivens remedy. In Carlson, the Court had specified just what sort of congressional action would defeat a Bivens claim. Not any relevant legislation would do, only legislation providing a cause of action that is explicitly declared to be a substitute for, and in Congress' view is as effective as, a Bivens remedy. In Chappell, the Court retreated from the promise of Bivens and its progeny by failing to require of Congress what it had repeatedly indicated it would require before a Bivens claim would be defeated on the basis of congressional action. The Court utterly failed to acknowledge or defend this retreat. [Steinman, (supra) at 290.]\n\nThus, without acknowledging it, the Court, in Chappell, made the inference of a Bivens -style remedy more difficult. See Two approaches, supra at 685-686.\n\nThe Court continued this \"trend\" in Bush. In Bush, a NASA aerospace engineer sued the director of the space center at which he was employed for damages on the basis of alleged violations of his First Amendment rights. Despite the fact that Congress provided a \"less than complete remedy\" for the wrong suffered, the Court declined to create a Bivens -style remedy for Mr. Bush.\n\nThe Court seemed to give special deference to Congress' ability to balance the policy considerations relevant to a determination of whether to create a remedy for a harm suffered. The Court noted that Congress had carefully balanced the conflicting policy considerations in creating an elaborate and comprehensive set of remedies for those persons in the federal civil service like Mr. Bush. The Court found that the question whether to augment a remedial scheme carefully constructed by Congress did not turn merely on a determination that existing remedies failed to provide complete relief. Instead, the Court asserted that the decision to create a Bivens -style remedy in these circumstances hinged on a careful evaluation of the relevant policy considerations. In the end, the Court deferred to Congress' superior expertise,\n\nconvinced that Congress in a better position to decide whether or not the public interest would be served by creating [a Bivens -style remedy in this case]. [ Bush, supra at 390.]\n\nAs in Chappell, the Court in Bush apparently retreated from the broad remedial stance taken in the earlier Bivens, Davis, and Carlson cases. To begin with, the Court once again failed to examine the civil service remedial scheme in Bush in light of Carlson's test of an \"equally effective alternative remedy.\" Moreover, the Court seemed to avoid the question whether it should create a right to sue for damages, by claiming that Congress possessed superior expertise in balancing the policy considerations relevant to the decision whether to create a Bivens -style remedy.\n\nBush is troublesome because the Court seems to have abdicated its responsibility to decide whether a remedy should be implied from the first amendment under the circumstances presented. It said that that decision should be made in light of a broad range of policy considerations and any special factors counseling hesitation. But in the very course of deciding whether Congress' role in federal personnel matters constituted such a \"special factor,\" the Court seemed, unconsciously, to shift its attention to whether a damage remedy should exist. It decided that Congress was better able than a court to decide that question. If so here, why not always, given Congress' ubiquitous ability to inform itself through fact-finding procedures not available to the courts? What has become of the once clearly discernible message of the Constitution that the judiciary should be the primary means through which constitutional rights are enforced? In its ostensibly \"conservative\" desire to defer to Congress on all remedial matters, the Court abdicated its responsibility. [Steinman, (supra) at 295-296. Emphasis in original.]\n\nThus, both Chappell and Bush signal a retrenchment from the broad remedial scope evident in the Court's earlier Bivens, Davis, and Carlson opinions. Both Chappell and Bush suggest greater caution and increased willingness on the part of the Court to defer to Congress on the question whether to create damages remedies for violations of the federal constitution.\n\nA. SMITH\n\nPlaintiff Smith argues that we should create a Bivens -style remedy for violations by state entities of the Equal Protection and Due Process Clauses of Michigan's 1908 Constitution. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Although Mr. Smith preserved this issue for appeal, we decline to recognize such a remedy for the violation of these provisions of the 1908 Constitution.\n\nMr. Smith claims that state defendants violated his constitutional rights under both state constitutions spanning his nearly fifty-year confinement, including but not limited to art 2, §§ 1 and 16 of the 1908 Constitution. Article 2, § 1 provided:\n\nAll political power is inherent in the people. Government is instituted for their equal benefit, security and protection.\n\nArticle 2, § 16 provided as follows:\n\nNo person shall be compelled in any criminal case to be a witness against himself, nor be deprived of life, liberty or property, without due process of law.\n\nWe deal here only with plaintiff's claims for damages on the basis of violations of Const 1908, art 2, §§ 1 and 16. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Plaintiff avers in his complaint the violation of constitutional rights including, but not limited to, art 2, §§ 1 and 16. But he provides this Court with no indication of what other rights the state violated, besides his right to equal protection and due process of the law, which art 2, §§ 1 and 16, respectively, guarantee.\n\nSince plaintiff specifically pled the violation of art 2, §§ 1 and 16 of the 1908 Constitution, we only address the question whether to infer a right to sue for damages from these two state constitutional provisions. See n 29.\n\nPlaintiff argues that Michigan has long recognized the propriety of awarding damages for a violation of the Taking Clause of the state constitution. Although he acknowledges that the Taking Clause, Const 1963, art 10, § 2; Const 1908, art 13, §§ 1-5, expressly provides for damages, plaintiff argues that the logic of the Supreme Court's decision in Bivens warrants recognition of an implicit right to recover damages for the violation of state constitutional rights by state agencies. We disagree.\n\nFirst, neither the United States Supreme Court nor the Sixth Circuit Court of Appeals has expressly recognized a right to recover damages for constitutional violations by state agencies. In Bivens, Davis, and Carlson, the Supreme Court recognized an implicit cause of action for violations of the federal constitution by federal officials, not federal or state governmental agencies. In addition, although the Sixth Circuit has recognized a Bivens -style remedy for violations by federal officials of a plaintiff's First Amendment rights, Yiamouyiannis v Chemical Abstracts Service, 521 F2d 1392 (CA 6, 1975), later app 578 F2d 164 (CA 6, 1978), cert den 439 U.S. 983 (1978), and Fifth Amendment rights, Hall v United States, 704 F2d 246 (CA 6, 1983), cert den 464 U.S. 1002 (1983), the Court of Appeals has never expressly extended the logic of the Bivens line of cases to allow the recovery of damages from state agencies for violations of a plaintiff's constitutional rights. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nMoreover, the Supreme Court has never extended the reasoning of Bivens to violations of the Fourteenth Amendment, and, as Justice Harlan noted in his concurrence in Bivens, the appropriateness of money damages for other types of constitutionally protected interests might \"well vary with the nature of the personal interest asserted.\" We note that the rights asserted by plaintiff are very similar to those protected by the Fourteenth Amendment.\n\n[After all,] Court has held numerous times that the Michigan Const 1908, art 2, § 1, secures the same right of equal protection as does its counterpart in the Constitution of the United States. Gauthier v Campbell, Wyant \u0026 Cannon Foundry Co, 360 Mich 510, 514 [104 NW2d 182 (1960)] and cases therein cited. [ Fox v Employment Security Comm, 379 Mich 579, 588; 153 NW2d 644 (1967).]\n\nSee also Baldwin v North Shore Estates Ass'n, 384 Mich 42, 50-51; 179 NW2d 398 (1970).\n\nThe Supreme Court's analysis of whether to recognize a Bivens -style remedy for violations of the Fourteenth Amendment proves persuasive in our Disposition of whether to recognize a right to recover damages for violations of Const 1908, art 2, § 1. The question whether to recognize a Bivens -style remedy for violations of the Fourteenth Amendment of the federal constitution confronted the Supreme Court in Mt Healthy Bd of Ed v Doyle, 429 U.S. 274; 97 S Ct 568; 50 L Ed 2d 471 (1977). Although presented with this issue in Mt Healthy, a pre- Monell decision, the Court left unanswered the question whether to infer a right to sue for damages for violations of the Fourteenth Amendment by a municipal school board.\n\nThe question of whether the Board's arguments [that the federal court lacked jurisdiction of Mr. Doyle's claim pursuant to 28 USC 1331 because the board was not a \"person\" for purposes of § 1983] should prevail, or whether as respondent urged in oral argument, we should, by analogy to our decision in Bivens. . . imply a cause of action directly from the Fourteenth Amendment which would not be subject to the limitations contained in § 1983, is one which has never been decided by this Court. Counsel for respondent at oral argument suggested that it is an extremely important question and one which should not be decided on this record. We agree with respondent. [ Mt Healthy, supra at 278. Citation omitted.]\n\nTherefore, the Supreme Court's hesitation to recognize a Bivens -style remedy for violations of the Fourteenth Amendment of the federal constitution suggests caution in recognizing such a novel theory of recovery in our jurisprudence.\n\nSecond, allowing suits for damages against state agencies for violations of the state constitution does not further the goal of deterrence underlying a Bivens -style action. In Carlson, supra, the Supreme Court noted that a Bivens remedy not only compensated victims, but also acted as a deterrent to unconstitutional activity by federal officials. See ante, p 620. However, making governmental bodies, as opposed to individual officials, liable for damages for constitutional violations lessens the deterrent effect of a Bivens -style remedy.\n\nShifting liability to the government, or some unit thereof, might well increase the chances of actual recovery by a plaintiff who won a judgment, as the United States is much less likely to be judgment-proof than is an individual. But it is by no means certain that the goal of deterring violations of constitutional rights would be better served by such a shift. The notion that deterrence would be promoted by the shift to government liability is counterintuitive. See, e.g., Carlson v Green, 446 U.S. 14, 21 (1980). Moreover, many factors other than a government unit's vulnerability to money judgments for the unconstitutional activities of its agents affect how well the unit will train its personnel to respect the constitutional rights of its own members and of the public it serves. See, e.g., P. Schuck, [Suing Government (New Haven: Yale University Press, 1983)], at 105-08. And there are influences on individual agents other than the values inculcated by the agencies that employ them. Nor is it certain that vigorous decisionmaking, of a desirable sort, would be enhanced by a shift of liability to the government. A government agency's self-protective tendencies could cause it to inculcate a cautiousness that would be worse than the individually evolved self-protective tendencies which concern Schuck. New or different sanctions available against individual officials could keep them timid. Even if decision-making were to be invigorated by a shift to government liability, that might well occur only at the cost of increased and increasingly serious violations of constitutional rights. Still another factor is that the shift to government liability would frustrate whatever desire victims have for personalized retribution. [Steinman, (supra) at 280-281, n 69.]\n\nThird, the Bivens line of cases indicates a balance between the competing values of fully compensating victims for violations of their constitutional rights and deferring to the policymaking expertise of the legislative branch. The Supreme Court's most recent decisions in Chappell and Bush, however, indicate a shift towards greater deference to the Legislature's ability to balance conflicting policy considerations. See Two approaches, supra at 686. Moreover, the Court has apparently abandoned its stringent \"equally effective alternative remedy\" test from Carlson, allowing courts to consider the existence of alternative remedies as \"special factors counseling hesitation.\" See ante, p 623. In essence, the Court has made the recognition of Bivens -style remedies more difficult while showing greater deference to the policymaking expertise of the Legislature.\n\nFinally, the unusual factual circumstances of this case suggest consideration of the \"special factors counseling hesitation\" factor. To begin with, although the 1908 Constitution no longer exists, plaintiff wants us to create, in essence, a special remedy effectively applicable only to the facts of his case. Moreover, those sections of the 1963 Constitution, comparable to the provisions of the 1908 Constitution under which plaintiff sued, indicate that we should defer to the Legislature the question whether to create a damages remedy for violations of a plaintiff's rights to due process or equal protection. For example, the Equal Protection Clause of the 1963 Constitution (art 1, § 2) leaves its implementation to the Legislature.\n\n[Under art 1, § 2] the legislature is empowered to create and define the \"civil rights\" that it feels are deserving of protection. The nature and scope of these rights, and the remedies available for their violation, are left to legislative judgment. [Cramton, The powers of the Michigan Civil Rights Commission, 63 Mich L R 5, 13 (1964). Emphasis added.]\n\nThus, the Equal Protection Clause of the 1963 Constitution requires the Legislature to create the rights and remedies available under Const 1963, art 1, § 2.\n\nThus, for this Court to accept the plaintiff's invitation to adopt and even extend the Bivens rationale, for one person on the basis of a constitution no longer in existence, would not be prudent. We decline to create such a novel remedy as the right to sue the state for damages for violations of the state constitution. We defer to the Legislature's unique capacity to weigh the competing policy considerations implicated in creating such a damages remedy. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Therefore, we would reverse the Court of Appeals affirmance of the Court of Claims denial of defendants' motion for summary judgment on plaintiff's Michigan constitutional claim.\n\nB. Will\n\nNext, Mr. Will argues that we should award him damages for the violation, by the Department of State Police, of the following rights under the Michigan Constitution: (1) the right to promotion based on merit, art 11, § 5; (2) the right to the equal protection of the laws, art 1, § 2; and (3) the right to due process of law, art 1, § 17. Mr. Will, however, bases his theory of recovery not on an analogy to the Bivens line of cases, but on the existence of a \"cumulative judicial remedy\" \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e to recover compensation for civil rights violations. We do not consider the merits of Mr. Will's argument, however, because he failed to preserve his claim for appeal. Thus, his Michigan constitutional claim is not properly before us. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nIn order to understand the lack of preservation, a brief recapitulation of the procedural history is necessary. Plaintiff's January, 1978, complaint in Ingham Circuit Court consisted of the following three counts: (1) count I, alleging, inter alia, denial of due process of law as a result of the Civil Service Commission denying plaintiff a grievance hearing, (2) count II, asserting a claim pursuant to § 1983, and (3) count III, asserting a claim for damages on the basis of alleged violations of the Michigan Constitution. In June of 1978, the Ingham Circuit Court remanded Mr. Will's case to the CSC for a fourth-step grievance hearing. The circuit court retained jurisdiction to hear any appeals from the administrative hearing decision. Then, in November of 1978, plaintiff filed a complaint in the Court of Claims. That complaint consisted of the following two counts: (1) count I, asserting a claim pursuant to § 1983 (count II in the Ingham Circuit Court), and (2) count II, asserting a claim for damages pursuant to the Michigan Constitution (count III in the Ingham Circuit Court).\n\nIn an opinion dated May 7, 1979, the Court of Claims dismissed plaintiff's Michigan constitutional claim, stating that plaintiff had not exhausted his administrative remedies and that plaintiff could appeal in the Ingham Circuit Court at the Conclusion of the administrative proceedings; that dismissal was not appealed. Therefore, when the Court of Claims, in the same opinion, granted plaintiff's motion to consolidate the Ingham Circuit Court and Court of Claims actions, only plaintiff's § 1983 claims were consolidated. In June of 1980, the grievance hearing officer ruled in plaintiff's favor, finding a violation of Const 1963, art 11, § 5, and the CSC affirmed the decision. Since plaintiff never appealed this decision in the Ingham Circuit Court, and neither appealed the Court of Claims dismissal of his Michigan constitutional claim nor sought reinstatement of that claim, his claim for relief on the basis of the Michigan Constitution expired.\n\nAs state defendants aptly note:\n\nMr. Will argues that the Court of Claims and the Court of Appeals should have found that the state was liable for violations of Const 1963, art 1, §§ 2 and 17, and art 11, § 5. Mr. Will made these allegations in his original Court of Claims Count II that was dismissed on July 10, 1979. Mr. Will never once moved under GCR 1963, 118.3 to amend to conform to the \"proofs.\" Nor did Mr. Will ever seek to have the Court of Claims reinstate his original Count II. Nor did Mr. Will ever seek leave to appeal the dismissal of his original Count II in the Court of Claims. Nor did Mr. Will ever appeal by right the dismissal of his original Count II in the Court of Claims.\n\nMr. Will argues that because he made an argument to the Circuit Court in relation to Circuit Court Count III concerning an alleged deprivation of rights under the Michigan Constitution, the Circuit Court argument automatically applied to Count II of the Court of Claims Complaint that had been dismissed two years earlier, and for which Mr. Will never made any motion to reinstate.\n\nMr. Will never appealed the Final Judgment of the Circuit Court to the Court of Appeals, and Circuit Court matters are not before this Supreme Court.\n\nBoth the Court of Claims opinion of May 7, 1979, and the subsequent order of July 11, 1979, informed plaintiff that the Court had dismissed his claim on the basis of the Michigan Constitution and that any appeal lay with the circuit court at the Conclusion of the administrative proceedings then pending.\n\nPlaintiff has not yet exhausted his administrative remedies. A grievance proceeding has been ordered and is in the process of being organized. At the Conclusion of the administrative proceedings, plaintiff may appeal to the Circuit Court of Ingham County. An action at this time in the Court of Claims is improper and accelerated judgment as to Count II [Michigan constitutional claim] is hereby granted.\n\nObviously, when the Court in the same May 7, 1979, opinion granted plaintiff's motion to consolidate the Circuit Court and Court of Claims actions, the understanding was that only the plaintiff's § 1983 claims remained for consolidation. A subsequent opinion of the Court of Claims made clear this understanding. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nIn Conclusion, we find that Will failed to preserve his constitutional claim for appeal. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nVI. CONCLUSION\n\nFirst, we would hold that the term \"person\" under § 1983 does not include states. Thus, we would affirm the decision of the Court of Appeals in Will, and reverse the decision of the Court of Appeals in Smith.\n\nSecond, we would hold that a state official, sued in his official capacity for retroactive relief, is not a person for purposes of suit under § 1983. Thus, we would reverse the decision of the Court of Appeals in Will on this issue.\n\nThird, we would hold that no intentional tort exception to the governmental immunity act exists, and that an intentional tort arising out of a governmental function is immune. Thus, we would reverse the decision of the Court of Appeals in Smith and reinstate the Court of Claims grant of defendants' motion for summary judgment.\n\nFinally, we would find that there is no implicit right to sue the state for damages on the basis of violations of Const 1908, art 2, §§ 1 and 16. Thus, in Smith, we would reverse the Court of Appeals affirmance of the Court of Claims denial of defendants' motion for summary judgment on this issue.\n\nBoyle, J. (concurring in part and Dissenting in part).\n\nWe concur with Justice Brickley's Conclusion that the state is not a \"person\" for purposes of 42 USC 1983, that a state officer sued in an official capacity is not a \"person\" for purposes of a damage suit under 42 USC 1983, that the allegation of a common-law intentional tort does not avoid statutory immunity per se, and that Mr. Will's damage claim under the Michigan Constitution has been waived. However, we write separately to state our view that an allegation of a state constitutional tort1a perpetrated by virtue of a state custom or policy avoids the strictures of statutory governmental immunity. We would remand Smith v Dep't of Public Health to the Court of Claims for further proceedings.\n\nI\n\nSince this case involves appeals of rulings on summary judgment motions, the factual record is necessarily sparse. However, the basic contours of the factual background follow.\n\nOn February 12, 1925, Jack Smith was born in the Traverse City State Mental Hospital, to which his mother had been committed two days earlier. Mrs. Smith died a few hours after Jack Smith's birth. In June, 1925, Jack was transferred to the state orphanage in Coldwater, the Coldwater State Public School. In September, 1926, when Jack was about nineteen months old, the superintendent of the orphanage decided that Jack was \"feeble-minded\" and sought Jack's transfer to an institution for the retarded, the Michigan Home and Training School in Lapeer. This transfer was made in November, 1926, without a court order authorizing Jack's commitment to the Lapeer institution. One of plaintiff's allegations is that Jack was in fact of normal intelligence at the time of this allegedly invalid commitment.\n\nDuring the next eleven years, Jack Smith lived at the Michigan Home in Lapeer. In October of 1937, Jack Smith was formally committed to the Lapeer institution. He remained at the Michigan Home in Lapeer until 1964, when he was diagnosed as a paranoid schizophrenic and transferred to the Traverse City State Hospital, the place of his birth. He remained in the mental hospital for nine years, until his release in May, 1973. He lived in foster care homes from 1973 until his death in February, 1984, during the pendency of this litigation.\n\nCount III of plaintiff's Court of Claims complaint alleges that Jack Smith was not retarded at birth, but that he became retarded as a result of his improper or illegal institutionalization as a young child. Plaintiff's amended complaint also alleges an equal protection violation under the 1908 Constitution.\n\nThe defendant moved for summary judgment on the basis that the state is immune from liability for plaintiff's injuries. The Court of Claims found governmental immunity inapplicable to the constitutional tort allegations of count III. We agree and would remand count III to the Court of Claims for further proceedings.\n\nII\n\nMCL 691.1407; MSA 3.996(107) provides:\n\nExcept as otherwise provided in this act, all governmental agencies shall be immune from tort liability in all cases wherein the government agency is engaged in the exercise or discharge of a governmental function. Except as otherwise provided in this act, this act shall not be construed as modifying or restricting the immunity of the state from tort liability as it existed before July 1, 1965, which immunity is affirmed.\n\nThe plaintiff argues that this statute does not immunize the state from liability for its unconstitutional acts; the defendant counters that plaintiff has merely alleged torts, not constitutional violations, and that MCL 691.1407; MSA 3.996(107) clearly covers tortious behavior. Defendant fails to argue that, assuming a constitutional violation has been alleged, statutory immunity bars recovery.\n\nAssuming the plaintiff proves an unconstitutional act by the state which is otherwise appropriate for a damage remedy, the question which confronts this Court is whether sovereign or governmental immunity shields the state from liability for damages for its alleged acts which violate our state constitution. We would hold that neither common-law sovereign immunity nor the governmental immunity found in MCL 691.1407; MSA 3.996(107) bars recovery.\n\nIn our constitutional form of government, the sovereign power is in the people, and \" Constitution is made for the people and by the people.\" Michigan Farm Bureau v Secretary of State, 379 Mich 387, 391; 151 NW2d 797 (1967) (quoting Cooley, Constitutional Limitations [6th ed], p 81). The Michigan Constitution is a limitation on the plenary power of government, and its provisions are paramount. See, generally, Dearborn Twp v Dearborn Twp Clerk, 334 Mich 673, 688; 55 NW2d 201 (1952). It is so basic as to require no citation that the constitution is the fundamental law to which all other laws must conform. All state public officers, legislative, executive, and judicial, are required by Const 1963, art 11, § 1, to swear or affirm to support that same document.2a\n\nIn light of the preeminence of the constitution, statutes which conflict with it must fall. A basic rule of constitutional interpretation is that \"wherever possible an interpretation that does not create constitutional invalidity is preferred to one that does.\" Traverse City School Dist v Attorney General, 384 Mich 390, 406; 185 NW2d 9 (1971). Thus, interpretations which avoid confrontations between statutes and the constitution are generally favored.\n\nMCL 691.1407; MSA 3.996(107) does not, by its terms, declare immunity for unconstitutional acts by the state. The idea that our Legislature would indirectly seek to \"approve\" acts by the state which violate the state constitution by cloaking such behavior with statutory immunity is too far-fetched to infer from the language of MCL 691.1407; MSA 3.996(107). We would not ascribe such a result to our Legislature.\n\nNeither does common-law sovereign immunity immunize the state from liability for its alleged unconstitutional acts. This Court abrogated common-law sovereign immunity in Pittman v City of Taylor, 398 Mich 41; 247 NW2d 512 (1976). Even absent such general abrogation, however, we would decline to apply sovereign immunity to violations by the state of our state constitution. The curious doctrine of sovereign immunity in America, subject to great criticism over the years, see, generally, Jaffe, Suits against governments and officers: Sovereign immunity, 77 Harv L R 1 (1963), should, as a matter of public policy, lose its vitality when faced with unconstitutional acts of the state. The primacy of the state constitution would perforce eclipse the vitality of a claim of common-law sovereign immunity in a state court action for damages.\n\nTort claims against government can, however, be premised on two separate theories: direct liability from the agency's own acts, or vicarious liability for the acts of its employees, officers, and agents. See Ross v Consumers Power (On Rehearing), 420 Mich 567, 621-625; 363 NW2d 641 (1984). In Ross, p 624, we noted that \" superior liability generally can be imposed only where the individual tortfeasor acted during the course of his or her employment and within the scope of his or her authority.\"3a For \"constitutional torts,\" liability should only be imposed on the state in cases where a state \"custom or policy\" mandated the official or the employee's actions. Ross held that the general effect of statutory immunity was to ban vicarious governmental liability for the acts of agents, officers, and employees. Those policy reasons which restrain us from reading MCL 691.1407; MSA 3.996(107) to immunize the state for its direct violations of the constitution do not also require imposing vicarious liability for acts of state officers, employees, or agents which violate the state constitution.\n\nThe state's liability should be limited to those cases in which the state's liability would, but for the Eleventh Amendment, render it liable under the 42 USC 1983 standard for local governments articulated in Monell v New York City Dep't of Social Services, 436 U.S. 658; 98 S Ct 2018; 56 L Ed 2d 611 (1978). Liability should be imposed on the state only where the action of a state agent \"implements or executes a policy statement, ordinance, regulation, or decision officially adopted and promulgated by that body's officers . . . governmental 'custom' even though such a custom has not received formal approval through the body's official decisionmaking channels.\" Id., pp 690-691. Thus, statutory immunity would continue to bar suit for cases in which the only possible liability of the state is based upon respondeat superior. Cf. id., 691-694.\n\nA limitation of the state's liability to situations in which the injury occurs as the result of a custom or policy of the state is dictated by prudential concerns. First, the public policy concerns which militate a remedy are greatest when the state has such \"primary governmental liability.\" Compare Note, Rethinking sovereign immunity after Bivens, 57 NYU L R 597, 637 (1982) (advocating abolition of the sovereign immunity of the United States for constitutional torts). This standard avoids the spectre of multitudinous lawsuits against the state for the unauthorized tortious acts of employees. Such a cause of action also is \"more manageable: causation is more easily proven and the locus of liability is more readily ascertained.\" Id. It also serves the objective of deterring future similar unconstitutional acts while still providing compensation for the injured party. Id.\n\nIn a case involving an alleged unconstitutional act by the state government, neither sovereign nor statutory immunity should bar liability. The injury arises from violation of a constitutionally protected right by the government, a right engendered by \"the basic law which created and seeks to control that government.\" Dellinger, Of rights and remedies: The constitution as a sword, 85 Harv L R 1532, 1557 (1972). The primacy of the constitution must eclipse the power of immunity to countenance constitutional violations by the state without concomitant liability.\n\nTherefore, we would remand this case to the Court of Claims4a for determination of whether an act which violates the state constitution by virtue of a governmental custom or policy has been alleged.\n\nIII\n\nThe question, subsidiary to this appeal, which next arises is whether a damage remedy exists for violations of individual rights protected by the Michigan Constitution. No general statute provides such a remedy.5a Can such a remedy be inferred directly from protections found in the Michigan Constitution?\n\nNo lawyer is unaware of the damage remedy implicit in Bivens v Six Unknown Federal Narcotics Agents, 403 U.S. 388; 91 S Ct 1999; 29 L Ed 2d 619 (1971), for violations by federal officers of rights protected by the Fourth Amendment of the United States Constitution.6a In Bivens, the United States Supreme Court recognized a cause of action for damages against individual federal officers arising directly from the Fourth Amendment, rather than from legislation. In a brief opinion, the Court noted that money damages are \"the ordinary remedy for an invasion of personal interests in liberty,\" id., p 395, that the case involved \"no special factors counseling hesitation in the absence of affirmative action by Congress,\" id., p 396, and that \"' very essence of civil liberty certainly consists in the right of every individual to claim the protection of the laws, whenever he receives an injury.'\" Id., p 397, quoting Marbury v Madison, 5 U.S. (1 Cranch) 137, 163; 2 L Ed 60 (1803).\n\nAfter Bivens, the United States Supreme Court has inferred damage remedies directly from other provisions of the United States Constitution. See Davis v Passman, 442 U.S. 228; 99 S Ct 2264; 60 L Ed 2d 846 (1979) (Fifth Amendment equal protection cause of action for gender-based discrimination), and Carlson v Green, 446 U.S. 14; 100 S Ct 1468; 64 L Ed 2d 15 (1980) (Eighth Amendment cause of action). Lower federal courts have also inferred damage remedies under the First and Sixth Amendments. See, generally, Anno: Implication of private right of action from provision of United States Constitution -- Federal cases, 64 L Ed 2d 872 (1980).\n\nIn state courts, the Bivens -type judicially inferred damage cause of action for violations of state constitutions has received a varied response. See, generally, Friesen, Recovering damages for state bills of rights claims, 63 Tex L R 1269 (1985). Several state courts have recognized damage remedies inferred from state constitutional provisions. See Widgeon v Eastern Shore Hosp Center, 300 Md 520; 479 A2d 921 (1984) (improper seizure and due process); Schreiner v McKenzie Tank Lines, 408 So 2d 711 (Fla App, 1982), approved by 432 So 2d 567 (Fla, 1983) (employment discrimination); Gay Law Students Ass'n v Pacific Telephone \u0026 Telegraph Co, 24 Cal 3d 458; 156 Cal Rptr 14; 595 P2d 592 (1979) (Equal Protection Clause); Walinski v Morrison \u0026 Morrison, 60 Ill App 3d 616; 18 Ill Dec 89; 377 NE2d 242 (1978) (employment discrimination); Strauss v New Jersey, 131 NJ Super 571; 330 A2d 646 (1974) (due process violation). Several other state courts have commented favorably upon inferred constitutional damage remedies, albeit in dicta. See, e.g., Phillips v Youth Development Program, 390 Mass 652, 657-658; 459 NE2d 453 (1983) (\"a person whose constitutional rights have been interfered with may be entitled to judicial relief even in the absence of a statute providing a procedural vehicle for obtaining relief\"). Other states have avoided the issue by finding a statutory cause of action. See, e.g., State v Haley, 687 P2d 305, 317-318 (Alas, 1984). Some courts have rejected the remedy primarily, one suspects, because of the doctrines of sovereign or governmental immunity, rather than because of a rejection of the Bivens analysis. See Figueroa v Hawaii, 61 Hawaii 369, 382; 604 P2d 1198 (1979) (\"we are not free to abolish the State's sovereign immunity and the State remains immune from a Bivens -type claim\"); Rockhouse Mtn Property Owners Ass'n v Town of Conway, 127 NH 593; 503 A2d 1385 (1986) (governmental immunity a factor in denying damage remedy for alleged violations of state due process and equal protection).\n\nWe would recognize the propriety of an inferred damage remedy arising directly from violations of the Michigan Constitution in certain cases. As the Bivens Court recognized, there are circumstances in which a constitutional right can only be vindicated by a damage remedy and where the right itself calls out for such a remedy. On the other hand, there are circumstances in which a damage remedy would not be appropriate. The absence of any other remedy would, as in Bivens, heighten the urgency of the question. Justice Harlan, Concurring in Bivens, states that \" question then, is, as I see it, whether compensatory relief is 'necessary' or 'appropriate' to the vindication of the interest asserted.\" 403 U.S. 407. In answering this question in the positive, Justice Harlan commented, \" people in Bivens ' shoes, it is damages or nothing.\" Id., p 410. Where a statute provides a remedy, the stark picture of a constitutional provision violated without remedy is not presented. While a Bivens -type action may still be inferred, see Carlson v Green, supra (federal tort claims remedy no bar to Bivens action), the existence of a legislative scheme may constitute \"special factors counseling hesitation,\" Bivens, supra, p 396, which militate against a judicially inferred damage remedy. See, e.g., Bush v Lucas, 462 U.S. 367; 103 S Ct 2404; 76 L Ed 2d 648 (1983) (no Bivens -type damage remedy for federal civil servant alleging First Amendment violations by employer; Congress enacted comprehensive civil service statutes and is in the best position to decide the relevant public policy issues); Chappell v Wallace, 462 U.S. 296, 304; 103 S Ct 2362; 76 L Ed 2d 586 (1983) (no Bivens remedy for Navy enlistees claiming racial discrimination by superior officers; the unique disciplinary structure of military life and congressional exercise of plenary authority over the military are special factors counseling hesitation).\n\nIV\n\nWhether a damage remedy should be inferred in this case cannot properly be decided on this record. We would remand the case to the trial court for further development below. In light of the complexity of the question, however, the following observations may be helpful.\n\nThe first step in recognizing a damage remedy for injury consequent to a violation of our Michigan Constitution is, obviously, to establish the constitutional violation itself. Plaintiff's complaint, count III, item 29, alleges:\n\nviolation of Jack Smith's constitutional rights as set out in the various State Constitutions, including without limitation Art [2], Section 16, of the Michigan Constitution of 1908, in that he was deprived of a meaningful life, deprived of his liberty, and deprived of property elements of his life without due process of law.7a\n\nPlaintiff's amended complaint, item 29a, alleges \"a violation of Jack Smith's constitutional right to equal protection under 1908 Mich Const, Art [2], Section 1.\"8a Plaintiff's specific claims thus rest upon equal protection and due process violations.\n\nFederal courts have struggled with the question what constitutes a violation of due process for purposes of 42 USC 1983. See, generally, Winborne, ed, Civil Actions Against State Government: Its Divisions, Agencies and Officers (McGraw-Hill, 1982), § 10.27. The federal Due Process Clause9a includes three basic components: procedural due process,10a substantive due process,11a and incorporation of specific Bill of Rights protections:\n\n[The Due Process] Clause is the source of three different kinds of constitutional protection. First, it incorporates specific protections defined in the Bill of Rights. Thus, the State, as well as the Federal Government, must comply with the commands in the First and Eighth Amendments; so, too, the State must respect the guarantees in the Fourth, Fifth, and Sixth Amendments. Second, it contains a substantive component, sometimes referred to as \"substantive due process,\" which bars certain arbitrary government actions \"regardless of the fairness of the procedures used to implement them.\" Third, it is a guarantee of fair procedure, sometimes referred to as \"procedural due process\": the State may not execute, imprison, or fine a defendant without giving him a fair trial, nor may it take property without providing appropriate procedural safeguards. [ Daniels v Williams, 474 U.S. 327, ; 106 S Ct 662; 88 L Ed 2d 662, 672 (1986) (Stevens, J., Concurring). Citations omitted.]\n\nIn Daniels v Williams, the United States Supreme Court held that the negligence of state officials does not constitute a violation of either procedural or substantive due process: \"We conclude that the Due Process Clause is simply not implicated by a negligent act of an official causing unintended loss of or injury to life, liberty or property.\" 88 L Ed 2d 666. See also Davidson v Cannon, 474 U.S. 344; 106 S Ct 668; 88 L Ed 2d 677 (1986) (official's negligence is not a violation of procedural due process).\n\nThe plaintiff's complaint does not specify whether procedural due process or substantive due process claims are at issue. Neither have the parties fully briefed or argued the question whether a constitutional violation actually occurred in this case. Therefore, it is only appropriate to leave this thorny issue for later factual development and legal argument.\n\nThe second step in considering an inferred damage remedy for a violation of the Michigan Constitution is to consider the text, history, and previous interpretations of the specific provision for guidance on the propriety of a judicially inferred damage remedy. The provision itself may commit creation of a remedy to the Legislature rather than the courts.12a Again, the application of this factor to the instant case must be left for development in future proceedings.\n\nFinally, various other factors, dependent upon the specific facts and circumstances of a given case, may militate against a judicially inferred damage remedy for violation of a specific constitutional provision. For example, the federal courts have refused a damage remedy in the face of Congress' exercise of its special authority over the military, see Chappell v Wallace, supra, and its special role in personnel management vis-a-vis federal employees, Bush v Lucas, supra. Other concerns, such as the degree of specificity of the constitutional protection, should also be considered. For example, there was no question in Bivens, supra, that the defendants had violated the warrant requirements of the Fourth Amendment. These search and seizure protections are, however, relatively clear-cut in comparison to the Due Process and Equal Protection Clauses. See Monaghan, The Supreme Court, 1974 term forward: Constitutional common law, 89 Harv L R 1, 44-45 (1975) (substantive guarantees of due process and equal protection are troubling in their indeterminate character). The clarity of the constitutional protection and violation in a given case should be a factor in determining the propriety of a judicially imposed damage remedy. Another factor important in federal cases has been the availability of another remedy. In Bivens, supra, the lack of any alternative remedy was certainly a matter of concern to the United States Supreme Court. On the other hand, the presence of an alternate remedy in Chappell v Wallace, supra, was a factor weighing against a damage remedy for constitutional violations.\n\nV\n\nConclusion\n\nWe would hold that neither statutory nor common-law governmental immunity bars a suit in a state court alleging violation by the state of a right protected by our Michigan Constitution. Furthermore, we would acknowledge the possible propriety of a Bivens -type damage remedy for violation of a right protected by our state constitution. Because the record in the instant case, Smith v Dep't of Public Health, is inadequate for determining whether a violation of the Michigan Constitution occurred by virtue of a governmental custom or policy, and, if such a violation occurred, whether it is one for which a damage remedy is proper, we would remand the case for further proceedings not inconsistent with this opinion.\n\nLevin, J. (separate opinion).\n\nI concur in the result in Smith as stated in part V of Justice Boyle's opinion but, as stated in Justice Archer's opinion, would not limit the remand to a determination whether the alleged constitutional violation occurred by \"virtue of a governmental custom or policy\" or whether \"a damage remedy is proper.\"\n\nArcher, J. (dissenting).\n\nWe Dissent because we believe that the state is a \"person\" within the meaning of § 1983. Viewed in the light of its legislative history and its remedial purpose, § 1983 is the appropriate mechanism for securing federal constitutional rights which the state allegedly has violated.\n\nSection 1983 provides in pertinent part:\n\nEvery person who, under color of any statute, ordinance, regulation, custom, or usage, of any State or Territory or the District of Columbia, subjects, or causes to be subjected, any citizen of the United States or other person within the jurisdiction thereof to the deprivation of any rights, privileges, or immunities secured by the Constitution and laws, shall be liable to the party injured in an action at law, suit in equity, or other proper proceeding for redress.\n\nIn a § 1983 case, there are two essential elements. First, the act complained of must have been done by a person acting under color of state law, and, second, this act must have deprived the plaintiff of rights, privileges, or immunities secured by the constitution or laws of the United States.\n\nThe use of the word \"person\" in § 1983 is a term of art. Whether the word \"person\" was meant by the 42nd Congress to include a state has been the source of conflicting opinions in the United States Supreme Court, the federal and state courts, and among the commentators. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nAs the lead opinion correctly states, the United States Supreme Court in Quern v Jordan, 440 U.S. 332; 99 S Ct 1139; 59 L Ed 2d 358 (1979), never explicitly addressed the issue whether the term \"person\" in § 1983 included states. The focus of the majority in Quern was whether Congress, in enacting § 1983, intended to abrogate the immunity of the states from suit in federal court. In the opinion, the majority was primarily concerned with the scope of the states' Eleventh Amendment immunity from suits which would impose a liability which must be paid from public funds in the state treasury.\n\nHowever, Justice Brennan argued in his opinion, Concurring in the judgment in Quern that § 1983 was enacted for the purpose of enforcing the provisions of the Fourteenth Amendment. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e \"That Amendment,\" Justice Brennan stated, \"exemplifies the 'vast transformation' worked on the structure of federalism in this Nation by the Civil War.\" Quern, 354.\n\nThe prohibitions of the Fourteenth Amendment \"'are directed to the States . . . . They have reference to actions of the political body denominated a State, by whatever instruments or in whatever modes that action may be taken.'\" Id., 355. Justice Brennan, after reviewing the history of the Fourteenth Amendment, the language and legislative history of § 1983, and the language of the Dictionary Act, which defined \"person\" by referring to \"bodies politic,\" concluded that the term \"person\" in § 1983 encompassed states. We agree. We find Justice Brennan's interpretation of the intent of the 42nd Congress to include the states as \"persons\" in § 1983 actions to be persuasive. It serves no purpose to further review that history here.\n\nSection 1983 suits are routinely decided in the courts of this state when the defendant is a \"person\" and is other than the State of Michigan. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Under the Supremacy Clause of the United States Constitution, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e we are duty-bound to enforce the provisions of the United States Constitution as well as valid federal laws. The defendants argue that not only is a state not a person within the meaning of § 1983, but that the state has immunity from being sued directly under the doctrine of sovereign immunity.\n\nUnder the doctrine of sovereign immunity, the state, as sovereign, cannot be sued unless the sovereign has consented to suit.\n\nThe doctrine is based on English law and rests on the theory that \"the king can do no wrong.\" \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e But the jurisprudence of medieval England has little relevance to America in the twentieth century. The rule of sovereign immunity is a common-law rule and is not of constitutional dimension. The rule has been repeatedly invoked in Michigan \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e to hold the state immune from all suits except to the extent that it consented to be sued in its courts.\n\nThe courts of this state have frequently applied the doctrine of sovereign immunity without distinguishing between constitutional and non-constitutional courses of action. Yet this distinction is of crucial import in this case. The plaintiffs here alleged conduct by the state which infringed rights which are fundamental under the United States Constitution. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Yet the lead opinion would hold that the plaintiffs have no remedy for these alleged acts and that therefore the state and its officials are answerable to no one for the alleged damage caused by their conduct.\n\nWe find this result deeply disturbing. Certainly this Court has the obligation to protect the fundamental constitutional rights of its citizens and § 1983 provides the mechanism by which citizens can gain redress against the government for alleged unconstitutional conduct by the state. As one commentator observed: \"It is a magnificent historical irony that America, a republic whose independence was declared in a document indicting the sovereign for treasonous acts, should adopt without serious examination the doctrine of sovereign immunity.\" \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e It is even more ironic that under state law, citizens who allege non-constitutional tortious injuries may sue governmental agencies, both state and local, for their conduct, \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e yet there is no remedy for plaintiffs in this case. Neither sovereign immunity nor statutory immunity should bar relief when the state allegedly has violated the constitutional rights of its citizens.\n\nIn view of the holding on this issue, we do not reach the remaining issues raised in these cases. While we do not address the other issues, we do find that an allegation of an intentional tort is not barred by the governmental immunity statute because such an activity does not constitute a governmental function. Lockaby v Wayne Co, 406 Mich 65, 77; 276 NW2d 1 (1979).\n\nIn sum, because the common-law doctrine of sovereign immunity is inapplicable to bar suits against a state for alleged infringement of fundamental constitutional rights, we would reverse the decision of the Court of Appeals in Will, and affirm the decision of the Court of Appeals in Smith.\n\nWe are in Dissent in Will, but Justice Boyle with Justice Cavanagh Concurring would, in accord with the Court of Appeals, remand in Smith to the Court of Claims for further proceedings. We join in remand. We would not, however, limit the remand in Smith to a determination of whether the alleged constitutional violation occurred by \"virtue of a governmental custom or policy\" or whether a \"damage remedy is proper,\" and do not agree that those limitations should be imposed on a remedy for constitutional violation. We nevertheless join in remand in Smith for further proceedings to determine, as stated in Justice Boyle's opinion, \"whether a violation of the Michigan Constitution occurred by virtue of a governmental custom or policy, and, if such a violation occurred, whether it is one for which a damage remedy is proper.\"\n\n\u003cspan class=\"fn\"\u003e1. Mr. Will sued the Department of Civil Service, the State Personnel Director, the Department of State Police, and the Director of State Police. The first two defendants were dismissed by order of the Court of Claims on January 3, 1983.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Plaintiff then cross-claimed an appeal of the Court of Claims final judgment, specifically on the question of the court's denial of plaintiff's motion to clarify. In response, defendants filed a motion to affirm the Court of Claims refusal to \"clarify\" its November 15, 1982, decision. The Court of Appeals resolved the clarification issue by order of May 25, 1984.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt is ordered that the motion to affirm be, and the same is hereby granted for the reason that the question sought to be reviewed is so unsubstantial as to need no argument or formal submission and is without merit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The state did not appeal the statute of limitations issue in the Court of Appeals, nor did it raise it before this Court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Section 1983 originally read as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eBe it enacted . . . That any person who, under color of any law, statute, ordinance, regulation, custom, or usage of any State, shall subject, or cause to be subjected, any person within the jurisdiction of the United States to the deprivation of any rights, privileges, or immunities secured by the Constitution of the United States, shall, any such law, statute, ordinance, regulation, custom, or usage of the State to the contrary notwithstanding, be liable to the party injured in any action at law, suit in equity, or other proper proceeding for redress; such proceeding to be prosecuted in the several district or circuit courts of the United States, with and subject to the same rights of appeal, review upon error, and other remedies provided in like cases in such courts, under the provisions of the act of the ninth of April, eighteen hundred and sixty-six, entitled \"An act to protect all persons in the United States in their civil rights, and to furnish the means of their vindication\"; and the other remedial laws of the United States which are in their nature applicable in such cases. [Civil Rights Act of 1871, 17 Stat 13. Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28 USC 1343(3) now embodies the jurisdictional grant of § 1 of the Ku Klux Klan Act of 1871. A party may also bring a § 1983 claim under the general federal jurisdiction statute, 28 USC 1331. For a Discussion of the jurisdictional issues related to § 1983, see Zagrans, \" Under color of \" what law: A reconstructed model of section 1983 liability, 71 Va L R 499, 500, n 1 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In Ex parte Young, 209 U.S. 123; 28 S Ct 441; 52 L Ed 714 (1908), the Supreme Court carved out an exception to the Eleventh Amendment's prohibition against suing a state in federal court. Young involved a suit brought in a federal court by railroad stockholders seeking to enjoin the Attorney General of Minnesota from enforcing what they considered to be an unconstitutional state statute. The Court found that the lower federal court could enjoin enforcement of the allegedly unconstitutional act, despite objections that such a suit was, in effect, one against the state itself. By \"stripping away\" the official or representative character of the state attorney general, the Court created the legal fiction that the railroad stockholders actually sought relief against Mr. Young, not against the state.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Professor Field claims that two different conceptions of the Eleventh Amendment underlie the conflicting \"power\" rationales in Parden v Terminal Railway, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe Court's implications that Congress is free to impose suit upon the states as long as it stays within its article I and other regulatory powers suggest that sovereign immunity is only a common law doctrine. If sovereign immunity had constitutional status, how could Congress abrogate it?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ethe Court sometimes talks in language of consent . . . . consent on the part of a state that the Court looks to is not a consent accompanying ratification of the Constitution. Indeed, it hardly could be since the primary source of sovereign immunity, according to the Court, is the eleventh amendment -- a post-ratification amendment. . . . the Court appears to view sovereign immunity as a constitutionally-required doctrine [abrogated only by state consent]. [Field, The Eleventh Amendment and other sovereign immunity doctrines: Congressional imposition of suit upon the states, 126 U Pa L R 1203, 1212-1213 (1978). See, generally, Field, The Eleventh Amendment and other sovereign immunity doctrines: Part one, 126 U Pa L R 515 (1978).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Much of the Court's Discussion in Monell revolved around the Sherman amendment. As originally proposed, the amendment imposed liability on the \"inhabitants of the county, city, or parish\" for damage inflicted by \"persons riotously and tumultuously assembled together.\" See id. at 702. After conference, the committee reported a new version of the Sherman amendment, which imposed liability directly on the \"county, city, or parish\" for damage caused by persons \"riotously and tumultuously assembled together.\" See id. at 703-704. It was the Court's interpretation of congressional reaction to this conference substitute that motivated both its holding in Monroe and Monell. The Senate approved the first conference substitute of the Sherman amendment, but the House rejected it. The second conference substitute dropped the idea of imposing liability on municipalities. Instead it imposed liability on any person who, with knowledge of a conspiracy to violate civil rights, took no action to prevent such a conspiracy. See id. at 668-669, 704. Congress adopted this second conference version of the Sherman amendment, now codified at 42 USC 1986.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. But we need not reach the question whether an express waiver required because neither the language of the statute nor the legislative history an intent to overturn the States' Eleventh Amendment immunity by imposing liability directly upon them. [ Quern v Jordan, supra at 344-345, n 16.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Quern, the Court, therefore, avoided the question what standard to apply in determining congressional abrogation of the states' Eleventh Amendment immunity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eBut in Atascadero State Hosp v Scanlon, 473 U.S. 234, 242; 105 S Ct 3142; 87 L Ed 2d 171 (1985), Court noted that\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCongress may abrogate the States' constitutionally secured immunity from suit in federal court only by making its intention unmistakably clear in the language of the statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSpeaking for the majority, Justice Powell indicated throughout Atascadero that the Court's \"new\" standard required express statutory language indicating Congress' intent to abrogate the states' Eleventh Amendment immunity. See Brown, State sovereignty under the Burger Court -- How the Eleventh Amendment survived the death of the Tenth: Some broader implications of Atascadero State Hospital v Scanlon, 74 Geo L J 363, 379-388 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In 1981, Senator Mathias introduced a bill to the 97th Congress, proposing amendment of 42 USC 1983. Section 2(b) of that proposed legislation defined \"person\" to include \"any State or territory.\" For an analysis of Senator Mathias' bill and similar attempts to amend § 1983, see Sagafi-Nejad, Proposed amendments to section 1983 introduced in the Senate, 27 St Louis U L J 373 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In support of his false imprisonment claim, plaintiff's Court of Claims complaint stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. When Jack Smith was sent to and/or transferred to the Michigan Home and Training School (Lapeer State Home and Training School), same was done without proper order and authority, and therefore same was contrary to the applicable procedures prevailing at that time (understood to be 1923 PA 151, § 11, as amended by 1925 PA 283); further, upon information and belief, said transfer was contrary to the 1923 PA 151, § 21 (the former citation compiled in CL 1929, § 6888 and the second compiled in CL 1929, § 6898).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Said confinement at said Michigan Home and Training School (Lapeer State Home and Training School) was done intentionally by the applicable employees and representatives of the responsible Defendants, by the applicable institutions described and by the State of Michigan.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThere is no question that the confinement of plaintiff was intentional. If no more intentional acts were alleged, we could question the need for an intentional tort analysis because the Department of Mental Health has as part of its responsibility the involuntary confinement of certain persons. However, the plaintiff in another section of his complaint also alleged the intentional failure to use the proper procedure for his confinement. This is sufficient to make an intentional tort analysis necessary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The parties apparently assume that § 7 of the current governmental immunity act applies to the facts of Smith. Therefore, our analysis is based on that assumption.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Earlier this year, the Michigan Legislature enacted 1986 PA 175, which significantly amended § 7 of the governmental immunity act. The provision cited in the text accompanying this footnote remained essentially the same. The major change in § 7 was in the addition of §§ 7(2) through 7(5).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The reason for the \"requirement\" that plaintiff state facts in his pleadings in avoidance of immunity is that\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eand governmental immunity are not affirmative defenses, but characteristics of government which prevent imposition of tort liability upon the governmental agency. Galli, supra, p 541, fn 5; McCann, supra, p 77, fn 1. [ Ross, supra at 621, n 34.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See MCL 691.1402; MSA 3.996(102) (highway repair); MCL 691.1405; MSA 3.996(105) (negligent operation of government-owned motor vehicle); MCL 691.1406; MSA 3.996(106) (public buildings); MCL 691.1413; MSA 3.996(113) (proprietary function).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Interestingly enough, two treatises on governmental liability cite Michigan cases for the proposition that certain jurisdictions recognize an \"intentional tort\" exception to governmental immunity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt has been held that an intentional tort could not constitute the exercise or discharge of a governmental function for the purposes of sovereign immunity. Shunk v State, 97 Mich App 626; 296 NW2d 129 (1980) [app den Shunk v Northwest Industries, 414 Mich 921 (1982); later app Shunk v Michigan (After Remand), 132 Mich App 632; 347 NW2d 767 (1984)]. [Winborne, ed, Civil Actions Against State Government: Its Divisions, Agencies and Officers (McGraw-Hill, 1982), § 2.41, p 91.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMoreover, Sands and Libonati, in their multivolume treatise on local government law, cite Lockaby v Wayne Co, 406 Mich 65; 276 NW2d 1 (1979), as support for the statement that certain jurisdictions exempt intentional torts from the protection of governmental immunity. See 4 Sands \u0026 Libonati, Local Government Law, § 27.04, pp 27-22 to 27-32.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Section 7 was found unconstitutional because it granted immunity from all tort liability. In contrast, the title of the governmental immunity act created immunity for injuries caused by negligence alone. Since negligence is only one species of tort, § 7 unconstitutionally conferred much broader immunity than the title allowed. [ Ross, supra at 606, n 21. Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Under Ross, this could not occur because a court, in determining both direct and vicarious liability, must examine the general activity not the specific tortious acts involved at the time the alleged tort occurred.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNeither party has distinguished whether the alleged conduct of the state officers, agents, or employees in Smith is direct or vicarious, see n 19, nor do we find it necessary to the decision of this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. We therefore conclude that a governmental function is an activity which is expressly or impliedly mandated or authorized by constitution, statute, or other law. When a governmental agency engages in mandated or authorized activities, it is immune from tort liability, unless the activity is proprietary in nature (as defined in § 13) or falls within one of the other statutory exceptions to the governmental immunity act. Whenever a governmental agency engages in an activity which is not expressly or impliedly mandated or authorized by constitution, statute, or other law (i.e., an ultra vires activity), it is not engaging in the exercise or discharge of a governmental function. The agency is therefore liable for any injuries or damages incurred as a result of its tortious conduct. [ Id. at 620.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. A governmental agency can be held vicariously liable only when its officer, employee, or agent, acting during the course of employment and within the scope of authority, commits a tort while engaged in an activity which is non-governmental or proprietary, or which falls within a statutory exception. The agency is vicariously liable in these situations because it is in effect furthering its own interests or performing activities for which liability has been statutorily imposed. However, if the activity in which the tortfeasor was engaged at the time the tort was committed constituted the exercise or discharge of a governmental function (i.e., the activity was expressly or impliedly mandated or authorized by constitution, statute, or other law), the agency is immune pursuant to § 7 of the governmental immunity act. See Hirych v State Fair Comm, 376 Mich 384, 391-393; 136 NW2d 910 (1965), and Sherbutte v Marine City, 374 Mich 48, 50; 130 NW2d 920 (1964) (city cannot be held vicariously liable for torts of its police officers committed during the course of an arrest because the officers were engaged in police activity, which is a governmental function entitled to immunity). [ Id. at 625.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. We assume that plaintiff's allegations concerning the state's liability for false imprisonment are premised on theories of direct and vicarious liability. As enunciated in Ross, the tests for direct and vicarious liability share the governmental function standard.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. In the Discussion accompanying this footnote, we deal only with the theory of direct liability.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAs for the question what constitutes the \"intent\" of a governmental body, the issue has long befuddled the courts. We do not attempt to define here the elusive concept of organizational intent. For a general Discussion of that problem, albeit in the context of constitutional torts, see Whitman, Government responsibility for constitutional torts, 85 Mich L R 225 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Mr. Smith also argues that applying the governmental immunity act to his case would render it unconstitutional. The constitutional issues raised by plaintiff, however, are spurious and without merit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePlaintiff claims that the governmental immunity act violates his rights to due process of law and equal protection. He argues that, since the right to a remedy is fundamental, this Court should apply a strict scrutiny constitutional test, requiring a compelling state interest to sustain the statutory scheme.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePlaintiff's argument, however, fails for several reasons. First, the United States Supreme Court has never recognized the right to a remedy as a fundamental right. Plaintiff misuses this constitutional term of art. See Nowak, Rotunda \u0026 Young, Constitutional Law (3d ed), ch 11, § 11.7, pp 370-372.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSecond, absent a fundamental right to a remedy, this Court need only apply a \"rational basis\" test, and the governmental immunity act is rationally related to several valid state purposes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e[To begin with], imposition of liability on governmental agencies would bring about judgments requiring that tax moneys be diverted from the performance of governmental services, rendering those services less effective or totally unavailable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn many of these situations, the government does things which private individuals or corporations cannot or likely will not do. . . . By undertaking such peculiarly governmental functions, local governments expose themselves to substantial risk if not protected by governmental immunity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e[Moreover,] should the governmental immunity defense be eliminated, governmental agencies will cease to be interested in innovative programs which may better serve citizens and preserve the integrity of the governmental agency's public funds. [DeGrazia \u0026 Oldani, Governmental Immunity -- More: A call for legislative action, 63 Mich B J 126, 129 (1984).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt is apparent that the governmental immunity act furthers several quite legitimate governmental objectives.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFinally, the governmental immunity act, codifying as it does an historic principle of law, enjoys more than the customary presumption of constitutional validity. See State Bar of Michigan v Lansing, 361 Mich 185, 195; 105 NW2d 131 (1960).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. See Note, Rethinking sovereign immunity after Bivens, 57 NYU L R 597, n 4 (1982) (citations omitted) (\"All three Dissents in Bivens criticized the majority's holding as improper judicial usurpation of legislative powers\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. In 1974, Congress amended the Federal Tort Claims Act to allow suit against the federal government for certain intentional torts committed by \"investigative or law enforcement officers of the United States Government.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe provisions of this chapter and section 1346(b) of this title shall not apply to --\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(h) Any claim arising out of assault, battery, false imprisonment, false arrest, malicious prosecution, abuse of process, libel, slander, misrepresentation, deceit, or interference with contract rights: Provided, That, with regard to acts or omissions of investigative or law enforcement officers of the United States Government, the provisions of this chapter and section 1346(b) of this title [28 USC 1346(b)] shall apply to any claim arising, on or after the date of the enactment of this proviso, out of assault, battery, false imprisonment, false arrest, abuse of process, or malicious prosecution. For the purpose of this subsection, \"investigative or law enforcement officer\" means any officer of the United States who is empowered by law to execute searches, to seize evidence, or to make arrests for violations of Federal law. [28 USC 2680(h). Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. In Cort v Ash, supra at 78, the Supreme Court established four criteria for inferring a cause of action under a federal statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn determining whether a private remedy is implicit in a statute not expressly providing one, several factors are relevant. First, is the plaintiff \"one of the class for whose especial benefit the statute was enacted,\" . . . that is, does the statute create a federal right in favor of the plaintiff? Second, is there any indication of legislative intent, explicit or implicit, either to create such a remedy or to deny one? . . . Third, is it consistent with the underlying purposes of the legislative scheme to imply such a remedy for the plaintiff? . . . And finally, is the cause of action one traditionally relegated to state law, in an area basically the concern of the States, so that it would be inappropriate to infer a cause of action based solely on federal law? [Citations omitted.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Approximately 75 percent of Bivens actions involve multiple defendants. Although no governmentwide statistics document the incidence of filings of Bivens suits, the available data indicate a steady increase. Between 7,500 and 10,000 Bivens suits against government employees [were brought between 1971 and 1981]; at least 600 individual FBI agents have named defendants in these cases. The Torts Branch of the Department of Justice's Civil Division records filings of Bivens cases against individual employees for the three years 1979-81 as follows: 1979, 535; 1980, 547; 1981, 601. The percentage of Bivens cases within the overall Torts Branch case load increased to 9 percent of the total in 1979, to 16 percent in 1980, and to 18 percent in 1981. These percentages, obtained from only one branch of the Civil Division, do not include actions that other Justice Department units, such as the Civil Rights Division, handle, nor do they include similar cases litigated by independent agencies that defend their own Bivens defendants, such as the Securities and Exchange Commission. The Justice Department estimates that approximately 2,200 Bivens suits, against an average of 3-5 federal employees, were pending as of March 31, 1981. According to testimony given in March 1982, the \"annualized cost\" of the present case load is running at $15,821,000, plus payment to private counsel by the department of about $500,000 per year. [Schuck, Suing Government (New Haven: Yale University Press, 1983), Appendix, p 202.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. district courts, together with the United States District Court for the District of the Canal Zone and the District Court of the Virgin Islands, shall have exclusive jurisdiction of civil actions on claims against the United States, for money damages, accruing on and after January 1, 1945, for injury or loss of property, or personal injury or death caused by the negligent or wrongful act or omission of any employee of the Government while acting within the scope of his office or employment, under circumstances where the United States, if a private person, would be liable to the claimant in accordance with the law of the place where the act or omission occurred. [28 USC 1346(b). Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Since we decline to infer a right to sue for damages on the basis of the state constitution by state agencies, we need not reach the question, argued before this Court, whether governmental immunity bars a claim for recovery on the basis of a \"constitutional tort.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Neither party discusses whether the 1908 or the 1963 Michigan Constitution properly applies to the facts of Smith. We base our analysis on plaintiff's specific allegations of violations of the 1908 Constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. In Wright v Tennessee, 628 F2d 949, 951 (CA 6, 1980), the Court of Appeals dismissed plaintiff's \"independent constitutional claims\" on jurisdictional grounds, assuming, without deciding, that a Bivens -style remedy for violations of the Fourteenth Amendment by the state existed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAssuming the existence of a Bivens. . . type cause of action for Fourteenth Amendment violations, the complaint in the present case did not set forth a jurisdictional basis for such a claim. [Citation omitted.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also Rowe v Tennessee, 609 F2d 259, 262 (CA 6, 1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. We do not reach the substantive merits of plaintiff's claims that state defendants allegedly violated his rights to due process and equal protection of the laws pursuant to Const 1908, art 2, §§ 1 and 16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. See Pompey v General Motors Corp, 385 Mich 537; 189 NW2d 243 (1971), and Holmes v Haughton Elevator Co, 404 Mich 36; 272 NW2d 550 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Amicus curiae, American Civil Liberties Union Fund, argues that in Will, we should recognize a Bivens -style cause of action against state agencies and officials for violations of the Fourteenth Amendment of the federal constitution. But amicus curiae's argument is not properly before us. As state defendants aptly note:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAmicus seeks to raise this issue [of an independent cause of action directly under the federal constitution] . . ., although this issue was never once mentioned by the Court of Claims or the Court of Appeals, and was never once mentioned by Plaintiff \u0026 Cross-Appellant in the Court of Claims or in the Court of Appeals, or in this Court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Contrary to Plaintiff's argument, Count II of the Court of Claims action, which set forth an independent allegation of a violation of the Michigan constitution, was dismissed pursuant to a motion for accelerated judgment under GCR 1963, 116.1(2). This Count was dismissed because Plaintiff failed to exhaust his administrative remedies and because the Court of Claims lacked jurisdiction of the subject matter which, upon completion of administrative remedies, belonged in the Circuit Court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ePlaintiff's right to redress for Defendant's failure to follow merit as the basis for promotions in civil service positions in violation of the Michigan constitutional provision under art XI, § 5 is to follow the grievance procedure established by the Civil Service Commission. After exhausting all administrative remedies the proper approach is to seek review in the Circuit Court. See Viculin v Dep't of Civil Service, 386 Mich 375, 393; 192 NW2d 449 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn the Circuit Court matter the Civil Service Commission affirmed the hearing Officer's finding that the Department of State Police used \"partisan considerations\" of Plaintiff's brother's political activities in violation of Michigan Constitution and affirmed the measure of damages in the amount of $201.60 in favor of Plaintiff. Plaintiff's failure to seek judicial review of this determination renders the Civil Service Commission's decision final. This obviates the necessity for this Court to review the matter on the basis of liability for civil damages for the alleged violations of the Michigan Constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. We neither approve nor disapprove the reasoning of the Court of Claims May 7, 1979, opinion in which the court dismissed plaintiff's Michigan constitutional claim. Instead, we merely conclude that plaintiff did not preserve his constitutional claim for appeal by failing, for example, to appeal the Court of Claims dismissal of his Michigan constitutional claim or to seek reinstatement of that claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1a This opinion deals solely with allegations of violations of the state constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2a Art 11, § 1 provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAll officers, legislative, executive and judicial, before entering upon the duties of their respective offices, shall take and subscribe the following oath or affirmation: I do solemnly swear (or affirm) that I will support the Constitution of the United States and the constitution of this state, and that I will faithfully discharge the duties of the office of according to the best of my ability. No other oath, affirmation, or any religious test shall be required as a qualification for any office or public trust.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3a Ross held that vicarious liability can only be imposed on governmental agencies \"when its officer, employee, or agent, acting during the course of employment and within the scope of authority, commits a tort while engaged in an activity that is non-governmental or proprietary, or which falls within a statutory exception.\" Ross, supra, p 625. In Ross, of course, the question of constitutional torts was not present.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4a This holding would apply only to actions in our state courts. No intent to judicially abrogate the state's immunity under the Eleventh Amendment of the United States Constitution from suit in federal court is thereby expressed or implied. As the United States Supreme Court stated in Pennhurst State School \u0026 Hosp v Halderman, 465 U.S. 89, 99-100; 104 S Ct 900; 79 L Ed 2d 67 (1984), \" Court consistently has held that a State's waiver of sovereign immunity in its own courts is not a waiver of the Eleventh Amendment immunity in the federal courts.\" Id., p 99, n 9. Thus, waiving immunity to suit in our state courts for violations of our state constitution by the state would not subject the state to suit in federal court for such violations. See, generally, Althouse, How to build a separate sphere: Federal courts and state power, 100 Harv L R 1485 (1987) (federal courts' jurisdictional doctrine should respect state autonomy to develop law and procedure so long as federal goals are adequately implemented). Federal cases have held that state statutes conferring exclusive jurisdiction on specific courts over specific claims against the state do not also waive the state's immunity from similar suits in federal court. See, e.g., McDonald v Illinois, 557 F2d 596, 600-601 (CA 7, 1977), and Richins v Industrial Construction, Inc, 502 F2d 1051 (CA 10, 1974).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5a In Massachusetts, the Civil Rights Act of 1979 provides a remedy for violations of state constitutional rights. See Massachusetts General Laws Annotated, ch 12, §§ 11 H -- 11 I. See also Phillips v Youth Development Program, 390 Mass 652, 657-658; 459 NE2d 453 (1983) (employment discrimination).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6a The Fourth Amendment provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no Warrants shall issue, but upon probable cause, supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7a The pertinent portion of Const 1908, art 2, § 16 provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNo person shall be compelled in any criminal case to be a witness against himself, nor be deprived of life, liberty or property, without due process of law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe first sentence of Const 1963, art 1, § 17, has identical language.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8a Const 1908, art 2, § 1 provides that \" political power is inherent in the people. Government is instituted for their equal benefit, security and protection.\" This provision has been construed as providing equal protection guarantees equivalent to those in the Fourteenth Amendment of the United States Constitution. Gauthier v Campbell, 360 Mich 510; 104 NW2d 182 (1960).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9a The Fourteenth Amendment of the United States Constitution provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eshall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10a See, e.g., Parratt v Taylor, 451 U.S. 527; 101 S Ct 1908; 68 L Ed 2d 420 (1981) (no violation of procedural due process because post-deprivation procedures were sufficient).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11a See, e.g., O'Connor v Donaldson, 422 U.S. 563, 573-576; 95 S Ct 2486; 45 L Ed 2d 396 (1975) (knowing continued confinement of nondangerous and perhaps sane patient in a mental hospital with no treatment violated patient's \"constitutional right to freedom\"); Youngberg v Romeo, 457 U.S. 307, 324; 102 S Ct 2452; 73 L Ed 2d 28 (1982) (patients in state institution for the retarded constitutionally entitled to \"reasonable care and safety, reasonably nonrestrictive confinement conditions, and such training as may be required by these interests\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12a See, e.g., Const 1963, art 1, § 2, thought by many to delegate the creation of remedies for equal protection violations solely to the Legislature. Cramton, The powers of the Michigan Civil Rights Commission, 63 Mich L R 5, 13 (1964). We make no comment on the propriety of this assumption at this time.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 See, e.g., Della Grotta v Rhode Island, 781 F2d 343 (CA 1, 1986) (a state is a \"person\" within § 1983 such that, where it has voluntarily waived its Eleventh Amendment immunity to suit in federal court, it may be held liable in the same respect as municipalities and local units of government); Stanton v Godfrey, 415 NE2d 103 (Ind App, 1981) (the Department of Public Welfare is a person under § 1983 and is a proper defendant); Weisbord v Michigan State Univ, 495 F Supp 1347 (WD Mich, 1980) (a state university, its board of trustees, and president were \"persons\" within the meaning of this section); and Uberoi v Univ of Colorado, 713 P2d 894 (Colo, 1986) (a state university is a \"person\" under § 1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 The Fourteenth Amendment of the United States Constitution provides in pertinent part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNo State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 Dudley v Genesee Co Sheriff, 50 Mich App 678; 213 NW2d 805 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 This Constitution, and the Laws of the United States which shall be made in Pursuance thereof; and all Treaties made, or which shall be made, under the Authority of the United States, shall be the supreme Law of the Land; and the Judges in every State shall be bound thereby, any Thing in the Constitution or Laws of any State to the Contrary notwithstanding. [US Const, art VI, § 2.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 State sovereign immunity has been the subject of a vast commentary. See Borchard, Governmental responsibility in tort, 36 Yale L J 1, 17 (1926); Jaffe, Suits against governments and officers: Sovereign immunity, 77 Harv L R 1 (1963); Note, State remedies for federally-created rights, 47 Minn L R 815 (1963); Wolcher, Sovereign immunity and the Supremacy Clause: Damages against states in their own courts for constitutional violations, 69 Cal L R 189 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 While it is true that suit against state officials is possible in some circumstances, it would be particularly difficult in these cases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 Because of the issues the plaintiffs have raised, these cases would not be barred by the result of Daniels v Williams, 474 U.S. 327; 106 S Ct 662; 88 L Ed 2d 662 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 Note, Rethinking sovereign immunity after Bivens, 57 NYU L R 597, 607 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 Ross v Consumers Power Co (On Rehearing), 420 Mich 567, 591; 363 NW2d 641(1984):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1) All governmental agencies (state and local) are statutorily liable for injuries arising out of the failure to keep highways in reasonable repair (MCL 691.1402; MSA 3.996[102]), negligent operation of a government-owned motor vehicle by an officer, agent, or employee (MCL 691.1405; MSA 3.996[105]), and dangerous or defective conditions in public buildings under the agency's control (MCL 691.1406; MSA 3.996[106]).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2) All governmental agencies (state and local) have tort liability for injuries arising out of the performance of a proprietary function. \"Proprietary function\" is defined as any activity conducted primarily for pecuniary profit, excluding activities normally supported by taxes or fees (see MCL 691.1413; MSA 3.996[113]).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3) . . . An agency's ultra vires activities are . . . not entitled to immunity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4) All governmental agencies (state and local) are vicariously liable for the negligent operation of government-owned motor vehicles by their officers, employees, and agents (MCL 691.1405; MSA 3.996[105]). Vicarious liability for all other torts may be imposed on a governmental agency only when its officer, employee, or agent, acting during the course of his employment and within the scope of his authority, commits a tort while engaged in an activity which is non-governmental or proprietary, or which falls within a statutory exception.\u003c/span\u003e\n\n",
    "body_length": 213145,
    "citedas": [
      "410 N.W.2d 749",
      "428 Mich. 540"
    ],
    "attorneys": "Walz, Jordan \u0026 Stanton, P.C., and John A. Braden for plaintiff Smith. Lick, Emery, DeVine \u0026 Mallory, P.C. (by Lawrence J. Emery), for plaintiff Will. Frank J. Kelley, Attorney General, Louis J. Caruso, Solicitor General, and George L. McCargar and Thomas R. Wheeker, Assistant Attorneys General, for defendants in Smith, and George H. Weller, Assistant Attorney General, for defendants in Will. Amicus Curiae: William Burnham for the American Civil Liberties Union Fund of Michigan.",
    "category": [
      "243",
      "75"
    ],
    "judges": "Dorothy Comstock Riley, C.j., and Charles L. Levin, James H. Brickley, Michael F. Cavanagh, Patricia J. Boyle, and Dennis W. Archer, JJ., concurred. Brickley, J. Riley, C.j., concurred with Brickley, J. Boyle, J. (in Agreement in part and Dissenting in part). Cavanagh, J., concurred with Boyle, J. Levin, J. (separate opinion). Archer, J. (minority OPINION(S)ing). Levin, J., concurred with Archer, J. Robert P. Griffin, J., took no part in the decision of these cases.",
    "citation_count": 13
  }
}
