{
  "id": "67g5TmYBTlTomsSB72i8",
  "document": {
    "title": "State v. Lotter",
    "full_title": "STATE OF NEBRASKA v. JOHN L. LOTTER .",
    "jurisdiction": "Nebraska Supreme Court",
    "date": "1998-11-06T00:00:00.000Z",
    "docket": "Nos. S-96-297, S-96-298, S-96-312.",
    "body": "Appeal from the District Court for Richardson County: ROBERT T. FINN, Judge. Affirmed, and burglary sentence vacated.\n\nAppellant, John L. Lotter, was convicted on three counts of first degree murder, three counts of the use of a weapon to commit a felony, and one count of burglary. Lotter was sentenced to death for each murder conviction and to not less than 80 months; nor more than 20 years; imprisonment for each use of a weapon conviction and the burglary conviction. In this appeal, Lotter contends that he was denied a fair trial because the trial court engaged in an ex parte communication, the prosecutor committed misconduct, the jury was improperly selected and not sequestered, the jury was improperly instructed, defense counsel was ineffective, and the death penalty was improperly imposed. We conclude that Lotter;s burglary sentence must be vacated and that Lotter;s other assignments of error are without merit. We affirm the convictions and vacate Lotter;s burglary sentence.\n\nI. BACKGROUND\n\nTeena Brandon moved to Richardson County, Nebraska, sometime in November 1993. Brandon, a woman, had been presenting herself as a man by the name of \"Charles Brayman.\" Brandon became acquainted with Thomas M. Nissen and Lotter through a mutual friend and had attended some parties with them. Nissen and Lotter later discovered that Brandon was a woman. Angry that they had been deceived, on December 25, they drove her to a rural area and raped her in Lotter;s car.\n\n1. NISSEN;S TESTIMONY\n\nNissen testified on behalf of the State and gave the following account. On Christmas Day 1993, Lotter and Nissen learned that Brandon had reported the rape to the police and began discussing ways to silence Brandon. By December 26, they had decided to kill her.\n\nNissen and Lotter drove to Lincoln, where they had reason to believe they would find Brandon. They brought a hatchet and some nylon rope, and each brought a change of clothing. According to Nissen, they planned to use the hatchet to chop off Brandon;s head and hands so that her body would be difficult to identify. However, their plan went awry when they were unable to locate Brandon.\n\nHaving failed to locate Brandon on December 26, 1993, Nissen and Lotter continued to plan Brandon;s murder. On December 28, Nissen and Lotter were questioned by Officer Keith Hayes of the Falls City Police Department concerning the allegations stemming from Brandon;s rape.\n\nOn December 30, 1993, Nissen and Lotter went to the house of Lotter;s mother, where Lotter picked up two pairs of gloves. They next went to Bill Bennett;s house, where Lotter stole Bennett;s.357 handgun. After retrieving the handgun, Nissen and Lotter drove to Linda Gutierres; house to look for Brandon. Apparently thinking that Brandon was at the Gutierres residence, they put on the gloves and Lotter handed Nissen a knife. Lotter had the handgun in his hand as they walked to the door.\n\nAlthough Brandon was not at the Gutierres residence, Gutierres did tell Nissen and Lotter that Brandon was staying at Lisa Lambert;s house near Humboldt, Nebraska. Nissen and Lotter then proceeded to Humboldt to kill Brandon.\n\nAt approximately 1 a.m. on December 31, 1993, Nissen and Lotter drove Lotter;s car to Lambert;s residence. Nissen drove while Lotter gave directions. Along the way, they drove by the deputy sheriff;s home, apparently to ascertain whether the deputy would be on patrol that night.\n\nWhen they reached Lambert;s residence, Nissen drove down a long gravel driveway and parked the car by the side of the house. Both were wearing gloves when they got out of the vehicle. Lotter was armed with Bennett;s handgun and a knife.\n\nAfter pounding on the door and getting no response, Lotter kicked in the door and they entered Lambert;s home. They entered the bedroom, where they encountered Lambert, who was lying on a waterbed, and her baby, who was in a crib.\n\nNissen asked Lambert where Brandon was and then noticed there was a person under a blanket on the floor at the foot of the bed. Removing the blanket, Nissen discovered Brandon, who apparently had been trying to hide. Nissen grabbed Brandon by the arm and stood her up. Lotter then shot Brandon, who fell supine on the bed. Brandon continued to twitch after being shot, so Nissen proceeded to ensure that she was dead by retrieving the knife from Lotter and stabbing Brandon in the abdomen.\n\nAfter he stabbed Brandon, Nissen picked up the baby and handed the baby to Lambert. As soon as Nissen handed Lambert the baby, Lotter raised the pistol and shot Lambert in the stomach area, but the shot did not kill her. Nissen grabbed the baby and put him back in the crib.\n\nWhile Lambert was still alive, Nissen asked her if anyone else was in the house. Lambert indicated that Phillip DeVine was present, so Lotter left the room to find DeVine.\n\nLotter returned to the room with DeVine and shot Lambert again, this time in the eye. DeVine, who had been pleading for his life, was led back to the living room at Nissen;s suggestion. Nissen told DeVine to sit down, and DeVine complied by sitting on the couch. As soon as DeVine sat down, Lotter shot him twice.\n\nLotter then went back to Lambert;s bedroom. The record indicates Lotter fired two or three more shots to ensure that everyone was dead. Nissen then went back to the bedroom and suggested that he and Lotter leave. Nissen and Lotter then left the house.\n\nNissen drove himself and Lotter back to Falls City. During the return trip to Falls City, Lotter threw the knife and a box containing the handgun into the Nemaha River. When they arrived in Falls City, Nissen and Lotter went to Nissen;s house, where Nissen;s wife, Kandi Nissen, and Rhonda McKenzie, Lotter;s girl friend, were staying. Nissen washed his hands with Clorox because he did not have his gloves on when he stabbed Brandon. Nissen and Lotter then informed Kandi Nissen and McKenzie that if anyone asked, they were home at 1 a.m. It was approximately 3 a.m. at that time.\n\n2. DISCOVERY OF SCENE\n\nAt approximately 10 a.m. on December 31, 1993, Lisa Lambert;s mother, Anna Mae Lambert, stopped by Lambert;s house. When she knocked on the front door, she noticed that the inside door was open, which was unusual considering the weather. No one responded to her knock, and hearing the baby cry, she entered the house.\n\nAnna Mae Lambert noticed DeVine;s body on the floor in the living room, with his back against a couch and his legs underneath a coffee table. She proceeded directly through the living room and the dining room into the bedroom. She picked up the baby, noticed that her daughter;s body was lying on the bed, and called law enforcement.\n\n3. TRIAL AND NISSEN;S AGREEMENT TO TESTIFY\n\nBy Monday morning, May 15, 1995, after voir dire and prior to opening statements, the following exchange occurred outside the presence of the jury:\n\nWith regard to [Nissen;s] Motion to Quash, I had a conversation last night with [Nissen;s counsel] and defense counsel.... Or prosecution, yes. Excuse me. Now, I;m gonna let them explain to you what;s goin; --what the nature of that was, because I think you;re entitled to know, in view of your Motion [in Limine]. Okay.\n\n[PROSECUTION]: Uh -- we;re negotiating an agreement that would have him testify in this matter; it;s not been finalized.\n\nIt has not been finalized?\n\n[PROSECUTION]: No. Oh, yeah, that;s right. The -- and [Nissen;s counsel], I think, agreed to continue his Motion to Quash until such time as Nissen would be called. I think that;s the extent of it.\n\nLotter;s counsel moved for a continuance to take Nissen;s deposi-tion and to delay opening statements until it was known whether Nissen would testify. The trial court denied the continuance.\n\nOn May 17, 1995, during his direct examination, Nissen testified to his understanding of his sentencing agreement. Nissen stated: \"There won;t be a death sentence hearing.\" When asked whether he was going to be put to death, Nissen said, \"No.\" Nissen also testified that he signed a document memorializing the agreement early Monday morning and that his attorney had a copy of the document. He did not mention that two felony charges against him were dropped.\n\nNissen;s deposition had been taken on May 16, 1995, but it had not been transcribed. Prior to Nissen;s direct examination, Lotter;s defense counsel again moved for a continuance until he received the deposition transcript. The court denied the continuance but did provide that defense counsel would not be forced to cross-examine Nissen without having a transcript of the deposition. The transcript was completed that afternoon, and cross-examination was conducted that same day.\n\nOn May 18, 1995, the day after Nissen;s testimony, defense counsel informed the trial court that he had requested a copy of the document evidencing Nissen;s sentencing agreement from the prosecution but was told that he had no right to that document. The Judge indicated that he desired that a copy of the document be put in both the Nissen and the Lotter files. The prosecution responded by stating: \"Well, I;m -- I;m not gonna file it I guess is my position.\" Shortly thereafter, the prosecution denied having a copy of the document evidencing the agreement. After further Discussion, the prosecution admitted that Nebraska State Patrol Investigator Roger Chrans did indeed have a copy of the document. For whatever reason, Chrans later testified that the copy he said he had on May 18 was the \"wrong copy.\" According to Chrans, the version of the document that was eventually filed came from the county attorney. Nonethe-less, defense counsel did obtain a copy of the document from Nissen;s file sometime on May 18.\n\nThe document evidencing the agreement stated in pertinent part:\n\n1. The State of Nebraska agrees not to pursue the death penalty at the sentencing of Marvin Thomas Nissen. The State will not present any evidence of any aggravating circumstances in connection with Mr. Nissen;s sentencing, and the State will not acquiesce to the convening of a three Judge panel. Prior to the finalizing of any agreement, the State will be party to a meeting between attorneys and Judge Finn wherein the State will inform the Judge of no need for the convening of a three Judge panel or the preparation of a presentencing report that may contain evidence of aggravating circumstances. If the Judge agrees to do so, the State does not object to the parties receiving an assurance that Judge Finn would not convene a three Judge panel and would impose life sentences upon Mr. Nissen.\n\n....\n\n3. All other pending charges against Mr. Nissen will be dismissed without prejudice and will not be re-filed except in the event of non-compliance with this Agreement by Mr. Nissen and no new charges will be instituted concerning the events... which occurred on December 24, 1993 through and including December 31, 1993.\n\n4. Mr. Nissen will agree to testify against John L. Lotter, or any other individual when requested to do so by the State in any criminal proceedings.... He will give complete and truthful testimony and answer all prosecution inquiries to the best of his ability and the State agrees that no testimony or other information or any information directly or indirectly derived from such testimony or other information may be used against Mr. Nissen in any criminal case except in prosecution for perjury or giving a false statement.\n\n....\n\n6. Once this agreement has been entered into, Mr. Nissen will give a full and complete recitation of the events leading to the executions of Teena Brandon, Lisa Lambert, and Phillip DeVine.... The primary interviewer will be Investigator Roger L. Chrans of the Nebraska State Patrol. Investigator Chrans will be instructed to immediately terminate the interview if in his opinion Mr. Nissen is in any way evasive or untruthful in his responses to Investigator Chrans; questions.... In the event that the interview is terminated for these reasons the aforementioned agreement is to be immediately declared null and void and the matter will proceed to sentencing....\n\n7. For the safety of the Defendant and as soon as is practicable, the State of Nebraska will assist and make all reasonable efforts to have Mr. Nissen transferred while awaiting sentencing or upon the imposition of sentence imposed by the District Court to an institution in another State.\n\nThere was a typed dateline on the document evidencing the agreement, indicating that it had been signed on May 15, 1995. After the period following the typed \"1995,\" the time was handwritten as \"924 PM,\" and the document was initialed \"JE.\"\n\nNissen gave his first interview to Chrans from approximately 1 to 4:45 a.m. on Monday, May 15, 1995. Chrans conducted a second interview that same day beginning at about 6:30 p.m. and lasting until approximately 10 p.m.\n\nII. ASSIGNMENTS OF ERROR\n\nLotter;s counsel assigns the following as error.\n\n1. The prosecutors and trial court participated in ex parte communications with the prosecutors and provided essential and necessary assurances that the co-defendant, Nissen, would not be subject to the death penalty if he testified against Lotter, in violation of Lotter;s rights under the Nebraska Code of Judicial Conduct; the Code of Professional Responsibility; Neb. Rev. Stat. § 27-605 (Reissue 1995); Neb. Rev. Stat. § 29-2519 et seq. (Reissue 1989 \u0026 Cum. Supp. 1994); Neb. Rev. Stat. §29-2261 (Reissue 1995); Neb. Rev. Stat. § 29-2011.02 (Reissue 1995); Neb. Const. art. I, §§ 3, 11, and 13, art. II, § 1, and art. V, §§ 9 and 14; and the 5th, 6th, 8th, and 14th Amendments to the U.S. Constitution in one or more of the following respects:\n\n1.1. The ex parte communication compromised the impartiality of the trial court.\n\n1.2. The ex parte communication and the trial court;s accession to Nissen;s sentencing agreement violated the separation of powers.\n\n1.3. The ex parte communication rendered the trial Judge an advocate for the prosecution.\n\n1.4. The sentencing agreement contravened §§ 29-2519 et seq., 29-2261, and 29-2011.02.\n\n1.5. The ex parte communication violated Lotter;s right to the assistance of counsel.\n\n1.6. The ex parte communication violated Lotter;s right to an open court.\n\n1.7. The ex parte communication violated Lotter;s right to notice and a hearing.\n\n2. The prosecutors committed repeated acts of prejudicial prosecutorial misconduct, in violation of Lotter;s rights to a fair trial and sentencing under Neb. Rev. Stat. § 29-1912 et seq. (Reissue 1995); Neb. Const. art. I, §§ 3, 9, 11, and art. II, § 1; and the 5th, 6th, 8th, and 14th Amendments in one or more of the following respects:\n\n2.1. The prosecution misrepresented the \"finalization\" of Nissen;s sentencing agreement on the morning of May 15, 1995.\n\n2.2. The prosecution did not disclose the document evidencing Nissen;s sentencing agreement until after Nissen had completed his testimony.\n\n2.3. The prosecution failed to correct falsities in Nissen;s testimony.\n\n2.4. The prosecution suggested to witness James Morehead that Lotter has said he was in \"'trouble.;\"\n\n2.5. The prosecution attempted to elicit information from a witness concerning Lotter;s criminal background and his abuse of his girl friend, McKenzie.\n\n2.6. The prosecution attempted to elicit testimony from Lotter concerning other witnesses; credibility.\n\n2.7. The prosecution made improper comments during closing argument.\n\n2.8. The prosecution violated an order regarding the confidentiality of certain records.\n\n2.9. The prosecution committed cumulative misconduct.\n\n3. The trial court committed plain error when it impaneled a jury that knew Nissen had previously been tried and convicted of the same murders, in violation of Lotter;s rights under Neb. Const. art. I, § 11, and the 6th and 14th Amendments.\n\n4. The trial court erred in denying the motion to prohibit jury dispersal and sequester the jury, in violation of Lotter;s rights under Neb. Const. art. I, § 11, and the 6th and 14th Amendments.\n\n5. The trial court erred in denying the motion to continue when the State disclosed before opening statement that it \"'might;\" have an agreement with Nissen and when the trial court denied the motion to continue when the State called Nissen to testify. Lotter assigns that these actions violate §29-1919(2); Lotter;s right to effective assistance of counsel during opening statements and at trial under Neb. Const. art. I, §§ 3 and 11, and the 6th and 14th Amendments; and his right to a fair and impartial trial under Neb. Const. art. I, §§ 3 and 11, and the 5th, 6th, and 14th Amendments.\n\n6. The trial court erred in overruling hearsay objections to testimony regarding Nissen;s \"'prior consistent;\" statements in violation of Lotter;s right to a fair trial under Neb. Const. art. I, §§ 3 and 11, and the 5th, 6th, and 14th Amendments.\n\n7. There was \"'plain error;\" in the trial of this case when evidence inadmissible under the Nebraska rules of evidence was presented to the jury, in violation of Lotter;s rights under Neb. Const. art. I, § 11, and the 5th, 6th, and 14th Amendments.\n\n8. The trial court erred when it failed to properly instruct, in violation of Lotter;s rights under Neb. Const. art. I, §§ 3 and 11, and the 5th, 6th, 8th, and 14th Amendments, in one or more of the following respects:\n\n8.1. Instruction No. 10 erroneously instructed the jury on aiding and abetting and failed to require that Lotter have the same \"'intent;\" as the principal.\n\n8.2. Instruction No. 8 was erroneous in one or more of the following respects:\n\n8.2.1. It interwove the elements of premeditated and felony murder in a single charge.\n\n8.2.2. It instructed that intent to commit the felony of tampering with a witness was an element of felony murder.\n\n8.2.3. It failed to instruct on the necessary temporal and spatial relationship between a felony and the act of killing in felony murder.\n\n8.2.4. It was an \"'acquit first;\" step instruction that violated the 8th and 14th Amendments and the decision in Beck v. Alabama, 447 U.S. 625, 100 S. Ct. 2382, 65 L. Ed. 2d 392 (1980).\n\n8.3 The trial court failed to give a curative instruction on the use of Nissen;s prior conviction.\n\n9. The court-appointed counsel failed to object to certain inadmissible evidence, failed to make proper objections, and failed to preserve issues for appeal, in violation of Lotter;s rights under Neb. Const. art. I, §§ 3, 11, and 12, and the 6th, 8th, and 14th Amendments.\n\n10. The death sentences and sentences of imprisonment violated Lotter;s rights under § 29-2519 et seq.; Neb. Const. art. II, § 1, and art. I, §§ 1, 3, 6, 9, 11, and 13, and the 5th, 6th, 8th, and 14th Amendments in one or more of the following respects:\n\n10.1. The jury was not unanimous as to the theory of guilt and did not find an \"'intent to kill;\" as required by Neb. Const. art. I, §§ 1, 3, 6, 9, and 11, and the 5th, 6th, 8th, and 14th Amendments.\n\n10.2. The agreement that Nissen would receive a life sentence for his testimony violated §§ 27-605 and 29-2519 et seq.; separation of powers under Neb. Const. art. II, § 1; due process and equal protection of the law under Neb. Const. art. I, §§ 1, 3, 9, 11, and the 5th and 14th Amendments; and the right to be free from arbitrary and capricious infliction of cruel and unusual punishment under Neb. Const. art. I, § 9, and the 8th and 14th Amendments.\n\n10.3. The Nebraska death penalty statutes, § 29-2519 et seq., are unconstitutional in one or more of the following respects:\n\n10.3.1. The death penalty statutes, § 29-2519 et seq., are unconstitutionally vague and overbroad, in violation of due process and equal protection under Neb. Const. art. I, §§ 3 and 11, and the 5th, 6th, 8th, and 14th Amendments.\n\n10.3.2. The death penalty statutes, § 29-2519 et seq., inflict arbitrary, cruel, and unusual punishment, in violation of Neb. Const. art. I, § 9, and the 8th and 14th Amendments.\n\n10.3.3. Section 29-2521 is standardless regarding how the sentencing panel is to perform the sentencing function, in violation of Neb. Const. art. I, § 9, and the 8th and 14th Amendments.\n\n10.4. The failure of the Nebraska district courts and the Nebraska Supreme Court to follow the express statutory requirements regarding procedures for conducting a comparative analysis violated Lotter;s rights in one or more of the following respects:\n\n10.4.1. The Nebraska Supreme Court;s limiting interpretation of comparative review required by §§ 29-2521.02 and 29-2521.03 violates the separation of powers under Neb. Const. art. II, § 1, and the 8th and 14th Amendments.\n\n10.4.2. The failure of Nebraska county attorneys and court personnel to follow the statutory mandate of §§ 29-2521.04 and 29-2524.02 violates Neb. Const. art. I, §§ 3 and 9, and the 5th, 8th, and 14th Amendments.\n\n10.4.3. The established practice of allowing county attorneys to engage in unfettered bargaining on the sentence to be imposed in first degree murder convictions following either a plea or trial violates Neb. Const. art. II, § 1, and art. I, §§ 3, 9, and 11, and the 5th, 8th, and 14th Amendments.\n\n10.5. The death sentences imposed on Lotter were illegal and unconstitutional in one or more of the following respects:\n\n10.5.1. The sentencing panel interpreted and applied §§29-2522 and 29-2521 regarding the burden of proof on aggravating factors and the risk of nonproduction and risk of nonpersuasion regarding mitigating circumstances and acted without standards with which to determine if a sentence of death was disproportionate considering the crime and the defendant, in violation of Neb. Const. art. I, §§ 3 and 9, and the 5th, 8th, and 14th Amendments.\n\n10.5.2. The finding of the second prong of the aggravating circumstance defined by § 29-2523(1)(b), \"'apparent effort to conceal crime/identity,;\" was made pursuant to an unconstitutionally vague and imprecise standard under the 8th and 14th Amendments.\n\n10.5.3. The finding of the second prong of the aggravating circumstance defined by § 29-2523(1)(h), \"'disrupt or hinder the lawful exercise of enforcement of the laws,;\" was made pursuant to an unconstitutionally vague and imprecise standard under the 8th and 14th Amendments.\n\n10.5.4. The sentencing panel failed to make findings regarding the existence of the mitigating factor defined by § 29-2523(2)(b), \"'unusual pressures or influences/domination of another person,;\" pursuant to an incorrect interpretation and application of an unconstitutional standard in violation of the 8th and 14th Amendments.\n\n10.5.5. The sentencing panel failed to make findings regarding the existence of the mitigating factor defined by § 29-2523(2)(c), \"'extreme mental/emotional disturbance,;\" pursuant to an incorrect interpretation and application of an unconstitutional standard, in violation of the 8th and 14th Amendments.\n\n10.5.6. The sentencing panel failed to make full and complete findings regarding the existence of the mitigating factor defined by § 29-2523(2)(g), \"'capacity to conform his conduct... was impaired...;\" pursuant to an incorrect interpretation and application of an unconstitutional standard, in violation of the 8th and 14th Amendments.\n\n10.5.7. The sentencing panel failed to find the mitigating circumstance defined by § 29-2523(2)(d), \"'age of defendant,;\" pursuant to an inaccurate application and interpretation of Nebraska law and shifted the burden to Lotter to prove why he should receive the benefit of this circumstance without prior notice to Lotter of the standard that would be applied, in violation of the 8th and 14th Amendments.\n\n10.5.8. The sentencing panel failed to correctly perform the comparative analysis required by the Nebraska death penalty statutes, § 29-2519 et seq., in violation of the 8th and 14th Amendments.\n\n10.6. The trial court was without jurisdiction when it imposed the prison sentences on February 29, 1996, and the sentences imposed violated the Double Jeopardy Clause of Neb. Const. art. I, §§ 3 and 12, and the 5th and 14th Amendments.\n\n10.7. The Nebraska Supreme Court practice of interpreting death penalty statutes for the first time on appeal, making factual findings, and engaging in \"'reweighing;\" denies meaningful appellate review, denies proper notice of the nature of the proceedings and standards that will be applied, denies an opportunity to be heard, and denies the right to effective representation of counsel, in violation of Neb. Const. art. V, §§ 1 and 9, and art. I, §§ 3, 9, and 23, and the 5th, 6th, 8th, and 14th Amendments.\n\n10.8. The sentences of death are excessive.\n\nIn his pro se brief, Lotter assigns the following as error:\n\n11. The trial court erred in denying Lotter;s motion to quash the amended information in violation of Neb. Const. art. I, § 10, and the 6th and 14th Amendments in one or more of the following respects:\n\n11.1. The amended information improperly joined premeditated murder and felony murder in a single count that did not require the jury to unanimously agree on the facts supporting either premeditated murder or felony murder.\n\n11.2. The amended information charged Lotter with three counts of the offense of felony murder under Neb. Rev. Stat. §28-303(2) (Reissue 1995) and failed to allege an intent to kill.\n\n12. Lotter was deprived of a fair trial due to prosecutorial improprieties during opening and closing arguments.\n\nAfter oral argument, Lotter;s counsel filed a motion asserting:\n\n13. The amendments to § 29-2523, made by 1998 Neb. Laws, L.B. 422, which took effect on July 15, 1998, mitigate Lotter;s punishment, and thus, Lotter must be resentenced.\n\nIII. ANALYSIS\n\n1. NISSEN;S SENTENCING AGREEMENT\n\nLotter asserts that the prosecution and the trial court erroneously engaged in an ex parte communication to obtain assurances from the court that Nissen would receive a life sentence if he testified against Lotter. He argues that this ex parte communication compromised the impartiality of the trial court; violated the separation of powers; rendered the Judge an advocate for the prosecution; contravened Nebraska statutory law regarding sentencing requirements, use immunity, and out-of-state transfer; violated Lotter;s right to the assistance of counsel; violated Lotter;s right to an open court; and violated Lotter;s right to notice and a hearing. The State argues that Lotter has no standing to assert his claims and that the communication at issue was not ex parte.\n\nAs a threshold matter, we address whether the communication concerning Nissen;s sentencing agreement was ex parte. Although this court has not previously defined ex parte communications, Canon 3 of the Nebraska Code of Judicial Conduct provides useful guidance. See State ex rel. Grape v. Zach, 247 Neb. 29, 524 N.W.2d 788 (1994). Canon 3B(7) states that \"[a] Judge shall not initiate, permit or consider ex parte communications or consider other communications made to the Judge outside the presence of the parties concerning a pending or impending proceeding....\" (Emphasis supplied.) The commentary states that \"[t]he proscription against communications concerning a proceeding includes communications from lawyers, law teachers and other persons who are not participants in the proceeding....\" Thus, the canon indicates that an ex parte communication occurs when a Judge communicates with any person concerning a pending or impending proceeding without notice to an adverse party. See, D;Acquisto v. Washington, 640 F. Supp. 594 (N.D. Ill. 1986); Borough of Kennett Square v. Lal, 164 Pa. Commw. 654, 643 A.2d 1172 (1994), appeal denied 540 Pa. 586, 655 A.2d 517 (1994). In the instant case, the communication concerning the sentencing agreement did indeed concern Lotter;s trial, which was pending before the trial court, and neither Lotter nor his counsel was present.\n\nThe State argues that the communication was not ex parte, because it concerned Nissen;s sentencing, not Lotter;s trial, and Lotter was not a party to the State;s proceeding against Nissen. Had the agreement at issue been a plea bargain, we would agree with the State. Nissen would have been granted sentence concessions for pleading guilty, thus receiving a benefit for the relinquishment of a right at issue in Nissen;s case. The plea agreement would have been primarily concerned with the resolution of Nissen;s case and only incidentally concerned with Lotter;s, negating any assertion that such communication was ex parte.\n\nIn the instant case, the benefit Nissen received was in no way conditioned upon his giving up any right in the State;s case against him. He had already been found guilty by a jury. See State v. Nissen, 252 Neb. 51, 560 N.W.2d 157 (1997). The agreement was an inducement to secure Nissen;s testimony at Lotter;s trial, which testimony was presumably subject to use immunity in Nissen;s case. Nissen;s interests were not adverse to those of the State. Rather, the prosecution sought the Judge;s approval on behalf of Nissen. Lotter was the only party whose interests were adverse to those of the State, and neither Lotter nor his counsel had received notice of the communication concerning the agreement. Because the sole purpose of the communication at issue was to secure testimony at Lotter;s trial, we conclude that the communication was ex parte.\n\n1.1. Trial Judge;s Impartiality\n\nHaving determined that the communication at issue was ex parte, we must address Lotter;s contention that it tainted the impartiality of the trial court. In State v. Barker, 227 Neb. 842, 420 N.W.2d 695 (1988), we held that a Judge who initiates, invites, or considers an ex parte communication concerning a pending or impending proceeding before the Judge must recuse himself or herself from the proceedings when a litigant requests such recusal. Moreover, we held that the Judge must recuse himself or herself regardless of whether any prejudice is shown. Id. A litigant need not show that the trial Judge was actually biased by the ex parte communication, because in order to do so, the litigant would have to question the Judge, which would render the Judge a witness at trial, in violation of § 27-605. Accordingly, a litigant need show only that a Judge initiated, invited, or considered an ex parte communication to require the Judge;s recusal.\n\nHowever, we note that not all ex parte communications subject a Judge to recusal. Rather, a trial Judge must recuse himself or herself only when the ex parte communication poses a threat to the Judge;s impartiality. See, State v. Jacob, 253 Neb. 950, 574 N.W.2d 117 (1998) (discussing ex parte communications between Judge and jury); State ex rel. Grape v. Zach, 247 Neb. 29, 524 N.W.2d 788 (1994) (indicating that Canon 3B(7) of Nebraska Code of Judicial Conduct applies); State v. Red Kettle, 239 Neb. 317, 476 N.W.2d 220 (1991) (holding that defendant cannot complain about ex parte communication between defendant and Judge). Although it appears that the ex parte communication at issue in the instant case might have posed a threat to the trial Judge;s impartiality, see Bell v. State, 655 N.E.2d 129 (Ind. App. 1995), we need not determine whether the trial Judge should have recused himself, since Lotter did not request the Judge;s recusal, see State v. Jenson, 232 Neb. 403, 440 N.W.2d 686 (1989). \"One cannot know of improper judicial conduct, gamble on a favorable result by remaining silent as to that conduct, and then complain that he or she guessed wrong and does not like the outcome.\" Id. at 405, 440 N.W.2d at 688.\n\n1.2. Separation of Powers\n\nLotter next asserts that Nissen;s sentencing agreement violated the separation of powers. Article II, § 1, of the Nebraska Constitution expressly provides that \"[t]he powers of the government of this state are divided into three distinct departments, the legislative, executive and judicial, and no person or collection of persons being one of these departments, shall exercise any power properly belonging to either of the others, except as hereinafter expressly directed or permitted.\"\n\n\"While the prosecutor may participate in the sentencing proceedings... the prosecutor may not control or decide what the punishment shall be.\" State v. Dykes, 163 Ariz. 581, 584, 789 P.2d 1082, 1085 (Ariz. App. 1990). The discretion to determine the appropriate sentence is vested in the judiciary. See, State v. Lee, 237 Neb. 724, 467 N.W.2d 661 (1991); State v. Evans, 194 Neb. 559, 234 N.W.2d 199 (1975). In the exercise of that discretion, it is proper for a trial court to grant sentence concessions to defendants who plead guilty when the interest of the public in the effective administration of criminal Justice would be served. State v. Black Bear, 187 Neb. 670, 193 N.W.2d 563 (1972). Such concessions should originate with the parties; trial courts may not bargain with defendants regarding their sentences without impinging upon the trial courts; discretion. State v. Evans, supra. Moreover, trial courts should not participate in plea negotiations leading to sentence concessions. Id., citing the ABA Standards Relating to Pleas of Guilty. But see State v. Minshall, 227 Neb. 210, 416 N.W.2d 585 (Neb. 1987) (holding that this court has not adopted ABA standards for criminal Justice and is not bound by those standards).\n\nIn the instant case, the trial court did indeed participate in the negotiations at issue. A trial court;s indication of sentence necessarily constitutes participation in sentencing negotiations because the \"Judge;s response... becomes the essential element in the ensuing Discussions.\" United States v. Werker, 535 F.2d 198, 203 (2d Cir. 1976), cert. denied, Santos-Figueroa v. United States, 429 U.S. 926, 97 S. Ct. 330, 50 L. Ed. 2d 296. Accord U.S. v. Daigle, 63 F.3d 346 (5th Cir. 1995). However, in State v. Evans, supra, we stated that the trial court may indicate whether it will concur in an agreement granting sentence concessions that is proposed by the parties. Although such an indication constitutes participation by the trial court, this court has held that a trial court;s participation does not render a plea invalid per se. State v. Ditter, 232 Neb. 600, 441 N.W.2d 622 (1989) (upholding trial court;s indication that it would impose life sentence for first degree murder if defendant pled guilty).\n\nWe add that an indication of the sentence a trial court will impose does not bind the trial court. State v. Evans, supra. Regardless of whether the trial court gave Nissen \"assurances\" or even a \"guarantee\" of what sentence the court would impose, the trial court;s sentencing indication was, in legal terms, an indication and nothing more. See State v. Griger, 190 Neb. 405, 208 N.W.2d 672 (1973) (stating that if trial courts were bound by plea agreements, then judicial authority would be transferred to prosecution). A trial court that is not bound has not ceded its authority and, thus, has not violated the doctrine of separation of powers.\n\n1.3. Judge as Advocate\n\nLotter;s next line of argument asserts that the trial court became an advocate against Lotter by securing Nissen;s testimony. In U.S. v. Giraldo, 822 F.2d 205 (2d Cir. 1987), cert. denied 484 U.S. 969, 108 S. Ct. 466, 98 L. Ed. 2d 405, the trial court threatened to impose a lengthy sentence on a co-defendant and to hold him in contempt if he did not testify at the defendant;s trial. On appeal, the defendant argued that the trial court had unfairly assisted the prosecution in obtaining evidence and that it is improper for a trial court to use coercion to \"induce a recalcitrant witness to testify against a defendant in a criminal trial.\" Id. at 209. In response to this contention, the court stated that it \"borders on the frivolous. The court and the jury are entitled to know the relevant evidence possessed by any witness....\" Id. Even though the appellate court agreed with the defendant that the coercive measures used by the trial court to obtain the co-defendant;s testimony exceeded the bounds of propriety, the appellate court concluded that such coercion did not render the defendant;s trial unfair. \"[T]hough [the defendant] plainly was disadvantaged by having [the co-defendant] testify against him, he obviously had no privilege to have [the co-defendant;s] testimony withheld, and... suffered no prejudice in the eyes of the law.\" Id. at 211.\n\nIn Carey v. State, 43 Md. App. 246, 405 A.2d 293 (1979), cert. denied 445 U.S. 967, 100 S. Ct. 1660, 64 L. Ed. 2d 244 (1980), the defendant argued that the Judge actively assisted the State in his prosecution by acceding to \"the State;s suggestion to grant a defendant in another case a new trial and accept a plea of nolo contendere whereby that defendant received a suspended sentence for obstruction of Justice (rather than perjury) so he would be available to testify for the State in the on-going investigation,\" which investigation included the defendant. 43 Md. App. at 249-50, 405 A.2d at 296. The court rejected that argument, stating that even when a Judge thinks his actions will be helpful in ferreting out the truth, such action cannot be equated with judicial bias likely to prevent a fair trial. Agreeing to sentence concessions to secure a criminal defendant;s testimony at a co-defendant;s trial is a legitimate prosecutorial function. United States v. Escobar Noble, 653 F.2d 34 (1st Cir. 1981). Likewise, the trial court;s agreement to a sentencing concession that is otherwise legitimate is a legitimate judicial function. See State v. Black Bear, 187 Neb. 670, 193 N.W.2d 563 (1972). The trial court;s dispatch of a legitimate judicial function does not indicate that the trial court is unfairly assisting the prosecution in its role.\n\n1.4. Legality of Agreement\n\nLotter contends that Nissen;s sentencing agreement violated several statutes: § 29-2519 et seq., dealing with special procedures in cases of homicide; § 29-2261, dealing with presentence investigations; § 29-2011.02, dealing with use immunity; and Neb. Rev. Stat. § 29-1004 (Reissue 1995), dealing with out-of-state transfers. We do not address the merits, however, since Lotter does not have standing to assert the illegality of Nissen;s sentencing agreement. See, U.S. v. Ivy, 83 F.3d 1266 (10th Cir. 1996), cert. denied ___ U.S. ___, 117 S. Ct. 253, 136 L. Ed. 2d 180; State v. Baker, 270 N.J. Super. 55, 636 A.2d 553 (1994), aff;d 138 N.J. 89, 648 A.2d 1127; Com. v. Wallace, 522 Pa. 297, 561 A.2d 719 (1989).\n\n\"Standing\" means that a person has a sufficient legally protectable interest which may be affected in a justiciable controversy, entitling that person to judicial resolution of the controversy. State v. Stott, 243 Neb. 967, 503 N.W.2d 822 (1993). In the instant case, Lotter does not explain what protectable interest he had in the merits of Nissen;s sentencing. In State v. Baker, supra, the court addressed whether the defendant;s due process rights were violated when the \"prosecutor promised, and the court accepted, a plea bargain with [a] co-defendant... requiring [the co-defendant] to testify against defendant in exchange for an illegally short sentence.\" State v. Baker, 270 N.J. Super. at 69, 636 A.2d at 560. The court stated:\n\n[I]t does not follow that a plea bargain involving an illegal sentence denies due process of law to a defendant against whom the person receiving the benefit of the bargain gives testimony. There is always a danger that an accused who is offered a plea bargain under which he will receive a reduced sentence in exchange for his testifying against another person will give false testimony.... However, the risk of encouraging perjured testimony is substantially the same regardless of whether a plea offer involves a lenient legal sentence or a lenient illegal sentence.\n\n....\n\nThus, while the jury was not made aware that [the co-defendant;s sentence was illegal], it undoubtedly understood that he had received a reduced sentence in exchange for agreeing to testify against defendant.\n\nId. at 70-71, 636 A.2d at 561. Accordingly, the court held that the defendant;s due process rights were not violated.\n\nIn the absence of the violation of a legally protectable interest inuring to Lotter, there is no justiciable controversy. In U.S. v. Ivy, supra, the court addressed this issue and held that certain defendants did not have standing to challenge certain co-defendants; guilty pleas. The court stated:\n\n[I]n order to accept their position, we would be required to hold that in every case in which some defendants choose to plead guilty while others choose to stand trial, a very common situation indeed, those who go to trial have standing to challenge the validity of their co-defendants; plea agreements and the factual bases of their guilty pleas. Such challenges would require the government to prove the factual representations made in the plea agreements and during the plea colloquies of any co-defendants from whom it planned to elicit testimony. It would also force the district court and the court of appeals to entertain what would essentially be a collateral attack on a guilty plea by those who chose to stand trial, whether or not the party who pled guilty has any desire to challenge his conviction. We are unwilling to impose such burdens on the government and the courts or to so completely pervert the existing procedures.\n\n83 F.3d at 1282-83. This assignment of error is without merit.\n\n1.5. Right to Assistance of Counsel\n\nLotter also argues that the ex parte communication denied him his Sixth Amendment right to counsel. The Sixth Amendment to the U.S. Constitution guarantees that \"[i]n all criminal prosecutions, the accused shall enjoy the right... to have the Assistance of Counsel for his defence.\" A criminal defendant;s Sixth Amendment right to the assistance of counsel attaches only after the initiation of adversary judicial criminal proceedings --whether by way of formal charge, preliminary hearing, indictment, information, or arraignment. State v. Robinson, 233 Neb. 729, 448 N.W.2d 386 (1989). Once the right has attached, the accused is entitled to counsel at every critical stage of the proceeding. United States v. Wade, 388 U.S. 218, 87 S. Ct. 1926, 18 L. Ed. 2d 1149 (1967); State v. Moore, 203 Neb. 94, 277 N.W.2d 554 (1979).\n\nThere is no dispute that the ex parte communication in the instant case occurred after adversarial judicial proceedings had been instituted against Lotter. That being so, we need determine only whether the ex parte communication pertained to a critical stage of Lotter;s prosecution. \"[I]n addition to counsel;s presence at trial, the accused is guaranteed that he need not stand alone against the State at any stage of the prosecution, formal or informal, in court or out, where counsel;s absence might derogate from the accused;s right to a fair trial.\" United States v. Wade, 388 U.S. at 226. Thus, to determine whether a proceeding is critical within the meaning of the Sixth Amendment right to counsel, we must examine \"the event in order to determine whether the accused required aid in coping with legal problems or assistance in meeting his adversary.\" United States v. Ash, 413 U.S. 300, 313, 93 S. Ct. 2568, 37 L. Ed. 2d 619 (1973). In other words, when counsel;s presence will not assist the accused in protecting his or her rights, that stage of the prosecution is not critical. United States v. Wade, supra, citing Schmerber v. California, 384 U.S. 757, 86 S. Ct. 1826, 16 L. Ed. 2d 908 (1966).\n\nLotter relies on Yohn v. Love, 76 F.3d 508 (3d Cir. 1996), wherein the court held that an ex parte communication between the trial court, the prosecutor, and the state supreme court chief Justice violated the defendant;s Sixth Amendment right to the assistance of counsel. The prosecutor had earlier called the chief Justice to complain about an evidentiary ruling made by the trial Judge, and the chief Justice had returned the call. The ex parte communication was conducted by telephone and occurred in the trial Judge;s chambers during trial. Defense counsel was not allowed to participate in the communication because there were not enough telephones. Once the trial Judge and the prosecutor finished talking with the chief Justice, the trial Judge told both parties that he was going to overrule his previous evidentiary ruling.\n\nIn determining that the ex parte communication violated the defendant;s right to counsel, the court announced the following test: \"'\"Critical stages\" are those links in the prosecutorial chain of events in which the potential for incrimination inheres or at which the opportunity for effective defense must be seized or foregone.;\" Id. at 522, quoting United States ex rel. Reed v. Anderson, 461 F.2d 739 (3d Cir. 1972). In applying this test, the court noted that the only way defense counsel could have \"effectively defended [the defendant;s] position was to be able to participate contemporaneously in the telephone conversation with the Chief Justice.\" Id. Because defense counsel was not allowed to participate and argue the defendant;s position, the trial Judge changed his ruling, and therefore, the opportunity for an effective defense was forgone.\n\nIn United States v. Wade, 388 U.S. 218, 87 S. Ct. 1926, 18 L. Ed. 2d 1149 (1967), the Court stated that certain pretrial procedures, such as the scientific analysis of fingerprints, blood samples, clothing, and hair, may not be critical stages of a prosecution, since \"the accused has the opportunity for a meaningful confrontation of the Government;s case at trial through the ordinary processes of cross-examination of the Government;s expert witnesses and the presentation of the evidence of his own experts.\" 388 U.S. at 227-28. See, also, State v. Wilbur, 186 Neb. 306, 182 N.W.2d 906 (1971) (holding that autopsy is medical procedure and that such procedure is not critical stage of proceedings). In other words, even though certain identification procedures may be critical to a defendant;s guilt or innocence, they are not \"critical\" within the meaning of the Sixth Amendment. See United States v. Ash, 413 U.S. at 316 (stating that analysis in United States v. Wade, supra, \"merely carries one to the point where one must establish that the trial itself can provide no substitute for counsel if a pretrial confrontation is conducted in the absence of counsel\").\n\nThe above cases demonstrate that the ex parte communication in the instant case was not a \"critical stage\" of the proceedings against Lotter. Unlike the communication in Yohn v. Love, supra, the communication in the instant case did not leave Lotter without an effective defense. As we have already determined, Lotter had no standing to raise any legal issues concerning Nissen;s sentencing agreement. The danger presented by the communication was the potential for bias the trial Judge created or evidenced by its ex parte nature. Indeed, had the trial Judge not been directly involved in the negotiation of the agreement, neither Lotter nor his counsel would have had any right to be present. See State v. Gray, 347 N.C. 143, 491 S.E.2d 538 (1997), cert. denied ___ U.S. ___, 118 S. Ct. 1323, 140 L. Ed. 2d 486 (1998). Although defense counsel;s presence could have effectively ensured the trial court was not biased by the communication, the opportunity for effective defense was not forgone. Just as the Wade Court indicated that the absence of defense counsel at scientific testing can be effectively remedied by cross-examination at trial, any dangers presented by the absence of counsel in the instant case could have been effectively remedied by requesting the recusal of the trial Judge. This assignment of error is without merit.\n\n1.6. Right to Open Court\n\nLotter also asserts that the ex parte communication should have been preserved on the record pursuant to article I, § 13, of the Nebraska Constitution, which provides that \"[a]ll courts shall be open, and every person... shall have a remedy by due course of law, and Justice administered.\" However, as we stated in Pullen v. Novak, 169 Neb. 211, 215-16, 99 N.W.2d 16, 21 (1959):\n\n\"Aricle I, § 13, of the Constitution of the State of Nebraska does not create any new rights but is merely a declaration of a general fundamental principle. It is a primary duty of the courts to safeguard this declaration of right and remedy but, where no right of action is given or remedy exists under either the common law or some statute, this constitutional provision creates none.\"\n\nThe remedy for failure to preserve ex parte communications is recusal of the trial Judge, which was waived in the instant case.\n\n1.7. Right to Notice and Hearing\n\nOnce again, the appropriate remedy was recusal.\n\n2. PROSECUTORIAL MISCONDUCT\n\nLotter asserts that the prosecutors committed repeated acts of prosecutorial misconduct, including the misrepresentation that Nissen;s sentencing agreement was not \"'finalized,;\" brief for appellant at 55, on the morning of May 15, 1995; the failure to disclose the Nissen document until after Nissen had completed his testimony; the failure to correct falsities in Nissen;s testimony; the suggestion to witness Morehead that Lotter had said he was in \"'trouble,;\" brief for appellant at 70; the attempt to elicit information from a witness concerning Lotter;s criminal background and his abuse of his girl friend, McKenzie; the attempt to elicit testimony from a witness concerning another witness; credibility; the improper comments during closing arguments; the violation of the order regarding the confidentiality of certain records; and cumulative misconduct.\n\n2.1. Finalization of Agreement\n\nLotter argues that the prosecutor committed misconduct by misrepresenting the time at which the agreement was actually finalized. According to Lotter, the agreement was actually \"finalized\" early Monday morning, rather than Monday evening as indicated by the prosecutor. Lotter asserts that had he known the agreement was finalized prior to opening statements, his opening statement would have been substantially more effective. Accordingly, he argues that the prosecution;s misrepresentation to the court and his defense counsel as to the time the agreement was finalized amounted to prosecutorial misconduct. Relying on DeMarco v. United States, 415 U.S. 449, 94 S. Ct. 1185, 39 L. Ed 2d 501 (1974), Lotter asserts that the instant case should be remanded for an evidentiary hearing to make a factual determination concerning the alleged misrepresentation.\n\nIn DeMarco, a prosecution witness that had been indicted along with the defendant testified at the defendant;s trial and stated that the prosecution had made no promises to him with respect to the Disposition of his case. The defendant was convicted, and he appealed. Meanwhile, the witness/co-indictee pled guilty to a lesser charge, and at his sentencing hearing, the prosecution made certain statements that apparently indicated that the promise had been made prior to the witness/co-indictee;s testimony. Although the defendant did not present the matter to the district court, raising it for the first time on appeal, the U.S. Court of Appeals addressed the issue and determined that the promises had not been made to the witness/co-indictee prior to his testifying.\n\nThe U.S. Supreme Court noted that had the promise been made prior to the witness/co-indictee;s testimony, the defendant;s case would have to be reversed. The Court also noted that it was clear that some type of plea bargain had occurred, the question being whether it was made after or before the defendant;s trial. Because the factual issue was dispositive of the case, the Court granted certiorari, vacated the judgment of the U.S. Court of Appeals, and remanded the case with instructions to remand to the district court for further proceedings consistent with the Court;s opinion.\n\nThe DeMarco Court held that when a factual issue arises after trial that would be dispositive of the case, the factual issue cannot be determined on appeal, but, rather, the case must be remanded for a determination in the trial court. Thus, as a threshold matter, we must determine whether there is a genuine factual issue as to when the agreement was finalized.\n\nOur review of the record indicates that the agreement may have been \"finalized\" early on the morning of May 15, 1995, and not that evening as suggested by the prosecution. First, the agreement provided that Nissen would speak with Chrans \"[o]nce this agreement has been entered into,\" and Nissen spoke with Chrans between 1 and 4:45 a.m. on Monday. Why would Nissen speak to Chrans if the agreement had not been finalized?\n\nSecond, Nissen testified that he signed the agreement early Monday morning. Considering that the agreement would be rendered null and void if Nissen;s testimony was perjured, what incentive would Nissen have to lie about when the agreement was signed?\n\nThird, the time written on the agreement is less than convincing. The following is typed at the bottom of the agreement: \"Dated this _____ day of May, 1995.\" The date is written in as the \"15th.\" After the period following \"1995,\" the following is handwritten: \"924 PM\" and the initials \"JE.\" If the time had been on the original agreement, why did the typed language not read as follows: \"Dated this _____ day of May, 1995, at ____.\"? Signed initials usually indicate that a document has been altered.\n\nFourth, on May 15, 1995, at trial, when the prosecutor stated that the agreement was not finalized, the Judge responded by asking, \"It has not been finalized?\" The prosecutor then noted that Nissen;s counsel had \"agreed to continue his Motion to Quash until such time as Nissen could be called.\"\n\nFinally, when Lotter;s counsel asked for a copy of the agreement on May 18, 1995, after Nissen testified, the prosecution denied having a copy of the agreement and when pressed, admitted that Chrans had a copy. Chrans later testified that the copy he had that day was the \"wrong copy\" and that a different copy had been filed by the prosecutor.\n\nThe facts indicate and it is reasonable to conclude that the sentencing agreement was signed early Monday morning. Because the prosecutor stated that the agreement was not finalized at that time, there is a genuine factual issue as to when the agreement was actually \"finalized.\"\n\nHowever, even assuming that the resolution of this factual issue would be dispositive of the instant case, we nonetheless conclude that a remand is not required. The instant case is unlike DeMarco v. United States, 415 U.S. 449, 94 S. Ct. 1185, 39 L. Ed. 2d 501 (1974), where the factual issue did not appear until after the defendant;s trial had concluded. All of the facts which indicate there is a genuine issue concerning the finalization of Nissen;s sentencing agreement arose before Lotter;s trial was completed. Had Lotter thought there was a factual issue that was dispositive of his case, he could have raised that issue at trial as soon as the underlying facts were known to him. When an issue has not been raised or ruled on at the trial level and the matter necessitates an evidentiary hearing, an appellate court will not address the matter on direct appeal. State v. Cody, 248 Neb. 683, 539 N.W.2d 18 (1995). Because Lotter could have raised this issue at trial and had an evidentiary hearing at that time, he is not entitled to a remand.\n\n2.2. Disclosure of Agreement\n\nFirst thing in the morning on May 18, 1995, the day after Nissen testified, defense counsel informed the court that he had asked for a copy of Nissen;s sentencing agreement and that the special prosecutor would not provide one. After being ordered by the court to put a copy of the document in Lotter;s file, the special prosecutor stated, \"I;m not gonna file it I guess is my position.\" Nonetheless, after further Discussion, the special prosecutor did agree to place a copy in Nissen;s file. Lotter argues that the special prosecutor;s failure to disclose the written sentencing agreement until after Nissen;s testimony violated the U.S. Constitution and § 29-1912. During his direct testimony, Nissen did not mention that certain felony charges against him would be dismissed in exchange for his testimony.\n\nAlthough we have stated that \"[a] defendant in a criminal proceeding has no general due process right to discovery,\" State v. Tuttle, 238 Neb. 827, 834, 472 N.W.2d 712, 717 (1991), that a criminal defendant has a right to certain disclosure is made clear by Kyles v. Whitley, 514 U.S. 419, 115 S. Ct. 1555, 131 L. Ed. 2d 490 (1995). The U.S. Supreme Court has held that \"the suppression by the prosecution of evidence favorable to an accused upon request violates due process where the evidence is material either to guilt or to punishment, irrespective of the good faith or bad faith of the prosecution.\" Brady v. Maryland, 373 U.S. 83, 87, 83 S. Ct. 1194, 10 L. Ed. 2d 215 (1963). \"[F]avorable evidence is material, and constitutional error results from its suppression by the government,'if there is a reasonable probability that, had the evidence been disclosed to the defense, the result of the proceeding would have been different.;\" Kyles v. Whitley, 514 U.S. at 433, quoting United States v. Bagley, 473 U.S. 667, 105 S. Ct. 3375, 87 L. Ed. 2d 481 (1985).\n\nFour aspects of materiality under Bagley bear emphasis:\n\n[1] Although the constitutional duty is triggered by the potential impact of favorable but undisclosed evidence, a showing of materiality does not require demonstration by a preponderance that disclosure of the suppressed evidence would have resulted ultimately in the defendant;s acquittal (whether based on the presence of reasonable doubt or acceptance of an explanation for the crime that does not inculpate the defendant).... Bagley;s touchstone of materiality is a \"reasonable probability\" of a different result, and the adjective is important.... A \"reasonable probability\" of a different result is accordingly shown when the government;s evidentiary suppression \"undermines confidence in the outcome of the trial.\"...\n\n[2] The second aspect of Bagley materiality bearing emphasis here is that it is not a sufficiency of evidence test. A defendant need not demonstrate that after discounting the inculpatory evidence in light of the undisclosed evidence, there would not have been enough left to convict....\n\n[3] Third... once a reviewing court applying Bagley has found constitutional error there is no need for further harmless-error review....\n\n[4] The fourth and final aspect of Bagley materiality to be stressed here is its definition in terms of suppressed evidence considered collectively, not item by item.\n\nKyles v. Whitley, 514 U.S. at 434-36. Perhaps the most important aspect of the Bagley decision is its holding that evidence that might be used to impeach the prosecution;s witnesses is \"'evidence favorable to the accused;... so that, if disclosed and used effectively, it may make the difference between conviction and acquittal.\" United States v. Bagley, 473 U.S. at 676, quoting Brady v. Maryland, supra. See Giglio v. United States, 405 U.S. 150, 92 S. Ct. 763, 31 L. Ed. 2d 104 (1972). See, also, Kyles v. Whitley, 514 U.S. at 445 (stating that \"the effective impeachment of one eyewitness can call for a new trial even though the attack does not extend directly to others\"); State v. Brown, 214 Neb. 665, 674, 335 N.W.2d 542, 547 (1983) (stating that \"[m]atters affecting the credibility of a critical or major witness are material to the defense in a criminal case\").\n\nThe testimony of co-defendants rendered pursuant to a plea agreement has long been suspect, see NJI2d Crim. 5.6, and a plea or sentencing agreement is clearly relevant to impeachment. Having determined that prosecutorial inducements given to a witness to testify fall within the purview of Brady v. Maryland, supra, the question is whether the document detailing Nissen;s sentencing agreement was material. At trial, when asked about the contents of the agreement, Nissen failed to testify to the fact that the agreement also provided that a presentence report would not be compiled, that a three-Judge panel would not be convened, that the additional felony charges filed against him would be dismissed, that he sought assurances from the Judge that the court would honor the agreement, and that his sentencing would occur after Lotter;s.\n\nIn U.S. v. Smith, 77 F.3d 511 (D.C. Cir. 1996), the court held that the prosecution;s failure to disclose certain aspects of a testifying co-defendant;s plea agreement was a material Brady violation. See Brady v. Maryland, 373 U.S. 83, 83 S. Ct. 1194, 10 L. Ed. 2d 215 (1963). The prosecution had disclosed via letter to defense counsel that a plea agreement had been struck that dismissed several counts against the co-defendant in exchange for his plea of guilty to one count and his testimony against the defendant. The letter did not disclose that the prosecution had dismissed two other felony counts against the co-defendant, nor did it disclose certain evidence regarding the co-defendant;s psychiatric history. On appeal, the government argued that the unrevealed dismissal of the two felony counts amounted merely to cumulative impeachment material and that absent the co-defendant;s testimony, the result would have been the same.\n\nThe court rejected the notion that the result would have been the same even if the co-defendant had not testified, noting that \"[t]here is no way to know this.\" U.S. v. Smith, 77 F.3d at 515. The court pointed out that the materiality test is not a sufficiency-of-the-evidence test, stating that the relevant inquiry is \"whether the undisclosed information could have substantially affected the efforts of defense counsel to impeach the witness, thereby calling into question the fairness of the ultimate verdict.\" Id.\n\nIn answering this question, the Smith court noted that defense counsel was able to cross-examine the co-defendant concerning the dismissal of 10 charges against the co-defendant and his guilty plea to 1 charge. However, the Smith court rejected the government;s assertion that any further cross-examination on the two additional charges would have been merely cumulative: \"'[T]he fact that other impeachment evidence was available to defense counsel does not render additional impeachment evidence immaterial.;\" Id., quoting United States v. O;Conner, 64 F.3d 355 (8th Cir. 1995). According to the court, one must \"look not to the ways defense counsel was able to impeach [the co-defendant], but to the ways in which the witness; testimony was allowed to stand unchallenged.\" Id.\n\nIn Smith, supra, the unchallenged testimony was the co-defendant;s assertion that the only inducements he was receiving for his testimony were those contained in the plea letter. According to the court, if defense counsel had full knowledge of the plea, he could have \"pursued devastating cross-examination... suggesting that the witness might have deliberately concealed the other favors from the Government that were not in the written plea agreement.\" 77 F.3d at 516. The court concluded that the potential impact of such a cross-examination was sufficient to undermine confidence in the outcome of the trial and, thus, required reversal.\n\nAccording to the court;s analysis in Smith, supra, evidence that Nissen, an accomplice who was receiving the benefit of a dismissal of serious charges in order to testify, failed to testify to the dismissal of those charges is material. If defense counsel had Nissen;s sentencing document during Nissen;s cross-examination, defense counsel could have pursued a more effective cross-examination. Finally, we note that the prosecution;s evident concern about disclosing the document is strong evidence that the document was material, exculpatory evidence. See United States v. Jackson, 780 F.2d 1305 (7th Cir. 1986). Thus, we conclude that the sentencing document was \"material.\"\n\nThe materiality of Nissen;s sentencing agreement is not, however, dispositive. Because Lotter;s counsel had access to the agreement prior to the Conclusion of the trial, the question is whether the belated nature of the disclosure was sufficient to constitute a constitutional violation.\n\nThe U.S. Court of Appeals for the Eighth Circuit has held that \"[w]here the prosecution delays disclosure of evidence, but the evidence is nonetheless disclosed during trial, Brady is not violated.\" U.S. v. Gonzales, 90 F.3d 1363, 1368 (8th Cir. 1996). See Brady v. Maryland, 373 U.S. 83, 83 S. Ct. 1194, 10 L. Ed. 2d 215 (1963). The First Circuit has held that belated disclosure may violate Brady: \"[T]he critical question was whether the delay had'prevented [the material;s] effective use by the defense;... and that some showing of prejudice was required beyond mere assertions that the defendant would have conducted cross-examination differently.\" U.S. v. Walsh, 75 F.3d 1, 8 (1st Cir. 1996). To determine whether the belated disclosure of material evidence amounts to a constitutional violation, the 11th Circuit has considered the reasons for the delay in complying with discovery, whether there was any bad faith on the part of the prosecution, whether there was prejudice to the defendant, and the availability of a means to cure the prejudice, including continuances and recesses. U.S. v. Turner, 871 F.2d 1574 (11th Cir. 1989).\n\nWe find the Eighth Circuit;s rule to be the most persuasive. Applying the Eighth Circuit;s rule to the instant case, we can conclude only that there was no constitutional violation, because the material evidence was disclosed prior to the close of trial.\n\nNonetheless, in Nebraska, discovery in criminal cases is also governed by statute. \"[D]iscovery in a criminal case is generally, and in the absence of a constitutional requirement, controlled by either a statute or court rule.\" State v. Tuttle, 238 Neb. 827, 834, 472 N.W.2d 712, 717 (1991). This court has addressed the discovery rights of a criminal defendant under §29-1912 and has defined \"materiality\" more broadly than the\n\nU.S. Constitution, which requires a reasonable probability of a different result. See State v. Brown, 214 Neb. 665, 335 N.W.2d 542 (1983).\n\nWhile Brady v. Maryland, 373 U.S. 83, 83 S. Ct. 1194, 10 L. Ed. 2d 215 (1963), and Kyles v. Whitley, 514 U.S. 419, 115 S. Ct. 1555, 131 L. Ed. 2d 490 (1995), impose a constitutional mandate for disclosure in criminal cases, a statutory design for discovery such as § 29-1912 can exact more than the constitutional minimum, so that courts must focus on information potentially useful to the defense.... Under § 29-1912, whether a prosecutor;s failure to disclose evidence results in prejudice depends on whether the information sought is material to the preparation of the defense, meaning that there is a strong indication that such information will play an important role in uncovering admissible evidence, aiding preparation of witnesses, corroborating testimony, or assisting impeachment or rebuttal.\n\n(Emphasis supplied.) State v. Kula, 252 Neb. 471, 486, 562 N.W.2d 717, 727 (1997).\n\nThus, under § 29-1912, evidence is material when there is a strong indication that it will play an important role in, among other things, assisting impeachment or rebuttal. State v. Dyer, 245 Neb. 385, 513 N.W.2d 316 (1994); State v. Brown, 214 Neb. at 674, 335 N.W.2d at 547 (stating that \"[m]atters affecting the credibility of a critical or major witness are material to the defense in a criminal case\"). As we have already determined that due to its impeachment value, the sentencing agreement was material under Brady v. Maryland, 373 U.S. 83, 83 S. Ct. 1194, 10 L. Ed. 2d 215 (1963), it necessarily meets the \"important role\" standard of § 29-1912.\n\nHowever, as in the constitutional context, the document;s materiality under § 29-1912 is not dispositive. We must still determine whether the prosecution;s delay in disclosure violated § 29-1912. In State v. Kula, supra, the trial Judge ordered that the prosecutor turn over police reports prepared during an investigation of two suspects other than the defendant. The prosecutor did not release these reports until the first day of trial. This court held that the reports were material because they would have led to the discovery of other witnesses and that it was error not to grant a continuance to the defendant in light of the prosecution;s delay in producing the reports. It follows that the holding in Kula was premised on the trial court;s failure to grant the requested continuance, not on the discovery violation itself.\n\nThus, although Kula clearly indicates that belated disclosure may violate § 29-1912, see, also, State v. Neujahr, 248 Neb. 965, 540 N.W.2d 566 (1995), it also indicates that in some circumstances, the prejudice caused by such a disclosure may be remedied by a properly granted continuance. If a continuance would not have been a sufficient remedy for the belated disclosure in Kula, this court could not have concluded that the trial court had erred in failing to grant the continuance. Indeed, the issue would never have been reached, because the discovery violation would have required reversal in and of itself. Obviously, a continuance will not cure every instance of belated disclosure (lost or destroyed evidence, missing witnesses, et cetera). Nonetheless, when a continuance will cure the prejudice caused by belated disclosure, a continuance should be requested by counsel and granted by the trial court. See U.S. v. Turner, 871 F.2d 1574 (11th Cir. 1989).\n\nIn the instant case, the prosecution;s delay in the disclosure of Nissen;s sentencing document, like the prosecution;s delay in the disclosure of the police reports in Kula, violated § 29-1912. However, the belated disclosure in the instant case was likewise remediable by continuance, which would have given Lotter;s counsel time to analyze the document and recall Nissen, who was still available for further cross-examination. Although defense counsel had earlier sought two continuances regarding Nissen;s testimony, defense counsel failed to do so for the purpose of analyzing a copy of the sentencing agreement. Therefore, we conclude that under the circumstances in the instant case, Lotter;s failure to seek a continuance and further cross-examine Nissen, who was available, waived any rights he may have had pursuant to § 29-1912.\n\n2.3. Failure to Correct Nissen;s Testimony\n\nEven assuming that Nissen;s omissions constitute perjury that the prosecution failed to correct, the same standard applies to the failure to correct perjured testimony as applies to the failure to disclose evidence. See Swartz v. State, 506 N.W.2d 792 (Iowa App. 1993). See, also, U.S. v. O;Keefe, 128 F.3d 885 (5th Cir. 1997), cert. denied ___ U.S. ___, 118 S. Ct. 1525, 140 L. Ed. 2d 676 (1998). Accordingly, if no reversal is required under Brady v. Maryland, supra, then no reversal is required under Napue v. Illinois, 360 U.S. 264, 79 S. Ct. 1173, 3 L. Ed. 2d 1217 (1959), which is relied upon by Lotter.\n\n2.4. Suggestion to Witness Morehead\n\nIn a bar, prior to the commission of the murders, Nissen and Lotter had a Discussion with witness Morehead, who later testified at trial. On direct examination, the prosecution asked Morehead whether Lotter made any statement \"regarding some trouble he was allegedly in.\" Morehead responded, \"No. He never said anything. Nissen said something about they were in trouble --.\" At this point, defense counsel objected as to hearsay, and the objection was sustained. On redirect examination, the prosecution asked Morehead, \"The comment that you heard, was it during the approximate same time when there was talk about being in trouble? When they were talking about being in trouble?\" Morehead responded, \"Yeah. It all came --.\" Once again, defense counsel objected, this time moving for mistrial based on prosecutorial misconduct, moving to strike, and moving that the jury be admonished. The objections were sustained, but defense counsel;s motions were overruled.\n\nWhen the prosecutor has already been advised by the trial court that a particular question will not be permitted but continues to ask the question in an attempt to elicit incompetent testimony, the prosecutor commits misconduct. See State v. Gurule, 194 Neb. 618, 234 N.W.2d 603 (1975). See, also, State v. Palser, 238 Neb. 193, 469 N.W.2d 753 (1991). The question in the instant case is whether the prosecutor;s misconduct was prejudicial.\n\nIn Com. v. Wallace, 522 Pa. 297, 561 A.2d 719 (1989), the court addressed a similar situation. \"At trial the prosecution asked [a prosecution witness],'where did you meet the defendant Wallace; and [the witness] replied,'I met him in the West Virginia Penitentiary, 1973.;\" Id. at 307, 561 A.2d at 724. The defense objected and moved for mistrial. The trial court denied the motion and offered to admonish the jury, but the defense rejected the court;s offer. On appeal, the defense argued that the testimony was highly prejudicial because it created an inference of past criminal acts. The prosecution argued that it was intended only to demonstrate the relationship between the defendant and the witness and did not relate to a specific past criminal act.\n\nReferences to prior criminal activities may be prejudicial even when the testimony conveys knowledge of those activities only by reasonable implication. The court noted there was no doubt that the \"the testimony created an inference to the jury that the [defendant] had been involved in prior criminal activity.\" Id. at 308, 561 A.2d at 724. However, the court also noted that \"there is no per se rule that requires a new trial for a defendant every time there is a reference to prior criminal activity.\" Id. at 308, 561 A.2d at 724-25. Considering that the testimony did not relate to specific acts and that the evidence of guilt was overwhelming, the court held that the improper reference was harmless at most.\n\nIn the instant case, the prosecutor;s question concerning the alleged \"trouble\" certainly created an inference to the jury that Lotter had been involved in prior criminal activity. However, prior to Morehead;s testimony, defense counsel had elicited testimony from Nissen on cross-examination concerning the sexual assault of Brandon. Thus, the inference to be drawn by the jury would be that the \"trouble\" referred to by the prosecutor was the sexual assault. Because the jury had already been made aware of the sexual assault through defense counsel;s cross-examination of Nissen, Lotter suffered no prejudice.\n\n2.5. Criminal Background and Physical Abuse\n\nDuring redirect examination of Lotter;s girl friend, McKenzie, the prosecutor asked McKenzie why she went to Missouri on a certain day. McKenzie stated that she went to Missouri to \"get the bond or the bond money that we had bailed John out of jail with.\" The record indicates the prosecution was aware that McKenzie went to Missouri on account of Lotter;s being in jail on an unrelated charge and that the court had sustained a motion in limine prohibiting the prosecution from discussing Lotter;s prior criminal background without first approaching the court. Defense counsel objected, moved for mistrial, and asked that the court admonish the jury to disregard the question and response and have them stricken. The court overruled the motion for mistrial and admonished the jury to disregard the question and answer.\n\nError cannot ordinarily be predicated on the failure to grant a mistrial if an objection or motion to strike the improper material is sustained and the jury is admonished to disregard such material. The defendant must prove that the alleged error actually prejudiced him, rather than creating only the possibility of prejudice. State v. Morrison, 243 Neb. 469, 500 N.W.2d 547 (1993). Ordinarily, when an objection to or motion to strike improper evidence is sustained and the jury is instructed to disregard it, such instruction is deemed sufficient to prevent prejudice. State v. Myers, 244 Neb. 905, 510 N.W.2d 58 (1994). We conclude that there was no prejudice in the instant case.\n\nLotter also asserts that the prosecutor committed misconduct when he asked McKenzie this question: \"Now, this stormy relationship is a nice euphemism for the physical abuse he;s inflicted on you, John Lotter, isn;t it?\" Defense counsel objected, and the objection was sustained. However, defense counsel did not move for mistrial. A party who fails to make a timely motion for mistrial based on prosecutorial misconduct waives the right to assert on appeal that the court erred in not declaring a mistrial due to such prosecutorial misconduct. State v. Wilson, 252 Neb. 637, 564 N.W.2d 241 (1997).\n\n2.6. Testimony Concerning Witnesses; Credibility\n\nDuring the prosecution;s cross-examination of Lotter, the prosecution asked a series of questions relating to the credibility of various prosecution witnesses. However, defense counsel made no objection concerning this method of cross-examination. The failure to make a timely objection or motion to strike will ordinarily bar a party from later claiming error in the admission of testimony. State v. Neujahr, 248 Neb. 965, 540 N.W.2d 566 (1995). We conclude that this assignment of error is without merit.\n\n2.7. Improper Comments During Closing Argument\n\nDefense counsel did not make any objections during the prosecution;s closing argument. When a party has knowledge during trial of irregularity or misconduct, he must timely assert his right to a mistrial. One may not waive error, gamble on a favorable result, and, upon obtaining an unfavorable result, assert the previously waived error. See, e.g., State v. Fahlk, 246 Neb. 834, 524 N.W.2d 39 (1994) (holding that defendant waived objection to prosecutor;s improper comments during closing argument).\n\n2.8. Violation of Confidentiality Order\n\nDuring sentencing, Lotter filed a motion to disqualify the special prosecutor for intentionally violating a court order. The State had filed a motion for release of records to obtain information, concerning Lotter, from various sources. After a hearing was held on the motion, but 3 weeks prior to the sentencing panel;s ruling thereon, the special prosecutor obtained Lotter;s records from the Nebraska Department of Correctional Services. Subsequently, however, the sentencing panel;s order denied the prosecution access to those same records. Lotter moved to disqualify the special prosecutor from further proceedings. The panel denied the motion to disqualify but did preclude the prosecution from introducing certain information obtained from the excluded records at sentencing.\n\nAlthough the prosecutor obviously violated a court order in this instance, the sentencing panel concluded that the violations had no effect on its sentencing decision, since the panel prohibited the prosecution from using any of the material it had obtained in violation of the court order. We see no prejudice to Lotter stemming from this instance of misconduct.\n\n2.9. Cumulative Misconduct\n\nAccording to our analysis of assignments of error 2.1 to 2.8, this assignment of error is without merit.\n\n3. JURY SELECTION\n\nIn this assignment of error, Lotter argues that the jury selection was tainted because several jurors had knowledge of the facts surrounding the crime, including that Nissen had been convicted for murder arising from the same incident for which Lotter was being tried. However, the law does not require that a juror be totally ignorant of the facts and issues involved; it is sufficient if the juror can lay aside his or her impressions or opinions and render a verdict based on evidence presented in court. State v. Jacob, 253 Neb. 950, 574 N.W.2d 117 (1998). The retention or rejection of a venireperson as a juror is a matter of discretion with the trial court, State v. McHenry, 247 Neb. 167, 525 N.W.2d 620 (1995), and is subject to reversal only when clearly wrong, State v. Jacob, supra. Although several jurors were aware of certain facts concerning Lotter;s involvement, the record indicates that the jurors were able to set aside what they had heard and render their verdict according to the facts presented at trial and that no juror had formed an opinion as to Lotter;s guilt or innocence. It is true that in State v. Robertson, 219 Neb. 782, 791, 366 N.W.2d 429, 435 (1985), we stated that \"evidence of a co-defendant;s conviction on the same charge has no place in the State;s case in chief against a defendant.\" However, there is a vast difference between evidence presented during the State;s case in chief, which the jury understands as being relevant, and information the jury acquired prior to trial, which the jury in the instant case apparently understood must be set aside. As we stated in Robertson, \"[W]e are still in a time when juries attach significance to courtroom proceedings.\" Id. Thus, the jury in the instant case did not attach the same significance to pretrial information as it did to the information presented at trial. We conclude that this assignment of error is without merit.\n\n4. JURY SEQUESTRATION\n\nWhether a jury is to be kept together before submission of the cause in a criminal trial is left to the discretion of the trial court. State v. Jacob, supra. To warrant reversal, denial of a motion to sequester the jury before submission of the cause must be shown to have prejudiced the defendant. Id. Lotter offers no evidence that any prejudice occurred.\n\n5. REQUESTS TO CONTINUE\n\nLotter argues that the trial court erred in denying his request for a continuance of opening statements on May 15, 1995, made after learning that Nissen might testify pursuant to a sentencing agreement, and his request for a continuance prior to Nissen;s testimony on May 17, which was made prior to any assertion by the defense that Nissen;s sentencing document must be disclosed. A decision whether to grant a continuance in a criminal case is within the discretion of the trial court and will not be disturbed on appeal absent an abuse of discretion. State v. Turner, 252 Neb. 620, 564 N.W.2d 231 (1997); State v. Kula, 252 Neb. 471, 562 N.W.2d 717 (1997). We conclude that the trial court did not abuse its discretion in the instant case.\n\n6. PRIOR CONSISTENT STATEMENTS\n\nLotter argues that the prosecution;s introduction of certain prior consistent statements of Nissen and Nissen;s wife, Kandi Nissen, during the cross-examination of Chrans were improperly admitted hearsay. Defense counsel objected to this testimony on hearsay grounds, and an objection was sustained in one instance and overruled in another.\n\nQ [Prosecutor:] Investigator Chrans, one of the articles, or one of the reports you reviewed that Mr. Fabian was just talking to you about was this Playboy Magazine article, correct?\n\nA Yes.\n\nQ You;ve seen that, right?\n\nA Yes.\n\nQ And in that article he says I [Nissen] stabbed Brandon and Lotter shot'em, right?\n\nA Yes.\n\n[Defense counsel]: Well, Your Honor, I;ll object.\n\nDefense counsel;s objection was sustained. Later, defense counsel again objected on hearsay grounds.\n\nQ Oh, by the way, Investigator Chrans, did Kandi Nissen ever tell you about a rope being in the home?\n\nA Yes.\n\nQ When did she first tell you about that?\n\nA Oct --\n\n[Defense counsel]: Objection, Your Honor, It;s hearsay as to what Kandi Nissen told the Investigator.\n\n....\n\nWell I;ll let -- Go ahead.\n\n....\n\nQ [Prosecutor:] The question was, Investigator Chrans, did Kandi Nissen mention this rope at any time to you?\n\nA Yes, she did.\n\nQ When?\n\nA I believe it was October of 1994.\n\nQ So you knew about that through her well before last Sunday or Monday, correct?\n\nA Yes.\n\nAs to Lotter;s objections concerning the Playboy magazine article, once the objection was sustained, the proper remedy was to ask the trial court to strike the testimony and admonish the jury. See State v. McClanahan, 194 Neb. 261, 231 N.W.2d 351 (1975). Because Lotter failed to ask the court to strike the testimony and admonish the jury once the objection was sustained, Lotter waived any error.\n\nHowever, the objection to the testimony concerning Kandi Nissen was overruled. The State argues that the objection was improper because Lotter objected on hearsay grounds and that the testimony was not hearsay. The State;s argument simply begs the question. That said, the question is whether the complained of testimony was hearsay.\n\nNeb. Rev. Stat. § 27-801(4) (Reissue 1995) provides:\n\nA statement is not hearsay if:\n\n... [t]he declarant testifies at the trial or hearing and is subject to cross-examination concerning the statement, and the statement is... consistent with his testimony and is offered to rebut an express or implied charge against him of recent fabrication or improper influence or motive....\n\nWe have stated that prior consistent out-of-court statements are defined as non-hearsay and are admissible to rebut a charge of recent fabrication, improper influence, or improper motive only when those statements were made before the charged recent fabrication, improper influence, or improper motive. State v. Buechler, 253 Neb. 727, 572 N.W.2d 65 (1998); State v. Morris, 251 Neb. 23, 554 N.W.2d 627 (1996). Thus, we must determine whether such a charge was made, and if so, when the charge indicated that the recent fabrication, improper influence, or improper motive arose.\n\nIn Buechler, supra, we stated that attempts at impeachment cannot be equated with charges of recent fabrication. In the instant case, there was no charge of recent fabrication, improper influence, or improper motive attributed to Kandi Nissen, and thus, Chrans; testimony was inadmissible hearsay. Nonetheless, the admission of the hearsay was harmless beyond a reasonable doubt, since it concerned nothing more than a collateral issue.\n\n7. INADMISSIBLE EVIDENCE AS PLAIN ERROR\n\nNext, Lotter complains of the admission of a variety of testimony to which no objection was made and asks us to find plain error. We decline Lotter;s invitation.\n\n8. IMPROPER JURY INSTRUCTIONS\n\nLotter asserts that the trial court erred in failing to instruct that Lotter must have the same intent as the principal to be guilty of aiding and abetting; erroneously interweaving the elements of premeditated and felony murder in a single charge; incorrectly instructing that intent to commit the felony of tampering with a witness was an element of felony murder; failing to instruct on the necessary temporal and spatial relationship between the felony and the act of killing in felony murder; giving an \"acquit first\" step instruction; and failing to give a curative instruction concerning Nissen;s prior conviction.\n\n8.1. Intent Required for Aiding and Abetting\n\nThe aiding and abetting instruction, jury instruction No. 10, stated:\n\nTo be guilty of the crime charged, it is not necessary that the State prove that the defendant himself committed the unlawful act or acts in question.\n\nWhoever aids, abets, or procures another to commit any offense may be prosecuted and punished as if he were the principal offender.\n\nIf you find from the evidence beyond a reasonable doubt that the unlawful act or acts in question were committed by another person who was:\n\n1. Engaged by the defendant to commit the unlawful act or acts; or\n\n2. Engaged with the defendant in a common, concerted unlawful act or acts; or\n\n3. Incited or encouraged by defendant to commit the unlawful act or acts, then defendant is as guilty as if he himself committed the unlawful act or acts, and it is your duty to find the defendant guilty.\n\nAiding and abetting involves some participation in the criminal act and must be evidenced by some word, act, or deed. No particular acts are necessary; nor is it necessary that any physical part in the commission of the crime is taken or that there was an express agreement therefor. Mere encouragement or assistance is sufficient.\n\nOn the other hand, evidence of mere presence, acquiescence, or silence is not enough to sustain the State;s burden of proving the defendant guilty.\n\nWhen a crime requires the existence of a particular intent, an alleged aider and abettor can be held criminally liable as a principal if it is shown that the aider and abettor knew that the perpetrator of the act possessed the required intent, or that the aider and abettor himself possessed the required intent. State v. Arnold, 253 Neb. 789, 572 N.W.2d 74 (1998). See, also, State v. Johnson, 236 Neb. 831, 464 N.W.2d 167 (1991). An aider and abettor can be convicted of any crime, even a greater offense than the principal, provided the conviction is supported by the evidence of the facts and the defendant;s state of mind. State v. Ryan, 248 Neb. 405, 534 N.W.2d 766 (1995). Therefore, the jury instructions must instruct the jury that the aider and abettor either personally intended that the underlying felony be committed or aided another person whom the aider and abettor knew had such an intent. State v. Mantich, 249 Neb. 311, 543 N.W.2d 181 (1996).\n\nIn a criminal trial, the court in its instructions must delineate for the jury each material element the State is required to prove beyond a reasonable doubt to convict the defendant of the crime charged. State v. Williams, 247 Neb. 931, 531 N.W.2d 222 (1995). The State argues that the jury instructions, taken as a whole, properly instructed the jury as to an aider and abettor;s required mental state. All the jury instructions must be read together, and if taken as a whole they correctly state the law, are not misleading, and adequately cover the issues supported by the pleadings and the evidence, there is no prejudicial error necessitating reversal. State v. Allen, 252 Neb. 187, 560 N.W.2d 829 (1997). The State relies on jury instruction No. 14, arguing that it correctly apprised the jury of the intent or knowledge required for aiding and abetting. Jury instruction No. 14 stated:\n\nThe intent required by Instruction 8 is a material element of the crime charged against the defendant. Intent is a mental process and it therefore generally remains hidden within the mind where it is conceived. It is rarely if ever susceptible of proof by direct evidence. It may, however, be inferred from the words and acts of the defendant and from the facts and circumstances surrounding his conduct. But before that intent can be inferred from such circumstantial evidence alone, it must be of such character as to exclude every reasonable Conclusion except that defendant had the required intent. It is for you to determine from all the facts and circumstances in evidence whether or not the defendant committed the acts complained of and whether at such time he had the criminal intent required by Instruction 8. If you have any reasonable doubt with respect to either, you must find the defendant not guilty.\n\n(Emphasis supplied.)\n\nIn State v. Mantich, supra, we held that instructions Nos. 11 and 9 in that case, which were nearly identical to instructions Nos. 10 and 14, respectively, in the instant case, when read together, adequately stated the law and were not misleading. It is true that instruction No. 9 in State v. Mantich, 249 Neb. at 325, 543 N.W.2d at 192, included this additional language:\n\n\"Criminal intent is a material and necessary element of the crime of Murder in the First Degree in the commission of a felony as charged against the defendant. But the intent required is not an intent to kill [the victim] but is an intent to commit a robbery or kidnapping....\"\n\nAlthough instruction No. 14 in the instant case did not contain this language, this language;s meaning was conveyed to the jury in instruction No. 8, which is specifically referenced by instruction No. 14. Instruction No. 8, a first degree murder instruction set forth below, made it clear that the prosecution was required to prove that Lotter intended to commit burglary for Lotter to be found guilty of felony murder. See part 8.2, infra. Thus, there is no substantive difference between the instructions given in Mantich and those given in the instant case. Our holding in Mantich is dispositive, and we conclude that this assignment of error is without merit.\n\n8.2. Instruction No. 8\n\nLotter makes multiple assignments of error concerning this instruction.\n\n8.2.1. Interweaving of Premeditated\n\nand Felony Murder\n\nLotter asserts that the trial court erroneously interwove the elements of premeditated and felony murder in instruction No. 8 and that the court should have used Lotter;s proposed instruction. Instruction No. 8 stated in pertinent part:\n\nThe material elements... of Murder in the First Degree, as charged in [Counts I, II, and III] are:\n\n1. That the Defendant, John L. Lotter, killed [Teena Brandon, Lisa Lambert, and Phillip DeVine].\n\n2. That the Defendant, John L. Lotter, did so purposely and with deliberate and premeditated malice; or that the Defendant, John L. Lotter, did so while in the perpetration of a Burglary. That Burglary consists of each and every one of the following elements:\n\na. That the Defendant, John L. Lotter, did willfully, maliciously and forcibly break and enter the home of Lisa Lambert.\n\nb. That the Defendant, John L. Lotter, did so with the intent to commit the felony of Tampering with a Witness.\n\nc. That the Tampering with a Witness consists of each and every one of the following elements:\n\nI. TAMPERING WITH A WITNESS:\n\n(a) The Defendant, John L. Lotter, believing that an official proceeding or investigation of a criminal matter was pending or about to be instituted, attempted to induce or otherwise cause a witness, Teena Ray Brandon, to testify or inform falsely; or withhold any testimony, information or thing.\n\nLotter argues that the trial court should have used Lotter;s proposed jury instruction, which set out the individual elements for premeditated murder and felony murder in separate paragraphs.\n\nIn an appeal based on the claim of an erroneous instruction, the appellant has the burden to show that the questioned instruction was prejudicial or otherwise adversely affected a substantial right of the appellant. State v. McHenry, 250 Neb. 614, 550 N.W.2d 364 (1996). In State v. Buckman, 237 Neb. 936, 941, 468 N.W.2d 589, 592 (1991), this court addressed an instruction very similar to that in the instant case, stating: \"This instruction correctly states the law, is not misleading, and adequately states the issues of the case.\" This assignment of error is without merit.\n\n8.2.2. Felony Murder and Tampering\n\nWith Witness Instructions\n\nLotter next argues that the trial court incorrectly instructed that the intent to commit the felony of tampering with a witness was an element of felony murder. Apparently, Lotter is contending that the instruction did not instruct the jury that the \"intent\" necessary for felony murder is the \"intent\" to commit burglary. Although instruction No. 8 uses the word \"intent\" only when discussing the felony of tampering with a witness, the \"intent\" required for burglary was correctly stated as \"willfully, maliciously and forcibly.\" See Neb. Rev. Stat. § 28-507 (Reissue 1995). This assignment of error is without merit.\n\n8.2.3. Temporal and Spatial Relationship\n\nLotter also contends that the trial court failed to properly instruct the jury on the required temporal and spatial relationship between the underlying felony and the act of killing in felony murder. It is true that there must be some causal connection between the underlying felony and the homicide to support a conviction for felony murder. State v. Dixon, 222 Neb. 787, 387 N.W.2d 682 (1986). It is also true that NJI2d Crim. 3.5 recommends that the jury be instructed concerning this causal relationship.\n\nHowever, in the context of lesser-included offense instructions, we have held that it is not prejudicial error not to instruct upon a lesser-included offense when the evidence entirely fails to show an offense of a lesser degree than that charged in the information. State v. Cebuhar, 252 Neb. 796, 567 N.W.2d 129 (1997). In other words, the evidence must produce a rational basis for acquitting the defendant of the greater offense and convicting the defendant of the lesser offense before a lesser-included offense is required. State v. Parks, 253 Neb. 939, 573 N.W.2d 453 (1998). In the instant case, assuming the jury found that Lotter had indeed committed the underlying felony, no evidence was produced that could lead a rational trier of fact to find that there was no causal connection between the underlying felony and the homicides. Because the evidence entirely failed to show any basis for finding that there was no causal connection, no causal instruction was required.\n\n8.2.4. Step Instruction\n\nWe have held that \"step\" instructions, requiring consideration of the most serious crime charged before consideration of lesser-included offenses, are not erroneous. State v. Jones, 245 Neb. 821, 515 N.W.2d 654 (1994). The step instructions in the instant case are likewise not erroneous.\n\n8.3. Curative Instruction\n\nLotter argues that the trial court erred by failing to give a curative instruction to the jury concerning the admission of testimony indicating that Nissen had been convicted of the crimes for which Lotter was being tried. First, we address the admissibility of such testimony, and then we discuss the need for a curative instruction.\n\nIn State v. Robertson, 219 Neb. 782, 366 N.W.2d 429 (1985), this court held that evidence of a co-defendant;s conviction was inadmissible and denied the defendant her right to a fair trial. We quoted Ivy v. State, 301 So. 2d 292 (Miss. 1974), where the court stated, \"'We have consistently held evidence of this nature to be inimical to a fair trial.;\" State v. Robertson, 219 Neb. at 791, 366 N.W.2d at 435. Our holding in Robertson relied primarily on the lack of relevance of a co-defendant;s conviction to the defendant;s guilt. \"[I]n using another jury;s verdict as evidence, there is the insidious invitation to trust and substitute another jury;s judgment rather than fairly deliberate evidence in a present prosecution.\" Id.\n\nHowever, in the instant case, defense counsel did not object to the testimony concerning Nissen;s conviction. In addition, the prosecution never asked Nissen whether he was convicted for the acts to which he testified at trial. Rather, the prosecution simply asked what benefits Nissen had received in exchange for his testimony, and Nissen replied, \"I agree to be sentenced to three life terms; to retain my appeal rights; to be transferred.\" The defense conducted extensive cross-examination concerning Nissen;s agreement that specifically indicated that Nissen;s life sentences were imposed for convictions arising out of the acts to which Nissen testified at trial. The following exchange occurred:\n\nQ [Defense counsel:] Now, when you say you were convicted of first degree murder, you were convicted of one count of first degree murder for the death of Teena Brandon. Right?\n\nA Yes.\n\nQ Two counts of second degree murder for the deaths of Lisa Lambert and Phillip DeVine.\n\nA Yes.\n\n....\n\nQ And you went through trial on the matter, did you not?\n\nA Yes.\n\nQ Entered a plea of not guilty?\n\nA Yes.\n\nQ And were convicted by a jury?\n\nA Yes.\n\nThus, the record indicates that the prosecution asked Nissen about the agreement, not to use it as substantive evidence of Lotter;s guilt, but to indicate that Nissen;s credibility was at issue. The defense first brought out the fact that Nissen;s conviction was by jury and that it was the result of the acts Nissen testified to at Lotter;s trial.\n\nThe Dissenting opinion in State v. Robertson, 219 Neb. at 792, 366 N.W.2d at 435, stated: \"Evidence that another person has been convicted of the same crime for which the defendant is on trial is not admissible as proof of the guilt of the defendant. The same evidence, however, may be admissible for many other reasons.\"\n\nIn United States v. Halbert, 640 F.2d 1000 (9th Cir. 1981), the court noted that either the prosecution or the defense may want to introduce evidence of a co-defendant;s conviction for the same crime, not as substantive evidence of the defendant;s guilt, but as evidence of the co-defendant;s credibility. Thus, the general rule is that \"under proper instruction, evidence of a guilty plea [or a conviction] may be elicited by the prosecutor on direct examination so that the jury may assess the credibility of the witnesses the government asks them to believe.\" Id. at 1004. Because we are now persuaded by Halbert and the Dissent to State v. Robertson, 219 Neb. 782, 366 N.W.2d 429 (1985), to the extent that Robertson and State v. Greeno, 230 Neb. 568, 432 N.W.2d 547 (1988), indicate that evidence of a co-defendant;s guilty plea or conviction lacks relevance regardless of the purpose for which it is offered, they are hereby overruled.\n\nBecause the admissibility of a plea or conviction turns upon the purpose for which it is offered, we must determine whether the prosecution offered Nissen;s testimony in that regard as substantive evidence of Lotter;s guilt or to help the jury assess Nissen;s credibility. See United States v. Halbert, supra. In the instant case, the prosecution;s lack of emphasis on the agreement indicates that the prosecution was trying to blunt a predicted effort by the defense to impeach Nissen and was not offering it as substantive evidence of Lotter;s guilt. Thus, the testimony was offered for a legitimate, relevant purpose.\n\nHowever, even when such evidence is admissible, a curative instruction is required when requested by defense counsel. In United States v. Halbert, supra, the court determined that the prosecution;s references to a co-defendant;s guilty pleas were admissible, but was \"compelled to reverse [the defendant;s] conviction for want of appropriate instructions to the jury on the limited purpose for which the pleas could be used.\" 640 F.2d at 1006. The court reversed, even though the trial court had indeed instructed the jury concerning the guilty pleas in its closing instructions. That instruction stated: \"'[D]isposition of [the co-defendants]... should not control or influence you in your verdict with reference to the remaining defendant.... You must base your verdict as to him solely on the evidence presented to you in this courtroom.;\" Id. The court stated:\n\nWe cannot say that this instruction apprised the jury that it could use the pleas only as evidence of [the co-defendants;] credibility. Evidence of the guilty pleas is amenable to misuse. Without instruction, it is possible the jury could use the pleas as evidence of [the defendant;s] guilt. This danger may be averted only by adequate cautionary instructions that make it clear to lay people that evidence of a witness; own guilty plea can be used only to assess credibility.... The most effective practice would be to instruct the jury when the evidence of the plea is admitted, and again in final instructions.\n\nId. at 1006. See, also, U.S. v. Kroh, 915 F.2d 326 (8th Cir. 1990).\n\nIn the instant case, no instruction was given to the jury concerning the permissible use of Nissen;s testimony as to his prior conviction. However, defense counsel did not ask the court to give such an instruction or object to the absence of such an instruction. See Wallace v. Lockhart, 701 F.2d 719 (8th Cir. 1983), cert. denied 464 U.S. 934, 104 S. Ct. 340, 78 L. Ed. 2d 308. A party who does not request a desired jury instruction cannot complain on appeal about incomplete instructions. State v. Al-Zubaidy, 253 Neb. 357, 570 N.W.2d 713 (1997).\n\n9. INEFFECTIVE ASSISTANCE OF COUNSEL\n\nLotter asserts that he was denied effective assistance of counsel. The Sixth Amendment to the U.S. Constitution guarantees every criminal defendant the right to effective assistance of counsel. State v. Becerra, 253 Neb. 653, 573 N.W.2d 397 (1998). Claims of ineffective assistance of counsel raised for the first time on direct appeal do not require dismissal ipso facto; the determining factor is whether the record is sufficient to adequately review the question. When the issue has not been raised or ruled on at the trial court level and the matter necessitates an evidentiary hearing, an appellate court will not address the matter on direct appeal. State v. Jacob, 253 Neb. 950, 574 N.W.2d 117 (1998). In the instant case, we conclude that an evidentiary hearing is necessary and that this issue is not reviewable on direct appeal.\n\n10. SENTENCING\n\n10.1. Unanimous Verdict and Intent to Kill\n\nNext, Lotter argues that he must be sentenced to life because the jury was not unanimous on the theory of guilt and failed to find an intent to kill. Lotter asserts that because the jury was not required to reach a unanimous verdict on either a theory of premeditated murder or felony murder, we cannot ascertain which theory the jury relied upon in reaching its decision to convict. However, this argument has been disposed of by State v. White, 254 Neb. 566, 577 N.W.2d 741 (1998), and State v. Buckman, 237 Neb. 936, 468 N.W.2d 589 (1991).\n\nLotter also argues that the underlying felony alleged in this case, burglary, does not support a finding of a specific \"'intent to kill,;\" brief for appellant 110, which is required by the Eighth Amendment. Essentially, Lotter argues that the death sentence cannot be imposed pursuant to a felony murder theory when the underlying felony is burglary and is based on the intent to commit the felony of tampering with a witness, because such a burglary is not the \"'moral equivalent,;\" brief for appellant at 116, of premeditation.\n\nIt is true that \"[b]efore a defendant can be sentenced to death, our Constitution requires that he be guilty of a certain degree of culpable conduct.\" Fairchild v. Norris, 21 F.3d 799, 802 (8th Cir. 1994), cert. denied 513 U.S. 1146, 115 S. Ct. 1092, 130 L. Ed. 2d 1061 (1995). In State v. Rust, 223 Neb. 150, 388 N.W.2d 483 (1986), we held that the imposition of the death penalty for felony murder did not violate the Eighth Amendment. We stated: \"[N]o specific intention is required to constitute felony murder other than the intent to do the act which constitutes the felony in question. In other words, the intent necessary to the crime of murder is constructively imputed through the intent to commit the underlying felony.\" Id. at 160, 388 N.W.2d at 492. In so holding, we acknowledged the U.S. Supreme Court;s decision in Enmund v. Florida, 458 U.S. 782, 102 S. Ct. 3368, 73 L. Ed. 2d 1140 (1982), noting that in Enmund, the Court held only that the death penalty may not be imposed when the defendant did not himself kill, attempt to kill, or intend that a killing take place or that lethal force be employed.\n\nHowever, the death penalty may still be imposed even when the defendant does not have an intent to kill and does not himself participate directly in the killing. Tison v. Arizona, 481 U.S. 137, 107 S. Ct. 1676, 95 L. Ed. 2d 127 (1987). As stated by the Supreme Court, \"Only a small minority of those jurisdictions imposing capital punishment for felony murder have rejected the possibility of a capital sentence absent an intent to kill, and we do not find this minority position constitutionally required.\" 481 U.S. at 158. In Tison, the Court held that \"major participation in the felony committed, combined with reckless indifference to human life, is sufficient to satisfy the Enmund culpability requirement.\" Id.\n\nIn the instant case, the evidence not only indicates that Lotter was a major participant in the crime who manifested reckless indifference to human life, it indicates that Lotter directly participated in the killings. See Wisdom v. State, 918 P.2d 384 (Okla. Crim. App. 1996). Considering Lotter;s participation in the killings, there is no doubt that the death penalty may be constitutionally imposed in this instance.\n\n10.2. Nissen Agreement and Sentencing\n\nAny argument that Nissen;s sentencing agreement was prejudicial to Lotter;s rights during sentencing has been disposed of by our analysis of the effect of the agreement during the guilty phase of Lotter;s trial.\n\n10.3. Constitutionality of Death Penalty Statutes\n\n10.3.1. Vague and Overbroad\n\nNebraska;s death penalty statutes are neither vague nor overbroad. See, State v. Anderson and Hochstein, 207 Neb. 51, 296 N.W.2d 440 (1980); State v. Simants, 197 Neb. 549, 250 N.W.2d 881 (1977), cert. denied 434 U.S. 878, 98 S. Ct. 231, 54 L. Ed. 2d 158.\n\n10.3.2. Arbitrary, Cruel, and Unusual Punishment\n\nLotter argues that there is an inherent conflict between \"'consistency; and'individualized sentencing,;\" brief for appellant 125, which renders the death penalty arbitrary, cruel, and unusual punishment, in violation of the Eighth Amendment. This argument is without merit, as this court has consistently held that Nebraska;s death penalty statutes do not constitute cruel and unusual punishment under \"either the eighth or fourteenth amendment of the United States Constitution or Neb. Const. art. 1, § 9.\" State v. Anderson and Hochstein, 207 Neb. at 71-72, 296 N.W.2d at 453. See, also, e.g., State v. Moore, 210 Neb. 457, 316 N.W.2d 33 (1982) (declining to address issue based upon plethora of precedent holding that Nebraska death penalty statutes are neither vague nor overbroad).\n\n10.3.3. Three-Judge Panel\n\nLotter argues that § 29-2521 permits the trial court too much discretion in determining the order of procedure at a capital sentencing and is standardless concerning the three-Judge panel;s function. Lotter bases this argument on Neb. Const. art. V, § 19, which states: \"The organization, jurisdiction, powers, proceedings, and practice of all courts of the same class or grade, so far as regulated by law and the force and effect of the proceedings, judgments and decrees of such courts, severally, shall be uniform.\" We construed this section, then appearing in Neb. Const. art. VI, § 19, in State v. Magney, 52 Neb. 508, 513, 72 N.W. 1006, 1008 (1897), where we stated that\n\nfundamental law classifies the courts of the state, which classification the legislature is powerless to alter or change, and that any enactment which defines or regulates the jurisdiction and powers of the courts infringes the constitution if such law is not uniform as to all courts of the same grade or class; in other words, that the jurisdiction and powers conferred upon a Justice, county, or district court of one county can be neither more nor less than that given the court of the same class in any other county of the state. The term \"class,\" or \"grade,\" as employed in the constitution, evidently refers to the different kinds of courts established in the state, -- that is, all Justice courts constitute one class or grade with the same jurisdiction, and that the county and district courts, respectively, belong to a separate class or grade, possessing uniform jurisdiction and powers. Indeed, the section of the constitution already quoted [Neb. Const. art. VI, § 19] is too plain to admit of any other or different construction being placed upon it.\n\nThus, because § 29-2521 applies equally to every court in the class to which the statute is intended to apply, it does not violate Neb. Const. art. V, § 19.\n\nIt is clear that § 29-2521 is intended to apply to the district court \"class,\" which class conducts capital sentencing proceedings. See § 29-2521. It is likewise clear that § 29-2521 applies equally to every court in that class. See id. That the statute gives the district courts some discretion in conducting capital sentencing proceedings does not render it unconstitutional under Neb. Const. art. V, § 19. See State v. Simants, 197 Neb. at 562, 250 N.W.2d at 889 (stating that \"[t]he argument that the sentencing Judge is given too much discretion under the Nebraska scheme has also been foreclosed by the United States Supreme Court decisions\"). Discretion indicates that proceedings will be inconsistent, but does not indicate that proceedings will lack uniformity in a constitutional sense. Indeed, we stated in Simants that \"the sentencing authority must exercise some degree of discretion\" in making its decision. Id. at 563, 250 N.W.2d at 890. To the extent that such proceedings lack uniformity due to the exercise of the district courts; discretion, the appropriate challenge is whether the discretion used by the district court in the case at issue amounted to abuse.\n\n10.4. Proportionality Review\n\nIn State v. Moore, 250 Neb. 805, 553 N.W.2d 120 (1996), this court declined to reevaluate its holding in State v. Palmer, 224 Neb. 282, 328, 399 N.W.2d 706, 736 (1986), that comparison reviews \"should include only those cases in which the death penalty was imposed.\" Once again, we decline. Accordingly, we conclude that Lotter;s penalty is proportionate to the penalty imposed in other death penalty cases.\n\n10.5. Procedural Issues\n\nLotter asserts numerous assignments of error addressing the procedure used in determining whether the death penalty should be imposed.\n\n10.5.1. Burden, Risk, and Findings\n\na. Burden\n\nThe prosecution has the burden of proving beyond a reasonable doubt the existence of any aggravating circumstances. §29-2523 (as amended by 1998 Neb. Laws, L.B. 422); State v. Rust, 247 Neb. 503, 528 N.W.2d 320 (1995). Based on this assertion and our holding in State v. Rust, Lotter argues that the sentencing panel;s failure to find a particular aggravating circumstance acts as an acquittal of the circumstance, such that this court cannot reconsider it on appeal. Because we conclude that the sentencing panel was correct in its determinations concerning the aggravating circumstances in the instant case, we do not address this issue.\n\nb. Risk of Nonpersuasion\n\nLotter also asserts that although a capital defendant should have the risk of nonproduction as to mitigating circumstances, a capital defendant should not have the risk of nonpersuasion. Lotter argues that once a capital defendant has met his or her risk of nonproduction, the State should have the burden to disprove the mitigating circumstance by proof beyond a reasonable doubt.\n\nIn State v. Reeves, 234 Neb. 711, 453 N.W.2d 359 (1990), we held that a capital defendant has the risk of nonpersuasion as to the existence of mitigating circumstances. We stated:\n\nWe will not assign a burden of proof with regard to mitigating factors. The State may present evidence which is probative of the nonexistence of a statutory or non-statutory mitigating circumstance, while the defendant may present evidence which is probative of the existence of a statutory or non-statutory mitigating circumstance. How-ever, because Neb. Rev. Stat. §§ 29-2521 et seq. (Reissue 1989) do not require the State to disprove the existence of mitigating circumstances, they do place the risk of nonproduction and nonpersuasion on the defendant. See Foster v. State, 304 Md. 439, 499 A.2d 1236 (1985) (although Maryland;s death penalty statute does not require the prosecution to disprove the existence of mitigation, it does place on the defendant the risk of nonproduction and nonpersuasion).\n\n(Emphasis omitted.) 234 Neb. at 738, 453 N.W.2d at 377. We see no reason to revisit our decision in Reeves.\n\nc. Findings\n\nLotter further argues that the sentencing panel erred in not stating what standard or risk it applied in evaluating the statutory and non-statutory mitigating circumstances in the instant case. Lotter cites Rust v. Hopkins, 984 F.2d 1486 (8th Cir. 1993), wherein the court remanded the case because the burden to be placed upon the state for the establishment of aggravating circumstances was not clear at the time the defendant was sentenced.\n\nIn Rust v. Hopkins, supra, the federal court noted that this court had not stated any standard concerning the burden of proof as to aggravating circumstances. However, this court has clearly stated that a capital defendant bears the risk of nonpersuasion as to mitigating circumstances. When the trial court fails to explicitly state the law it followed in its order, we assume that the trial court followed the law. See Davidson v. Davidson, 254 Neb. 656, 578 N.W.2d 848 (1998). We have no reason to believe that the trial court in the instant case did not review the mitigating circumstances presented by Lotter according to Lotter;s \"risk of nonpersuasion.\"\n\n10.5.2. Aggravating Circumstance (1)(b)\n\nPrior to its amendment by 1998 Neb. Laws, L.B. 422, §29-2523(1)(b) provided that it was an aggravating circumstance when \"[t]he murder was committed in an apparent effort to conceal the commission of a crime, or to conceal the identity of the perpetrator of a crime.\" Lotter argues that the word \"apparent\" improperly alters the burden of proof. However, L.B. 422 struck the word \"apparent\" from the statute, rendering Lotter;s argument moot. See part 13, infra. This assignment of error is without merit.\n\n10.5.3. Aggravating Circumstance (1)(h)\n\nLotter argues that aggravating circumstance (1)(h) did not exist, because the crime was not committed during an \"immediate and direct attempt,\" brief for appellant at 147, to enforce the law or conduct an investigation of the victims, citing State v. Rust, 197 Neb. 528, 520 N.W.2d 867 (1977). Under §29-2523(1)(h), as amended, it is an aggravating circumstance when \"[t]he murder was committed knowingly to disrupt or hinder the lawful exercise of any governmental function or the enforcement of the laws.\" In State v. Rust, we noted that the murder was committed while the defendant was being pursued by the police. In the instant case, there was no law enforcement officer anywhere near the scene of the crime. However, there is no requirement that the murder must be an \"immediate and direct\" attempt to disrupt or hinder the enforcement of the laws. The only requirement is that the defendant must do so \"knowingly.\" The sentencing panel expressly stated that its determination that the murders were committed to disrupt or hinder the enforcement of the laws was based on the fact that the \"motive for the murder of Teena Brandon was to prevent her from being a witness for the State in any potential prosecution against each Defendant for kidnapping and sexually assaulting her.\" Certainly, preventing a witness from testifying would disrupt or hinder the enforcement of the laws. Thus, the only question is whether Lotter did so knowingly, a question we address in part 13, infra.\n\n10.5.4. Mitigating Circumstance (2)(b)\n\nLotter asserts that the sentencing panel should have found the existence of statutory mitigating circumstance (2)(b), which exists when \"[t]he offender acted under unusual pressures or influences or under the domination of another person.\" In State v. Holtan, 197 Neb. 544, 547, 250 N.W.2d 876, 880 (1977), we stated that this \"provision contemplates only outside pressures, not those created by the defendant;s own acts.\" The only pressure in this case was that created by the impending criminal charges against Lotter due to his involvement in the sexual assault of Brandon, that is, pressure created by Lotter;s own acts. This assignment of error is without merit.\n\n10.5.5. Mitigating Circumstance (2)(c)\n\nUnder subsection (2)(c), it is a mitigating circumstance when \"[t]he crime was committed while the offender was under the influence of extreme mental or emotional disturbance.\" Psychologist Dr. Timothy Butler Jeffrey testified at the sentencing hearing that it was probable that Lotter was under \"extreme emotional distress\" at the time the crimes were committed. Dr. Paul Fine testified that Lotter has \"extreme mental and emotional disturbance\" anytime that he was stressed and that the crime was committed while the offender was under the influence of extreme mental and emotional disturbance. Both experts; testimony was apparently based upon their Conclusion that Lotter is a person who suffers from an extreme mental and emotional disturbance anytime he is put in a stressful situation or even if he is merely intoxicated. Thus, the expert testimony indicates that although Lotter may have been under extreme mental and emotional disturbance at the time the crimes were committed, his extreme mental and emotional disturbance was the result of a mental illness or mental defect, which falls within the broader purview of mitigating circumstance (2)(g). This assignment of error is without merit.\n\n10.5.6. Mitigating Circumstance (2)(g)\n\nSection 29-2523(2)(g), as amended by 1998 Neb. Laws, L.B. 422, provides that it is a mitigating circumstance when \"[a]t the time of the crime, the capacity of the defendant to appreciate the wrongfulness of his or her conduct or to conform his or her conduct to the requirements of the law was impaired as a result of mental illness, mental defect, or intoxication.\" Dr. Jeffrey testified that Lotter;s capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law was impaired as a result of mental illness, mental defect, or intoxication. The State did not dispute this statement. Dr. Fine testified that Lotter has several mental disorders that have been ongoing since birth, that Lotter had those disorders at the time the crimes were committed, and that Lotter would continue to have those disorders. Dr. Fine described Lotter as \"extremely dysfunctional\" and stated that Lotter;s mental disorders impaired his ability to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law.\n\nLotter argues that the weight given to this circumstance was erroneously diminished based on the sentencing panel;s reference to its findings regarding § 29-2523(2)(b), (c), and (d) and the panel;s finding that Lotter was not intoxicated.\n\nWe conclude that even were Lotter intoxicated, any additional weight Lotter;s intoxication would have is insufficient to approach or exceed the weight of the aggravating circumstances in the instant case. Thus, this assignment of error is without merit.\n\n10.5.7. Mitigating Circumstance (2)(d)\n\nLotter also claims that mitigating circumstance (2)(d) existed, since it requires only that a capital defendant have an \"age.\" Lotter asserts that because he has an ascertainable age, the only question is the weight to be attributed to this mitigating circumstance.\n\nAccording to the plain language of subsection (2)(d), \"[t]he age of the defendant at the time of the crime\" is a mitigating circumstance. However, in State v. Simants, 197 Neb. 549, 250 N.W.2d 881 (1977), this court held that subsection (2)(d) refers only to a child of tender age, a juvenile, or a person of advanced years, where senility may be involved. Lotter acknowledges our holding in Simants, but points out that since Simants was decided, the Legislature absolutely prohibited the imposition of the death penalty on anyone under the age of 18 at the time the crime is committed. Neb. Rev. Stat. § 28-105.01 (Reissue 1995). Lotter argues that the adoption of § 28-105.01 indicates that the Simants court;s interpretation of (2)(d) is no longer applicable.\n\nWe disagree. Section 28-105.01 merely narrows the application of mitigating circumstance (2)(d) to persons of advanced years. Because Lotter is not such a person, he cannot receive the benefit of this statutory mitigating circumstance.\n\n10.5.8. Comparative Analysis\n\nLotter;s assertion that the sentencing panel erred by incorrectly conducting its comparative review is without merit according to our analysis of assignment of error 10.4.\n\n10.6. Jurisdiction and Double Jeopardy\n\nOn February 21, 1996, Lotter was sentenced to a term of not less than 100 months; nor more than 300 months; imprisonment for his burglary conviction and to a term of not less than 100 months; nor more than 300 months; imprisonment for each use of a weapon conviction. On February 29, the court set aside the burglary and use of a weapon sentences as in excess of the limits as prescribed by law and resentenced Lotter to not less than 80 months; nor more than 20 years; imprisonment for the burglary conviction and to not less than 80 months; nor more than 20 years; imprisonment for each use of a weapon conviction. Lotter argues that the district court lacked jurisdiction to modify the sentences and that the Double Jeopardy Clause of the Fifth Amendment prohibits imposing a sentence for both felony murder and the underlying felony offense, citing State v. McHenry, 250 Neb. 614, 550 N.W.2d 364 (1996). Lotter asserts that because the trial court lacked jurisdiction to modify the sentences imposed on February 21, and because the sentences then imposed were outside the authority of the trial court to enter, the cause must be remanded by this court for another sentencing determination in that regard.\n\nIn State v. McHenry, supra, this court held that the underlying felony merges into a felony murder conviction and cannot be punished separately, barring a clear indication by the Legislature that independent punishments were intended. We also held that vacating the sentence for the underlying felony cures the double jeopardy violation. As to the burglary conviction, the State concedes that Lotter is entitled to the vacation of his sentence. Accordingly, we conclude that Lotter;s burglary sentence must be vacated.\n\nThe remaining question is whether the district court had jurisdiction to modify the sentences imposed on February 21, 1996. This court has stated:\n\n[W]hen a valid sentence has been put into execution the trial court cannot modify, amend, or revise it in any way, either during or after the term or session of court at which the sentence was imposed. Any attempt to do so is of no effect and the original sentence remains in force.\n\n(Emphasis supplied.) State v. Brewer, 190 Neb. 667, 676-77, 212 N.W.2d 90, 95 (1973). See, also, State v. Christiansen, 217 Neb. 740, 351 N.W.2d 67 (1984). However, the sentences imposed in the instant case on February 21 were not \"valid sentences.\" Rather, they were invalid in that the maximum period of incarceration specified exceeded that which is authorized by statute. See Neb. Rev. Stat. § 28-105 (Reissue 1995). When a sentence imposed is unauthorized under law, it is void, and a void sentence is no sentence. State v. Wilcox, 239 Neb. 882, 479 N.W.2d 134 (1992). In other words, the trial court did not impose any sentences in the instant case until February 29. See State v. Gaston, 191 Neb. 121, 214 N.W.2d 376 (1974) (distinguishing State v. Brewer, supra).\n\n10.7. Reweighing\n\nFinally, Lotter challenges the constitutionality of this court;s reweighing of death penalty sentences. According to our analysis in State v. Moore, 250 Neb. 805, 553 N.W.2d 120 (1996), this assignment of error is without merit.\n\n10.8. Excessive Sentence\n\nThis assignment of error is without merit according to our analysis of assignment of error No. 10.4.\n\n11. AMENDED INFORMATION\n\nIn his pro se brief, Lotter asserts that the trial court erred in denying his motion to quash. However, both of Lotter;s assignments in this regard, Nos. 11.1 and 11.2, have already been disposed of by our analysis of assignments of error Nos. 8.2.1 and 10.1.\n\n12. OPENING AND CLOSING STATEMENTS\n\nLotter;s arguments concerning closing statements are without merit according to our analysis of assignment of error No. 2.7. In regard to his assertions regarding opening statements, we note that the case he cites supports the Conclusion that there was no prosecutorial misconduct here. See King v. Borg, 21 F.3d 1113 (9th Cir. 1994) (unpublished decision). This assignment of error is without merit.\n\n13. MOTION FOR REMAND\n\nAfter oral argument, Lotter filed a motion to remand for resentencing after adoption of 1998 Neb. Laws, L.B. 422. Section 29-2523(1(b) and (h), which was amended by L.B. 422, effective July 15, 1998, now states:\n\n(b) The murder was committed in an apparent effort to conceal the commission of a crime, or to conceal the identity of the perpetrator of a such crime;\n\n....\n\n(h) The crime murder was committed knowingly to disrupt or hinder the lawful exercise of any governmental function or the enforcement of the laws....\n\n(The words stricken have been deleted and the words underlined have been added.) Lotter was sentenced prior to the effective date of the amendment. Accordingly, Lotter filed a motion asking this court to remand the instant cause for resentencing in accordance with the amendments.\n\nThis court has \"consistently held that where a criminal statute is amended by mitigating the punishment, after the commission of a prohibited act but before final judgment, the punishment is that provided by the amendatory act unless the Legislature has specifi[ed] otherwise.\" (Emphasis in original.) State v. Schrein, 247 Neb. 256, 258, 526 N.W.2d 420, 421 (1995). See, also, State v. Randolph, 186 Neb. 297, 183 N.W.2d 225 (1971). Furthermore, this court has held that a defendant;s sentence and conviction become a final judgment on the date that this court enters its mandate concerning a defendant;s direct appeal. State v. Schrein, supra; State v. Warner, 192 Neb. 438, 222 N.W.2d 292 (1974). Thus, the question is whether the amendments to § 29-2523 mitigate the punishment imposed.\n\nLotter argues that the amendments have limited the application of subsections (1)(b) and (1)(h) to a class of homicides more narrow than at the time Lotter was sentenced. If the applicable scope of the aggravating circumstances has indeed narrowed, Lotter;s actions may no longer fit within the circumstances; purview, rendering them inapplicable. If subsections (1)(b) and (1)(h) have been rendered inapplicable, Lotter;s sentence would have to be reweighed, possibly resulting in the reduction of his death sentence to a life sentence, which would clearly mitigate his punishment. Therefore, to determine whether § 29-2523 has been amended to mitigate the punishment, we must determine whether the amendments narrowed the scope of the statute;s applicability.\n\na. Aggravating Circumstance (1)(b)\n\nFirst, we must determine the effect of the deletion of the word \"apparent\" from subsection (1)(b). In State v. Reeves, 234 Neb. 711, 754, 453 N.W.2d 359, 386 (1990), this court held that the term \"'apparent;\" as used in subsection (1)(b) means \"'readily perceptible,; and therefore'the provision cannot be applied in speculative situations or where a strained construction is necessary to fulfill it.;\" In State v. Moore, 250 Neb. 805, 813, 553 N.W.2d 120, 128 (1996), we addressed whether the word \"apparent\" improperly alters the burden of proof regarding subsection (1)(b) and stated:\n\n[The defendant] confuses the substance of what must be proved with the placement of the burden to prove it..\n\n.. \"Apparent\" qualifies aggravating circumstance §29-2523(1)(b) to the extent that the provision cannot be applied in speculative situations or where a strained construction is necessary to fulfill it. Consequently, the substance of what must be proved to establish this aggravating circumstance is that the murder was committed in a readily perceptible effort to conceal the commission of a crime or to conceal the identity of the perpetrator of a crime. It is the State which must shoulder the burden of proving the existence of aggravating circumstance §29-2523(1)(b) beyond a reasonable doubt.\n\nSee, also, State v. Reeves, supra.\n\nWhat, however, is the \"substance\" of the word \"apparent\"? To answer this question, we must clarify the meaning of the phrase \"readily perceptible.\" Webster;s defines \"readily\" as \"easily.\" Webster;s Encyclopedic Unabridged Dictionary of the English Language 1195 (1994). \"Perceptible\" is defined as \"capable of being perceived,\" which could be restated as \"capable of being noted.\" Id. at 1069 (defining perceptible and listing \"note\" as a synonym of \"perceive\"). Furthermore, \"easily\" means \"without trouble.\" Id. at 449. Thus, broken into separate elements, \"readily perceptible\" means \"capable of being easily noted\" or \"capable of being noted without trouble.\"\n\nAccordingly, for the sentencing panel to conclude that Lotter murdered Lambert and DeVine in an \"'apparent effort to conceal the commission of a crime,;\" it must have been obvious to the panel that was Lotter;s purpose. If it were not obvious, it would not have been \"easily capable of being noticed.\" Indeed, if the deletion of the word \"apparent\" has any substantive effect at all, it would be to increase the ease with which a sentencing panel may conclude that a defendant was attempting to conceal the commission of a crime.\n\nThe foregoing Discussion should make the following point clear: The word \"apparent\" never had any \"substance\" within the context of subsection (1)(b). At most, it was an obtuse way of stating that the particular aggravating circumstance at issue must be proved beyond a reasonable doubt. To hold otherwise, we would have to conclude that with the deletion of the word \"apparent,\" aggravating circumstance (1)(b) may now be applied when its existence is merely speculative or requires a strained construction.\n\nThe amendments to § 29-2523 include a provision explicitly stating, \"The facts upon which the applicability of an aggravating circumstance depends must be proved beyond a reasonable doubt.\" See, also, State v. Victor, 235 Neb. 770, 457 N.W.2d 431 (1990) (holding likewise). The Legislature doubtless concluded, as do we, that with the addition of explicit language indicating as much, the word \"apparent\" was rendered redundant. Because the word \"apparent\" was merely redundant, its deletion has no effect on the applicability of subsection (1)(b).\n\nNext, we must determine whether the substitution of the word \"such\" for \"a\" has narrowed the applicability of subsection (1)(b). In State v. Hunt, 220 Neb. 707, 371 N.W.2d 708 (1985), this court held that subsection (1)(b) does not apply when the only \"crime\" committed by the defendant is the murder to which subsection (1)(b) is to be applied. \"Certainly, any killing has the effect of rendering the victim incapable of identifying the perpetrator; that truism, however, does not satisfy the requirement that the murder be committed'to conceal the identity of the perpetrator.;\" Id. at 725, 371 N.W.2d at 720-21 (citing State v. Williams, 217 Neb. 539, 352 N.W.2d 538 (1984), and State v. Reeves, 216 Neb. 206, 344 N.W.2d 433 (1984)). Thus, for subsection (1)(b) to apply, a defendant must commit the murder in an effort to conceal some crime or to conceal the identity of the perpetrator of some crime other than the murder itself. The addition of the word \"such\" has no effect other than to ensure that \"crime\" referred to is not the \"murder\" itself.\n\nThus, the deletion of the word \"apparent\" and the substitution of the word \"such\" for \"a\" in subsection (1)(b) merely eliminate redundancy and clarify existing law. Because the amendments to subsection (1)(b) do not alter the scope of its applicability, they do not serve to mitigate punishment.\n\nb. Aggravating Circumstance (1)(h)\n\nIn the absence of any specific limitation, the word \"murder,\" which replaces the word \"crime\" in subsection (1)(h), must necessarily refer to both felony and premeditated murder. See State v. White, 254 Neb. 566, 577 N.W.2d 741 (1998) (holding that premeditated and felony murder are merely alternate theories of the same crime). Accordingly, we must conclude that the Legislature replaced the word \"crime\" with the word \"murder\" to ensure that the act referred to was limited to the murder to which the subsection was to be applied, as opposed to the underlying felony in a felony murder or some other unrelated crime.\n\nHowever, the addition of the word \"knowingly\" does narrow the scope of the applicability of subsection (1)(h) and thus, may act to mitigate Lotter;s punishment. In State v. Fries, 214 Neb. 874, 886, 337 N.W.2d 398, 405 (1983), this court stated that \"'knowingly;\" means \"'willfully,;\" as distinguished from \"accidentally or involuntarily.\" In other words, to commit an act knowingly, the defendant must be aware of what he is doing. Accordingly, for subsection (1)(h) to apply, a defendant must be aware that the murder was committed to \"disrupt or hinder the lawful exercise of any governmental function or the enforcement of the laws.\" Prior to the amendments wrought by 1998 Neb. Laws, L.B. 422, there was no such knowledge requirement.\n\nTherefore, in the instant case, subsection (1)(h) can be applied to Lotter;s sentence only if Lotter knowingly committed the murder to disrupt or hinder the enforcement of the laws. In its order, the sentencing panel stated that Lotter drove to Lambert;s house \"for the express purpose of murdering Teena Brandon so that she would not be alive to act as a witness for the State in any potential prosecution against [him] for sexually assaulting and kidnapping her.\" Thus, even though the statute did not impose a knowledge requirement at the time of Lotter;s sentencing, the sentencing panel nevertheless found that Lotter knew the murder was committed to hinder or disrupt the enforcement of the laws.\n\nBecause the amendments to subsection (1)(b) do not act to mitigate the punishment and because the sentencing panel found that Lotter possessed the requisite knowledge pursuant to subsection (1)(h), no remand is required in the instant case.\n\nIV. CONCLUSION\n\nWe hereby vacate Lotter;s sentence on the burglary conviction. Because we conclude that Lotter;s remaining assignments of error are without merit, we affirm his convictions and other sentences.\n\nAFFIRMED, AND BURGLARY SENTENCE VACATED.\n\nCONNOLLY, J., Concurring.\n\nI concur but write separately to raise certain issues concerning this court;s application of the risk of nonpersuasion to mitigating circumstances and this court;s proportionality review.\n\nRISK OF NONPERSUASION\n\nOur holding in State v. Reeves, 234 Neb. 711, 453 N.W.2d 359 (1990), wherein we indicated that there is no burden of proof with regard to mitigating factors, I believe has been inaccurately stated. The function of a standard of proof, as that concept is embodied in the Due Process Clause and in the realm of factfinding, is to instruct the finder of fact concerning the degree of confidence our society thinks he or she should have in the correctness of factual Conclusions for a particular type of adjudication. Lynch v. Nebraska Dept. of Corr. Servs., 245 Neb. 603, 514 N.W.2d 310 (1994). A finding of fact invariably requires that some burden of proof be met; otherwise, any evidence produced must be believed (the degree of confidence required being nil). Indeed, for a fact finder to be \"persuaded\" by a defendant;s evidence, he or she must, at a minimum, be convinced that it is more likely than not that the evidence produced by the defendant is worthy of belief. If the fact finder were not so convinced, he or she could not be so \"persuaded.\" Thus, the phrase \"risk of nonpersuasion\" means nothing more than that the defendant has to prove statutory mitigating circumstances exist by a \"preponderance of the evidence.\" We should explicitly state that defendants must prove the existence of statutory mitigating circumstances by a preponderance of the evidence. See, e.g., Com. v. Walker, 540 Pa. 80, 656 A.2d 90 (1995) (holding that such scheme is not unconstitutional); State v. Cooper, 151 N.J. 326, 700 A.2d 306 (1997) (explaining why burden should be on defendant rather than on state).\n\nPROPORTIONALITY REVIEW\n\nI am also compelled to point out that this court;s current interpretation of the proportionality statutes leads to illogical results.\n\nIn State v. Simants, 197 Neb. 549, 564, 250 N.W.2d 881, 890 (1977), which was decided prior to the Legislature;s adoption of Neb. Rev. Stat. §§ 29-2521.01 to 29-2521.04 (Reissue 1995), this court stated that it would \"compare each capital case under review with those previous cases in which the death penalty has or has not been imposed under the new [1973] statute.\" (Emphasis supplied.) This court reasoned that by undertaking such a review, it could ensure that the death penalty is not applied in an arbitrary and capricious manner.\n\nIn 1978, the Legislature adopted §§ 29-2521.01 to 29-2521.04. Section 29-2521.03 provides in part that \"[n]o sentence imposed shall be greater than those imposed in other cases with the same or similar circumstances.\" (Emphasis supplied.)\n\nIn State v. Welsh, 202 Neb. 249, 275 N.W.2d 54 (1979), this court held that §§ 29-2521.01 to 29- 2521.04 applied only to convictions wherein the death penalty was imposed.\n\nLater, in State v. Williams, 205 Neb. 56, 76, 287 N.W.2d 18, 29 (1979), we held that §§ 29- 2521.01 to 29-2521.04 would \"be construed to require the Supreme Court to review and analyze only cases involving a conviction for first degree murder committed on or after April 20, 1973.\" This Conclusion was based on \"the fact that in this state first degree murder is the only crime for which the penalty of death can be imposed [and that these sections] apply only to a conviction for first degree murder....\" State v. Williams, 205 Neb. at 75, 287 N.W.2d at 28. We stated that it \"is a practical impossibility to make any meaningful comparison of a death sentence in a first degree murder case with any sentence imposed for another crime for which the death sentence is not authorized.\" Id. at 75, 287 N.W.2d at 29.\n\nIn State v. Moore, 210 Neb. 457, 473, 316 N.W.2d 33, 42 (1982), the defendant challenged the interpretation in Williams of §§ 29-2521.01 to 29-2521.04, arguing that the consideration of first degree murder convictions excludes from determination \"a large group of homicides in which defendants avoided death by being charged with lesser crimes than first-degree murder or by pleading to lesser charges, or by other acts of prosecutorial discretion in interpreting the charging facts.\" In response, this court delineated the reasons why a literal application of those sections would \"unconstitutionally encroach upon the judicial function.\" State v. Moore, 210 Neb. at 473, 316 N.W.2d at 42.\n\nWe stated that a literal construction would violate the separation of powers doctrine. First, we noted that \"the Legislature cannot direct the Disposition of one case by the factual determination of another.\" Id. at 474, 316 N.W.2d at 43. Second, we noted that this court would have to \"independently gather evidence.\" Id. at 475, 316 N.W.2d at 43. Third, we noted that this court would be required to \"find facts in a case not before it.\" Id. Fourth, we noted that it would impinge upon the \"executive function of the prosecutor.\" Id. Fifth, we noted that it would \"unconstitutionally restrict the appellate review powers of this court under Neb. Const. art. I, § 23.\" Id. at 476, 316 N.W.2d at 43. However, this court held that it would continue to make comparisons between first degree murder convictions.\n\nOur holding in Moore was affirmed in State v. Reeves, 216 Neb. 206, 344 N.W.2d 433 (1984), when we reviewed 58 cases wherein convictions of first degree murder had been imposed.\n\nFinally, in State v. Palmer, 224 Neb. 282, 328, 399 N.W.2d 706, 736 (1986), this court further limited its interpretation of §§ 29-2521.01 to 29-2521.04, holding that comparison reviews \"should include only those cases in which the death penalty was imposed.\" This court stated that \"in the absence of anything indicating the contrary, statutory language is to be given its plain and ordinary meaning,\" State v. Palmer, 224 Neb. at 294, 399 N.W.2d at 717, and that \"where the language of a statute is plain and unambiguous, no interpretation is needed, and a court is without authority to change such language.\" Id. at 295, 399 N.W.2d at 718. Nonetheless, when making its determination concerning the appropriate interpretation of §§ 29-2521.01 to 29-2521.04, this court stated, \"It is apparent that the statutes cannot be enforced as they were written.\" State v. Palmer, 224 Neb. at 323, 399 N.W.2d at 733. This court noted that in order to impose the death penalty, the sentencing entity must list the aggravating and mitigating circumstances in writing, which is not required when the sentence is life imprisonment. Based on that predicate, this court concluded that there is no way of knowing whether any aggravating or mitigating circumstances were present in a given case unless the sentence is death. Accordingly, this court concluded that \"no other case but a death sentence case can be said to be a case similar to that under review.\" Id. at 327-28, 399 N.W.2d at 736.\n\nI conclude that our holding in Palmer rendered proportionality review pursuant to §§ 29-2521.01 to 29-2521.04 a nullity. Our analysis in State v. Victor, 235 Neb. 770, 457 N.W.2d 431 (1990), provides an excellent example of the meaningless analysis this court engages in when performing a \"proportionality\" review according to Palmer. In Victor, we stated that §29-2521.03;s \"purpose... is to ensure that no sentence imposed shall be greater than those imposed in other cases with the same or similar circumstances and that the review should include only those cases in which the death penalty was imposed.\" 235 Neb. at 796, 457 N.W.2d at 447-48. We then noted that we had \"compared\" the case at issue with the \"applicable cases\" and concluded that \"the sentence imposed in this case is no greater than, nor disproportionate to, the sentence imposed in any other case with the same or similar circumstances.\" Id. at 796, 457 N.W.2d at 448. The obvious fallacy in this reasoning is that a death sentence cannot be \"greater than\" or \"disproportionate to\" another death sentence. Regardless of the aggravating circumstances present, the penalty imposed, which will always be the death penalty according to State v. Welsh, 202 Neb. 249, 275 N.W.2d 54 (1979), will never be greater than the penalty imposed in other similar cases when those cases are limited to those in which death has been imposed.\n\nIn construing a statute, a court must look to the statute;s purpose and give the statute a reasonable construction which best achieves that purpose, rather than a construction which would defeat it. In re Invol. Dissolution of Battle Creek State Bank, 254 Neb. 120, 575 N.W.2d 356 (1998). Moreover, in construing a statute, it is presumed that the Legislature intended a sensible, rather than an absurd, result. Hoiengs v. County of Adams, 254 Neb. 64, 574 N.W.2d 498 (1998). Certainly, the Legislature could not have intended §§ 29-2521.01 to 29-2521.04 to mean nothing.\n\nUnfortunately, a look at other jurisdictions; methods of proportionality review does not solve this puzzle. In State v. Bland, 958 S.W.2d 651 (Tenn. 1997), the Tennessee Supreme Court held that the death penalty is disproportionately imposed only when the case at issue, \"taken as a whole, is plainly lacking in circumstances consistent with those in similar cases in which the death penalty has been imposed.\" Id. at 665. The court stated that \"[e]ven if a defendant receives a death sentence when the circumstances of the offense are similar to those of an offense for which a defendant has received a life sentence, the death sentence is not disproportionate where the Court can discern some basis for the lesser sentence.\" Id. Moreover, the court noted that \"where there is no discernible basis for the difference in sentencing, the death sentence is not necessarily disproportionate.\" Id.\n\nIn Tennessee, the Supreme Court \"is not required to determine that a sentence less than death was never imposed in a case with similar characteristics.\" Id. Tennessee;s proportionately statute requires its appellate courts to determine only whether a \"'sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the nature of the crime and the defendant.;\" Id. According to the court, the word \"'disproportionate;\" clearly indicates that the court;s \"function in performing comparative review is not to search for proof that a defendant;s death sentence is perfectly symmetrical, but to identify and invalidate the aberrant death sentence.\" Id.\n\nAccordingly, in Bland the court upheld a death sentence even though the death sentence had not been imposed in a similar case. The court admitted that it had \"certainly found examples of more atrocious killings in which the jury declined to impose the death penalty.\" Id. at 670. However, the court emphasized that \"the isolated decision of the sentencer to afford mercy does not render the death sentence in this case disproportionate.\" Id.\n\nAlthough the holding in Bland would resolve this court;s proportionality dilemma, the holding is inconsistent with Nebraska;s statute. Neb. Rev. Stat. § 29-2522(3) (Reissue 1995) contains language similar to that in Tennessee;s statute, including the word \"disproportionate.\" However, §§ 29-2521.01 to 29-2521.04, the statutes at issue, do not. Rather, they clearly state that \"no sentence imposed shall be greater than those imposed in other cases with the same or similar circumstances.\" (Emphasis supplied.) § 29-2521.03. Thus, § 29-2521.03;s plain language clearly requires what Tennessee;s statute does not, that no death sentence be imposed when a sentence less than death was imposed in a case with similar characteristics.\n\nThat is why this court rejected the statute;s plain meaning in State v. Palmer, 224 Neb. 282, 327, 399 N.W.2d 706, 735 (1986), wherein this court stated that it was not\n\nthe purpose of the Legislature to eliminate all discretion in sentencing and ensure that the death penalty be imposed in every case in which it is a possible sentence or that the penalty not be imposed in cases in which it is appropriate because in certain other cases it was not imposed, although it might have been an appropriate sentence.\n\nThis court noted that \"[i]t would be possible to construe the statute so that cases in which the death penalty was not imposed, although upon reflection it could be said that the death penalty might have been imposed, would be the standard against which all future death penalty cases would be compared.\" Id. However, such a construction would \"for all practical purposes... amount to a repeal of the death penalty,\" id. at 327, 399 N.W.2d at 735-36, because, as the court recognized in Bland, sentencing cannot be conducted with mathematical precision.\n\nThis court stated in Palmer that it did not \"understand that the Legislature intended the statute to effect a repeal of the death penalty.\" 224 Neb. at 327, 399 N.W.2d at 736. The court took judicial notice of the fact that the Legislature had considered bills to repeal the death penalty and had rejected them. Indeed, it would be as illogical to hold that a statute intended to ensure the death penalty is applied proportionally was intended to overrule the death penalty as it is to give the proportionality statute no meaning at all. Why ensure that the death penalty is applied proportionately if the death penalty is not to be applied?\n\nIf the Legislature intends to require perfect symmetry in the sentencing of homicides, which is not only impossible but constitutionally unnecessary, see Gregg v. Georgia, 428 U.S. 153, 96 S. Ct. 2909, 49 L. Ed. 2d 859 (1976), it should simply repeal the death penalty outright.\n\nThis court is caught between a rock and a hard place. The interpretation in Palmer of §§ 29- 2521.01 to 29-2521.04 is illogical. However, to reinterpret §§ 29-2521.01 to 29-2521.04 would require this court to (1) interpret the statute as written, thus accepting that the Legislature intended to implicitly repeal the death penalty, or (2) adopt some other interpretation that is unsupported by the statutory language. The first choice would be as illogical as this court;s holding in Palmer; this court would simply substitute one flawed result for another. The second choice would require this court to disregard its canons of statutory construction and act in a legislative capacity. Both choices would require this court to add yet another layer of judicial gloss to an already convoluted canvas.\n\nThe Legislature has not amended or repealed §§ 29-2521.01 to 29-2521.04 since this court decided Palmer. In the absence of Legislative action, and in light of the above analysis, I see little reason for this court to further muddy the waters by overruling Palmer, illogical holding or not. I can only conclude that any changes to our statutory proportionality scheme should be effected by the Legislature, not by this court.\n\nConclusion\n\nThis court;s precedents misstate the defendant;s burden of proving statutory mitigating circumstances. Rather than misstating that burden as \"risk of nonpersuasion,\" this court should refer to it by its proper nomenclature, \"preponderance of the evidence.\" Finally, I urge the Legislature to either substantially amend or repeal §§ 29-2521.01 to 29-2521.04, thereby resolving this court;s battle with comparative review.\n\nGERRARD, J., Concurring.\n\nI share Justice Connolly;s concern as to whether our current interpretation of Neb. Rev. Stat. §§ 29-2521.01 through 29-2521.04 (Reissue 1995), i.e., that proportionality reviews \"should include only those cases in which the death penalty was imposed,\" State v. Palmer, 224 Neb. 282, 328, 399 N.W.2d 706, 736 (1986), accurately reflects the intent of the Legislature when 1978 Neb. Laws, L.B. 711, was passed 20 years ago. However, because a literal interpretation of §§ 29-2521.01 through 29-2521.04 would violate the separation of powers doctrine, see State v. Moore, 210 Neb. 457, 316 N.W.2d 33 (1982), the principle of stare decisis properly requires adherence to State v. Palmer, supra, under these circumstances.\n\nAs has been noted before, \"'in most matters it is more important that the applicable rule of law be settled than that it be settled right.... This is commonly true even where the error is a matter of serious concern, provided correction can be had by legislation.;\" (Emphasis supplied.) State v. Hingst, 251 Neb. 535, 539, 557 N.W.2d 681, 684 (1997) (Cassel, D.J., Concurring) (quoting Burnet v. Coronado Oil \u0026 Gas Co., 285 U.S. 393, 52 S. Ct. 443, 76 L. Ed. 815 (1932) (Brandeis, J., Dissenting)). See, also, Crown Products Co. v. City of Ralston, 253 Neb. 1, 567 N.W.2d 294 (1997) (Caporale, J., Concurring).\n\nWe have determined that proportionality review is not constitutionally required before imposing the death penalty, see State v. Palmer, supra (citing Pulley v. Harris, 465 U.S. 37, 104 S. Ct. 871, 79 L. Ed. 2d 29 (1984)), and it is a firmly established rule of construction that where a statute has been judicially construed and that construction has not evoked an amendment, it will be presumed that the Legislature has acquiesced in the court;s determination of the Legislature;s intent. State v. White, 254 Neb. 566, 577 N.W.2d 741 (1998); State v. Atkins, 250 Neb. 315, 549 N.W.2d 159 (1996); State v. Joubert, 246 Neb. 287, 518 N.W.2d 887 (1994). The Legislature has never amended §§29-2521.01 through 29-2521.04.\n\nTherefore, in the absence of a constitutional requirement for proportionality review, it is the province of the Legislature, not the courts, to amend §§ 29-2521.01 through 29-2521.04 if proportionality reviews are to be conducted in a manner that is both meaningful and properly within our power to review.\n\nFor these reasons, and because, in any event, Lotter;s penalty is no greater than penalties imposed in other cases with the same or similar circumstances (i.e., triple homicide) since April 20, 1973, see § 29-2521.02, I concur in that part of the judgment affirming the penalty of death. In all other respects, I join in the opinion and judgment of the court.\n\nSTEPHAN, J., joins in this concurrence.\n\n",
    "body_length": 155450,
    "citedas": [
      "255 Neb. 456",
      "586 N.W.2d 591"
    ],
    "attorneys": "James R. Mowbray and Jerry L. Soucie, of Nebraska Commission on Public Advocacy, for appellant, and, on brief, John L. Lotter, pro se. Don Stenberg, Attorney General, and J. Kirk Brown for appellee.",
    "category": [
      "243",
      "78"
    ],
    "judges": "White, C.j., Caporale, Wright, Connolly, Gerrard, Stephan, and Mccormack, JJ.",
    "citation_count": 59
  }
}
