{
  "id": "qqKDR2YBTlTomsSBcn-v",
  "document": {
    "title": "People ex rel. Gallo v. Acuna",
    "full_title": "THE PEOPLE EX REL. JOAN R. GALLO, AS CITY ATTORNEY, ETC. AND v. CARLOS ACUNA ET AL. AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1997-01-30T00:00:00.000Z",
    "docket": "No. S046980.",
    "body": "BROWN, J.\n\nAt the request of the City Attorney of the City of San Jose (hereafter the City), we granted review to resolve an array of challenges to two provisions of a preliminary injunction entered by the superior court against individual members of an alleged \"criminal street gang.\" The underlying action was instituted under the provisions of sections 731 of the Code of Civil Procedure and 3480 of the Civil Code, the operative core of California's civil \"public nuisance\" statutes.\n\nThe 48 declarations submitted by the City in support of its plea for injunctive relief paint a graphic portrait of life in the community of Rocksprings. Rocksprings is an urban war zone. The four-square-block neighborhood, claimed as the turf of a gang variously known as Varrio Sureo Town, Varrio Sureo Treces (VST), or Varrio Sureo Locos (VSL), is an occupied territory. Gang members, all of whom live elsewhere, congregate on lawns, on sidewalks, and in front of apartment complexes at all hours of the day and night. They display a casual contempt for notions of law, order, and decency--openly drinking, smoking dope, sniffing toluene, and even snorting cocaine laid out in neat lines on the hoods of residents' cars. The people who live in Rocksprings are subjected to loud talk, loud music, vulgarity, profanity, brutality, fistfights and the sound of gunfire echoing in the streets. Gang members take over sidewalks, driveways, carports, apartment parking areas, and impede traffic on the public thoroughfares to conduct their drive-up drug bazaar. Murder, attempted murder, drive-by shootings, assault and battery, vandalism, arson, and theft are commonplace. The community has become a staging area for gang-related violence and a dumping ground for the weapons and instrumentalities of crime once the deed is done. Area residents have had their garages used as urinals; their homes commandeered as escape routes; their walls, fences, garage doors, sidewalks, and even their vehicles turned into a sullen canvas of gang graffiti.\n\nThe people of this community are prisoners in their own homes. Violence and the threat of violence are constant. Residents remain indoors, especially at night. They do not allow their children to play outside. Strangers wearing the wrong color clothing are at risk. Relatives and friends refuse to visit. The laundry rooms, the trash dumpsters, the residents' vehicles, and their parking spaces are used to deal and stash drugs. Verbal harassment, physical intimidation, threats of retaliation, and retaliation are the likely fate of anyone who complains of the gang's illegal activities or tells police where drugs may be hidden.\n\nAmong other allegations, the City's complaint asserted that the named defendants and others \"[f]or more than 12 months precedent to the date of [the] complaint, continuing up to the present time . . . [have] occupied [and] used the area commonly known as 'Rocksprings' . . . in such a manner so as to constitute a public nuisance . . . injurious to the health, indecent or offensive to the senses, [and] an obstruction to the free use of property so as to interfere with the comfortable enjoyment of life or property by those persons living in the . . . neighborhood.\"\n\nAfter alleging the usual requisites for equitable relief--the prospect of \"great and irreparable injury\" and the absence of \"a plain, adequate and speedy remedy at law\"--the complaint prayed for a broad and comprehensive injunction against defendants' alleged activities in Rocksprings. The superior court granted an ex parte temporary restraining order enjoining all 38 defendants named in the complaint and issued an order to show cause (OSC) why a preliminary injunction should not be entered.\n\nOnly five of the named defendants appeared in response to the OSC. Following a hearing, the superior court entered a preliminary injunction against the 33 defendants who had not appeared and continued the matter as to those 5 defendants who opposed entry of a preliminary injunction, leaving the temporary restraining order in force as to them. Eleven of the named defendants (the five who had originally appeared in opposition to the OSC, together with another six of the named defendants) moved to vacate the injunctions. After the matter was briefed and argued, the superior court entered a preliminary injunction. The multipart decree, consisting of some 24 paragraphs, was the subject of an interlocutory appeal by these 11 defendants.\n\nThe Court of Appeal disagreed with the superior court, upholding only provisions of the preliminary injunction enjoining acts or conduct defined as crimes under specific provisions of the Penal Code. Although its premise is never clearly articulated, that ruling effectively limits the scope of permissible injunctive relief under California's public nuisance statutes to independently criminal conduct. The Court of Appeal also concluded many of the provisions of the preliminary injunction were void and unenforceable under either the First and Fifth Amendments to the federal Constitution as unconstitutionally vague or overbroad. Altogether, 15 of the 24 provisions of the trial court's preliminary injunction were partially or entirely invalidated. However, the City's petition only sought review of two provisions--paragraphs (a) and (k). We granted the City's petition and now reverse.\n\nWe consider first the scope of and conditions precedent to the exercise of the superior court's equitable jurisdiction to enjoin a public nuisance. We then assess defendants' challenges to paragraphs (a) and (k) of the superior court's preliminary injunction, challenges based on restraints inherent in the administration of equitable remedies, and those arising from constitutionally based limitations. Finally, we consider (and reject) defendants' arguments that the STEP Act \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e is the exclusive means of obtaining nuisance-based injunctive relief against a criminal street gang. We will conclude the two challenged provisions fall within the superior court's equitable power to abate a public nuisance and neither runs afoul of rights secured to defendants by the federal Constitution.\n\nI. EQUITABLE JURISDICTION TO ENJOIN PUBLIC NUISANCES\n\nA. The Origin and Nature of Actions to Enjoin Public Nuisances\n\nOften the public interest in tranquillity, security, and protection is invoked only to be blithely dismissed, subordinated to the paramount right of the individual. In this case, however, the true nature of the trade-off becomes painfully obvious. Liberty unrestrained is an invitation to anarchy. Freedom and responsibility are joined at the hip. \"Wise accommodation between liberty and order always has been, and ever will be, indispensable for a democratic society.\" ( Kovacs v. Cooper (1948) 336 U.S. 77, 89 [69 S. Ct. 448, 454, 93 L. Ed. 513, 10 A.L.R.2d 608] (conc. opn. of Frankfurter, J.).) There must be an irreducible minimum of reciprocity for civil society to function. \"he very concept of ordered liberty precludes allowing every person to make his own standards on matters of conduct in which society as a whole has important interests.\" ( Wisconsin v. Yoder (1972) 406 U.S. 205, 215-216 [92 S. Ct. 1526, 1533, 32 L. Ed. 2d 15].)\n\nThe state has not only a right to \"maintain a decent society\" ( Jacobellis v. Ohio (1964) 378 U.S. 184, 199 [84 S. Ct. 1676, 1684, 12 L. Ed. 2d 793]), but an obligation to do so. In the public nuisance context, the community's right to security and protection must be reconciled with the individual's right to expressive and associative freedom. Reconciliation begins with the acknowledgment that the interests of the community are not invariably less important than the freedom of individuals. Indeed, the security and protection of the community is the bedrock on which the superstructure of individual liberty rests. From Montesquieu to Locke to Madison, the description of the pivotal compact remains unchanged: By entering society, individuals give up the unrestrained right to act as they think fit; in return, each has a positive right to society's protection. Montesquieu describes this civil liberty as \"that tranquillity of spirit which comes from the opinion each one has of his security, and in order for him to have this liberty the government must be such that one citizen cannot fear another citizen.\" (Montesquieu, The Spirit of the Laws (U. Cambridge Press 1989) ch. 6, p. 157; and see Locke, Two Treatises on Government (U. Cambridge Press, student ed. 1988) § 122, 140, 211, 227; Madison, The Federalist No. 51 (Rossiter ed. 1961) pp. 324, 325.) As we explain, a principal office of the centuries-old doctrine of the \"public nuisance\" has been the maintenance of public order--tranquillity, security and protection--when the criminal law proves inadequate.\n\nThere are few \"forms of action\" in the history of Anglo-American law with a pedigree older than suits seeking to restrain nuisances, whether public or private. Actions to abate private nuisances by injunction are the oldest of these apparent twins, which have almost nothing in common except the word \"nuisance\" itself. Unlike the private nuisance--tied to and designed to vindicate individual ownership interests in land --the \"common\" or public nuisance emerged from distinctly different historical origins. The public nuisance doctrine is aimed at the protection and redress of community interests and, at least in theory, embodies a kind of collective ideal of civil life which the courts have vindicated by equitable remedies since the beginning of the 16th century.\n\nOriginally, a public nuisance was an offense against the crown, prosecuted as a crime. The first known statute dealing with public nuisances--enacted in the 12th year of Richard II's reign--had as its subject the pollution of waters and ditches lying near settlements, and provided criminal liability for the offender. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The earliest public nuisance statute thus bore a feature that marks the entire field even today: public nuisances are offenses against, or interferences with, the exercise of rights common to the public. (See generally, Baker, An Introduction to English Legal History (3d ed. 1990) pp. 492-494.)\n\nIn this country, as in England, civil suits in equity to enjoin public nuisances at the instance of public law officers--typically a state's Attorney General--grew increasingly common during the course of the 19th century, a trend that was not without critics. (See, e.g., 2 Story, Equity Jurisprudence (14th ed. 1918) § 1250, p. 597 [\"In cases of public nuisances properly so called an indictment lies to abate them and to punish the offenders. But an information also lies in equity to redress the grievance by way of injunction.\" (Fn. omitted.)]; Mugler v. Kansas (1887) 123 U.S. 623, 672-673 [8 S. Ct. 273, 302-303, 31 L. Ed. 205]; cf. State v. Ehrlick (1909) 65 W.Va. 700 [64 S.E. 935, 938] [\" 'If a charge be of a criminal nature, or an offense against the public, and does not touch the enjoyment of property, it ought not to be brought within the direct jurisdiction of this court, which was intended to deal only in matters of civil right resting in equity . . . .' Attorney General v. Insurance Co., 2 Johns. Ch. 378 . . . .\"].)\n\nWith the publication of the Restatement Second of Torts in 1965, the law of public nuisances had crystallized to such an extent that its features could be clearly delineated. Section 821B of Restatement Second of Torts identifies five general categories of \"public rights,\" the unreasonable interference with which may constitute a public nuisance: \"the public health, the public safety, the public peace, the public comfort or the public convenience.\" (Rest.2d Torts, § 821B, subd. (2)(a).) A \"public right,\" according to the Restatement Second, \"is one common to all members of the general public. It is collective in nature and not like the individual right that everyone has not to be assaulted or defamed or defrauded or negligently injured.\" (Id., com. g, p. 92.)\n\nIn California, the early common law categories of public nuisance, codified in 1872 and still applicable, define anything that is \"injurious to health, . . . or is indecent or offensive to the senses, or an obstruction to the free use of property, so as to interfere with the comfortable enjoyment of life or property, or unlawfully obstructs the free passage or use, in the customary manner, of any navigable lake, or river, bay, stream, canal, or basin, or any public park, square, street, or highway,\" as a nuisance. (Civ. Code, § 3479.) Civil Code sections 3480 and 3481 divide the class of nuisances into public and private. A public nuisance is one which \"affects at the same time an entire community or neighborhood, or any considerable number of persons.\" (Civ. Code, § 3480.) Rounding out the taxonomy of the Civil Code, section 3491 provides that \"[t]he remedies against a public nuisance are: 1. Indictment or information; 2. A civil action; or, 3. Abatement.\"\n\nSection 370 of the Penal Code mirrors these civil provisions, combining the characteristics of nuisances generally with a distinctly public quality: that a given activity \"interfere with the comfortable enjoyment of life or property by an entire community or neighborhood, or by any considerable number of persons.\" (Pen. Code, § 370, italics added.) In People ex rel . Busch v. Projection Room Theater (1976) 17 Cal. 3d 42, 49 [130 Cal. Rptr. 328, 550 P.2d 600], we parsed these code provisions, remarking on \"the substantial identity of definitions appearing in Penal Code sections 370 and 371, and Civil Code sections 3479 and 3480 . . . .\" After quoting the text of section 370, we observed: \"he proscribed act may be anything which alternatively is injurious to health or is indecent, or offensive to the senses; the result [] of the act must interfere with the comfortable enjoyment of life or property; and those affected by the act may be an entire neighborhood or a considerable number of persons, and as amplified by Penal Code section 371 the extent of the annoyance or damage on the affected individuals may be unequal.\" (People ex rel. Busch v. Projection Room Theater, (supra) , 17 Cal. 3d at p. 49, original italics deleted, new italics added.)\n\nIt is this community aspect of the public nuisance, reflected in the civil and criminal counterparts of the California code, that distinguishes it from its private cousin, and makes possible its use, by means of the equitable injunction, to protect the quality of organized social life. Of course, not every interference with collective social interests constitutes a public nuisance. To qualify, and thus be enjoinable, the interference must be both substantial and unreasonable. We recently discussed these two requirements, albeit in the context of private nuisances, in San Diego Gas \u0026 Electric Co. v. Superior Court (1996) 13 Cal. 4th 893 [55 Cal. Rptr. 2d 724, 920 P.2d 669]. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Relying on the Restatement Second of Torts, we observed that \" 'Life in organized society and especially in populous communities involves an unavoidable clash of individual interests. Practically all human activities unless carried on in a wilderness interfere to some extent with others or involve some risk of interference, and these interferences range from mere trifling annoyances to serious harms. It is an obvious truth that each individual in a community must put up with a certain amount of annoyance, inconvenience and interference and must take a certain amount of risk in order that all may get on together.' \" (13 Cal. 4th at p. 937, quoting Rest.2d Torts, § 822, com. g, p. 112.)\n\nThe Restatement Second formulates the requirement of substantiality as proof of \"significant harm,\" defined as a \"real and appreciable invasion of the plaintiff's interests,\" one that is \"definitely offensive, seriously annoying or intolerable.\" (Rest.2d Torts, § 821F, coms. c \u0026 d, pp. 105-106.) The measure is an objective one: \"If normal persons in that locality would not be substantially annoyed or disturbed by the situation, then the invasion is not a significant one . . . .\" (Id., com. d, p. 106.) The unreasonableness of a given interference represents a judgment reached by comparing the social utility of an activity against the gravity of the harm it inflicts, taking into account a handful of relevant factors. (See Rest.2d Torts, § 826-831; San Diego Gas \u0026 Electric Co. v. Superior Court, (supra) , 13 Cal. 4th at p. 938.) Here again, the standard is an objective one: \"he question is not whether the particular plaintiff found the invasion unreasonable, but 'whether reasonable persons generally, looking at the whole situation impartially and objectively, would consider it unreasonable.' \" ( San Diego Gas \u0026 Electric Co. v. Superior Court, (supra) , 13 Cal. 4th at p. 938, quoting Rest.2d Torts, § 826, com. c, p. 121.)\n\nB. Expansion and Contraction of \"Criminal Equity\"\n\nWith the legitimacy of equitable relief to control public nuisances well established, American courts began to enlarge the jurisdiction of what has been called by some \"criminal equity\" and, by others, \"government by injunction.\" (See Mack, The Revival of Criminal Equity (1903) 16 Harv. L.Rev. 389, 397; Fiss, Injunctions (1972) p. 580.) The high-water mark of this trend may have been reached in In re Debs (1895) 158 U.S. 564 [15 S. Ct. 900, 39 L. Ed. 1092], where a strike by employees at the Pullman car works in Chicago paralyzed much of the nation's rail transportation and, with it, national commerce. The strike was broken by the entry of a public nuisance injunction--the controversial \"Pullman injunction.\"\n\nWhatever its merit as a question of commerce clause jurisprudence (see 8 Fiss, History of the Supreme Court of the United States: Troubled Beginnings of the Modern State, 1888-1910 (1993) pp. 58-72), and whatever its place in the history of American labor strife, Justice Brewer's opinion for the court in In re Debs, (supra) , 158 U.S. 564, reads like a primer on the first duty of government by consent--maintenance of the public order--and the utility of the public nuisance injunction in fulfilling that aspect of the social contract. Justice Brewer rested the power of the courts to issue such an injunction on the \"obligations which [government] is under to promote the interest of all, and to prevent the wrongdoing of one resulting in injury to the general welfare,\" a duty which the court's opinion said was \"often of itself sufficient to give [the government] standing in court.\" ( Id. at p. 584 [15 S. Ct. at p. 906].)\n\nAn end to this expansive trend, at least as it was reflected in the jurisprudence of this court, came with Chief Justice Gibson's opinion in People v. Lim (1941) 18 Cal. 2d 872 [118 P.2d 472]. Although we upheld the complaint as sufficient, our opinion in People v. Lim, (supra) , 18 Cal. 2d 872, articulated an important limitation on the scope of the government's power to exploit the public nuisance injunction as an adjunct of general legal policy. \"he tendency to utilize the equity injunction as a means of enforcing public policy is a relatively recent development in the law,\" the Chief Justice wrote. ( Id. at p. 877.) \"This development has resulted in a continuous expansion of the field of public nuisances in which equitable relief is available at the request of the state.\" (Ibid.)\n\nAfter identifying a division among the authorities \"as to whether the expansion of the field of public nuisances in which equity will grant injunctions must be accomplished by an act of the legislature,\" the Lim court came down firmly on the side of legislative supremacy. ( People v. Lim, (supra) , 18 Cal. 2d at p. 878.) \"The courts of this state,\" we wrote, \"have refused to sanction the granting of injunctions on behalf of the state merely by a judicial extension of the definition of 'public nuisance.' . . . [They have] refused to grant injunctions on behalf of the state except where the objectionable activity can be brought within the terms of the statutory definition of public nuisance.\" ( Id. at pp. 878-879, italics added.)\n\nReflected in the light of our holding in People v. Lim, (supra) , 18 Cal. 2d 872, two features of California's public nuisance scheme stand out. First, subject to overriding constitutional limitations, the ultimate legal authority to declare a given act or condition a public nuisance rests with the Legislature; the courts lack power to extend the definition of the wrong or to grant equitable relief against conduct not reasonably within the ambit of the statutory definition of a public nuisance. This lawmaking supremacy serves as a brake on any tendency in the courts to enjoin conduct and punish it with the contempt power under a standardless notion of what constitutes a \"public nuisance.\" (See, e.g., People v. Seccombe (1930) 103 Cal. App. 306, 310 [284 P. 725] [Although defendant \"follow[ed] the despicable calling of usurer\" and had twice been convicted under the criminal statute, his conduct was not a public nuisance under the provisions of Civil Code section 3479 and was not enjoinable].)\n\nSecond, our opinion in People v. Lim, (supra) , 18 Cal. 2d 872, affirms the equal dignity, at least as far as the protection of equity is concerned, of private, property-based interests and those values that are in essence collective, arising out of a shared ideal of community life and the minimum conditions for a civilized society. \"Courts have held that public and social interests, as well as the rights of property,\" Chief Justice Gibson wrote, \"are entitled to the protection of equity.\" ( Id. at p. 877.) In a sense that cannot easily be dismissed, the availability of equitable relief to counter public nuisances is an expression of \" 'the interest of the public in the quality of life and the total community environment.' \" (People ex rel . Busch v. Projection Room Theater, (supra) , 17 Cal. 3d at p. 52.)\n\nC. The Relation Between Crimes and Public Nuisances\n\nAs Justice Brewer noted in the Debs case: \"A chancellor has no criminal jurisdiction. Something more than the threatened commission of an offense against the laws of the land is necessary to call into exercise the injunctive powers of the court. There must be some interference, actual or threatened, with property or rights . . . but when such interferences appear the jurisdiction of a court of equity arises, and is not destroyed by the fact that they are accompanied by or are themselves violations of the criminal law. . . .\" (In re Debs, (supra) , 158 U.S. at p. 593 [15 S. Ct. at pp. 909-910].) We made the same point in People v. Lim, (supra) , 18 Cal. 2d 872, 879, quoting a West Virginia case: \"We think the proper rule, therefore, and the one to which this state is committed is expressed in the following language from State v. Ehrlick [, (supra) , 64 S.E. 935, 939]: 'It is also competent for the Legislature . . . to declare any act criminal and make the repetition or continuance thereof a public nuisance . . . or to vest in courts of equity the power to abate them by injunction . . . .' \"\n\nIn the Ehrlick case itself, the West Virginia high court wrote that \"the Attorney General may proceed in equity on behalf of the public to abate the nuisance, if it be one. Whether it be a criminal nuisance or not is wholly immaterial. If it is indictable as a crime, it does not bar the remedy in equity, because the citizen and the general public have an immediate right to the enjoyment of the thing interfered with. A criminal prosecution is inadequate in such case, because it does not prevent the doing of the unlawful act. It may ultimately correct the wrong, but, while the process of correction is going on, the public is deprived of an important and valuable right, wherefore the injury is irreparable. In such cases it is not the criminality of the act that gives jurisdiction in equity, but the deprivation of personal and property rights interfered with, injured, destroyed, or taken away by the unlawful act.\" ( State v. Ehrlick, (supra) , 64 S.E. 935, 939; see also People v. Seccombe, (supra) , 103 Cal. App. 306, 314 [relying on State v. Ehrlick, (supra) , 64 S.E. 935, 939]; Weis v. Superior Court (1916) 30 Cal. App. 730, 732 [159 P. 464]; People v. Steele (1935) 4 Cal. App. 2d 206, 208 [40 P.2d 959]; Commonwealth v. McGovern (1903) 116 Ky. 212 [75 S.W. 261, 264]; Nathan H. Schur, Inc. v. City of Santa Monica (1956) 47 Cal. 2d 11 [300 P.2d 831] (semble); Armory Park v. Episcopal Community Services (1985) 148 Ariz. 1 [712 P.2d 914, 923] [\"We hold, therefore, that conduct which unreasonably . . . interferes with the public health, safety, peace, comfort or convenience is a public nuisance . . . even if that conduct is not specifically prohibited by the criminal law.\"]; cf. Rest.2d Torts, § 821B, com. d, p. 89 [\"This [statement, i.e., that 'in order to be treated as a public nuisance, conduct must have been already proscribed by the state as criminal'] is too restrictive . . . . here is clear recognition that a defendant need not be subject to criminal responsibility.\"].)\n\nThe Court of Appeal was thus partly accurate in reasoning that \"a public nuisance is always a criminal offense,\" for indeed it is. (See Pen. Code, § 372 [maintenance of a public nuisance is a misdemeanor].) It is the corollary to that proposition--that the superior court's injunction was valid only to the extent that it enjoined conduct that is independently proscribed by the Penal Code--that is flawed. Acts or conduct which qualify as public nuisances are enjoinable as civil wrongs or prosecutable as criminal misdemeanors, a characteristic that derives not from their status as independent crimes, but from their inherent tendency to injure or interfere with the community's exercise and enjoyment of rights common to the public. It is precisely this recognition of--and willingness to vindicate--the value of community and the collective interests it furthers, rather than to punish criminal acts, that lies at the heart of the public nuisance as an equitable doctrine. We will return to this notion of the community and its collective values as the touchstone of the public nuisance doctrine later, when we assess the sufficiency of the superior court's interlocutory decree in light of the requirements laid down in People v. Lim, (supra) , 18 Cal. 2d 872. Before doing so, however, we first consider defendants' challenges to the constitutionality of the preliminary injunction, challenges that the Court of Appeal found persuasive.\n\nII. DEFENDANTS' CONSTITUTIONAL CHALLENGES TO PROVISIONS (A) AND (K) OF THE PRELIMINARY INJUNCTION\n\nA. Standard of Review\n\nAt this initial stage in the proceeding, the scope of our inquiry is narrow. We review an order granting a preliminary injunction under an abuse of discretion standard. ( King v. Meese (1987) 43 Cal. 3d 1217, 1227-1228 [240 Cal. Rptr. 829, 743 P.2d 889]; Cohen v. Board of Supervisors (1985) 40 Cal. 3d 277, 286 [219 Cal. Rptr. 467, 707 P.2d 840].) Review is confined, in other words, to a consideration whether the trial court abused its discretion in \" 'evaluat[ing] two interrelated factors when deciding whether or not to issue a preliminary injunction. The first is the likelihood that the plaintiff will prevail on the merits at trial. The second is the interim harm that the plaintiff is likely to sustain if the injunction were denied as compared to the harm the defendant is likely to suffer if the preliminary injunction were issued.' \" ( Cohen v. Board of Supervisors, (supra) , 40 Cal. 3d at p. 286.) And although we will not ordinarily disturb the trial court's ruling absent a showing of abuse, an order granting or denying interlocutory relief reflects nothing more than the superior court's evaluation of the controversy on the record before it at the time of its ruling; it is not an adjudication of the ultimate merits of the dispute. (Ibid.; see also Planned Parenthood Shasta-Diablo, Inc. v. Williams (1994) 7 Cal. 4th 860, 879, fn. 10 [30 Cal. Rptr. 2d 629, 873 P.2d 1224]; Continental Baking Co. v. Katz (1968) 68 Cal. 2d 512, 527 [67 Cal. Rptr. 761, 439 P.2d 889].)\n\nB. First Amendment Challenges\n\n1. Associational Interests\n\nThe Court of Appeal held that paragraph (a) of the preliminary injunction, enjoining defendants from \" Standing, sitting, walking, driving, gathering or appearing anywhere in public view with any other defendant . . . or with any other known 'VST' (Varrio Sureno Town or Varrio Sureno Treces) or 'VSL' (Varrio Sureno Locos) member \" (italics added) was invalid on associational grounds; that is, the provision infringed defendants' right to associate with fellow gang members, a right protected by the First Amendment. We disagree.\n\nIn a series of opinions, the United States Supreme Court has made it clear that, although the Constitution recognizes and shields from government intrusion a limited right of association, it does not recognize \"a generalized right of 'social association.' \" ( Dallas v. Stanglin (1989) 490 U.S. 19, 25 [109 S. Ct. 1591, 1594, 104 L. Ed. 2d 18].) As we explain, neither does the First Amendment protect the collective public activities of the gang members within the four-block precinct of Rocksprings, activities directed in the main at trafficking in illegal drugs and securing control of the community through systematic acts of intimidation and violence.\n\nThe high court has identified two kinds of associations entitled to First Amendment protection--those with an \"intrinsic\" or \"intimate\" value, and those that are \"instrumental\" to forms of religious and political expression and activity. Of the first, the court has said that it is \"central to any concept of liberty\" and is exemplified by personal affiliations that \"attend the creation and sustenance of a family--marriage . . .; the raising and education of children [citation]; and cohabitation with one's relatives.\" ( Roberts v. United States Jaycees (1984) 468 U.S. 609, 619 [104 S. Ct. 3244, 3250, 82 L. Ed. 2d 462].) Such affiliations, the court has remarked, \"involve deep attachments and commitments to the necessarily few other individuals with whom one shares not only a special community of thoughts, experiences, and beliefs but also distinctively personal aspects of one's life. Among other things . . . they are distinguished by such attributes as relative smallness, a high degree of selectivity in decisions to begin and maintain the affiliation, and seclusion from others in critical aspects of the relationship.\" ( Id. at p. 620 [104 S. Ct. at p. 3250].)\n\nThe second kind of association that merits First Amendment protection is composed of groups whose members join together for the purpose of pursuing \"a wide variety of political, social, economic, educational, religious, and cultural ends.\" ( Roberts v. United States Jaycees, (supra) , 468 U.S. at p. 622 [104 S. Ct. at p. 3252].) This instrumental right of protected association is directly related to the \"individual's freedom to speak, to worship, and to petition the government for the redress of grievances\" because without it these liberties themselves could scarcely exist, much less thrive. (Ibid.)\n\nIt is evident that whatever else it may be in other contexts, the street gang's conduct in Rocksprings at issue in this case fails to qualify as either of the two protected forms of association. Manifestly, in its activities within the four-block area of Rocksprings, the gang is not an association of individuals formed \" for the purpose of engaging in protected speech or religious activities.\" ( Bd. of Dirs. of Rotary Int'l v. Rotary Club (1987) 481 U.S. 537, 544 [107 S. Ct. 1940, 1945, 95 L. Ed. 2d 74], italics added.) Without minimizing the value of the gang to its members as a loosely structured, elective form of social association, that characteristic is in itself insufficient to command constitutional protection, at least within the circumscribed area of Rocksprings. As the court pointed out in Dallas v. Stanglin, (supra) , 490 U.S. at page 25 [109 S. Ct. at page 1594], \"[i]t is possible to find some kernel of expression in almost every activity a person undertakes--for example, walking down the street or meeting one's friends at a shopping mall--but such a kernel is not sufficient to bring the activity within the protection of the First Amendment.\"\n\nDefendants contend that if there is any doubt that association with other gang members \"is afforded constitutional protection, the Supreme Court put the notion to rest in Dawson v. Delaware (1992) 503 U.S. 159 . . . where it held that association with a prison gang, the Aryan Brotherhood, is constitutionally protected.\" This argument misreads the court's opinion in Dawson. There, the court reversed a penalty jury's capital verdict on the ground that an abbreviated stipulation of the parties--reciting that the \" 'Aryan Brotherhood refers to a white racist prison gang' \" which originated in California in the 1960's \" 'and now exist[s] in many state prisons including Delaware' \" --lacked any relevance to the capital sentencing issue before the jury. ( Dawson v. Delaware (1992) 503 U.S. 159, 162, 165 [112 S. Ct. 1093, 1096, 1097-1098, 117 L. Ed. 2d 309].) Far from holding that \"association with a prison gang . . . is constitutionally protected,\" the vice condemned by the court in Dawson was the very \"narrowness of the stipulation [that] left the Aryan Brotherhood evidence totally without relevance to Dawson's sentencing proceeding.\" ( Id. at p. 165.)\n\nNor do the circumstances in this case implicate the other associational form worthy of First Amendment protection--personal affiliations whose characteristics include \"relative smallness, a high degree of selectivity in decisions to begin and maintain the affiliation, and seclusion from others in critical aspects of the relationship.\" ( Roberts v. United States Jaycees, (supra) , 468 U.S. at p. 620 [104 S. Ct. at p. 3250].) We may assume the members of defendants' gang share common values and that group membership and the affiliations it engenders can be a source of personal \"enrichment\" to some or all of them. Defendants' organization may thus share one or two of the characteristics that define intrinsically valuable and constitutionally protected associations, lying somewhere this side of the anonymity of the Jaycees or a teenage dance hall. The constitutionally significant factors on which associational protection depends, however, are not ones to be mechanically applied and ticked off. At bottom, protected rights of association in the intimate sense are those existing along a narrow band of affiliations that permit deep and enduring personal bonds to flourish, inculcating and nourishing civilization's fundamental values, against which even the state is powerless to intrude.\n\nFreedom of association, in the sense protected by the First Amendment, \"does not extend to joining with others for the purpose of depriving third parties of their lawful rights.\" ( Madsen v. Women's Health Center, Inc. (1994) 512 U.S. 753, 776 [114 S. Ct. 2516, 2530, 129 L. Ed. 2d 593] (hereafter Madsen).) We do not, in short, believe that the activities of the gang and its members in Rocksprings at issue here are either \"private\" or \"intimate\" as constitutionally defined; the fact that defendants may \"exercise some discrimination in choosing associates [by a] selective process of inclusion and exclusion\" ( New York State Club Assn. v. New York City (1988) 487 U.S. 1, 13 [108 S. Ct. 2225, 2234, 101 L. Ed. 2d 1], italics added) does not mean that the association or its activities in Rocksprings is one that commands protection under the First Amendment.\n\n2. \" Overbreadth\" Challenge\n\nThe Court of Appeal also invalidated paragraph (a) of the trial court's preliminary decree on the ground that these provisions were \"overbroad,\" as that term has come to be understood and applied in the context of First Amendment litigation. It acknowledged that the reach of the overbreadth doctrine has been cabined in a series of high court opinions, e.g., New York State Club Assn. v. New York City, (supra) , 487 U.S. at page 11 [108 S. Ct. at page 2233] (doctrine is a narrow exception and requires finding of \" 'a realistic danger that the statute itself will significantly compromise recognized First Amendment protections of parties not before the Court' \"); Broadrick v. Oklahoma (1973) 413 U.S. 601, 613 [93 S. Ct. 2908, 2916, 37 L. Ed. 2d 830] (overbreadth doctrine is \"strong medicine\" that is used \"sparingly and only as a last resort\"); and Wisconsin v. Mitchell (1993) 508 U.S. 476, 487-488 [113 S. Ct. 2194, 2201, 124 L. Ed. 2d 436]. However, it did not consider one crucial fact: No one, apart from defendants themselves, is or can be subject to the prophylactic relief granted by the trial court.\n\nAs we explain, the foundation of the overbreadth doctrine is the inhibitory effect a contested statute may exert on the freedom of those who, although possibly subject to its reach, are not before the court. It is out of a generous concern for a statute's effects on the activities of such third persons that the high court has permitted facial challenges on behalf of those who are not parties to the litigation. Thus, even litigants whose activities are not constrained by the statute at issue and who might, as the court wrote of the permit requirement in Thornhill v. Alabama (1940) 310 U.S. 88, 97 [60 S. Ct. 736, 742, 84 L. Ed. 1093], \"have had a license for the asking may . . . call into question the whole scheme of licensing when . . . prosecuted for failure to procure it.\"\n\nDefendants do not attack the public nuisance statute itself, claiming that it suffers from the vice of overbreadth; instead, they attack the terms of the interlocutory decree as being unconstitutionally overbroad. The source of the high court's concern in the overbreadth cases, however, and the foundation of the doctrine itself, is the perceived danger to the constitutionally protected interests of those who, because they are not before the court, lack a judicial forum in which to litigate claims that a statute \"sweeps within its ambit other activities that in ordinary circumstances constitute an exercise of freedom of speech\" ( Thornhill v. Alabama, (supra) , 310 U.S. at p. 97 [60 S. Ct. at p. 742]), and thus \"may inhibit the constitutionally protected speech of [such] third parties\" ( City Council v. Taxpayers for Vincent (1984) 466 U.S. 789, 798 [104 S. Ct. 2118, 2125, 80 L. Ed. 2d 772]).\n\nIt is the absent members of this unrepresented class who, \"sensitive to the perils posed by . . . indefinite language, avoid the risk . . . by restricting their conduct to that which is unquestionably safe\" ( Baggett v. Bullitt (1964) 377 U.S. 360, 372 [84 S. Ct. 1316, 1323, 12 L. Ed. 2d 377]) for whom the overbreadth doctrine was fashioned. (See also Broadrick v. Oklahoma, (supra) , 413 U.S. at p. 612 [93 S. Ct. at p. 2916] [\"Litigants, therefore, are permitted to challenge a statute not because their own rights of free expression are violated, but because of a judicial prediction or assumption that the statute's very existence may cause others not before the court to refrain from constitutionally protected speech or expression.\"]; In re M.S. (1995) 10 Cal. 4th 698, 709 [42 Cal. Rptr. 2d 355, 896 P.2d 1365] [\"litigants may challenge a statute not because their own rights of free expression are violated, but because the very existence of an overbroad statute may cause others not before the court to refrain from constitutionally protected expression\"].)\n\nThe high court recently identified a related and constitutionally significant difference between injunctions and statutes in the context of protected speech claims. In Madsen, (supra) , 512 U.S. 753, the court pointed out that the narrow and particularized focus inherent in the nature of the injunction as an equitable remedy is also significant in evaluating the contention that features of a given decree suffer from constitutional overbreadth. Like the injunction in Madsen, the trial court's interlocutory decree here does not embody the broad and abstract commands of a statute. Instead, it is the product of a concrete judicial proceeding prompted by particular events--inimical to the well-being of the residents of the community of Rocksprings--that led to a specific request by the City for preventive relief.\n\nAs with any injunction, the preliminary decree here is addressed to identifiable parties and to specific circumstances; the enjoined acts are particularly described in the trial court's order. Unlike the pervasive \"chill\" of an abstract statutory command that may broadly affect the conduct of an absent class and induce self-censorship, the decree here did not issue until after these defendants had had their day in court, a procedure that assures \" 'a prompt and carefully circumscribed determination of the issue.' \" ( Kingsley Books, Inc. v. Brown (1957) 354 U.S. 436, 442 [77 S. Ct. 1325, 1328, 1 L. Ed. 2d 1469].) In short, as one commentator has pointed out, \"An injunction may be more effective at stopping the activity at which it is aimed, but it is also more narrowly confined. There is less risk of deterring activities beyond the adjudicated target of suppression--activities plainly outside the injunctive ban but arguably within the necessarily more general prohibition of a penal law.\" (Jeffries, Rethinking Prior Restraint (1983) 92 Yale L.Rev. 409, 429.)\n\nManifestly, the paradigm for an overbreadth challenge is not present in this case. Here there is no possibility that the concerns motivating the high court in its classic overbreadth opinions--the \"chilling effect\" of abstract, broadly framed statutes on the conduct of those not before the court (see, e.g., Dombrowski v. Pfister (1965) 380 U.S. 479, 487 [85 S. Ct. 1116, 1121, 14 L. Ed. 2d 22])--could place at risk any protected conduct other than that of defendants themselves. The only individuals subject to the trial court's interlocutory decree in this case, including those features contested as \"overbroad,\" are named parties to this action; their activities allegedly protected by the First Amendment have been and are being aggressively litigated. There is accordingly no basis, legal or factual, for the professed concern that protected speech or communicative conduct by anyone other than defendants might be endangered by the terms of the trial court's injunction. In that sense, defendants' claim of overbreadth, made with respect to paragraph (a) of the preliminary injunction, is not cognizable.\n\nOur Conclusion with respect to defendants' \"overbreadth\" claim does not mean they may not be heard to complain that the provisions of the preliminary injunction--as applied to them and their conduct in Rocksprings--are broader than constitutionally sustainable. Rather, in this case that contention falls under the standard formulated by the court in Madsen, (supra) , 512 U.S. 753--the requirement that the superior court's decree burden no more of defendants' speech than necessary to serve the significant governmental interest at stake. We will consider that distinct claim separately, when we come to evaluate the sufficiency of the injunction under the standard announced by the court in Madsen. (See, post, at pp. 1119-1122.)\n\nC. Defendants' Fifth Amendment \"Void-for-vagueness\" Challenge to Provisions (a) and (k)\n\nWe consider next the claim of defendants that provisions (a) and (k) of the interlocutory injunction are \"void for vagueness.\" (See, e.g., Note , The Void-for-Vagueness Doctrine In the Supreme Court (1960) 109 U. Pa. L.Rev. 67.) Here again, the Court of Appeal was persuaded of the merits of defendants' constitutional challenge to the preliminary decree, ruling that provisions (a) and (k) were unconstitutionally vague and thus unenforceable. Although, as we pointed out in Tobe v. City of Santa Ana (1995) 9 Cal. 4th 1069, 1109 [40 Cal. Rptr. 2d 402, 892 P.2d 1145], \"[t]he concepts of vagueness and overbreadth are related,\" there are important differences. \"A clear and precise enactment may nevertheless be 'overbroad' if in its reach it prohibits constitutionally protected conduct.\" ( Grayned v. City of Rockford (1972) 408 U.S. 104, 114 [92 S. Ct. 2294, 2302, 33 L. Ed. 2d 222], fn. omitted.)\n\nUnlike the doctrine of overbreadth, which focuses on the impact of a statute on the conduct of persons not before the court, the claim that a law is unconstitutionally vague is not dependent on the interests of absent third parties. Instead, the underlying concern is the core due process requirement of adequate notice. \"No one may be required at peril of life, liberty or property to speculate as to the meaning of penal statutes. All are entitled to be informed as to what the State commands or forbids.\" ( Lanzetta v. New Jersey (1939) 306 U.S. 451, 453 [59 S. Ct. 618, 619, 83 L. Ed. 888], fn. omitted; see also People v. Heitzman (1994) 9 Cal. 4th 189, 199-200 [37 Cal. Rptr. 2d 236, 886 P.2d 1229].) The operative corollary is that \"a statute which either forbids or requires the doing of an act in terms so vague that men of common intelligence must necessarily guess at its meaning and differ as to its application, violates the first essential of due process of law.\" ( Connally v. General Construction Co. (1926) 269 U.S. 385, 391 [46 S. Ct. 126, 127, 70 L. Ed. 322].)\n\nIn its more recent applications of the vagueness doctrine, the high court has also expressed a concern for the potential for arbitrary and discriminatory enforcement inherent in vague statutes. (See, e.g., Smith v. Goguen (1974) 415 U.S. 566, 574 [94 S. Ct. 1242, 1248, 39 L. Ed. 2d 605] [\"We recognize that in a noncommercial context behavior as a general rule is not mapped out in advance on the basis of statutory language. In such cases, perhaps the most meaningful aspect of the vagueness doctrine is not actual notice, but the other principal element of the doctrine--the requirement that a legislature establish minimal guidelines to govern law enforcement.\" (Fn. omitted.)]; Kolender v. Lawson (1983) 461 U.S. 352, 357 [103 S. Ct. 1855, 1858, 75 L. Ed. 2d 903] [doctrine seeks to avoid \"arbitrary and discriminatory enforcement.\"].) Thus, a law that is \"void for vagueness\" not only fails to provide adequate notice to those who must observe its strictures, but also \"impermissibly delegates basic policy matters to policemen, Judges, and juries for resolution on an ad hoc and subjective basis, with the attendant dangers of arbitrary and discriminatory application.\" ( Grayned v. City of Rockford, (supra) , 408 U.S at pp. 108-109 [92 S. Ct. at pp. 2298-2299], fn. omitted.)\n\nThe scope of permissible challenges to a law based on grounds of vagueness differs in another important respect from challenges based on overbreadth. While a claim of overbreadth may succeed if it is shown that the law at issue is \"substantially overbroad,\" that is, affects more than a marginal group of those potentially subject to its sweep ( Broadrick v. Oklahoma, (supra) , 413 U.S. at p. 615 [93 S. Ct. at p. 2918]), a claim that a law is unconstitutionally vague can succeed only where the litigant demonstrates, not that it affects a substantial number of others, but that the law is vague as to her or \"impermissibly vague in all of its applications.\" ( Hoffman Estates v. Flipside, Hoffman Estates (1982) 455 U.S. 489, 497-498 [102 S. Ct. 1186, 1193, 71 L. Ed. 2d 362], italics added; see also Parker v. Levy (1974) 417 U.S. 733, 755-757 [94 S. Ct. 2547, 2561-2562, 41 L. Ed. 2d 439]; Tribe, American Constitutional Law (2d ed. 1988) § 12-32, p. 1036.)\n\nWe begin our consideration of defendants' vagueness claims with a pair of principles endorsed by the United States Supreme Court as reliable guides for applying the doctrine in particular cases. The first principle is derived from the concrete necessity that abstract legal commands must be applied in a specific context. A contextual application of otherwise unqualified legal language may supply the clue to a law's meaning, giving facially standardless language a constitutionally sufficient concreteness. Indeed, in evaluating challenges based on claims of vagueness, the court has said \"[t]he particular context is all important.\" (Communications Assn. v. Douds (1950) 339 U.S. 382, 412 [70 S. Ct. 674, 691, 94 L. Ed. 925].) We recently made the same point in Tobe v. City of Santa Ana, (supra) , 9 Cal. 4th at page 1107, when we said the \"Court of Appeal erred in holding that the ordinance is unconstitutionally vague. The terms which the Court of Appeal considered vague are not so when the purpose clause of the ordinance is considered and the terms are read in that context as they should be.\" (Italics added.) This observation is particularly apropos here.\n\nThe second guiding principle is the notion of \" reasonable specificity\" ( Coates v. City of Cincinnati (1971) 402 U.S. 611, 614 [91 S. Ct. 1686, 1688, 29 L. Ed. 2d 214], italics added) or \" ' \"[ r ] easonable certainty.\" ' \" ( People v. Victor (1965) 62 Cal. 2d 280, 300 [42 Cal. Rptr. 199, 398 P.2d 391], italics added; see also In re Marriage of Walton (1972) 28 Cal. App. 3d 108, 116 [104 Cal. Rptr. 472] [statute will not be held void for vagueness \"if any reasonable and practical construction can be given its language or if its terms may be made reasonably certain by reference to other definable sources\"].) As the high court has pointed out, \"few words possess the precision of mathematical symbols, most statutes must deal with untold and unforeseen variations in factual situations, and the practical necessities of discharging the business of government inevitably limit the specificity with which legislators can spell out prohibitions. Consequently, no more than a reasonable degree of certainty can be demanded. Nor is it unfair to require that one who deliberately goes perilously close to an area of proscribed conduct shall take the risk that he may cross the line.\" ( Boyce Motor Lines v. United States (1952) 342 U.S. 337, 340 [72 S. Ct. 329, 330-331, 96 L. Ed. 367].) In short, \"[c]ondemned to the use of words, we can never expect mathematical certainty from our language .\" ( Grayned v. City of Rockford, (supra) , 408 U.S. at p. 110 [92 S. Ct. at p. 2300], fn. omitted.)\n\nIn the Court of Appeal's view, provision (a)'s prohibition against associating with \"any other known 'VST' . . . or 'VSL' . . . member\" might apply to a circumstance in which a defendant was engaged in one of the prohibited activities with someone known to the police but not known to him to be a gang member. According to the Court of Appeal, such indefiniteness presented \"a classic case of vagueness.\" We agree that in such a hypothetical case, the City would have to establish a defendant's own knowledge of his associate's gang membership to meet its burden of proving conduct in violation of the injunction. Far from being a \"classic\" instance of constitutional vagueness, however, we think the element of knowledge is fairly implied in the decree. To the extent that it might not be, we are confident that the trial court will, as the Court of Appeal did in People v. Garcia (1993) 19 Cal. App. 4th 97, 103 [23 Cal. Rptr. 2d 340], impose such a limiting construction on paragraph (a) by inserting a knowledge requirement should an attempt be made to enforce that paragraph of the injunction. With that minor emendation, the text of provision (a) passes scrutiny under the vagueness doctrine.\n\nThe Court of Appeal found paragraph (k), enjoining defendants from \"confronting, intimidating, annoying, harassing, threatening, challenging, provoking, assaulting and/or battering any residents or patrons, or visitors to 'Rocksprings' . . . known to have complained about gang activities,\" impermissibly vague in two respects. First, like paragraph (a), it speaks of persons \"known to have complained about gang activities,\" without indicating how or even whether a defendant is to be charged with this knowledge. The Discussion with respect to the knowledge requirement of provision (a) of the decree applies equally to this provision and, so construed, it too passes muster.\n\nSecond, according to the Court of Appeal, provision (k) fails to define sufficiently the words \"confront,\" \"annoy,\" \"provoke,\" \"challenge,\" or \"harass\"; it thus fails to provide a standard of conduct for those whose activities are proscribed. Yet similar words were upheld against claims of vagueness by the Supreme Court in Madsen, (supra) , 512 U.S. 753. There, the high court affirmed injunctive relief prohibiting petitioners from engaging in similar--if not more broadly phrased--conduct: \" 'intimidating, harassing, touching, pushing, shoving, crowding or assaulting persons entering or leaving.' \" ( Id. at pp. 760-761 [114 S. Ct. at p. 2522].) We find nothing in the context of this case, factually similar in many respects to the situation before the court in Madsen, that makes the same words, sufficiently definite there, somehow constitutionally infirm here.\n\nHere again, \"[t]he particular context is all important.\" (Communications Assn. v. Douds, (supra) , 339 U.S. 382, 412 [ 70 S. Ct. 674, 691].) The words of provision (k) which the Court of Appeal considered irretrievably vague are simply not, at least in the constitutional sense, when the objectives of the injunction are considered and the words of the provision are read in context. Finally, the declarations filed by the City in support of preliminary relief leave little doubt as to what kind of conduct the decree seeks to enjoin. One Rocksprings resident recounted an incident in which gang members had threatened to cut out the tongue of her nine-year-old daughter if she talked to the police; she stated that other residents had been threatened as well. Another resident reported her neighbor's property had been vandalized and the resident threatened after complaining to police that gang members had urinated in her garage. A police officer declared Rocksprings residents had told him gang members confront and threaten them with physical violence when asked to leave residential property. Others refused to furnish declarations, fearing for their lives if any gang member should discover their identities. We conclude neither of the two provisions should have been invalidated by the Court of Appeal on vagueness grounds.\n\nIII. CLAIM THAT THE STEP ACT IS THE EXCLUSIVE MEANS OF ABATING GANG BEHAVIOR AS A PUBLIC NUISANCE\n\nDefendants contend that the STEP Act (Pen. Code, § 186.20 et seq.) is the exclusive means of enjoining criminal street gangs and preempts use of the general public nuisance statutes. We disagree. By express provision, the act is not the exclusive remedy for abating gang activity constituting a public nuisance. Under the STEP Act, a building or place used by members of a criminal street gang for specified illegal activities is declared a nuisance per se: \"Every building or place used by members of a criminal street gang for the purpose of the commission of [specified] offenses . . . and every building or place wherein or upon which that criminal conduct by gang members takes place, is a nuisance which shall be enjoined, abated, and prevented, and for which damages may be recovered, whether it is a public or private nuisance.\" (Pen. Code, § 186.22a, subd. (a), italics added.) The act goes on to provide that \"[n]othing in this chapter shall preclude any aggrieved person from seeking any other remedy provided by law.\" (Id., subd. (d).) It thus plainly contemplates remedies in addition to the act to abate criminal gang activities, including those made available by the general public nuisance statutes.\n\nIn this case, the City expressly sought equitable relief, not under the STEP Act, but under the general public nuisance statutes. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Accordingly, we need not determine whether some or all of the conduct enjoined would also fall within the scope of the act or whether any of the defendants could be enjoined under its provisions.\n\nIV. EVALUATING THE LIMITS OF THE PRELIMINARY INJUNCTION\n\nA. Substantive Limits\n\nHaving concluded that provisions (a) and (k) of the preliminary injunction are not unconstitutionally vague or overbroad and do not infringe defendants' constitutionally protected associational interests, we must complete our inquiry by considering the limitations on the scope of the interlocutory decree as a matter of both public nuisance and constitutional law. We must ask, in other words, two questions: First, whether the activity enjoined under these two provisions reasonably falls within the statutory definition of a public nuisance as construed in People v. Lim, (supra) , 18 Cal. 2d 872, 878, and second, whether the two provisions comply with the constitutional standard announced by the Supreme Court in Madsen, (supra) , 512 U.S. 753, that is, whether they \"burden no more speech than necessary to serve a significant governmental interest.\" ( Id. at p. 765 [114 S. Ct. at p. 2525].)\n\nThat the conduct enjoined by the trial court meets the statutory definition of a public nuisance is clear from the account of conditions in Rocksprings recited at the outset of this opinion. To constitute a public nuisance under our Civil Code, conduct must be \"injurious to health, . . . indecent or offensive to the senses, . . . an obstruction to the free use of property, so as to interfere with the comfortable enjoyment of life or property, or unlawfully obstruct[] free passage or use, in the customary manner, of any . . . public park, square, street, or highway.\" (Civ. Code, § 3479.) In addition, the conduct must affect \"an entire community or neighborhood, or any considerable number of persons.\" (Civ. Code, § 3480.)\n\nThe many declarations filed with the superior court by the City in support of its request for injunctive relief meet these criteria. Gang members not only routinely obstruct Rocksprings residents' use of their own propertyby such activities as dealing drugs from apartment houses, lawns, carports, and even residents' automobiles--but habitually obstruct the \"free passage or use, in the customary manner,\" of the public streets of Rocksprings. It is likewise clear from this record that the conduct of gang members qualifies as \"indecent or offensive to the senses\" OF REASONABLE AREA RESIDENTS: The hooligan-like atmosphere that prevails night and day in Rockspringsthe drinking, consumption of illegal drugs, loud talk, loud music, vulgarity, profanity, brutality, fistfights and gunfire--easily meet the statutory standard. Nor is it difficult to see how threats of violence to individual residents and families in Rocksprings, murder, attempted murder, drive-by shootings, assault and battery, vandalism, arson and associated crimes obstruct the free use of property and interfere with the enjoyment of life of an entire community.\n\nDo provisions (a) and (k) of the superior court's preliminary injunction meet the constitutional test formulated by the Supreme Court in Madsen, (supra) , 512 U.S. 753, 765 [114 S. Ct. 2516, 2525] by \"burden[ing] no more speech than necessary to serve\" an important governmental interest? We conclude both provisions satisfy the constitutional test. As noted, provision (a) effectively forbids gang members from engaging in any form of social intercourse with anyone known to them to be a gang member \"anywhere in public view\" within the four-block area of Rocksprings. The provision's ban on all forms of association--\"standing, sitting, walking, driving, gathering or appearing anywhere in public view\"--does not violate the Madsen standard merely because of its breadth. The provision seeks to ensure that, within the circumscribed area of Rocksprings, gang members have no opportunity to combine.\n\nIt is the threat of collective conduct by gang members loitering in a specific and narrowly described neighborhood that the provision is sensibly intended to forestall. Given that overriding purpose, the prohibitions enumerated in provision (a) are not easily divisible. Permitting two or more gang members to drive together but not sit, or to stand together but not walk, would obviously defeat the core purpose behind the proscription. Moreover, given the factual showing made by the City in support of preliminary relief--the carnival-like atmosphere of collective mayhem described above (see, ante, at pp. 1100-1101, 1120)--we cannot say that the ban on any association between gang members within the neighborhood goes beyond what is required to abate the nuisance.\n\nThe effect of provision (a)'s ban on defendants' protected speech is minimal. To Judge from the evidence placed before the superior court, the gangs appear to have had no constitutionally protected or even lawful goals within the limited territory of Rocksprings. So far as the record before the trial court shows, the gangs and their members engaged in no expressive or speech-related activities which were not either criminally or civilly unlawful or inextricably intertwined with unlawful conduct. According to the declaration of Officer Mikael Niehoff, an eight-year veteran of the San Jose Police Department: \"Illegal drug dealing by Sureno gang members, including VSL/VST, is a common practice, and the gang entity provides protection to the individual members, allowing them to establish areas where they can conduct their illegal activities. The protective shield of the gang has allowed individual members to commit crimes such as narcotic trafficking that result in personal gain. These crimes are committed in association with the gang because of the protection offered to the members by virtue of their gang affiliation. In the Rocksprings area, the fact that numerous narcotics transactions occurred is a direct result of the protective shield provided by VSL/VST. Individuals who claimed membership in VSL or VST were at liberty to deal drugs in a veritable 'safe' zone.\"\n\nDoes provision (a)'s prohibition on a gang member associating with even a single fellow gang member within Rocksprings transgress the test of Madsen, (supra) , 512 U.S. 753? Could not the restriction be limited to barring associations between, say, three other gang members? Two gang members? On such a highly particular question, we are compelled to defer to the superior knowledge of the trial Judge, who is in a better position than we to determine what conditions \"on the ground\" in Rocksprings will reasonably permit. Outside the perimeter of Rocksprings, the superior court's writ does not run; gang members are subject to no special restrictions that do not affect the general population. Given the limited area within which the superior court's injunction operates, the absence of any showing of constitutionally protected activity by gang members within that area, the aggravated nature of gang misconduct, the fact that even within Rocksprings gang members may associate freely out of public view, and the kind of narrow yet irreducible arbitrariness that inheres in such line-drawing, we conclude that this aspect of provision (a) passes muster as well under the standard of Madsen, (supra) , 512 U.S. 753.\n\nWe reach a similar resolution with respect to provision (k). That provision forbids those subject to the injunction from confronting, intimidating or similarly challenging--including assaulting and battering--residents of Rocksprings, \"or any other persons\" who gang members know have complained about their conduct within the neighborhood. It has long been the rule, of course, that physical violence and the threat of violence are not constitutionally protected: \"The First Amendment does not protect violence.\" ( NAACP v. Claiborne Hardware Co. (1982) 458 U.S. 886, 916 [102 S. Ct. 3409, 3427, 73 L. Ed. 2d 1215] (hereafter Claiborne Hardware).) Because the conduct proscribed by provision (k) consists of threats of violence and violent acts themselves, it \"fall[s] outside the protection of the First Amendment because [such acts] coerce by unlawful conduct, rather than persuade by expression, and thus play no part in the 'marketplace of ideas.' As such, they are punishable because of the state's interest in protecting individuals from the fear of violence, the disruption fear engenders and the possibility the threatened violence will occur.\" (In re M.S., (supra) , 10 Cal. 4th 698, 714, original italics.) \" physical assault is not by any stretch of the imagination expressive conduct protected by the First Amendment.\" ( Wisconsin v. Mitchell, (supra) , 508 U.S. 476, 484 [113 S. Ct. 2194, 2199].) By the same token, \"utterance in a context of violence can lose its significance as an appeal to reason and become part of an instrument of force. Such utterance was not meant to be sheltered by the Constitution.\" ( Drivers Union v. Meadowmoor Co. (1941) 312 U.S. 287, 293 [61 S. Ct. 552, 555, 85 L. Ed. 836, 132 A.L.R. 1200].)\n\nB. Those Bound by the Preliminary Injunction\n\nDefendants contend that they may not be bound by the injunction except on proof that each possessed \"a specific intent to further an unlawful aim embraced by [the gang].\" The quoted language is the test formulated by the United States Supreme Court in Claiborne Hardware, (supra) , 458 U.S. at page 925 [102 S. Ct. at page 3432], as being required to sustain damages liability against individual members of a group. Claiborne Hardware is distinguishable on its facts. Defendants there were members of a local chapter of a national civil rights organization. Each was held liable in state court proceedings for business losses suffered by the plaintiff merchants over the seven-year duration of a civil rights boycott sponsored by the organization. Although the boycott was for the most part peaceable and law abiding, there were sporadic incidents of violence by some members, resulting in economic losses to the plaintiffs.\n\nVacating the state court damages award, the high court held that \"mere association with [the] group--absent a specific intent to further an unlawful aim embraced by that group--is an insufficient predicate for liability.\" (Claiborne Hardware, (supra) , 458 U.S. at pp. 925-926 [ 102 S. Ct. at p. 3432].) The state courts, the Supreme Court reasoned, had \"relied on isolated acts of violence during a limited period to uphold [plaintiffs'] recovery of all business losses sustained over a 7-year span. . . . The court's judgment 'screens reality' and cannot stand.\" ( Id. at p. 924 [102 S. Ct. at p. 3431], italics and fns. omitted.) Unlike the record in Claiborne Hardware, (supra) , 458 U.S. 886, the evidence submitted by the City in support of the preliminary injunction here presents a portrait of gang affiliated youths whose collective activities, within the four-block area of Rocksprings, create and sustain the \"urban war zone\" described at the outset of this opinion. The precedents that control the reach of injunctive relief in such circumstances are Drivers Union v. Meadowmoor Co., (supra) , 312 U.S. 287, and Madsen, (supra) , 512 U.S. 753.\n\nIn Drivers Union v. Meadowmoor Co., (supra) , 312 U.S. 287, 291 [61 S. Ct. 552, 554] (hereafter Drivers Union), the trial court issued a preliminary injunction \"restraining all union conduct, violent and peaceful,\" arising out of a labor dispute. The union protested, arguing the decree violated the First Amendment rights of its members by enjoining acts of peaceful picketing. The Illinois Supreme Court affirmed the broad scope of the interlocutory decree and directed that a permanent injunction, restraining peaceful as well as violent acts by union members, be entered as well. The United States Supreme Court upheld the injunction, framing the case as one where \"the question . . . is whether a state can choose to authorize its courts to enjoin acts of picketing in themselves peaceful when they are enmeshed with contemporaneously violent conduct which is concededly outlawed.\" ( Id. at p. 292 [61 S. Ct. at p. 554].)\n\nAs in Drivers Union, (supra) , 312 U.S. 287, here \"the injunction is confined,\" encompassing conduct occurring within a narrow, four-block residential neighborhood. As in Drivers Union, it \"deals with this narrow area precisely because the coercive conduct affected it. An injunction so adjusted to a particular situation is in accord with the settled practice of equity . . . [and] . . . must be read in the context of its circumstances.\" ( Id. at p. 298 [61 S. Ct. at p. 557].) As in Drivers Union, the high court in Madsen, (supra) , 512 U.S. 753, 759-760 [ 114 S. Ct. 2516, 2522], upheld an injunction directed against \"congregating, picketing, patrolling, demonstrating or entering\" within 36 feet of a health clinic in which therapeutic abortions were performed. That provision of the decree, along with another setting restrictions on noise, was directed not only at the anti-abortion organizations themselves, but at allied organizations and \" their officers, agents, members, employees and servants, and . . . all persons acting in concert or participation with them, or on their behalf.\" ( Id. at p. 759, fn. 1 [114 S. Ct. at p. 2521] italics added.)\n\nBoth Drivers Union, (supra) , 312 U.S. 287, and Madsen, (supra) , 512 U.S. 753, thus stand for the proposition that, in a proper case, an organization and its individual members are enjoinable without meeting the \"specific intent to further unlawful group aims\" standard applied in Claiborne Hardware, (supra) , 458 U.S. 886. Certainly that proposition comprehends paragraphs (a) and (k) of the preliminary injunction, the only two provisions now before us. For we have already concluded that the conduct proscribed by those two provisions--appearing publicly in Rocksprings with others known to a defendant to be gang members, and harassing area residents known to a defendant to have complained to public authorities about gang activities in Rocksprings--are activities integral to the public nuisance that afflicts Rocksprings and do not implicate protected First Amendment conduct. (See Claiborne Hardware, (supra) , at pp. 918-920 [102 S. Ct. at pp. 3428-3429].)\n\nThat being the case, the interim relief entered by the superior court is indistinguishable from time-honored equitable practice applicable to labor unions, abortion protesters or other identifiable groups. Because such groups can act only through the medium of their membership, \". . . it has been a common practice to make the injunction run also to classes of persons through whom the enjoined person may act, such as agents, servants, employees, aiders [and] abettors . . . .\" ( Berger v. Superior Court (1917) 175 Cal. 719, 721 [167 P. 143, 15 A.L.R. 373]; see also In re Lennon (1897) 166 U.S. 548, 554 [17 S. Ct. 658, 660, 41 L. Ed. 1110] [\"To render a person amenable to an injunction it is neither necessary that he should have been a party to the suit in which the injunction was issued, nor to have been actually served with a copy of it, so long as he appears to have had actual notice.\"]; cf. Fed. Rules Civ. Proc., rule 65(d), 28 U.S.C.S. [injunction \"is binding only upon the parties to the action, their officers, agents, servants, employees, and attorneys, and upon those persons in active concert or participation with them who receive actual notice of the order by personal service or otherwise\"].)\n\nWe see nothing in this case--where instead of naming the gang organizations themselves as parties, the City named as individual defendants all 38 gang members it was able to identify--that removes it from the usual rule applied in Berger v. Superior Court, (supra) , 175 Cal. 719, and many other cases. The City's evidence in support of preliminary equitable relief demonstrated that it was the gang itself, acting through its membership, that was responsible for creating and maintaining the public nuisance in Rocksprings. Because the City could have named the gangs themselves as defendants and proceeded against them, its decision to name individual gang members instead does not take the case out of the familiar rule that both the organization and the members through which it acts are subject to injunctive relief.\n\nFor present purposes, it is enough to observe that there was sufficient evidence before the superior court to support the Conclusions that the gang and its members present in Rocksprings were responsible for the public nuisance, that each of the individual defendants either admitted gang membership or was identified as a gang member, and that each was observed by police officials in the Rocksprings neighborhood. Although all but three of the eleven defendants who chose to contest entry of the preliminary injunction--Miguel Moreno, Rafael Ruiz, and Blanca Gonzalez--were shown to have committed acts, primarily drug related, comprising specific elements of the public nuisance, such individualized proof is not a condition to the entry of preliminary relief based on a showing that it is the gang, acting through its individual members, that is responsible for the conditions prevailing in Rocksprings. Additional proceedings will be required to enforce the specific terms of the preliminary injunction. Should contempt proceedings ensue, each individual defendant will have an opportunity to contest any claim by the City that he or she has violated specific terms of the preliminary injunction.\n\nV. Conclusion\n\nTo hold that the liberty of the peaceful, industrious residents of Rocksprings must be forfeited to preserve the illusion of freedom for those whose ill conduct is deleterious to the community as a whole is to ignore half the political promise of the Constitution and the whole of its sense. The freedom to leave one's house and move about at will, and to have a measure of personal security is \"implicit in 'the concept of ordered liberty' \" enshrined in the history and basic constitutional documents of English-speaking peoples. ( Wolf v. Colorado (1949) 338 U.S. 25, 27-28 [69 S. Ct. 1359, 1361-1362, 93 L. Ed. 1782]; Palko v. Connecticut (1937) 302 U.S. 319, 325 [58 S. Ct. 149, 152, 82 L. Ed. 288].) Preserving the peace is the first duty of government, and it is for the protection of the community from the predations of the idle, the contentious, and the brutal that government was invented.\n\nWriting in 1834 of the events that shaped the American Revolution, Alexis De Tocqueville remarked how the American struggle for independence was uniquely shaped by \"a love for law and order.\" In this case we consider whether, after the passage of more than two centuries, we remain free to reaffirm those fundamental values of ordered liberty. We do.\n\nThe judgment of the Court of Appeal is reversed insofar as it invalidated paragraphs (a) and (k) of the preliminary injunction and concluded that defendant Blanca Gonzalez was not subject to its terms. Because our grant of review encompassed only those two of the fifteen provisions invalidated by the Court of Appeal, we do not address any other aspect of the preliminary injunction entered by the superior court.\n\nGeorge, C. J., Baxter, J., and Werdegar, J., concurred.\n\nKENNARD, J.,\n\nConcurring and Dissenting.--I concur with the majority in upholding the preliminary injunction's paragraph (k), one of the two paragraphs at issue in this case. Paragraph (k) enjoins defendants, all of whom are members of either of two gangs (Varrio Sureo Locos (VSL) and Varrio Sureo Treces or Varrio Sureo Town (VST)), from intimidating, harassing, threatening, provoking, or assaulting persons within a four-block area of San Jose known as Rocksprings. At trial, the San Jose City Attorney presented evidence that such conduct by the named defendants and/or other VSL and VST members obstructed the \"free use of property\" (Civ. Code, § 3479) within the Rocksprings area \"so as to interfere with the comfortable enjoyment of life or property\" (ibid.), and affected \"at the same time an entire community or neighborhood, or any considerable number of persons\" (Civ. Code, § 3480), and accordingly constituted a public nuisance (ibid.).\n\nBecause the prohibitions set forth in paragraph (k) of the preliminary injunction have the legitimate purpose of ridding the Rocksprings neighborhood of activities that interfered with the residents' comfortable enjoyment of life or property, paragraph (k) prohibits no more conduct than is necessary to abate the nuisance at hand and therefore is constitutionally permissible. Nor is paragraph (k) unconstitutionally vague. As the majority explains (maj. opn., ante, at p. 1116), the terms of paragraph (k), read within the context of the nuisance proven by the San Jose City Attorney, provide reasonable certainty and specificity. Due process requires no more.\n\nI do not, however, join the majority in upholding the injunction's paragraph (a), which prohibits the named defendants from being in the company of any other VSL or VST member while \"[s]tanding, sitting, walking, driving, gathering or appearing anywhere in public view\" in the four-block Rocksprings area. The evidence presented in this case falls far short of establishing that so drastic a restriction on the rights of defendants and other VSL and VST members to peacefully assemble is necessary to abate the public nuisance.\n\nUnder the First and Fourteenth Amendments of the federal Constitution, a state may not make criminal the exercise of the right of assembly simply because its exercise may offend some people. ( Coates v. City of Cincinnati (1971) 402 U.S. 611, 615-616 [91 S. Ct. 1686, 1689, 29 L. Ed. 2d 214].) Otherwise, the Coates court noted, \"the right of the people to gather in public places for social or political purposes would be continually subject to summary suspension\" and the law would provide \"an obvious invitation to discriminatory enforcement against those whose . . . ideas, . . . lifestyle, or . . . physical appearance is resented by the majority of their fellow citizens.\" (Ibid.)\n\nAs I explained in a Dissenting opinion in Planned Parenthood Shasta-Diablo, Inc. v. Williams (1995) 10 Cal. 4th 1009, 1032 [43 Cal. Rptr. 2d 88, 898 P.2d 402], when an injunction threatens to infringe on activity protected by the First Amendment, courts \"apply a more stringent test than the standard used to evaluate the constitutionality of content-neutral statutes regulating the time, place, and manner of expression.\" Such an injunction must be \" ' \"couched in the narrowest terms that will accomplish the pin-pointed objective\" of the injunction.' \" ( Id. at p. 1033, quoting Madsen v. Women's Health Center, Inc. (1994) 512 U.S. 753, 767 [114 S. Ct. 2516, 2526, 129 L. Ed. 2d 593].) Applying this test to paragraph (a), I am not convinced that its prohibition of any public contact between defendants and other members of the VSL and VST gangs within the four-block Rocksprings neighborhood is couched in the narrowest terms possible to accomplish the injunction's goal of restoring the residents' \"comfortable enjoyment of life [and] property\" (Civ. Code, § 3479).\n\nThere is no doubt that gang activity presents a serious threat to the peace and security of many a neighborhood. As I pointed out recently in People v. Gardeley (1996) 14 Cal. 4th 605, 609 [927 P.2d 713], which upheld sentence enhancement provisions of the Street Terrorism Enforcement and Prevention Act, also known as the STEP Act, the Legislature has expressly declared that \" 'California is in a state of crisis which has been caused by violent street gangs whose members threaten, terrorize, and commit a multitude of crimes against the peaceful citizens of their neighborhoods.' \" (Quoting Pen. Code, § 186.21.) When gang activity becomes a public nuisance, prosecutorial agencies may seek injunctive relief to abate the nuisance. (Code Civ. Proc., § 731.) But when a constitutionally protected interest is at stake, such as the right of peaceful assembly in this case, the injunctive relief must be narrowly tailored so as to minimally infringe upon the protected interest.\n\nHere, paragraph (a) does not satisfy this test, for it prohibits defendants from \"gathering or appearing anywhere in public view\" in the Rocksprings neighborhood with any other member of the VSL and VST gangs. Paragraph (k), by contrast, enjoins no more conduct than is necessary to eliminate the public nuisance in the Rocksprings area, and therefore is constitutionally permissible.\n\nThe Court of Appeal in this case invalidated both paragraph (k) and paragraph (a) of the injunction. For the reasons set forth above, I join the majority in reversing that part of the Court of Appeal's judgment invalidating paragraph (k), but, unlike the majority, I would affirm that part of the Court of Appeal's judgment invalidating paragraph (a).\n\nCHIN, J.,\n\nConcurring and Dissenting.--I am in general agreement with the majority, and in particular with its Conclusion that a court may enjoin as a public nuisance acts not in themselves crimes. I disagree with the majority, however, on one narrow, but important issue. I would hold that the evidence is insufficient to enjoin two of the thirty-eight named defendants: Rafael Ruiz and Blanca Gonzalez.\n\nThe legal principle at issue is quite simple. The law requires some link between each defendant who is subject to an injunction and the problem the injunction addresses. The majority argues that in this case gang membership and a one-time presence in Rocksprings is enough to establish this link. The majority reasons the trial court could have enjoined the gangs as a whole, and therefore it could enjoin individual gang members instead. (Maj. opn., ante, at p. 1125.) I agree that, in an appropriate case, a court may enjoin individuals based on group membership. (Cf. Madsen v. Women's Health Center, Inc. (1994) 512 U.S. 753, 759, fn. 1 [114 S. Ct. 2516, 2521, 129 L. Ed. 2d 593] (Madsen).) But the requirement of proof is no less rigorous in such a case. \"For liability to be imposed by reason of association alone, it is necessary to establish that the group itself possessed unlawful goals and that the individual held a specific intent to further those illegal aims.\" ( NAACP v. Claiborne Hardware Co. (1982) 458 U.S. 886, 920 [102 S. Ct. 3409, 3429, 73 L. Ed. 2d 1215], fn. omitted (Claiborne Hardware).) I do not believe the City of San Jose (the City) has met this standard with respect to Rafael Ruiz and Blanca Gonzalez.\n\nThe majority relies on Drivers Union v. Meadowmoor Co. (1941) 312 U.S. 287, 291 [61 S. Ct. 552, 554, 85 L. Ed. 836, 132 A.L.R. 1200] (Drivers Union), in which the trial court enjoined \"all union conduct.\" But Drivers Union did not involve the issue whether a court may enjoin individuals based on group membership. Rather, at issue was whether a court may enjoin peaceful acts of picketing when those acts are \"enmeshed with contemporaneously violent conduct.\" ( Id. at p. 292 [61 S. Ct. at p. 554].) The United States Supreme Court upheld the injunction, but emphasized the fact-finder's determination that the peaceful picketing \"was set in a background of violence\" and therefore had the character of a threat. ( Id. at p. 294 [61 S. Ct. at p. 555].) The trial court in this case made no similar finding with respect to the conduct of Rafael Ruiz and Blanca Gonzalez.\n\nThe majority also relies on Madsen, in which the trial court enjoined members of Operation Rescue (and other organizations) from impeding access to an abortion clinic in Melbourne, Florida. The United States Supreme Court again upheld parts of the injunction, but reaffirmed the necessity of a link between each defendant and the problem the injunction addresses. (Madsen, (supra) , 512 U.S. at p. 765, fn. 3 [ 114 S. Ct. at p. 2524].) Significantly, the high court did not even discuss the evidentiary showing necessary for including individual members of an organization within the scope of an injunction. The parties apparently did not raise the issue, perhaps because the record amply supported including organization members within the scope of the injunction.\n\nThe parties did, however, raise the issue in Claiborne Hardware, (supra) , 458 U.S. 886. Claiborne Hardware concerned a boycott of certain White merchants in Claiborne County, Mississippi. The boycott turned violent at times, and the Mississippi Supreme Court upheld an award of damages against, among others, certain members of the National Association for the Advancement of Colored People who supported the boycott. The United States Supreme Court agreed Mississippi could impose tort liability when violence or threats of violence resulted in business losses. (Id. at p. 916 [102 S. Ct. at p. 3427].) But the high court added: \"he presence of activity protected by the First Amendment imposes restraints . . . on the persons who may be held accountable for those damages.\" (Id. at pp. 916-917 [102 S. Ct. at p. 3427].) The court concluded: \"Civil liability may not be imposed merely because an individual belonged to a group, some members of which committed acts of violence.\" (Id. at p. 920 [102 S. Ct. at p. 3429].) \"ere association with [a] group--absent a specific intent to further an unlawful aim embraced by that group--is an insufficient predicate for liability.\" (Id. at pp. 925-926 [102 S. Ct. at p. 3432].)\n\nDrivers Union and Madsen are perfectly consistent with the standard the high court announced in Claiborne Hardware. Whether a court can enjoin individuals based on group membership depends on the nature of the group and the implications of membership under the circumstances. In the case of some groups, membership evidences a common purpose. If one purpose or activity of the group is the creation of a public nuisance, a court may enjoin both the group and its members. But the Sureo street gangs at issue in this case have fluid membership, no organizational structure, and no express purpose except perhaps to compete with members of rival Norteo gangs. The fact that many Sureo gang members commit crimes in Rocksprings does not establish that the gangs have crime as a universal purpose, primary activity, or condition of membership. The Sureo gangs might have some subdivisions that are criminally inclined and others that are not. Obviously, courts cannot enjoin all Mexican-Americans because some Mexican-Americans contribute to the nuisance in Rocksprings. Gang membership is no different, absent some evidence that contributing to the nuisance is an express or implied condition of membership.\n\nThe City's criteria for establishing Sureo gang membership do not include the intent to further the Sureo gangs' aims. Under these criteria, the City would consider a person to be a member of a Sureo gang if, for example, that person on two occasions wore baggy pants, blue clothes, or \"Los Angeles Raiders\" garments. The City also identifies persons who admit gang membership as gang members, regardless of the circumstances of their admission. As the declaration of Juan Pineda Hernandez indicates, people who are not gang members may assert membership for a variety of reasons, including youthful arrogance or a desire to be placed in protective custody. Thus, a person who merely claims membership in one of the Sureo gangs may not fully share that gang's aims. (See Burrell, Gang Evidence: Issues for Criminal Defense (1990) 30 Santa Clara L.Rev. 739, 750 [\"Law enforcement officials admit that there are many different levels of (gang) membership. [Fn. omitted.] Thus, to simply identify a person as a 'gang member' conveys little about that person's true level of involvement or activity. [Fn. omitted.]\"].)\n\nAccordingly, I do not agree the trial court was free to enjoin individual Sureo gang members simply because it could have enjoined the Sureo gangs as a whole. Moreover, the majority does not convince me the record in this case would have allowed the trial court to enjoin the Sureo gangs as a whole. As the majority emphasizes, the record paints an ugly picture of life in Rocksprings. Crime and contempt for authority are so pervasive that criminals would seem to be in charge. Sadly, despite all our technology and resources, utter lawlessness is the all-too-common mark of American urban life at the close of the 20th century. A society that is committed to protecting civil rights and civil liberties is not helpless to prevent such shameful atrocities. Dire problems demand bold solutions, and circumstances like those in Rocksprings warrant highly aggressive law enforcement. Nevertheless, the City must prove its case. A court's judgment may not stand on a visceral prejudice against street gangs or on a pervasive mood of public hysteria in the face of a law-and-order crisis; rather, that judgment must stand on evidence.\n\nThough the majority refers to \"48 declarations submitted by the City in support of its plea for injunctive relief\" (maj. opn., ante, at p. 1100), most of this evidence establishes only that some gang members commit crimes in Rocksprings, contributing to the general state of lawlessness in the neighborhood. The evidence describing the nature of the Sureo gangs, and thus establishing a possible link between the gangs themselves (as opposed to gang members) and the nuisance in Rocksprings, consists primarily of the declarations of Officer Mikael Niehoff and Sergeant Richard Saito. Those declarations describe the Sureo gangs as \"criminal street gangs,\" but the San Jose Police Department's definition of \"criminal street gang\" states nothing about the purpose or primary activity of the gang as a whole. Under its definition, any association of persons who individually engage in crime, even a sports team, would be a criminal street gang.\n\nOf course, numerous declarations state the crime in Rocksprings is \"gang related,\" but the San Jose police classify as gang related any crime a gang member commits. By that method of classification, much of the crime in Rocksprings might also be football related because the perpetrators of the crimes are football fans. The City's standard hardly establishes a logical link between the gang and the crime, particularly in light of the City's loose definition of gang member. Moreover, even under the City's overinclusive standard, only 12 to 14 percent of documented crimes in Rocksprings during the year preceding the date of Sergeant Saito's declaration had indicia of being gang related. The City argues this percentage may actually be higher because it did not keep track of whether crimes were gang related. I agree. The percentage may actually be higher. But it may not be. The City did not keep track, so it has not proved its case.\n\nConsidering the record as a whole, I agree an assertion of Sureo gang membership is an indication of unlawful purpose. But I would not conclude that a person's assertion of gang membership and a one-time presence in Rocksprings is sufficient to establish the necessary link between that person and the nuisance in Rocksprings. Accordingly, I would uphold the injunction in the case of a person who is an actual gang member only if the record includes some corroborating evidence showing that person substantially contributed to the nuisance in Rocksprings or intends to do so in the future.\n\nThe only evidence linking Blanca Gonzalez with the nuisance in Rocksprings is that she was in Rocksprings \"wearing a black top and black jeans,\" which according to police was \"consistent with members of Sureo criminal street gangs,\" and she claimed gang membership. This evidence is not sufficient to prove (even at the preliminary injunction stage) that she \"held a specific intent to further [the gangs'] illegal aims,\" assuming the Sureo gangs have illegal aims. (Claiborne Hardware, (supra) , 458 U.S. at p. 920 [ 102 S. Ct. at p. 3429].) Thus, I agree with the Court of Appeal that the trial court should not have enjoined Blanca Gonzalez.\n\nThe question is closer with respect to Rafael Ruiz. Ruiz also admitted gang membership. Moreover, some evidence indicates he committed a crime in Rocksprings, but this evidence is very thin. Ruiz was in a group that loosely matched the description of a group that had reportedly been selling drugs in the Rocksprings area. While I am sympathetic to the need for aggressive law enforcement, I conclude this evidence does not link Rafael Ruiz with the nuisance in Rocksprings sufficiently to support preliminary injunctive relief. Accordingly, I would hold that the trial court should not have enjoined him.\n\nThe gangs in question here are loosely organized associations of individuals with no express common purpose or central leadership. Some people may dress as gang members or claim membership in the gangs because of peer pressure or out of fear; the people primarily responsible for the public nuisance in Rocksprings may be a small minority of gang members. I do not discount the serious threat to community values that criminal street gangs pose. Nevertheless, we cannot turn a blind eye to the necessities of proof. I believe the majority has done so in the case of Rafael Ruiz and Blanca Gonzalez.\n\nMOSK. J.,\n\nDissenting.--No doubt Montesquieu, Locke, and Madison will turn over in their graves when they learn they are cited in an opinion that does not enhance liberty but deprives a number of simple rights to a group of Latino youths who have not been convicted of a crime. Mindful of the admonition of another great 18th century political philosopher, Benjamin Franklin, that \"[t]hey that can give up essential liberty to obtain a little temporary safety deserve neither liberty nor safety,\" I would, unlike the majority, in large part affirm the judgment of the Court of Appeal.\n\nI.\n\nOn February 26, 1993, the City of San Jose (hereafter the City) filed a complaint in the superior court seeking preliminary and permanent injunctive relief against 38 named and 100 unnamed individuals who were purportedly \"validated\" as active members of 1 of 2 street gangs, Varrio Sureo Locos (VSL) and Varrio Sureo Treces or Varrio Sureo Town (VST). The complaint seeks to restrict their activities in a four-block residential area known as \"Rocksprings.\" \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe complaint alleged that for more than 12 months, defendants \"occupied\" and \"used the area commonly known as 'Rocksprings' . . . in such a manner so as to constitute a public nuisance in accordance with Civil Code [sections] 3479 and 3480 . . . .\" The \"regular and continuous activities\" alleged to constitute the public nuisance included: \"homicide and attempted homicide, shootings, assault and battery with a vast array of weapons, vandalism, graffiti, sale and use of illegal narcotics, arson and theft . . . [and] blocking of free ingress and egress to the street. . . .\" Defendants were also alleged to \"have broken lights on private property, have shot at windows of buildings, have shot at rival gang members and innocent persons; have engaged in fights with other gangs and gang members; have caused, encouraged and/or participated in the drinking of alcoholic beverages by juveniles; have used loud profanities amongst each other and directed at other neighbors; have caused, encouraged, or participated in the use, possession and/or sale of illegal drugs; have confronted, intimidated, annoyed, harassed, challenged and provoked the residents of the neighborhood by their activities and have placed the residents of the neighborhood in fear of their safety, lives and property.\"\n\nThe City submitted declarations from the San Jose Chief of Police, police officers, neighborhood residents, and others describing the gangs and detailing specific incidents in Rocksprings and elsewhere involving defendants. They explain that the VSL/VST gangs have approximately 150 to 200 members, most of whom are Latino youths between the ages of 14 and 23 who claim allegiance to Southern California (hence \"Sureo,\" which is Spanish for \"southern\") or Mexico. The gangs claim as their insignia the number 13, the letter \"M,\" and the color blue; they typically mark their turf with graffiti and tags that include the gang initials and variations on the number 13. The gangs lack a \"structural hierarchy\"; membership is \"very fluid\" and such that \"many of its members did not know one another.\" Although their organization is loose and informal, gang members reportedly often cooperate with each other in drug selling and other illegal activities.\n\nAccording to the declarations, drug dealing, fighting, and graffiti were constant problems in Rocksprings and occurred at all hours of the day and night. Gang members threatened and intimidated residents. For example, a gang member warned a nine-year-old girl who had told police officers where some drugs were hidden that he would cut her tongue out if she ever again talked to the police. In another incident, gang members threatened a Rocksprings resident and vandalized her property after she called the police to report that some gang members had urinated in her garage. The declarations also stated, however, that fully 86 percent of the reports of criminal activity in Rocksprings do not indicate that they are related to VSL or VST gangs: only 12 percent of the reports are believed by the City to be gang related and 2 percent were deemed \"possibly gang-related.\"\n\nMoreover, under the City's criteria for \"validating\" VST and VSL members, no history of criminal or disruptive activity in Rocksprings or elsewhere is required for an individual to be identified as a Sureo gang member. Indeed, an individual may be so identified simply if he or she \"admits\" to gang membership, or merely was seen in association with another purported gang member on two occasions and wore clothing associated with the gang--including such ordinary apparel as baggy trousers and blue or black shirts or pants.\n\nOn February 26, 1993, the superior court granted the City's request for a temporary restraining order and issued an ex parte order to show cause, setting the case for further hearing on March 10, 1993. Five defendants appeared at the hearing. The superior court left the temporary restraining order standing against those defendants and issued an order granting a preliminary injunction against the remaining defendants. On May 28, 1993, six additional named defendants moved to set aside the orders. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe superior court conducted a hearing on June 28, 1993. It issued an order granting a preliminary injunction against 11 defendants, enjoined from performing, \"directly or indirectly,\" certain specified acts within the Rocksprings neighborhood. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nDefendants appealed from that order. The Court of Appeal concluded that \"insofar as this injunction reaches no further than the Constitution allows, it can properly be used to abate gang-related criminal activity as a public nuisance.\" Determining that many of the provisions were unconstitutionally vague or overbroad, or prohibited too much ordinary and innocuous conduct, it struck paragraphs (a), (e), (i), (m), (n), (o), (q), (r), (s), (v), (w), and (x) in whole and paragraphs (c), (k), and (l) in part. As modified, it affirmed the order granting the preliminary injunction.\n\nThe City sought review of the Court of Appeal's decision only as to two provisions: paragraphs (a) and (k). We granted review. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nII.\n\nWe review an order granting a preliminary injunction for abuse of discretion. ( Hunter v. City of Whittier (1989) 209 Cal. App. 3d 588, 595 [257 Cal. Rptr. 559].) \"Ordinarily an appeal from the granting of a preliminary injunction involves a very limited review of the [superior court's] exercise of discretion concerning two factors: (1) the likelihood that plaintiffs will ultimately prevail and (2) the interim harm plaintiffs will sustain if the preliminary injunction is denied compared to the interim harm defendant will suffer if the injunction is granted pending a final determination of the merits.\" (Ibid.) Thus, an appellate decision usually does not constitute a final adjudication of the ultimate rights in controversy; it merely determines whether the superior court abused its discretion based on the record before it at the time of the ruling.\n\nOf course, questions underlying the preliminary injunction are reviewed under the appropriate standard of review. Thus, for example, issues of fact are subject to review under the substantial evidence standard; issues of pure law are subject to independent review. ( Bullock v. City and County of San Francisco (1990) 221 Cal. App. 3d 1072, 1094 [271 Cal. Rptr. 44] [\" 'the standard of review [for issues of pure law] is not abuse of discretion but whether statutory or constitutional law was correctly interpreted and applied by the trial court.' \"].) \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e This case presents several issues of pure law, principally: (1) whether injunctive relief under public nuisance provisions for gang-related activity was preempted by the California Street Terrorism Enforcement and Prevention Act (hereafter the STEP Act), codified at Penal Code section 188.20 et seq.; (2) whether, as a matter of law, certain conduct could be abated as a public nuisance; and (3) whether certain provisions of the preliminary injunction were impermissibly vague or restrictive of protected First Amendment rights. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nAs to the remaining issues--including the likelihood that the City will succeed in establishing that specific conduct of the VSL/VST gangs constitutes a public nuisance and that individual defendants were properly enjoined--we review for abuse of discretion.\n\nIII.\n\nAs a threshold matter, defendants contend that the STEP Act is the exclusive means of enjoining criminal street gangs, preempting general public nuisance statutes. They are wrong. The act, by its express provisions, is not the exclusive remedy for abating gang activity constituting a public nuisance.\n\nUnder the STEP Act, a building or place used by members of a criminal street gang for specified illegal activities constitutes a nuisance per se: \"Every building or place used by members of a criminal street gang for the purpose of the commission of [specified] offenses . . . and every building or place wherein or upon which that criminal conduct by gang members takes place, is a nuisance which shall be enjoined, abated, and prevented, and for which damages may be recovered, whether it is a public or private nuisance.\" (Pen. Code, § 186.22a, subd. (a), italics added.) The Legislature has provided, however, that \"[n]othing in this chapter shall preclude any aggrieved person from seeking any other remedy provided by law.\" (Id., § 186.22a, subd. (d).) The act thus plainly contemplates additional remedies to abate criminal gang activities, including those under our general public nuisance statutes.\n\nThe City expressly sought relief not under the STEP Act, but, instead, under the general public nuisance statutes. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Accordingly, we need not determine whether some or all of the conduct enjoined would also fall within the scope of the act or whether any of the defendants could be enjoined under its provisions.\n\nIV.\n\nThe City contends that all of the conduct described in paragraphs (a) and (k) of the preliminary injunction order was properly abated by the superior court as a public nuisance. Defendants claim that none of the conduct could be so enjoined. Neither is correct. As the Court of Appeal correctly concluded, some, but not all, of the conduct could not unreasonably be abated under our general public nuisance statutes.\n\nCivil Code section 3479 defines a public nuisance as: \"Anything which is injurious to health, including, but not limited to, the illegal sale of controlled substances, or is indecent or offensive to the senses, or an obstruction to the free use of property, so as to interfere with the comfortable enjoyment of life or property, or unlawfully obstructs the free passage or use, in the customary manner, of any navigable lake, or river, bay, stream, canal, or basin, or any public park, square, street, or highway, is a nuisance.\" CIVIL CODE SECTION 3480 PROVIDES: \"A public nuisance is one which affects at the same time an entire community or neighborhood, or any considerable number of persons, although the extent of the annoyance or damage inflicted upon individuals may be unequal.\" A public nuisance is subject to a civil action for abatement, and may, as here, be \"brought . . . by the city attorney of any town or city in which such nuisance exists.\" (Code Civ. Proc., § 731.)\n\nThe act or condition to be abated may consist of criminal or noncriminal conduct, but the equitable remedy exists only \"where the objectionable activity can be brought within the terms of the statutory definition of public nuisance.\" ( People v. Lim (1941) 18 Cal. 2d 872, 879 [118 P.2d 472].) \"quity is loath to interfere where the standards of public policy can be enforced by resort to the criminal law, and in the absence of a legislative declaration to that effect, the courts should not broaden the field in which injunctions against criminal activity will be granted.\" ( Id. at p. 880; accord, Nathan H. Schur, Inc. v. City of Santa Monica (1956) 47 Cal. 2d 11, 19 [300 P.2d 831].) \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nNor may an injunction \"go . . . further than is absolutely necessary to protect the lawful rights of the parties seeking such injunction.\" ( People v. Mason, (supra) , 124 Cal. App. 3d at p. 354.) Rather, it is \"important for the trial court to limit the scope of the injunction, taking only those measures which would afford the People the relief to which they are entitled.\" (Ibid.; see also Anderson v. Souza (1952) 38 Cal. 2d 825, 840-841 [243 P.2d 497] [\" 'Injunctive process ought never to go beyond the necessities of the case.' \"].)\n\nIn addition, of course, our general public nuisance statutes \"must be enforced in such a way as to operate in a constitutional fashion.\" (People ex rel. Busch v. Projection Room Theater, (supra) , 17 Cal. 3d at p. 55.) In particular, \"restrictions upon the exercise of First Amendment rights [citation] must be drawn with a narrow specificity calculated to prevent repression of expressive activities as to which restriction is constitutionally forbidden.\" ( In re Berry (1968) 68 Cal. 2d 137, 155 [65 Cal. Rptr. 273, 436 P.2d 273]; see Burton v. Municipal Court (1968) 68 Cal. 2d 684, 696 [68 Cal. Rptr. 721, 441 P.2d 281] [invalidating restrictions on operation of motion pictures]; City of Indio v. Arroyo (1983) 143 Cal. App. 3d 151, 158-159 [191 Cal. Rptr. 565] [sign ordinance unconstitutionally overbroad as applied to noncommercial wall mural].)\n\n\"The First Amendment generally prevents government from proscribing speech [citation], or even expressive conduct [citation], because of disapproval of the ideas expressed. Content-based regulations are presumptively invalid.\" ( R.A.V. v. City of St. Paul, Minnesota (1992) 505 U.S. 377, 382 [112 S. Ct. 2538, 2542, 120 L. Ed. 2d 305].) The presumption of invalidity applies with particular force to injunctions. \"Injunctions . . . carry greater risks of censorship and discriminatory application than do general ordinances\" and therefore require \"a somewhat more stringent application of general First Amendment principles.\" ( Madsen v. Women's Health Center, Inc. (1994) 512 U.S. 753, 764-765 [114 S. Ct. 2516, 2524, 129 L. Ed. 2d 593].) Accordingly, an injunction restricting speech or other expressive conduct must be content neutral and \"burden no more speech than necessary to serve a significant government interest.\" ( Id. at p. 765 [114 S. Ct. at p. 2525]; Planned Parenthood Shasta-Diablo, Inc. v. Williams (1995) 10 Cal. 4th 1009, 1019-1024 [43 Cal. Rptr. 2d 88, 898 P.2d 402].)\n\nAn injunction restricting constitutionally protected activity must also be sufficiently clear to withstand a challenge on the ground of vagueness under the due process clauses of the United States and California Constitutions. (U.S. Const., Amends. V, XIV; Cal. Const., art. I, § 7.) Vague injunctions, like vague laws, \" ' \"offend several important values. First, because we assume that man is free to steer between lawful and unlawful conduct, we insist that laws give the person of ordinary intelligence a reasonable opportunity to know what is prohibited, so that he may act accordingly. Vague laws may trap the innocent by not providing fair warning. Second, if arbitrary and discriminatory enforcement is to be prevented, laws must provide explicit standards for those who apply them. A vague law impermissibly delegates basic policy matters to policemen, Judges, and juries for resolution on an ad hoc and subjective basis, with the attendant dangers of arbitrary and discriminatory application.\" ' \" ( Williams v. Garcetti (1993) 5 Cal. 4th 561, 567-568 [20 Cal. Rptr. 2d 341, 853 P.2d 507].) The provisions of an injunction \" ' \"should be sufficiently certain so that a person may know what is prohibited thereby and what may be done without violating its provisions, but it cannot be held void for uncertainty if any reasonable and practical construction can be given to its language.\" ' \" ( Id. at p. 568.)\n\nFinally, an injunction restricting constitutionally protected activity must be narrowly tailored to withstand challenge on the ground of overbreadth. \"n overbreadth challenge implicates the constitutional interest in due process of law. (U.S. Const., Amends. V, XIV; Cal. Const., art. I, § 7, subd. (a), 24.) The overbreadth doctrine provides that 'a governmental purpose to control or prevent activities constitutionally subject to state regulation may not be achieved by means which sweep unnecessarily broadly and thereby invade the area of protected freedoms.' [Citation.] . . . Nevertheless, a facial overbreadth challenge is difficult to sustain. . . . 'pplication of the overbreadth doctrine . . . is, manifestly, strong medicine. It has been employed . . . sparingly and only as a last resort.' [Citation.] Consequently, to justify a Conclusion of facial overbreadth, 'the overbreadth of a [restriction] must not only be real, but substantial as well . . . .' \" ( Williams v. Garcetti, (supra) , 5 Cal. 4th at p. 577.)\n\nV.\n\nI turn now to the individual provisions of the preliminary injunction that are at issue here.\n\na.\n\nI agree with the Court of Appeal that the following provisions of the preliminary injunction should be sustained, because they restrict gang-related conduct that the superior court not unreasonably found was likely to be proved on the merits to constitute a public nuisance in the Rocksprings neighborhood: paragraphs (b) (public consumption of alcoholic beverages or drugs); (d) (fighting in the public streets); (f) (spray painting or otherwise applying graffiti to public or private property); (g) (trespassing on or encouraging others to trespass on any private property); (h) (blocking free ingress and egress to the public sidewalks or street or to any driveways leading or appurtenant thereto in Rocksprings); (j) (discharging firearms); (p) (demanding entry into another person's residence); (t) (littering in any public place or place open to public view); and (u) (urinating or defecating in any public place or place open to public view). The record includes allegations and supporting declarations concerning the prevalence of these activities by VSL-VST gang members in Rocksprings. The activities also readily fall within the statutory definition of a \"nuisance\" as \"[a]nything which is injurious to health, . . . or is indecent or offensive to the senses, or an obstruction to the free use of property, so as to interfere with the comfortable enjoyment of life or property, or unlawfully obstructs the free passage or use, in the customary manner, of any . . . public park, square, street, or highway\" (Civ. Code, § 3479) and as a \"public nuisance\" as \"one which affects at the same time an entire community or neighborhood, or any considerable number of persons . . . .\" (id., § 3480.) That some or all of these activities may also constitute criminal violations does not limit the superior court's power to grant a preliminary injunction in this case.\n\nb.\n\nAs to the remaining provisions of the preliminary injunction, as stated above, the City only contests the decision of the Court of Appeal regarding paragraphs (a) and (k). Unlike the majority, I agree with the Court of Appeal that the sweeping prohibitions of the former do not withstand scrutiny, and that the latter provision must be stricken in part.\n\nParagraph (a) enjoins \"[s]tanding, sitting, walking, driving, gathering or appearing anywhere in public with any other defendant herein, or with any other known 'VST' . . . or 'VSL' . . . member.\" It applies without any requirement or condition that a defendant or his associate be engaged in any illegal activity or misconduct related to the alleged public nuisance.\n\nThe provision is impermissibly vague. Who is a \"known\" VST or VSL member? And by whom is such membership \"known\"? (See Lanzetta v. New Jersey (1939) 306 U.S. 451, 458 [59 S. Ct. 618, 621, 83 L. Ed. 888] [expression \"known to be a member [of any gang]\" unconstitutionally vague]; Farber v. Rochford (N.D.Ill. 1975) 407 F. Supp. 529, 532 [phrase \"known to be [narcotic addict or prostitute]\" impermissibly requires court to \"indulge in conjecture as to how reputation might be ascertained\"].) In the absence of any specific definition of gang membership, neither police officers nor courts are provided with a consistent standard for determining when a violation of the injunction occurred.\n\nThus, even if we were to accept the City's argument that the only reasonable construction of the prohibition is that it requires a defendant to know that the person he or she is standing, sitting, driving, walking, driving, gathering, or appearing with is a gang member, it remains susceptible to arbitrary enforcement. Without a definition of gang membership, how would a defendant know when he or she was violating the injunction? It is also unclear how a police officer would know whether or not a defendant knows that he or she is engaging in these activities with a gang member. Under the City's construction, a defendant could be arrested and prosecuted for walking down the street or simply appearing in public with another person, based on a police officer's mere supposition that such defendant \"knew\" he or she was in the company of a \"known\" gang member. As the Court of Appeal recognized: \"it is apparent a defendant could be engaged in one of the activities prohibited in paragraph (a) with a person not known to him or to her but known to police as a gang member, and suffer penalties for refusing to obey the injunction as a result. This is a classic case of vagueness.\"\n\nApart from these fundamental vagueness problems, the prohibitions under paragraph (a) go \"further than is absolutely necessary to protect the lawful rights of the parties seeking such injunction\" ( People v. Mason, (supra) , 124 Cal. App. 3d at p. 354) by penalizing much ordinary and lawful activity that does not fall within the statutory definition of a public nuisance. The prohibitions are not only sweeping, but absolute: They apply without regard to the defendant's intent or to the circumstances. In my view, a defendant may not be subject to a contempt sanction for merely walking in, driving through, or \"appearing\" in the Rocksprings neighborhood in the company of any \"known\" gang member without causing any disruption. Such everyday conduct is not \"injurious to health, . . . or . . . indecent or offensive to the senses, or an obstruction to the free use of property\" (Civ. Code, § 3479); nor does it affect \"at the same time an entire community or neighborhood\" (id., § 3480). \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nThe City asserts, and the majority apparently agree, that the associational rights of the members of the loosely formed VSL and VST gangs are not \"worthy\" of constitutional protection; they argue that only \"intimate\" and \"expressive\" associations are entitled to such protection. Although I, too, deplore gang violence, I am unwilling, despite the apparent nature of the Sureo gangs, to conclude that their members do not also engage in innocent intimate or expressive conduct. Moreover, the cases on which the majority rely, principally Roberts v. United States Jaycees (1984) 468 U.S. 609 [104 S. Ct. 3244, 82 L. Ed. 2d 462], and Dallas v. Stanglin (1989) 490 U.S. 19 [109 S. Ct. 1591, 104 L. Ed. 2d 18], are not in point. The preliminary injunction directly impairs the kinds of everyday intimate and expressive association with friends and relatives that have traditionally been subject to constitutional protection.\n\nParagraph (k) enjoins \"[i]n any manner confronting, intimidating, annoying, harassing, threatening, challenging, provoking, assaulting and/or battering any residents or patrons, or visitors to 'Rocksprings', or any other persons who are known to have complained about gang activities, including any persons who have provided information in support of this Complaint and requests for Temporary Restraining Order, Preliminary Injunction and Permanent Injunction.\" Conduct or speech that is physically threatening, harassing, intimidating, or assaultive may constitute a public nuisance and is not constitutionally protected. The superior court did not abuse its discretion, therefore, in imposing restrictions against \"intimidating, harassing, threatening . . . assaulting and/or battering residents or patrons, or visitors to 'Rocksprings.' \"\n\nAlthough the terms \"harassing\" and \"intimidating\" are not specifically defined in the preliminary injunction, I disagree with the Court of Appeal's Conclusion that they are too vague. Their meaning is sufficiently definite in the context of paragraph (k) as modified. I understand them to refer to behavior that would cause a reasonable person to suffer substantial emotional distress. I note that courts have frequently affirmed provisions of injunctions enjoining \"intimidating\" or \"harassing\" others. (See, e.g., Planned Parenthood Shasta-Diablo, Inc. v. Williams, (supra) , 10 Cal. 4th at p. 1013 [anti-abortion protesters enjoined from harassing persons entering a clinic]; In re Coleman (1974) 12 Cal. 3d 568, 571 [116 Cal. Rptr. 381, 526 P.2d 533] [union members enjoined from committing \"acts of harassment or intimidation\"]; M Restaurants, Inc. v. San Francisco Local Joint Exec. Bd. Culinary etc. Union (1981) 124 Cal. App. 3d 666, 672 [177 Cal. Rptr. 690] [defendant unions enjoined from \"threatening and/or committing acts of intimidation and physical violence\"].)\n\nThe remainder of the provision, however, is too vague to withstand due process challenge. Activity in Rocksprings that consists of \"[i]n any manner confronting, . . . annoying, . . . challenging, [or] provoking\" others may include so much ordinary social behavior--and so much that depends on the individual sensibilities of those who might feel annoyed, challenged, or provoked--that it impermissibly invites arbitrary enforcement. As the United States Supreme Court observed in Coates v. City of Cincinnati (1971) 402 U.S. 611, 614-616 [91 S. Ct. 1686, 1688-1689, 29 L. Ed. 2d 214]: \"The city is free to prevent people from blocking sidewalks, obstructing traffic, littering streets, committing assaults, or engaging in countless other forms of antisocial conduct. . . . . . . The First and Fourteenth Amendments do not permit a State to make criminal the exercise of the right of assembly simply because its exercise may be 'annoying' to some people. If this were not the rule, the right of the people to gather in public places for social or political purposes would be continually subject to summary suspension through the good-faith enforcement of a prohibition against annoying conduct. And such a prohibition, in addition, contains an obvious invitation to discriminatory enforcement against those whose association together is 'annoying' because their ideas, their lifestyle, or their physical appearance is resented by the majority of their fellow citizens.\" (Fns. omitted; see also H-CHH Associates v. Citizens for Representative Government (1987) 193 Cal. App. 3d 1193, 1221 [238 Cal. Rptr. 841] [prohibition against \"approaching\" mall patrons overbroad because it \"encompass[es] lawful, as well as unlawful, activity\"].)\n\nI also conclude that the phrase \"persons who are known to have complained about gang activities\" is too imprecise and must be stricken from paragraph (k). The City concedes as much. It is, in any event, superfluous: defendants are prohibited from threatening or assaulting any other person in Rocksprings, i.e., all \"residents, patrons, or visitors.\" \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nVI.\n\nThe preliminary injunction names specific individuals; it is not directed against the VSL/VST gangs generally. Defendants contend that the superior court erred by enjoining six persons who have not been shown to be directly and substantially responsible for the public nuisance. The City counters that all six defendants were properly enjoined. Analogizing this matter to cases involving injunctions directed against unions and political organizations, it argues that \"had [it] obtained a preliminary injunction against the VSL/VST street gangs to abate the public nuisance the gang created in Rocksprings, there is no question that injunction could have been made to bind the members of the gang as a class.\"\n\nNeither is persuasive. I reject defendants' argument that an individual could properly be subject to the preliminary injunction only if he or she engaged in all of the enjoined conduct or was otherwise responsible for the public nuisance. I also reject the City's argument that each one of these defendants was properly enjoined because the superior court could have enjoined the VSL/VST gangs as a whole. They beg the question whether the gang members could properly have been enjoined as a class. Unlike the unions in Watsonville Canning \u0026 Frozen Food Co. v. Superior Court (1986) 178 Cal. App. 3d 1242 [224 Cal. Rptr. 303], or the anti-abortion organizations in Madsen v. Women's Health Center, Inc., (supra) , 512 U.S. 753, the VSL/VST gang is a loose affiliation of hundreds of individuals, many of whom may never have participated in any of the activities constituting the public nuisance. Indeed, it is likely that many of them either live in Rocksprings themselves or have friends and relatives who do.\n\nAs the City concedes, an individual may be \"validated\" as a VSL/VST gang member simply because he or she wears gang colors (including \"neutral\" colors like khaki, black, white, and blue) and is seen in the company of other \"validated\" gang members. I would agree with the Court of Appeal that, absent any showing that an individual \"validated\" as a gang member is likely to commit acts constituting a public nuisance in Rocksprings, he or she may not properly be subjected to the injunction, at least to the extent that it enjoins ordinary and innocent conduct within the Rocksprings neighborhood. (See People v. Green (1991) 227 Cal. App. 3d 692, 699 [278 Cal. Rptr. 140] [mere membership in a street gang is not a crime]; see also NAACP v. Claiborne Hardware Co. (1982) 458 U.S. 886, 920 [102 S. Ct. 3409, 3429, 73 L. Ed. 2d 1215] [individuals could not be enjoined merely because they belonged to a group, some members of which committed acts of violence; to impose liability by reason of association alone, it must be shown that the group itself possessed unlawful goals and the named individual held a specific intent to further those goals].) \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nUnder our general nuisance statutes, \"[a] judgment prohibiting a defendant from doing that which neither past acts nor present intent indicates he is likely to do unless prevented by a court of equity, is an erroneous exercise of equitable jurisdiction.\" ( People v. Robin (1943) 56 Cal. App. 2d 885, 887 [133 P.2d 436].) The mere facts that a defendant \"admitted\" gang membership to a police officer or others or was seen associating with gang members or wearing gang colors or insignia, do not indicate that he or she has, or will in the future, engage in conduct amounting to a public nuisance. In my view, individual defendants may be subject to the preliminary injunction only if the City establishes a likelihood that it will succeed on the merits of its claim that he or she actively participated in the activities constituting a public nuisance, or had a specific intention to do so.\n\nThe City presented evidence of conduct by each of the named defendants in and around the Rocksprings area.\n\nAs to one of the named defendants, Blanca Gonzalez, the evidence consisted solely of a police officer's statement to the effect that she was the driver of a car that was circling up and down the street in a purportedly Norteo-dominated neighborhood--apparently not Rocksprings. On that occasion, she was dressed in a black top and black jeans, consistent with members of Sureo gangs; she told the police officer that she belonged to the VST and VCT (also known as \"Varrio Colonio Treces\") gangs. On another occasion, a police officer on patrol in Rocksprings entered into a conversation with Gonzalez and another young Hispanic woman, after they drove up to an address in the Rocksprings neighborhood. Gonzalez told him that she did not live in Rocksprings and that she was a member of the VSL gang.\n\nNone of this alleged conduct establishes a likelihood that the City will succeed on the merits of its claim that Gonzalez has participated in conduct amounting to a public nuisance in the Rocksprings neighborhood or elsewhere, or that she has any specific intention of doing so.\n\nThe record also fails to support enjoining Miguel Moreno or Rafael Ruiz. Although both at one time \"admitted\" gang membership, neither was adequately shown to have engaged in conduct amounting to a public nuisance in or around Rocksprings. Moreno was merely \"identified\" by an unknown party as having been involved in a drug offense in Rocksprings. Ruiz was identified by a police officer responding to a citizen call concerning a drug transaction as loosely matching a description of one of the participants.\n\nDefendants also argue that the superior court erred in naming three other gang members, Jorge Gonzalez, Eberardo Cervantes, and Miguel Lopez. I disagree. As the Court of Appeal not unreasonably concluded, an adequate showing was made for the purposes of ordering preliminary injunctive relief against them. All three not only freely admitted that they were active gang members, but they participated in conduct in and around Rocksprings amounting to a public nuisance. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e I would therefore sustain the Court of Appeal's determination that these defendants were not unreasonably restrained.\n\nIn sum, I would affirm the judgment of the Court of Appeal to the extent that it sustained paragraphs (b), (c), (d), (f), (g), (h), (j), (p), (t), and (u) and struck paragraph (a). I would reverse the judgment of the Court of Appeal to the extent that it struck the terms \"harassing\" and \"intimidating\" from paragraph (k).\n\nConclusion\n\nThe majority would permit our cities to close off entire neighborhoods to Latino youths who have done nothing more than dress in blue or black clothing or associate with others who do so; they would authorize criminal penalties for ordinary, nondisruptive acts of walking or driving through a residential neighborhood with a relative or friend. In my view, such a blunderbuss approach amounts to both bad law and bad policy. Justice Black warned in Jay v. Boyd (1956) 351 U.S. 345, 367 [76 S. Ct. 919, 931, 100 L. Ed. 1242]: \"Unfortunately there are some who think that the way to save freedom in this country is to adopt the techniques of tyranny.\" The majority here appear to embrace that misguided belief. Accordingly, I Dissent.\n\n\u003cspan class=\"fn\"\u003e1. The California Street Terrorism Enforcement and Prevention Act. (Pen. Code, § 186.20 et seq.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. \"If anyone cast dung etc. into Ditches, Water etc. which are next to any City, Borough or Town, he who will may sue forth a writ directed unto the Mayor or Sheriff or Bayliff of such Town etc.\" (The Stat. of 12 Rich. II, 1389, ch. 13.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. As the editors of the second Restatement note, at common law the public nuisance involved \"an interference with a right common to the general public. Little more than this in the way of a standard for determining what kinds of interferences constitute the crime of public nuisance was to be found in the cases.\" (Rest.2d Torts, § 821B, com. e, p. 89.) The development of the private nuisance tort action, however, \"led to the application in public nuisance cases . . . of an analysis substantially similar to that employed in the tort action for private nuisance.\" (Ibid.) By analogy to the rules governing tort liability, courts apply the same elements to determine liability for a public nuisance. (See id. at pp. 89-91.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Defendants concede that the People did not purport to seek injunctive relief under the STEP Act, but invoked the general public nuisance statutes; they argue, however, that the superior court erroneously relied on the STEP public nuisance provision. A reviewing court will uphold a judgment if it is correct for any reason \" 'regardless of the correctness of [its] grounds . . . .' [Citation.] 'It is judicial action and not judicial reasoning which is the subject of review . . . .' \" ( United Pacific Ins. Co. v. Hanover Ins. Co. (1990) 217 Cal. App. 3d 925, 933 [266 Cal. Rptr. 231], fn. omitted.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 The City \"validates\" as a criminal street gang an association of three or more persons with a common name or symbol whose members collectively or individually engage in a pattern of criminal conduct, as defined by Penal Code section 186.22, subdivision (f). It does not, however, adhere to the statutory definition of a gang member. (Pen. Code, § 186.22, subd. (a) [gang member defined as \"[a]ny person who actively participates in any criminal street gang with knowledge that its members engage in or have engaged in a pattern of criminal gang activity, and who willfully promotes, furthers, or assists in any felonious criminal conduct by members of that gang.\"].) Instead, to \"validate\" specific gang members, the City merely reviews police records to identify individuals who admit membership in a gang to a peace officer, probation officer, juvenile hall or youth ranch employee, or who meet two or more of the following conditions: wear clothing or tattoos indicating gang affiliation or use gang hand signs; are named by two or more members of a gang as a member; actively participate in a gang crime; are identified by a reliable informant as a gang member; or are observed associating with gang members two or more times. Using similar broad criteria, the Los Angeles Sheriff's Department has estimated that 47 percent of all African-American males between the ages of 21 and 24 are actual or suspected gang members. (Reiner (1992) Gangs, Crime and Violence in Los Angeles, p. 121.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 The six defendants submitted declarations in support of the motion to vacate, including explanations of why certain defendants failed to attend the hearing on the order to show cause. Some of the defendants described their family and other ties to the Rocksprings neighborhood; a few also stated that they had never been--or were no longer--Sureo gang members.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 The superior court did not prepare a written statement of decision. The order granting the preliminary injunction enjoins defendants Carlos Acuna, Jose Bravo, Eberardo Cervantes, Martin Davila, Blanca Gonzalez, Jorge Gonzalez, Juan Pineda Hernandez, Miguel Lopez, Miguel Moreno, Flavio Quinonez, and Rafael Ruiz from the following acts:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(a) Standing, sitting, walking, driving, gathering or appearing anywhere in public view with any other defendant herein, or with any other known 'VST' (Varrio Sureno Town or Varrio Sureno Treces) member;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(b) Drinking alcoholic beverages in public excepting consumption on properly licensed premises or using drugs;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(c) Possessing any weapons including but not limited to knives, dirks, daggers, clubs, nunchukas [ sic ; nunchakus], BB guns, concealed or loaded firearms, and any other illegal weapons as defined in the California Penal Code, and any object capable of inflicting serious bodily injury including but not limited to the following: metal pipes or rods, glass bottles, rocks, bricks, chains, tire irons, screwdrivers, hammers, crowbars, bumper jacks, spikes, razor blades; razors, sling shots, marbles, ball bearings;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(d) Engaging in fighting in the public streets, alleys, and/or public and private property;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(e) Using or possessing marker pens, spray paint cans, nails, razor blades, screwdrivers, or other sharp objects capable of defacing private or public property;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(f) Spray painting or otherwise applying graffiti on any public or private property, including but not limited to the street, alley, residences, block walls, vehicles and/or any other real or personal property;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(g) Trespassing on or encouraging others to trespass on any private property;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(h) Blocking free ingress and egress to the public sidewalks or street, or any driveways leading or appurtenant thereto in 'Rocksprings';\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(i) Approaching vehicles, engaging in conversation, or otherwise communicating with the occupants of any vehicle or doing anything to obstruct or delay the free flow of vehicular or pedestrian traffic;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(j) Discharging any firearms;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(k) In any manner confronting, intimidating, annoying, harassing, threatening, challenging, provoking, assaulting and/or battering any residents or patrons, or visitors to 'Rocksprings', or any other persons who are known to have complained about gang activities, including any persons who have provided information in support of this Complaint and requests for Temporary Restraining Order, Preliminary Injunction and Permanent Injunction;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(l) Causing, encouraging, or participating in the use, possession and/or sale of narcotics;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(m) Owning, possessing or driving a vehicle found to have any contraband, narcotics, or illegal or deadly weapons;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(n) Using or possessing pagers or beepers in any public space;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(o) Possessing channel lock pliers, picks, wire cutters, dent pullers, sling shots, marbles, steel shot, spark plugs, rocks, screwdrivers, 'slim jims' and other devices capable of being used to break into locked vehicles;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(p) Demanding entry into another person's residence at any time of the day or night;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(q) Sheltering, concealing or permitting another person to enter into a residence not their own when said person appears to be running, hiding, or otherwise evading a law enforcement officer;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(r) Signaling to or acting as a lookout for other persons to warn of the approach of police officers and soliciting, encouraging, employing or offering payment to others to do the same;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(s) Climbing any tree, wall, or fence, or passing through any wall or fence by using tunnels or other holes in such structures;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(t) Littering in any public place or place open to public view;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(u) Urinating or defecating in any public place or place open to public view;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(v) Using words, phrases, physical gestures, or symbols commonly known as hand signs or engaging in other forms of communication which describe or refer to the gang known as 'VST' or 'VSL' . . . as described in this Complaint or any of the accompanying pleadings or declarations;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(w) Wearing clothing which bears the name or letters of the gang known as 'VST' or 'VSL';\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"(x) Making, causing, or encouraging others to make loud noise of any kind, including but not limited to yelling and loud music at any time of the day or night.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 Thus, as it indicated in written and oral argument, the City did not challenge the Court of Appeal's determination that the following conduct, inter alia, was improperly enjoined: possession or use in Rocksprings of such everyday items as beepers, pens, spray paint cans, nails, screwdrivers, or any \"sharp objects capable of defacing private or public property\"; \"encouraging\" or \"participating\" in the use or possession of narcotics; \"engaging in conversation, or otherwise communicating with the occupants of any vehicle\"; using communicative hand signs or signals describing or referring to the gangs; wearing clothing bearing the name or letters associated with the gangs; climbing trees or walls or \"passing through\" fences. The City impliedly concedes that the Court of Appeal correctly struck these provisions of the injunction as enjoining more conduct than was necessary to abate the nuisance and on constitutional grounds.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. \"[The] issue can arise, for example, when it is contended that an ordinance or statute is unconstitutional on its face and that no factual controversy remains to be tried. If such a question of pure law is presented, it can sometimes be determinative over the other factor, for example, when the defendant shows that the plaintiff's interpretation is wrong as a matter of law and thus the plaintiff has no possibility of success on the merits. [Citations.] Even where the question of law is not entirely determinative, it may be appropriate for the appellate court to express its opinion in order to clarify or narrow the issues for trial.\" ( Hunter v. City of Whittier, (supra) , 209 Cal. App. 3d at pp. 595-596; see, e.g., Cohen v. Board of Supervisors (1985) 40 Cal. 3d 277, 287-290 [219 Cal. Rptr. 467, 707 P.2d 840].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Defendants contend that de novo review of the entire record is required because the superior court's order affects their First Amendment rights. (See Hurley v. Irish-American Gay Group of Boston (1995) 515 U.S. 557, [115 S. Ct. 2338, 2344, 132 L. Ed. 2d 487].) As Hurley explains, however, \"[t]he 'requirement of independent appellate review . . . is a rule of federal constitutional law,' . . . which generally requires us to 'review the finding of facts by a State court . . . where a Conclusion of law as to a Federal right and a finding of fact are so intermingled as to make it necessary, in order to pass upon the Federal question, to analyze the facts, . . .' \" (Ibid., italics added.) That is not the case here; as will appear, our inquiry is limited to the facial validity of certain provisions of the injunction under the United States Constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Defendants concede that the City did not purport to seek injunctive relief under the STEP Act, but invoked the general public nuisance provisions; they argue, however, that the superior court erroneously purported to rely on the provision. We will uphold a judgment if it is correct for any reason \" 'regardless of the correctness of [its] grounds . . . .' 'It is judicial action and not judicial reasoning which is the subject of review . . . .' \" ( United Pacific Ins. Co. v. Hanover Ins. Co. (1990) 217 Cal. App. 3d 925, 933 [266 Cal. Rptr. 231], fn. omitted.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. That both criminal and noncriminal conduct can be enjoined as a public nuisance is clear under our statutory and case law. (See, e.g., Civ. Code, § 3369 [\"Neither specific nor preventive relief can be granted . . . to enforce a penal law, except in a case of nuisance or as otherwise provided by law.\"]; Pen. Code, § 186.20 et seq. [STEP Act]; id., § 11225 et seq. [Red Light Abatement Law]; People ex rel. Busch v. Projection Room Theater (1976) 17 Cal. 3d 42, 49, 53 [130 Cal. Rptr. 328, 550 P.2d 600] [exhibition of obscene books]; Nathan H. Schur, Inc. v. City of Santa Monica, (supra) , 47 Cal. 2d at pp. 18-19 [\" 'Conduct against which injunctions are sought in behalf of the public is frequently criminal in nature. . . . [That] will not prevent the intervention of equity where a clear case justifying equitable relief is present . . . .' \"]; People v. Lim, (supra) , 18 Cal. 2d 872 [gambling house]; Newhall Land \u0026 Farming Co. v. Superior Court (1993) 19 Cal. App. 4th 334, 341 [23 Cal. Rptr. 2d 377] [pollution of water]; Hayman v. Block (1986) 176 Cal. App. 3d 629, 644 [222 Cal. Rptr. 293] [blocking right of way]; People v. Mason (1981) 124 Cal. App. 3d 348, 353 [177 Cal. Rptr. 284] [noise emanating from bar and restaurant]; Vedder v. County of Imperial (1974) 36 Cal. App. 3d 654, 661 [111 Cal. Rptr. 728] [fire hazard].) The City contends that the Court of Appeal's decision \"relied substantially upon the premise that courts can enjoin only criminal, as opposed to noncriminal, conduct as a public nuisance.\" Not so. The Court of Appeal did not apply any such general rule; it merely concluded that the specific noncriminal conduct included within the superior court's order could not be appropriately enjoined under general public nuisance statutes. It did err, however, to the extent it held that all criminal conduct constitutes a public nuisance. Even if it were correct that, as it states, \" '[a] public nuisance is always a criminal offense,' \" (italics added) the inverse is not true. (See Pen. Code, § 370; Rest.2d Torts, § 821B, com. d, p. 89.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. As one court has observed: \"The right to walk the streets, or to meet publicly with one's friends for a noble purpose or for no purpose at all--and to do so whenever one pleases--is an integral component of life in a free and ordered society. [Citations.] This right is rooted in the First Amendment's protection of freedom of expression and association, as well as . . . the Fifth Amendment's protection of fundamental liberty interests under the doctrine of substantive due process.\" ( Waters v. Barry (D.D.C. 1989) 711 F. Supp. 1125, 1134; see also Kolender v. Lawson (1983) 461 U.S. 352, 358 [103 S. Ct. 1855, 1859, 75 L. Ed. 2d 903] [law prohibiting wandering the streets at night without identification implicated \"consideration of the constitutional right to freedom of movement\"].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In paraphrasing paragraph (k), the majority repeatedly mischaracterize it as only forbidding defendants from intimidating or otherwise challenging Rocksprings residents or other persons who gang members know have complained about their conduct within the neighborhood. It is not so limited. Rather, it expressly prohibits threatening, intimidating, harassing, or assaulting any Rocksprings resident for any reason.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Use of the word \"gang\" has a tendency to strike fear in the hearts of countless persons. The trial court and now a majority of this court have succumbed to that somewhat irrational fear. The Court of Appeal is to be commended for looking at the issue dispassionately and objectively. Some of these defendants have not been convicted of, or even charged with, any crime. Yet they are, under the injunction, deprived of a number of personal rights generally reserved to all free citizens--including the right to walk or drive through the Rocksprings neighborhood with a \"known\" gang member even for an innocent purpose.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Thus, Jorge Gonzalez was stopped in connection with a gang-related disturbance in Rocksprings and admitted to police officers that he was a gang member; he was also found in possession of cocaine and marijuana after his car was stopped by a police officer near Rocksprings; Eberardo Cervantes was observed selling illegal drugs in Rocksprings and prosecuted for possession for sale and sale of marijuana and cocaine; Miguel Lopez was observed selling narcotics in Rocksprings and was found to be in possession of marijuana. The question whether the superior court erred in naming five other defendants, Carlos Acuna, Jose Bravo, Hassan Martin Davila, Juan Pineda Hernandez, Flavio Quinonez, is not before us; it was neither ruled on by the Court of Appeal nor raised in the petitions for review.\u003c/span\u003e\n\n",
    "body_length": 144752,
    "citedas": [
      "14 Cal.4th 1090",
      "929 P.2d 596",
      "60 Cal.Rptr.2d 277"
    ],
    "attorneys": "Amitai Schwartz, Antonio Ponvert III, Sara T. Campos, Edward M. Chen, Alan L. Schlosser, Daniel M. Mayfield, Patricia Price, Amanda Wilson, Siner, Steinbock, Hofman \u0026 Pennypacker and Stuart D. Kirchick for Defendants and Appellants. Heller, Ehrman, White \u0026 McAuliffe, Sergio Garcia-Rodriguez and Joyce M. Cartun as Amici Curiae on behalf of Defendants and Appellants. Joan R. Gallo, City Attorney, George Rios, Assistant City Attorney, Carol C. Weinstein and Glenn D. Schwarzbach, Deputy City Attorneys, for Plaintiff and Respondent. James K. Hahn, City Attorney Los Angeles, Debbie Lew and Candice I. Horikawa, Deputy City Attorneys, George W. Kennedy, District Attorney Santa Clara, Dale R. Sanderson, Deputy District Attorney, Gil Garcetti, District Attorney Los Angeles, George M. Palmer, Brent Riggs and Deanne B. Ancker, Deputy District Attorneys, Berliner Cohen, Frank R. Ubhaus, Stacy L. Saetta, Robert Teir, Kent S. Scheidegger, Stephanie J. Finelli, Daniel J. Popeo, David A. Price, Sweeney, Mason \u0026 Wilson and Roger Mason as Amici Curiae on behalf of Plaintiff and Respondent.",
    "category": [
      "36",
      "75"
    ],
    "judges": "Opinion by Brown, J., with George, C. J., Baxter, and Werdegar, JJ., Concurring. Concurring and Dissenting opinions by Kennard, J., and by Chin, J. Dissenting opinion by Mosk, J.",
    "citation_count": 332
  }
}
