{
  "id": "J4HvPWYBTlTomsSBhmUk",
  "document": {
    "title": "Watson v. Paul Sims Rare Coin \u0026 Precious Metals Brokers",
    "full_title": "IN RE TMI LITIGATION CASES CONSOLIDATED II; BRANNON, JAMES T., ET AL, v. BABCOCK \u0026 WILCOX COMPANY, INC., ET AL.; GENERAL PUBLIC UTILITIES CORPORATION, METROPOLITAN EDISON COMPANY, NEW JERSEY CENTRAL POWER \u0026 LIGHT COMPANY, PENNSYLVANIA ELECTRIC COMPANY, BABCOCK \u0026 WILCOX COMPANY, MCDERMOTT INCORPORATED, U.E. \u0026 C.- CATALYTIC, AND BURNS \u0026 ROE ENTERPRISES, INC., DRESSER INDUSTRIES IN NOS. 90-5312 AND 90-5672; ANDREA LEWINTER, PERSONAL REPRESENTATIVE OF THE ESTATE OF MARK LEWINTER; V. GENERAL PUBLIC UTILITIES CORP.; METROPOLITAN EDISON COMPANY; JERSEY CENTRAL POWER \u0026 LIGHT CO.; PENNSYLVANIA ELECTRIC COMPANY; BABCOCK \u0026 WILCOX COMPANY; J. RAY MCDERMOTT \u0026 COMPANY; CATALYTIC, INC.; AND BURNS \u0026 ROE, INC.; GENERAL PUBLIC UTILITIES CORPORATION, METROPOLITAN EDISON COMPANY, NEW JERSEY CENTRAL POWER \u0026 LIGHT COMPANY, PENNSYLVANIA ELECTRIC COMPANY, BABCOCK \u0026 WILCOX COMPANY, MCDERMOTT INCORPORATED, BURNS \u0026 ROE ENTERPRISES, INC., AND U.E. \u0026 C.- CATALYTIC IN NO. 90-5313; PERRI C. KIICK; AND EDWARD KIICK, HUSBAND AND WIFE V. METROPOLITAN EDISON CO.; GENERAL PUBLIC UTILITIES CORP.; AND BABCOCK AND WILCOX COMPANY; GENERAL PUBLIC UTILITIES CORP., METROPOLITAN EDISON COMPANY, AND BABCOCK \u0026 WILCOX COMPANY IN NO. 90-5314; JOHN W. GUMBY, SR. V. GENERAL PUBLIC UTILITIES CORP.; METROPOLITAN EDISON COMPANY; JERSEY CENTRAL POWER \u0026 LIGHT CO.; PENNSYLVANIA ELECTRIC COMPANY; BABCOCK \u0026 WILCOX COMPANY; J. RAY MCDERMOTT \u0026 COMPANY; CATALYTIC, INC., BURNS \u0026 ROE ENTERPRISES, INC.; GENERAL PUBLIC UTILITIES CORPORATION, METROPOLITAN EDISON COMPANY, NEW JERSEY CENTRAL POWER \u0026 LIGHT COMPANY, PENNSYLVANIA ELECTRIC COMPANY, BABCOCK \u0026 WILCOX COMPANY, MCDERMOTT INCORPORATED, BURNS \u0026 ROE ENTERPRISES, INC., AND U.E. \u0026 C.-CATALYTIC IN NO. 90-5315; HARRY MONTVILLE; VIRGINIA MONTVILLE, IN THEIR OWN RIGHT AND AS PARENTS AND NATURAL GUARDIANS OF ; DANIEL ALLEN MONTVILLE V. GENERAL PUBLIC UTILITIES CORP.; METROPOLITAN EDISON COMPANY; JERSEY CENTRAL POWER \u0026 LIGHT CO.; PENNSYLVANIA ELECTRIC COMPANY; BABCOCK \u0026 WILCOX COMPANY; J. RAY MCDERMOTT \u0026 COMPANY; CATALYTIC, INC., BURNS \u0026 ROE ENTERPRISES, INC.; GENERAL PUBLIC UTILITIES CORPORATION, METROPOLITAN EDISON COMPANY, NEW JERSEY CENTRAL POWER \u0026 LIGHT COMPANY, PENNSYLVANIA ELECTRIC COMPANY, BABCOCK \u0026 WILCOX COMPANY, MCDERMOTT INCORPORATED, BURNS \u0026 ROE ENTERPRISES, INC., AND U.E. \u0026 C.-CATALYTIC IN NO. 90-5316; JOHN B. ROCHE, III; NANCY ELAINE ROCHE; ERIN KATHLEEN MILLER; TIMOTHY MILLER; CATHY DAUGHERTY; KIM DAUGHERTY; RACHEL L. STAUFFER; NED E. GROVE, INDIVIDUALLY AND AS PERSONAL REPRESENTATIVE OF THE ESTATE OF SYLVIA K. GROVE, DECEASED; ROBERT L. CASSELL, SR.; PATRICIA A. CASSELL; PAUL D. WALTERICK; LINDA D. WALTERICK, INDIVIDUALLY AND ON BEHALF OF THEIR MINOR CHILD, PAUL D. WALTERICK, JR., PAUL M. WALTERICK; HELEN G. WALTERICK; JENNIFER M. WALTERICK V. GENERAL PUBLIC UTILITIES CORP.; U.E. \u0026 C. CATALYTIC CORPORATION; METROPOLITAN EDISON COMPANY; JERSEY CENTRAL POWER \u0026 LIGHT CO.; PENNSYLVANIA ELECTRIC COMPANY; BABCOCK \u0026 WILCOX COMPANY; J. RAY MCDERMOTT \u0026 COMPANY; BURNS \u0026 ROE, INC.; GENERAL PUBLIC UTILITIES CORPORATION, METROPOLITAN EDISON COMPANY, NEW JERSEY CENTRAL POWER \u0026 LIGHT COMPANY, PENNSYLVANIA ELECTRIC COMPANY, BABCOCK \u0026 WILCOX COMPANY, MCDERMOTT INCORPORATED, BURNS \u0026 ROE ENTERPRISES, INC., AND U.E. \u0026 C.-CATALYTIC IN NO. 90-5317; MARGARET KRAFFT V. GENERAL PUBLIC UTILITIES CORP.; METROPOLITAN EDISON COMPANY; JERSEY CENTRAL POWER \u0026 LIGHT CO.; PENNSYLVANIA ELECTRIC COMPANY; BABCOCK \u0026 WILCOX CO.; J. RAY MCDERMOTT \u0026 COMPANY; CATALYTIC, INC., BURNS \u0026 ROE ENTERPRISES, INC.; GENERAL PUBLIC UTILITIES CORPORATION, METROPOLITAN EDISON COMPANY, NEW JERSEY CENTRAL POWER \u0026 LIGHT COMPANY, PENNSYLVANIA ELECTRIC COMPANY, BABCOCK \u0026 WILCOX COMPANY, MCDERMOTT INCORPORATED, BURNS \u0026 ROE ENTERPRISES, INC., AND U.E. \u0026 C.-CATALYTIC IN NO. 90-5318; IN RE TMI LITIGATION CASES CONSOLIDATED II; BRANNON, JAMES T., ET AL, V. BABCOCK \u0026 WILCOX COMPANY, INC., ET AL.; GENERAL PUBLIC UTILITIES CORP., METROPOLITAN EDISON COMPANY, NEW JERSEY CENTRAL POWER \u0026 LIGHT COMPANY, PENNSYLVANIA ELECTRIC COMPANY, BABCOCK \u0026 WILCOX COMPANY, MCDERMOTT INCORPORATED, U.E. \u0026 C.- CATALYTIC, AND BURNS \u0026 ROE ENTERPRISES, INC., DRESSER INDUSTRIES IN NOS. 90-5562; IN RE TMI LITIGATION CASES CONSOLIDATED II; BRANNON, JAMES T., ET AL., V. BABCOCK \u0026 WILCOX COMPANY, INC., ET AL.; UNITED STATES OF AMERICA -INTERVENOR IN NOS. 90-5671 AND 90-5673",
    "jurisdiction": "Third Circuit",
    "date": "1991-02-07T00:00:00.000Z",
    "docket": "Nos. 90-5312, 90-5313, 90-5314, 90-5315, 90-5316, 90-5317, 90-5318, 90-5562, 90-5671, 90-5672, 90-5673",
    "body": "Opinion OF THE COURT\n\nMANSMANN, Circuit Judge\n\nIn this matter growing out of the 1979 incident at the Three Mile Island nuclear facility near Harrisburg, Pennsylvania, we are asked once again to resolve a confrontation between an assertion of federal jurisdiction over public liability actions by defendants and a challenge to that jurisdiction by plaintiffs who wish to be in the state court system. We previously visited a similar issue in Kiick v. Metropolitan Edison Co., 784 F.2d 490 (3d Cir. 1986), and Stibitz v. General Pub. Util. Corp., 746 F.2d 993 (3d Cir. 1984), cert. denied, 469 U.S. 1214, 84 L. Ed. 2d 334, 105 S. Ct. 1187 (1985), and concluded there that Congress did not intend that there be a federal cause of action arising under the terms of the Price-Anderson Act (codified in scattered sections of 42 U.S.C.).\n\nOur focus here is on the constitutionality of the Price-Anderson Amendments Act of 1988, 42 U.S.C. § 2100 et seq. In the Amendments Act, Congress expressly created a federal cause of action for nuclear accident claims and is alleged to have worked major changes in the landscape of public liability law.\n\nSpecifically, our review centers upon a district court order remanding certain public liability actions to the state courts in which they were originally filed or in which they might have been filed. The district court concluded that it lacked federal subject matter jurisdiction over these claims and that remand was appropriate under the terms of 28 U.S.C. § 1447(c).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The district court reached this decision despite the fact that the Price-Anderson Amendments Act of 1988, which created the federal public liability action, specifies that the federal courts have original jurisdiction over these actions and that public liability actions filed in state courts, which have concurrent jurisdiction, are subject to removal upon the motion of a defendant, the Nuclear Regulatory Commission, or the Secretary of Health and Human Services, 42 U.S.C. § 2210(n)(2).\n\nThe district court's determination with respect to subject matter jurisdiction rested not on any failure to satisfy the jurisdictional requirements of the Amendments Act but upon the court's conclusion that the Amendments Act itself was unconstitutional. Underlying the remand order was the district court's holding that Congress, in purporting to create a federal forum for public liability actions through the Amendments Act, exceeded the authority granted to it by Article III, Section 2 of the United States Constitution.\n\nBecause it believed that its order granting the plaintiffs' motion to remand involved a \"controlling question of law as to which there is substantial ground for difference of opinion and that an immediate appeal from this order may materially advance the ultimate termination of the litigation,\" the district court stayed execution of the remand and certified for immediate appeal, pursuant to 28 U.S.C. § 1292(b), the following question:\n\nWhether Congress exceeded the scope of Article III, Section 2 of the United States Constitution by granting federal courts subject matter jurisdiction over public liability actions through the Price-Anderson Amendments Act of 1988.\n\nThe defendants, in an abundance of caution, filed petitions for permission to appeal, notices of appeal pursuant to 28 U.S.C. § 1291 and petitions for a writ of mandamus pursuant to 28 U.S.C. § 1651. The petitions for permission to appeal were granted and the appeals arising from these petitions were then consolidated with the direct appeals. (We refer to these consolidated matters as \"the appeal.\")\n\nThe procedural posture of this case raises a serious threshold question concerning our jurisdiction, under any of the three bases asserted, to hear this appeal. The district court's remand order, although it was stayed pending the outcome of this appeal, arguably implicates a statutory bar to our consideration of any aspect of the remand order, including the constitutional determination upon which it was based. 28 U.S.C. § 1447(d) provides that except for civil rights cases removed pursuant to 28 U.S.C. § 1443, \"an order remanding a case to the State court from which it was removed is not reviewable on appeal or otherwise . . . .\"\n\nBecause we are convinced that the bar of section 1447(d) was not intended to preclude appellate consideration of a section 1292(b) certified question concerning the constitutionality of an Act of Congress, (here, the Price-Anderson Amendments Act of 1988), we will address the merits of the question certified. We find that the grant of federal jurisdiction set forth in the Amendments Act does not transgress the limits of Article III, Section 2 of the United States Constitution, and thus we will vacate the order of the district court.\n\nI.\n\nThe procedural history of many of the public liability actions before us in this appeal has followed the course of a pendulum as statutory and constitutional interpretation has operated to move these actions back and forth between the state and the federal courts. We recount this history in detail since it bears directly on the jurisdictional issues to be resolved.\n\nThese eleven consolidated appeals have their origin in suits filed in the Pennsylvania state courts and in the Mississippi state and federal courts as a result of radiation leaks alleged to have occurred on March 28, 1979 at the Three Mile Island nuclear energy electric generating plant in Dauphin County, Pennsylvania. In these suits, approximately two thousand plaintiffs who resided near the Three Mile Island facility at the time of the incident allege clinical and subclinical conditions resulting from exposure to radiation released from the facility; numerous plaintiffs assert claims based on fear of the effects of radiation. Other claims, based upon loss of trade, were filed by seventy-two tourist-related businesses operating in nearby counties.\n\nThe defendants in these suits were, at the time of the Three Mile Island incident, the owners and operators of the nuclear facility, companies which had provided design, engineering or maintenance services, and those vendors of equipment or systems installed in the facility. The defendants deny that the March 28, 1979 release of radiation caused any harm.\n\nSome of the cases now pending were originally filed in the early 1980's in several Pennsylvania Courts of Common Pleas and state courts in Bergen County, New Jersey and Jackson County, Mississippi, and were removed by the defendants to the United States District Courts in Pennsylvania and in Mississippi. The defendants asserted as grounds for removal that the plaintiffs' claims arose under the Price-Anderson Act, Pub. L. No. 85-256, 71 Stat. 576 (1957) (codified as amended in various sections of 42 U.S.C.).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Following our rulings in Stibitz v. General Pub. Util. Corp., 746 F.2d 993, 997 (3d Cir. 1984), cert. denied, 469 U.S. 1214, 84 L. Ed. 2d 334, 105 S. Ct. 1187 (1985); and Kiick v. Metropolitan Edison Co., 784 F.2d 490, 493 (3d Cir. 1986), that the Price-Anderson Act created no federal tort cause of action and was not intended to confer jurisdiction upon the federal courts, the actions originally filed in the state courts were remanded and those few which had been brought originally in the federal court were transferred to the state courts via state law procedure. New claims arising out of the same incident continued to be filed in the state courts.\n\nIn August of 1988, Congress enacted the Price-Anderson Amendments Act of 1988, Pub. L. No. 100-408, 102 Stat. 1066 (1988). By this Act, Congress expressly created a federal cause of action for \"public liability actions\" which were defined as \"any suit asserting public liability.\" 42 U.S.C. § 2014(hh).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The Amendments also provided, in 42 U.S.C. § 2014(hh), that public liability actions shall be deemed to arise under the Price-Anderson Act. Thus the federal courts were granted original jurisdiction over these actions; any public liability actions pending or filed in the state courts were subject to removal. 28 U.S.C. § 2210(n)(2).\n\nFollowing enactment of the Amendments Act on August 20, 1988, the defendants removed the actions underlying these appeals to the United States District Court for the Middle District of Pennsylvania. On October 7, 1988, the plaintiffs filed a petition seeking to have the removed actions remanded to the state courts on the ground that Congress lacked authority to create a federal forum for public liability actions inasmuch as these actions, despite Congress' explicit statement to the contrary, did not \"arise under\" federal law. The defendants opposed this petition; the United States government intervened in the proceedings pursuant to 28 U.S.C. § 2403 and also opposed the petition.\n\nOn March 16, 1990, the district court granted the petition for remand. Holding that Congress' grant of federal jurisdiction over public liability actions would require that the federal courts apply the same law which a state court would have applied in an action under state common law, the district court concluded that the Amendments Act accomplished only the creation of a federal forum for the public liability actions. In the district court's view, the Amendments Act did not change the fact that the plaintiffs' rights arose under state law rather than under the federal statute. Because it did not believe that the Amendments Act's grant of federal jurisdiction over public liability actions could withstand constitutional attack, the district court concluded that it lacked subject matter jurisdiction over the plaintiffs' claims and was required to remand the actions to the state courts pursuant to 28 U.S.C. § 1447(c). In so holding, the district court recognized that there was a substantial ground for difference of opinion regarding the constitutionality of the Amendments. The district court, therefore, certified the constitutional question for immediate appeal pursuant to 28 U.S.C. § 1292(b).\n\nThe United States and the defendants filed timely petitions for permission to appeal. The plaintiffs and the United States filed motions for partial reconsideration and for reconsideration, respectively. The defendants also filed a notice and an amended notice of appeal.\n\nBy order entered June 14, 1990, the district court denied the plaintiffs' motion for partial reconsideration and the motion filed by the United States for reconsideration. All of the defendants filed timely notices of appeal from the district court orders filed June 14, 1990 and March 16, 1990. Petitions for a Writ of Mandamus were also filed. On July 12, 1990, we granted the petitions for permission to appeal, consolidating the permissive appeals with the direct appeals.\n\nII.\n\nA.\n\nThe threshold question before us is whether we have jurisdiction to consider any aspect of the district court order in view of the bar to appellate review of remand orders set forth in 28 U.S.C. § 1447(d). The jurisdictional issue is substantial and has been ably briefed and argued. Our task is to determine whether Congress intended to insulate from review those remand orders which rest on the district court's finding that it lacks subject matter jurisdiction because the statute containing the grant of federal jurisdiction is, itself, unconstitutional.\n\nThe defendants argue that there are three separate bases upon which we might rely in order to review the district court order. The first involves the permissive appeal provisions of 28 U.S.C. § 1292(b). The defendants also assert that the district court order is final within the meaning of the collateral order exception to 28 U.S.C. § 1291 and contend that the district court order is properly reviewable pursuant to a writ of mandamus authorized by 28 U.S.C. § 1651.\n\nThe plaintiffs respond with a number of conclusions respecting our jurisdiction, all centering on 28 U.S.C. § 1447(d): 28 U.S.C. § 1447(d) bars this court from hearing an appeal by permission under 28 U.S.C. § 1292(b) from a district court decision holding the Price-Anderson Act Amendments of 1988 to be unconstitutional; 28 U.S.C. § 1447(d) prohibits this court's review of a direct appeal; and issuance of a writ of mandamus, pursuant to 28 U.S.C. § 1651, is also barred by 28 U.S.C. § 1447(d).\n\nAlthough we have been invited to bypass direct consideration of the reach of the section 1447(d) bar,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e we are convinced that this case requires head-on confrontation. We turn, therefore, to the language and history of section 1447(d).\n\nB.\n\nSection 1447(d) states clearly that, except for civil rights cases removed pursuant to 28 U.S.C. § 1443, \"an order remanding a case to the State court from which it was removed is not reviewable on appeal or otherwise. . . .\" This statutory bar to appellate review of remand orders was first codified in Section 2 of the Judiciary Act of March 3, 1887 (24 Stat. 552, reenacted to correct errors in enrollment, August 13, 1988, 25 Stat. 443):\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nWhenever any cause shall be removed from any state court into any circuit court of the United States, and the circuit court shall decide that the cause was improperly removed, and order the same to be remanded to the State court from whence it came, such remand shall be immediately carried into execution, and no appeal or writ of error from the decision of the circuit court remanding such cause shall be allowed.\n\nSection 2 was reenacted in the Judicial Code of 1911, 36 Stat. 1094 as 28 U.S.C. § 71. \"These provisions for the disposition of removed cases where jurisdiction was lacking or removal was otherwise improper, together with the prohibition of appellate review . . . endured until 1948 when 28 U.S.C. § 1447 was enacted -- minus, however, the prohibition against appellate review. The omission was corrected in 1949 when the predecessor of the present subsection (d) came into being.\" Thermtron Prod., Inc. v. Hermansdorfer, 423 U.S. 336, 347-48, 46 L. Ed. 2d 542, 96 S. Ct. 584 (1976) (footnotes omitted). As adopted in 1948, and amended in 1964, section 1447(c) provided, in pertinent part, that:\n\nIf at any time before final judgment it appears that the case was removed improvidently and without jurisdiction, the district court shall remand the case, and may order the payment of just costs.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nAs amended in 1949, 28 U.S.C. § 1447(d) read, \"An order remanding a case to the State court from which it was removed is not reviewable on appeal or otherwise. . . .\" \"This subsection took its present form in 1964, when Congress amended the subsection to provide for review of cases removed pursuant to 28 U.S.C. § 1443.\" Thermtron, 423 U.S. at 348 n.13.\n\nWith the brief exception, then, of the period between 1875 and 1887, Congress, by adopting section 1447(d) and its statutory predecessors, \"established the policy of not permitting interruption of the litigation of the merits of a removed cause by prolonged litigation of questions of jurisdiction of the district court to which the cause is removed. This was accomplished by denying any form of review of an order of remand, and, before final judgment, of an order denying remand.\" United States v. Rice, 327 U.S. at 751. One commentator describes the policy underlying section 1447(d) as \"[Congress'] . . . explicit legislative choice . . . that avoiding delay in court proceedings caused by lengthy appellate review of remand decisions merits sacrificing appellate review to correct occasional errors in remand orders.\" Herrmann, Thermtron Revisited: When and How Federal Trial Court Remand Orders are Reviewable, 19 Arizona St. L. J. 395, 413 (1987-88) (footnote omitted) (hereinafter \"Herrmann\").\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e In furtherance of this policy, section 1447(a) was interpreted, until 1976, to preclude review of all remand orders, regardless of the reasons underlying the decision to remand.\n\nC.\n\nIn 1976, the Supreme Court decided Thermtron Prod., Inc. v. Hermansdorfer, 423 U.S. at 336. There, Kentucky residents filed a personal injury action against Indiana residents in a Kentucky state court. The action was removed to the United States District Court pursuant to 28 U.S.C. §§ 1441 and 1446. The district court reviewed the crowded state of its docket and held that although the plaintiffs had the statutory right to litigate their claims in the federal court, that right had to be \"balanced against the plaintiffs' right to a forum of their choice and their right to a speedy decision on the merits of their cause of action.\" Id. at 340. Because it concluded that the matter could be brought to more efficient resolution in the state courts and that the petitioners had failed to demonstrate that they would be prejudiced by having their case heard in that forum, the district court ordered the matter remanded. The plaintiffs sought a writ of mandamus or prohibition compelling the district court to exercise jurisdiction over the properly-removed action. The Court of Appeals for the Sixth Circuit denied the petition, relying on the statutory bar to review set forth in section 1447(d).\n\nReversing, the Supreme Court clarified that the section 1447(d) bar operates to preclude review of only those remand orders issued pursuant to section 1447(c). The Court held that these sections must be construed together and that \"only remand orders issued under § 1447(c) and invoking the grounds specified therein . . . are immune from review under § 1447(d).\" Thermtron, 423 U.S. at 346. The district court in Thermtron had questioned neither the propriety of the removal nor the jurisdiction of the federal court; the terms of section 1447(c) were not mentioned in the remand order and could not have been applicable. Recognizing that it was creating an exception to what had been interpreted as an absolute bar to review, the Court wrote:\n\nThere is no doubt that in order to prevent delay in the trial of remanded cases by protracted litigation of jurisdictional issues, . . . Congress immunized from all forms of appellate review any remand order issued on the grounds specified in § 1447(c), whether or not that order might be deemed erroneous by an appellate court. But we are not convinced that Congress ever intended to extend carte blanche authority to the district courts to revise the federal statutes governing removal by remanding cases on grounds that seem justifiable to them but which are not recognized by the controlling statute . . . . Because the District Judge remanded a properly removed case on grounds that he had no authority to consider, he exceeded his statutorily defined power; and issuance of the writ of mandamus was not barred by § 1447(d).\n\nId. at 351. Mandamus was held to be \"an appropriate remedy to require the District Court to entertain the remanded action.\" Id. at 352.\n\nAlthough the rule that most remand orders are not subject to review remains, Thermtron made clear that the seemingly unequivocal language of section 1447(d), may, in extraordinary circumstances, give way to permit appellate consideration of certain categories of remand orders. Mandamus has been invoked in a number of cases since Thermtron to require federal courts to adjudicate claims not remanded on jurisdictional grounds. See, e.g., Air-Shields, Inc. v. Fullam, 891 F.2d 63 (3d Cir. 1989) (petition for writ of mandamus was granted directing directing the court to vacate a remand order based upon procedural defects not contemplated by section 1447(c)); and Nasuti v. Scannell, 906 F.2d 802 (1st Cir. 1990) (review by mandamus was appropriate where the district court's remand order lacked statutory basis and was clearly contrary to congressional policy as expressed in the Westfall Act).\n\nAnother detour around the absolute bar of section 1447(d) has been fashioned by the Court of Appeals for the Ninth Circuit in Pelleport Investors, Inc. v. Budco Quality Theatres, Inc., 741 F.2d 273 (9th Cir. 1984), and The Clorox Co. v. United States District Court, 756 F.2d 699 (9th Cir.), rev'd on reh'g, 779 F.2d 517 (9th Cir. 1985).\n\nIn Pelleport the plaintiff sued in a California state court for the recovery of rental fees. The case was removed to the federal court on diversity grounds. The defendant filed a motion to remand the case to the state court, relying on a contractual forum selection clause. Although it found that diversity existed and that the federal court, therefore, had subject matter jurisdiction over the actions, the district court granted the motion for remand on the ground that the forum selection clause was valid and enforceable. The plaintiff appealed from the remand order and filed a petition for mandamus. The court of appeals addressed the applicability of section 1447(d), concluding that it did not operate to bar review of the remand order. Recognizing that the case did not fall within the narrow exception to section 1447(d) carved out by Thermtron, the court of appeals nonetheless determined that review was appropriate. Because the remand order at issue was mandated by a substantive decision on the merits apart from the jurisdictional determination, the court concluded that section 1447(d) did not apply. In reaching this result, the court relied on the Supreme Court's decision in Waco v. United States Fidelity \u0026 Guar. Co., 293 U.S. 140, 79 L. Ed. 244, 55 S. Ct. 6 (1934).\n\nWaco involved a Texas state court action which was removed to the federal court on diversity grounds by a third party defendant. When the district court dismissed the third party action, diversity was destroyed and the case was remanded to the state court. Holding that the dismissal of the third party action was not immune from review, the Supreme Court wrote:\n\nTrue, no appeal lies from the order of remand; but in logic and in fact the decree of dismissal preceded that of remand and was made by the District Court while it had control of the cause. Indisputably this order is the subject of an appeal; and, if not reversed or set aside, is conclusive upon the petitioner.\n\nWaco, 293 U.S. at 143.\n\nThe court of appeals in Pelleport read Waco as \"standing for the proposition that although the final determination that diversity is lacking is not reviewable, the earlier determination that a third party defendant must be dismissed from the action is.\" Pelleport, 741 F.2d at 277. Reasoning that the case before it also involved a substantive issue of contract law which preceded and formed the basis of the remand order, the court concluded that:\n\nLike the dismissal in Waco, the court's decision that the contract clause is enforceable, if not reversed or set aside, is conclusive upon [the defendant], and, therefore, must be reviewed. To hold otherwise would deprive [the defendant] of its right to appeal a substantive determination of contract law. We cannot believe that Congress intended to immunize such decisions from review.\n\nId.\n\nThe court also reviewed the strong policy underlying section 1447(d) but found that\n\nAny delay caused by an appeal of the contract issue is a delay that must be countenanced. To apply section 1447(d) to the district court's decision on the enforceability of the forum selection clause would extend the scope of section 1447(d) far beyond its intended parameters and would leave matters of substantive contract law unreviewable. We refuse to impute such an intent to Congress.\n\nId. Thus the district court's order was held to be reviewable as a collaterally final order within the meaning of 28 U.S.C. § 1291. Following review on the merits of the district court's forum selection ruling, the order remanding the case to the California state court was affirmed.\n\nAgain, in The Clorox Co. v. United States District Court, 779 F.2d at 517, the Court of Appeals for the Ninth Circuit held that an appeal would lie from a remand order which had been preceded by a substantive decision on the merits. In Clorox, the defendant employer had granted to its employees, via an employee benefits handbook, the right to file suit to recover benefits in either a state or federal court. When claims were filed in the state court, however, Clorox removed the actions to the federal court. The plaintiffs filed a motion for remand arguing that the handbook provision constituted a waiver of Clorox's removal rights. The district court accepted this argument and remanded the case pursuant to section 1447(c). While the court of appeals originally declined jurisdiction, holding that review of the remand order could be secured only through appeal rather than mandamus, on rehearing the court construed the petition for writ of mandamus as a notice of appeal and granted Clorox's request for relief. The court again addressed the reach of section 1447(d):\n\nWhen a district court's remand order is based on a resolution of the merits of some matter of substantive law \"apart from any jurisdictional decision,\" section 1447(d) does not foreclose appellate review of that decision.\n\nClorox, 779 F.2d at 520 (quoting Pelleport, 741 F.2d at 276-77). Concluding that the district court had remanded on the basis of Clorox's waiver of the right to remove and that a remand on this basis did not fall within the purview of section 1447(c), the court held that the remand order was appealable as a collateral final order pursuant to 28 U.S.C. § 1291.\n\nWhat has come to be known as the Clorox/Pelleport doctrine has been invoked in other cases to support the reviewability of remand orders in cases where the decision to remand was based on a prior determination of substantive law. See Foster v. Chesapeake Insurance Co., 933 F.2d 1207 (3d Cir. 1991) (order of remand based on contractual forum selection clause is not rendered unappealable by section 1447(d)); Regis Assoc. v. Rank Hotels (Management) Ltd., 894 F.2d 193, 194 (6th Cir. 1990) (remand order based on forum selection clause is reviewable on appeal because it is based upon a substantive decision on the merits of a collateral issue); In re Delta America Re Ins. Co., 900 F.2d 890, 892 (6th Cir. 1990) (same); and Karl Koch Erecting Co., Inc. v. New York Convention Center Dev. Corp., 838 F.2d 656, 658 (2d Cir. 1988) (same).\n\nD.\n\nWith the historical background of section 1447(d) and the caselaw interpreting and limiting the reach of that section in mind, we turn to the appeal now before us. This case, presenting as it does the question of whether section 1447(d) bars all review of a district court's determination that it lacks federal subject matter jurisdiction because the Price-Anderson Amendments Act of 1988 which explicitly authorize removal is unconstitutional, is unique. No case interpreting the reach of section 1447(d) has addressed the particular constitutional dilemma presented here.\n\nThe plaintiffs argue that the section 1447(d) bar absolutely prevents our reviewing the district court's conclusion that the Amendments Act is unconstitutional because, as a result of that ruling, the district court concluded that it lacked subject matter jurisdiction and ordered that the cases at issue be remanded to the state court. We cannot agree. We are convinced that in enacting section 1447(d), Congress did not intend to vest the district courts with the authority to make final determinations regarding the constitutionality of federal statutes. In thus contracting the reach of the section 1447(d) bar, we are acutely aware that we are charting virgin territory in that this case does not fall neatly into either of the previously recognized exceptions to the bar of section 1447(d).\n\nThe exception created in Thermtron permits review of those remand orders which do not rest upon the grounds specified in section 1447(c). Here the district court relied specifically on section 1447(c) in reaching the determination to remand and it would be impossible for us to deny the fact that the district court's conclusions of constitutional law ultimately implicated subject matter jurisdiction.\n\nThe Pelleport/Clorox exception to the section 1447(d) bar developed by the Ninth Circuit also fails to address directly the issue posed here. The Pelleport/Clorox line of cases have allowed appeal from an order of remand where that order was preceded by a substantive decision on the merits apart from any jurisdictional issue. This doctrine is superficially attractive but we do not believe that we can analyze this case solely by reference to it. In each of the cases applying the Pelleport/Clorox doctrine, there was an undisputed statutory basis for federal jurisdiction; there was no question that the federal courts had jurisdiction to hear the types of case presented. One of the parties in each of these cases, however, argued that provisions of a contractual nature, e.g., a forum selection clause or a statement in an employment benefits plan, operated to place the litigation properly in the state courts. It was the resolution of these underlying substantive issues, rather than of basic jurisdictional issues, which supported remand in Pelleport and Clorox. The basis for subject matter jurisdiction was unaffected.\n\nWhile the district court's decision in this case that the Amendments Act was unconstitutional was a substantive decision preceding the remand order, the heart of this decision was jurisdictional; unless the statute were found to be constitutional, there could be no federal subject matter jurisdiction. Despite its magnitude, we cannot say that the district court's constitutionality ruling was a \"substantive decision on the merits apart from any jurisdictional decision\" within the meaning of Pelleport and its progeny. Pelleport, 741 F.2d at 276 (emphasis added). We conclude nonetheless that the seeds for appropriate resolution of this matter were sown in Thermtron and in the reasoning underlying the Pelleport/Clorox doctrine.\n\nWe reiterate Thermtron's admonition that section 1447(d), in and of itself, is not dispositive of all remand issues and should be interpreted to bar review of only those remand orders which are jurisdictional in nature. Under the terms of section 1447(c), a removal which is made without jurisdiction has been consistently interpreted to mean one not authorized by Congress. Congress \"made the district courts the final arbiters of whether Congress intended that specific actions were to be tried in a federal court.\" Thermtron, 423 U.S. at 355 (Rehnquist, J., dissenting) (latter emphasis added). The Court of Appeals for the Seventh Circuit in Rothner v. City of Chicago, 879 F.2d 1402, 1408 (7th Cir. 1989), clarified the scope of the jurisdictional determination when it wrote: \"The Thermtron Court strongly indicated that it viewed the phrase 'improvidently and without jurisdiction' to mean noncompliance with the procedural and jurisdictional requirements stated by Congress.\" (Emphasis in original.)\n\nThe jurisdictional issues most often resolved by decisions to remand thus involve \"the presence or absence of diversity of citizenship or a 'case arising' [and] are threshold questions that can generally be readily resolved by reference to a well-established body of law.\" Herrmann, supra, at 414. See also Hansen v. Blue Cross of California, 891 F.2d 1384, 1388 (9th Cir. 1989) (in deciding whether subject matter jurisdiction exists, district court reaches conclusions concerning the presence of diversity or a federal question). While not every federal subject matter jurisdictional issue is easily resolved, the fact that the same types of issue arise repeatedly results in a fairly well-developed body of governing law. Herrmann, supra at 414-15 n.110.\n\nThe Thermtron holding that section 1447(d) bars review only of remand orders issued pursuant to 1447(c) thus has beneficial consequences. It respects Congress' decision to avoid the delay that would be caused by the bulk of remand orders, but restricts that limitation to the category of cases where review is least necessary.\n\nId. at 415.\n\nThe district court's ruling holding the Amendments Act to be unconstitutional, despite its jurisdictional component, is not the type of determination routinely and regularly made pursuant to section 1447(c). The district court's decision that it lacked subject matter jurisdiction did not in any way involve a determination that Congress did not intend to confer federal jurisdiction over public liability actions nor did it result from the conclusion that there had been a failure to satisfy the procedural requirements of the Amendments Act or any of the general removal provisions. It could not be clearer that Congress intended that there be federal jurisdiction over claims removed pursuant to the Amendments Act; the statutory language is explicit.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Furthermore, it is undisputed that the actions at issue fall within the statutory terms of the Amendments Act and were properly removed. The district court's conclusion that it lacked subject matter jurisdiction over the removed claims rested solely on its determination that Congress exceeded its constitutional authority in enacting the Amendments Act.\n\nThe plaintiffs characterize this constitutional ruling and the resulting remand as purely jurisdictional in nature and argue that the bar of section 1447(d) absolutely prevents our review of the district court's ruling with respect to the constitutionality of the Amendments Act. \"No merits issues . . . occurred below. In fact, the lower court only made a jurisdictional determination and found it lacks subject matter jurisdiction.\" We do not believe that the section 1447(d) question is as easily resolved as the plaintiffs -- indeed, all of the parties -- might wish.\n\nWhile we recognize that the district court's ruling on the constitutionality of the Amendments Act has obvious consequences for federal jurisdiction and, unlike the rulings prior to remand in the Pelleport/Clorox cases, may be said to have a truly jurisdictional component, we cannot conclude that, in the situation presented here, Congress intended that section 1447(d) operate to prevent appellate review of the district court order. We are confident that the jurisdictional determination of the district court, resting as it did upon the conclusion that the entire statutory scheme authorizing removal is unconstitutional, was not the type of federal subject matter jurisdictional decision intended to be governed by the terms of or the policy underlying section 1147(c). Section 1447(d), therefore, has no application. In order to fall within sections 1447(c) and 1447(d), a remand order must be based upon a finding that removal was not authorized by Congress.\n\nIn analyzing the scope of the determinations to be made under section 1447(c) and the resultant applicability of the section 1447(d) bar to review, we begin with the Supreme Court's axiom reiterated in Webster v. Doe, 486 U.S. 592, 603, 100 L. Ed. 2d 632, 108 S. Ct. 2047 (1988), that congressional intent to bar judicial review of a constitutional claim must be clearly expressed, and with our own holding in Pacor, Inc. v. Higgins, 743 F.2d at 992, that courts will not impose restrictions on access to appellate review unless Congress has expressed that intent by clear and convincing evidence. We do not find clearly expressed congressional intent which would preclude review in the circumstances presented here. To hold otherwise would require that we reach a result wholly at odds with the policy underlying section 1447(d) and with the established general principles applicable to appellate review of constitutional questions.\n\nReading the finding of subject matter jurisdiction required under section 1447(c) so broadly as to encompass a district court's determination that a statute authorizing removal is itself unconstitutional would produce an unacceptable and unintended shift in the allocation of judicial power between federal and state courts. Because remand orders premised upon section 1447(c) are absolutely unreviewable, on appeal or otherwise, a district court's constitutional determination, if couched in terms of section 1447(c) and followed by a remand order, could never be reviewed. Remand orders which are unreviewable under section 1447(d) remain unreviewable even on appeal from the final judgment of a state court. In Metropolitan Casualty Ins. Co. v. Stevens, 312 U.S. 563, 568-69, 85 L. Ed. 1044, 61 S. Ct. 715 (1941), the Supreme Court wrote that\n\nThe issue of removability is closed if the federal district court refuses to assume jurisdiction and remands the cause. Section 28 of the Judicial Code [now section 1447] precludes review of the remand order directly or indirectly after final judgment in the highest court of the state in which decision could be had. . . .\n\n(Citations omitted.) In United States v. Rice, 327 U.S. at 751, the Supreme Court reiterated the nonreviewability of orders of remand falling within section 1447(c):\n\nCongress . . . established the policy of not permitting interruption of the litigation of the merits of a removed cause by prolonged litigation of questions of jurisdiction of the district court to which the cause is removed. This was accomplished by denying any form of review of an order of remand, and, before final judgment, of an order denying remand.\n\n(Emphasis added.) Those state cases addressing the reviewability of remand orders have reached a similar conclusion. See Ramahi v. Hobart Corp., 47 Ore. App. 607, 614, 615 P.2d 348, 352 n.7 (1980) (citing absolute bar of section 1447(d)); Johnson Publishing Co. v. Davis, 271 Ala. 474, 493, 124 So. 2d 441, 456 (1960) (\"appellant now seeks to have this court do what a federal appellate court, including the Supreme Court of the United States, is powerless to do, namely, review the order of remandment\"); Wewoka Petroleum Corp. v. Gilmore, 319 P.2d 285 (Okla. 1957) (order of remand for lack of diversity is not reviewable on appeal).\n\nTo read sections 1447(c) and 1447(d) as applying to jurisdictional determinations based upon the constitutionality of a statute authorizing removal would vastly expand the holding in Thermtron. While the Court in Thermtron made it clear that \"the district courts [are] the final arbiters of whether Congress intended that specific actions were to be tried in a federal court,\" the reading which the plaintiffs give to the sections in question would make district courts the final arbiters of the constitutionality of federal statutes. Thermtron, 423 U.S. at 355. (Emphasis in original).\n\nIf we interpret constitutionality rulings as falling within the subject matter jurisdictional determination to be made pursuant to section 1447(c), a district court order refusing remand and sustaining the constitutionality of the statute authorizing removal could be reviewed under 28 U.S.C. § 1291 or under the permissive appeal provisions of 28 U.S.C. § 1292(b). If, however, a district court were to find the statute authorizing removal to be unconstitutional and would enter an order of remand based upon lack of subject matter jurisdiction, its decision with regard to the constitutionality of a statute could never be reviewed. Each district court would thus be free to reach its own conclusions regarding the constitutionality of statutes authorizing removal. Thus inconsistent results would be completely insulated from review; the party asserting federal jurisdiction and defending the constitutionality of the statute would never be able to secure appellate review of a district court's determination of unconstitutionality.\n\nIt is inconceivable to us that Congress intended that a party be entitled to review of a district court's order remanding a case to the state courts on the ground that its own docket is overcrowded, or on the ground that a contractual provision is valid and enforceable, but be unable to challenge a district court ruling that the statute which specifically provides for federal jurisdiction is unconstitutional. Reading sections 1447(c) and 1447(d) so broadly as to mandate this result assaults the orderly review process of the federal courts which Congress established so long ago.\n\nIn support of this broad reading of the subject matter jurisdiction inquiry under section 1447(c), the plaintiffs cite as authority a single sentence from the two paragraph per curiam opinion in Richards v. Federated Dep't Stores, Inc., 812 F.2d 211 (5th Cir. 1987): \"The Thermtron court does not say that we cannot review orders purporting to remand on this basis on certain grounds, or for certain faults; for constitutional infirmities, but not for statutory ones; it says that we cannot review them at all.\" (Emphasis in original.) The Supreme Court in Thermtron, of course, did not address the question presented here and said nothing whatever concerning the application of the section 1447(d) bar to remand orders resting on constitutional determinations.\n\nThe recognized exceptions to section 1447(d) and the policy underlying that section establish that the subject matter jurisdictional inquiry contemplated by section 1447(c) is limited to the question of whether Congress intended that the types of actions at issue be subject to removal. The question before us is not whether Congress intended that public liability actions be subject to removal but whether the Constitution requires that the clear removal provisions in the Amendments Act be invalidated. To hold that district court decisions with respect to such questions are unreviewable would have serious jurisprudential consequences.\n\nShould we find, as the plaintiffs would have us do, that constitutional determinations of the type made here fall within the purview of sections 1447(c) and 1447(d), district courts facing difficult issues on which guidance might be critical could find themselves constrained to uphold the constitutionality of a federal statute in order to preserve the possibility of appellate review. Such extraneous considerations were never intended to influence judicial decisionmaking.\n\nThe district court in this case struggled with the section 1447(d) bar to appellate review and how the court might best position the issues to be decided in order to insure the availability of review. Noting that the Supreme Court had yet to address specifically the question of whether appellate review of remand orders issued pursuant to section 1447(c) could be obtained through certification under section 1292(b), the district court held that certification was warranted.\n\nPerhaps the most compelling [reason] for considering the issue at bar a controlling question of law is because the constitutionality of an Act of Congress is being challenged. The final determination on this issue will impact not only the parties in the instant cases but also the parties to any similar cases that may arise in the future. This jurisdictional issue requires more than a simple determination of whether public liability actions \"arise under\" the Act. See Herrmann, Thermtron Revisited: When and How Federal Trial Court Remand Orders are Reviewable. 19 Ariz. St. L.J., 395, 414 \u0026 n.10 (1987-88). Rather, it involves a determination as to whether the grant of \"arising under\" jurisdiction itself is constitutional. Certainly, the issue is \"serious to the conduct of the litigation, [both] practically [and] legally.\" Katz v. Carte Blanche Corp., 496 F.2d 747, 755 (3rd Cir. 1974).\n\nIn re TMI Coordinated Proceedings, 735 F. Supp. 640, 647 (M.D. Pa. 1990). Also important from our point of view is the district court's belief that:\n\nthere is a substantial ground for difference of opinion as to the correctness of its decision. The defendants and the United States presented strong and logical arguments for upholding the Act's jurisdictional grant. This court is not so bold as to state that its opinion on the constitutionality of an Act of Congress not previously reviewed by the courts is so plainly correct that it should not be reviewed by the appellate court.\n\nId. at 648.\n\nWe do not believe that Congress, in enacting sections 1447(c) and 1447(d), intended to leave the district court and the litigants in the quandary created by the procedural posture of this case. We cannot read section 1447(d) to bar appellate review of a district court's decision that the statute which purports to confer federal jurisdiction is constitutional, where the district court, recognizing the complexity and magnitude of the constitutional question before it, certifies that question for immediate appeal pursuant to 28 U.S.C. § 1292(b).\n\nWe emphasize that our conclusion is a narrow one and should in no way frustrate the policy underlying section 1447(d). \"[Our view] respects Congress' decision to avoid the delay that would be caused by review of the bulk of remand orders, but restricts that limitation to the category of cases where review is least necessary.\" Herrmann, supra at 415.\n\nWe are presented here with a situation where the delay and disruption of on-going state proceedings normally associated with orders of remand are not factors. Where the district court, in order to maximize the opportunity for appellate review, has stayed the order of remand, there is no interference with the expenditure of state judicial resources.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nThe district court specifically addressed the policy underlying the section 1447(d) bar to review of remand orders and concluded that delay and disruption in the resolution of this matter might best be minimized by permitting rather than precluding appellate review:\n\nIf the court's determination that the Act's grant of jurisdiction exceeds the scope of article III is reviewed and found to be erroneous, the cases at bar will be tried in this court and the harm to defendants of denying them the right granted by Congress to be in federal court will be avoided. Review of this issue may also save the parties time and money. Although the decision reached by the court of appeals most likely will result in a petition for writ of certiorari to the Supreme Court, if the result of all review of this issue places the cases back in this court for trial, the termination of the litigation will be in sight. If this issue is not reviewed, however, given the history of these cases following the decisions in Stibitz v. General Pub. Utils. Corp., 746 F.2d 993 (3d Cir. 1984), cert. denied, 469 U.S. 1214, 84 L. Ed. 2d 334, 105 S. Ct. 1187 (1985), . . . and Kiick v. Metropolitan Edison Co., 784 F.2d 490 (3d Cir. 1986), and defendants' strong desire to be in federal court, it is highly likely that there will be another amendment to the Price-Anderson Act to provide for federal jurisdiction over these cases. That undoubtedly would result in another battle for remand which would involve great expenditures of time and money.\n\n735 F. Supp. at 647 (footnote and citations omitted). The district court also noted that:\n\nIn this regard . . . review of the issue will not necessarily defeat the goal of § 1447(d) to prevent delay in the trial of remanded cases . . . . The history of these cases gives every indication that there will be further delay in the trial of these cases despite remand to state court.\n\nId. at n.6.\n\nIn sum, we are convinced that Congress could not have intended that sections 1447(c) and 1447(d) be construed so broadly as to prevent our consideration of a section 1292(b) appeal which certifies an unsettled question of constitutional proportion. Such constitutional determinations could not have been intended by Congress to fall within the category of routine subject matter jurisdiction determinations contemplated by section 1447(c) and, consequently, are not immune from review under section 1447(d).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e We believe, therefore, that we have jurisdiction, pursuant to 28 U.S.C. § 1292(b), to hear this appeal.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e This holding is derived from and is fully consistent with the holding of Thermtron: under section 1447(d), Congress \"made the district courts the final arbiters of [only] whether Congress intended that specific actions were to be tried in a federal court.\" 423 U.S. at 355 (Rehnquist, J. dissenting) (latter emphasis added).\n\nHaving determined that we have jurisdiction to hear this appeal, we turn to the substance of the question certified. We believe that the constitutional issue of whether these cases \"arise under\" the laws of the United States is at the core of these proceedings and will thus focus upon the history and content of the comprehensive statutory scheme of which the Amendments Act is a part. We begin with the critical constitutional provision and the caselaw which defines it.\n\nIII.\n\nArticle III, § 2, cl. 1 of the United States Constitution provides that:\n\nThe judicial Power shall extend to all Cases, in Law and Equity, arising under this Constitution, the Laws of the United States, and Treaties made, or which shall be made, under their Authority. . . .\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\n\"Congress cannot confer upon the lower federal courts a jurisdiction beyond the cases to which the judicial power of the United States extends under Art. III. . . .\" International Brotherhood of Teamsters v. W.L. Mead, Inc., 230 F.2d 576, 579 (1st Cir. 1956). See also Verlinden B.V. v. Central Bank of Nigeria, 461 U.S. 480, 491, 76 L. Ed. 2d 81, 103 S. Ct. 1962 (1983) (\". . . Congress may not expand the jurisdiction of the federal courts beyond the bounds established by the Constitution\"). In order, then, for Congress to confer a valid grant of federal jurisdiction, the cause of action must be one which \"arises under\" the laws of the United States.\n\nThe starting point of any discussion of the scope of Article III \"arising under\" jurisdiction must certainly be Osborn v. Bank of the United States, 22 U.S. (9 Wheat) 738, 6 L. Ed. 204 (1824). In Osborn the Court explored the constitutional reach of \"arising under\" jurisdiction in evaluating a statute which granted federal jurisdiction over all cases -- including those filed pursuant to state law -- to which the Bank of the United States was a party. The facts of Osborn are straightforward. The Bank of the United States, a federally created entity, filed suit in a federal court to enjoin the State of Ohio from levying a tax on the Bank. The Supreme Court held that the congressional act creating the Bank, granting it powers and authorizing it \"to sue and be sued in any circuit court of the United States,\" was sufficient to confer Article III \"arising under\" jurisdiction. Congress may properly extend \"arising under\" jurisdiction to any case in which a federal issue \"forms an ingredient of the original cause.\" 22 U.S. at 823. The Court found such an ingredient in the provision of the Act which, in incorporating the Bank, granted it the right to sue and be sued. \"Every act of the Bank grows out of this law and is tested by it. To use the language of the Constitution, every act of the bank arises out of this law.\" Id. at 827. The Court then formulated a test to be applied in determining whether \"arising under\" jurisdiction has been established:\n\nIf it be a sufficient foundation for jurisdiction, that the time or right set up by the party, may be defeated by one construction of the Constitution or law of the United States, and sustained by the opposite construction, provided the facts necessary to support the action be made out, then all the other questions must be decided as incidental to this, which gives that jurisdiction.\n\nId. at 822. The central teaching of Osborn, therefore, is that a case cannot be said to arise under a federal statute where that statute is nothing more than a jurisdictional grant. In order to confer \"arising under\" jurisdiction, \"the act [may] not stop with incorporating the Bank;\" it must do more. Id. at 826-27.\n\nThe broad holding of Osborn was clarified in Verlinden, 461 U.S. at 480, where the Court addressed a constitutional challenge to the Federal Sovereign Immunities Act. There the Court was required to determine \"whether Congress exceeded the scope of Art. III of the Constitution by granting federal courts subject-matter jurisdiction over certain civil actions by foreign plaintiffs against foreign sovereigns where the rule of decision may be provided by state law.\" Id. at 491 (emphasis added). In concluding that the \"arising under\" clause of Article III \"provided an appropriate basis for the statutory grant of subject-matter jurisdiction\" the Court referred to the test formulated in Osborn and stated that \"Osborn. . . reflects a broad conception of 'arising under' jurisdiction, according to which Congress may confer on the federal courts jurisdiction over any case or controversy that might call for the application of federal law.\" Id. at 492. The Court in Verlinden found it unnecessary to fix the precise limits of Article III because the Federal Sovereign Immunities Act contained a comprehensive set of legal standards to be applied to claims of immunity. The statute codified the rule that a foreign state was generally immune from suit, subject to specific exceptions. The existence of these exceptions was said to have \"injected an essential federal element into all suits brought against foreign states.\" Id. at 484. The Court observed that while, \"taken at its broadest, Osborn might be read as permitting 'assertion of original federal jurisdiction on the remote possibility of presentation of a federal question,'\" the case before it in Verlinden involved more than a \"speculative possibility\" that a federal question would arise. 461 U.S. at 492.\n\nAt the threshold of every action in a district court against a foreign state, . . . the court must satisfy itself that one of the exceptions [to sovereign immunity] applies -- and in doing so it must apply the detailed federal law standards set forth in the Act. Accordingly, an action against a foreign sovereign arises under federal law, for purposes of Article III jurisdiction.\n\nId. at 493-94.\n\nIn so holding, the Court reaffirmed the Osborn rule that a statute which merely confers federal jurisdiction cannot constitute the federal law under which an action arises. Id. at 496. The Court concluded, however, that where jurisdictional provisions of an Act constitute one part of a comprehensive scheme and do not \"merely concern access to the federal courts,\" there is no constitutional infirmity. Id. With respect to the constitutionality of the Foreign Sovereign Immunities Act, the Court stated:\n\nCongress, pursuant to its unquestioned Article I powers, has enacted a broad statutory framework governing assertions of foreign sovereign immunity. In so doing, Congress deliberately sought to channel cases against foreign sovereigns away from the state courts and into federal courts, thereby reducing the potential for a multiplicity of conflicting results among the courts of the 50 States. . . . Every action against a foreign sovereign necessarily involves application of a body of substantive federal law. . . .\n\nId. at 497. We take from Verlinden the proposition that where Congress has the authority to legislate in a given area and substantively does so, a grant of federal subject matter jurisdiction will survive an Article III challenge.\n\nThe fact that pure jurisdictional statutes cannot withstand scrutiny under Article III was reiterated recently in Mesa v. California, 489 U.S. 121, 103 L. Ed. 2d 99, 109 S. Ct. 959 (1989). There the Court determined that the federal officer removal statute, 28 U.S.C. § 1442(a), required the averment of a federal defense.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The contrary view, i.e., reading section 1442(a) so broadly as to confer jurisdiction with no allegation of a federal defense,\n\nraises serious doubts whether, in enacting § 1442(a), Congress would not have \"expanded the jurisdiction of the federal courts beyond the bounds established by the Constitution.\" Verlinden B.V. v. Central Bank of Nigeria, 461 U.S. 480, 491, 76 L. Ed. 2d 81, 103 S. Ct. 1962 (1983). In Verlinden, we discussed the distinction between \"jurisdictional statutes\" and \"the federal law under which [an] action arises, for Art. III purposes,\" and recognized that pure jurisdictional statutes which seek \"to do nothing more than grant jurisdiction over a particular class of cases\" cannot support Art. III \"arising under\" jurisdiction. . . . Section 1442(a), in our view, is a pure jurisdictional statute, seeking to do nothing more than grant district court jurisdiction over cases in which a federal officer is a defendant. Section 1442(a), therefore, cannot independently support Art. III \"arising under\" jurisdiction.\n\nId. at 136.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe district court carefully applied these precedents and concluded that Congress exceeded the scope of Article III in enacting the Amendments Act because the Amendments Act, like the federal officer removal statute, was purely jurisdictional, creating only a federal forum for the litigation of public liability actions.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nCritical to the district court's constitutionality determination was the fact that the rules of decision for public liability actions filed in or removed to a federal court are, according to the Amendments Act, to be \"derived from the law of the State in which the nuclear incident . . . occurs.\" 42 U.S.C. § 2014(hh). Because principles of state law were to be applied, the district court found that Congress had not \"'codified the standards' governing personal injury actions resulting from nuclear incidents 'as an aspect of substantive federal law.'\" 735 F. Supp. at 644 (quoting Verlinden, 461 U.S. at 497). The district court concluded that Congress had not set forth a comprehensive codified standard to be applied in all public liability actions, but instead had relied upon standards developed by the states. The \"arising under\" requirement of Article III, section 2 of the United States Constitution had not, therefore, been satisfied and the Amendments Act was constitutionally infirm.\n\nRecognizing that there was \"a substantial ground for difference of opinion as to the correctness of the decision,\" the district court concluded that the grant of \"arising under\" jurisdiction set forth in the Amendments Act was unconstitutional. Our resolution of the question certified depends entirely upon the accuracy of the district court's characterization of the Amendments Act as purely jurisdictional. We turn, therefore, to the Act itself and begin with its history.\n\nIV.\n\nCongressional regulation of the nuclear power industry was initiated with the enactment of the Atomic Energy Act of 1946. While that statute reflected Congress' determination that the nuclear industry would be a government monopoly, see Act of Aug. 1, 1946, ch. 724, 60 Stat. 755, Congress later concluded that it would be in the national interest to permit private sector involvement in that industry under a system of federal licensing and regulation. This policy decision was implemented in the Atomic Energy Act of 1954, as amended, 42 U.S.C. §§ 2011-2296. The private actors entering the nuclear power industry were still required to confront the risks associated with potentially devastating liability which might be imposed in the event of a major nuclear accident. \"While repeatedly stressing that the risk of a major nuclear accident was extremely remote, spokesmen for the private sector informed Congress that they would be forced to withdraw from the field if their liability were not limited by appropriate legislation.\" Duke Power Co. v. Carolina Environmental Study Group, Inc., 438 U.S. 59, 64, 57 L. Ed. 2d 595, 98 S. Ct. 2620 (1978).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nIn 1957, Congress enacted the Price-Anderson Act for the purpose of \"protecting the public and . . . encouraging the development of the atomic energy industry.\" 42 U.S.C. § 2012. This Act contained three central elements. First, the Act set a ceiling on the aggregate liability which could be imposed upon those engaged in the use and handling of radioactive material \"either through contract with the Federal Government or under a license issued by the Federal Government for the private development of such activities.\" S. Rep. No. 218, 100th Cong., 2d Sess., reprinted in 1988 U.S. Code Cong. \u0026 Admin. News 1476, 1477.\n\nThe second important feature of the Act involved the \"channeling of liability.\" Under this provision, any entity exposed to potential liability for activity resulting in a nuclear incident, even if it were not a direct participant in the activity, was entitled to indemnification. Id.\n\nFinally the Price-Anderson Act established that all public liability claims above the amount of required private insurance \"protection would be indemnified by the Federal Government, up to the aggregate limit on liability.\" Id.\n\nIn 1966, prior to the scheduled expiration of the Price-Anderson Act, the liability limitation portions of the Act were extended for an additional ten years and a new provision was added which required that those indemnified waive the defenses of negligence, contributory negligence, charitable or governmental immunity, and assumption of the risk in the event of an action arising as the result of an extraordinary nuclear occurrence. 42 U.S.C. § 2210(n)(1).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e The 1966 Amendments also provided for the transfer, to a federal district court, of all claims arising out of an extraordinary nuclear occurrence. 42 U.S.C. § 2210(n)(2). These provisions grew out of\n\ncongressional concern that state tort law dealing with liability for nuclear incidents was generally unsettled and that some way of insuring a common standard of responsibility for all jurisdictions -- strict liability -- was needed. A waiver of defenses was thought to be the preferable approach since it entailed less interference with state tort law than would the enactment of a federal statute prescribing strict liability. See S. Rep. No. 1605, 84th Cong., 2d Sess., 6-10 (1966).\n\nDuke Power, 438 U.S. at 65-66 (footnote omitted).\n\nIn 1975, the Price-Anderson Act was amended a second time. These amendments extended the Act's coverage and made certain liability limitation adjustments. Provision was made to phrase out the federal indemnity portion of the Price-Anderson scheme.\n\nOn August 29, 1988, Congress amended the Price-Anderson Act for a third time, enacting the Price-Anderson Amendments Act of 1988. The decision to amend and to extend the Price-Anderson Act grew out of the congressional conclusion that\n\nThe Price-Anderson System, including the waiver of defenses provisions, the omnibus coverage, and the predetermined sources of funding, provides persons seeking compensation for injuries as a result of a nuclear incident with significant advantages over the procedures and standards for recovery that might otherwise be applicable under State tort law. The Act also provides a mechanism whereby the federal government can continue to encourage private sector participation in the beneficial uses of nuclear materials.\n\nS. Rep. No. 218, 100th Cong., 2d Sess. 4, reprinted in 1988 U.S. Code Cong. \u0026 Admin. News 1476, 1479. The Amendments Act extended the authority for the Price-Anderson indemnification system, increased the aggregate level of indemnification payments, established a mechanism for expedited congressional action relating to additional compensation, and altered the breadth of the compensation system to cover activity related to disposal of nuclear waste. See S. Rep. No. 70, 100th Cong., 2d Sess. 1, reprinted in 1988 U.S. Code Cong. \u0026 Admin. News 1424. The Amendments Act also contained provisions imposing criminal and civil penalties upon contractors who violate Department of Energy rules, regulations or orders respecting nuclear safety and creating an independent panel to advise Congress regarding the appropriate means of fully compensating nuclear accident victims was created. Two provisions of the Amendments Act are critical to the appeals now before us. In addition to the provisions already detailed, the Amendments Act included an expansion of the reach of section 2210(n)(2) to provide for removal of, and original federal jurisdiction over, claims arising from any \"nuclear incident.\"\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Section 2210(n)(2) was amended to read as follows:\n\nWith respect to any public liability action arising out of or resulting from a nuclear incident, the United States district court in the district where the nuclear incident takes place, or in the case of a nuclear incident taking place outside the United States, the United States District Court for the District of Columbia, shall have original jurisdiction without regard to the citizenship of any party or the amount in controversy. Upon motion of the defendant or of the Commission, or the Secretary, as appropriate, any such action pending in any State court (including any such action pending on [the date of the enactment of the Price-Anderson Amendments Act of 1988]) or United States district court shall be removed or transferred to the United States district court having venue under this subsection. Process of such district court shall be effective throughout the United States. . . .\n\n42 U.S.C. § 2210(n)(2).\n\nAlso important to this appeal is the Amendment Act's addition of section 2014(hh) to the definition section of the Price-Anderson Act. Section 2014(hh) defines a public liability action as \"any suit asserting public liability\"\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e and also contains the provision upon which this constitutional debate centers:\n\nA public liability action shall be deemed to be an action arising under section 2210 of this title, and the substantive rules for decision in such action shall be derived from the law of the State in which the nuclear incident involved occurs, unless such law is inconsistent with the provisions of such section.\n\n42 U.S.C. § 2014(hh). It was these two Amendment Act provisions which formed the basis for the district court's conclusion that the Act could not withstand constitutional scrutiny.\n\nIn addition, we note that following the 1988 Amendments, the Price-Anderson Act contained provisions which created a federal cause of action, 42 U.S.C. § 2014(hh); set a limitations period to govern the newly-created cause of action, 42 U.S.C. § 2210(n)(1); provided for venue, 42 U.S.C. § 2210(n)(2); provided for choice of law, 42 U.S.C. § 2014(hh); placed limits on the availability of punitive damages, 42 U.S.C. § 2210(s); channeled liability to licensees, 42 U.S.C. § 2014(t); adopted a rule of industry-share liability, 42 U.S.C. § 2210(b); mandated that normally-available defenses be waived in the cases of an extraordinary nuclear occurrence, 42 U.S.C. § 2210(n)(1); and established an upper limit of aggregate liability, 42 U.S.C. § 2210(e).\n\nV.\n\nIt is clear that \"cases in which federal and state law elements are mixed present very difficult subject matter jurisdiction problems for the federal court.\" Hirshman, Whose Law Is It, Anyway? A Reconsideration of Federal Question Jurisdiction Over Cases of Mixed State and Federal Law, 60 Ind. L. J. 17 (1984). The same is no less true of the \"arising under\" determination to be made in construing Article III. See Amar, A Neo-Federalist View of Article III: Separating the Two Tiers of Federal Jurisdiction and the Revision of the Judicial Code, 65 B.U. L. Rev. 205, 265 n.195 (1985) (the scope of federal question jurisdiction granted by Article III \"has long perplexed even the most eminent of jurists and scholars\"). These difficulties arise because \"Congress rarely enacts a complete and self-sufficient body of federal law. The federal statutes are full of references, both explicit and implicit, to the law of some state. As a result, legal problems repeatedly fail to come wrapped up in neat packages marked 'all federal' or 'all state.'\" Hirshman, supra at 18.\n\nThe Amendments Act is no exception. It, too, contains both federal and state elements. While the public liability cause of action itself and certain elements of the recovery scheme are federal, the underlying rules of decision are to be derived from state law. This is not fatal to \"arising under\" jurisdiction because we find that Congress intended to -- and did -- create a federal cause of action which will implicate substantive aspects of federal law.\n\nUnder the terms of the Amendments Act, the \"public liability action\" encompasses \" any legal liability\" of any \"person who may be liable\" on account of a nuclear incident. 42 U.S.C. § 2014(hh) (emphasis added). Given the breadth of this definition, the consequence of a determination that a particular plaintiff has failed to state a public liability claim potentially compensable under the Price-Anderson Act is that he has no such claim at all. After the Amendments Act, no state cause of action based upon public liability exists. A claim growing out of any nuclear incident is compensable under the terms of the Amendments Act or it is not compensable at all. Any conceivable state tort action which might remain available to a plaintiff following the determination that his claim could not qualify as a public liability action, would not be one based on \"any legal liability\" of \"any person who may be liable on account of a nuclear incident.\" It would be some other species of tort altogether, and the fact that the state courts might recognize such a tort has no relevance to the Price-Anderson scheme. At the threshold of every action asserting liability growing out of a nuclear incident, then, there is a federal definitional matter to be resolved: Is this a public liability action? If the answer to that question is \"yes,\" the provisions of the Price-Anderson Act apply; there can be no action for injuries caused by the release of radiation from federally licensed nuclear power plants separate and apart from the federal public liability action created by the Amendments Act.\n\nThe district court's narrow interpretation of the Amendments Act was founded, not upon an analysis of congressional intent, but upon its concern that because Congress directed that the rules of decision governing public liability actions were to be derived from state law, Congress had failed to rule substantively and thus had exceeded the established boundaries of Article III. We do not find any support in the caselaw for the proposition that Congress may not constitutionally rely upon state rules of decision as a foundation for a particular statutory scheme. Congress has, at various times and in various contexts, enacted statutes authorizing federal courts to decide nondiversity cases turning on state law rules of decision. Note, Over-Protective Jurisdiction?: A State Sovereignty Theory of Federal Questions, 102 Harv. L. Rev. 1948, 1950 (1989) (footnote omitted). Examples of statutory schemes adopting state rules of decision include the Federal Deposit Insurance Act, 12 U.S.C. § 1819 (1950); the Bankruptcy Reform Act of 1978, 92 Stat. 2549 (1978); 11 U.S.C. §§ 101-151326 (1978); 16 U.S.C. § 457 (1982) (subjecting claims of wrongful death within a federal enclave to federal jurisdiction); the Outer Continental Shelf Lands Act, 43 U.S.C. § 1331 et seq.; and the Federal Tort Claims Act, 28 U.S.C. § 1346(b). In these statutes, as in the Amendments Act, Congress relied upon state law as a foundation and effectuated its purposes by creating an overlay of federal law.\n\nAt other times Congress has not been explicit as to the role which state law is to play in a particular statutory scheme. Courts, in that circumstance, have been required to determine whether state law was intended to operate as state law or whether state law should be read to form the content of new federal law, filling interstitial statutory gaps. Courts evaluating these mixed state/federal schemes have focused primarily upon congressional intent and have formulated decisions accordingly. See, e.g., Reconstruction Finance Corp. v. Beaver County, 328 U.S. 204, 90 L. Ed. 1172, 66 S. Ct. 992 (1946) (congressional intent underlying the Reconstruction Finance Corporation Act supported reliance on state law definitions of \"real property\" for tax purposes); United States v. Little Lake Misere Land Co., Inc., 412 U.S. 580, 37 L. Ed. 2d 187, 93 S. Ct. 2389 (1973) (Court refused to apply state law as the rule of decision under the Migratory Bird Conservation Act). See also Textile Workers Union of Am. v. Lincoln Mills of Alabama, 353 U.S. 448, 1 L. Ed. 2d 972, 77 S. Ct. 912 (1957) (sustaining jurisdictional grant of section 301 of the Labor Management Relations Act as impliedly directing that state law be absorbed as federal law). These cases demonstrate that courts, in order to honor the presumption in favor of a statute's constitutionality, may be required to adopt a flexible approach to a particular state/federal mix.\n\nIn this case, congressional intent is not an issue. In explicitly providing that the \"substantive rules for decision\" in public liability actions \"shall be derived from\" the law of the state in which the nuclear incident occurred, we believe that Congress expressed its intention that state law provides the content of and operates as federal law. The legislative history of the Amendments Act supports this view by clarifying that Congress adopted the approach to state law embodied in the Outer Continental Shelf Lands Act. Reporting on H.R. 1414, the House version of the Amendments Act, the Committee on Interior and Insular Affairs made specific reference to the Lands Act:\n\nThe Committee recognizes, of course, that Article III of the Constitution limits the type of cases that federal courts created under the Article may hear. For this reason, H.R. 1414 expressly states that any suit asserting public liability shall be deemed to be an action arising under the Price-Anderson Act, thereby making suits asserting public liability \"Cases . . . arising under . . . the laws of United States\" within the meaning of Article III. Rather than designing a new body of substantive law to govern such cases, however, the bill provides that the substantive rules for decision in such actions shall be derived from the law of the state in which the nuclear incident involved occurs, unless such law is inconsistent with the Price-Anderson Act. The Committee believes that conferring on the Federal courts jurisdiction over claims arising out of all nuclear incidents in this manner is within the constitutional authority of Congress and notes that the Congress has used this approach in the Outer Continental Shelf Lands Act.\n\nH.R. Rep. No. 104, 100th Cong., 1st Sess., Pt. 1, at 18 (1987).\n\nIn the Lands Act, Congress declared \"the civil and criminal laws of each adjacent state to be the law of the United States\" on the Outer Continental Shelf \"to the extent that they are applicable and not inconsistent with\" the Lands Act. 43 U.S.C. § 1333(a)(2). Congress also provided that the district courts would have \"jurisdiction of cases and controversies arising out of, or in connection with . . . any operation conducted on the outer Continental Shelf. . . .\" 43 U.S.C. § 1349(b)(1).\n\nWhile the Lands Act has been the subject of frequent litigation, the power of Congress to confer federal jurisdiction in these cases and to give content to the federal law by adopting state rules of decision has never been questioned. See Rodrigue v. Aetna Casualty \u0026 Surety Co., 395 U.S. 352, 357, 23 L. Ed. 2d 360, 89 S. Ct. 1835 (1969) (the Lands Act provided for exclusive regulation by federal law with state law adopted as surrogate federal law); Tidelands Royalty \"B\" Corp. v. Gulf Oil Corp., 804 F.2d 1344, 1347 n.1 (5th Cir. 1986) (district court had jurisdiction over claim involving mineral lessee's rights under state law); Laredo Offshore Constructors, Inc. v. Hunt Oil Co., 754 F.2d 1223, 1225 (5th Cir. 1985) (district court had subject matter jurisdiction over a contract dispute governed by state law rules); Hughes v. Lister Diesels, Inc., 642 F. Supp. 233 (E.D. La. 1986) (district court had subject matter jurisdiction to resolve personal injury action governed by state law rules).\n\nWe recognize that the language respecting state law in the Amendments Act is not identical to that of the Lands Act. While the Lands Act provides that the laws of adjacent states are \"to be the law of the United States\" on the outer continental shelf, the Amendments Act refers to substantive rules for decision as \"derived from state law.\" We believe that the language adopted in the Amendments Act supports our view that Congress intended that the rules of decision constitute federal law.\n\nEven if we were to find that it is state law itself, rather than state law operating as federal law, which forms the basis for decision in public liability actions, our conclusion regarding congressional authority to confer federal jurisdiction over these public liability actions would be unaffected. In Verlinden, the very issue to be decided was whether Congress had authority to grant jurisdiction to the federal courts over causes of action when those actions were governed by pure state law rules of decision. The Foreign Sovereign Immunities Act did not, as does the Amendments Act, affect substantive state tort law. The sole objective of the Immunities Act was to specify those instances in which sovereign immunity would and would not apply. This federal element was sufficient to allow the Foreign Sovereign Immunities Act to withstand an Article III challenge in spite of the fact that all substantive issues were to be resolved in accordance with state law.\n\nThe federal elements involved in the Price-Anderson scheme are similarly sufficient. The federal ingredients here are as substantial as those in Verlinden and are more substantial than those found sufficient in Osborn. The Amendments Act creates a federal cause of action which did not exist prior to the Act, establishes federal jurisdiction for that cause of action, and channels all legal liability to the federal courts through that cause of action. By creating this federal program which requires the application of federal law, Congress sought to effect uniformity, equity, and efficiency in the disposition of public liability claims. With the federal jurisdiction and removal provisions set forth in the Amendments Act, Congress ensured that all claims resulting from a given nuclear incident would be governed by the same law, provided for the coordination of all phases of litigation and the orderly distribution of funds, and assured the preservation of sufficient funds for victims whose injuries may not become manifest until long after the incident. See H.R. Rep. No. 104, 100th Cong., 1st Sess., pt. 3, at 18 (1987). Thus, Congress clearly intended to supplant all possible state causes of action when the factual pre-requisites of the statute are met.\n\nExamining the Price-Anderson scheme are completed by the Amendments Act, we are convinced that the Act, while relying for definition upon state law elements, contains the federal components necessary to survive the constitutional challenge mounted here. Our conclusion is unaffected by those pre-Amendments Act cases in which we determined that the Price-Anderson Act did not create a federal cause of action. Those cases, which evaluated the statutory rather than the constitutional \"arising under\" requirement, rested principally on the finding that Congress had not specifically created a federal tort and did not intend to create a federal cause of action. See, e.g., Kiick v. Metropolitan Edison Co., 784 F.2d at 490, (legislative history of Price-Anderson Act replete with indications that Congress never intended to displace state tort law with respect to the issues of liability and recoverable damages for nuclear accidents); Stibitz v. General Pub. Util. Corp., 746 F.2d at 993 (legislative history of the Price-Anderson Act belies any contention that Congress intended to create federal common law causes of action) and Commonwealth of Pennsylvania v. General Pub. Util. Corp., 710 F.2d 117, 122 (3d Cir. 1983) (nothing in statute or legislative history which would warrant adoption and application of undeveloped federal common law).\n\nWith the Amendments Act, however, the entire Price-Anderson landscape was transformed. Congress clearly considered the decisions of our court holding that Congress had not intended to create a federal cause of action for cases not based upon an extraordinary nuclear occurrence, that federal question jurisdiction would attach to actions resulting from an extraordinary nuclear occurrence, that federal questions would arise in the defense of nuclear accident claims but would not appear in the plaintiff's case, and that Congress had not directed that a body of federal common law be created. Congress then provided, in the Amendments Act, the clearest expression of intent that there be a federal cause of action arising directly under the Act. Despite the plaintiffs' arguments to the contrary, Kiick, Stibitz, and the other pre-Amendments Act cases provide no support for the Article III challenge made here.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nWe are also not persuaded by the plaintiffs' argument that the Amendments Act exceeds the scope of Article III because the public liability action, now a federal tort, was previously actionable under state law. Where Congress creates a right of action, and formulates substantive federal provision applicable to that action, the action arises under federal law despite the fact that the same wrong may previously have been actionable under state law. Were the rule otherwise, actions which today may be brought under the Federal Tort Claims Act, the Outer Continental Shelf Lands Act and other federal statutes would not arise under federal law because, prior to enactment of the federal statute, actions based on the identical occurrence could have been brought in a state court. The federal nature of the right to be established is decisive. Here, the right to control the safety aspects of nuclear power is exclusively federal. Congress, therefore, is authorized to create a federal tort which may have had its origins in state law. The basis of the public liability action no longer stems from state law. See Silkwood v. Kerr-McGee Corp., 464 U.S. 238, 240-41, 78 L. Ed. 2d 443, 104 S. Ct. 615 (1984) (the federal government occupies the entire field of nuclear safety concerns).\n\nThrough the Amendments Act, Congress has placed an overlay of federal law upon the rights and remedies previously available under state law. Once a federal court is satisfied that a particular suit is a public liability action, additional questions under the Amendments Act may need to be addressed. Under certain circumstances licensees may be required to waive defenses which would have been viable under state law. Punitive damage awards available under state law also may be precluded. Furthermore, in every case alleging public liability, courts will be required to determine whether state law principles conflict with other parts of the Price-Anderson scheme.\n\nTwo Supreme Court cases indicate that the duty the defendants owe the plaintiffs in tort is dictated by federal law.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e In Pacific Gas \u0026 Electric Co. v. State Energy Conservation and Development Commission, 461 U.S. 190, 75 L. Ed. 2d 752, 103 S. Ct. 1713 (1983), the Court considered the question of whether a California statute, which prohibited the construction of nuclear plants until technology for safe disposal of nuclear waste was developed, was preempted by federal law. See id. at 198. The Court held that preemption is found in three circumstances: where there is an explicit statement of preemption by Congress; where there is pervasive federal regulation in the field; and where state law \"actually conflicts with federal law.\" Id. at 204.\n\nWith regard to nuclear energy, the Court found that \"Congress . . . intended that the Federal Government should regulate the radiological safety aspects involved in the construction and operation of a nuclear plant, but that the States retain their traditional responsibility in the field of regulating . . . for determining questions of need, reliability, cost, and other related state concerns.\" Id. at 205. The Court concluded that \"the safety of nuclear technology was the exclusive business of the Federal Government,\" id. at 208, and that Congress, by permitting the states to regulate \"for purposes other than for protection against radiation hazards,\" id. at 210, reemphasized the state and federal governments' respective spheres. Accordingly,\n\nthe Federal Government maintains complete control of the safety and \"nuclear\" aspects of energy generation. . . . .\n\nState safety regulation is not pre-empted only when it conflicts with federal law. Rather, the Federal Government has occupied the entire field of nuclear safety concerns, except the limited powers expressly ceded to the States. When the Federal Government completely occupies a given field . . . as it has done here, the test of pre-emption is whether the \"matter on which the State asserts the right to act is in any way regulated by the Federal Act.\"\n\nId. at 212-13 (emphasis added) (citation omitted). The California statute was held to be not preempted because the Court found a \"non-safety rationale\" for its implementation.\n\nThe holding in Pacific Gas \u0026 Electric was reaffirmed one term later in Silkwood: \"states are precluded from regulating the safety aspects of nuclear energy.\" 464 U.S. at 240-41. In Silkwood, a decedent's estate brought suit, based on state common law tort principles, against a manufacturer of plutonium. The Court of Appeals for the Eleventh Circuit affirmed a verdict in the plaintiff's favor for property damage, based on a strict liability theory, but reversed an award of punitive damages. In light of Pacific Gas \u0026 Electric, and the legislative history, the Court concluded:\n\nIf there were nothing more, this concern over the state's inability to formulate effective standards and the foreclosure of the States from conditioning the operation of nuclear power plants on compliance with state-imposed safety standards arguably would disallow resort to state-law remedies . . . .\n\nId. at 250-51. However, the Court found that there was a clear congressional intent to leave state remedies intact, \"notwithstanding the NRC's exclusive regulatory authority.\" Id. at 254 (emphasis added).\n\nIn sum, it is clear that in enacting and amending the Price-Anderson Act, Congress assumed that state-law remedies . . . were available . . . . This was so even though it was well aware of the NRC's exclusive authority to regulate safety matters. No doubt there is some tension between the conclusion that safety regulation is the exclusive concern of the federal law and the conclusion that a State may nevertheless award damages based on its own law of liability. . . . It may be that the award of damages based on the state law of negligence . . . is regulatory in the sense that a nuclear plant will be threatened if it does not conform to state standards, but that regulatory consequence was something that Congress was quite willing to accept.\n\nWe do not suggest that there could never be an instance in which the federal law would pre-empt the recovery of damages based on state law. . . . preemption should . . . [be judged] on whether there is an irreconcilable conflict between the federal and state standards or whether the imposition of a state standard in a damages action would frustrate the objectives of the federal law.\n\nId. at 256 (emphasis added). The court found no conflict in Silkwood, because the award of punitive damages would not impede the congressional goal of promoting nuclear safety. See id. at 257. Permitting the states to apply their own nuclear regulatory standards, in the form of the duty owed by nuclear defendants in tort, would, however, \"frustrate the objectives of the federal law.\"\n\nIndeed, one court, when construing the source of the duty to be applied in a tort case arising under the Price-Anderson Act, concluded that the NRC had extensively regulated the dose of radiation a worker could receive. See O'Conner v. Commonwealth Edison Co., 748 F. Supp. 672 (C.D. Ill. 1990). Accordingly, the court held that if Illinois law did not adopt the federal standard \"as the duty owed by the Defendants, this Court believes that Illinois law would be inconsistent with federal law and that federal law would take precedence.\" Id. at 678 (certifying that question for interlocutory appeal).\n\nSimilarly, in Hennessy v. Commonwealth Edison Company, 764 F. Supp. 495 (N.D. Ill. 1991), a plaintiff sued for negligent infliction of emotional distress, strict liability, and battery arising out of radiation exposure he received while working for the defendant. The court concluded \"that compliance with the federal permissible dose limits . . . should conclusively establish that the applicable standard of care was met in this case.\" 764 F. Supp. at 501 (relying on Pacific Gas \u0026 Electric and O'Conner).\n\nUnder Pacific Gas \u0026 Electric Co., states are preempted from imposing a non-federal duty in tort, because any state duty would infringe upon pervasive federal regulation in the field of nuclear safety, and thus would conflict with federal law. See 461 U.S. at 204.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Consequently, the plaintiffs' rights will necessarily be determined, in part, by reference to federal law, namely the federal statutes and regulations governing the safety and operation of nuclear facilities. Given that there are important federal questions to be resolved which are indispensable ingredients of the public liability action, we find that Congress did not exceed its constitutional authority in conferring federal jurisdiction over public liability actions.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nVI.\n\nHaving concluded that the Amendments Act does not transgress the limits of Article III, we turn, finally, to the plaintiffs' collateral constitutional challenges to the Amendments Act. The plaintiffs urge, as alternate grounds for affirming the district court's order of remand, that application of the Amendments Act to cases already pending in a state court violates constitutional principles of federalism, state sovereignty, due process, and equal protection. \"Our scope of review is generally governed by the controlling question of law set forth in the district court's certification order under 28 U.S.C. § 1292. Nevertheless, since we review orders and not isolated legal questions . . . we may consider all grounds that require reversal of the order.\" Gruber v. Price Waterhouse, 911 F.2d 960, 963 (3d Cir. 1990). The plaintiffs' arguments with respect to these issues were skeletal. As we find no merit to these collateral issues, our discussion is similarly painted with a broad brush.\n\nThe plaintiffs' sovereignty and federalism claims are based upon the proposition that a state court may not be ousted of its jurisdiction once that jurisdiction has been properly established. This simply is not an accurate statement of the law. In Tennessee v. Davis, 100 U.S. 257, 267, 25 L. Ed. 648 (1880), the Supreme Court, addressing the validity of the general removal statutes, wrote:\n\nThe removal of cases arising under [the laws of the United States] from State into Federal courts is, therefore, no invasion of State domain. On the contrary, a denial of the right of the general government to remove them, to take charge of and try any case arising under the Constitution or laws of the United States, is a denial of the conceded sovereignty of that government over a subject expressly committed to it.\n\nSee also, Railway Co. v. Whitton's Administrator, 80 U.S. (13 Wall.) 270, 20 L. Ed. 571 (1872) (Congress was authorized to extend removal rights to plaintiffs in diversity cases pending in state court even where defendants opposed removal); and City of Greenwood v. Peacock, 384 U.S. 808, 833, 16 L. Ed. 2d 944, 86 S. Ct. 1800 (1966) (\"Congress is constitutionally fully free to establish the conditions under which civil or criminal proceedings involving federal issues may be removed from one court to another\"). In Pension Benefit Guarantee Corp. v. R.A. Gray \u0026 Co., 467 U.S. 717, 81 L. Ed. 2d 601, 104 S. Ct. 2709 (1984), the Court wrote:\n\nProvided that the retroactive application of a statute is supported by a legitimate legislative purpose furthered by rational means, judgments about the wisdom of such legislation remain within the exclusive province of the legislative and executive branches[.]\n\nId. at 729. Where there is a legitimate purpose for extending the provisions of the Amendments Act to pending cases, then, there is no encroachment upon state sovereignty.\n\nThe plaintiff's remaining constitutional claims, those resting on due process and equal protection, also depend upon the legitimacy of Congress' purpose in structuring the Amendments Act to apply retroactively. We therefore focus once more upon the purposes underlying the Amendments Act and the Price-Anderson scheme.\n\nThe retroactivity feature of the Amendments Act was included to modify the previously limited reach of the Price-Anderson Act. See S. Rep. No. 218, 100th Cong., 1st Sess., at 13 (date). Retroactivity guaranteed that all cases arising out of the same nuclear incident could be consolidated in one forum. This consolidation provision was designed to promote \"equitable and uniform treatment of victims,\" H.R. Rep. No. 104, 100th Cong., 1st Sess., pt. 1, at 18, 29 (1987); \"the orderly distribution of funds,\" H.R. Rep. No. 104, 100th Cong., 1st Sess., pt. 3, at 30 (1987); and \"the avoidance of similar issues in multiple jurisdictions that may occur in the absence of consideration.\" S. Rep. No. 218, 100th Cong., 1st Sess. at 13 (1988). These purposes are not undermined by the congressional grant of concurrent jurisdiction. The Amendments Act ensures that every claim originating in a single nuclear incident may be considered with other similar claims. Where, as here, an incident results in multiple claims with cases filed in several counties in several states, consolidation in federal court serves to reduce uncertainty, expenditure of resources in dealing with duplicative issues, and the possibility of inconsistent outcomes. Where, however, only one person is affected by the nuclear incident, as in O'Conner, 748 F. Supp. 672 (C.D. Ill. 1990), or where all claims are filed in a single state court, resolution of the public liability action may efficiently be resolved absent removal.\n\nGiven the goals underlying the Amendments Act, we believe that its provision for retroactivity was rationally directed to a legitimate federal concern. As the plaintiffs have failed to meet the burden of showing that the Amendments Act was arbitrary and irrational in purpose and effect, we find no ground for holding the Amendments Act unconstitutional on any of the collateral grounds asserted. Usery v. Turner Elkhorn Mining Co., 428 U.S. 1, 49 L. Ed. 2d 752, 96 S. Ct. 2882 (1976).\n\nOur decision in this regard is consistent with precedent established in other courts of appeals. See Arbour v. Jenkins, 903 F.2d 416, 420 (6th Cir. 1990) (retroactivity of a statute does not make it unconstitutional as a legal claim affords no enforceable property right until reduced to final judgment); Sowell v. American Cyanamid Co., 888 F.2d 802, 804 (11th Cir. 1989) (same); In re Consolidated United States Atmospheric Testing Litigation, 820 F.2d 982, 990-91 (9th Cir. 1987), cert. denied sub nom. Konizeski v. Livermore Labs, 485 U.S. 905, 99 L. Ed. 2d 235, 108 S. Ct. 1076 (1988) (plaintiff challenging retroactivity bears the burden of showing that legislature has acted in arbitrary and irrational way); Hammond v. United States, 786 F.2d 8, 12 (1st Cir. 1986) (there is no particular fundamental right to particular state law tort claims).\n\nVII.\n\nHaving concluded that we have a valid jurisdictional basis to hear this appeal and finding no constitutional infirmity in the Price-Anderson Amendments Act of 1988, we will vacate the order of the district court and remand this matter for further proceedings in the federal forum.\n\nDisposition\n\nVacated and Remanded.\n\nSCIRICA, Circuit Judge, concurring.\n\nI join in the judgment of the court, and join Parts I, II and VI of the majority opinion. I write separately because I would approach this constitutional issue in a somewhat different manner.\n\nI.\n\nEvery grant of federal jurisdiction must fall within one of the nine categories of cases and controversies enumerated in Article III. See, e.g., Hodgson v. Bowerbank, 9 U.S. (5 Cranch) 303, 3 L. Ed. 108 (1809). We are concerned here with the Arising Under clause, whose function has long been debated. Under a traditional reading, the clause was intended only to ensure that federal courts are available to determine issues of federal law. Under this reading, when a particular jurisdictional grant embraces cases involving only state law issues, it falls outside the constitutional purview of the federal courts. However, under various theories of \"protective jurisdiction,\" Congress may validly confer jurisdiction over any case, regardless of the sources of law, if that jurisdiction serves to \"protect\" a federal interest.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nAs does the majority, I would sustain § 2210(n)(2) under the traditional interpretation. I believe that public liability actions, as a class, contain sufficient substantive federal issues to bring the jurisdictional grant within the limits of Article III. As I see it, the difficulty here is that these issues may not arise in every public liability action. The Price-Anderson Act and other federal statutes contain safety regulations, waivers of defenses, insurance and indemnification provisions, and liability limitations that will affect many, but not necessarily all, state law claims arising out of nuclear incidents. This case, therefore, raises the question of the extent to which Congress may confer federal jurisdiction over state law cases that will not necessarily implicate substantive federal questions.\n\nII.\n\nAs a preliminary matter, I note certain factors that I would not rely upon to sustain the constitutionality of § 2210(n)(2). I would not place any emphasis on the definitional questions involved in deciding whether an action falls within the scope of the Amendments' jurisdictional grant. Nor would I rely on the fact that the public liability action \"replaces\" most state law causes of action arising out of nuclear incidents. In my opinion, Congress intended for state law to provide the substantive rules of decision for all public liability actions. Consequently, I believe § 2210(n)(2) grants federal jurisdiction over state law causes of action. Although federal statutes and regulations are likely to play a role in many public liability actions, I do not perceive substantive federal questions present at the outset of every such case.\n\nThe constitutionality of § 2210(n)(2) is unaffected by the fact that a court must decide various issues of federal law before determining that a particular claim qualifies as a public liability action. At the outset of every case brought under § 2210(n)(2), a court must decide whether a \"nuclear incident\" has occurred. See 42 U.S.C. § 2014(w), § 2014(q) (1988). The court must also determine whether the plaintiff's claim does not fall within the definition of \"public liability\" because it is a workmen's compensation claim, arises out of an act of war, or is an exempted property damage claim. Id. § 2014(w). Finally, the court is directed to apply the law of a particular state. Id. § 2014(hh).\n\nUnder Osborn, the federal ingredients necessary to satisfy Article III must be substantive in the sense that \"the title or right set up by the party, may be defeated by one construction of the constitution or law of the United States, and sustained by the opposite construction.\" Osborn v. Bank of the United States, 22 U.S. (9 Wheat.) 738, 822, 6 L. Ed. 204 (1824). Purely jurisdictional provisions cannot create the federal ingredient necessary to support \"arising under\" jurisdiction. See Verlinden B.V. v. Central Bank of Nigeria, 461 U.S. 480, 495-496, 76 L. Ed. 2d 81, 103 S. Ct. 1962 (1983). In Verlinden, the Court faced the unusual situation where the jurisdictional provisions of the Foreign Sovereign Immunities Act (\"FSIA\") incorporated substantive federal defenses. Under the FSIA, a finding that there is no federal jurisdiction means that \"the plaintiff will be barred from raising his claim in any court in the United States.\" Id. at 497. Here, by contrast, a finding that a particular claim does not fall within the definition of \"public liability\" does not preclude the plaintiff from pursuing that claim in state court under a different name. Such a finding does not affect the substantive rights of any party, as required under the Osborn rule.\n\nThe choice of law provision is not strictly jurisdictional in the same sense. However, whenever Congress provides original federal jurisdiction over state law claims, a federal court must decide the choice of law question. If such provisions could sustain arising under jurisdiction, there would be no constitutional limits on Congress' powers. Because jurisdiction under § 2210(n)(2) is concurrent, § 2014(hh) goes somewhat further than an ordinary choice of law rule. If a public liability action proceeds in state court, federal law requires that court to apply the law of the state where the nuclear incident occurred, even if state law would otherwise look to the law of some other state. Therefore, federal law might alter the substantive law applied in some state court actions. Nevertheless, I would not sustain a grant of federal jurisdiction based on the effect of federal law on state court actions.\n\nThe inquiry is unchanged by the fact that Congress chose to create a \"new\" federal cause of action, rather than simply provide for federal jurisdiction over state law claims. If Congress had truly pre-empted state law causes of action and replaced them with federal claims governed by federal rules of decision, the Amendments would clearly be constitutional. For example, Article III would not be contravened if Congress had intended for courts to apply federal common law in public liability actions. In Textile Workers Union v. Lincoln Mills, 353 U.S. 448, 1 L. Ed. 2d 972, 77 S. Ct. 912 (1957), the Court similarly avoided constitutional difficulties by construing § 301 of the Labor Management Relations Act as authorizing the application of federal common law. However, if state law, as opposed to federal statutory or common law, provides the rules of decision, it should make no difference that Congress has chosen to rename certain causes of action under the rubric of \"public liability actions.\"\n\nI believe Congress intended for state law, acting of its own force, to provide the rules of decision in public liability actions. In Pennsylvania v. General Public Utilities Corp., 710 F.2d 117, 122 (3d Cir. 1983), we held that federal common law has no application in the actions before us now. I do not believe Congress intended for the Amendments to overturn this result. On the contrary, Congress apparently reaffirmed it. Unlike § 301 of the LMRA, Congress expressly referred to state law as providing the rules for decision. Moreover, Congress did not refer to \"general\" state law, but intended that public liability actions be governed by the separate law of each state where a particular incident occurs. As one report noted,\n\nRather than designing a new body of substantive law to govern such cases, however, the bill provides that the substantive rules for decision in such actions shall be derived from the law of the State in which the nuclear incident involved occurs, unless such law is inconsistent with the Price-Anderson Act.\n\nH.R. Rep. No. 104, Part 1, 100th Cong., 1st Sess. at 18 (1987) (emphasis added) [hereinafter \"House Report\"]. See also id. at 5 (\"Liability is determined under applicable state tort law.\"). Consequently, unlike under § 301 of the LMRA, I believe state law remains \"an independent source of private rights.\" Lincoln Mills, 353 U.S. at 457.\n\nDefendants stress that § 2014(hh) provides that the rules of decision in public liability actions are to be \"derived from\" state law. However, I would not read these words as authorizing the application of federal common law, or the selective application of state law. Such a reading is not supported by the structure of the Amendments. For example, § 2210(n)(2) provides for concurrent jurisdiction. If a public liability action is not removed, it may proceed in state court. Are these state courts to apply federal law which is \"derived from\" the law of their own state, but which is somehow different from that state law? Similarly, § 2014(hh) requires courts to apply the law of the state in which a particular accident occurred. Thus, unlike under § 301 of the LMRA, courts could not fashion a uniform body of federal law applicable to public liability actions. Cf. Silkwood v. Kerr-McGee Corp., 464 U.S. 238, 249-58, 78 L. Ed. 2d 443, 104 S. Ct. 615 (1984) (detailing Congress' intent that the Atomic Energy Act should not pre-empt state tort liability). There would also be some potential for forum-shopping, as a defendant might remove a case to federal court when it desires that a particular state law rule be disregarded.\n\nHaving determined that state law remains an independent source of private rights, I would not place any emphasis on the fact that state law may have been \"incorporated\" into federal law. Mere incorporation of state law cannot by itself satisfy Article III. If it could, every purely jurisdictional grant would become constitutional if Congress simply added language declaring that state law operates as federal law. See, e.g., Goldberg-Ambrose, The Protective Jurisdiction of the Federal Courts, 30 UCLA L. Rev. 542, 558 (1983) (Incorporation alone cannot satisfy Article III because it \"does not generate any new independent federal rights or obligations.\"). The mere presence of some state law issues in an otherwise federal cause of action will not invalidate a jurisdictional grant. See, e.g., Osborn, 22 U.S. (9 Wheat.) at 819-20. But where Congress has simply provided a federal forum for the adjudication of state law claims, the constitution requires some further justification. Other statutes which follow the same incorporational scheme as the Amendments, such as the Outer Continental Shelf Lands Act and the Federal Tort Claims Act, should be scrutinized independently.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Cf. Federal Deposit Ins. Corp. v. George-Howard, 153 F.2d 591, 593-94 (8th Cir.) (sustaining former F.D.I.C. jurisdictional provisions under Osborn and other decisions involving instrumentalities of the federal government), cert. denied, 329 U.S. 719, 91 L. Ed. 623, 67 S. Ct. 53 (1946).\n\nIII.\n\nIn Verlinden, the Supreme Court held that the scope of the constitutional grant of \"arising under\" jurisdiction is broader than the scope of the statutory federal question grant under 28 U.S.C. § 1331. See 461 U.S. at 495. Under the statutory grant, federal jurisdiction is authorized only for those actions that satisfy the \"well-pleaded complaint\" rule. See, e.g., Louisville \u0026 Nashville R.R. Co. v. Mottley, 211 U.S. 149, 53 L. Ed. 126, 29 S. Ct. 42 (1908). Similarly, under the general removal statute, a defendant may not remove an action that does not satisfy the well-pleaded complaint rule. See, e.g., Merrell Dow Pharmaceuticals Inc. v. Thompson, 478 U.S. 804, 808, 92 L. Ed. 2d 650, 106 S. Ct. 3229 (1986). Under that rule, a plaintiff cannot bring an action in federal court based upon anticipated federal questions that may arise in a defense. Thus, because the constitutional grant is broader, it must encompass at least some cases where no federal question is apparent from the complaint.\n\nIn Stibitz and Kiick, we held that the actions before us now do not satisfy the well-pleaded complaint rule, because they are founded entirely in state law. The Amendments specifically provide for federal jurisdiction over the same cases. Therefore, we are squarely presented with the question of defining the \"gap\" between the scope of the statutory grant and the limits of Article III. As the majority notes, these limits remain largely unexplored. The Amendments create a \"new\" federal cause of action encompassing most claims arising out of any \"nuclear incident.\" However, instead of prescribing new federal rules of decision, or authorizing the application of federal common law, Congress directed that the rules of decision are to be \"derived from the law of the State where the nuclear incident involved occurs, except where such law is inconsistent with the provisions of [the Price-Anderson Act].\" 42 U.S.C. § 2014(hh) (1988). I believe the Amendments thereby grant federal jurisdiction over a class of state law claims in which the existence of substantive federal questions, although likely, is only speculative. Until some substantive federal statute or regulation is implicated, a public liability action will proceed entirely on state law grounds.\n\nThe Supreme Court has not had occasion to explore fully the extent to which Congress may confer federal jurisdiction over cases in which the application of federal law is speculative. In Verlinden, the Court recognized that Osborn can be read broadly to validate all such jurisdictional grants, but noted that some have questioned a principle that would permit \"'assertion of original federal jurisdiction on the remote possibility of presentation of a federal question.'\" 461 U.S. at 492-93 (quoting Textile Workers v. Lincoln Mills, 353 U.S. 448, 482, 1 L. Ed. 2d 972, 77 S. Ct. 912 (1957) (Frankfurter, J., dissenting)). However, the Court left that question open, stating that\n\nWe need not resolve that issue or decide the precise boundaries of Art. III jurisdiction . . . since the present case does not involve a mere speculative possibility that a federal question may arise at some point in the proceeding. Rather, a suit against a foreign state under [the FSIA] necessarily raises questions of substantive federal law at the very outset, and hence clearly \"arises under\" federal law, as that term is used in Art. III.\n\nId. at 493.\n\nI believe this case raises that question. As I note below, I do not believe the holding in Verlinden ultimately rests on the fact that substantive federal questions are present at the outset of every case brought under the FSIA. In any event, the Amendments do not mandate a similar application of federal law at the outset of every public liability action. Rather, we must determine whether various federal statutes and regulations affecting nuclear power, although not necessarily implicated in every public liability action, are sufficient to bring the jurisdictional grant within the confines of Article III.\n\nIt is difficult to formulate a bright-line test for this inquiry. As with the federal question statute, \"determinations about federal jurisdiction require sensitive judgments about congressional intent, judicial power, and the federal system.\" Merrell Dow Pharmaceuticals Inc. v. Thompson, 478 U.S. 804, 810, 92 L. Ed. 2d 650, 106 S. Ct. 3229 (1986). I believe the answer lies in evaluating the reasons that may have led Congress to provide for original federal jurisdiction even though the existence of federal questions is somewhat speculative. I would sustain § 2210(n)(2) because I believe a federal court should be open to determine the important federal questions that might arise in public liability actions, and to implement the federal scheme for the orderly disposition of large-scale nuclear accident litigation. Although Congress could have ensured that purely state law cases remained in state court by providing for appellate or removal jurisdiction upon the raising of a federal question, I believe it had valid reasons for establishing original federal jurisdiction over public liability actions.\n\nA. THE PRECEDENTS\n\nIn my opinion, the prior case law does not dictate the applicable standards when Congress has granted federal jurisdiction over cases in which the existence of federal questions is speculative. Although Osborn and Verlinden do not require the invalidation of the jurisdictional grant at issue here, I do not believe they provide a complete framework for deciding the precise issue confronting us.\n\n1. Osborn\n\nAs noted in Verlinden, the breadth of Osborn's holding has been debated. Osborn certainly could have been decided on narrower grounds. The case involved a frontal attack on federal authority by the State of Ohio. Despite the Supreme Court's earlier holding in McCulloch v. Maryland, 17 U.S. (4 Wheat.) 316, 4 L. Ed. 579 (1819), Ohio challenged the constitutionality of the Bank's immunity from state taxation. Chief Justice Marshall could have sustained the jurisdictional provision based on the federal constitutional issues present in the case, but instead he found the necessary \"federal ingredient\" in the Bank's charter. Because the federal charter created the Bank and bestowed upon it all its legal capacities, the charter \"itself is the first ingredient in the case -- is its origin -- is that from which every other part arises.\" 22 U.S. (9 Wheat.) at 825.\n\nThis reasoning formed the basis for the holding in Osborn's companion case, Bank of the United States v. Planters' Bank, 22 U.S. (9 Wheat.) 904, 6 L. Ed. 244 (1824). In that case, the Court upheld the Bank's ability to sue in federal court upon a contract. In Osborn, the Court noted that every such case involves preliminary questions regarding the Bank's ability to sue and make contracts. Although it is unlikely that the question of the Bank's ability to sue would ever be litigated,\n\nthe question forms an original ingredient in every cause. Whether it be, in fact, relied on or not, in the defence, it is still a part of the cause, and may be relied on. The right of the plaintiff to sue, cannot depend on the defence which the defendant may choose to set up. His right to sue is anterior to that defence, and must depend on the state of things when the action is brought.\n\n22 U.S. (9 Wheat.) at 824.\n\nThis reasoning implies a broad scope for the Arising Under clause, under which Congress may confer federal jurisdiction \"whenever there exists in the background some federal proposition that might be challenged, despite the remoteness of the likelihood of actual presentation of such a federal question.\" Textile Workers Union v. Lincoln Mills, 353 U.S. 448, 471, 1 L. Ed. 2d 972, 77 S. Ct. 912 (1957) (Frankfurter, J., dissenting). If this were the rule, there would be virtually no limit to Congress' authority. It is difficult to conceive of a case in which some federal issue could not be raised by some party at some point in the litigation. Perhaps because of this fact, Osborn's broad holding has largely been limited to similar cases involving federal charters and federal instrumentalities. See, e.g., Pacific Railroad Removal Cases, 115 U.S. 1, 29 L. Ed. 319, 5 S. Ct. 1113 (1885) (federally chartered railroads); Kaiser v. Memorial Blood Center of Minneapolis, Inc., 938 F.2d 90 (8th Cir. 1991) (American Red Cross); Federal Deposit Ins. Corp. v. George-Howard, 153 F.2d 591, 593-94 (8th Cir.) (F.D.I.C.), cert. denied, 329 U.S. 719, 91 L. Ed. 623, 67 S. Ct. 53 (1946). In cases involving the federal question statute, the Supreme Court has recognized these limitations, indicating that \"the doctrine of the charter cases [is] to be treated as exceptional, though within their special field there [is] no thought to disturb them.\" Gully v. First Nat'l Bank, 299 U.S. 109, 114, 81 L. Ed. 70, 57 S. Ct. 96 (1936); see also Romero v. International Terminal Operating Co., 358 U.S. 354, 379 n.50, 3 L. Ed. 2d 368, 79 S. Ct. 468 (1959) (Railroad Removal Cases was an \"unfortunate decision\"); Puerto Rico v. Russell \u0026 Co., 288 U.S. 476, 485, 77 L. Ed. 903, 53 S. Ct. 447 (1933) (refusing to extend doctrine); cf. 28 U.S.C. § 1349 (1988) (limiting federal jurisdiction over federally chartered corporations where the United States owns less than half of the stock). In Mesa v. California, 489 U.S. 121, 136-39, 103 L. Ed. 2d 99, 109 S. Ct. 959 (1989), the Court strongly indicated that a grant of federal jurisdiction over all claims involving federal officers would be invalid.\n\nBut even if the reasoning in Osborn is extended beyond cases involving federal charters, it does not necessarily require us to sustain § 2210(n)(2). In Osborn, the court emphasized that the Bank's federal charter formed an \"original ingredient in every cause\" involving the Bank. 22 U.S. (9 Wheat.) at 824. The federal question regarding the Bank's ability to sue or be sued is an element of every case, regardless of whether it is actually raised. See Note, The Theory of Protective Jurisdiction, 57 N.Y.U. Law Rev. 933, 970 (1982) (\"The 'original ingredient' is . . . properly defined as a federal issue that comprises a logical component of plaintiff's cause of action, whether or not this issue is in dispute or explicitly raised.\"). Here, by contrast, there is no substantive federal question that is a predicate to every public liability action. Defendants, although indemnified and licensed by the federal government, do not derive their legal existence from an act of Congress. There are numerous federal questions that may arise in public liability actions. But these questions would not be \"original ingredients\" in the sense that the term is used in Osborn, because it would not necessarily be possible to raise them in every case.\n\n2. Verlinden\n\nIn Verlinden, the Court likewise stressed the fact that substantive federal issues are present at the outset of every FSIA case. Although such cases will generally proceed entirely on state law grounds, a court must determine that the defendant is not immune before assuming jurisdiction. Unlike in Osborn, these issues are not merely hypothetical, but must be addressed in every case. Therefore, because the existence of substantive federal questions was not merely speculative, the Court found no occasion to examine the breadth of Osborn.\n\nHowever, this reasoning rests to a large degree on the peculiar way in which Congress chose to draft the FSIA. In non-FSIA cases, sovereign immunity ordinarily is raised as a defense to a plaintiff's cause of action. Unless a defendant chooses to litigate the issue, it will not be raised. There will be numerous cases against sovereign defendants in which immunity is clearly unavailable. Under the FSIA, however, a court must ascertain at the outset whether immunity exists, regardless of whether the parties choose to litigate the issue. See Verlinden, 461 U.S. at 494 n.20. Thus, by drafting the statute to require courts to address federal immunity defenses at the outset of every case, Congress transformed what might have been a speculative federal question into a \"necessary\" federal ingredient.\n\nI do not believe the constitutionality of a jurisdictional statute should depend on such drafting peculiarities. In the FSIA, Congress could have permitted defendants to raise sovereign immunity as a federal defense, rather than requiring the issue to be decided as a jurisdictional prerequisite. If Congress had done so, the federal ingredient would have been no less substantial. Similarly, in cases that would otherwise involve only state law, Congress could always require that some substantive federal defense be addressed at the outset. For example, in public liability actions, it could have required the court to determine that the defendant has no Eleventh Amendment immunity, even if the Eleventh Amendment is implicated in only a small fraction of cases. Article III would have few practical limits if the constitutional inquiry turns solely on whether Congress requires that some federal defense be addressed in every case.\n\nI believe Verlinden must ultimately rest upon more than the statutory requirement that immunity be confronted at the outset of every case. If the immunity issues were of little federal concern, or would be implicated in only a small number of cases, the fact that they must necessarily be addressed should not affect the Article III inquiry. Rather, the Court stressed that \"actions against foreign sovereigns in our courts raise sensitive issues concerning the foreign relations of the United States, and the primacy of federal concerns is evident.\" Id. at 493. The Court also emphasized that the FSIA represents a \"comprehensive regulatory statute.\" Id. at 497.\n\nBut even if Verlinden rests upon the particular way in which Congress drafted the FSIA, it would not control here. As I have noted, there are no substantive federal questions present at the outset of every public liability action. Congress has not chosen to require courts to address substantive federal defenses in every case. Rather, we must rely upon the existence of substantive federal issues that will likely, but not necessarily, arise in every case.\n\nB. DISCUSSION\n\nBecause the scope of the Arising Under clause is broader than its statutory counterpart, a jurisdictional grant is not unconstitutional merely because a federal question is not apparent from the plaintiff's complaint. Because of the complex involvement of federal law in the wide range of state law cases, it is difficult to determine when Congress has exceeded its authority in providing original federal jurisdiction when federal issues are only speculative. Nevertheless, I believe it is possible to identify factors that should guide the inquiry.\n\nOne important factor is the likelihood that substantive federal issues will arise in a particular class of cases. Article III strikes a balance between the legitimate domains of state and federal courts. If a particular jurisdictional grant encompasses only a small proportion of cases in which a federal question will ever be raised, the incursion on state court authority might be considered too large. I would therefore determine whether Congress' grant of jurisdiction bears a substantial relationship to the federal interest in ensuring that a federal court be available to enforce federal law. Although it will not be possible to estimate with mathematical certainty the likelihood that federal questions will arise in a particular class of cases, we can examine the relationship between the scope of the jurisdictional grant and the ultimate rationale for providing original federal jurisdiction.\n\nIn this vein, Congress has alternatives to providing original federal jurisdiction when federal questions are not directly implicated in the plaintiff's cause of action. In addition to federal appellate review, Congress may provide for federal removal jurisdiction upon the raising of a federal question. The dissent in Osborn felt that these were the only permissible methods of conferring federal jurisdiction when the existence of federal questions is speculative. See 22 U.S. (9 Wheat.) at 889 (Johnson, J., dissenting) (\"I see no practical mode of determining when the case does occur, otherwise than permitting the cause to advance, until the case for which the constitution provides shall actually arise.\"). See also Mesa v. California, 489 U.S. 121, 103 L. Ed. 2d 99, 109 S. Ct. 959 (1989) (avoiding constitutional difficulties by interpreting federal officer removal statute as authorizing removal only when a federal defense is raised); Lincoln Mills, 353 U.S. at 481-82 (Frankfurter, J., dissenting).\n\nOsborn establishes that Congress is not necessarily relegated to providing appellate or removal jurisdiction when the existence of federal questions may be speculative. Nevertheless, if there are any limits on the ability of Congress to confer original jurisdiction over such cases, the availability of this option is a factor to be considered. In Osborn, the Court rejected appellate jurisdiction as an alternative, because a claimant under federal law should not be relegated to \"the insecure remedy of an appeal, upon an insulated point, after it has received that shape which may be given to it by another tribunal, into which he is forced against his will.\" 22 U.S. (9 Wheat.) at 822-23. In situations such as Osborn, where Congress is specifically concerned with state hostility to federal interests, this factor might carry weight. In Verlinden, the Court was concerned that sensitive issues of foreign relations would be implicated if an immune foreign sovereign were forced to litigate in state court. Consequently, it is important for a federal court to decide federal immunity issues in an exercise of original jurisdiction.\n\nBut Congress may have other valid reasons for desiring that federal courts assume original, rather than appellate or removal, jurisdiction. For example, if potential federal issues are intertwined with the merits of the case and cannot be discerned at an early stage of litigation, appellate or removal jurisdiction might not adequately ensure that a federal court could fully adjudicate all aspects of federal law. Conversely, if federal issues are collateral to the merits, or easily discerned at the outset of the case, the need for original jurisdiction would be lessened. The existence or lack of a valid preference for original jurisdiction should be an important factor when Congress has granted such jurisdiction over cases that do not satisfy the well-pleaded complaint rule.\n\nGuided by these principles, I would examine the ways in which federal law could be implicated in public liability actions. The Amendments provide the options of original federal jurisdiction and immediate removal for almost all claims asserting \"any legal liability\" on account of a nuclear incident. This definition apparently encompasses any state law cause of action, but the vast majority would presumably sound in tort. In general, there are three important ways in which federal issues could be implicated in these actions. First, a federal statute or regulation might be relevant in determining the applicable standard of care. Second, in the event of an extraordinary nuclear occurrence, federally indemnified defendants may be required to waive certain defenses. Third, various federal statutes or regulations affect a plaintiff's amount of recovery in certain cases, as well as the allocation of costs among defendants and the federal government.\n\n1. Federal Standard of Care\n\nThe majority relies primarily on the pre-emption of state tort law duties by federal regulations. In the cases before us, at least some plaintiffs have alleged negligence per se predicated on defendants' failure to follow applicable federal safety regulations. Similar claims will doubtless arise in many public liability actions. Nuclear power is subject to pervasive federal regulation, and it is likely that a tort suit arising out of a nuclear incident will touch on some issue governed by federal standards. Absent an express federal cause of action for the violation of federal safety standards, incorporation of those standards into state tort claims would probably not satisfy the well-pleaded complaint rule. See Merrell Dow Pharmaceuticals Inc. v. Thompson, 478 U.S. 804, 92 L. Ed. 2d 650, 106 S. Ct. 3229 (1986). In any event, we are bound by our decisions in Stibitz and Kiick, which imply as much. However, the constitutional inquiry is not limited by such considerations. If Congress had granted original federal jurisdiction only over state law claims incorporating federal standards, such a grant would likely be constitutional. Federal law would be a non-speculative ingredient in every case.\n\nAs I see it, the difficulty here is that § 2210(n)(2) encompasses more than just actions incorporating federal standards of care. Public liability actions include virtually all claims based upon any legal liability arising out of a nuclear incident. Conceivably, some actions might not sound in tort at all, and others could implicate areas of activity not explicitly governed by federal standards. See Silkwood v. Kerr-McGee Corp., 464 U.S. 238, 255, 78 L. Ed. 2d 443, 104 S. Ct. 615 (1984) (state tort law principles apply to nuclear accidents unless \"expressly supplanted.\"). Although many or all of the cases before us now may contain claims based upon the violation of federal regulations, we are met with a facial challenge to the constitutionality of the entire jurisdictional grant, and have not been asked to restrict its application to such cases.\n\nMoreover, it is not clear to me that Congress has precluded state law tort suits predicated on standards of care that do not conform to federal regulation. As the majority notes, in Pacific Gas \u0026 Electric Co. v. State Energy Resources Conservation and Development Commission, 461 U.S. 190, 75 L. Ed. 2d 752, 103 S. Ct. 1713 (1983), the Court held that the Atomic Energy Act pre-empts all state regulation of nuclear safety. But in Silkwood v. Kerr-McGee Corp., 464 U.S. 238, 78 L. Ed. 2d 443, 104 S. Ct. 615 (1984), the Court considered the holding of Pacific Gas in the context of private tort law. In Silkwood, the Court held that Congress did not intend to pre-empt punitive damages awards under state tort law. The Court relied on the legislative history of the Price-Anderson Act, which indicated that Congress intended to retain all state tort law remedies. The Court noted that \"Congress assumed that traditional principles of state tort law would apply with full force unless they were expressly supplanted,\" and that the defendant has the burden of demonstrating pre-emption. Id. at 255. It also indicated that a state may impose strict liability for nuclear accidents. Id. at 254, 256. See also Goodyear Atomic Corp. v. Miller, 486 U.S. 174, 186, 100 L. Ed. 2d 158, 108 S. Ct. 1704 (1988) (Characterizing Silkwood as finding that \"Congress was willing to accept regulatory consequences of application of state tort law to radiation hazards even though direct state regulation of safety aspects of nuclear energy was pre-empted.\").\n\nIf state tort law may hold a nuclear plant operator strictly liable, or establish some other standard of care that does not conform to federal regulation, the federal law quotient in public liability actions would be decreased. As noted in the majority opinion, notwithstanding Silkwood, at least two district courts have found that the Price-Anderson Act pre-empts state tort suits that do not adopt federal regulations as the standard of care. See Hennessy v. Commonwealth Edison Co., 764 F. Supp. 495 (N.D. Ill. 1991); O'Conner v. Commonwealth Edison Co., 748 F. Supp. 672 (C.D. Ill. 1990). In Hennessy, however, the court left open the issue of whether state law may impose strict liability for nuclear incidents.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nUnlike the majority, I would not decide these issues here. Regardless of whether state tort law may impose a standard of care that differs from federal norms, that law will often incorporate federal standards, and therefore a large number of public liability actions will rest upon alleged violations of federal regulations. In other cases, defendants will raise these issues in defense. Because federal safety regulations will play an integral role in a large proportion of such actions, Congress could validly desire that a federal court be open to interpret these regulations when they become an issue.\n\nBut I would not predicate the constitutionality of § 2210(n)(2) solely on the likelihood that federal safety regulations will play a role in public liability actions. If Congress wishes to ensure that federal courts decide these important issues, it need not grant broad original jurisdiction over all state law claims. Congress could have provided original jurisdiction where the plaintiff's cause of action directly incorporates a violation of federal law, and removal jurisdiction where the defendant raises a federal regulatory issue in defense. Although there might be some disruption of the proceedings in the latter instance, it is likely that such federal defenses could be raised early enough to avoid undue hardship. As I note below, though, I believe Congress had other valid reasons for providing original jurisdiction here.\n\n2. Waivers of Defenses\n\nUnder § 2210(n)(1), Congress provided that in the event of certain extraordinary nuclear occurrences (\"ENOs\"), the Nuclear Regulatory Commission or the Secretary of Energy may require potential defendants to waive various state law defenses. The effect of these waivers would be to create a uniform federal strict liability standard for covered accidents. See Duke Power Co. v. Carolina Environmental Study Group, Inc., 438 U.S. 59, 65-66, 57 L. Ed. 2d 595, 98 S. Ct. 2620 (1978) (citing S. Rep. No. 1605, 89th Cong., 2d Sess. 6-10 (1966)). The statute gives detailed descriptions of the issues and defenses to be waived, and provides that the waivers \"shall be effective regardless of whether such issue or defense may otherwise be deemed jurisdictional or relating to an element in the cause of action.\" 42 U.S.C. § 2210(n)(1) (1988). The waivers are expressly made judicially enforceable. Id.\n\nIt appears likely that Congress could provide original federal jurisdiction over those nuclear incidents to which the § 2210(n)(1) waivers would apply. The waivers essentially define a federal cause of action for certain covered accidents. But there are problems with relying on these provisions alone to sustain § 2210(n)(2). First, § 2210(n)(1) applies only to ENOs, while § 2210(n)(2) applies to all nuclear incidents. The Nuclear Regulatory Commission has conclusively determined that the TMI incident was not an ENO, and that decision is not subject to judicial review. See id. § 2014(j). Consequently, § 2210(n)(1) has no application to the cases before us. Although we are met with a facial challenge, and need not rely solely on factors applicable to this case, I would not place much emphasis on § 2210(n)(1) in sustaining § 2210(n)(2). Not only does § 2210(n)(1) apply only to a limited class of public liability actions, but that class of cases can be ascertained by reference to a single administrative pronouncement. See 10 C.F.R. § 140.83 (1991) (ENO determination ordinarily made within 90 days of incident). Thus, if § 2210(n)(1) were the sole predicate for federal jurisdiction, Congress could have easily narrowed the scope of the grant to include only cases in which it might be implicated.\n\nPrior to the Amendments, Congress provided original jurisdiction only for ENOs. Given the effect of § 2210(n)(1) on liability for such occurrences, this earlier version of § 2210(n)(2) would certainly stand on stronger constitutional ground. But the application of § 2210(n)(1) would be speculative even in those instances. The waivers apply only in certain enumerated cases. See 42 U.S.C. § 2210(n)(1)(A)-(F) (1988). Moreover, they apply only to the extent that liability has been indemnified or insured. Finally, the statute does not mandate that administrative officials require waivers in every insurance policy or indemnification contract. Nevertheless, in the event of an ENO, the determinations of whether and how the waivers apply would be substantive federal questions arising in almost every case. Under Verlinden, these determinations would probably be sufficient to sustain a narrower grant of jurisdiction over cases arising out of ENOs.\n\n3. Financial Protection Scheme, Indemnification Provisions, and Liability Limitations\n\nThe central focus of the Price-Anderson Act is its comprehensive scheme for insuring and indemnifying nuclear power plant licensees and contractors, and for limiting and apportioning liability arising out of nuclear incidents. These provisions were enacted primarily in response to the nuclear power industry's concerns that potential liability would hinder the development of nuclear power. See generally Duke Power Co. v. Carolina Environmental Study Group, Inc., 438 U.S. 59, 63-67, 57 L. Ed. 2d 595, 98 S. Ct. 2620 (1978).\n\na. Statutory Scheme\n\nThe Nuclear Regulatory Commission is authorized to require power plant licensees and contractors to carry a certain amount of insurance or other forms of \"financial protection.\" 42 U.S.C. § 2210(a),(b) (1988). In addition to the amounts available from private sources, licensees must participate in an industry-wide \"retrospective\" insurance plan that assesses \"deferred premiums\" after a nuclear incident when it appears that the primary protection will be exceeded. Id. § 2210(b). This plan has the effect of spreading excess liability across the entire industry. The Commission is required to indemnify licensees for public liability in excess of the required level of insurance. Id. § 2210(c). Thus, indemnification makes up the difference between the required level of insurance and the Act's liability limitations. Indemnification also extends to any other person who may be liable for public liability, which ensures that every victim will be compensated from some source. Id. §§ 2014(t), 2210(c). Special insurance and indemnification provisions apply to certain government contractors. Id. § 2210(d).\n\nThe Act places limits on the aggregate liability for a single nuclear incident. Id. § 2210(e). For larger facilities and licensees required to carry more than $560,000,000 in insurance, the limit is the amount of required insurance. For larger facilities, the limit also includes a surcharge to cover legal fees in certain instances. For other licensees, the limit is $560,000,000, except that it is somewhat lower when the required insurance is less than $60,000,000. Other limits are applicable to contractors specially covered under § 2210(d), and incidents occurring outside the United States. For nuclear incidents occurring after August 20, 1988, the Amendments also prohibit the awarding of punitive damages, and immunize certain lessors. Id. § 2210(s), (r) (for effective date, see Price-Anderson Amendments Act of 1988, Pub. L. 100-408, § 20(a), 102 Stat. 1066, 1084). The Act ensures aggregate recovery by plaintiffs up to the limits set in § 2210(e). A certain amount of liability will be covered by the required insurance, and the government must indemnify the defendant for the balance.\n\nIf the limits are exceeded, special provisions apply. Upon the motion of any interested party, the federal district court in the district where the nuclear incident occurred must determine whether the aggregate liability may exceed the limits provided in the Act. Id. § 2210(o)(1). If the court determines that the limits may be exceeded, it must formulate a distribution plan to \"insure the most equitable allocation of available funds.\" Id. § 2210(o)(1)(C). This plan must include allocations for latent injury claims which may not be discovered until a later time. Id. No payment may exceed 15% of the liability limits without prior court approval. Id. § 2210(o)(1)(A). Payment of legal fees is also subject to restrictions. Id. § 2210(o)(2). If the liability limits are exceeded, Congress is directed to provide full and prompt compensation for the unsatisfied liability. Id. § 2210(e)(2), § 2210(i).\n\nb. Financial Protection and Indemnification Provisions\n\nAn important feature of the Price-Anderson Act is its \"omnibus coverage\" scheme. See, e.g., House Report, Part 1 at 5. In return for limiting defendants' liability in certain instances, the Act ensures compensation up to those limits from either required insurance or government indemnification. See Duke Power, 438 U.S. at 90-92 (assured compensation is adequate substitute for limited liability). There will be virtually no cases in which compensation will not come from one of these federally-mandated sources. As one report notes, \"the insurance and other financial protection requirements, indemnities, and limitations on liability cover any person found liable for damages from a nuclear incident.\" House Report, Part 3 at 16.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Therefore, these provisions arguably constitute federal ingredients applicable to every public liability action.\n\nBut the financial protection and indemnification scheme does not affect the defendant's liability under state law. Rather, it ensures that any judgment can be satisfied once it has been entered. Thus, these provisions are probably not \"original ingredients\" of the plaintiffs' cause of action.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Article III would likely permit Congress to provide original federal jurisdiction over actions requiring government indemnification, if only because the United States would become a party. When the government believes that it will be required to make indemnity payments in a particular action, it is authorized to take over that action and approve any settlement. Id. § 2210(h).\n\nBut government indemnification will not be necessary in every public liability action, as it applies only to liability not covered by required insurance. As for the financial protection provisions, federal questions involving them may arise at various stages of a public liability action. All insurance policies must be approved by the Commission and conform to its regulations. See 10 C.F.R. §§ 140.10-.91 (1991). Consequently, any questions regarding the conformity of a policy to federal regulations would involve substantive issues of federal law. The Commission must approve every policy, and has published detailed sample forms. See id. §§ 140.15(d), 140.91. But every interpretation of the terms of individual policies would not necessarily involve federal questions.\n\nThe omnibus coverage scheme substantially increases the likelihood that federal questions will arise in public liability actions. No claim can be satisfied without reference to this comprehensive scheme. The remaining question is whether Congress had a valid reason for granting original federal jurisdiction over all cases that might implicate these issues, rather than creating some other scheme under which purely state law cases could remain in state court. Federal insurance and indemnification questions are largely collateral to the merits of the plaintiff's cause of action, affecting only the source of funds from which a judgment or settlement could be satisfied. Because of this fact, Congress could have authorized federal declaratory judgment suits in which defendants, insurance companies, and the government could resolve whatever federal law disputes might arise.\n\nThe prospect of federal indemnification might create a valid reason for conferring original federal jurisdiction, because it is not always possible to know at the outset of the case whether the government will be required to indemnify a claim. Factual development will often be necessary before it can be determined that a particular accident is not covered by insurance, or that the limits of financial protection will be exceeded. By this time, it may be somewhat onerous to remove a case to federal court. But this argument could be made of almost every grant that raises the possibility that a federal question might be implicated in some cases. The government is authorized to intervene in public liability actions as soon as it believes it will be required to indemnify a party. Congress could have authorized removal in those instances, as it has under the federal officer removal statute. With respect to that statute, the Court has indicated that any other scheme would be unconstitutional. See Mesa v. California, 489 U.S. 121, 103 L. Ed. 2d 99, 109 S. Ct. 959 (1989) (interpreting 28 U.S.C. § 1442(a)(1)). In addition, because the indemnification issues do not directly affect the merits of the plaintiffs' case, the necessity for original jurisdiction is decreased.\n\nc. Liability Limitations\n\nThe liability limitations, including the ban on punitive damages, arguably constitute \"original ingredients\" under Osborn, assuming its broad reasoning is extended past its specific domain.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The right to recover damages is generally considered an element of any tort claim. As the Supreme Court has recognized, the Act's liability cap abrogates common law rights of recovery. See Duke Power, 438 U.S. at 88. Consequently, it could be argued that the federal liability limitations form an \"ingredient\" in any state law cause of action, whether or not they are implicated in a particular case. It is an open question whether a federal remedial scheme governing state law claims is sufficient to sustain a jurisdictional grant.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e In Verlinden, the Supreme Court expressly did not decide whether the FSIA's ban on punitive damages could constitute the federal ingredient necessary to sustain jurisdiction. See Verlinden, 461 U.S. at 495 n.22 (discussing 28 U.S.C. § 1606).\n\nI do not believe that the liability limitations are \"original ingredients\" because they are not necessarily implicated in every case. If the limits are not exceeded and the plaintiff would not otherwise have sought punitive damages, the federal limitations would not be implicated. The Price-Anderson Act does not replace state law remedies in all cases. Rather, it only limits them in certain instances. The application of the liability limitations is therefore speculative, and they do not form \"original ingredients\" in the Osborn sense. Unlike the factors noted in Osborn, they do not form \"unexpressed\" elements in every claim.\n\nNevertheless, Congress was clearly concerned with the prospect that the liability limits might be exceeded. The federal questions discussed above, although important considerations, do not completely explain why Congress amended § 2210(n)(2) to provide for original federal jurisdiction over all nuclear incidents. A central concern was that \"consolidation of claims in a single court would be essential for the orderly distribution of the limited funds available and to assure reservation of sufficient funds for victims whose injuries may not become manifest until long after the accident.\" House Report, Part 1 at 18. Congress felt that such concerns were present even when an incident was not serious enough to qualify as an ENO. Id.\n\nWhen it appears that the liability limits may be exceeded in a particular case, a comprehensive federal distribution scheme is put in place. See 42 U.S.C. § 2210(o) (1988). These statutory provisions ensure that plaintiffs whose claims are adjudicated or settled quickly will not prejudice the recovery of other victims. A federal court is directed to formulate and implement a plan that will ensure equitable distribution of limited funds. Of particular concern with nuclear incidents is the prospect of \"latent injury claims which may not be discovered until a later time.\" Id. § 2210(o)(1)(C). These distribution provisions, together with the liability limits, create substantive federal questions applicable whenever a determination has been made under § 2210(o)(1). The federal questions are substantive in the Osborn sense because the plaintiff's right to recovery can be defeated by federal law.\n\nAs with other substantive federal issues that might arise in public liability actions, the application of these provisions is speculative. The question remains, then, whether Congress had other options that would have allowed state courts to retain jurisdiction over cases involving only state law issues. Congress could have authorized removal of pending cases upon the determination that the liability limits may be exceeded. Similarly, Congress could have retained the pre-Amendments scheme, under which a federal court was authorized to formulate a distribution plan that would also apply to cases pending in state courts. The federal distribution plan is expressly made effective throughout the United States. Id. § 2210(o)(1)(C). This provision was retained for those cases that remain in state court under current law. Consequently, Congress could have ensured that federal law issues be determined by a federal court without also authorizing federal jurisdiction over state law claims that will never involve those issues.\n\nBut I believe the prospect that the limits might be exceeded establishes a valid reason for providing the option of original federal jurisdiction. Unlike the ENO determination, the § 2210(o)(1) determination cannot necessarily be made soon after the nuclear incident. The full scope of potential liability, including latent liability, may not be known until a later time. By this time, Congress' concern for the \"equitable allocation of available funds\" may have been compromised. Initial consolidation of cases would help avoid the premature dissipation of the insurance fund before a § 2210(o)(1) determination can be made. Even before such a determination, the federal courts are authorized to create a \"special caseload management\" panel if cases arising out of the nuclear incident will have an unusual impact on the court's work. Id. § 2210(n)(3). The panel is specifically authorized to establish priorities for the equitable distribution of claims. If all cases must remain in state court pending a § 2210(o)(1) determination, the federal distribution scheme may be rendered less effective.\n\nThe case for original jurisdiction is strengthened by the fact unlike insurance and indemnification issues, federal issues regarding the distribution of limited funds are not completely collateral to the litigation over the merits of the plaintiffs' case. In addition to discerning the facts necessary to make the § 2210(o)(1) determination, a court must examine the conduct of the litigants to determine whether legal costs may be awarded from the insurance fund. 42 U.S.C. § 2210(o)(1)(D) (1988). Such a determination affects the plaintiffs' recovery, because legal costs authorized under § 2210(o)(1)(D) are included when deciding whether the liability limits have been exceeded. Id. § 2210(e)(1). Original jurisdiction helps ensure that a federal court can adjudicate facts necessary for the application of federal law. Cf. P. Bator, P. Mishkin, D. Meltzer \u0026 D. Shapiro, Hart \u0026 Weschler's The Federal Courts and the Federal System 984 (3d ed. 1988) (\"It would be universally conceded that a . . . constitutional function of the federal courts is . . . to establish the facts determinative of the application of federal law even if the law's content and applicability are undisputed.\"). Because the effectiveness of the federal distribution scheme depends in part upon facts adduced during litigation on the merits of the case, the importance of original jurisdiction is increased. Congress should not be limited to authorizing a federal court to issue orders relating to cases pending in state courts.\n\nCongress has admittedly decreased the effectiveness of its own scheme by providing for concurrent jurisdiction. If only some public liability actions are removed to federal court, a concurrent state court adjudication might compromise Congress' desire for the equitable distribution of limited funds. There is no provision for rescinding judgments that have already been satisfied, and a federal court cannot manage the conduct of ongoing state court litigation as it can for federal actions. In addition, a state court adjudication on a question of state or federal law would most likely be binding in a subsequent federal case involving the same defendant. See 28 U.S.C. § 1738 (1988). Congress clearly envisioned that § 2210(n)(2) would be used to consolidate most claims arising out of a nuclear incident. The defendants have removed all cases arising out of the TMI incident, and Congress has further encouraged consolidation by authorizing removal on the motion of the government. But such complete consolidation will not necessarily occur. Nevertheless, the federal scheme would be furthered even if only some cases arising out of a nuclear incident are consolidated.\n\nIV.\n\nIn the current era, Article III imposes few practical limits on the ability of Congress to confer federal jurisdiction. Just as the Commerce Clause and the Tenth Amendment now provide only nominal checks on Congress' ability to legislate substantively, Article III is a relatively minor impediment in the face of pervasive federal regulation. It is not difficult for Congress to enact some substantive law that would support federal jurisdiction over a particular class of cases. Nevertheless, it is still important to recognize constitutional limits when Congress grants original federal jurisdiction over state law claims. Unless Article III is broad enough to encompass protective jurisdiction, a jurisdictional grant must rest on more than a belief that a federal forum would be fairer or more efficient. There must be a sufficient substantive federal law component, and a reason why original federal jurisdiction is important to ensure federal court determinations of federal laws that may be implicated at some point in the litigation.\n\nI would sustain § 2210(n)(2) based upon the substantial likelihood that public liability actions will involve federal questions regarding standards of care, insurance, and indemnification, combined with the need to protect a federal court's ability to formulate and administer a plan for distributing funds if the liability limits are exceeded. Although the application of federal law may be somewhat speculative, Congress had valid reasons for providing the option of original federal jurisdiction. The Price-Anderson Act is a comprehensive regulatory provision directed at ensuring a limited level of recovery for the victims of nuclear incidents, and equitably distributing compensation should those limits be exceeded. Verlinden holds that Article III is not contravened merely because federal questions are not apparent from the plaintiffs' complaint, and upheld a statute where immunity defenses constituted the only federal ingredient. I believe the rationale for permitting original federal jurisdiction is at least as strong here as it was in Verlinden.\n\n\u003cspan class=\"fn\"\u003e1. This section provides, in pertinent part, that, \"If at any time before final judgment it appears that the district court lacks subject matter jurisdiction, the case shall be remanded.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Price-Anderson Act was enacted in 1957 as an amendment to the Atomic Energy Act. Recognizing a substantial federal interest in regulating the safety aspects of the nuclear power industry, Congress sought to encourage the involvement of the private sector in the development of nuclear power by limiting the liability which might be associated with a nuclear incident. In order to encourage private participation in the nuclear energy industry and to ensure that those who might be injured would be adequately compensated, Congress established a system of private insurance and government indemnity. Under the Act, nuclear facilities operators were required to purchase a specified amount of insurance from private carriers. Provision was made for government indemnification above the insurance amounts to an established aggregate limit on liability. See 42 U.S.C. §§ 2210(a)-(c), (e).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. \"Public liability\" had been defined in the Price-Anderson Act prior to the Amendments as \"any legal liability arising out of or resulting from a nuclear incident or precautionary evaluation.\" 42 U.S.C. § 2014(w). This definition was not affected by the Amendments. Also not affected was the definition of \"nuclear incident\" which appears at 42 U.S.C. § 2014(q): The term \"nuclear incident\" means any occurrence, including an extraordinary nuclear occurrence, within the United States causing, within or outside the United States, bodily injury, sickness, disease, or death, or loss of or damage to property, or loss of use of property, arising out of or resulting from the radioactive, toxic, explosive, or other hazardous properties of source, special nuclear, or byproduct material. . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The defendants have argued that the 42 U.S.C. § 1447(d) bar to review applies only to remand orders entered pursuant to section 1447(c) and that the remand provisions of section 1447(c), in turn, apply only to those actions removed pursuant to 42 U.S.C. § 1441. Despite the district court's explicit statement that \"the decision to remand the case at bar is based on § 1447(c),\" the defendants argue that section 1447(c) has no application to cases removed under the Price-Anderson Amendments Act of 1988, 42 U.S.C. § 2210(n), rather than under the general removal provision of § 1441. This argument appears to have its origins in our decision in Pacor, Inc. v. Higgins, 743 F.2d 984 (3d Cir. 1984). In Pacor, we held that the general removal provisions of 28 U.S.C. §§ 1441-1447 had no application to cases removed to the bankruptcy court under the provisions of former 28 U.S.C. § 1478 (amended and now codified as 28 U.S.C. § 1452). We reasoned that section 1478(a) authorized a type of removal not contemplated by section 1441. Where the general removal provisions provided only for removal from a state court to a federal district court, section 1478(a) authorized removal of a proceeding from any other court to the bankruptcy court. Under the former bankruptcy law, the bankruptcy and district courts were separate entities. We also noted that while section 1478 provided that any party could initiate removal to the bankruptcy court, section 1441 permitted defendants alone to seek removal. Relying upon these differences in the provisions for removal, we concluded that the statutory conflicts and inconsistencies which resulted from attempting to reconcile the general removal provisions with the terms of section 1478(a) demonstrated that these general provisions could not have been intended to apply to bankruptcy removals. The narrow holding in Pacor was read broadly by the Court of Appeals for the Eleventh Circuit in In re Federal Sav. and Loan Ins. Corp., 837 F.2d 432 (11th Cir. 1988). The court held that the section 1447(d) bar did not apply to review of remand orders in cases removed pursuant to 12 U.S.C. § 1730(k)(1), the statutory provision which authorizes the FSLIC, when acting as receiver for a federal savings and loan association, to remove to federal court any state court suit to which it is a party. The remand provision of section 1447(c) was intended to apply only to cases removed pursuant to 28 U.S.C. § 1441, and not to cases removed pursuant to statutes with special grants of federal jurisdiction and removal rights, . . . .\" The defendants invite us to apply the rationale of In re FSLIC and to hold that section 1447(d) does not operate to bar review of cases removed under the provisions of the Price-Anderson Amendments Act of 1988 rather than under section 1441. This approach is not viable in light of the Supreme Court's decision in United States v. Rice, 327 U.S. 742, 90 L. Ed. 982, 66 S. Ct. 835 (1946). In Rice, the Supreme Court interpreted the statutory forerunner of section 1447(d) to bar review of a remand order even where removal had been effected pursuant to a statute creating federal jurisdiction in cases involving federally restricted land interests of an Indian. The Supreme Court held that the bar to review was \"intended to be applicable not only to remand orders made in suits removed under [the general removal statutes], but to orders of remand made in cases removed under any other statutes, as well.\" Id. at 752. Citing Rice, at least one other court has declined to follow the ruling in In re FSLIC. See Federal Savings and Loan Ass'n v. Frumenti Dev. Corp., 857 F.2d 665, 669 (9th Cir. 1988). We find the reasoning in Frumenti persuasive and conclude that Rice prevents our holding that section 1447(d) does not extend to review of remand orders in cases removed pursuant to 42 U.S.C. § 2210(n).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The history of what is now section 1447(d) is set forth in United States v. Rice, 327 U.S. 742, 748-49, 90 L. Ed. 982, 66 S. Ct. 835 (1946). Prior to \"the Judiciary Act of March 3, 1875, 18 Stat. 470, 472, an order of remand was deemed to be not reviewable by appeal or writ of error because the order was not final. . . . But § 5 of the Act of 1875 expressly authorized the review of an order of remand by appeal or writ of error 'in any suit' removed from a state court. This provision was repealed by § 6 of the Act of 1887 . . . .\" Rice, 327 U.S. at 748.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. This section was amended in 1988, Pub. L. No. 100-702, Title X, § 1016(c), 102 Stat. 4670, to provide in pertinent part that, \"If at any time before final judgment it appears that the district court lacks subject matter jurisdiction, the case shall be remanded.\" It is the amended provision which controls here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. For similar statements of the purpose underlying the section 1447(d) bar to review of remand orders, see the cases cited in Herrmann, supra, at 413 n.105.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The Amendments Act was, at least in part, a response to our decisions in Stibitz and Kiick. See S. Rep. No. 218, 100th Cong., 2d Sess. 12, reprinted in 1988 U.S. Code Cong. \u0026 Admin. News 1476, 1488 (referencing Stibitz, the Committee on Environment and Public Works noted that \"the bill expands existing law to allow for the consolidation of claims arising out of any nuclear incident in federal court\"); and H. R. Rep. No. 104, 1st Sess. pt. 1, 18 (noting our holding that the district court did not have jurisdiction over claims arising from the Three Mile Island incident and referring to language in H.R. 1414 in which Congress expressly stated that any suit asserting public liability shall be deemed to be a cause of action arising under the Price-Anderson Act). Thus, in 42 U.S.C. § 2014(hh) Congress states that \"[a] public liability shall be deemed to be an action arising under section 2210 of this title . . . .,\" and in 42 U.S.C. § 2210(n)(2) that \"upon motion . . . any [public liability] action pending in any State court . . . shall be removed. . . .\" (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In recognizing that the policy concerns underlying section 1447(d) are not compromised where a stay has been entered, we do not suggest that the exception to the section 1447(d) bar which we articulate here has no application in cases where remand orders have not been stayed. The policy implications stemming from the procedural posture of other appeals involving constitutionality rulings and section 1447(d) must be evaluated on a case-by-case basis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. We are not swayed from this view by the plaintiffs' argument that because Congress did not set forth a specific exception to section 1447(d) in the Amendments Act which would permit appellate review of all remand orders in cases arising under the statute, no remand order may be reviewable. While we recognize that Congress may specifically exempt all remand orders resulting from interpretation of a particular statute, see The Financial Institutions Reform, Recovery and Enforcement Act of 1989, 12 U.S.C. § 1819(b)(2)(C), the fact that Congress chose not to exempt all such orders arising from removal under the Amendments Act is not dispositive. As well, the fact that some remand orders with origins in the Amendments Act would fall within the bar of section 1447(d) does not alter our view that the remand order in this case, based as it was upon the determination that Congress lacked the power to confer federal jurisdiction over public liability actions, is amenable to review.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Thus we need not reach the question of whether appeal would have been proper under 28 U.S.C. § 1291 or whether this would have been an appropriate case for issuance of a writ of mandamus pursuant to 28 U.S.C. § 1651.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The federal statute which authorizes district courts to hear cases involving federal questions also incorporates an \"arising under\" requirement. See 28 U.S.C. § 1331. The scope of \"arising under\" jurisdiction is different from and broader than the federal question inquiry under section 1331. Verlinden B.V. v. Central Bank of Nigeria, 461 U.S. 480, 496, 76 L. Ed. 2d 81, 103 S. Ct. 1962 (1983). See also Merrell Dow Pharmaceuticals Inc. v. Thompson, 478 U.S. 804, 807, 92 L. Ed. 2d 650, 106 S. Ct. 3229 (1986), where the Court wrote that \"although the constitutional meaning of 'arising under' may extend to all cases in which a federal question is 'an ingredient' of the action, . . . we have long construed the statutory grant of federal-question jurisdiction as conferring a more limited power.\" Most of the caselaw which does address the \"arising under\" concept has been developed in the statutory context and is, therefore, not necessarily dispositive here. Although it is clear that Article III and Section 1331 are not co-extensive, we have not been directed to a single case which discusses the substantive difference in the \"arising under\" requirements of section 1331 and Article III. The outer parameters of Article III are largely unexplored.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. 28 U.S.C. § 1442(a) provides, in pertinent part, that: (a) A civil action or criminal prosecution commenced in a State court against any of the following persons may be removed by them to the district court of the United States for the district and division embracing the place wherein it is pending: (1) Any officer of the United States . . . for any act under color of such office . . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The Supreme Court has, in the past, \"rejected congressional attempts to confer jurisdiction on federal courts simply by enacting jurisdictional statutes.\" Verlinden, 461 U.S. at 495-96. See Mossman v. Higginson, 4 U.S. (Dall.) 12, 1 L. Ed. 720 (1800) (statute granting federal jurisdiction over actions in which \"an alien is a party\" would exceed the scope of Article III if interpreted to permit an action between two aliens); and The Propeller Genesee Chief v. Fitzhugh, 53 U.S. (12 How.) 443, 451-53, 13 L. Ed. 1058 (1852) (court upheld statute granting maritime jurisdiction over vessels on the Great Lakes as an exercise of maritime jurisdiction but held that the statute alone could not support \"arising under\" jurisdiction).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The district court found that the Amendments Act was deficient under the holdings of Verlinden and Osborn: The Act does not satisfy the standard set forth in Osborn; here, \"the right . . . set up by the party [will not] be defeated by one construction of the . . . law . . . and sustained by the opposite construction.\" Osborn, 22 U.S. (9 Wheat) at 822. In Osborn,. . . [the federal Bank] chartering act . . . provided the cause of action and that cause of action could be defeated depending upon construction of the federal law. Similarly, in Verlinden,. . . in cases brought pursuant to . . . [the Foreign Sovereign Immunities Act], if a court determined that none of the exceptions to sovereign immunity embodied in the federal standard were applicable, \"the plaintiff [would] be barred from raising his claim in any court in the United States.\" Verlinden, 461 U.S. at 497 (emphasis added). Here, the right at issue is the right to bring an action for recovery of damages for alleged tortious injuries resulting from nuclear incidents. That right is created by state law and exists regardless of the provisions of the Act. Differing constructions of the Act would only affect the forum in which such an action is maintained. For example, if a federal court determined that a case did not qualify as a \"public liability action,\" the case still could be brought in state court. The state court would apply the same substantive law that the federal court would have applied. The only difference would be the forum in which the case was tried. Quite simply, the right at issue here is not susceptible to defeat by differing constructions of the Act. Id. (citations and footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The background of the Price-Anderson Act, and consequently of the Amendments Act, is set forth in Duke Power, 438 U.S. at 63-67.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. An extraordinary nuclear occurrence was defined as \"any event causing a discharge or dispersal of source, special nuclear, or byproduct material from its intended place of confinement in amounts offsite, or causing radiation levels offsite, which the . . . Commission . . . determines to be substantial, and which the . . . Commission determines has resulted or probably will result in substantial damages to persons offsite or property offsite. . . .\" 42 U.S.C. § 2014(j).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Prior to the Amendments Act, the grant of federal jurisdiction and rights of removal were available only in actions resulting from an extraordinary nuclear occurrence. The decision to expand the jurisdictional grant was based upon the fact that \"the experience with claims following the TMI accident demonstrated the advantages of the ability to consolidate claims after the nuclear incident. Attorneys representing both plaintiffs and defendants in the TMI litigation testified . . . that the ability to consolidate claims in federal court would greatly benefit the process for determining compensation for claimants . . . . The availability of the provisions for consolidation of claims in the event of any nuclear incident . . . would avoid the inefficiencies resulting from duplicative determinations of similar issues in multiple jurisdictions that may occur in the absence of consolidation.\" S. Rep. No. 218, 100th Cong., 2d Sess. 13, reprinted in 1988 U.S. Code Cong. \u0026 Admin. News 1476, 1488.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Public liability, a concept unchanged by the Amendments Act, was defined in the Price Anderson Act as \"any legal liability arising out of or resulting from a nuclear incident or precautionary evacuation . . . .\" 42 U.S.C. § 2014(w).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. In fact, while the pre-Amendments Act cases conclude that Congress did not intend to create a federal cause of action, none of these cases so much as suggests that Congress lacked the power to do so. In Kiick, we concluded that had Congress intended to create a federal cause of action applicable to nuclear incidents, the statutory grant of jurisdiction for extraordinary nuclear occurrences would have been superfluous. \"This statutory grant of jurisdiction [pursuant to pre-amendment act section 2210(n)] would not have been necessary had Congress intended the Price-Anderson Act to 'replace' state tort law; instead, jurisdiction over all nuclear accidents, 'extraordinary' or not, would have been available under 28 U.S.C. §§ 1331 or 1337(a).\" 784 F.2d at 494 (emphasis added). See also Silkwood v. Kerr-McGee Corp., 464 U.S. 238, 240-41, 78 L. Ed. 2d 443, 104 S. Ct. 615 (1984) (the federal government occupies the entire field of nuclear safety concerns).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The two district court cases on point hold that federal law does preempt state law. See O'Conner v. Commonwealth Edison Co., 748 F. Supp. 672 (C.D. Ill. 1990) (certifying the question to the court of appeals). These cases are discussed infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The result is the same regardless of whether the state adopts stricter or more lenient safety standards. If stricter safety standards are imposed, the state will create a disincentive to nuclear power that is in conflict with federal law. If more lenient standards are imposed, the state will undercut federal safety efforts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The defendants have proposed an alternative basis for Article III analysis premised on the theory of \"protective jurisdiction.\" \"Under this theory, Congress may grant federal courts the power to hear nondiversity cases turning on state law as long as those cases bear some relation to a federal interest or to Congress' substantive lawmaking authority under Article I.\" Over-Protective Jurisdiction supra, 102 Harv. L. Rev. at 1953. Because we believe that the issue regarding constitutionality of the Amendments Act can be resolved without resort to this theory, we do not address it here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Protective jurisdiction exists largely in the academic literature. See, e.g., Goldberg-Ambrose, The Protective Jurisdiction of the Federal Courts, 30 UCLA L. Rev. 542 (1983); Mishkin, The Federal \"Question\" in the District Courts, 53 Colum. L. Rev. 157 (1953); Wechsler, Federal Jurisdiction and the Revision of the Judicial Code, 13 Law \u0026 Contemp. Probs. 216 (1948); Note, Over-Protective Jurisdiction?: A State Sovereignty Theory of Federal Questions, 102 Harv. L. Rev. 1948 (1989); Note, The Theory of Protective Jurisdiction, 57 N.Y.U. L. Rev. 933 (1982); Note, Protective Jurisdiction and Adoption as Alternative Techniques for Conferring Jurisdiction on Federal Courts in Consumer Class Actions, 69 Mich. L. Rev. 710 (1971). Although it has been argued that protective jurisdiction was the actual basis for several Supreme Court decisions, the Court recently remarked that \"we have, in the past, not found the need to adopt a theory of 'protective jurisdiction' to support Art. III 'arising under' jurisdiction . . . .\" Mesa v. California, 489 U.S. 121, 137, 103 L. Ed. 2d 99, 109 S. Ct. 959 (1989). Given the strong federal interest in nuclear power, the pervasiveness of federal regulation in the area, and the efficiency gains of consolidating litigation, it is likely that § 2210(n)(2) could be sustained under some or all protective jurisdiction theories. It appears that Congress enacted that provision in part because of the advantages of consolidating mass tort litigation in a single forum, regardless of the substantive federal issues involved. See, e.g., S. Rep. No. 218, 100th Cong., 2d Sess. 13, reprinted in 1988 U.S. Code Cong. \u0026 Admin. News 1476, 1488 (\"Consolidation . . . would avoid the inefficiencies resulting from duplicative determinations of similar issues in multiple jurisdictions. . . .\"); H.R. Rep. No. 104, Part 1, 100th Cong., 1st Sess. 18 (1987) (\"These measures stem from the desire of Congress for equitable and uniform treatment of victims of a nuclear accident and the need to coordinate all phases of litigation that could result from a large nuclear accident.\"). Protective jurisdiction is subject to criticism based on its lack of textual foundation, and the difficulty in developing limiting principles. See Textile Workers Union v. Lincoln Mills, 353 U.S. 448, 460-484, 1 L. Ed. 2d 972, 77 S. Ct. 912 (1957) (Frankfurter, J., dissenting). The traditional interpretation of the Arising Under clause, though, is not completely immune from the latter criticism. 2 The constitutionality of these particular statutes have never been challenged, and they might be sustained without referring to their incorporational provisions. The Lands Act may fall within the Admiralty clause of Article III, which does not require an independent federal law component. See The Propeller Genesee Chief v. Fitzhugh, 53 U.S. (12 How.) 443, 451-53, 13 L. Ed. 1058 (1852). The FTCA may be a valid application of the grant of federal jurisdiction over \"Controversies to which the United States shall be a party.\" I express no opinion, however, on the constitutional bases of these statutes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In this respect, it should be noted that Congress has established as a matter of federal law what amounts to strict liability for many \"extraordinary nuclear occurrences.\" For those accidents, 42 U.S.C. § 2210(n)(1) may require indemnified or insured defendants to waive certain state law defenses. Legislative history makes clear that Congress intended for these waivers to create a common standard of strict liability. See Duke Power Co. v. Carolina Environmental Study Group, Inc., 438 U.S. 59, 65-66, 57 L. Ed. 2d 595, 98 S. Ct. 2620 (1978) (citing S. Rep. No. 1605, 89th Cong., 2d Sess. 6-10 (1966)). Given this fact, it is doubtful that Congress intended to forbid states from imposing strict liability for non-extraordinary nuclear incidents. If Congress intended to permit strict liability, it could be argued that it also intended to permit the less intrusive option of fault-based standards of care that are more stringent than federal regulations. It is even more likely that no conflict with the federal scheme would be posed by less stringent tort standards. The Amendments modify Silkwood's primary holding that punitive damages are never pre-empted by federal law, but it is unclear to what extent the rest of its reasoning survives. The relevance of § 2210(n)(1) to this case is discussed below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The statutory definition of \"persons indemnified\" includes \"any . . . person who may be liable for public liability.\" 42 U.S.C. § 2014(t). Although the substantive indemnification provisions incorporate this definition, they can be read as extending only to accidents involving licensees who are required to carry financial protection. See id. § 2210(c); Silkwood v. Kerr-McGee Corp., 464 U.S. 238, 251-52 n.12, 78 L. Ed. 2d 443, 104 S. Ct. 615 (1984) (government indemnification available only to those required to maintain financial protection). There appears to be some tension between this reading of § 2210(c) and Congress' expressed intent of assuring compensation for every victim of a nuclear incident.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. It appears that the omnibus coverage scheme was designed in part to lessen the plaintiff's burden to identify the defendant whose actions caused the injury. See House Report, Part 3 at 16 (\"Regardless of whether a commercial power plant accident was caused by actions of the licensee, the plant manufacturer, or any other party, liability would be 'channelled' to the licensee and payment would be obtained from the compensation pool funded by utilities. This is another significant departure from normal tort law precepts, and is designed to ease the victim's legal burden by obviating the need to identify the exact party at fault in order to recover damages.\"); see also id., Part 1 at 5. On its face, the Act does not alter state law liability principles, but only assures compensation once liability has been established. However, because every victim is assured of compensation, Congress apparently intended to abrogate any requirement that the victim identify the actual tortfeasor. A court might still have to decide whether compensation will come from an insurance fund or from government indemnification, but the plaintiff would not have to identify a particular defendant. Lessening the plaintiff's burden in this manner would probably not create an original federal ingredient because this feature would not necessarily apply to every case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The ban on punitive damages applies only to nuclear incidents occurring after August 20, 1988, which does not include this case. As I have noted, however, plaintiffs have made a facial challenge to § 2210(n)(2), and we are therefore not necessarily precluded from considering factors applicable only to future cases. But I would not consider the ban on punitive damages to be integral to the validity of § 2210(n)(2). Consequently, even if I were to construe plaintiffs' challenge as limited to the retroactive removal provisions of § 2210(n)(2), I would find the statute constitutional. It should also be noted that punitive damages remain available when the government is not obligated to make payments under an indemnification agreement. See 42 U.S.C. § 2210(s) (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Compare Goldberg-Ambrose, The Protective Jurisdiction of the Federal Courts, 30 UCLA L. Rev. 542, 557-58 (1983) (When federal law controls the measure of damages, \"the rights and obligations of the parties are defined at least in part by federal law, and a constitutional basis for federal jurisdiction exists without resort to an exotic theory of protective jurisdiction.\") with Note, The Theory of Protective Jurisdiction, 57 N.Y.U. L. Rev. 933, 1012 (1982) (Limitation on punitive damages \"is a regulation of the remedial power of the courts. All of the federal courts' remedial powers . . . are creatures of federal law; they do not thereby raise federal questions.\"). In Ives v. W.T. Grant Co., 522 F.2d 749 (2d Cir. 1975), the court sustained federal jurisdiction under a portion of the Truth in Lending Act that authorized a federal remedy for state law claims. The court, however, did not discuss constitutional concerns.\u003c/span\u003e\n\n",
    "body_length": 180843,
    "citedas": [
      "928 F.2d 398"
    ],
    "attorneys": "John R. O'Donnell, Esq., Zarwin \u0026 Baum, Philadelphia, Pennsylvania, COUNSEL FOR APPELLEES, Estate Arthur Tilly, Gertrude Tilly, Vincent Denoncour, Nora Denoncour. Joseph D. Shein, Esq., Philadelphia, Pennsylvania, COUNSEL FOR APPELLEE, Perri C. Kiick. Louis M. Tarasi, Jr., Esq., Tarasi \u0026 Johnson, Pittsburgh, Pennsylvania, COUNSEL FOR APPELLEES, GROUP A See Docket Entry in No. 90-5312 for List of Parties. Arnold Levin, Esq. (ARGUED), Fred S. Longer, Esq., Levin, Fishbein, Sedran \u0026 Berman, Philadelphia, Pennsylvania, Lee C. Swartz, Esq., Sandra L. Meilton, Esq., Hepford, Swartz, Menaker \u0026 Morgan, Harrisburg, Pennsylvania, COUNSEL FOR APPELLEES, GROUP B. See Docket Entry in No. 90-5312 for List of Parties. James R. Adams, Esq., Barley, Snyder, Cooper \u0026 Barber, Lancaster, Pennsylvania, COUNSEL FOR APPELLEES, Family Style Restaurant, Skiadas Brothers, Thomas E. Strauss, Inc., Gettysburg Tours, Inc., Heritage Inns, Inc., Le Smith Wholesale, Lincoln Heritage Inc., Overview Limited, SMG Investments. Peter J. Neeson, Esq., LaBrum \u0026 Doak, Philadelphia, Pennsylvania, COUNSEL FOR APPELLEES, Joan A. Kichman, Charles C. Kichman, Matthew C. Kichman, Kandice M. Kichman. William E. Chillas, Esq., Joseph F. Roda, Esq., Lancaster, Pennsylvania, COUNSEL FOR APPELLEES, Earl Realty, Inc., Amish Homestead, Inc., One Room Schoolhouse, Homestead Gift Shop, Two Twenty-Two Corp., James Cosgrove, Glass Kitchens, Cherry Lane Mtr. Inn, Richard M. Rutt, Noah N. Martin Co., Cont. Inns of America, Pentidatillo Corp. John G. Harkins, Jr., Esq. (ARGUED), A. H. Wilcox, Esq., Ellen Kittredge Scott, Esq., Pepper, Hamilton \u0026 Scheets, Philadelphia, Pennsylvania, Of Counsel: Paul J. Mishkin, Esq., Berkeley, California, COUNSEL FOR APPELLANTS, General Public Utilities Corporation, Metropolitan Edison Company, Jersey Central Power \u0026 Light Company, Pennsylvania Electric Company, Babcock \u0026 Wilcox Company, McDermott Inc., UE \u0026 C - Catalytic, Inc., Burns \u0026 Roe Enterprises Inc., Dresser Industries, Incorporated. Stuart M. Gerson, Assistant Attorney General, James J. West, United States Attorney, William Kanter, Esq., Peter R. Maier, Esq. (ARGUED), Appellate Staff, Civil Division, Department of Justice, Washington, D.C., COUNSEL FOR APPELLANT, United States of America.",
    "category": [
      "124",
      "242",
      "243",
      "251",
      "36"
    ],
    "judges": "Mansmann, Scirica and Higginbotham, Circuit Judges. Scirica, Circuit Judge, concurring.",
    "citation_count": 0
  }
}
