{
  "id": "kbhuTmYBTlTomsSBI7d3",
  "document": {
    "title": "State v. Bey",
    "full_title": "STATE OF NEW JERSEY v. MARKO BEY .",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1992-07-28T00:00:00.000Z",
    "docket": "No. A-51",
    "body": "The opinion of the court was delivered by\n\nSTEIN, J.\n\nIn State v. Bey, 112 N.J. 123 (1988) (Bey II), we affirmed Marko Bey's conviction for the murder of Carol Peniston but reversed the death sentence and remanded the case for a new sentencing proceeding. A second jury returned a death sentence. Defendant appeals as of right to this Court, N.J.S.A. 2C:11-3e, challenging the original conviction on Gerald grounds, see State v. Gerald, 113 N.J. 40 (1988), and the sentence of death because of claimed error in the resentencing proceeding. We affirm defendant's conviction and sentence of death.\n\nI.\n\nThe relevant facts of Ms. Peniston's murder are excerpted from Bey II, supra, 112 N.J. at 131-33:\n\nOn April 26, 1983, around 9:20 p.m., Carol Peniston left Neptune High School, where she had attended a computer course, and drove away in her Ford Granada. Ms. Peniston, who was divorced and living alone, neither returned to her apartment nor reported to work the next day.\n\nSubsequent investigation revealed that [Ms. Peniston's] car had been involved in a one-car collision in Newark * * * on April 26, 1983, approximately four hours after Ms. Peniston left Neptune High School. The defendant's fingerprints were on the rear view mirror.\n\nAt approximately 3:30 p.m. on May 3, Asbury Park police interviewed Attilio Robot, who had found Ms. Peniston's pocketbook near an old industrial building in Asbury Park. Shortly thereafter, the police discovered her body in a shed near the building. An autopsy performed the following day, May 4, disclosed that Ms. Peniston had been dead for several days. The autopsy further disclosed that she had been beaten, sexually assaulted, and strangled. From a sneaker imprint on her chest and from evidence of fractured ribs and hemorrhaging of the right lung, vertebral column, and right atrium of the heart, Dr. Stanley Becker, the Monmouth County medical examiner, concluded that Ms. Peniston's assailant had stomped on her chest. Dr. Becker determined that the ultimate cause of death, however, was ligature strangulation. Subsequent police investigation revealed that characteristics of spermatozoa found on the victim's coat were consistent with those of defendant's saliva, and that defendant's sneakers made an imprint that was similar to the impression on the victim's chest.\n\n[On May 6, defendant was arrested for receiving stolen property, Ms. Peniston's Ford Granada. After five hours in police custody, defendant confessed to the murder.]\n\nHe then gave a written statement, in which he admitted that he accosted Ms. Peniston in front of her apartment building and demanded money from her. The statement continued that when he heard someone coming, he grabbed her and led her to the shed. In the ensuing events, he repeatedly struck Ms. Peniston, sexually assaulted her, and took eight dollars as well as the car keys from her pocketbook. While on his way to Newark in her car, he collided with an iron fence alongside a graveyard, and abandoned the car.\n\nIn defendant's initial trial, a jury convicted him of capital murder. In the penalty-phase, the same jury sentenced defendant to death, finding both aggravating factors proffered -- that the murder had \"involved torture, depravity of mind, or an aggravated assault to the victim,\" N.J.S.A. 2C:11-3c(4)(c) (\"c(4)(c)\"), and that the murder had been committed in the course of a felony, N.J.S.A. 2C:11-3c(4)(g) (\"c(4)(g)\") -- and finding no mitigating factors. This Court affirmed defendant's conviction but reversed the sentence largely because the court had incorrectly charged the jury on the finding of mitigating factors. Bey II, supra, 112 N.J. at 156-72. We remanded for resentencing.\n\nOn the same day that this Court decided Bey II, it also vacated defendant's conviction and death sentence for the murder of Cheryl Alston. State v. Bey, 112 N.J. 45 (1988) (Bey I). There, we held that defendant was not death-eligible because he had committed the murder before the age of eighteen. Id. at 51-52. Defendant was subsequently retried for the Alston homicide and found guilty of purposeful murder. The court sentenced defendant on the murder count to life imprisonment with a thirty-year parole disqualifier and on aggravated sexual assault to a consecutive twenty-year term with a ten-year parole disqualifier. Those sentences were made consecutive to all sentences defendant was then serving. The Appellate Division recently affirmed defendant's conviction for the Alston murder. N.J. Super. certif. denied, N.J. (1992).\n\nIn February 1990, defendant moved in the Law Division for a new guilt-phase trial in the Peniston murder based on our decision in Gerald, supra, 113 N.J. 40. The court denied the motion, and both the Appellate Division and this Court denied leave to appeal.\n\nIn June 1990, the Law Division considered and resolved a number of pretrial motions regarding the Peniston resentencing proceeding. The court denied defendant's motion to dismiss the petit jury panel for unconstitutional under-representation of blacks but it granted defendant's motion to inspect and copy all jury records in the possession of the Monmouth County Clerk and to communicate with jurors to determine their race. The court denied without prejudice defendant's motion for change of venue. The court also granted defendant's motion to strike the c(4)(c) aggravating factor but denied defendant's motion to dismiss the prior-murder aggravating factor.\n\nVoir dire lasted six days. Fourteen jurors were selected to hear the case, two of whom were designated as alternates immediately prior to jury deliberations. During voir dire, the court questioned potential jurors about whether their knowledge that defendant had already been sentenced for a prior murder to life imprisonment with a forty-year parole-ineligibility period would affect their impartiality.\n\nThe resentencing trial lasted seven days. The State sought to prove two aggravating factors, that defendant had committed a prior murder, c(4)(a), and that the murder had occurred during the course of sexual assault and robbery, c(4)(g). The defense did not contest the aggravating factors but argued that they were outweighed by four mitigating factors: (1) \"defendant was under the influence of extreme mental or emotional disturbance,\" N.J.S.A. 2C:11-3c(5)(a) (\"c(5)(a)\"); (2) defendant's age at the time of the murder, N.J.S.A. 2C:11-3c(5)(c) (\"c(5)(c)\" or \"ago mitigating factor\"); (3) \"defendant's capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law was significantly impaired as the result of mental disease or defect or intoxication,\" N.J.S.A. 2C:11-3c(5)(d) (\"c(5)(d)\"); and (4) \"any other factor which is relevant to the defendant's character or record or to the circumstances of the offense,\" N.J.S.A. 2C:11-3c(5)(h) (\"c(5)(h)\" or \"catch-all factor\").\n\nTo prove the prior murder, the State called Dr. Stanley Becker, the Monmouth County pathologist, who described the cause of death as asphyxia due to strangulation, and detailed the wounds inflicted on Ms. Alston. Investigator Phillip George described the appearance of the victim when found and the presence of a two-by-four at the crime scene. He also reported that the victim was subsequently identified as Cheryl Alston, and that she was nineteen years old at the time of death. Investigator Michael Dowling had testified that a jury had convicted defendant of murdering Ms. Alston, and the State introduced Ms. Alston's death certificate into evidence.\n\nTo establish that the Peniston murder had occurred during the commission of a felony, the State produced evidence indicating that defendant had sexually assaulted and robbed the victim: her semen-stained raincoat, her raincoat belt and scarf (both found tied around her neck), buttons from her dress, other articles of clothing, a crime-scene photograph depicting the victim when found, and the rear-view mirror from the victim's car containing defendant's fingerprints. Investigator Dowling testified about the significance of those items and described his investigation of the murder.\n\nIn addition, the State's pathologist, Dr. Becker, testified that Ms. Peniston had been strangled from behind and sexually assaulted. He graphically described the brutal injuries inflicted on the victim's face and chest. Investigator George read to the jury defendant's station-house confession of robbery and rape. A New Jersey State Police forensic scientist, Henry Swordsma, testified that the sperm stain found on Ms. Peniston's raincoat was consistent with defendant's whole blood sample. Finally, the State moved Ms. Peniston's death certificate into evidence.\n\nIn support of the mitigating factors, the defense presented evidence concerning defendant's upbringing through the testimony of four witnesses: defendant's mother (Patricia Bey), aunt (Gwendolyn El), uncle (Clarence Horton), and a family friend (Juliet El). We summarize the pertinent aspects of defendant's background. Defendant was the second of Patricia Bey's four children. An alcoholic, Ms. Bey drank heavily while pregnant with defendant. Six months after defendant was born, his father threw Ms. Bey and her children out of his apartment because she was seeing another man. Ms. Bey moved in with her sister, and soon moved her family to another apartment down the street. Over the next few years, Ms. Bey had two more sons and moved frequently.\n\nDefense witnesses testified that Ms. Bey had neglected and abused her children. She kept the lights off in the apartment, and covered the windows and mirrors out of an alcohol-induced paranoia that the devil would get her. Several witnesses described the cold, dark, slovenly state of the Beys' apartments and the unkempt condition of the children. Defendant began drinking at age nine and he began using drugs, particularly marijuana, at age eleven.\n\nGrowing up, defendant frequently received severe, unpredictable beatings with broom handles, belts, belt buckles, straps, and other items. Ms. Bey testified that on one occasion she knocked defendant down, causing him to hit his head on a coffee table and lose consciousness. Although defendant's head was gashed, she did not take him to a doctor. Ms. Bey also recalled another time when her neighbors had threatened to call the police if she did not stop beating defendant. Gwendolyn El surmised that Ms. Bey had singled out defendant for these brutal beatings because his father had spurned her. She also ascribed defendant's crimes to defendant's anger against his mother: \"mentally Marko did not kill those two women, it was his mother that he was killing.\"\n\nThrough the testimony of three medical experts, the defense sought to prove that at the time of the murder, defendant was undergoing an extreme mental or emotional disturbance (c(5)(a)) and that his moral capacity was significantly impaired by mental defect and intoxication (c(5)(d)). All three defense experts attributed defendant's psychiatric condition to organic brain damage. Dr. Gary Kay, a clinical neuropsychologist, testified that he had conducted several tests on defendant over a period of nine hours. Based on defendant's performance in those tests, Dr. Kay found \"the possibility of mild * * * long-standing brain damage localized in the left frontal region.\" He then theorized that defendant's in utero exposure to alcohol, defendant's preadolescent consumption of drugs and alcohol, and defendant's two early head injuries (the blow against the coffee table and a bicycle accident) could have seriously interfered with his frontal-lobe development. He described that impairment as brain dysfunction rather than a structural abnormality, which would partly explain defendant's violence and intense emotional responses. Dr. Kay noted that defendant's mood swings, suspiciousness, and extremes of irritability and rage supported the diagnosis of brain damage.\n\nDr. John Young, a forensic psychiatrist, described his three-hour examination of defendant. Dr. Young concluded that defendant suffered from organic personality syndrome\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and pointed to several possible causes: defendant's in utero exposure to alcohol, abused childhood, preadolescent drug and alcohol use, early head injuries, lack of a fatherly presence, and the conditions in the Bey household. Dr. Young found that defendant's mood swings, outbursts of rage, impaired social judgment, apathy or indifference, and suspiciousness or paranoia were consistent with his findings. He concluded that defendant's murder of Ms. Peniston had been triggered by a stimulus that had caused him to lose control. Dr. Young also testified that defendant had been helped by medication and the structured environment of prison.\n\nFinally, Dr. Jonathan Pincus, a neurologist, testified in a similar fashion. Dr. Pincus discussed his studies of juvenile delinquents, which had indicated that child abuse and neurological dysfunction are causatively linked to violent behavior. Dr. Pincus suggested that Ms. Bey's unpredictable abuse of defendant was a likely cause of his paranoia. In addition, he found evidence of neurological impairment based on defendant's background of alcohol exposure, alcohol and drug abuse, early head trauma, and palsied hand-movements. Dr. Pincus also rejected a diagnosis of antisocial personality disorder,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e arguing that that diagnosis \"is a mere scriptor of antisocial behavior [and] doesn't say anything about the cause of it.\" Dr. Pincus and Dr. Young both testified that during their interviews with defendant, he had displayed remorse for his crimes.\n\nThrough cross-examination of defendant's medical experts, the State sought to support its theory that defendant suffered merely from antisocial personality disorder rather than any organic dysfunction of the brain. The State also presented the rebuttal testimony of Dr. Timothy Michals, a psychiatrist, who concluded that defendant's antisocial personality disorder did not affect his ability to appreciate the wrongfulness of his conduct or to conform his conduct to the law. Rather, he testified that defendant's personality disorder reflected a conscious choice to break society's rules. He also noted that defendant's improved behavior in prison contradicted the diagnosis of organic personality syndrome. Moreover, Dr. Michals pointed to the following evidence that defendant had not lost control at the time of the murder: defendant removed the victim to a secluded spot, removed her glasses to hinder identification, and afterwards stole her car and drove forty minutes to Newark. He also explained that defendant's show of remorse merely reflected fear of a death sentence.\n\nFinally, in an attempt to counter the defense's testimony that Ms. Bey's Neptune residence had lacked lighting, a supervisor at Jersey Central Power \u0026 Light testified that the power had been shut off only once between 1978 and 1983.\n\nThe jury deliberated for approximately three hours. They found the presence of both aggravating factors beyond a reasonable doubt. Only two jurors found extreme mental or emotional disturbance, c(5)(a). None of the jurors found the age mitigating factor, c(5)(c), or the significant impairment of moral faculties, c(5)(d). Six found the catch-all factor, c(5)(h). The jury unanimously found beyond a reasonable doubt that the aggravating factors outweighed the mitigating factors that had been found. After polling the jury, the court sentenced defendant to death.\n\nII.\n\nGuilt-Phase Issues\n\nA. Death-Eligibility under Gerald\n\nDefendant argues that his murder conviction does not establish death-eligibility under Gerald, supra, 113 N.J. 40. In that case, decided two months after Bey II, we held that defendants cannot be subjected to the death penalty for murder if they were convicted of purposely or knowingly causing serious bodily injury resulting in death (SBI murder). Id. at 69-90. Gerald requires that juries clearly distinguish between capital murder (defendant intended death) and non-capital murder (defendant intended serious bodily injury). In pre-Gerald cases, when the jury returned a death sentence without being instructed on the distinction between capital murder and SBI murder, this Court must examine the record to ensure that the sentence is not based on a conviction for SBI murder. If the evidence in such cases could have supported convictions for either capital murder or SBI murder, then the defendant's conviction is reversible error and the death sentence must he vacated. See State v. Erazo, 126 N.J. 112, 126-28 (1991); State v. Dixon, 125 N.J. 223, 251-55 (1991); State v. (Samuel) Moore, 122 N.J. 420, 484-86 (1991); State v. Harvey, 121 N.J. 407, 412-14 (1990), cert. denied, U.S...., 111 S. Ct. 1336, 113 L. Ed. 2d 268 (1991); State v. Clausell, 121 N.J. 298, 313-16 (1990); State v. Pennington, 119 N.J. 547, 560-65 (1990); State v. Long, 119 N.J. 439, 460-65 (1990); State v. Coyle, 119 N.J. 194, 208-12 (1990); Gerald, supra, 113 N.J. at 69-92. In deciding the Gerald issue, this Court is \"not second-guessing\" jury verdicts but rather determining whether the jury had a rational basis to conclude that defendant might have intended to cause only serious bodily injury. Dixon, supra, 125 N.J. at 254. If such a rational basis exists, but, despite that fact, no Gerald charge was given, then the defendant's death sentence must be overturned.\n\nIn this case, the court specifically instructed the jury that it could find defendant guilty of capital murder if it found that he intended to inflict serious bodily injuries that resulted in death. After defining murder as the purposeful or knowing intent to cause death or serious bodily injury resulting in death, the court explained:\n\nIt is not necessary for the State to produce a witness or witnesses who could testify that the defendant stated, for example, that his purpose was to cause the death or serious bodily injury resulting in death, or that he knew that what he was doing would kill Carol Penniston [sic] or was practically certain to cause her death or serious bodily injury resulting in death.\n\n[Emphasis added.]\n\nBy contrast, the jury interrogatory referred only to \"murder by knowingly or purposely causing the death of Carol Peniston,\" without mentioning serious-bodily-injury murder. Nonetheless, the interrogatory's phrasing did not obviate the need for a jury instruction clearly differentiating between capital murder and SBI murder. To determine whether the jury could have convicted defendant only of capital murder, we must examine the evidence presented to the jury.\n\nIn Gerald, we noted that in some cases, in which the jury did not clearly distinguish between capital murder and SBI murder, the evidence might lead to the inescapable Conclusion that the defendant intended the death of the victim. Gerald, supra, 113 N.J. at 79-80 (citing State v. Ramseur, 106 N.J. 123, 162 (1987), and State v. Biegenwald (Beigenwald II), 106 N.J. 13, 20 (1987)). This inquiry is necessarily fact-specific. In three cases, we found that the manner of the murder, in conjunction with the defendant's statements or actions, left no doubt that the defendant had intended death. See State v. McDougald, 120 N.J. 523, 558-60 (1990) (defendant cut victims' throats, bludgeoned one with baseball bat, and expressed his intent to kill victims both before and after the homicides); State v. Pitts, 116 N.J. 580, 614-20 (1989) (Vietnam veteran defendant threatened to kill victims two days before murder, inflicted twenty-five to thirty stab wounds with combat knife, cut one victim's throat twice, and paused to take pulse of victims to verify death); State v. Hunt, 115 N.J. 330, 374-77 (1989) (defendant stated intent to kill immediately prior to stabbing victim twenty-four times and afterwards admitted to killing). In another two cases, we found that the manner of killing alone indicated that the defendant could have intended only to cause death. See State v. Hightower, 120 N.J. 378, 412-14 (1990) (defendant shot the victim at close range in the chest, neck, and head, and then dragged the victim into a freezer); State v. Rose, 120 N.J. 61, 63-64 (1990) (Rose II) (defendant fired shotgun point-blank at victim's abdomen).\n\nAt trial, the jury heard defendant's oral and written confessions, as well as his testimony about the crime. Defendant's oral confession was read into the record:\n\nI robbed the lady, I just bugged out, she saw my face * * * I just bugged out, going through her purse, went into her coat pocket, I turned around and she was looking at me.\n\nI started hitting her, I asked \"What are you looking at?\" She fell. She wasn't moving.\n\nDefendant's written confession provided the following description of the crime:\n\nI turned around and she was looking at me. I got scared and I started hitting her. She fell down. She wasn't moving or making any sound or anything. I had sex with her and left.\n\nOn both direct examination and cross-examination, defendant offered similar accounts of the crime. On cross-examination, defendant denied that he had killed the victim to prevent her from identifying him:\n\nWhen she seen my face, that's when I started hitting her, okay? Now, after I started hitting her, it just went on too far, something that shouldn't have went on.\n\nAlthough defendant consistently admitted striking the victim and raping her, he did not recount either strangling her or stomping on her chest. Nonetheless, defendant identified the belt with which he had strangled Ms. Peniston:\n\nQ. You recall the belt, don't you?\n\nA. Yes.\n\nQ. The belt you used to strangle Mrs. Peniston?\n\nA. Yes.\n\nAt the guilt-phase trial, the medical examiner, Dr. Becker, testified that the victim's death had been caused by asphyxia due to ligature strangulation with the victim's scarf or raincoat belt. He detailed the blunt trauma that had damaged the victim's face, fractured her dental plate, and caused cerebral hemorrhaging. Moreover, Dr. Becker described the \"force [that] was applied to the chest wall sufficiently strong not only to fracture the ribs but also to compress a portion of the heart to cause the hemorrhage in the posterior wall of the right atrium,\" and found that blow consistent with the sneaker imprint on the victim's chest. The jury was shown a photograph depicting that sneaker imprint. Thus, the jury heard and viewed graphic evidence that the defendant had brutalized and strangled the victim.\n\nStrangulation is commonly understood as a form of violence designed and likely to kill a victim, and hence would ordinarily not be used by one whose purpose was only to inflict serious bodily injury. See State v. Perry, 124 N.J. 128, 184 (1991) (Stein, J., Concurring in part and Dissenting in part). But cf. State v. Breakiron, 108 N.J. 591, 605-06 (1987) (questioning whether defendant who asserted defense of diminished capacity to murder by strangulation intended death or was practically certain death would occur). Here, Dr. Becker's testimony confirmed that ligature strangulation was the cause of Ms. Peniston's death. Strangulation is an especially brutal means of killing because it requires the murderer to witness the victim's gradual death throes. However, defendant not only strangled the victim from behind, he also smashed her face hard enough to break her dental plate and cause cerebral hemorrhaging, and he stomped on her chest with enough force to crush her ribs, damage her heart, and inscribe his sneaker sole on her chest. Moreover, in his written confession, defendant admitted raping the victim after \"she wasn't moving or making any sound or anything.\" Defendant then left the victim in the abandoned shed. When a defendant employs various means of violence against the same victim, we need not focus on which method actually succeeded in causing death. Rather, we find that defendant's actions, taken as a whole, were so wantonly brutal that he could have intended only to cause death, or knew that death was practically certain to occur. See Pitts, supra, 116 N.J. at 617-18 (\"assault * * * was so violent that death was inevitable\"); People v. Nottingham, 221 Cal. Rptr. 1, 4 (Ct. App. 1985) (when victim was viciously beaten and strangled, court held that \"the method of killing obviously points to an intended killing as opposed to * * * a death [that] is a by-product of actions impelled by some intent other than an intent to kill\"). Overall, we find that defendant's strangulation of the victim and the degree of force applied to the victim's head and chest make it simply \"inconceivable that defendant was not 'practically certain' that his action would kill the [victim].\" Rose II, supra, 120 N.J. at 64.\n\nB. Harmless Error Analysis under Gerald\n\nDefendant further contends that this Court's standard of review for Gerald issues deprives defendants of their constitutional right to have the jury determine all the issues of the crime and to be convicted on proof beyond a reasonable doubt. More specifically, defendant contends that because he was tried before Gerald, he did not have an opportunity to present evidence that he had intended to commit only serious bodily injury. We have implicitly rejected that argument in our prior Gerald decisions. See McDougald, supra, 120 N.J. at 590-91 (Handler, J., Concurring in part and Dissenting in part). In assessing the Gerald issue we examine scrupulously the evidence that was adduced at trial to see whether the jury had a rational basis for finding that the defendant could have intended only serious bodily injury. That standard of review is sufficiently tolerant to allow consideration of whether any evidence could have permitted the jury rationally to conclude that defendant intended only serious bodily injury but not death. Our view of this record is that the evidence that defendant intended to cause death or knew that death was practically certain to occur is so compelling as to exclude the possibility that he possessed a less culpable state of mind. Accordingly, we affirm defendant's conviction for the capital murder of Ms. Peniston.\n\nC. The Mens Rea Element of Capital Murder\n\nDefendant argues that the capital murder statute as limited by Gerald is still defective because it does not guarantee that the jurors unanimously agree on whether the defendant committed the murder knowingly or committed it purposely. The Supreme Court has held that jury unanimity on the mens rea element of an offense is not required when \"two mental states * * * supposed to be equivalent means to satisfy the mens rea element of a single offense * * * reasonably reflect notions of equivalent blameworthiness or culpability.\" Schad v. Arizona, U.S...., ..., 111 S. Ct. 2491, 2503, 115 L. Ed. 2d 555, 573 (1991). We treat knowing murder and purposeful murder as equivalent expressions of moral culpability. In Gerald, supra, we held: \"Our society's ultimate sanction -- the death penalty -- is properly imposed on those who act with the most culpable state of mind, namely, the purpose or knowledge that their victims will die.\" 113 N.J. at 89 (emphasis added). See N.J.S.A. 2C:11-3a(1), (2). That a jury agree unanimously that the defendant's state of mind was either purposeful or knowing is sufficient to find a defendant guilty of capital murder.\n\nIII.\n\nSentencing-Phase Issues\n\nA. Racial Composition of the Petit Jury Panel\n\nDefendant argues that the trial court deprived him of his constitutional rights to equal protection and to a jury composed of a fair cross-section of the community. Before the resentencing proceeding began, defense counsel moved to challenge the racial composition of petit jury panels in Monmouth County. In support of the motion, the defense submitted six affidavits from Monmouth County public defenders stating that the representation of blacks on petit jury panels in the county were far below their proportion of the population (7.91 percent of the age-eligible population in 1980). The defense also presented three certifications, two of which concerned alleged under-representation of blacks in Richard Biegenwald's January 1989 death-penalty resentencing. In the third certification a public defender stated that at defendant's second trial for the Alston murder, only two of the sixty-two prospective jurors were block. The trial court denied the motion for an evidentiary hearing, concluding that the defense had failed to make out prima facie showing of discrimination. However, the court granted defense requests to inspect and copy all jury records and to communicate with the potential jurors on the jury lists, and also left open the possibility of a future hearing if the defense made out a prima facie showing. At the start of jury selection, seven of the 101 prospective jurors were black. Although the defense stated its intention to \"work[] diligently to see if there is a prima facie case,\" it never renewed its motion for an evidentiary hearing.\n\nWe conclude that the trial court did not err in denying defendant an evidentiary hearing. As we noted in Ramseur, supra, \"a defendant has no right to a jury that includes members of his own race.\" 106 N.J. at 216 (citations omitted). To establish a prima facie equal-protection claim, a defendant must identify a constitutionally-cognizable group, prove substantial under-representation over a significant period of time, and demonstrate discriminatory purpose. Coyle, supra, 119 N.J. at 213; Ramseur, supra, 106 N.J. at 215-17. Similarly, a defendant must identify a constitutionally-cognizable group, show unfair and unreasonable representation over time, and prove systematic exclusion to make out a prima facie fair cross-section claim. Coyle, supra, 119 N.J. at 213. Our review of the record indicates that defendant failed to adduce sufficiently reliable statistical data to establish the latter two prongs of both claims. See Ramseur, supra, 106 N.J. at 217-28 (describing the statistical techniques used for demonstrating systematic under-representation of minorities in jury pools). The fact that the percentage of blacks on a defendant's panel was lower than their proportionate representation in the county is insufficient evidence to establish a prima facie case. See Ramseur, supra, 106 N.J. at 217-25; see also United States v. Garcia, 836 F.2d 385, 388 (8th Cir. 1987) (defendant's comparison of number of minorities on his venire to population of minorities in county does not establish prima facie case); People v. Saunders, 543 N.E.2d 1078, 1084-85 (Ill. App. Ct. 1989) (same), appeal denied, 550 N.E.2d 564 (Ill. 1990). Nor do the affidavits of the public defenders relating their recollections of observed jury pools pass muster as reliable statistical data. See People v. Broadnax, 532 N.E.2d 936, 943 (Ill. App. Ct. 1988) (testimony and affidavits of attorneys based on personal experiences and observations were not \"methodologically valid or adequate\" and so did not establish a prima facie case), appeal denied, 537 N.E.2d 812, cert. denied, 493 U.S. 834, 110 S. Ct. 110, 107 L. Ed. 2d 72 (1989). Although defense counsel disclaimed any intention to abandon the issue, defendant's expert had not completed his study in time for the defense to present additional evidence substantiating its claims or to support a renewed motion for an evidentiary hearing prior to trial. Thus, we reject defendant's argument that he made out a prima facie case sufficient to warrant an evidentiary hearing on the issue.\n\nB. Peremptory Challenge of a Black Juror\n\nDefendant argues that the prosecutor's peremptory challenge of the only black juror qualified for jury service violated his right to a fair and impartial jury and to equal protection. During voir dire seven black venirepersons were questioned and six were excused for cause. The only remaining black juror stated, in response to a defense question, that the death penalty should be used as a \"last resort,\" or in \"a very rare situation.\" He also expressed the view that he had \"not seen too many situations where I felt that the death penalty would be an appropriate measure.\" The prosecutor gave the following rationale in exercising a peremptory challenge against that juror: \"he indicated * * * as regards the imposition of capital punishment, that it would be, in his opinion, only in the last resort, in a very rare situation.\"\n\nA prosecutor is forbidden from exercising peremptory challenges to excuse potential petit jurors on the basis of race under both the United States and New Jersey constitutions. See Batson v. Kentucky, 476 U.S. 79, 106 S. Ct. 1712, 90 L. Ed. 2d 69 (1986); State v. Watkins, 114 N.J. 259 (1989). The defense can rebut the presumption that the prosecution properly exercised its peremptory challenges by a prima facie showing that: (1) \"the potential jurors wholly or disproportionately excluded were members of a cognizable group within the meaning of the representative cross-section rule\"; and (2) that a \"substantial likelihood\" exists that the peremptory challenges were motivated by \"group bias.\" State v. Gilmore, 103 N.J. 508, 535-36 (1986). In assessing whether a defendant has made out a prima facie showing, we will examine five factors, including whether the prosecutor struck most or all of the members of the identified group from the venire and whether the prosecution used a disproportionate number of its peremptory challenges against the group. Watkins, supra, 114 N.J. at 266; see McDougald, supra, 120 N.J. at 554-57 (prima facie showing where prosecutor used ten of twelve peremptory challenges to excuse black potential jurors); Watkins, supra, 114 N.J. at 268 (prima facie showing where prosecutor peremptorily challenged every black juror except one who was challenged for cause); Gilmore, supra, 103 N.J. at 540-43 (prima facie showing where prosecutor used peremptory challenges to excuse seven out of nine black potential jurors and then successfully requested court to excuse remaining two for good cause).\n\nIn this case, the prosecutor exercised one peremptory challenge against a black potential juror and another four against potential jurors who were not black. In addition, at least one prospective black juror was excused for cause on the motion of defense counsel. Thus, we find that defendant has failed to make a prima facie showing that the prosecutor exercised his peremptory challenges unconstitutionally.\n\nC. Dr. Cooke's Report\n\nDefendant contends that the trial court erred by refusing to admit Dr. Gerald Cooke's report into evidence to prove mitigating factors. Dr. Cooke, a clinical and forensic psychologist, tested and interviewed defendant at the behest of the State. Dr. Cooke's report was circulated to all the experts, who reviewed it before testifying. At the close of testimony, defense counsel moved to enter the Cooke report into evidence, arguing that the prosecutor had relied on that report in cross-examining the defense's medical experts. The defense noted that Dr. Cooke was currently unavailable to testify and that they had delayed communicating with him in the belief that the prosecution would have produced Dr. Cooke. The State moved to admit the first seven pages of the report, wherein Dr. Cooke criticized the methodology and the findings of the defense experts. The defense countered that the entire report should be included because the last two pages of the report, corroborating defense experts' account of defendant's personality development, provided evidence in support of the mitigating factors. The court determined that the report was inadmissible and also criticized the defense for failing to subpoena the doctor.\n\n1. The Court's Refusal to Admit the Cooke Report\n\nWe first address whether Dr. Cooke's report should have been admitted into evidence. Pursuant to the Capital Punishment Act, N.J.S.A. 2C:11-3c(2)(b), \"The defendant may offer, without regard to the rules governing the admission of evidence at criminal trials, reliable evidence relevant to any of the mitigating factors.\" Indisputably, the report's descriptions of the defendant's anti-social personality disorder and his upbringing were relevant to mitigating factors c(5)(a), c(5)(d) and c(5)(h). The report's reliability is attested to by the fact that the State initially procured the report, relied on the report in cross-examining two defense experts, and raised no objection to admitting that portion of the report that bolstered its case. See Green v. Georgia, 442 U.S. 95, 97, 99 S. Ct. 2150, 2151, 60 L. Ed. 2d 738, 741 (1979) (\"Perhaps most important, the State considered the [hearsay] testimony sufficiently reliable to use it against [the codefendant].\"). Moreover, two defense experts stated that they agreed in part with Dr. Cooke's report. In Long, supra, 119 N.J. at 502, we upheld the trial court's exclusion of letters written on behalf of the defendant because they were not subject to cross-examination by the State. Crucial to that ruling, however, was the fact that the letter-writers were available, and that indeed thirteen of them had testified. Here, by contrast, Dr. Cooke was unavailable to testify and his report can be deemed more reliable than attestations of good character. we have held that \"when [the] defendant offers evidence of a mitigating factor, any doubts concerning admissibility must be resolved in favor of the defendant.\" State v. Savage, 120 N.J. 594, 638 (1990) (on remand double hearsay would be admissible if found relevant); accord State v. Davis, 96 N.J. 611, 620 (1984). Thus, we conclude that the trial court erred in excluding the Cooke report.\n\nIn assessing whether the court's ruling rises to the level of reversible error, it is necessary to detail the contents of the Cooke report and place it in the larger context of the medical evidence presented at trial. The defense presented three expert witnesses: Dr. Gary Kay, a clinical neuropsychologist; Dr. John Young, a forensic psychiatrist; and Dr. Jonathan Pincus, a neurologist. Based on nine hours of testing, Dr. Kay concluded that defendant suffered from minimal longstanding brain damage in his left frontal-lobe region, the area of the brain that controls aggression. Both Dr. Young and Dr. Pincus examined the defendant on separate occasions for three hours and diagnosed him as suffering from organic personality syndrome, an affective disorder resulting from brain damage. Although Magnetic Resonance Imaging (MRI) and CAT scans did not uncover any physical manifestations of brain damage, all three doctors relied on various psychiatric and neurological tests to support their Conclusions.\n\nThose experts ascribed defendant's brain damage to several physiological and psychological causes: (1) Ms. Bey's alcoholism during her pregnancy; (2) Ms. Bey's frequent, severe, and random beatings of defendant; (3) defendant's early head injuries from one of his mother's beatings and from a bicycle accident; and (4) defendant's escalating alcohol usage from the age of nine onwards and his later drug use (primarily marijuana). All three doctors testified that defendant's brain damage and psychological condition, along with his alcohol and drug abuse, prevented him from controlling his violent impulses.\n\nIn rebuttal, Dr. Timothy Michals, a forensic psychiatrist, testified for the State that defendant suffered from antisocial personality disorder rather than organic personality syndrome. Dr. Michals contended that defendant's personality disorder did not meet the criteria required to prove mitigating factors c(5)(a) (\"extreme mental or emotional disturbance\") or c(5)(d) (significant impairment of moral faculties as the result of mental disease or defect or intoxication). Dr. Michals emphasized the lack of any conclusive scientific evidence that defendant is brain-damaged.\n\nDr. Cooke, in the first seven pages of his report, presents a systematic refutation of the defense experts' methodology and findings. Dr. Cooke diagnosed defendant as having a personality disorder with antisocial features, and also rejected Dr. Young's finding that defendant's drug and alcohol use was sufficient to meet mitigating factor c(5)(d). The last two pages of the report summarize the main features of defendant's history (his abusive upbringing and alcohol and drug use) and then present an explanation for defendant's criminal behavior:\n\nAs a child, he was anxious, helpless, insecure, frightened, and depressed, due to the combination of neglect and cruelty from his mother. As he got older, and under dissocial influences in his milieu, his defensive structures * * * developed Into a personality disorder which also encouraged the expression of the anger he felt due to the neglect and cruelty. The anxiety-depress ion became mashed and tends only to emerge under periods of stress. For him one of the greatest stresses is not being in control of a situation. Control is important to him so he does not re-experience what his mother made him feel as a child. * * * He has a tremendous rage toward women and, in my opinion, it is this rage that is the reason for his brutal aggression, demeaning, and sexual attache toward his victims. The level of aggression certainly was not necessary to the purpose of the robbery. Even if he wanted to hill them to prevent them from identifying him to the police, the level of aggression and brutality was unnecessary. In my opinion, the reason for that behavior is that it allows him to have control and dominance, and to express the anger he felt toward his mother.\n\nAlmost all of the persons he has tried to rob, and also has physically attacked, have been women and, with one exception [Cheryl Alston], all of them have literally been old enough to have been his mother. The combination of his personality dynamics and the evidence regarding the brutal physical and sexual assault on Ms. Peniston do indicate that at sone point he lost control and acted in a rage.\n\nAt oral argument before this Court, the Public Defender contended that Dr. Cooke's report provided better mitigating evidence than any of the three defense experts because it explicitly linked defendant's abused childhood and hatred of women to this particular crime. In addition, Dr. Cooke's report partly countered the State's theory that the defendant had murdered Ms. Peniston simply to avoid being identified. However, the defense overstates the importance of Dr. Cooke's report. Dr. Pincus had already testified that defendant's abused childhood and his view of women contributed to his violent behavior:\n\nI think you have a person there who was also abused, has a model of behavior of striking out savagely when you're angry and also is angry himself because of the way he was treated by women, by his mother.\n\nAlthough Dr. Cooke suggested that defendant lost control at the time of the murder, he diagnosed defendant as suffering from mixed personality disorder with antisocial, paranoid, and explosive features. In the last page of his report, Dr. Cooke made the following observations:\n\nRegarding the mitigating factors raised by the other doctors, the following may be said. The field has never defined what is meant by \"extreme mental or emotional disturbance.\" There ore really two definitions. In the broad definition many of the diagnoses listed in the DSM-III-R would be considered to be severe mental or emotional disturbance and this would include the personality disorders. However, what is more commonly used is a narrower definition. Under the narrower definition, only those disorders, which would, independent of any criminal behavior, require some sort of treatment intervention, either outpatient or in-patient, would be included. Generally, the personality disorders do not fit under that definition.\n\nI also would not agree with Dr. Young that the drug and alcohol use was sufficient to impair his ability to appreciate the wrongfulness of his behavior or to conform his behavior to the requirements of law. Both Mr. Bey's behavior at the time and his Discussion on interview now, clearly indicates that he knew that what he was doing was criminal and wrong.\n\n[Emphasis added.]\n\nThus, Dr. Cooke explicitly rejected the defense expert's findings of mitigating factors c(5)(a) and c(5)(d). Aside from its Discussion of defendant's personality development, Dr. Cooke's report provided little support for the defense -- a fact that is underscored by defendant's failure to subpoena Dr. Cooke for trial.\n\nViewed in the context of the medical testimony at trial, Dr. Cooke's report offered compelling but cumulative evidence of defendant's background and personality disorder. Read fairly, Dr. Cooke's report corroborates the defense experts' description of defendant's personality but rejects the relevance of defendant's personality for establishing the mitigating factors. Concededly, the jury might have accorded Dr. Cooke's report greater weight than the defense experts' testimony because it had been procured by the State. See Skipper v. South Carolina, 476 U.S. 1, 8, 106 S. Ct. 1669, 1673, 90 L. Ed. 2d 1, 9 (1986) (\"The testimony of more disinterested witnesses * * * would quite naturally be given much greater weight by the jury.\"); Brennan v. State, 766 P.2d 1385, 1386-87 (Okla. Crim. App. 1988) (reversing death sentence where court improperly excluded letter from state-employed doctor, who \"may have been perceived as more objective\" than defense expert). However, the significance of the Cooke report's exclusion is questionable inasmuch as it was factually consistent with the defense expert's description of defendant's personality. Moreover, Dr. Cooke's report was not the only \"disinterested\" evidence of defendant's troubled childhood. The State's own expert, Dr. Michals, testified, albeit briefly, that the defendant had begun drinking at age nine and had begun using drugs at age eleven. He also referred to the fact that defendant had been beaten by his mother. Thus, the jury heard evidence about defendant's background and psychological development from both prosecution and defense witnesses.\n\nBased on our determination that Dr. Cooke's report provides only cumulative evidence of defendant's psychological background and directly refutes the testimony of defendant's experts concerning mitigating factors, we conclude that the trial court's improper exclusion of Dr. Cooke's report was not \"capable of producing an unjust result.\" R. 2:10-2.\n\n2. Use of the Report in Cross-Examination\n\nDefendant argues that the trial court violated due process by refusing to allow defense counsel to use the Cooke report to cross-examine the State's rebuttal witness even though the prosecutor had previously used it to cross-examine defense experts. Before trial the State's expert and three defense experts reviewed Dr. Cooke's report, which was written after their reports had been prepared. The prosecutor used the Cooke report first during his cross-examination of Dr. Kay. After establishing that defendant scored better on one of the Reitan Neuropsychological Battery subtests when he was retested by Dr. Cooke, the prosecutor quoted the report's Conclusion that such improvement weighed against a finding of organic brain impairment. In addition, the prosecutor stated that \"Dr. Cooke * * * is of the opinion that the type of drugs used and the time is insufficient to cause organic brain syndrome in this case.\" On redirect, the defense had Dr. Kay read to himself the report's last two pages, detailing defendant's personality development, and then asked him if he agreed with that portion of the report. Dr. Kay stated that Dr. Cooke's Conclusions seemed \"reasonable.\" Later, Dr. Young, on direct examination, began discussing Dr. Cooke's hypothesis that defendant's anger toward his mother had prompted his attacks on older women. The prosecutor objected, and the court sustained the objection. The State's rebuttal witness, Dr. Michals, referred briefly on direct examination to Dr. Cooke's report. Defense counsel on cross-examination sought to question him about the Cooke report:\n\nQ. Okay. You're familiar with Dr. Cooke's Conclusion and his report that even if the Defendant wanted to kill to prevent the victims from identifying him to the police, the level of aggression and brutality was unnecessary.\n\n[PROSECUTOR]: I'm going to object.\n\nTHE COURT: Sustained.\n\n[DEFENSE]: It's a report that he said he relied upon. He said he's read all of this material.\n\n[PROSECUTOR]: Judge, he did not rely upon it. He said he reviewed it. I object.\n\n[DEFENSE]: He's indicated whatever he's read he's reviewed and this is all part of his opinion.\n\nTHE COURT: Rephrase your question.\n\nBY [DEFENSE]:\n\nQ. Are you familiar with that?\n\nA. Yes. My report was done before Dr. Cooke's report.\n\n[PROSECUTOR]: I continue the objection under the circumstances.\n\nTHE COURT: He read it after the report was completed.\n\nObjection sustained\n\nBY [DEFENSE]:\n\nQ. Would you agree, Doctor, that from what you know about the crimes, the level of brutality and aggression, goes beyond what's necessary to eliminate a witness?\n\nThus, in this case, the defense had to rephrase the question by excluding any reference to Dr. Cooke's report.\n\nThe defense argues that the court allowed only those portions of Dr. Cooke's report that disagreed with the defense experts to be presented to the jury. However, the defense never objected to the prosecutor's use of Dr. Cooke's report during the cross-examination of Dr. Kay. If the defense had objected, claiming that Dr. Kay read the Cooke report after completing his own report, and the court had still permitted the questioning, defendant's contentions would be more difficult to resolve.\n\nThat the trial court's rulings on the use of the report could have been more evenhanded is evident. Nonetheless, at the time of its rulings, the court expected Dr. Cooke to testify. Early in the trial, the prosecutor informed the court and defense counsel that he would not make a decision to call Dr. Cooke until he had heard Dr. Pincus' testimony. Thereupon, the defense announced that it might call Dr. Cooke if the prosecutor failed to do so. As a result of a last-minute emergency, Dr. Pincus was unable to appear as scheduled, and so became the last witness to testify, at which point Dr. Cooke had become unavailable. In assessing whether defendant was disadvantaged by the trial court's rulings denying use of Dr. Cooke's report during cross-examination, we note specifically that defense counsel was able to rephrase her questions in order to address the substantive findings of the Cooke report. Based on our careful review of the record, we conclude that the court's rulings on the use of the Cooke report during cross-examination did not prejudice the defense case.\n\nD. Trial Court's Refusal to Permit Leading Questions of Ms. Bey\n\nDefendant contends that the trial court improperly prohibited defense counsel from asking defendant's mother leading questions on direct examination, thus depriving the defense of the potential emotional impact of her testimony. Defense argues that the trial court thereby violated defendant's constitutional rights as well as the provision of the Capital Punishment Act, N.J.S.A. 2C:11-3c(2)(b), permitting defendant to offer any reliable evidence of mitigating factors.\n\nDuring defense counsel's direct examination of Ms. Bey, the prosecutor asserted five objections to defense counsel's questions on the ground that they were leading, all of which were sustained. Three objections arose out of defense counsel's attempt to ask the witness if she remembered beating defendant. In general, the witness did not volunteer much detail about her abuse of defendant.\n\nN.J.S.A. 2C:11-3c(2)(b) provides that \"the defendant may offer, without regard to the rules governing the admission of evidence at criminal trials, reliable evidence relevant to any of the mitigating factors.\" In Davis, supra, 96 N.J. at 619, we recognized that \"in the sentencing phase of a capital proceeding -- a life or death contest -- a defendant is entitled to the use of all reliable, helpful information.\" Although the manner of questioning witnesses falls within the broad discretion of the trial court, Cestero v. Ferrara, 110 N.J. Super. 264, 273 (App. Div. 1970), aff'd, 57 N.J. 497 (1971), leading questions should be allowed if their responses will yield reliable and relevant evidence. See State v. Riley, 28 N.J. 188, 204 (1958) (\"A trial Judge has discretion to allow leading questions when they will best serve to illuminate the truth.\"), cert. denied, 359 U.S. 313, 79 S. Ct. 891, 3 L. Ed. 2d 832 (1959).\n\nAlthough in our view the trial court's determinations disallowing leading questions to Ms. Bey were unduly restrictive and clearly erroneous, our review of the entire record leads us to conclude that the court's rulings were not prejudicial to defendant. Notwithstanding the prosecutor's objections, the defense did elicit Ms. Bey's testimony that she drank heavily while pregnant with defendant, that she kept the apartment dark, and that she beat defendant so hard that on one occasion he blacked out and on another occasion the neighbors threatened to call the police. Thus, Ms. Bey can hardly be characterized as an uncooperative, and thus hostile, witness. Given Ms. Bey's inability or unwillingness to remember certain details of her alcoholism and her abuse of defendant, we find it doubtful that defense counsel could have elicited any further reliable information even if she had been permitted to ask leading questions. Moreover, Ms. Bey's testimony was cumulative: two family members and one family friend testified in vivid detail about Ms. Bey's alcoholism and her abuse of defendant. Thus, we find that the court's refusal to permit leading questions of defendant's mother, although error, did not possess a clear capacity to cause an unjust result.\n\nE. Trial Court's Evidentiary Rulings\n\nDefendant argues that the court permitted the introduction of inflammatory evidence that deprived defendant of a fair trial. In Biegenwald II, supra, we set forth evidentiary guidelines for capital sentencing retrials:\n\nSince the retrial is limited to resentencing, the only admissible evidence is that relevant to the issue, namely, evidence of aggravating and mitigating factors. Retrial of issues relevant only to guilt is not permitted. While defendant may lose whatever advantage inheres in the 'residual doubts' that the original jury may have had regarding defendant's guilt, the State may also lose whatever 'advantage' inheres in the emotional impact that often surrounds the initial guilt phase. A substantial amount of the evidence admitted initially in the guilt phase nevertheless may be admissible in the retrial of the sentencing proceeding, for often issues relevant to one are relevant to the other.\n\n[106 N.J. at 71 (citations omitted).]\n\nEarly in the trial, the defense made a motion in limine to exclude any \"lurid, graphic descriptions\" of the two murders that night be offered by the State to prove the two aggravating factors -- the prior murder, and the commission of the Peniston murder in the course of a felony. The trial court ruled that the State could produce evidence showing the \"manner and mode\" of the Alston murder but that it could not introduce all the circumstances surrounding her murder. Also, the court ruled that the State could introduce evidence of robbery and sexual assault during the Peniston murder to prove aggravating factor c(4)(g). The court also decided to rule on each item of proof as it was offered into evidence.\n\nIn support of the prior-murder aggravating factor, Dr. Becker, the medical examiner, testified that Cheryl Alston's death had been caused by asphyxia due to strangulation. He also gave a detailed account of his medical examination of the victim, over the defense's prior objections:\n\nThe face revealed multiple blunt trauma with penetrating wounds of the left eye, the nose, the left side of the face, with palpable fractures of the nasal bones.\n\nThere was a large laceration of the forehead, the center of the head. Measuring six centimeters by two and a half centimeters * * * and exposing the frontal bone of the skull.\n\nThe left eye was pushed inward, out of its socket and also showed a penetrating wound with fractures around it.\n\nThe interior surface of the neck revealed horizontal abrasions and encircling the entire anterior surface and also partially in the posterior neck.\n\nThe abdomen contained three hundred cc's of liquid and clotted blood; and this was due to a laceration of the liver * * *\n\nThere was also a small amount of hemorrhage at the apex of the left ventricle, which is the major chamber of the heart * * *\n\nAll the lesions of the face, the lacerations and abrasions and contusions were associated with fractures of all of the facial bones and those were the main findings.\n\nDr. Becker also noted that the victim's wounds were consistent with the State's theory that the injuries had been inflicted by the two-by-four found at the scene of the crime.\n\nIn proving the aggravating factor of prior murder, the State may offer evidence concerning \"the manner of death,\" N.J.S.A. 2C:11-3c(2)(f), but it cannot use such evidence to \"turn[] the sentencing proceeding into a second trial of the previous case.\" Senate Judiciary Comm. Statement to S.950 at 2 (Nov. 29, 1984). In Erazo, supra, 126 N.J. 112, we considered the admission of an autopsy report of a prior-murder victim that described the multiple stab wounds and contained an anatomical diagram depicting the location of the wounds. Although we held that the admission of the autopsy report did not constitute plain error, we emphasized the unnecessarily prejudicial nature of that type of evidence:\n\nThe prejudicial effect of a graphic and detailed account of the victim's death might exceed its probative value. On remand, the purposes of the statute will be served if the evidence of the manner of [victim's] death is described as multiple stab wounds to the chest, lungs, and heart.\n\n[Id. at 136.]\n\nAs Erazo makes clear, the fact that a description of the victim's wounds is presented in clinical terminology does not obviate its potentially prejudicial effect. Ibid. Because defendant's resentencing proceeding occurred prior to our decision in Erazo, Dr. Becker was permitted to describe the victim's condition in more detail than necessary to state the manner of death. Under Erazo, Dr. Becker's description of the manner of death should have been more general, specifying no more than that death had been caused by a combination of strangulation, skull fractures with cerebral hemorrhage, and laceration of the liver. Although Dr. Becker's testimony was significantly more specific, we are satisfied that the difference between the testimony elicited and the permissible testimony was not sufficient to divert the jury's focus from the prior-murder aggravating factor or clearly capable of producing an unjust result.\n\nDefendant also objects to the evidence proffered by the State in support of aggravating factor c(4)(g). Here again, Dr. Becker testified in detail about the wounds inflicted on Ms. Peniston. He described the \"marked reddish black discoloration of the skin of the face with maggot infestation.\" He also described the sneaker imprint on the victim's chest and her broken ribs, noting that 'to fracture the ribs, you need a force, not a simple step.\" Defendant points out that such testimony nay have been intended to serve as evidence of an uncharged aggravating factor, c(4)(c), that the murder \"involved torture, depravity of mind, or an aggravated assault to the victim.\" On the other hand, much of Dr. Becker's testimony was essential to the jury's understanding of the circumstances of the murder and its relationship to the felonies that the State relied on to prove aggravating factor c(4)(g). The State had the obligation to prove its case, but the evidence adduced went beyond that required to establish the aggravating factor. Nonetheless, we conclude that the admission of Dr. Becker's testimony, when placed in the larger context of the seven-day trial, did not have the capacity to produce an unjust result.\n\nDefendant also argues that the court erred in introducing articles of Ms. Peniston's clothing recovered from the crime scene: pocketbook, brassiere, slip, panty hose, dress, belt, shoes, loose dress buttons, scarf, raincoat, and raincoat belt. The raincoat belt and scarf, which were found around the victim's neck, the semen-stained raincoat, and the pocketbook constituted relevant evidence that the defendant committed the murder during the course of a rape and robbery. The other articles of clothing were largely irrelevant, especially given the investigator's testimony that the victim had been found nude. Thus, the court should have excluded those articles, just as it excluded defendant's sneakers and the victim's eyeglasses, plastic bowl, and grocery bag, because victim-impact-type evidence always carries the risk that a jury will \"inappropriately intertwine [] irrelevant emotional considerations with relevant evidence.\" State v. Williams, 113 N.J. 393, 451 (1988) (Williams II). See State v. Rose, 112 N.J. 454, 535-36 (1988) (Rose I) (guilt-phase introduction of the victim's blood-stained shirt and undershirt was harmless error despite \"clear capacity to inflame and prejudice the jury\" given compelling evidence of guilt). We are satisfied, however, that the excludable items of personal clothing were not particularly inflammatory nor likely to divert the jury from its focus on aggravating and mitigating factors. Hence we conclude that their admission was harmless error.\n\nDefendant also claims that the court, by ruling on each piece of evidence as it was presented, forced the defense to interrupt the trial and excuse the jury in order to argue against admissibility. The court acted in accordance with our holding in State v. Cary, 49 N.J. 343, 352 (1967), that trial courts should wait until a piece of evidence is offered before ruling on its admissibility. Although we have noted that this rule should be relaxed if it might impair a capital defendant's examination of a witness, Ramseur, supra, 106 N.J. at 262 n.59, defendant here alleges no such impairment. We find no error in the procedure followed by the trial court in ruling on the admissibility of evidence.\n\nF. Adequacy of Sentencing-Phase Instructions\n\n1. Court's Instruction About the Sentencing Options\n\nDefendant argues that the trial court's refusal to instruct the jury that the true alternative to a death sentence would have been a life term with a seventy-year parole-ineligibility period deprived him of his due-process right to a reliable sentencing trial and subjected him to cruel and unusual punishment. In other words, defendant argues that the court should have informed the jury that defendant was serving a life term plus twenty years with a forty-year parole-ineligibility period for the murder and aggravated sexual assault of Cheryl Alston. The trial court refused to present that information to the jury in response to both a defense request and a jury question. Although we hold that the trial court erred in both instances, the court's ruling wag harmless error because the jury had already been adequately informed that a life sentence would result in a seventy-year period of parole ineligibility.\n\nThe defense submitted a written request to charge the jury that defendant was serving prior sentences carrying forty years of parole ineligibility, and that a life sentence in this case would mean that defendant would serve a total of seventy years before being eligible for parole. The court refused the requested charge and, on nine occasions, instructed the jury that its choice lay between sentencing defendant to death or to life with thirty years of parole ineligibility. In addition, the verdict sheet posed the choice as death or life with a thirty-year parole disqualifier. In overruling defense counsel's objection to that instruction, the court noted that the Alston case \"is on a [sic] appeal and always a possibility of getting reversed * * * [so he] may not be serving any time on that conviction.\"\n\nApproximately two hours into their deliberations, the jury sent the trial court a note with the following question: \"Is Mr. Bey ever eligible for parole in the next seventy years?\" Some time elapsed before the court met with counsel to discuss the jury's question. During that Discussion, defense counsel argued that the jury should be informed that defendant would not be eligible for parole for seventy years. The court again expressed concern that the Alston murder conviction was on appeal and might be reversed. Nearly one hour after the note had been sent, the court officer interrupted that Discussion by announcing that \"the Foremen [sic] informed me he has a verdict and they don't need the answer to the question.\" when the jury was brought into the courtroom, the trial court engaged in the following colloquy:\n\nTHE COURT: And before I answered your question, you advised the Court that you had a verdict and you didn't want this question answered, is that correct?\n\nTHE FOREMAN: That's correct.\n\nThereupon, the foreman announced the jury's verdict.\n\nThe question posed by this case is whether a capital defendant has the right to have his sentence for a prior conviction presented to the jury. At first glance, that issue appears to be foreclosed by our recent decision in State v. Biegenwald, 126 N.J. 1 (1991) (Biegenwald IV). In that case, we rejected a defendant's attempt to submit his prior life sentences for murder as evidence under the catch-all mitigating factor c(5)(h).\n\n[Defendant's] request * * * raises the specter that a jury in this case may be unduly influenced by the determination of another jury made on a substantially different record. Because the sentencing determination is fact specific and remains subject to significant sentencer discretion, the sentence imposed in another case under different circumstances has little probative value to the present jury's sentencing decision. A properly-impanelled jury in a capital case is aware of the limited options available in sentencing a defendant convicted of murder. Furthermore, the argument that defendant will never be eligible for parole can be made based on the current proceeding.\n\n[Id. at 49 (emphasis added).]\n\nEssentially, we decided that a sentence for a different crime is not \"relevant to the defendant's character or record\" under c(5)(h). But see Harris v. State, 539 A.2d 637, 649-50 (Md. 1988) (sentences for armed robbery and possession of a handgun are mitigating factors); Davis v. State, 512 So. 2d 1291, 1293 (Miss. 1987) (sentence for assault is mitigating factor), cert. denied, 485 U.S. 913, 108 S. Ct. 1088, 99 L. Ed. 2d 247. Our decision in Biegenwald IV accords with the focus of the statutory mitigating factors on an individualized consideration of a defendant's culpability. A prior sentence does not reduce a defendant's degree of culpability for a later crime.\n\nHowever, the instant case differs from Biegenwald IV in two important respects. First, defendant here did not seek to introduce his prior sentence as a mitigating factor but rather as part of the jury charge on the sentencing options. Second, defendant could not argue that a life sentence would effectively keep him in prison for his lifetime without adducing evidence of his prior murder sentence.\n\nThe principle of reliability in capital sentencing requires that a jury be fully informed of its responsibility in determining the appropriateness of the death penalty. Woodson v. North Carolina, 428 U.S. 280, 304-05, 96 S. Ct. 2978, 2991, 49 L. Ed. 2d 944, 961 (1976); Bey II, supra, 112 N.J. at 162-63. As we stated in Ramseur, supra, 106 N.J. at 311:\n\nTo hide from the jury the full range of its sentencing options, thus permitting its decision to be based on uninformed and possibly inaccurate speculation, is to mock the goals of rationality and consistency required by modern death penalty jurisprudence.\n\nFor juries in death-penalty trials to be fully informed about their sentencing options, they must be apprised of the practical effect of a life sentence. In California v. Ramos, 463 U.S. 992, 1009, 103 S. Ct. 3446, 3457, 77 L. Ed. 2d 1171, 1186 (1983), on remand, 689 P.2d 430, 439-41 (Cal. 1984), the United States Supreme Court upheld a state statute requiring the Judge to inform the jury that a life sentence without parole may be commuted by the governor. The Court ruled that the instruction \"gives the jury accurate information in that it corrects a misleading description of a sentencing choice available to the jury.\" Id. at 1004 n.19, 103 S. Ct. at n.19, 77 L. Ed. 2d at 1183 n.19. In Doering v. State, 545 A.2d 1281, 1295 (Md. 1988), the court held that a capital defendant must be allowed to submit non-speculative evidence about his eligibility for parole: \"a jury seeking to determine the appropriateness of a life sentence will be aided by information correctly describing the legal and practical effects of such a sentence.\" See State v. Henderson, 789 P.2d 603, 606-07 (N.M. 1990) (reversed death sentence where the court refused to instruct the jury that a life sentence carried a fifty-six-year parole ineligibility period).\n\nNot informing jurors about a prior sentence invites speculation that the capital defendant might be released after serving only a thirty-year mandatory minimum. A death sentence should reflect the \"jury's normative Judgement that death is 'the fitting and appropriate punishment,'\" Bey II, supra, 112 N.J. at 162 (quoting Ramseur, supra, 106 N.J. at 316 n. 80), rather than its unwarranted fear of the defendant's premature release from prison. See California v. Ramos, supra, 463 U.S. at 1021, 103 S. Ct. at 3464, 77 L. Ed. 2d at 1194. (Marshall, J., Dissenting) (\"the possibility of eventual release through communication and parole * * * * bears no relation to the defendant's character or the nature of the crime, or to any generally accepted justification for the death penalty\").\n\nOur Court has long recognized the need to preclude speculation about a defendant's release from distorting a jury's decision to impose life or death. In State v. White, 27 N.J. 158, 170-79 (1958), the Court reversed a death sentence under the prior death-penalty statute because the trial court had failed to respond to a jury question about the possibility that the defendant would be paroled for good behavior.\n\nLogically, the jury should be told simply that the subject of parole must not be considered by it. But the efficacy in fact of an instruction to that effect is questionable and since there may reside in the jurors' minds varying understandings * * * the jury may as well be informed of the true basis [for granting] parole. Hence the question should be answered, but followed by a direction to exclude the subject from consideration.\n\n[Id. at 178-79.]\n\nConsequently, White set forth a model jury charge that informed jurors that a life-sentenced prisoner would be eligible for parole after twenty-five years, less time for good behavior and work credits, and that instructed them \"not [to] speculate as to whether parole would or would not be granted.\" Id. at 179. In State v. Sinclair, 49 N.J. 525, 547-48 (1967), we held that a trial court should give the White jury charge on a defendant's request.\n\nFollowing those precedents, we hold that courts in capital cases should inform juries about the defendant's prior sentences either on the defendant's request or in the event of a jury inquiry. If the defendant is appealing those convictions and sentences, the jury should be informed that the sentence is not final. The court should also instruct the jury that the court alone will decide whether a sentence in the present case is to be served concurrently or consecutively to any prior sentences.\n\nFinally, the court should instruct the jury that it should not consider prior sentences in its decision to impose a life or death sentence because they are not statutory aggravating or mitigating factors. The focus of the Capital Punishment Act is on individualized sentencing, requiring that the jury determine whether death is the appropriate punishment based on the circumstances of the offense and the aggravating and mitigating factors. To permit consideration of pending sentences for prior crimes might lead to the incongruous result that first-offenders would be more likely to be sentenced to death than would repeat-offenders. The proper balance is struck by informing a jury of pending sentences on request, but instructing the jury to base its life or death decision only on the aggravating and mitigating factors presented by the evidence.\n\nMoreover, we note that the foregoing jury instruction is all the more necessary when, as in this case, the State uses the defendant's prior murder conviction as an aggravating factor under c(4)(a). If a sentencing jury is informed of the defendant's prior murder conviction, but not the sentence imposed, its sentencing decision may be affected by uncertainty about whether the defendant has been punished adequately for the earlier murder. Harris, supra, 539 A.2d at 650.\n\nWe find that the trial court erred by not instructing the jury, at both the defendant's and the jury's request, that a life sentence might result in a seventy-year period without parole. The court's concern that the prior murder conviction was on appeal could have been dealt with by a jury instruction to the effect that the sentence was not final. Moreover, the court's concern was misplaced; the reversal of a prior conviction used as an aggravating factor in capital sentencing may require that the death sentence be vacated. See Johnson v. Mississippi, 486 U.S. 578, 585-86, 108 S. Ct. 1981, 1986, 100 L. Ed. 2d 575, 584-85 (1988).\n\nThe question then remains whether the court's error could have produced an unjust result. Based on our thorough review of the record, we conclude that the jury was fully informed of the practical consequences of imposing a life sentence in this case. During voir dire, the trial court apprised all twelve final jurors of defendant's sentence for his prior murder conviction and then posed the following question:\n\nKnowing the defendant has previously been convicted of murder and is serving 40 years without parole, in addition to whatever the sentence may be in this case, would you still be able to consider any aggravating or mitigating factor that may be submitted by the State or the defendant?\n\n[Emphasis added.]\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nDuring voir dire, either the prosecutor\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e or defense counsel\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e informed the ten final jurors that defendant was already serving a sentence of forty years without parole. In bath their opening and closing statements, the prosecutor and defense counsel informed the jury that the defendant was already serving a life sentence with a forty-year parole disqualifier for the Alston murder. In her opening statement, defense counsel argued:\n\nNo matter what your Judgement is in this case, Marko Bey will pay with his life for his crimes. He will live for as long as he lives in a maximum security prison from which he will never be set free. He is serving a term of years which includes 40 years before he can see the Parole Board for the murder of Cheryl Alston. And if your verdict here is * * * a term of imprisonment, that will add at least another 70 [actually 30] years onto the term he must spend in prison before he even sees the Parole Board. And there's no guarantee that they will ever let him out.\n\nDefense counsel reiterated this point in her summation:\n\nWhat you are going to have to decide is whether or not Marko Bey is sentenced to what's affectively [sic] going to he life imprisonment before he can see the Parole Board, he must serve at least seventy years, if not more.\n\nThere is no possibility in this case that he's going to get out earlier for quote/unquote good behavior or anything like that.\n\nIn his closing, the prosecutor argued that death, not seventy years, was the appropriate punishment for defendant's crimes:\n\nCounsel in her opening remarks said to you, that were you to return a verdict, a life sentence, the thirty years, that the Defendant would be serving seventy years without parole; and that's a true statement of the law.\n\nAnd she went on to say, that by serving that sentence, that the Defendant would be forfeiting his life for his crimes. That is not true.\n\nSo, he doesn't forfeit his life by serving seventy years without parole. He forfeits his freedom * * * .\n\nThus, the jury was repeatedly informed, by the Judge, prosecutor, and defense, that a life sentence with a thirty-year mandatory minimum would be served consecutively to defendant's forty-year parole-ineligibility period for the Alston murder. Although the court's instructions presented the jury with the option of sentencing defendant to death or life with thirty years of parole ineligibility, that option was placed in the specific context of the Peniston murder and in terms of the statutory requirements:\n\nYou will shortly begin to decide what punishment will be imposed on Marko Bey for his murder of Carol Penniston [sic].\n\nUnder the law of New Jersey all murderers are not subject to the death penalty. Unless at least one of the aggravating factors listed in the law is proved to your satisfaction, unanimously and beyond a reasonable doubt his sentence will be life imprisonment with no parole for at least thirty years.\n\nYou will decide whether the sentence should be life imprisonment on the terms I just described or death.\n\n[Emphasis added.]\n\nDuring its deliberations, the jury asked the Judge the following question: \"Is Mr. Bey ever eligible for parole in the next seventy years?\" The question can be understood in two different ways: either the jury was confused about the length of the parole-ineligibility period, or the jury was asking whether the defendant could be paroled at any time before the completion of the seventy-year period. We find the latter reading more plausible because the phrasing of the question itself reveals that the jury knew the aggregate parole-ineligibility period from two life sentences would be seventy years. More importantly, though, the jury reached its verdict without waiting to have its question answered. Thus, we conclude that the trial court's failure to inform the jury in its charge that a life sentence would cause the defendant to spend seventy years in prison without parole constituted harmless error because the jury already knew the practical effect of a life sentence and nevertheless chose to return a death sentence.\n\n2. The Court's Delay in Answering the Jury Question\n\nDefendant contends that the trial court's failure to answer the jury's question was reversible error. The jury submitted a question regarding defendant's eligibility for parole, and then, approximately one hour later, returned its verdict, without the question having been answered. Only a small portion of the court's delay in answering that question is attributable to its Discussions with counsel over how to answer the question. The record does not reveal the reason, if any, for the delay in convening the court and counsel.\n\nSeveral jurisdictions have held that a trial court's delay in responding to a jury question does not require reversal of the conviction. In Ebens v. State, 518 So. 2d 1264, 1268 (Ala. Crim. App. 1986), the trial court had informed the jury that the court could not answer its question until the court had finished conducting voir dire in another case, and the jury had later returned a verdict without waiting for its question to be answered. The appellate court held:\n\nThe jury was not denied access to the court; they could have waited a short time for further instructions if they deemed it necessary. The jury chose to proceed under the court's prior charge and was obviously able to reach a unanimous verdict. We find no error in the trial court's failure to address the jury's question * * * in light of the fact that they chose to continue deliberations and reached a unanimous verdict without additional instructions.\n\n[Id. at 1268.]\n\nSimilarly, other courts have found no error because of a delay in answering a jury question. See, e.g., United States v. Barnes, 586 F.2d 1052, 1060 (5th Cir. 1978) (verdict returned while Judge and defense counsel were discussing how to answer jury's question); People v. Sims, 519 N.E.2d 921, 935 (Ill. App. Ct. 1987) (jury announced its verdict before Judge could consult with defense counsel), appeal denied, 522 N.E.2d 1253 (1988), cert. denied, 488 U.S. 844, 109 S. Ct. 118, 102 L. Ed. 2d 92 (1988); People v. Chandler, 487 N.Y.S.2d 887, 888-89 (App. Div. 1985) (judge unaccountably absent from courtroom for fifty minutes during which time jury asked question and then returned verdict).\n\nWe conclude that the court's delay in answering the question did not constitute reversible error. First, the jury question regarding defendant's eligibility for parole is best characterized as an issue of fact that did not implicate any legal concerns over the weighing of aggravating and mitigating factors. See Chandler, supra, 487 N.Y.S. 2d at 889 (finding no reversible error in delay to jury question, court noted that jury question was one of fact rather than law). The court's delay was not inordinate, and was due in part to its deliberations with counsel. Most importantly, though, the jury answered the question for itself by continuing its deliberations and reaching a unanimous verdict. Indeed, the foreman informed the court before delivering the verdict that the jury no longer required an answer to its question.\n\n3. Court's Instruction on Photograph\n\nDefendant contends that he was denied a reliable determination of sentence and full consideration of the mitigating evidence due to the court's instructions regarding the photograph of the victim that the State had introduced into evidence.\n\nThe trial court excluded all but one of the State's proffered slides and photographs. One 8 x 11-inch photograph of the victim as she was found at the murder scene was admitted over defense counsel's objection. The photograph depicts the victim from slightly below the waist to the chin, thus excluding her battered face. In the photograph, the victim is nude and supine, with a scarf and belt tied around her neck and a left shoe imprint on her chest. In summation, the prosecutor directed the jury's attention to the photograph and argued:\n\nThis is the chest and neck of Carol G. Penniston [sic]. This is the force. This is the strangulation and I ask you to recall one other thing.\n\nI ask you to recall the testimony of Doctor Stanley M. Becker regarding the destruction to Carol Penniston's [sic] face in and around the area of her eyes for looking at Marko Bey.\n\nLater, defense counsel requested the court to instruct the jury that the photograph was to be considered only as it related to defendant's sexual assault, and also submitted a proposed instruction charging the jury to ignore any of the State's proofs that were not relevant to the aggravating factors. The court rejected both those requests, and instead charged the jury:\n\nYour decision is to be based upon your consideration of the evidence presented as it relates to the aggravating and mitigating factors which you find to be present.\n\nAfter that charge, defense counsel again requested, and was again denied, a limiting instruction on the use of the photograph.\n\nPenalty-phase evidence proffered by the State must be relevant to the aggravating factors or to the rebuttal of the mitigating factors. Biegenwald II, supra, 106 N.J. at 71-72. Here, the photograph's depiction of the victim's nudity and the violence inflicted on her body was marginally relevant to the fact that defendant had committed the murder during the course of a sexual assault and robbery (aggravating factor c(4)(g)). Also, the prosecutor referred to the photograph in his summation in the context of proving robbery and sexual assault.\n\nNevertheless, we have repeatedly expressed our concern about the admissibility of crime-scene and autopsy photographs in capital cases. \"Although as a general rule the admissibility of photographs of a crime victim rests in the trial court's discretion, the need to balance the ostensible relevance of such evidence against the likelihood of jury prejudice is especially critical in the penalty phase of a capital case.\" Pitts, supra, 116 N.J. at 638-39 (citation omitted). We have found the use of such photographs more appropriate when the State is trying to prove that the murder involved torture, depravity of mind, or an aggravated assault to the victim (aggravating factor c(4)(c)). See McDougald, supra, 120 N.J. at 580-83. In (Samuel) Moore, supra, 122 N.J. at 466-69, we held that gruesome photographs of victims were relevant to the c(4)(c) aggravating factor but were not needed to establish the c(4)(g) aggravating factor. Thus, we conclude that the photograph here should have been excluded, especially given the fact that the medical examiner and investigators testified in sufficient detail to prove that the murder had occurred during the course of a rape and robbery -- a fact that the defense never contested. In the context of the totality of the evidence before the jury, however, we are satisfied that the photograph was not unduly inflammatory and that its admission into evidence did not have the capacity to cause an unjust result.\n\n4. Court's Instruction on Defendant's Prior Crimes\n\nDefendant argues that the trial court delivered an inaccurate and misleading jury instruction about the use of defendant's prior criminal acts. At trial, both prosecution and defense witnesses testified about defendant's earlier crimes as a juvenile and about his incarceration at Yardville. As requested by defense counsel, the court gave the following limiting instruction:\n\nYou have received evidence offered by defense witnesses to prove the existence of a mitigating factor or factors. And during the course of that testimony, whether on direct examination or cross examination or rebuttal by the State, there has been mention made of a criminal history of the Defendant as a juvenile.\n\nYou may consider such evidence or testimony only as adding to or rebutting mitigating factors and thereby affecting the weight the jury chooses to assign to the mitigating factors.\n\nIn that charge, the court explicitly instructed the jury that defendant's criminal history could not be considered \"as adding to the weight assigned to aggravating factors.\" See State v. (Marie) Moore, 113 N.J. 239, 276-77 (1988).\n\nDefendant now argues that that requested instruction was plain error, claiming that the jury should not have been told it could use the prior-crimes evidence to rebut mitigating factors. Although defendant contends that he did not present evidence of his character or record in mitigation, that claim is belied by the record. In particular, Dr. Young testified that defendant's behavior had improved in the structured environment of prison, enabling him to complete a high-school-equivalency examination. That testimony constituted mitigating evidence intended to persuade the jury to impose a life sentence. After reviewing the entire record, we are satisfied that there was relatively little testimony about defendant's prior criminal acts and that the prosecutor barely adverted to that issue In his summation. Cf. Rose I, supra, 112 N.J. at 505-08 (death sentence reversed where repetitive and highly inflammatory evidence of defendant's past misconduct came before jury in penalty phase). We also find no error in the trial court's charge.\n\n5. Court's Instruction on c(5)(c) Mitigating Factor\n\nDefendant contends that the trial court gave an incorrect and unconstitutional jury instruction regarding the age mitigating factor, c(5)(c). In her closing argument, defense counsel framed the age mitigating factor in terms of defendant's emotional and intellectual maturity:\n\nThe concept of personality doesn't even really begin until age eighteen and why is that?\n\nBecause people are changing. They are growing, they are maturing, they are developing their personalities, if you will or their style. They are more susceptible to this kind of chaos of how they integrate experience, the decisions they are able to make. The Judgement that they are able to exercise. The maturity and the ability to really think out the consequences of their actions.\n\nYou can find in this case that the youth of the Defendant at the time these crimes were committed mitigates in that sense.\n\nWhat was his ability to Judge? What was his ability to realize the consequences of his actions? How old was he? How much life experience had he had? How much guidance had he had? When at barely eighteen years old, he went out and committed this crime.\n\nAfter instructing the jury to disregard the prosecutor's remark during summation that \"age per se is just not relevant,\" the court later gave the following charge on the age mitigating factor:\n\nYou must consider not only his chronological age, for that is not controlling on whether youthfulness is present as a mitigating factor, but also his mental and physical development and life experiences as bear on his level of maturity.\n\nDefendant argues that the jury should have been instructed that defendant's age, standing alone, constituted sufficient evidence of the mitigating factor, and that the court's reference to physical development prejudiced defendant.\n\nThe Death Penalty Act defines the age mitigating factor as the age of the defendant at the time of the murder.\" N.J.S.A. 2C:11-3c(5)(c). In Ramseur, supra, we interpreted that statutory provision as mandating that age be recognized as a mitigating factor\n\nonly when the defendant is relatively young, or when the defendant is relatively old, in accordance with the probable legislative intent to recognize our society's reluctance to punish the very young and the very old as severely as it punishes others.\n\n[106 U.S. at 295 (citations omitted).]\n\nIn determining a defendant's \"relative\" youth, a jury must look beyond chronological age to considerations of defendant's overall maturity.\n\nThe United States Supreme Court has stated that \"the background and mental and emotional development of a youthful defendant [must] be duly considered in sentencing.\" Eddings v. Oklahoma, 455 U.S. 104, 116, 102 S. Ct. 869, 877, 71 L. Ed. 2d 1, 12 (1982). As one court observed,\n\nany hard and fast rule as to age would tend to defeat the ends of Justice, so the term youth must be considered as relative and this factor weighed in the light of varying conditions and circumstances. It is well known that two young persons may vary greatly in mental and physical development, experience and criminal tendencies.\n\n[Giles v. State, 549 S.W.2d 479, 483 (Ark.), cert. denied, 434 U.S. 894, 98 S. Ct. 272, 54 L. Ed. 2d 180 (1977).]\n\nThe Maryland Court of Appeals has held that \"the mitigating circumstance of youthful age is not measured solely by chronological age,\" Stebbing v. State, 473 A.2d 903, 921, cert. denied, 469 U.S. 900, 105 S. Ct. 276, 83 L. Ed. 2d 212 (1984), but rather encompasses such factors as prior criminal conduct, home environment, and degree of maturity, Johnson v. State, 495 A.2d 1, 19 (1985), cert. denied, 474 U.S. 1093, 106 S. Ct. 868, 88 L. Ed. 2d 907 (1986); see also Thompson v. State, 542 So.2d 1286, 1297 (Ala. Crim. App. 1988) (upholding trial court's finding that twenty-year-old defendant did not establish age mitigating factor because he \"was mature enough to plot, plan and scheme before, during and after the criminal activities\"), aff'd, 542 So.2d 1300 (Ala.), cert. denied, 493 U.S. 874, 110 S. Ct. 208, 107 L. Ed. 2d 161 (1989); Walton v. State, 769 P.2d 1017, 1035 (Ariz. 1989) (\"When the Judge considers age in mitigation, he weighs evidence of experience and maturity.\"), aff'd, 497 U.S. 639, 110 S. Ct. 3047, 111 L. Ed. 2d 511 (1990); State v. Dixon, 283 So.2d 1, 10 (Fla. 1973) (noting that jury may consider \"the inexperience of the defendant\" in assessing the age mitigating factor), cert. denied, 416 U.S. 943, 94 S. Ct. 1950, 40 L. Ed. 2d 295 (1974); State v. Oliver, 307 S.E.2d 304, 333 (N.C. 1983) (following Giles, supra).\n\nThus, we interpret c(5)(c) as requiring juries to consider both chronological age and maturity in determining the applicability of the age mitigating factor to relatively young defendants. However, the statutory language makes clear that juries should give greater weight to a defendant's chronological age. Here, the court's instruction, as well as the defense counsel's summation, adequately informed the jury about the age mitigating factor. Despite testimony concerning defendant's age and level of maturity, all the jurors found that defendant's youthfulness did not mitigate the brutality of the homicide of which he had been convicted. See Commonwealth v. Williams, 570 ally 75, 82 PA. 1990) (rejecting defendant's claim that his age, eighteen years and four months at the time of the murder, was a per se mitigating circumstance). A defendant's young ago does not divest a jury of its discretion to determine whether or not the age mitigating factor applies.\n\n6. Court's Instruction on Catch-all Mitigating Factor c(5)(h)\n\nDefendant also contends that the court's inadequate instruction on the catch-all mitigating factor, c(5)(h), warrants reversal of the death sentence. At trial, defense counsel submitted a set of proposed jury charges, including proposed instructions for the catch-all mitigating factor. Those instructions asked the jury to consider defendant's emotional and physical neglect, abused childhood, habitual use of alcohol and drugs, possible organic brain damage, and in utero exposure to his mother's alcoholism. The court rejected defendant's proposed instructions and declined to leave a blank space on the verdict form where jurors could list other mitigating factors under c(5)(h). The court gave the following jury instruction on the catch-all factor:\n\nAny other factor which you find relevant to the Defendant's character or record or to the circumstances of the murder is not really a single factor.\n\nRather, it requires that you consider all the evidence received as it relates to or concerns Defendant's life, his character, his characteristics or record and the totality of the circumstances of the crimes.\n\nYou do not have to describe such evidence or factor in words on the jury verdict form. This is a catchall [sic] mitigating factor.\n\nThus, the court's instruction added little to the statutory language of the c(5)(h) factor.\n\nIn Bey II, supra, 112 N.J. at 169-70, we held that jury charges on the mitigating factors that merely recite statutory language generally are inadequate. There we noted that \"the requirement that capital sentencing must not preclude consideration of relevant mitigating circumstances would be hollow without an explanation of how the evidence can mitigate the imposition of the death penalty.\" Id. at 169 (emphasis added). Our decision also emphasized the need for jurors to give the defendant individualized consideration in death-penalty sentencing. Id. at 168; accord Clausell, supra, 121 N.J. at 344-45; Pennington, supra, 119 N.J. at 595-97; Williams II, supra, 113 N.J. at 456-57; State v. Zola, 112 N.J. 384, 432-33 (1988), cert. denied, 489 U.S. 1022, 109 S. Ct. 1146, 103 L. Ed. 2d 205 (1989); Rose, supra, 112 N.J. at 539-40. In Biegenwald IV, supra, we held that\n\ncommon sense compels the determination that when evidence of wholly-unrelated circumstances is offered pursuant to c(5)(h), it is not intended to be considered as a single factor by the sentencer. The language of the provision is too broad to permit a contrary Conclusion. For example, a defendant could offer evidence of a violent and abusive childhood, of his or her potential for rehabilitation, and of specific past acts of discrimination against the defendant. To consider that evidence as probative of only one factor is not only illogical but also runs afoul of the requirement that mitigating circumstances receive individualized consideration.\n\n[126 N.J. at 48.]\n\nIn that case, we found that the trial court also had erred by refusing to list the separate factors under c(5)(h) on the verdict form: \"Any other factor * * * that a defendant submits for consideration and that could be established by some reliable evidence should be listed on the jury-verdict form.\" Id. at 47 (citations omitted). We noted that the jurors should be instructed that the list of mitigating factors is not exclusive. Ibid. By those standards, the court's instructions here were inadequate in that they did not present mitigating factor c(5)(h) in terms related to the individual defendant or particular evidence of this case. Nor did the court give the jury any examples of the types of mitigating factors that it could consider.\n\nNevertheless, we have not held that faulty instructions on c(5)(h), standing alone, constitute grounds for reversing a death sentence. See, e.g., Biegenwald IV, supra, 126 N.J. at 45-49. In State v. Marshall, 123 N.J. 1, 141-48 (1991), we found defense counsel's summation, coupled with the court's instruction to consider all the evidence in assessing c(5)(h), adequate to inform the jury. In that case, we stated that \"although arguments of counsel can by no means serve as a substitute for instructions by the court, the prejudicial effect of an omitted instruction must be evaluated 'in light of the totality of the circumstances -- including all the instructions to the jury, [and] the arguments of counsel.'\" Marshall, supra, 123 N.J. at 145 (quoting Kentucky v. Whorton, 441 U.S. 786, 789, 99 S. Ct. 2088, 2089, 60 L. Ed. 2d 640, 643 (1979)) (citation omitted).\n\nIn this case, the court's inadequate instruction on mitigating factor c(5)(h) was partially remedied by defense counsel's explanation of the mitigating factors in her summation:\n\nYou don't have to pigeonhole all of the information that you have heard only in one category. You can assign it what weight you think it has and put it under whatever factors strikes you as having been established.\n\nNot necessary that you say, for example, the testimony about his drinking is relevant only to his background.\n\nIf you find that its [sic] relevant to something else, you can allocate it and give it whatever weight you find appropriate * * * and this is extremely important because this is really the keystone of the system.\n\nThus, defense counsel made it clear to the jury that all the evidence presented at trial about defendant's background could be viewed as part of the catch-all mitigating factor c(5)(h). The court made that point as well, but not with sufficient clarity.\n\nIn assessing the significance of the court's instruction on the catch-all mitigating factor, we note that six members of the jury found that that factor had been established. In comparison, only two jurors found that the mitigating factor of extreme mental or emotional disturbance, c(5)(a), had been proved, and none of the jurors found that the age mitigating factor, c(5)(c), or the significant impairment of moral faculties factor, c(5)(d), had been established. Much of the evidence that jurors might have considered relevant to the catch-all factor was also germane to the factors that most of the jurors specifically rejected. In view of the strength of defendant's evidence of mitigating factors, the jury's reluctance to find that mitigating factors -- other than the catch-all factor -- had been established reflects the jury's qualitative determination that despite its credibility, the testimony on mitigation was insufficient to diminish defendant's culpability for his crimes. We consider extremely unlikely the possibility that the court's instruction on the catch-all mitigating factor had the capacity materially to affect the jury's deliberations or produce an unjust result.\n\nG. Other Issues\n\n1. Constitutionality of Aggravating Factor c(4)(a)\n\nDefendant argues that N.J.S.A. 2C:11-3c(4)(a) (the prior-murder aggravating factor), as amended by the Legislature in 1985, is unconstitutional because it contradicts the Legislature's statement of intent, violates the ex post facto clauses, and constitutes a bill of attainder. In State v. Biegenwald, 96 N.J. 630, 634-40 (1984) (Biegenwald I), and State v. Bey, 96 N.J. 625, 628 (1984), we held that a prior murder conviction could be used as an aggravating factor under c(4)(a) only after all avenues of direct appeal had been exhausted. Apparently, in response to our decisions, the Legislature amended the statute to allow the use of prior murder convictions still on appeal. L. 1985, c. 178.\n\nAfter we had reversed defendant's first conviction for the Alston murder in Bey I, defendant was retried and again convicted of murder. The Appellate Division affirmed that conviction, N.J. Super...., and we denied certification. Prior to defendant's second sentencing proceeding in the Peniston case, defendant moved to strike the c(4)(a) factor, arguing that the statute, as originally enacted and interpreted by this Court in Bey and Biegenwald I, would not have allowed the State to allege that factor for a murder conviction still on appeal. The trial court denied the motion, ruling that the State could submit the c(4)(a) factor based on defendant's second conviction for the Alston murder.\n\nDefendant now argues that submission of the c(4)(a) aggravating factor in that resentencing trial contradicted the Legislature's intent. The Judiciary Committee Statements to L. 1985, c. 178 contain the following preamble: \"In enacting the amendments contained in this bill, the intent of the Legislature is to effect only prospective changes. The amendments are not intended to apply retrospectively or to affect cases now on appeal.\" Senate Judiciary Comm. Statement to S.950, supra at 1. See also Assembly Judiciary Comm. Statement to S.950 at 1 (Feb. 4, 1985). However, we have held that that statement of legislative intent is not dispositive on whether the amendments should be given retroactive effect because the amendments merely clarify a pre-existing law. Biegenwald II, supra, 106 N.J. at 64-66. Indeed, many of the amendments to the Capital Punishment Act have been applied retroactively by this Court. See, e.g., [Marie] Moore, supra, 113 N.J. at 306-07 (Court partially relied on 1985 amendment authorizing substitution of juror after guilt phase but prior to sentencing phase); Bey I, supra, 112 N.J. at 95-105 (Court applied 1986 amendment providing that juvenile may not be sentenced to death); Biegenwald II, supra, 106 N.J. at 63-65 (Court relied in part on 1985 amendment in holding that State must prove aggravating factors outweigh mitigating factors beyond reasonable doubt); Ramseur, supra, 106 N.J. at 311-12 (Court relied in part on 1985 amendment in holding that capital sentencing juries must be reminded of alternative sentence to death penalty and of consequences of non-unanimous jury). Although the amendment was enacted after the Alston and Peniston homicides, its passage predated defendant's resentencing proceeding. The Legislature's expressed intent that the amendment apply prospectively does not preclude the use of a prior murder conviction pending on appeal in a resentencing proceeding that commenced after the amendment was passed. Thus, we hold that the submission of the c(4)(a) factor in this sentencing proceeding does not contradict the legislative intent.\n\nDefendant contends that the use of the Alston murder as an aggravating factor violates the state and federal constitutional prohibitions on ex post facto laws because defendant committed both murders before our decisions in Bey and Biegenwald I. See U.S. Const. art. I,  10, cl. 1; N.J. Const. art. IV,  7, P 3. The purpose of the ea ex post facto clauses is to ensure that criminal statutes \"give fair warning of their effect and permit individuals to rely on their meaning until explicitly changed.\" Weaver v. Graham, 450 U.S. 24, 28-29, 101 S. Ct. 960, 964, 67 L. Ed. 2d 17, 23 (1981). To violate the ex post facto clauses, the law at issue must be \"both retrospective and more onerous than the law in effect on the date of the offense.\" Id. at 30-31, 101 S. Ct. at 965, 67 L. Ed. 2d at 24 (emphasis added). Here, on the dates of defendant's murders, the c(4)(a) factor simply stated that \"the defendant has previously been convicted of another murder.\" Therefore, defendant was on notice that any murder conviction, final or not, could potentially be used to support the c(4)(a) aggravating factor. The Court's subsequent interpretation of the c(4)(a) factor in Bey and Biegenwald I, later overridden by the Legislature, was not controlling law at the time of the murders. Thus, it would be incongruous to find the Legislature's amendment, which merely clarified this Court's statutory interpretation and reinstated, in effect, the plain meaning of the statute as enacted to be ex post facto.\n\nDefendant contends that the amendment is a bill of attainder because it substitutes a legislative determination of his guilt for a judicial decision. See U.S. Const. art. I,  10, cl. 1; N.J. Const. art. IV,  7, P 3; United States v. Brown, 381 U.S. 437, 446-49, 85 S. Ct. 1707, 1713-15, 14 L. Ed. 2d 484, 490-92 (1965). Although the amendment was a response to decisions of this Court affecting Bey and Biegenwald, it changed the law for all capital defendants and did not effect legislative determinations of guilt for any particular defendant or group of defendants. We conclude the amendment is not a bill of attainder.\n\n2. Prosecutorial Misconduct\n\nDefendant contends that several instances of prosecutorial misconduct warrant reversal of his death sentence. Here, we address only those allegations that we believe raise important legal issues.\n\nThe prosecutor's primary duty is to serve Justice rather than to win convictions. State v. Farrell, 61 N.J. 99, 104 (1972). The principle of prosecutorial fairness is all the more imperative in the context of capital cases because death is the ultimate punishment. Consequently, this Court will apply a stricter standard of review to prosecutorial misconduct in capital cases. Ramseur, supra, 106 N.J. at 324. We set forth that standard of review in Ramseur:\n\nIn determining whether prosecutorial misconduct is prejudicial and denied defendant a fair trial, we consider whether defense counsel made a timely and proper objection, whether the remark was withdrawn promptly, and whether the court ordered the remarks stricken from the record and instructed the jury to disregard them.\n\n[Id. at 322-23.]\n\nSee Rose I, supra, 112 N.J. at 509; State v. Koedatich, 112 N.J. 225, 338 (1988), cert. denied, 488 U.S. 1017, 109 S. Ct. 813, 102 L. Ed. 2d 803 (1989). More recently, we observed that the assessment of prosecutorial misconduct \"must take into account the tenor of the trial and the degree of responsiveness of both counsel and the court to the improprieties when they occurred.\" Marshall, supra, 123 N.J. at 153.\n\nIn this case, the alleged misconduct occurred primarily during the prosecutor's summation. We have held that a prosecutor's closing argument must be limited to the facts in evidence and inferences reasonably to be drawn therefrom. See State v. Carter, 91 N.J. 86, 125 (1982); Farrell, supra, 61 N.J. at 102. Defense counsel did not object during or after the summation. Rather, the defense first raised its objections to the prosecutor's summation the following morning but did not present the court with a request to charge. The court thereupon issued curative instructions immediately prior to charging the jury. In State v. Winter, 96 N.J. 640, 647 (1984), we stated that \"the adequacy of a curative instruction necessarily focuses on the capacity of the offending evidence to lead to a verdict that could not otherwise be justly reached.\"\n\n(a) Mischaracterization of Mitigating Factors\n\nIn his closing statement, the prosecutor improperly characterized a possible mitigating factor as an excuse: \"Child abuse is a horrible, horrible thing * * * but its [sic] not an excuse and he wasn't a child when he killed Carol Penniston [sic].\" As we have explained, the purpose of the mitigating factors is \"not to justify or excuse defendant's conduct, but to present extenuating facts regarding the defendant's life or character or the circumstances surrounding the murder that would justify a sentence less than death.\" Bey II, supra, 112 N.J. at 170. The trial court remedied the prosecutor's error by instructing the jury that mitigating factors are extenuating circumstances for purposes of punishment, not excuses for murder. Therefore, the prosecutor's misstatement did not have the capacity to cause an unjust result.\n\n(b) Mischaracterization of the Age Mitigating Factor\n\nAt the time of the Peniston murder, defendant had just turned eighteen years of age. The prosecutor, in his closing statement, argued that the jury should not find the age mitigating factor.\n\nAs we sit here today there are * * * eighteen year olds performing everywhere. I dare say of the fifty thousand people who are sitting in Saudi Arabia in our military, many of them are eighteen.\n\nSo, age per se is just not relevant and in growing up and in immaturity this is a guy whose [sic] out on the street at thirteen. This is the guy whose [sic] away from the evil influences of his mother by the time he's fourteen.\n\n[Emphasis added.]\n\nBoth the Death Penalty Act and our decisions make clear that age should be considered a mitigating factor when the defendant is young. Ramseur, supra, 106 N.J. at 295. See infra at . Although \"the prosecutor was free to depreciate the significance of defendant's mitigating evidence\" by comparing him to his peers, the prosecutor's comment was highly misleading. Marshall, supra, 123 N.J. at 164. However, the court issued a curative instruction before the jury charge:\n\nThe Prosecutor in his summation stated that \"age per se is just not relevant.\"\n\nI instruct you to disregard this comment because age is a proper mitigating factor for you to consider * * * .\n\nThus, the court's instruction rendered the prosecutorial error harmless.\n\n(c) Prosecutor's Attack on Defense Experts\n\nThroughout his summation, the prosecutor criticized the defendant's medical experts:\n\nYou heard the diagnosis from everybody. Everybody [says] he's an antisocial person. * * * .\n\nOh, now we can disagree as to how it came about, but ever [sic] responsible doctor in this case tells you antisocial personality, except Pincus.\n\nI suggest to you, that you should question Dr. Pincus' science.\n\nHe's got a theory first and he's going to pick and choose facts to make the theory work.\n\nAnd [Dr. Kay says], well [defendant's brain damage has] got to be in the left temporal lobe. * * * I can't show you on a machine, but it has to be there.\n\nWhy does it have to be there? Because we know that that's what controls behavior. Its [sic] self-fulfilling.\n\nIt has to be there because its [sic] suppose [sic] to be there.\n\nIn those comments, the prosecutor not only impugned the integrity of the defense experts, he also characterized their scientific Conclusions as being predetermined by their theories. Under the ABA Standards for Criminal Justice  3-5.8(a), \"It is unprofessional conduct for the prosecutor intentionally to misstate the evidence or mislead the jury as to the inferences it may draw.\" In Rose I, supra, 112 N.J. at 518-24, we reversed the death sentence for prosecutorial misconduct where the prosecutor implied, among other things, that the expert's testimony was fabricated or contrived at the urging of defense counsel. By contrast, the prosecutor here did not imply any impropriety on the part of defense counsel. Moreover, the trial court issued a curative instruction:\n\nAny references mode by the Prosecutor during his summation, that any of the defense Doctors were predisposed to making a certain diagnosis of the Defendant, Marko Bey, should be disregarded by you.\n\nThe weight to be given to the expert testimony of the Doctors, both for the defense and for the Prosecution, is for your evaluation and determination.\n\nOverall, we conclude that any prosecutorial misconduct in the summation, when viewed in the context of the entire record, was harmless.\n\n3. Ineffective Assistance of Counsel\n\nDefendant argues that the trial court's rulings prohibiting defense co-counsel from addressing the court, prosecutor, or jury denied him effective assistance of counsel.\n\nGiven the inherent complexity of capital cases, the Office of the Public Defender assigns two attorneys to represent every capital client. At the outset of trial, the court made it clear that only one Public Defender would be permitted to examine and cross-examine witnesses. Later on, the court refused to listen to co-counsel when he attempted to participate in a motion in limine. As a result of the trial court's ruling, lead counsel repeatedly had to request conferences whenever her co-counsel sought to make a point, thereby occasioning needless delays. At one point, during a sidebar conference, co-counsel attempted to object to the prosecutor's cross-examination of Dr. Young. The court stopped him, reminding him that it would listen only to lead counsel:\n\n[CO-COUNSEL]: He's introducing prior bad acts through the back door.\n\nTHE COURT: I'll listen to her.\n\n[LEAD COUNSEL]: What were you saying, [co-counsel]? Whatever he's said. I concur with.\n\n[CO-COUNSEL]: He's trying to introduce characters --\n\nTHE COURT: I'm not listening.\n\n[CO-COUNSEL]: -- characters not in issue.\n\nThe court then ordered a recess, and the following colloquy occurred:\n\nTHE COURT: [Co-counsel], I hope you're not having difficulty following my instructions. I told you that [lead counsel] is the one who is handling this case. If you want to consult with [lead counsel] and [lead counsel] wants to consult with you with regard to the [sic] any objections or statements, fine.\n\nI'm not going to listen to both of you at sidebar nor in open Court.\n\n[CO-COUNSEL]: Your Honor is threatening and chilling the Defense.\n\nTHE COURT: This is not a debate. You can talk to [lead counsel] and she can make her notes and she can put your objections on the record. I'm only going to listen to [lead counsel] or her objections, not yours.\n\nDefense counsel thereupon consulted for thirty-five minutes. Although the trial court's rulings strike us as unwise and unnecessarily restrictive, we reaffirm the proposition that a trial court generally possesses broad discretion over the conduct of trial. Smith v. Smith, 17 N.J. Super. 128, 132-33 (App. Div. 1951), certif. denied, 9 N.J. 178 (1952).\n\nA showing of ineffective assistance requires that counsel \"performed below a level of reasonable competence\" and \"that 'there is a reasonable probability that, but for counsel's unprofessional errors, the result of the proceeding would have been different.'\" State v. Fritz, 105 N.J. 42, 60-61 (1987) (quoting Strickland v. Washington, 466 U.S. 668, 694, 104 S. Ct. 2052, 2068, 80 L. Ed. 2d 674, 698 (1984)). Defendant concedes that co-counsel was involved in all aspects of the case other than addressing the court and jury. Additionally, defendant does not claim that lead counsel was overburdened. Although the trial court's ruling certainly occasioned some inconvenience, the court allowed defense counsel to confer on request, and apparently did not set any time limits on those Discussions. Defendant cannot show that co-counsel's inability to speak in court undermined the defense's performance or that it created a reasonable probability that the result of the sentencing would have been different.\n\n5. Cumulative Error\n\nDefendant contends that even if the individual errors are deemed harmless, their cumulative effect requires reversal of defendant's death sentence. We have acknowledged that several errors were committed during the course of the penalty phase trial, although none of those constitutes reversible error.\n\nWe had occasion to discuss the issue of cumulative error in Marshall, supra, 123 N.J. at 169-70. There we noted that although capital defendants are entitled to fair trials, they cannot be assured of error-free trials. Id. at 170 (citing Lutwak v. United States, 344 U.S. 604, 619, 73 S. Ct. 481, 490, 97 L. Ed. 593, 605 (1953)).\n\nThe fact that capital cases are vigorously contested, protracted, and consistently implicate subtle an', difficult legal issues virtually assures that in the course of each trial some errors and imperfections will be apparent. Trial Judges, unlike appellate Judges, make their rulings in the heat of trial, without the opportunity for deliberative review, and not even the most experienced and conscientious trial Judges can be perfect.\n\n[Id. at 169.]\n\nNevertheless, we are still bound to make \"a qualitative determination that considers, in the context of the entire case, whether the error was clearly capable of affecting the verdict or the sentence.\" Bey I, supra, 112 N.J. at 94-95. Under that standard, we have carefully reviewed each of the errors identified by this opinion. In conducting that review, we are influenced significantly by defendant's poignant presentation of substantial mitigating evidence that attempted to relate his adulthood criminality to the abuse he suffered as a child. The failure of some jurors to find any mitigating factor, and the jury's unanimous Conclusion that the mitigating evidence was substantially outweighed by the aggravating factors, reflects the jury's Conclusion that despite the strength of the mitigating evidence, death was the appropriate punishment.\n\nWe are fully satisfied that the errors committed during the penalty phase, considered both individually and cumulatively, were not clearly capable of affecting the sentence.\n\n6. Constitutionality of Capital Punishment Act\n\nDefendant argues that New Jersey's Death Penalty Act violates the Eighth Amendment's prohibition against cruel and unusual punishment. We rejected that constitutional challenge in Ramseur, supra, 106 N.J. at 182-90, and we have consistently reaffirmed that decision in our subsequent capital cases, as we do today.\n\n7. Proportionality Review\n\nDefendant contends that his death sentence is disproportionate to the penalty imposed in similar cases, and points to two factors: the Prosecutor's Office's retreat from its initial willingness to enter into a plea bargain and defendant's mental illness and abused childhood. N.J.S.A. 2C:11-3e mandates that this Court undertake a determination of proportionality on a defendant's request. However, we defer proportionality review until a full record has been established and argument can be scheduled by the Clerk of the Court after consultation with counsel.\n\nIV.\n\nConclusion\n\nWe affirm defendant's conviction for the murder of Carol Peniston and we affirm the sentence of death.\n\nChief Justice Wilentz and Justices Clifford, Pollock, and Garibaldi join in this opinion. Justice Handler has filed a separate Dissenting opinion, Part II of which Justice O'Hern joins. Justice O'Hern has filed a separate Dissenting opinion, Part I of which Justice Handler joins.\n\nHANDLER, J., Dissenting.\n\nIn State v. Bey, 112 N.J. 123 (1988) (Bey II), this Court affirmed Marko Bey's conviction for the murder of Carol Peniston, but vacated his sentence of death and remanded the case for a second capital-sentencing proceeding. A second jury has sentenced defendant to death for the Peniston murder. The Court affirms that death sentence.\n\nI emphatically disagree with the analysis and reasoning of the Court on certain critical issues that enable it to reach the Conclusion that the death sentence in this case is sustainable. Further, I take exception to the Court's application of the judicial standard of review in capital cases, which allows it to discount serious trial errors that singly and cumulatively undermine the validity of the death sentence. The Disposition of this appeal exemplifies the inconsistency, illogic, and irrationality that surround capital-murder prosecutions. I adhere to the position that the Capital Murder Act is unconstitutional as enacted, interpreted, and applied.\n\nI\n\nThe facts of defendant's murder of Carol Peniston appear in Bey II, supra, 112 N.J. at 131-33, and are sufficiently recounted by the Court. Ante at slip op. at 2-3). I conclude that defendant's antecedent murder conviction was based on an erroneous jury instruction defining capital murder and therefore cannot be considered to be founded on a valid determination of intentional murder. I therefore would reverse under State v. Gerald, 113 N.J. 40 (1988), and on that issue I join in the Dissenting opinion of Justice O'Hern. Ante at (slip op. at ).\n\nPortions of the trial court's charge were framed in terms of whether defendant knowingly or purposely killed, without mention of intent to inflict serious-bodily-injury. The jury interrogatory also was framed in terms of knowing or purposeful murder, with no mention of serious-bodily-injury murder. However, at the outset of its instructions, the court told the jury that the indictment charged that defendant \"did commit the crime of murder in that the said Marko Bey did purposely or knowingly cause the death of or serious bodily injury resulting in the death of Carol Peniston.\" The court's explanation of murder also included references to a killing either with the purpose or an awareness of homicidal acts causing only \"serious bodily injury resulting in death.\"\n\nIn denying defendant's motion for a new trial, the trial court acknowledged that parts of the charge referred to serious-bodily-injury murder, but dismissed them as insignificant because \"the charge in its entirety instructed the jury on, and required that they [sic] consider, whether the defendant purposely or knowingly caused death.\" The trial court also reasoned that the arguments of both counsel framed the issue only in terms of whether defendant had killed knowingly or purposely.\n\nThere is no way to know whether the jury, having heard several times that murder is defined as including the knowing or purposeful infliction of serious bodily injury resulting in death, continued to think of murder in those terms. Moreover, regardless of how counsel framed the argument, the jury may have disregarded the theories of the defense and prosecution, instead reaching its own theory concerning defendant's guilt for murder, a theory which, because of the court's charge, could have encompassed serious-bodily-injury murder. See State v. Green, 86 N.J. 281, 288 (1981) (observing that \"appropriate and proper charges to a jury are essential for a fair trial\"); State v. Butler, 27 N.J. 560, 595 (1958) (stating that \"the criminal law cannot be administered justly or efficiently if the jury is allowed to speculate as to what conduct the law intended to proscribe by a specified crime\"); see also Taylor v. Kentucky, 436 U.S. 478, 488, 98 S. Ct. 1930, , 56 L. Ed. 2d 468, 477 (1978) (holding that \"arguments by counsel cannot substitute for instructions by the court\"). Hence, the sole question before the Court on this issue is whether there is a rational basis in the record from which the jury could have concluded that defendant may have intended to inflict serious bodily injury. There is such a basis.\n\nMuch of the evidence relating to defendant's state of mind consisted of his own statements. A jury reasonably could have inferred from those statements a loss of self-control rather than an intent to kill. After his arrest defendant told an investigator:\n\nI robbed the lady, I just bugged out, she saw my face, I saw her, got out of the car on Sewall Avenue, just walked around, found someplace where it was dark, going through her pocketbook. There was a light and I just bugged out. Somewhere across the tracks just past Asbury Avenue, by a building, side of the building, inside the building I just bugged out, going through her purse, went into her coat pocket, I turned around and she was looking at me.\n\nIn his written confession, read to the jury during the guilt phase, defendant stated that he had been rummaging through Peniston's purse when he noticed that she \"was looking\" at him. He said he \"got scared\" and started hitting her, and hit her \"four, five, or six times,\" indicating that he did not use anything but his hands when striking her. During his direct testimony, defendant gave a similar account. On cross-examination by the prosecutor, defendant denied that he had killed the victim in order to keep her from identifying him. According to the medical examiner, strangulation was the cause of death, but defendant never mentioned strangling the victim. The trial court incorrectly indicated that defendant had mentioned a belt, but the prosecutor, not defendant, was the person who characterized the belt as the weapon used to strangle the victim. In sum, defendant's statements do not necessarily indicate on intent to kill.\n\nMoreover, the totality of the facts do not lead inescapably to the Conclusion that defendant intended to kill. Defendant's victim died after he had choked her. The trial court reasoned that \"strangulation, like bullet wounds to the head, is meant to cause the death of the victim.\" The majority seems to accept that reasoning. According to the majority, choking is \"commonly understood as a form of violence designed and likely to kill a victim, and hence would ordinarily not be used by one whose purpose was only to inflict bodily injury.\" Ante at (slip op. at 18).\n\nThe Court, with no basis in evidence and with no medical experience, ignores the possibility that defendant meant only to choke the victim momentarily, and that her death was unintentional. As this Court stated in State v. Breakiron, 108 N.J. 591, 605-06 (1987):\n\nOne who shoots the bullet into the head of another will be hard put to convince a jury that he or she did lot know, with practical certainty, that death would result. On the other hand, one who throws a punch at someone in a bar may be able to convince a jury that death resulting from the victim's fall was not the practically certain result of the punch. The much more difficult case is one in which someone like [the defendant] admits to reaching out in anger at another and choking the victim with a towel: was death his purpose? Was he practically certain the victim would die?\n\n[(emphasis added).]\n\nSee also State v. Perry, 124 N.J. 128, 190-92 (1991) (Handler, J., Concurring in part and Dissenting in part) (arguing that where defendant strangled victim to death, death-eligibility was not established under Gerald); State v. Vujosevic, 198 N.J. Super. 435 (App. Div.) (affirming conviction for aggravated manslaughter of defendant who strangled victim to death), certif. denied, 101 N.J. 247 (1985).\n\nThis case should not be made to turn on an unenlightened discourse on strangulation, particularly among Judges who know little about it. Unfortunately, because the Court rules as a matter of law that strangulation constitutes intentional murder when it is accompanied by severe beating, ante at (slip op. at 18-19), the topic cannot be passed by.\n\nChoking -- like beating -- is used commonly to overpower people without killing them. In fact, many police departments around the nation explicitly authorize police officers to use choke holds in order to subdue unruly persons under arrest. \"Generally considered to be in the mid-range of force used by police officers, the hold is designed to overcome resistance quickly and to prevent the confrontation from escalating into a more serious conflict.\" Ronald Kornblum, M.D., Medical Analysis of Police Choke Holds and General Neck Trauma (Part 1), 27 Trauma No. 5, at 8 (1986). \"Choke holds\" are used to avoid serious injury. Id. at 8-9. Police use them because the medical literature reveals that, in fact, they generally do not result in death or even substantial harm. Kornblum, \"Medical Analysis of Police Choke Holds and General Neck Trauma (Part 2), 28 Trauma No. 1, at 62-63 (1986); see also City of Los Angeles v. Lyons, 461 U.S. 95, 103 S. Ct. 1660, 75 L. Ed. 2d 675 (1983) (holding that citizen subjected to police choke hold was not entitled to federal court injunction against future police choke holds). Given that chokes often are applied merely to interrupt a person's breathing for a short time, and that they rarely cause strangulation deaths, the Conclusion that a defendant who intends to choke someone necessarily intends to kill someone, or that a defendant who intends to choke and beat someone necessarily intends to kill someone, is totally unfounded.\n\nCommon sense, as reflected in the criminal judgments handed down across the state, negates the majority's position. Jury verdicts and prosecutorial charging decisions suggest that New Jerseyans often believe that strangulation deaths are unintended. Data collected by the Administrative Office of the Court and Professor David Baldus, Special Master of our Proportionality Review Project, indicate the following: of the eighty strangulation homicide cases occurring over the last decade in which strangulation was the leading cause of death and there was no doubt about the identity of the person who had committed the homicide, only forty-four resulted in convictions for knowing or purposeful or serious-bodily-injury murder. Thirty-six resulted in convictions for lesser crimes; five of those resulted in convictions for manslaughter, twenty-five for aggravated manslaughter, and eight for felony murder. See Administrative Office of the Courts, Interoffice Memo, June 3, 1992, at 2. Given those statistics, the majority's Conclusion that a reasonable jury could not have found that Bey did not intend to kill is patently unsupportable.\n\nI agree with the majority that defendant committed this murder with particular brutality. The State compares this case to State v. Harvey, 121 N.J. 407 (1990), cert. denied, U.S...., 111 S. Ct. 1336, 113 L. Ed. 2d 268 (1991). In some ways, this attack seems to have been more violent than that of Harvey. Nevertheless, there was ample evidence from which the jury could have found that the killing, despite its brutality, was unintended. Of course, the jury could have inferred from the evidence that defendant had intended to kill his victim. The jury may indeed have accepted the State's theory that defendant, intending that the victim never be able to identify him, took her to the secluded shack where he robbed, raped, and brutally murdered her. Yet there also was evidence that defendant had consumed large quantities of drugs and alcohol and that he lost control. Thus, the jury also could have inferred that defendant, under the influence of drugs and alcohol and in a rage, had beaten and choked the victim in order to subdue her or in order to inflict serious bodily injury but not death. As defendant notes, the trial court charged the jury on both aggravated and reckless manslaughter, strongly suggesting that a factual basis existed for lesser-included and non-death-eligible offenses.\n\nGiven the violence with which defendant attacked his victim, it is unlikely, but not impossible, that the jury would have found him guilty only of serious-bodily-injury murder had it been given the chance. Because the issue is close and there is room for doubt, the issue must be resolved in favor of defendant. The evidence need be only \"'minimally adequate' to provide a rational basis for the jury to find that defendant intended to cause serious bodily injury.\" State v. Pennington, 119 N.J. 547, 561 (1990) (quoting State v. Pitts, 116 N.J. 580, 615 (1989)). In attacking his victim, defendant used two means of violence -- beating and choking -- neither of which usually results in death. That defendant failed to realize the sum of his actions would result in the victim's death is not \"inconceivable.\" See State v. Rose, 120 N.J. 61, 64 (1990) (Rose II). Therefore, because defendant's conviction for murder did not establish death-eligibility under Gerald, his antecedent conviction for capital murder should be reversed and his death sentence vacated.\n\nII\n\nThe prosecution retained Dr. Gerald Cooke, a clinical and forensic psychologist, to examine and evaluate defendant. Dr. Cooke prepared a report but did not testify at trial. However, his report was reviewed by the prosecution and defense experts who did testify. Defendant sought unsuccessfully to introduce the Cooke report into evidence and to use the report in cross-examining a State's expert witness. The Court now concludes that the trial court's rulings foreclosing the presentation by defendant of relevant and reliable mitigating evidence consisting of Dr. Cooke's report did not constitute reversible error. Ante at (slip op. at 33-34). In the context of a capital-murder prosecution, particularly in its penalty phase, the Court's Conclusion cannot be justified. The report addressed defendant's mental and emotional condition and went to the core of his defense. Moreover, because it was compiled and written by a doctor affiliated with the State, it constituted one of the most powerful kinds of mitigating evidence there is: mitigating evidence whose source is virtually unimpeachable. Juries are extremely apt to accept such evidence, and its improper exclusion inevitably has an extreme prejudicial effect on defendants. In this case, that prejudice was exacerbated by the additional circumstance that the defense was prevented from fully examining defendant's mother to elicit direct evidence of the abuse defendant had suffered as a child. Although that abuse was the factual basis for the opinion of all of the experts concerning defendant's mental and emotional condition, rulings by the trial court severely hampered defendant's ability to recount it to the jury.\n\nA\n\nThe defense presented three expert witnesses: Dr. Gary Kay, a clinical neuropsychologist; Dr. John Young, a forensic psychiatrist; and Dr. Jonathan Pincus, a neurologist. Their testimony was offered to prove mitigating factors c(5)(a), that \"the defendant was under the influence of extreme mental or emotional disturbance insufficient to constitute a defense to prosecution,\" and c(5)(d), that \"the defendant's capacity to appreciate the wrongfulness of his conduct or to conform his conduct to the requirements of the law was significantly impaired as the result of mental disease or defect or intoxication, but not to a degree sufficient to constitute a defense to prosecution.\" Their testimony was also relevant to mitigating factor c(5)(h): \"any other factor which is relevant to the defendant's character or record or to the circumstances of the offense.\n\nAlthough the defense experts differed somewhat in emphasis and detail, they essentially agreed that a combination of physiological and psychological damage inflicted on defendant as a child had rendered him incapable of maintaining control in certain situations. The experts described the alcohol abuse of defendant's mother when she was pregnant with him; the serious head injuries sustained by defendant as a child, resulting from his mother's beatings as well as a bicycle accident; and defendant's own substance abuse during his pre-adolescent and teenage years. They testified that those factors, in addition to a variety of tests administered to defendant, indicated that he was brain-damaged. The defense experts also testified to the cruel and unstable circumstances in which defendant had been raised: his mother beat him severely and frequently, often for no apparent reason; he and his brothers often were left alone in an apartment without food, electricity, or hot water; his family moved frequently and had no father figure.\n\nThe experts concluded that defendant's physical and psychological injuries rendered him unable to maintain self-control and caused him to strike out violently and irrationally -- especially against women. Dr. Kay testified that defendant is \"likely to lose control, to not be able to get the cork back on the bottle and let the genie out. . . . He appears to be an individual who has difficulty controlling the intensity of his emotional responses.\" Dr. Young testified that certain stimuli \"trigger\" in defendant a violent reaction that would not take place in a \"normal person,\" and that the combination of his brain damage, the fact that he was under the influence of drugs and alcohol, and the right stimuli, made him lose control \"when his crimes took place.\" Dr. Pincus testified along similar lines:\n\nI think you have a person there who was . . . abused, has a model of behavior of striking out savagely when you're angry and also is angry himself because of the way he was treated by women, by his mother.\n\nI think that he was out of control at that time when he did that, when he committed the homicide.\n\nHe has these impulses which he finds it very difficult to control. . . . What is controlling him from doing it is he has, most of the time, some tenuous control over these impulses. Or when he drinks or when he uses marijuana, he loses it. And then if something happens that he feels challenges him, during the course of that he completely loses control, gets into a fight. He's going to fight until he either kills or is killed. He can't control it.\n\nIn rebuttal, the State presented Dr. Timothy Michals, a forensic psychiatrist. Dr. Michals testified that defendant merely suffered from \"an antisocial personality disorder,\" that is, \"that throughout his life his behavior towards others hasn't followed the rules.\" He testified further that \"there's nothing wrong with the brain organically that we know of that causes a person to become antisocial.\" Reviewing the facts surrounding the Peniston murder, Dr. Michals believed that defendant's thinking was clear and \"intact,\" and that there were no \"stressors\" or \"triggers\" that made defendant murder. He suggested that defendant had killed Peniston simply because he did not \"want to get caught.\" He emphasized that none of the tests performed on defendant by the defense experts conclusively showed signs of brain damage.\n\nThe trial court's decision to exclude Dr. Cooke's report was based in large part on the court's Conclusion that defendant was partly responsible for Dr. Cooke's unavailability as a witness. The majority refers to the defendant's failure to subpoena the doctor in discounting the harm caused by the trial court's ruling. Ante at (slip op. at 32). However, it is fair to infer that the public defender did not cause Dr. Cooke's unavailability. Dr. Cooke was unavailable because of the difficulties inherent in scheduling witnesses who have pressing professional obligations. The trial court's characterization of defense counsel's responsibility was not supported by the record, but, more importantly, the court's reliance on that characterization clouded the central issue of whether the jury was entitled to hear the relevant and reliable mitigating evidence included in the report.\n\nThe State did not call Dr. Cooke, apparently deciding that his testimony was not needed to rebut Dr. Pincus' testimony. On Monday, September 10, the last day of testimony, defense counsel moved to enter into evidence the Cooke report. Counsel argued that the report has \"all of the indicia of reliability\" as it was \"procured by the State\" She noted that Drs. Kay and Young had made reference to the report, and that the prosecutor also had used the report in cross-examining Dr. Kay. She noted further that she had attempted to communicate with Dr. Cooke, but that he had been unavailable.\n\nThe prosecutor argued that if the defense wanted to use Cooke's testimony as mitigating evidence, then the defense should have subpoenaed him. The prosecutor, nevertheless, implicitly conceded its reliability. He stated: \"under the circumstances of this case the only thing that should go in is pages one through seven. And quite frankly, I would move pages one through seven because their expert made my expert unavailable.\"\n\nThere clearly was no adequate reason attributable to attorney dereliction to justify the exclusion or limitation of Dr. Cooke's report. The events leading to the need for that report, however, reveal both its importance and its reliability, reliability implicitly assumed by the attorneys and the witnesses. The Court cannot sensibly and fairly predicate its determination concerning harmfulness of error on procedural grounds involving the actions of defense counsel.\n\nB\n\nThe probative worth and reliability of the report cannot be ignored. In the first seven pages of his report, Dr. Cooke essentially rejected the defense experts' findings of brain damage. However, the last two pages of the report are largely corroborative of the defense experts' psychological profile: that defendant's history of child abuse, his drug and alcohol use, and his hostile feelings toward women as a result of his mother's mistreatment of him have resulted in behavior in which defendant loses control. Dr. Cooke wrote:\n\nThere is no question that there was a pattern of neglect and cruel beatings of Mr. Bey by his mother. In my opinion this led to antisocial features above and beyond those of his peer group and also caused intense anger toward women . . . . The other part of the history which is important is that his drug use mostly consisted of marijuana which he used all day, every day, with only occasional experimenting with other drugs such as cocaine and L.S.D. He also indicates that he drank two to three 40 ounce bottles per day of beer. On the day of the offense he indicates that he had been smoking marijuana all day and believes he had at least two 40 ounce bottles of beer . . . .\n\nAs a child, he was anxious, helpless, insecure, frightened, and depressed, due to the combination of neglect and cruelty from his mother. As he got older, and under dissocial influences in his milieu, his defensive structures to deal with those feelings involved an attempt to compensate for then and undo them. This defensive system developed into a personality disorder which also encouraged the expression of the anger he felt due to the neglect and cruelty.\n\nDr. Cooke also elaborated on defendant's feeling toward women:\n\nOn the one hand, he tends to idealize women, perhaps because of the fantasy of the hoped for mother he never had. On the other hand, he has both angry and derogatory feelings toward women. . . . He has a tremendous rage toward women and, in my opinion, it is this rage that is the reason for his brutal aggression, demeaning, and sexual attacks toward his victims. The level of aggression certainly was not necessary to the purpose of robbery. Even if he wanted to kill them to prevent him from identifying him to the police, the level of aggression and brutality was unnecessary.\n\nDr. Cooke concluded that\n\nas one looks back over his history, almost all of the persons he has tried to rob, and also has physically attacked, have been women and, with one exception, all of them have been literally been old enough to have been his mother. The combination of his personality dynamics and the evidence regarding the brutal physical and sexual attack on Ms. Penniston [sic] do indicate that at some point he lost control and acted in a rage.\n\n[(emphasis added).]\n\nIt is of course \"essential . . . that the jury have before it all possible relevant information about the individual defendant whose fate it must determine.\" Jurek v. Texas, 428 U.S. 262, 276, 96 S. Ct. 2950, 2958, 49 L. Ed. 2d 929, 941 (1976). \"[A] sentencer may not be precluded from considering, and may not refuse to consider, any relevant mitigating evidence offered by the defendant as the basis for a sentence less than death.\" Penry v. Lynaugh, 492 U.S. 302, 318, 109 S. Ct. 2934, 2946, 106 L. Ed. 2d 256, 277 (1989) (citing Eddings v. Oklahoma, 455 U.S. 104, 102 S. Ct. 869, 71 L. Ed. 2d 1 (1982)). In Eddings, the Supreme Court held that defendant's death sentence had to be vacated when the trial court, in sentencing the defendant, refused to consider in mitigation evidence of his difficult family history -- including evidence that his mother was an alcoholic and his father had used excessive physical punishment -- and his resulting emotional disturbance. 455 U.S. at 113-16, 102 S. Ct. at 876-77, 71 L. Ed. 2d at 10-12.\n\nThe principle that all mitigating information is admissible does not mean, however, that a trial court must allow the jury to consider any and all information a defendant seeks to present in the form of mitigating evidence. \"Relaxed standards for admissibility are not to be equated with automatic admissibility.\" State v. Davis, 96 N.J. 611, 623 (1984). A trial court may exclude unreliable evidence proffered by the defendant in mitigation. State v. Pitts, supra, 116 N.J. at 632-34; Thompson v. Wainwright, 787 F.2d 1447, 1457-58 (11th Cir. 1986) (stating that the Constitution \"entitles a capital defendant to introduce all relevant mitigating evidence, but does not require a state to abandon its rules of evidence concerning what is competent testimony\"), cert. denied sub nom. Thompson v. Dugger, 481 U.S. 1042, 107 S. Ct. 1986, 96 L. Ed. 2d 825 (1987).\n\nN.J.S.A. 2C:11-3c(2)(b) provides in relevant part: \"The defendant may offer, without regard to the rules governing the admission of evidence at criminal trials, reliable evidence relevant to any of the mitigating factors.\" This Court has considered on several occasions the admissibility of proffered mitigation evidence under that provision. In State v. Savage, 120 N.J. 594, 637-38 (1990), the trial court excluded mitigation evidence it characterized as \"double-hearsay.\" This Court, noting that doubts concerning reliability should be resolved in favor of the defendant, stated that on retrial the evidence should be admitted if found \"to be relevant to any mitigating factor.\" Ibid. In State v. Davis, supra, 96 N.J. 611 (decided before section (c)(2)(b) was added to the statute but nonetheless foreshadowing the approach of the section), the Court found that the trial court had erred in excluding the testimony of an expert sociologist that the defendant shared certain demographic features with offenders having a low rate of recidivism. In State v. Pitts, supra, 116 N.J. at 621-35, the Court found no error in the exclusion in the guilt phase of trial of testimony based in part on an interview with defendant when he was under the influence of sodium amytal, which is not considered a reliable means of ascertaining the truth. Nevertheless, the court acknowledged that such evidence could be used in the penalty phase. In State v. Long, 119 N.J. 439, 502 (1990), the trial court ruled inadmissible letters written on the defendant's behalf. The Court stated that \"although the technical rules of evidence do not hind defendant in the penalty phase, any proofs submitted should be subject to cross-examination by the State.\" Ibid. The Court concluded that \"in light of the availability of character witnesses, thirteen of whom actually testified, the court did not err in excluding the letters.\" Ibid.\n\nThe State argues that neither the prosecutor nor the defense had the opportunity to question the methodology and analysis used by Dr. Cooke, so that the reliability of the report was never established. Under the circumstances, however, the reliability of the report could be considered validated. That the prosecutor had retained Dr. Cooke is a strong indication of the reliability of the report's findings. From defendant's point of view, Cooke was a disinterested witness. Moreover, the prosecutor found the report sufficiently reliable to use in his cross-examination of defense witnesses.\n\nIn Green v. Georgia, 442 U.S. 95, 99 S. Ct. 2150, 60 L. Ed. 2d 738 (1979), Green and his co-defendant were tried separately for rape and murder and were found guilty and sentenced to death. At his sentencing proceeding, Green sought to present the testimony of one Pasby, who had testified for the State at Green's co-defendant's trial that the co-defendant had admitted to being the one who shot the victim. The trial court excluded the evidence as hearsay. The prosecutor then argued to the jury that in the absence of direct evidence of the circumstances of the crime, it could infer that it was the defendant who had shot the victim. Id. at 96, 99 S. Ct. at 2151, 60 L. Ed. 2d at 740. The Supreme Court vacated the defendant's death sentence, finding the proffered testimony both relevant and reliable. Id. at 97, 99 S. Ct. at 2151, 60 L. Ed. 2d at 741. The Court noted as indicia of the testimony's reliability that there was ample corroborating evidence and that the co-defendant would have had no ulterior motive to make the statement. The Court noted further that the State had used the same testimony against the co-defendant at his trial: \"Perhaps most important, the State considered the testimony sufficiently reliable to use it against [the co-defendant], and to base a sentence of death upon it.\" Ibid.\n\nGreen controls this case. Cooke's psychological profile of defendant was largely corroborated by those of the defense expert witnesses. Further, Cooke would have had no ulterior motive in preparing a report favorable to defendant. And, as defendant notes, the prosecutor found the report sufficiently reliable to use in his cross-examination of defense witnesses. This case is distinguishable from State v. Long, supra, 119 N.J. 439, in which the defendant sought to introduce letters written on his behalf, because here the report to be introduced into evidence was the product of an expert witness retained by the State. \"When [the] defendant offers evidence of a mitigating factor, any doubts concerning admissibility must be resolved in favor of the defendant.\" State v. Savage, supra, 120 N.J. at 638 (citing Davis, supra, 96 N.J. at 620). Thus, as even the Court concedes, ante at (slip op. at 27), Dr. Cooke's report was indisputably relevant and probative.\n\nAugmenting the harm caused by the exclusion of Dr. Cooke's report is the trial court's additional ruling that the report could not be used by the defense to cross-examine the State's expert witnesses. The State itself used Dr. Cooke's report to cross-examine defense experts about Dr. Cooke's Conclusion that Bey did not suffer from organic brain syndrome, but the defense was denied a corresponding opportunity. Why defendant was not allowed to cross-examine the State's expert, Dr. Michals, about Dr. Cooke's Conclusion that Bey's personality development contributed to his tendency to lose control and to attack mother-figures is difficult to understand.\n\nThe majority agrees that the trial court's rulings on the use of the report could have been more evenhanded, but declines to reverse on that basis, finding that defendant's case was not disadvantaged by the error. Ante at (slip op. at 36-37). The majority explains the disparate treatment as having been based on the trial court's belief that Cooke would testify. That belief, however, does not explain why the State was allowed to use the report to support its theory of defendant's mental condition, while defendant was prevented from using it to present his view of the evidence.\n\nThe Cooke report was circulated to all experts who testified and each expert testified that he had reviewed it. The first mention of the report came during the prosecutor's cross-examination of the defense's expert witness, Dr. Kay. The prosecutor asked Kay a number of questions based on Cooke's Conclusion that tests administered to defendant did not indicate brain damage. On redirect, defense counsel explored Kay's knowledge of the other findings, but Kay did not discuss Cooke's psychological profile. On re-cross, the prosecutor again emphasized the disagreement between Kay and Cooke over whether defendant was brain-damaged. On re-redirect, defense counsel asked Kay:\n\nQ. Are you familiar with or recollect from your reading that portion of Dr. Cooke's report which he describes as his conceptualization of Mr. Bey's personality development as well as the explanation of his criminal behavior.\n\nDo you recall that that was in the the [sic] latter pages of the report?\n\nThe prosecutor then objected, but withdrew his objection when defense counsel said she intended only to have Kay silently read the relevant portion of the Cooke report and then testify about whether he agreed or disagreed with it. Defense counsel directed Kay to the last two pages of the report, and asked him whether he agreed with \"those conceptualizations by Dr. Cooke just in that portion I gave you?\" Kay responded that they seemed \"reasonable.\"\n\nDefendant's next expert witness was Dr. Young, who testified that he had reviewed Cooke's report. Young testified without objection that he agreed with Dr. Cooke to the extent that defendant might suffer from \"a disorder of personality that might have antisocial features.\" Later, however, when Young began to discuss Cooke's observation that the victim was a woman old enough to be defendant's mother and Cooke's hypothesis concerning defendant's anger and resentment toward his mother, the court sustained the prosecutor's objection.\n\nThe State's rebuttal witness, Dr. Michals, briefly referred to some findings by both Drs. Kay and Cooke that were arguably indicative of neurological impairment, but characterized those findings as \"really soft.\" On cross-examination, defense counsel asked Michals whether he had reviewed the Cooke report, to which he responded affirmatively. But the trial court prevented defense counsel from questioning Michals about the Cooke report.\n\nThere was no principled reason to allow cross-examination of Kay but not Michals with the Cooke report. Both Kay and Michals had reviewed the report, but neither had ruled on it in forming their respective diagnoses. The prosecutor cross-examined Kay with the Cooke report even though the witness had not referred to it in his direct examination. Michals, at least, had made brief reference to the Cooke report during his direct examination. Yet the trial court still did not allow defense counsel to use the report in cross-examining him.\n\nThe Cooke report certainly was relevant to defendant's case, and was sufficiently reliable. The trial court clearly erred in excluding it from evidence, and erred further in limiting its use for purposes of cross-examination.\n\nC\n\nThe Court's Conclusion that the exclusion of the report and the limitations placed on its use did not prejudice defendant is most perplexing. The majority concludes that the error was harmless because, it says, it was not clearly capable of producing an unjust result. Ante at (slip op. at 34). The standard of review is whether the error was clearly capable of affecting the sentence. State v. Bey, 112 N.J. 45, 94-95 (1988) (Bey I). The sentence of death imports an ultimate judgment of the defendant's blameworthiness. That judgment entails the most sensitive and conscientious weighing and balancing of all relevant factors that bear on whether a defendant deserves to die for the crime. To conclude that the decision that defendant deserved to die could not have been influenced and affected by considerations of the opinion of the State's own expert witness simply is not possible.\n\nIn Skipper v. South Carolina, 476 U.S. 1, 106 S. Ct. 1669, 90 L. Ed. 2d 1 (1986), the Supreme Court vacated the defendant's death sentence because the trial court erroneously had excluded the proffered testimony of his jailers that he had made \"a good adjustment\" to prison, thereby suggesting that the defendant was a good candidate for life imprisonment over the death penalty. The State argued that the testimony was merely cumulative as the defendant and his wife already had testified to his successful adjustment to prison life. The Court rejected the argument, stating that \"the testimony of more disinterested witnesses -- and in particular, of jailers who would have had no particular reason to be favorably predisposed toward one of their charges -- would quite naturally be given much greater weight by the jury.\" Id. at 8, 106 s. Ct. at 1673, 90 L. Ed. 2d at 9.\n\nIn Brennan v. State, 766 P.2d 1385, 1386-87 (Okla. Crim. App. 1988), the Oklahoma Court of Criminal Appeals held that the trial court had committed reversible error at the defendant's capital sentencing proceeding by failing to consider a report prepared by a State hospital psychiatrist that the defendant, if released, probably would not pose a continuing threat to society. The State argued that the report was cumulative as the defendant's own expert had testified along similar lines. The court rejected the argument:\n\nCharacterizing excluded mitigating evidence as cumulative and thus harmless, is implausible where the evidence the defendant was allowed to present was such that the sentencer would naturally discount it as self-serving, and the excluded evidence was from a more disinterested witness who would naturally be given greater weight. Arguably, the sentencing Judge may have perceived [the defendant's expert] as a hired gun favorably predisposed toward appellant, while Dr. Garcia, as a State employee, may have been perceived as more objective and thus more worthy of belief. We cannot confidently conclude that the improperly excluded mitigating evidence would have had no appreciable effect upon the sentencer, and therefore the sentence of death is invalid.\n\n[Id. at 1387 (citation omitted).]\n\nThe majority dismisses Dr. Cooke's testimony as cumulative evidence. Ante at (slip op. at 33). Although recognizing that the jury might have perceived Dr. Cooke as a disinterested witness, having been retained by the State, the majority rejects the implications of that perception. It concludes that Dr. Cooke's report was not the only \"'disinterested' evidence of defendant's troubled childhood\" as Dr. Michals also referred to defendant's drug problems and childhood abuse. Ante at (slip op. at 33).\n\nThe majority's dismissal misses the mark. The harm to defendant was not minimized by earlier testimony on the defendant's substance abuse and battered background. Dr. Cooke's report covered points specifically relevant to defendant's case in mitigation. He concluded that defendant's \"anxious, helpless, insecure, frightened, and depressed\" emotional state as a child \"developed into a personality disorder which also encouraged the expression of anger he felt due to the neglect and cruelty [from his mother].\" Further, Dr. Cooke, unlike the other experts, elaborated on defendant's feelings toward women:\n\nOn the one hand, he tends to idealize women, perhaps because of the fantasy of the hoped for mother he never had. On the other hand, he has both angry and derogatory feelings toward women. . . . He has a tremendous rage toward women and, and in my opinion, it is this rage that is the reason for his brutal aggression, demeaning, and sexual attacks toward his victims. The level of aggression certainly was not necessary to the purpose of the robbery. Even if he wanted to kill them to prevent them from identifying him to the police, the level of aggression and brutality was unnecessary.\n\nUnlike the generalized psychological profiles of the other defense experts Dr. Cooke's report explicitly linked defendant's abused childhood and hatred of women to the particular crime. Although the information contained in the report was not flattering, and defense counsel recognized that the report contained both \"good and bad\" information, it is directly probative of the emotional disturbance mitigating factor. Moreover, as defendant observes, Dr. Cooke's opinion refutes the prosecution's suggestion that defendant had killed the victim to prevent her from reporting him to the police.\n\nAnother indication of the harm created by keeping the favorable opinion of a disinterested witness from the jury was the prosecutor's characterization in closing argument of the defense witnesses as \"hired guns.\" The prosecutor argued during summation that Dr. Pincus had tailored his diagnosis to fit defendant's case. The prosecution's reliance on the \"hired gun\" theme underscores the importance of a disinterested witness. The jurors likely would have given greater weight to an expert procured by the State who nonetheless gave similar testimony to that of defendant's expert witnesses. Skipper, supra, 476 U.S. at 8, 106 S. Ct. at 1673, 90 L. Ed. 2d at 9; Brennan, supra, 766 P.2d at 1386-87. The potency of both the message and the messenger excluded cannot be dismissed as having had no impact on the jury's deliberations. The majority's description of the excluded report as merely cumulative evidence of defendant's background is groundless and unjustified. Defendant's right to a reliable sentencing decision was undeniably thwarted by its exclusion.\n\nNor would Patricia Bey's testimony concerning defendant's upbringing render Dr. Cooke's report cumulative given that the defense was precluded from effectively eliciting her testimony. Here too, the majority finds error in the trial court's restriction on the admissibility of relevant and reliable mitigating evidence, but concludes that defendant suffered no prejudice. Ante at (slip op. at 38). The court's refusal to permit leading questions, when the witness was having difficulty remembering events and was at times unresponsive, deprived defendant of the emotional impact of Ms. Bey's testimony.\n\nThe transcript reveals that Ms. Bey gave evasive or clipped responses to counsel's questioning and often minimized her cruel and neglectful behavior during defendant's childhood. Early in her testimony, her responses were fleshed out by leading questions. As the direct examination continued, Ms. Bey's testimony grew increasingly punctuated by silences and memory lapses. Thus, leading questions were essential to elicit detail and to stimulate the witness's memory. For example, the defense attempted to elicit details about Ms. Bey's relationship with Henry McGloun, defendant's father. Ms. Bey testified that \"It wasn't the best,\" but would not explain that answer. On another occasion, defense counsel attempted to lead the witness to elicit details about the specific beatings of defendant.\n\nConsistent with the ethos that the admission of mitigating evidence should be flexible and permissive, leading questions of Ms. Hey should have been permitted because her responses would have yielded reliable and relevant mitigating evidence. The purpose of defendant's case in mitigation in a capital sentencing hearing is to supply the jury with as complete a picture as possible of defendant so that it can make as fully informed a decision as possible. That purpose was frustrated here by restrictive rulings on the form of questions posed to an eyewitness to and participant in defendant's troubled childhood.\n\nThat defendant was prejudiced by the error, and that it was clearly capable of affecting the sentence, is plain when that error is analyzed under the proper standard of review.\n\nD\n\nThe defense presented a strong case in mitigation. In addition to family members, it presented three experts who testified at length about the difficult circumstances of defendant's childhood and his resulting mental disturbance. Yet despite all that testimony, only two jurors found mitigating factor c(5)(a) (that defendant was under the influence of extreme mental or emotional disturbance), and no jurors found mitigating factor c(5)(d) (defendant's mental disease or defect or intoxication). One or more of the jurors might have given greater weight to the mitigating evidence had they believed its source to be a clearly objective expert, an expert retained by the State. Because only one juror would have had to reach a different verdict for defendant to have been spared the death penalty, such doubts must be resolved in favor of defendant.\n\nIn evaluating whether the trial court's exclusion of the report was harmful error, the Court has lost sight of the nature of the core issue. The refusal of the trial court to permit the defense to make any evidentiary use of the Cooke report collides directly with the principle that the sentencing decision must be based on the full breadth of available information. Such is the mandate of Lockett and the cases that follow its teachings: e.g., Penry v. Lynaugh, supra, 492 U.S. 302, 109 S. Ct. 2934, 106 L. Ed. 2d 256; Hitchcock v. Dugger, 481 U.S. 393, 107 S. Ct. 1821, 95 L. Ed. 2d 347 (1987); Eddings v. Oklahoma, supra, 455 U.S. 104, 102 S. Ct. 869, 71 L. Ed. 2d 1 (ruling that a sentencer may not be precluded from considering and may not refuse to consider any relevant mitigating evidence offered by defendant as a basis for sentence less than death); Lockett v. Ohio, 438 U.S. 586, 98 S. Ct. 2954, 57 L. Ed. 2d 973 (1978) (plurality) (ruling that it is unconstitutional to prevent sentencer from considering any aspect of defendant's character and record or any circumstances of offense as an independently mitigating factor). To implement that principle the Court should avoid an entanglement with technical rules, and should not interpret and apply those rules in a way that prevents defendant from bringing to the jury's attention matters relevant to its sentencing decision. Defendant's trial counsel concisely summed up the issue:\n\nThe plain fact of the matter is, Judge, the jury is entitled to have this information. There's nothing in the statute that prevents it. It's mitigating evidence. It's something that they should know about the Defendant, both good and bad . . . .\n\nThe uneven treatment of the State and defendant deprived defendant of his constitutional rights to due process and fundamental fairness. The prejudice resulting from the improper and unfair sequence of rulings was exacerbated by the trial court's technical and strict refusal to allow defendant a reasonable opportunity to elicit from his mother, an uncooperative, if not hostile, witness, testimony bearing most directly on the critical facts that served to undergird the testimony of all expert witnesses and was the foundation of defendant's main defense. Accordingly, the court's errors warrant the vacating of defendant's death sentence.\n\nIII\n\nDefendant contends that the court permitted the introduction of evidence that supported none of the proffered aggravating factors but supported several aggravating factors that had not been charged and could not have been charged. The admission of that evidence, he continues, \"diluted the constitutionally required narrowing function of the charged aggravating factors and subjected [defendant] to cruel and unusual punishment.\" The majority agrees with defendant insofar as he claims that the evidence at issue should not have been admitted, but it then concludes that the erroneous admission of that evidence was harmless. Ante at (slip op. at 42-44). Because the evidence was extraordinarily and gratuitously graphic, its admission seriously prejudiced defendant.\n\nAt trial, the defense sought to limit the evidence that would be used by the State in support of the two proffered aggravating factors, c(4)(a) and c(4)(g). specifically, counsel sought to exclude \"lurid, graphic descriptions\" of the two murders. The trial court decided to rule on each piece as it was offered into evidence. The court then discussed the language and legislative history of N.J.S.A. 2C:11-3c(2)(f), ruling that the State could adduce more than Cheryl Alston's death certificate or \"the mere cause of her death\" in showing \"the manner and mode of death\" but could \"not introduce all the circumstances surrounding Cheryl Alston's murder.\" The court then held that the \"jury must determine anew whether the Defendant committed robbery and/or sexual assault during the course of the murder of Carol Peniston.\" Finally, the court ruled that because the judgments of conviction for sexual assault and robbery were not binding on the jury, the State could introduce evidence of defendant's commission of or attempt to commit sexual assault and/or robbery during the murder of Ms. Peniston.\n\nDr. Becker, the medical examiner, described in detail his examination of Cheryl Alston, prior to which defense counsel twice registered objections:\n\nThe face revealed multiple blunt trauma with penetrating wounds of the left eye, the nose, the left side of the face, with palpable fractures of the nasal bones.\n\nThe orbits or the bones around the eyes, the maxilla or cheek bones and the mandible or the jaw bone.\n\nThere was a large laceration of the forehead, the center of the head. Measuring six centimeters by two and a half centimeters or about two and a half by one inch and exposing the frontal bone of the skull.\n\nThe route of the nose also showed and the left eye also showed a diamond shaped penetrating . . . lacerated wound * * * with fractures at its base.\n\nThe left eye was pushed inward, out of its socket and also showed a penetrating wound with fractures around it.\n\nThe interior surface of the neck revealed horizontal abrasions and encircling the entire anterior surface and also partially in the posterior neck.\n\nThe -- there was -- there were also lesions of the chest, linear contusions of the anterior chest. One of the [sic] them measured twenty-seven centimeters two by three point four centimeters. That's about ten inches by one and a half inches; and beneath this large contusion, was another similar contusion measuring four centimeters in length and eight centimeters in width.\n\nThe abdomen contained three hundred cc's of liquid and clotted blood; and this was due to a laceration of the liver of both involving both the right and left lobes of the liver.\n\nThere was also a small amount of hemorrhage at the apex of the left ventricle, which is the major chamber of the heart, which pumps blood throughout the body.\n\nAll the lesions of the face, the lacerations and abrasions and contusions were associated with fractures of all the facial bones and those were the main findings.\n\nDr. Becker also testified that the wounds were consistent with being struck with a two-by-four, which had been found at the scene, and that Ms. Alston's body was received by the hospital nude except for a brassiere tied around the neck. Finally, he testified that the cause of death in his opinion had been \"asphyxia due to strangulation.\" In addition, he said, \"there were skull fractures with cerebral hemorrhage and laceration of the liver with hemoperitoneum or blood in the peritoneal or abdominal cavity.\"\n\nN.J.S.A. 2C:11-3c(2)(f) provides in relevant part: \"Evidence offered by the State with regard to the establishment of . . . [aggravating factor c(4)(a)] may include the identity and age of the victim, the manner of death and the relationship, if any, of the victim to the defendant.\" The Senate Judiciary Committee Statement to that provision explains that c(2)(f) seeks \"to avoid turning the sentencing proceeding into a second trial of the previous case and at the same time to provide the jury with some information about the prior conviction.\" Senate Judiciary Committee Statement to Senate Bill No. 950, at 2.\n\nIn State v. Erazo, 126 N.J. 112 (1991), defense counsel had stipulated to the penalty-phase admission of a redacted autopsy report of a prior-murder victim. The autopsy report \"described not only the multiple stab wounds as the cause of death, but also the details of each wound,\" and contained a human-body \"diagram showing the location of the wounds.\" Id. at 136. On appeal, the defendant argued that the report should not have been admitted to show the \"manner of death\" under c(2)(f), arguing that its prejudicial effect outweighed its probative value. Ibid. The Court concluded that although the admission of the stipulated report did not rise to the level of plain error, on remand the defendant would not be bound by the stipulation:\n\nWe believe that the statutory purpose can be served with less than the stipulated evidence. The prejudicial effect of a graphic and detailed account of the victim's death might exceed its probative value. On remand, the purposes of the statute will be served if the evidence of the manner of . . . death is described as multiple stab wounds to the chest, lungs, and heart.\n\n[Ibid.]\n\nUnder Erazo's reasoning, c(2)(f) would have been fulfilled had Dr. Becker merely described the manner of death as asphyxia by strangulation, and possibly cerebral hemorrhage and laceration of the liver if they were also causes of death. To the extent that death was caused partially by cerebral hemorrhage, Dr. Becker's Conclusion that the hemorrhage likely had been caused by blows inflicted by a two-by-four did not exceed the scope of c(2)(f). However, the medical examiner's graphic, detailed descriptions of Ms. Alston's wounds is the precise evil that Erazo addresses. That remains true even though Dr. Becker's description was in clinical terms, for the description in Erazo also was in the form of anatomical diagnoses. Here, Dr. Becker's testimony vividly described the wounds inflicted on Ms. Alston. The jury heard details about the length and shape of some of the victim's external wounds and that her eye had been pushed out of its socket. In effect, defendant was subjected to a second trial on the Alston murder during the sentencing phase of his trial for the Peniston murder. The defense is absolutely right when it observes that there was \"no reason to detail every injury . . . except the illegitimate reason [of] inflaming the jury.\" Inexplicably, the Court finds error in the admission of the gruesome details of the Alston murder but then finds that error to be harmless.\n\nDefendant also attacks the evidence permitted to prove the c(4)(g) aggravating factor, that defendant murdered Peniston while in the course of a sexual assault and/or robbery. In support of that factor, the State elicited testimony by Dr. Becker describing in detail the wounds inflicted on the victim. He also described the \"marked reddish black discoloration of the skin of the face with maggot infestation.\" Defendant claims that the extensive, graphic information supplied by the medical examiner was irrelevant to the c(4)(g) factor, and that the use of that testimony permitted the prosecution to usher in evidence relevant to factor c(4)(c) (encompassing murders that are \"outrageously or wantonly vile\") when the State had been barred from asserting that factor. Defendant also argues that the court erred in allowing the State to introduce various articles of Ms. Peniston's clothing recovered at the scene. He contends that the introduction of the victim's pocketbook, brassiere, slip, panty hose, dress, belt, shoes, loose dress buttons, scarf, raincoat, and raincoat belt was not relevant to the c(4)(g) factor, was unduly inflammatory, and conveyed impermissible victim-impact evidence into the jury's deliberations.\n\nIn the State's view, all of the evidence was relevant. It argues that the \"severity of the injuries and their locations indicate that some of the injuries were sustained during the course of the sexual assault and/or robbery.\" The majority rejects the State's position but then, remarkably, once again concludes that any errors committed were harmless.\n\nIn State v. Biegenwald, 106 N.J. 13 (1987) (Biegenwald II), this Court discussed evidence that could be introduced at a resentencing trial:\n\nSince the retrial is limited to resentencing, the only admissible evidence is that relevant to the issue, namely, evidence of aggravating and mitigating factors. Retrial of issues relevant only to guilt is not permitted. While defendant may lose whatever advantage inheres in the \"residual doubts\" that the original jury may have had regarding defendant's guilt, the State may also lose whatever \"advantage\" inheres in the emotional impact that often surrounds the initial guilt phase. A substantial amount of the evidence admitted initially in the guilt phase nevertheless may be admissible in the retrial of the sentencing proceeding, for often issues relevant to one are relevant to the other. In this case, the State will presumably be required to prove the circumstances of the murder, as it did in the guilt phase, in order to prove aggravating factor c(4)(c).\n\n[(Id. at 71-72) (citation omitted).]\n\nThe jury's task here was to determine whether defendant had committed a murder while in the course of a sexual assault and/or robbery. Some of the evidence introduced clearly pertained to the c(4)(g) factor: the semen-stained raincoat provided evidence of sexual assault, and the loose buttons and the dress suggest that defendant tore the dress from his victim. But, to cite one example, the doctor's statement that the victim's face had become infested with maggots was patently irrelevant and improper.\n\nThe State's vivid depictions of the two murders almost certainly were designed to \"confuse or impassion\" the jury, and plainly \"intertwined irrelevant emotional considerations with relevant evidence.\" State v. Williams, 113 N.J. 393, 447 (1988) (Williams II) (discussing victim-impact evidence); see also Pennington, supra, 119 N.J. at 606 (Handler, J., Concurring in part and Dissenting in part) (stating that trial courts must \"sanitize\" prior murder convictions used as aggravating factors); State v. Rose, 112 N.J. 454, 534-35 (1988) (Rose I) (holding that guilt-phase introduction of victim's blood-stained shirt and undershirt had \"clear capacity to inflame and prejudice the jury,\" but that admission was harmless error given compelling evidence of guilt). The majority's Conclusion that the extensively detailed evidence of the two murders and the admission of Peniston's clothing were not prejudicially erroneous is wholly unsupportable. I would reverse on the ground that the State introduced highly inflammatory evidence, the primary purpose and inevitable effect of which was to divert the jury from the issues before it and to call its attention to aggravating factors that the State was precluded from charging officially.\n\nIV\n\nThe Court believes that the trial court incorrectly instructed the jury with respect to its sentencing options for the Peniston murder, but it also concludes that arguments of counsel sufficed to make the jury aware of those options. According to the Court, the jury understood that defendant, if given a life sentence, would serve a consecutive sentence to that imposed for the Alston murder and would be ineligible for parole until he reached his late eighties. Ante at (slip op. at 45). I agree that the jury was instructed improperly, but I disagree with the Court's Conclusion that the arguments of counsel sufficed to render the error harmless.\n\nAt voir dire, the court instructed the jury that in determining the sentence for the Peniston murder, the jurors' alternatives were death or life with thirty years of parole ineligibility. The jurors were told that the sentence they imposed would be in addition to defendant's prior sentence for murder. With no intervention by the court, either the prosecutor or defense counsel further mentioned to each juror that if sentenced to life imprisonment, defendant would face a minimum of seventy years in prison for the two murders before the possibility of parole.\n\nCertain jurors during the voir dire had indicated that the additional forty-year consecutive term would influence their decisions. For instance, when juror Robert Harrington was asked if he could vote for life even if the other eleven jurors voted for death, he replied that he could, \"because the alternative is 70 years of imprisonment with no parole possible. So the punishment is severe. The record does not demonstrate, however, that all jurors were aware of that alternative sentencing possibility nor does it demonstrate that those who were aware of it understood how they could consider it.\n\nThe day before the case was submitted to the jury, defendant made a written request regarding the charge. Defendant's proposed charge would have explained that he was serving prior sentences carrying forty years of parole ineligibility, and that a life term returned in this case would be added to defendant's other sentences, \"meaning that defendant will have to spend at least 70 years in prison before he is eligible for parole.\" The court refused that request, instead telling the jury on several occasions that its alternatives were death or life with no parole for at least thirty years with respect to the murder of Carol Peniston. The verdict sheet reiterated the court's instruction.\n\nDefense counsel objected to the court's charge, arguing that the court should have instructed that a life sentence effectively would yield at least seventy years of parole ineligibility. The court overruled the objection, stating that in retrospect it believed that the possibility of an extended period of parole ineligibility should not have been conveyed to the jurors \"because [the Alston-murder case] is on appeal and always a possibility of getting reversed. So that is -- that may not be serving any time on that conviction.\"\n\nIt is axiomatic in capital-murder jurisprudence that the sentencer be fully aware and adequately instructed with respect to sentencing options. See Beck v. Alabama, 447 U.S. 625, 100 S. Ct. 2382, 65 L. Ed. 2d 392 (1980). Reliability demands that a jury not be misled about the law. See California v. Ramos, 463 U.S. 992, 103 S. Ct. 3446, 77 L. Ed. 2d 1171 (1983); Stewart v. Dugger, 847 F.2d 1486, 1491 (11th Cir. 1988), vacated on other grounds, 877 F.2d 851 (11th Cir. 1989), cert. denied, 495 U.S. 962, 110 S. Ct. 2575, 109 L. Ed. 2d 757 (1990). This Court discussed the effect of misleading the jury about its sentencing options in the context of a coerced verdict in State v. Ramseur, 106 N.J. 123, 304-15 (1987). The Court stated: \"To hide from the jury the full range of sentencing options, thus permitting its decision to be based on uninformed and possibly inaccurate speculation, is to mock the goals of rationality and consistency required by modern death penalty jurisprudence.\" Id. at 311; see also Bey II, supra, 112 N.J. at 180 (holding that \"the court must inform the jury of its option of returning a final, non-unanimous verdict\"). Here, the jury may have heard that a life sentence returned for the Peniston murder would carry at least thirty years of parole ineligibility, but the court left the jury \"uninformed\" with respect the ultimate sentence defendant would receive if a life verdict were returned. The court did so because it believed that had the jury had been so instructed, it would have been misled.\n\nThe Court properly rejects the trial court's rationale for not giving the requested instruction and finds error in the trial court's ruling, but the Court then goes on to state that the error was harmless in light of information presented to the jury by counsel. Until today, we have never said that arguments by counsel can substitute for proper instructions. Lawyers' arguments are precisely that: arguments. Jurors are free to accept or reject arguments as they wish. By contrast, a court's instructions are authoritative. Because of the inherent difference in the roles played by lawyers and Judges, \"arguments by counsel cannot substitute for instructions by the court.\" Taylor v. Kentucky, supra, 436 U.S. at 488, 98 S. Ct. at 1936, 56 L. Ed. 2d at 477. As Justice Francis noted in State v. Butler, supra, 27 N.J. at 595, \"The criminal law cannot be administered justly or efficiently if the jury is allowed to speculate as to what conduct the law intended to proscribe by a specified crime.\" I continue to abide by the rule reflected in all of our previous cases: the \"faithful performance of the court's duty of expounding the law for the jury's guidance and instruction requires a plain and clear exposition of the issues.\" State v. Green, supra, 86 N.J. at 288; see Bey II, supra 112 N.J. at 169-70.\n\nThe trial court's failure to instruct the jury properly was especially prejudicial because it deprived defendant of the opportunity to present mitigating evidence. As I have noted, a defendant cannot be precluded from presenting any evidence that could be regarded as mitigating evidence. Supra at (slip op. at 30). The requested instruction should be construed as mitigating evidence because an assurance that defendant would die in prison if sentenced to life would weigh against the jury's sentencing defendant to death. That arguably would be relevant to defendant's \"record\" or \"background\" pursuant to mitigating factor c(5)(h). See Hunt v. State, 583 A.2d 218, 226 (Md. 1990) (holding that a capital defendant \"may offer any relevant and competent information that would aid the jury in assessing the legal and practical effect of a sentence less than death\" and noting that \"a separate sentence for another crime might have a mitigating effect on the jury\"), cert. denied, U.S. 112 S. Ct. 117, 116 L. Ed. 2d 86 (1991); cf. Davis v. State, 512 So. 2d 1291, 1293 (Miss. 1987) (holding that was defendant entitled to introduce evidence of defendant's previous sentence for assault to establish that punishment would be severe even without a death sentence), cert. denied, 485 U.S. 913, 100 S. Ct. 1088, 99 L. Ed. 2d 247 (1988); State v. Henderson, 789 P.2d 603, 607 (N.M. 1990) (observing that jury would \"have been more likely to impose a life sentence instead of a death sentence\" had it known that defendant would not be eligible for parole for fifty-six years). We have recognized that the duration of a prison term that a defendant must serve and its likely effect on him or her is relevant as mitigation evidence and should not be withheld from the jury when it decides whether to impose the death sentence. E.g., State v. Davis, supra, 96 N.J. at 617 (holding that evidence that defendant would be fifty-five years of age if sentenced to life without possibility of parole for thirty years and expert opinion that persons are not likely to commit murder at age fifty-five were proper mitigating evidence).\n\nMoreover, defendant sought to use the evidence for purposes very different from those proposed by the defense in Biegenwald IV, in which the trial court barred defendant from using his other less-than-death sentences for murder to show that other juries had been given the opportunity to impose the death penalty but had not imposed it. 126 N.J. 1, 49. Here defendant sought the instruction on parole ineligibility not to show that another jury had found him worthy of living but to show solely that effectively he would have little or no prospect of coming out of prison in his lifetime if the jury returned a life verdict.\n\nThis Court has \"'declined to prescribe specific language to guide the jury's consideration of mitigating factors.'\" State v. Marshall, supra, 123 N.J. at 141 (quoting Bey II, supra, 112 N.J. at 168). \"'The Constitution does not require specific and detailed instructions . . . with respect to mitigating and aggravating circumstances, so long as there is no reasonable possibility that the jury misunderstands its role in the capital sentencing procedure or misunderstands the meaning and function of mitigating circumstances.'\" Id. at 141-42 (quoting Bey II, supra, 112 N.J. at 169). Admittedly, in this case the jury was told of defendant's prior-murder sentence. Nevertheless, the jurors may not have understood the significance of that sentence. They did not have clear authoritative guidance from the trial court on the proper use of that information. The court's instructions to the jury on the potential sentences facing defendant were exceptionally confusing, if not plainly misleading.\n\nEven had the trial court's instructions themselves been adequate, the trial court's failure to respond to the jury's question on parole eligibility was itself reversible error. The court deprived defendant of a substantial opportunity to receive a non-unanimous life sentence and coerced the jurors' eventual death verdict. However, the majority concludes that given the circumstances the trial court's failure to respond to the question was not unreasonable and that the court's silence neither coerced a verdict nor failed to recognize a jury deadlock. Ante at (slip op. at 58). I believe the majority seriously misconstrues the procedural significance of the trial court's dereliction.\n\nThe jury was sent to deliberate at 12:15 p.m. on September 11, 1990. At 2:37 p.m., the jury sent the trial court a note asking the following question: \"Is Mr. Bey ever elligible [sic] for Parole in the next 70 years?\" Apparently, some time elapsed (how much is not clear) before the court met with counsel to discuss the question. Defense counsel argued that the jury should be informed that defendant would not be eligible for parole for seventy years. The court responded that that would not necessarily be accurate, as defendant's conviction for the Alston murder was still on appeal. During that colloquy (spanning three-and-a-half pages), the court officer informed the trial court that the jury \"has a verdict and they don't need an answer.\" The jury was brought into the courtroom, and the court had the following colloquy with the jury foreperson:\n\nTHE COURT: Mr. Harrington, you submitted a question for me to answer.\n\n\"Is Mr. Bey ever eligible for parole in the next seventy years.\"\n\nThat was the question, correct?\n\nTHE FOREMAN: Yes, sir.\n\nTHE COURT: And before I answered your question, you advised the Court that you had a verdict and you didn't want this question answered, is that correct?\n\nTHE FOREMAN: That's correct.\n\nTHE COURT: Very well.\n\nThe foreperson then announced the jury's verdict.\n\nFollowing the verdict, the following colloquy ensued between the court and defense counsel:\n\nMR. McCAULEY: The record should reflect that the jury initially knocked indicating they had a question around two o'clock. The Court did not come on the bench until three thirty. They sat there for an hour and a half, essentially ignored. The question was never answered.\n\nThe question had to do with whether he was going to have a seventy year period of parole ineligibility.\n\nI think that was significant question [sic]. I think that's a significant factor and in their deliberations as to what an appropriate penalty is.\n\nTo let them sit in there for an hour and a half --\n\nTHE COURT: Just a minute. 2:37.\n\nMR. McCAULEY: Then my watch was off. An hour.\n\nTHE COURT: Less than an hour.\n\nLess than an hour because between then and my coming on the bench, I also got a message from the Court Officer that they had a verdict depending upon -- they had a verdict.\n\nMR. McCAULEY: Well, fifty-six minutes, close to an hour, is what I'm saying and I think that's significant. That that question was not answered.\n\nThus slightly less than an hour elapsed between the time the jury asked the question and the time it delivered its verdict. The trial court itself apparently believed that the jury's verdict depended on its answer to the question.\n\nIn Whitfield v. State, 143 Ga. App. 189 (Ga. App. Ct. 1977), the jury sent the trial court a question \"on an issue of law\" at about 2:05 p.m. The court told the bailiff to inform the jury that he was conducting voir dire in another trial but would answer the question when it reached a suitable breaking point. The jury returned a verdict at 2:30 p.m. At no time did the Judge provide the jury with additional instructions. Id. at 190. The court of appeals held that the trial court had committed reversible error: \"When the jury requests the court to recharge them on any point, it is the court's duty to do so.\" Ibid. That \"the Judge intended to recharge as soon as he could\" did not change the fact that \"the jury returned a verdict presumably based upon an incomplete understanding of the relevant law.\" Ibid.\n\nIn the case before us, the fact that the question was asked clearly indicates that jurors were confused, and that they may have weighed aggravating and mitigating factors differently based on whether defendant would be eligible for parole after thirty or seventy years. The trial court's failure to instruct the jury on when defendant would be eligible for parole was reversible error, but its failure to respond to the jury's question was entirely inexcusable.\n\nI recognize that several courts have reached Conclusions opposite to the one I advocate. E.g., United States v. Barnes, 586 F.2d 1052 (5th Cir. 1978); Ebens v. State, 518 So. 2d 1264 (Ala. Crim. App. 1986); People v. Sims, 519 N.E.2d 921 (Ill App. Ct. 1987), appeal denied, 522 N.E.2d 1253, cert. denied, 488 U.S. 844, 109 S. Ct. 118, 102 L. Ed. 2d 92 (1988); People v. Chandler, 487 N.Y.S.2d 887 (App. Div. 1985). The most significant distinction between this case and those cases is that this case is capital. Thus, jury confusion here over the precise consequences of its deliberations is more than merely \"disturbing,\" Chandler, supra, 487 N.Y.S.2d at 889; it is potentially fatal.\n\nI conclude that, regardless of the jury's overall impressions with respect to alternative sentencing consequences, it did not have a clear authoritative instruction from the trial court. We therefore cannot speculate on whether the jury had a correct understanding of the relevant considerations. Those considerations bear vitally and directly on the ultimate sentencing judgment: does defendant deserve to die. We cannot be sure that the jury would have responded with the death sentence had it been instructed accurately and correctly by the court.\n\nV\n\nThe Court has once again found a way to sustain a sentence of death. It must dismay even the staunchest friends of capital punishment to witness the maze of reasoning followed by the Court to reach that result. The Court, understandably shocked by the brutality of the killing, abandons objectivity and principle to sanction defendant's death sentence. The Court has subtly, but unmistakably, come to act like a super-jury. In confirming this death sentence, it has arrogated to itself the right to express the conscience of the community. Thus, it concludes that the jury necessarily would have determined that defendant intended to kill his victim, even though the jury was not properly charged.\n\nThe Conclusion that the jury's verdict can equate only with finding an intent to kill is indistinguishable from the Court's own judgment that defendant intended to kill. Moreover, despite the Court's own premonitions and admonitions uttered in other cases concerning the need for balance and fairness in the presentation of evidence, the Court disregards the excessively inflammatory nature of the gory evidence relating to defendant's two murders. Additionally, the Court passes off the patent unfairness to the defense occasioned by the trial court's refusal to allow it a fair opportunity to elicit critical evidence from defendant's own mother. That evidence was the basis for the opinions of all the experts concerning defendant's mental and emotional condition, the core of his defense. The Court finds nothing harmful in the refusal to allow defendant effective use of the State's own expert witness's report in mitigation -- a report that was vouched for by the State and validated through the prosecutor's own use of it on cross-examination. Finally, despite repeated warnings that juries must be fully and adequately informed on all factors relevant to sentencing, the Court does not find anything harmful in the lower court's failure to inform the jury that defendant likely would spend the next seventy years of his life in prison were he not sentenced to death.\n\nI have too often been required to state that the tensions inherent in capital-murder prosecutions -- borne of dual constitutional mandates that juries and prosecutors be objectively and firmly guided in the exercise of their discretion and that capital defendants be sentenced fairly in light of the individual characteristics their cases present -- give rise to unpredictable and irreconcilable inconsistencies. This case typifies those manifold inconsistencies. It confirms the insoluble dilemmas posed by capital-murder cases and the inevitable arbitrariness of their end results. The experience here confirms that those failings cannot be palliated by judicial supervision or overcome by appellate review.\n\nJustice O'Hern concurs in Point II of this opinion.\n\nO'HERN, J., Dissenting.\n\nAs the Court explained in State v. Gerald, 113 N.J. 40 (1988), when the death penalty was superimposed on the Code of Criminal Justice in 1982, no specific reference was made to which of the two forms of murder embraced by N.J.S.A. 2C:11-3 would be death eligible. However, the legislative history of the Act and constitutional concerns convinced the Court that only an intentional killing was death eligible. As the sponsor of the bill stated, \"using the familiar forms known to common-law lawyers in New Jersey, a defendant faces death-penalty proceedings only after he has been 'found guilty unanimously and beyond a reasonable doubt of first degree murder, willful, premeditated murder.'\" State v. Dixon, 125 N.J. 223, 252 (1991) (quoting Capital Punishment Act: Hearings on S. 112 Before the Senate Judiciary Committee at 1 (1982)). Hence, in Gerald we ruled that in a capital trial the jury must determine whether the defendant had knowingly or purposely caused death (capital/first-degree murder). 113 N.J. at 69-70. If required by the evidence, the jury must consider, in the alternative, whether the defendant purposely or knowingly caused death or purposely or knowingly caused serious bodily injury resulting in death (SBI/second-degree murder). (To understand the issues more easily, I continue to use the pre-Code references, as explained in the Court's opinion in Dixon, supra, 125 N.J. at 251-52.) Only the former type of murder will render the defendant death eligible. Id. at 69. The difficulty that has arisen with our application of the Gerald doctrine stems from the confusion between the questions of apparent guilt and how guilt is to be decided.\n\nAt the time of this trial in 1984, the Judge's bench manual for capital cases did not distinguish between the two forms of murder in determining death eligibility, as it now does. Hence, the court did not explain to the jury that the indictment embraced two forms of murder, one capital and the other non-capital.\n\nThat portions of the charge in this case were framed only in terms of whether defendant had knowingly or purposely killed (capital/first-degree murder) without mention of intent to inflict serious bodily injury (SBI/second-degree murder) is correct. For example, the court told the jury:\n\nThe essential determination for you to make in regard to the charge of murder in this case is whether Marko Bey committed the killing purposely or knowingly as I have defined these terms to you. In order for you to find Marko Bey guilty of murder the State must establish beyond a reasonable doubt one: That the killing of Carol Peniston was committed by Marko Bey and, two, that it was done purposely or knowingly as I have defined those terms for you.\n\nIn addition, the jury verdict sheet was framed in terms of knowing or purposeful murder, with no mention of serious-bodily-injury murder:\n\nQuestion 1. How do you find as to the charge that on April 26, 1983 Marko Bey committed murder by knowingly or purposely causing the death of Carol Peniston by his own conduct?\n\nHowever, at the outset of its charge the court told the jury:\n\nIn the First Count of the indictment the defendant is charged with murder. And the pertinent part of the First Count in the indictment reads as follows: That Marko Bey, on the 26th day of April, 1983 in the City of Asbury Park did commit the crime of murder in that the said Marko Bey did purposely or knowingly cause the death of or serious bodily injury resulting in the death of Carol Peniston in that the said Marko Bey committed the homicidal act of his own conduct.\n\nMurder is the unlawful killing of one person by another purposely or knowingly. A person who commits a killing does so purposely when it is his conscious object to cause death or serious bodily injury resulting in death. A person who commits a killing does so knowingly when he is aware that what he is doing will cause death or serious bodily injury resulting in death. In either case, that is, whether the killing is committed purposely or knowingly, causing the death or serious bodily injury, it must be within the design or contemplation of the defendant.\n\n[Emphasis added.]\n\nThe court proceeded to define \"serious bodily injury,\" specifically relating the definition to the killing of Carol Peniston:\n\nSerious bodily injury means bodily injury which creates serious risk of death. You will note that I have used the words purposely and knowingly. The nature of the purpose or knowledge with which the defendant Marko Bey acted toward decedent, Carol Peniston, is a question of fact for you, the jury, to decide. Purpose and knowledge are conditions of the mind which cannot be seen and can only be determined from inferences from conduct, words or acts. It is not necessary for the State to produce a witness or witnesses who could testify that the defendant stated, for example, that his purpose was to cause the death or serious bodily injury resulting in death, or that he knew that what he was doing would kill Carol Peniston or was practically certain to cause her death or serious bodily injury resulting in death.\n\n[Emphasis added.]\n\nThere is no way to determine if the jury, having heard several times that the definition of murder includes the knowing or purposeful infliction of serious bodily injury that results in death, understood that to be the definition of capital murder or whether its deliberations were limited to the correct portion of the charge. In addition, even if the Court were to conclude that those conflicting instructions adequately conveyed to the jury the requirement that it convict defendant of first-degree/capital murder, he was entitled to have the jury instructed on the lesser-included offense of SBI murder. This Court has consistently held that a defendant is entitled to a lesser-included offense charge if there is any evidence on which the jury could rationally base a conviction of the lesser-included offense. In State v. Ramseur, the Court stated that a trial court should charge the jury regarding \"'all of the possible offenses that might reasonably be found from the facts.'\" 106 N.J. 123, 271 n.62 (1987) (quoting State v. Choice, 99 N.J. 295, 299 (1985)).\n\nThe State contends that the arguments of both counsel were framed only in terms of whether defendant had knowingly or purposely killed. The State's theory was that defendant killed the victim so that she would be unable to identify him. The defense, however, stressed that defendant had consumed large quantities of alcohol and drugs and that the killing occurred without design during the course of a robbery and sexual assault. Although defense counsel argued that the killing was a felony murder or some lesser homicide offense, her theory was consistent with SBI murder. In any event, regardless of how counsel framed the argument, the jury could have followed the court's instructions that entitled it to convict defendant of murder under the indictment if defendant's purpose was, as stated by the court, to \"cause death or serious bodily injury resulting in death.\"\n\nThe State emphasizes that there was more than enough evidence to convict defendant of knowing or purposeful murder. It argues that a review of the record undoubtedly shows that defendant intended to kill Carol Peniston. He took her to a secluded shack where he forced her to undress before he sexually assaulted her. Then he stomped on her chest, breaking four of her ribs and damaging her heart. Also, defendant broke the dental plate in his victim's lower gum. Finally, he used Ms. Peniston's scarf or belt to strangle her from behind. Thus, the State contends that no jury would have rationally concluded that defendant's actions were intended only to cause serious bodily injury. The problem with that argument is that it presupposes that we, as appellate Judges, should decide the guilt or innocence of capital defendants. However, under our system of low, a jury must decide the difference between the two forms of murder and whether the defendant intended only to cause serious bodily harm.\n\nIn this case, that there was more than enough evidence to submit the SBI charge to the jury is regrettably self-evident. According to the testimony of Investigator Phillip George of the Monmouth County Prosecutor's Office, after his arrest defendant told him:\n\nI robbed the lady, I just bugged out, she saw my face, I saw her, got out of the car on Sewall Avenue, just walked around, found someplace where it was dark, going through her pocketbook. There was a light and I just bugged out. Somewhere across the tracks just past Asbury Avenue, by a building, side of the building, inside the building I just bugged out, going through her purse, went into her coat pocket, I turned around and she was looking at me.\n\nIn his written confession, read to the jury during the guilt phase, defendant stated:\n\nI went in and I started going through her pocketbook. Then there was one more wallet that I didn't look at. I picked it up and checked around and I was turned around and she was looking at me. I got scared and I started hitting her. She fell down. She wasn't moving or making any sound or anything. I had sex with her and left.\n\nIn his confession defendant stated further that he hit the victim \"four, five, or six times. I don't know,\" and that he did not use anything but his hands to strike her. Defendant gave a similar account during his direct testimony:\n\nGoing through her pocketbook, she was standing by the door, her back was facing the door and I had bent down, I was going through her pocketbook. When I looked up towards the door she was looking at me and I got scared and I started hitting her and I had sex with her and then I struggled with her, I grabbed her pocketbook and left the building * * * .\n\nOn cross-examination, defendant denied that he had killed the victim to prevent her from identifying him:\n\nQ. Isn't it a fact, Mr. Bey, that you killed that woman because she had seen your face and you didn't want to be identified, isn't that a fact?\n\nA. No, when she seen my face, that's when I started hitting her, okay? Now, after I started hitting her, it just went on too far, something that shouldn't have went on.\n\nAdmittedly there is evidence in defendant's cross-examination testimony that he used the belt to strangle Ms. Peniston:\n\nQ. You recall the belt, don't you?\n\nA. Yes.\n\nQ. The belt you used to strangle Mrs. Peniston?\n\nA. Yes.\n\nIn sum, defendant's statements both admit and deny an intent to kill. Thus, whether defendant committed capital/first-degree murder or SBI/second-degree murder was for the jury to decide.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe majority emphasizes that strangulation can be meant only to kill, not to inflict serious bodily injury. Ante at (slip op. at 17-18). Yet, in other strangulation cases the Court has held that defendants were entitled to the Gerald analysis. See State v. Perry, 124 N.J. 128 (1991); State v. Davis, 116 N.J. 341 (1989).\n\nThat there was a rational basis to submit the SBI murder charge here is almost conclusively established by the fact that the court submitted the offenses of aggravated manslaughter and reckless manslaughter to the jury. By definition, the jury could not be charged with those homicide offenses if there had not been evidence from which the jury could have concluded that the defendant did not intend to kill. Because the evidence presented the jury with at least two plausible bases for a murder conviction, the intentional infliction of serious bodily injury resulting in death (SBI/second-degree) or the intentional killing by strangulation (capital/first-degree), the court did not charge on an essential element of capital murder when it failed to inform the jury that only the latter form of murder was death eligible. When a jury verdict can rest on one of two available bases, no court can presume which basis it is. Bollenbach v. United States, 326 U.S. 607, 613-14, 66 S. Ct. 402, 405-06, 90 L. Ed. 350, 354-55 (1946). In this case, the error could not be considered harmless because there was evidence that would have sustained an SBI/second-degree murder verdict. See Vujosevic v. Rafferty, 844 F.2d 1023, 1027 (3d Cir. 1988) (failure to instruct jury on aggravated assault when there was evidence to support such an instruction and the instruction was requested was not harmless error).\n\nII\n\nThe majority does not disagree that the charge did not adequately relate to the jury the difference between capital/first-degree and SBI/second-degree murder. Rather, it reasons that the error is harmless in the circumstances of this case. Ante at (slip op. at 20).\n\nWe may not wish to see a second retrial of this case, but there may be no other way if the sentence of death is to be carried out. Despite much recent debate about the harmless-error doctrine, see Rose v. Clark, 478 U.S. 570, 106 S. Ct. 3101, 92 L. Ed. 2d 460 (1986); Pope v. Illinois, 481 U.S. 497, 107 S. Ct. 1918, 95 L. Ed. 2d 439 (1987), the Supreme Court has not held that a jury charge that fails to require that the jury find an essential element of an offense is harmless. In Pope v. Illinois, five members of the Court suggested that cases prior to Rose, which \"indicate that a conviction can never stand if the instructions provided the jury do not require it to find each element of the crime under the proper standard of proof,\" e.g., Cabana v. Bullock, 474 U.S. 376, 384, 106 S. Ct. 689, 696, 88 L. Ed. 2d 704, 715 (1986), are no longer good authority after Rose. 481 U.S. at 503 n.7, 107 S. Ct. at 1922 n.7, 95 L. Ed. 2d at 447 n.7. Justice Scalia's Concurring opinion in Carella v. California, 491 U.S. 263, 109 S. Ct. 2419, 105 L. Ed. 2d 218 (1989), reflects at least a partial vitality for Cabana v. Bullock, supra, 474 U.S. 376, 106 S. Ct. 689, 88 L. Ed. 2d 704. In Carella, the Court reversed an auto-theft conviction because a mandatory conclusive presumption was incorrectly charged to the jury. Id. at 265-66, 109 S. Ct. at 2420, 105 L. Ed. 2d at 222. The Court would have permitted harmless-error analysis in assessing the effect of a mandatory conclusive presumption. Id. at 266-67, 109 S. Ct. at 2421, 105 L. Ed. 2d at 222-23. Justice Scalia expressed his discontent with the majority's assessment of the harmless-error doctrine in relation to a mandatory conclusive presumption, stating:\n\nThe constitutional right to a jury trial embodies \"a profound judgment about the way in which law should be enforced and Justice administered.\" Duncan v Louisiana, 391 U.S. 145, 155, 20 L Ed 491, 80 S Ct 1444, 45 Ohio Ops 2d 198 (1968). It is a structural guarantee that \"reflects a fundamental decision about the exercise of official power--a reluctance to entrust plenary powers over the life and liberty of the citizen to one Judge or to a group of Judges.\" Id., at 156, 20 L Ed 2d 491, 88 S Ct 1444, 45 Ohio Ops 2d 198. A defendant may assuredly insist upon observance of this guarantee even when the evidence against him is so overwhelming as to establish guilt beyond a reasonable doubt. That is why the Court has found it constitutionally impermissible for a Judge to direct a verdict for the State. See United States v Martin Linen Supply Co., 430 U.S. 564, 572-573, 51 L Ed 2d 642, 97 S Ct 1349 (1977). That is also why in Carpenters v United States, 330 U.S. 395, 91 L Ed 973, 67 S Ct 775 (1947), the Court did not treat as harmless a jury instruction that mistakenly did not require express authorization or ratification to hold a union criminally liable for its officers' participation in an antitrust conspiracy--regardless of how overwhelming the evidence that authorization or ratification in fact existed. We said:\n\n\"No matter how strong the evidence any be of an association's or organization's participation through its agents in the conspiracy, there must be a charge to the jury setting out correctly the limited liability under (the Norris-LaGuardia Act, 47 Stat 70,] of such association or organization for acts of its agents. For a Judge may not direct a verdict of guilty no matter how conclusive the evidence. There is no way of knowing here whether the jury's verdict was based on facts within the condemned instructions . . . or on actual authorization or ratification of such acts . . . .\" Id., at 408-409, 91 L Ed 973, 67 S Ct 775 (footnotes omitted).\n\nIn other words, \"the question is not whether guilt may be spelt out of a record, but whether guilt has been found by a jury according to the procedure and standards appropriate for criminal trials.\" Bollenbach v. United States, 326 U.S. 607, 614, 90 L Ed 350, 66 S Ct 402 (1946). \"Findings made by a Judge cannot cure deficiencies in the jury's findings as to the guilt or innocence of a defendant resulting from the court's failure to instruct it to find an element of the crime.\" Cabana v Bullock, 474 U.S. 376, 384-385, 88 L Ed 2d 704, 106 S Ct 689 (1986).\n\nId. at 268-69, 109 S. Ct. at 2421-22, 105 L. Ed. 2d at 223-24 (Scalia, J., Concurring).]\n\nIn a recent analysis of the Supreme Court's harmless-error doctrine with respect to jury instructions, Chief Justice Rehnquist wrote:\n\nOur cases, understandably, do not provide a single standard for determining whether various claimed errors in instructing a jury require reversal of a conviction. In some instances, to be sure, we have held that when a case is submitted to the jury on alternative theories the unconstitutionality of any of the theories requires that the conviction be set aside. See, e.g., Stromberg v. California, 283 U.S. 359 [75 L Ed 1117, 51 S Ct 532, 73 ALR 1484] (1931).\" Leary v United States, 395 U.S. 6, 31-32, 23 L Ed 2d 57, 89 S Ct 31-32 (1969); see also Bachellar v Maryland, 397 U.S. 564, 571, 25 L Ed 2d 570, 90 S Ct 1312 (1970). In those cases, a jury is clearly instructed by the court that it may convict a defendant on an impermissible legal theory, as well as on a proper theory or theories. Although it is possible that the guilty verdict may have had a proper basis, \"it is equally likely that the verdict . . . rested on an unconstitutional ground,\" Bachellar, supra, at 571, 25 L Ed 2d 570, 90 S Ct 1312, and we have declined to choose between two such likely possibilities.\n\n[Boyde v. California, 494 U.S. 370, 379-80, 110 S. Ct. 1190, 1197-98, 108 L. Ed. 2d 316, 328-29 (1990).]\n\nIn Boyde, the Court reviewed an instruction in the death-sentencing phase of a capital trial that was \"not concededly erroneous, nor found so by a court, as was the case in Stromberg v. California, 283 U.S. 359, 51 S. Ct. 532, 75 L. Ed. 1117 (1931),\" and thus reasoned that the proper inquiry was whether there was a \"reasonable likelihood\" that the jurors would have been misled by the instruction. Id. at 380, 110 S. Ct. at 1198, 108 L. Ed. 2d at 329. The corollary of that Conclusion is that if there is a \"reasonable likelihood\" that jurors may be misled by a charge, harmless-error analysis may not be invoked.\n\nThat this \"concededly-erroneous\" instruction with respect to an essential element of capital murder can be preserved under the Supreme Court's harmless-error doctrine is unlikely. I therefore Dissent from the Court's Disposition of the Gerald issue.\n\nJustice Handler concurs in Part I of this opinion.\n\n\u003cspan class=\"fn\"\u003e1. The American Psychiatric Association defines organic personality syndrome as follows: The essential feature of this syndrome is a persistent personality disturbance * * * that is due to a specific organic factor. Affective instability, recurrent outbursts of aggression or rage, markedly impaired social judgment, marked apathy and indifference, or suspiciousness or paranoid ideation are common. The person may be belligerent or have temper outbursts that are grossly out of proportion to any precipitating psychosocial stressors. [American Psychiatric Ass'n, Diagnostic and Statistical Manual of Mental Disorders (DSM-III-R) 114 (3d ed. revised 1987).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The American Psychiatric Association defines anti-social personality disorder as follows: The essential feature of this disorder is a pattern of irresponsible and antisocial behavior beginning in childhood or early adolescence and continuing into adulthood. * * * Lying, stealing, truancy, vandalism, initiating fights, running away from home, and physical cruelty are typical childhood signs. * * * These people fail to conform to social norms and repeatedly perform antisocial acts * * * . People with Antisocial Personality Disorder tend to be irritable and aggressive and to get repeatedly into physical fights and assaults * * * . Finally, they generally have no remorse about the effects of their behavior on others; they may even feel justified in having hurt or mistreated others. [DSM-III-R, supra, at 342.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Harrington: 8/27/90 T 104-15 to 25; Olski: 8/21/90 T 55-10 to 17; Grubb: 8/22/90 T 173-5 to 20; Papierman: 8/23/90 T 157-13 to 24; Jones: 8/21/90 T 178-5 to 15; Leonard: 8/21/90 T 197-12 to 22; Boileau: 8/22/90 T 25-13 to 24; Luisi: 8/23/90 T 99-5 to 16; Duyckinck: 8/27/90 T 42-11 to 25; Glickman: 8/22/90 T 95-18 to 96-4; Hoffman 8/22/90 T 113-15 to 114-1; Schuppenhauer: 8/28/90 T 36-14 to 24. (Citations refer to the transcripts of the voir dire by date.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Olski: 8/21/90 T 56-12 to 19; Papierman: 8/23/90 T 160-16 to 25; Jones: 8/21/90 T 186-5 to 22; Leonard: 8/21/90 T 199-18 to 24; Boileau: 8/22/90 T 28-6 to 14; Duyckinck: 8/27/90 T 44-12 to 19; Hoffman 8/22/90 T 117-11 to 18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Harrington: 8/27/90 T 116-18 to 117-1; Luisi: 8/23/90 T 104-5 to 20; Schuppenhauer: 8/28/90 T 40-6 to 16.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Examples of cases in which no rational basis exists for second-degree murder are set forth in a footnote to Justice Powell's Dissenting opinion in Connecticut v. Johnson, 460 U.S. 73, 99 n.7, 103 S. Ct. 969, 983 n.7, 74 L. Ed. 2d 823, 842 n.7 (1983). There the Court pointed to the following cases: White v. State, 415 So. 2d 719, 720 (Fla.) (motorcycle-gang members stabbed woman fourteen times and slit her throat twice), cert. denied, 459 U.S. 1055, 103 S. Ct. 474, 74 L. Ed. 2d 622 (1982); Arango v. State, 411 So. 2d 172, 175 (Fla.) (defendant beat victim with a blunt instrument, wrapped an electric cord around his neck, stuffed a towel into his mouth, and shot him twice in the head), cert. denied, 457 U.S. 1140, 102 S. Ct. 2973, 73 L. Ed. 2d 1360 (1982); State v. Mercer, 618 S.W.2d 1, 4 (Mo.) (defendant strangled rape victim until his companion could no longer detect a pulse), cert. denied, 454 U.S. 933, 102 S. Ct. 432, 70 L. Ed. 2d 240 (1981). Justice Powell explained: \"There was no concession of intent to kill in any of these cases. Yet intent in each is clear beyond a reasonable doubt.\" Connecticut v. Johnson, supra, 460 U.S. at 99 n.7, 103 S. Ct. at 983 n.7, 74 L. Ed. 2d at 842 n.7.\u003c/span\u003e\n\n",
    "body_length": 219700,
    "citedas": [
      "610 A.2d 814",
      "129 N.J. 557"
    ],
    "attorneys": "James H. Smith, Jr., Deputy Public Defender, and Claudia Van Wyk, Deputy Public Defender II, argued the cause for appellant (Wilfredo Caraballo, Public Defender, attorney; Mr. Smith, Ms. Van Wyk, and Matthew Astore, Deputy Public Defender II, on the briefs). Mark P. Stalford, Assistant Prosecutor, argued the cause for respondent (John Kaye, Monmouth County Prosecutor, attorney). Catherine A. Foddai, Deputy Attorney General, argued the cause for amicus curiae, Attorney General of New Jersey (Robert J. Del Tufo, Attorney General, attorney).",
    "category": [
      "243",
      "36",
      "78",
      "75"
    ],
    "judges": "Stein, Wilentz, Clifford, Pollock, Garibaldi, Handler, O'Hern",
    "citation_count": 62
  }
}
