{
  "id": "rs1dYWYBTlTomsSB9lZB",
  "document": {
    "title": "Tucker v. Brown",
    "full_title": "WILMON TUCKER, AS ADMINISTRATOR AND v. SADIE R. BROWN ET AL. GUARANTY TRUST COMPANY, INDIVIDUALLY AND AS ADMINISTRATOR .; IN THE MATTER OF THE ESTATE OF REESE B. BROWN, DECEASED.; GUARANTY TRUST COMPANY, INDIVIDUALLY AND AS ADMINISTRATOR V. SADIE R. BROWN ET AL. WILMON TUCKER, AS ADMINISTRATOR",
    "jurisdiction": "Washington Supreme Court",
    "date": "1944-06-08T00:00:00.000Z",
    "docket": "No. 29087",
    "body": "SIMPSON, C. J. -- This case involves an accounting of funds and property belonging to the estate of Sarah E. Smith, deceased, which have been in the possession of the estate of Reese B. Brown, deceased. Three cases involving the estate have been consolidated, and are before us for review:\n\n(1) A suit in equity instituted October 23, 1934, by Wilmon Tucker, as administrator with the will annexed of the estate of Sarah E. Smith, against Sadie R. Brown, widow of Reese B. Brown, her son, Fred, and Guaranty Trust Company, as administrator de bonis non with the will annexed of the estate of Reese B. Brown, deceased. The purpose of the suit was to recover certain funds and personal property claimed to have been owned by Sarah E. Smith and held by Brown in trust for her and for an accounting. The trust feature was decided in Tucker v.\n\nBrown, 199 Wash. 320, 92 P.2d 221. The present appeal involves the accounting.\n\n(2) The probate proceedings of the estate of Reese B. Brown involved in the final account, to which Tucker had filed objections.\n\n(3) An action by Guaranty Trust Company, as administrator of the Brown estate, against Fred R. Brown to set aside transfers of property given without consideration by Reese B. Brown at a time when he was insolvent.\n\nIn addition to these cases, we have before us the objections of Bonsted \u0026 Nicholson and F. C. Palmer Jr., attorneys for appellant, relative to the amount of attorneys' fees allowed by the trial court.\n\nThe many issues and questions involved in this litigation are sufficient to make several large lawsuits.\n\nMr. Tucker died just prior to the argument in this court, and Mr. George H. Rummens, senior counsel for Tucker, was appointed in his stead.\n\nLitigation involving the Smith and Brown estates has been considered by this court in Tucker v. Brown, supra; In re Brown, 6 Wash. 2d 215, 101 P.2d 1003, 107 P.2d 1104; and In re Brown's Estate, ( Wash. 2d 717, 110 P.2d 867. Most of the incidents relative to the activities of Brown and Mrs. Smith are mentioned in Tucker v. Brown, supra. However, it will be necessary to set out many additional facts in the course of this opinion.\n\nMrs. Smith died July 24, 1932, in a hotel in Montreal, Canada, where she had been taken by Brown in an endeavor to elude the United States marshal who had a warrant of arrest for her issued as a result of a Federal indictment charging a violation of the revenue acts. Brown died as the result of an accident January 24, 1934.\n\nAfter the remittitur went down in Tucker v. Brown, supra, the trial court, September 13, 1939, entered its decree in accordance with the mandate of this court. that decree read as follows:\n\n\"IT IS HEREBY CONSIDERED, ADJUDGED AND DECREED as follows:\n\n\"1. The judgment of dismissal entered herein on March 26, 1938, and the judgment for costs to the defendants in said judgment is hereby in all respects vacated, cancelled and set aside.\n\n\"2. That upon the trial of this cause the defendants herein admitted the receipt and possession by Reese B. Brown of all of the property hereinafter described, alleging and contending possession thereof was justified by virtue of an alleged gift of all of said property from Sarah E. Smith to Reese B. Brown during their lifetime; that pursuant to the judgment of the Supreme Court of the State of Washington it is hereby adjudged and decreed that Sarah E. Smith did not in her lifetime make any gift of any property to Reese B. Brown or Sadie R. Brown or Fred R. Brown, and that plaintiff's action against said defendants is not barred by any statute of limitations.\n\n\"3. That in 1929 and 1930 Reese B. Brown received from Sarah E. Smith, as trustee for her under an express trust substantially all of the property then owned by her (a partial list of which is set forth in paragraph 4 hereof) and that during the life of Sarah E. Smith said property received by Reese B. Brown as trustee was not returned to said Sarah E. Smith, and no accounting of said trust was made to her, and no accounting has been made by Reese B. Brown or by the administratrix, administrator, executrix or administrator de bonis non with the will annexed of his estate since the death of Sarah E. Smith.\n\n\"4. That among other property the following property of Sarah E. Smith was received by Reese B. Brown in 1929 and 1930, as trustee for Sarah E. Smith, and for which the plaintiff is entitled to an accounting against the defendants herein:\n\n$203,000.00 First Liberty Loan Bonds\n\n10,000.00 Minneapolis-Trust Joint Stock Land Bank\n\n5,000.00 Pacific Coast Joint Stock Land Bank, Port-\n\nland\n\n20,000.00 Central Illinois Joint Stock Land Bank,\n\nGreenville\n\n20,000.00 California Joint Stock Land Bank, San\n\nFrancisco\n\n20,000.00 Union Joint Stock Land Bank, Detroit\n\n10,000.00 Iowa Joint Stock Land Bank, Sioux City\n\n10,000.00 Southern Minnesota Joint Stock Land\n\nBank, Redwood Falls\n\n10,000.00 LaFayette Joint Stock Land Bank\n\n10,000.00 Des Moines Joint Stock Land Bank\n\n10,000.00 First Trust Joint Stock Land Bank, Chicago\n\n10,000.00 County of Ramsey, Minnesota, Road and\n\nBridge\n\n10,000.00 South Park Commissioners, Chicago\n\n1,000.00 North Shore Park District, Chicago\n\n20,000.00 Little River Drainage District, Missouri\n\n3,000.00 County of Pulaski\n\n1,000.00 State of Illinois Highway Bond\n\n2,000.00 State of Illinois Service Compensation\n\nBonds\n\n2,000.00 St. Clair County, Illinois Road Bonds\n\n20,000.00 Yakima Special Water Works\n\n10,000.00 Public Service Company of Northern\n\nIllinois\n\n4,000.00 Metropolitan Building Company\n\n43,000.00 Dominion of Canada War Loan\n\n3,000.00 County of Bonner, Idaho, Road and Bridge\n\n\"Together with all interest coupons attached thereto.\n\n100 shares preferred stock Georgia Hotel Company, Ltd.\n\n20 shares ordinary Georgia Hotel Company, Ltd.\n\n$545,384,42 withdrawn from Metropolitan National Bank February 14, 1930\n\nAll household furniture, rugs, etc. owned by Sarah E. Smith\n\nLots 1, 2 and 3, Block 277, Seattle Tide Lands, King County, Washington\n\nAll of the lots owned by Sarah E. Smith in Bellingham, Whatcom County, Washington\n\n\"And in addition thereto during the existence of the said trust relationship between Reese B. Brown and Sarah E. Smith, and while the confidential and fiduciary relationship existed between them, Sarah E. Smith entrusted Reese B. Brown with $485,000.00 in money, which has not been repaid, and as to all of which the plaintiffs are entitled to an accounting from the defendants.\n\n\"5. That an accounting between the parties hereto with respect of all of the property owned by said Sarah E. Smith and received by said defendants or any of them, or by said Reese B. Brown, be had at a trial in this cause at such time as the matter may be regularly assigned for trial by the above entitled court. At said trial the evidence heretofore introduced in this action shall be considered and may be supplemented by such evidence as the parties hereto shall\n\nproduce. The nature and extent of plaintiff's claim against the defendants and the property in their possession because of the fact that said trust property has not been fully accounted for and returned to the plaintiff, shall be determined at the trial to be had as herein provided.\"\n\nDecember 14, 1939, respondent filed a supplemental petition relative to the return of the trust property. That petition, in which D. H. Bonsted and A. J. Falknor were made additional defendants, contained many allegations relative to the trust funds and the actions of the trust company, the Browns, and the attorneys. The pertinent portions of the allegations contained in that supplemental petition are as follows:\n\n\"That all matters and things herein set forth are supplemental of, and in addition to, all the matters alleged in plaintiff's Second Amended Complaint, which is on file herein, a copy of which is in the possession of each of the additional defendants.\n\n\"That the matters herein set forth are not pleaded for the purpose of changing or altering the nature of plaintiff's cause of action or the remedy therein sought, but are pleaded solely for the purpose of making additional parties defendant, and for the purpose of alleging additional supplemental facts so that proper, complete and adequate relief may be rendered to the plaintiff, as directed in the judgment and decree referred to in paragraph III hereof. . . .\n\n\"That at no time during the administration of said estate have any of the personal representatives of said Reese B. Brown, deceased, or any of its attorneys, attempted to fairly, honestly or in any unbiased manner administer said estate as successor trustee of the trust existing between Sarah E. Smith and Renee B. Brown. . . .\n\n\"That said Guaranty Trust Company made no personal investigation of the merits of plaintiff's claim, made no personal investigation of any of the facts surrounding the trust relationship existing between Reese B. Brown and Sarah E. Smith, and closed its eyes to all of the facts showing the merits of plaintiffs's claim, and left the matter entirely in the hands of D. H. Bonsted and A. J. Falknor, the representatives of Sadie R. Brown and Fred R. Brown.\n\n\"That said Guaranty Trust Company made no effort to ascertain the true facts involved in the relationship between Sarah E. Smith and Reese B. Brown and themselves as successor\n\ntrustee, and if it made any inquiry of the said D. H. Bonsted and A. J. Falknor with respect to the facts disclosed by their investigation, the facts were concealed by said D. H. Bonsted and A. J. Falknor from the Guaranty Trust Company. . . .\n\n\"That each and all of the matters hereinabove set forth are a part of the general plan, scheme and design of the defendants, and each and all of them, to prevent the plaintiff and the heirs of Sarsh E. Smith from receiving or obtaining the trust property herein referred to, and all of said acts were performed by said defendants with full knowledge of the facts herein alleged and alleged in the Second Amended Complaint, herein referred to, and that in all things herein referred to said defendants were engaged in collusion in an attempt to accomplish such purpose. . . .\n\n\"That the defendants Sadie R. Brown, Fred R. Brown, D. H. Bonsted and A. J. Falknor, well knowing that all of the properties in the possession of or claimed by the defendant Fred R. Brown were in truth and in fact properties which belonged to Sarah E. Smith, deceased, and properties which were required by the said Reese B. Brown to pay and satisfy his obligation to said estate of Sarah E. Smith, and unlawfully claimed by Fred R. Brown as a gift, inter vivos, falsely represented to the Superior Court aforesaid that the said Fred R. Brown was the owner, in his own right, of a large amount of real and personal property exceeding $200,000.00 in value, and represented to said Court that said pretended estate should have the care of a general guardian; and thereby induced said Superior Court of Yakima County, Washington, to appoint the said Sadie R. Brown as such guardian; and further induced said Court to award to the said Sadie R. Brown a large amount of money, to-wit, the sum of $17,000.00, under the guise of fees, plus various other expenditures claimed to have been made to the said Sadie, as guardianship expenditures; and further induced said Court to award to the defendants, D. H. Bonsted and A. J. Falknor large and exorbitant sums, under the guise of attorney fees for such guardian, exceeding $17,500.00; and, also, further induced said Court to award to the defendant Guaranty Trust Company a sum of money, to-wit: $5,000.00, to be by said Guaranty Trust Company applied to the general expense of defeating plaintiff's claim herein, that all of said sums of money were disbursed out of the trust property belonging to this plaintiff; that said\n\norder was obtained by the misrepresentations of the said defendants made to the Superior Court of Yakima County aforesaid to the effect that the said Fred R. Brown was in truth and in fact the owner of an estate inventoried at more than $200,000.00; that in truth and in fact all of the property held or claimed by the said Fred R. Brown was trust property belonging to the estate of Sarah E. Smith and held by the said Reese B. Brown in trust as aforesaid, all of which was known to said defendants, and all sums received by the said Sadie R. Brown, D. H. Bonsted, A. J. Falknor and Fred R. Brown, under the guise of fees, compensation, expenses, disbursements and allowances were properties and assets belonging to said trust fund created by said Sarah E. Smith and not to the defendant Fred R. Brown.\n\n\"That all such orders were made upon ex parte application; that by reason of such false representations aforesaid, the orders of the Superior Court aforesaid, directing the disbursements of said funds, were void and of no effect.\"\n\nThe prayer of the petition or complaint was that each and all of the defendants therein named be held personally and individually responsible for the return of the property, and that respondent have judgment against them for the value of all the property not delivered to and received by respondent.\n\nThe trust company filed an answer and cross-complaint. The answer denied the allegations contained in the petition, and in cross-complaint asked for judgment against the additional defendants in the event that the court should find against defendant on account of the actions of the attorneys. In an additional answer, the trust company pleaded estoppel, waiver, and laches on the part of respondent, and also res judicata and the statute of limitations. A reply put in issue the allegations to which we have last referred.\n\nJanuary 8, 1943, subsequent to the trial on the accounting phase of the case, the court entered its decree. The pertinent portions of that decree may be summarized as follows:\n\nParagraph 3. Sadie R. Brown was appointed administratrix of the estate of Reese B. Brown, deceased, February 1, 1934. February 13, 1934, Mrs. Brown resigned and appellant was appointed administrator de bonis non, and served until May 22, 1934, at which time the will of Reese B. Brown\n\nwas admitted to probate and his wife was confirmed as executrix of that will. She continued to act in that capacity until October 1, 1934, when she resigned and appellant was appointed administrator de bonis non with the will annexed. Since the last appointment, appellant has acted as such administrator and has been, in fact, the successor trustee of the Smith-Brown trust.\n\n\"(6) That from time to time inventories were filed in said probate proceeding in the matter of the estate of Reese B. Brown, deceased, describing the property purporting to be the property of the estate of Reese B. Brown, deceased; that all of said property was and is the property of the Smith-Brown trust.\"\n\n(8) In the years 1928, 1929, and 1930, Sarah E. Smith created and established an express trust of which she was the sole beneficiary and of which trust she appointed Reese B. Brown trustee. Thereafter, she delivered to Brown, as trustee, substantially all of her property of a value in excess of $1,600.000, and Brown acted as her trustee until his death.\n\n(10) Brown did not account to Mrs. Smith nor to her representatives for the whole or any part of the trust estate. He expended the sum of $1,607.32 from the funds of the trust in connection with Mrs. Smith's last illness and the funeral expenses incident to her death.\n\nParagraph 11 held that, at the time of his death, neither Brown nor his wife nor his son owned any property of any kind, but that the property they possessed, controlled, or purported to own was that of the Smith-Brown trust; further, this paragraph quieted title to all of that property in Wilmon Tucker, as administrator with the will annexed of the estate of Sarah E. Smith.\n\nParagraph 12. Tucker filed a claim against the Brown estate in which he asserted that all the property in the possession of Reese B. Brown at the time of his death belonged to the Sarah E. Smith estate, and the claim was rejected by Mrs. Brown.\n\n\"(16) That on and since the first day of October, 1934, Guaranty Trust Company, as administrator aforesaid, took\n\ninto and retained in its possession and under its control property of the Smith-Brown trust and used and applied the same in conducting and carrying on the business of farming and the marketing of livestock and continued in such business until all of the property of said Smith-Brown trust which had come into its possession and under its control was sold and liquidated into cash, (except certain property thereof which is referred to in paragraphs 23, 24 and 25 hereof), that the Guaranty Trust Company now has on hand the aggregate sum of $151,488.95, which is a part of the proceeds received by it from the operation of said business and from the sale of property of said Smith-Brown trust; that a part of said aggregate sum is represented by certificates of deposit evidencing the total sum of $81,121.92, issued by the Yakima Branch of the National Bank of Commerce of Seattle, Washington, payable to the order of Guaranty Trust Company, as administrator of the estate of Reese B. Brown, deceased, and Wilmon Tucker, as administrator of the estate of Sarah E. Smith, deceased, and the balance thereof, namely, $70,367.03, is represented by cash on hand and on deposit to its credit in banks; that the Guaranty Trust Company, individually and as administrator and successor trustee aforesaid, forthwith shall indorse and deliver to Wilmon Tucker, as administrator aforesaid, each and every of the aforesaid certificates of deposit evidencing $81,121.92 and forthwith shall pay to Sunnyside Land \u0026 Investment Company the sum of $970.00 thereof, as stated in paragraph 23 hereof and forthwith shall pay and deliver to Wilmon Tucker, as administrator aforesaid, the entire balance thereof, namely, $69,397.03.\"\n\nParagraph 17. During the course of its administration of the Brown estate, defendant trust company expended $128,479.74 belonging to the Smith-Brown trust, which expenditures were not for the benefit of the trust and which defendant had no right to expend; and the court further held that defendant was not entitled to any credit for that amount, but that defendant\n\n\". . . be and is charged with the whole amount thereof; that said sum is not included in the aggregate sum stated in paragraph 16 hereof; that Guaranty Trust Company, a corporation, individually and as administrator and successor trustee aforesaid, shall account therefor to the plaintiff, Wilmon Tucker, as administrator aforesaid, in the following manner, namely:\n\n\"(a) It shall take credit for the sum of $121,494.09 thereof in satisfaction of the sums allowed and awarded to it under paragraph 20 hereof, and, out of the same, shall pay such sums as are necessary to satisfy the amount therein awarded to it for for Bonsted \u0026 Nichoson and Fred C. Palmer, Jr. in the sum of $48,000.00 and the amount therein awarded to it for Cheney \u0026 Hutcheson in the sum of $7,000.00 as stated in paragraphs 20 and 21 herein, respectively; and\n\n\"(b) It forthwith shall restore to and replace in said Smith-Brown trust the balance thereof, namely, $6,985.65 and forthwith shall pay the same to Wilmon Tucker as administrator aforesaid.\"\n\nParagraph 19. The trust company was held not liable for interest on the value of the funds belonging to the Smith-Brown trust.\n\nParagraph 20. It was allowed credit for the following items:\n\n\"(a) For services performed by Guaranty Trust Com-\n\npany in caring for and protecting the trust prop-\n\nerty of the Smith-Brown trust and operating the\n\nfarms and all of the attendant service in connec-\n\ntion therewith for 84 months commencing October\n\n1st, 1934, at $750.00 per month, amounting to $63,000.00\n\n\"(b) For legal services rendered to Guaranty Trust\n\nCompany by Bonsted \u0026 Nichoson and Fred C.\n\nPalmer Jr. in connection with preserving and pro-\n\ntecting the property of the Smith-Brown trust 48,000.00\n\n\"(c) For legal services rendered to Guaranty Trust\n\nCompany and Cheney \u0026 Hutcheson in connection\n\nwith preserving and protecting\n\nthe property of the\n\nSmith-Brown trust and effecting sales thereof and\n\nfor services rendered ti in Cause No. 31418 7,000.00\n\n\"(d) For expense incurred by it in connection with the\n\naccounting of Smith-Brown trust 2,500.00\n\n\"(e) Miscellaneous trust expenses 994.09\n\n$121,494.09\"\n\nParagraph 23 recited that certain property had been surrendered to plaintiff.\n\nParagraph 25. The Brown estate was not liable for payment of inheritance taxes to the state, nor estate taxes to the United States; and that the trust company must account for and pay the Smith estate $6,115.32, which had been expended in payment of those taxes.\n\nParagraph 28. Certain property held by Fred R. Brown which was sold and the proceeds paid to the trust company in the amount of $11,573.31 belonged to the Smith-Brown\n\ntrust, which sums were in the hands of the company and should be paid to plaintiff.\n\n\"(29) That plaintiff, Wilmon Tucker, as administrator aforesaid, is not entitled to recover from Guaranty Trust Company, in any capacity whatever, the whole or any part of any sum which it paid to Fred R. Brown and Sadie R. Brown, as his guardian, nor for any sum which it paid to Sadie R. Brown, nor for any sums which it paid to Poe, Falknor, Emory \u0026 Howe as attorney fees.\"\n\nParagraph 30 approved and confirmed certain sales of real and personal property made by the trust company.\n\n\"(31) That the supplemental complaint, petition for return of trust property, etc. of the plaintiff in Cause no. 27543 against the additional defendants A. J. Falknor, D. H. Bonsted, et al., be, and the same hereby is dismissed with prejudice and without costs to either party, and that the cross-complaint of Guaranty Trust Company, as administrator aforesaid, in said Cause no. 27543 against D. H. Bonsted, V. O. Nichoson and Fred C. Palmer Jr. and Sadie R. Brown and Fred R. Brown, except as to matters covered by this decree, be and the same hereby is dismissed with prejudice and without costs.\"\n\nParagraph 32 provided for the dismissal of the action brought by defendant against Sadie R. Brown and Fred R. Brown.\n\nParagraph 33. Neither the Brown estate nor defendant has any right to property which stood in the name of Sadie R. Brown or Fred R. Brown, but that property belonged to the Smith estate.\n\nParagraph 34 set over to Sadie R. Brown and her son Fred certain articles of personal property which had been given to them by a settlement entered into with plaintiff.\n\nParagraph 35 confirmed the settlement to which the reference has just been made, and then provided:\n\n\"(a) That immediately upon the entry of this decree dissolving the restraining order in Cause no. 31418, the Trust Department of the Seattle First National Bank shall deliver to Wilmon Tucker, as administrator aforesaid, all of the original instruments, A to E inclusive, therein referred to, together with all other property, documents and papers, if any, in connection therewith in the possession\n\nof said trust department of the Seattle First National Bank, as Escrow holder; that the said Sadie R. Brown and Fred R. Brown forthwith shall deliver unto Wilmon Tucker, as administrator aforesaid, all of the property which they have not heretofore delivered pursuant to the terms of said stipulation and agreement for settlement;\n\n\"(b) That upon the entry of this decree dissolving the restraining order in Cause no. 31418, said defendants Sadie R. Brown and Fred R. Brown shall deliver to Wilmon Tucker, as administrator aforesaid, all records, deeds, abstracts of title, insurance policies, fire insurance policies or other papers relating to the title of said property, all unrecorded deeds from Reese B. Brown and wife to Fred R. Brown, all safe deposit box keys in the possession of Sadie R. Brown, or Fred R. Brown, (except those for safe deposit boxes now rented by Sadie R. Brown or Fred R. Brown), together with all other miscellaneous papers or documents relating to any of the property heretofore standing in the name of Reese B. Brown, Fred R. Brown or Sadie R. Brown, except insofar as said papers refer exclusively to the property mentioned in paragraph 34 of this decree;\n\n\"(c) That pursuant to said stipulation and agreement for settlement (Exhibit 506), no statute of limitations shall apply to any action that may be brought by the plaintiff in said Cause no. 27543, or his successor, to recover any of the property to which the estate of Sarah E. Smith is entitled under the provisions of said stipulation and agreement for settlement. For the purpose of effecting recovery of such property, pursuant to the provisions of said stipulation and agreement for settlement, the court hereby retains jurisdiction of the persons of said Sadie R. Brown and Fred R. Brown and of the subject matter insofar only as it may afford the plaintiff in said Cause no. 27543 or his successors the opportunity to reopen said Cause No. 27543 for the purpose of procuring an adjudication of the status of any property hereinafter to be discovered, which should be applied toward such deficiency; notice of the application for the reopening of said Cause No. 27543 shall be given to Sadie R. Brown and Fred R. Brown in the manner specified in said stipulation and agreement for settlement.\n\n\"(d) That all claims which the said Sadie R. Brown and Fred R. Brown have, or claim to have, against the estate of Sarah E. Smith or Wilmon Tucker, as administrator\n\nof said estate, or against the estate of Reese B. Brown, or against the Guaranty Trust Company, as administrator de bonis non with the will annexed of said estate, have been waived, released, satisfied and discharged, and said Sadie R. Brown and Fred R. Brown have no claim of any kind or character whatsoever against them or either or any of them.\n\n\"(e) That Sadie R. Brown and Fred R. Brown and the Guaranty Trust Company, as administrator and successor trustee aforesaid, and each of them, have no right, title or interest in and to the following described property, as to most of which they, and each of them, have heretofore expressly disclaimed any interest:\n\nMinneapolis-Trust Joint Stock Land Bank of Minneapolis,\n\nMinnesota, 1952 5% coupon bonds Nos. M151167-76, both\n\ninclusive at $1,000 each $10,000.00\n\nCentral Illinois Joint Stock Land Bank of Greenville,\n\nIllinois, 1952 5% coupon bonds Nos. M152016-24, both in-\n\nclusive, M152349 and M185596-185605 at $1,000 each 20,000.00\n\nIowa Joint Stock Land Bank of Sioux City, Iowa, 1952 5%\n\ncoupon bonds, Nos. M 180661-70, both inclusive, at $1,000\n\neach 10,000.00\n\nSouthern Minnesota Joint Stock Land Bank, RedwoodFalls,\n\nMinesota, 1952 5% coupon bond No. VM180001\n\nat $5,000.00 5,000.00\n\nSame, 1953, No. VM 21002 5,000.00\n\nFirst Trust Joint Stock Land Bank, Chicago, Illinois 1953\n\n4 3/4% coupon bond No. XM 215117 at $10,000 10,000.00\n\nLittle River Drainage District (Missouri) Nos. 2948-2051\n\nincl. 3737-3744 incl. 4188, 4190-4192\n\nincl. 4195, 4198, 4201\n\n4204, 4206, 1932 5 1/2% at $1,000 each 20,000.00\n\nNorth Shore Park District No. 37 5% at $1,000 1932 1,000.00\n\nMetropolitan Building Co. Bonds Nos. 3477, 3483, 3486\n\nand 3487 at $1,000 each 4,000.00\n\nand also all other property in the possession of Reese B. Brown or under his control at the time of his death, whether standing in his name or held in his name as trustee for Sarah E. Smith or her estate, which property has not heretofore come into the possession of any of the parties hereto, as well as all interest in and to the deposits or certificates evidencing such deposits issued by the Midlands Savings and Loan Association, and the Midland Federal Savings and Loan Association.\"\n\nParagraph 36 commanded the defendant company to deliver all property of the Brown estate to plaintiff, including books of account and records, instruments, and documents, kept or used in relation to the activities of the Brown estate.\n\nParagraph 37 held that the final report of defendant in the Brown estate should be considered as the report of defendant as successor trustee of the Smith-Brown trust, that there was no property in the Brown estate which could be used to pay the creditors of Reese B. Brown, and that there was no property for distribution to his heirs.\n\nParagraph 38 provided for the enforcement of the decree.\n\nParagraph 39 closed the Brown estate.\n\nParagraph 40 allowed respondent to collect costs from appellant.\n\nThe items included in the $128,479.74 charged to Guaranty Trust Company mentioned in the decree are as follows:\n\n\"(1) Vanderveer-Bassett judgment, $41,696.36\n\n(2) Fees paid Guaranty Trust Co., 10,500.00\n\n(3) Bonsted \u0026 Nichoson payments, 42,175.26\n\n(4) Brown Estate Taxes, 5,803.11\n\n(5) Brown Inheritance Taxes, 1,090.93\n\n(6) Accounting Expense, 4,913.54\n\n(7) Interest charged and received by Guaranty\n\nTrust Company, 2,258.34\n\n(8) Henly witness fees, Tucker v. Brown, 1,959.90\n\n(9) Denny witness fees, Tucker v. Brown, 1,248.21\n\n(10) Harris witness fees, Tucker v. Brown, 2,500.00\n\n(11) Harris witness fees, Newman v. Brown 2,273.00\n\n(12) Transcripts and depositions,\n\nTucker v. Brown, 1,454.57\n\n(13) Printing Briefs, 1,005.89\n\n(14) Montreal Depositions, Tucker v. Brown, 615.71\n\n(15) Witness expenses, Tucker v. Brown, 920.84\n\n(16) Witness fees, Tucker v. Brown, 619.72\n\n(17) Miscellaneous expenses (Itemized on Exhibit 'B'\n\nattached hereto), 3,849.85\n\n(18) Premium on Bond of Guaranty Trust Company\n\nas administrator de bonis non, 3,588.00\n\n(19) Telephone and Telegraph Co., 6.51\"\n\nWilmon Tucker, as administrator of the Smith estate, the Guaranty Trust Company, and Bonsted \u0026 Nichoson and F. C. Palmer, Jr., have appealed. We shall refer to the Guaranty Trust Company as appellant, to Tucker as respondent, to the trial preceding our decision in Tucker v. Brown, supra, as the first trial, and to the hearing on the accounting as this or the present trial.\n\nThe trust company assigned as error the entry of paragraphs 2, 3, and 4 of the decree and judgment on the remittitur dated September 13, 1939; in dismissing the cross-complaint against the Falknor firm; in entering the final\n\ndecree in favor of respondent and against appellant; in the making of surcharges and the rendering of personal judgment against appellant in its individual capacity; in making surcharges and rendering judgment against appellant as administrator; in the entry of paragraphs 3, 6, 8, 10, 11, 12, 15, 16, 17, 18, 20, 21, 23, 25, 28, 31, 32, 33, 34, 35, 36, 37, 38, and 39 of the final decree; the denial of appellant's motion to strike the respondent's cost bill; in denying appellant's motion to retax costs; the failure and refusal to ratify, confirm, and approve appellant's final account; the refusal to grant appellant full relief upon its cross-complaint; failure to hold that previous orders approving intermediate accounts in the Brown estate were final, conclusive, and binding; the failure and refusal of the court to adjudge that the settlement stipulation released appellant from all liability; the court's refusal to allow appellant credit for the sum of $5,000 received by it from Mrs. Brown as executrix to apply on the cost of defending the Tucker suit; in failing to allow appellant credit for $1,607.32 paid by Brown for the funeral expenses of Mrs. Smith; the denial of appellant's motion for dismissal of respondent's supplemental petition; in rendering personal judgment against appellant for the Vanderveer judgment; in entering the decree against appellant for the expenses of defending the Tucker suit; in rendering personal judgment against appellant for the expenses of defending the Hudson-Newman actions; in rendering personal judgment against appellant for the estate and inheritance taxes paid; in rendering personal judgment against appellant for accounting expenses, for interest charges, and for bond premiums paid by appellant; in surcharging appellant with certain items referred to on Exhibits A and B attached to the final decree.\n\nThe representatives of the Smith estate made the following assignments of error: The allowance of compensation to appellant and its attorneys from the trust funds; the failure to require appellant to deliver to respondent all of the Smith-Brown trust property; in not allowing respondent interest upon the value of the trust property which was withheld from respondent, and in not allowing\n\nresponder reasonable expenses in making the accounting of the Smith-Brown trust; in failing to require appellant to pay respondent moneys and property paid to Sadie R. and Fred Brown; in failing to charge appellant with $6,170 paid to J. W. Maxwell, a creditor of Reese B. Brown; in allowing appellant a credit of $5,064.60 on account of sums paid by it to the internal revenue department of the United States; and in considering the final report in the estate of Reese B. Brown as an account of the Smith-Brown trust and in ratifying and approving the account in part.\n\nThe assigments of error made by Bonsted \u0026 Nichoson and Fred C. Palmer, Jr., are: In denying their motion for a new trial; in allowing them a sum less than $65,000; in deducting from the allowance made the sum of $2,500 paid to them after October 1, 1940, under order of the court for services rendered prior to October 1, 1940; in deducting from the allowance made the sum of $7,219.17 on account of expenses incurred; and in not allowing a reasonable value of all services which the attorneys had in good faith rendered, and in failing to order payment out of any funds in the hands of the trust company, as administrator with the will annexed, or from funds of the Smith-Brown trust.\n\nReese B. Brown became acquainted with Mrs. Smith in the latter part of the year 1928. At that time he had no financial resources. He told a witness, A. C. Shallenberger, that at that time he \"was broke.\" At the time Mrs. Brown was appointed administratrix of her husband's estate, she said, \"Mr. Bonsted, you know that there's nothing in this estate\"; and in 1940 appellant alleged that \"from and after July, 1928, the said Reese B. Brown was wholly insolvent.\" The records in Yakima showed that in 1929 Brown had judgments against him in the total sum of over one hundred thousand dollars. From the beginning of their acquaintance until the death of Mrs. Smith, she and Brown were very closely associated and made trips to many cities on this coast and the middle west and eastern cities of the United States and finally to Montreal, Canada. In many of those cities, Brown deposited funds in rented safety deposit boxes and purchased cashiers' checks. He invested in a\n\nlarge farm in Yakima county and stocked it with pedigreed horses and cattle which were brought from eastern states. He also purchased a farm in Virginia and stocked it in the same manner. He purchased two apartment houses in the city of Seattle and acquired a woolen mill and a large mercantile establishment. He deeded large tracts of real property and turned over personal property to his minor son, Fred, for whom a guardian was afterward appointed. We will refer to many other activities of Brown as we discuss the question presented for consideration.\n\nIn order to get a picture of the various steps taken in the Smith estate and in the complicated and costly probate proceedings of the Reese B. Brown estate, we mention those which necessarily throw light upon this litigation.\n\nIn February, 1934, Wilmon Tucker was appointed guardian of Mrs. Smith, an incompetent person. In May or June, 1934, he was appointed trustee of the property of Sarah E. Smith, an absentee, and thereafter gave notice, as provided by Rem. Rev. Stat., § 1715-1 [P.C. § 9776], which notice requested \"that all persons having knowledge concerning the absentee shall advise the court of the facts.\" These proceedings were had in the superior court of King county. The notice came to the attention of Mrs. Brown, who neglected to notify Tucker, though she at that time knew of the death of Mrs. Smith. July 9, 1934, Tucker was appointed administrator with the will annexed of the estate of Sarah E. Smith.\n\nJanuary 31, 1934, Mrs. Brown was appointed administratrix of her husband's estate in Yakima county. February 13, 1934, that court entered an order discharging Mrs. Brown and appointing appellant administrator de bonis non. On the 15th of that month, Mrs. Brown petitioned for a family allowance, and on the 23rd, an order for allowance was made to the attorney for the estate. May 22, 1934, Mrs. Brown was appointed executrix of Reese B. Brown's last will and testament. June 25, 1934, a decree was entered discharging appellant as administrator. August 29, 1934, Tucker filed a claim for $5,250,000 and served it upon Mr. Bonsted, attorney for Sadie Brown,\n\nexecutrix. This claim was marked rejected September 22, 1904, by Mrs. Brown. October 1, 1934, an order was entered accepting the resignation of Mrs. Brown and appointing appellant administrator with the will annexed of the estate of Reese B. Brown. October 10, 1934, the Guaranty Trust Company notified respondent that his claim had been rejected by Mrs. Brown. October 23, 1934, respondent filed his action against Mrs. Brown and Guaranty Trust Company as administrator. That action was the one decided by this trial court in Tucker v. Brown, supra. December 14, 1934, the first and final account of Sadie Brown was approved.\n\nThe final account, made to the court in the probate proceedings and made up of former reports together with a history of the various events of the probating of the Reese Brown estate, takes up 196 pages of the transcript. From it we learned that at the beginning appellant was allowed $750 per month; Bonsted \u0026 Nichoson $500 per month; Mrs, Brown $500 per month, and Fred Brown was paid $7,000 yearly rental for the property standing in his name.\n\nAttorney's fees had been paid from the Reese Brown estate as follows:\n\n\"Bonsted \u0026 Nichoson and F. C. Palmer JR $48,291.03\n\nPoe, Falknor, Falknor \u0026 Emory 9,461.30\n\nReba Hurn 494.87\n\nJ. O. Cull 15.00\n\nHugo Luhman 80.00\n\nRaymond, Carlson \u0026 Langlois 512.41\n\nHancox \u0026 Gowan 105.00\n\n$58,959.61\"\n\nAside from these fees, Bonsted \u0026 Nichoson had received $17,500, and Poe, Falknor, Falknor \u0026 Emory had been paid $2,500 from the Fred Brown guardianship. Also the last named firm had received $3,000 from Fred Brown. Appellant reported that it had received $10,500 to apply on the account for services, and then asked to be allowed a total sum of $74,500. The report showed that many large sums had been paid for witness fees and their hotel expenses in the litigation with respondent.\n\nThe proceeds from the sale of the estate property and the income from operations were set out in detail. The expenditures were also listed. Attorneys' fees for Bonsted \u0026 Nichoson were asked for in a reasonable amount and for Cheney \u0026 Hutcheson in the amount of $13,500. In addition, appellant asked for approval of all its expenditures, including the payment of fees and expenses in all its litigation, in the operation of the ranch, and for the preparation of the accounting report.\n\nJuly 24, 1942, respondent filed objections to the report. He denied any matter or thing in the report which affected the property of the trust; denied that any valid order had been made approving any former account; denied that any item or sum referred to as having been expended was spent on behalf of or was chargeable to the trust fund. He also challenged the correctness of the report. Respondent alleged:\n\n\" . . . that each and all of the orders referred to in the Final Account and Petition for Distribution have the effect only of interim orders entered during the course of the probate proceeding in the Estate of Reese B. Brown, deceased, and neither thereof is final, and that each thereof is subject to review and revision by this Court, and demand for review and revision and the vacating of each thereof hereby is made.\"\n\nIndustrious counsel have cited an imposing number of cases from various jurisdictions bearing on the questions presented by this appeal. such a formidable array has challenged the interest and industry of the writer to undertake the laborious but not unpleasant task of examining every case cited, together with others which we have collected.\n\nBefore proceeding to a discussion of the many controversies presented in this case, we find it necessary to mention some of the duties of trustees and successor trustees and then to ascertain from the facts and all the surrounding circumstances whether the parties to this action performed those duties in accordance with the rules relating to trustees.\n\nIt must be borne in mind that appellant and respondent were each acting in a fiduciary capacity.\n\nIt is the duty of a trustee to administer the trust in the interest of the beneficiaries. The trustee must exclude from consideration not only his own advantage or profit, but also that of third parties in dealing with trust properties and in all other matters connected with the administration of the trust estate. No exception can be made to this rule. Courts have fixed a very high and exceptionally strict standard for trustees to follow in the conduct of their trust activities.\n\n\"It is a general principle that a trustee must act with the most scrupulous good faith. The one great duty arising from this fiduciary relation is to act in all matters relating to the trust wholly for the benefit of the beneficiary. A trustee will not be permitted to manage the affairs of his trust, or to deal with the trust property, so as to gain any advantage, either directly or indirectly, for himself.\" Linsley v. Strang, 149 Iowa 690, 126 N.W. 941, 128 N.W. 922.\n\nIn Zimmerman v. Fraley, 70 Md. 561, 71 Atl. 560, the court says:\n\n\"It is of the most vital importance that trustees be held to a strict and rigid accountability; and however serious may be the consequences which in particular cases the application of this rule may entail upon the individual affected, or upon their heirs or sureties, insensibility to those consequences is a stern and an imperative mandate of judicial duty.\" Cited with approval in Haas v. McGinn, 64 R. I. 133, 11 A. (2) 284.\n\nThe principle is well expressed in Menhard v. Salmon, 249 N.Y. 458, 164 N.E. 545, 62 A.L.R. 1:\n\n\"Many forms of conduct permissible in a workaday world for those acting at arm's length, are forbidden to those bound by fiduciary ties. A trustee is held to something stricter than the morals of the marker place. Not honesty alone, but the punctilio of an honor the most sensitive, is then the standard of behavior. As to this there has developed a tradition that is unbending and inveterate. Uncompromising rigidity has been the attitude of courts of equity when petitioned to undermine the rule of undivided\n\nloyalty by the 'disintegrating erosion' of particular exceptions. (Wendt v. Fischer, 243 N.Y. 439, 444) [154 N.E. 303]. Only thus has the level of conduct for fiduciaries been kept at a level higher than that trodden by the crowd. It will not consciously be lowered by any judgment of this court.\"\n\nThe rule as stated is a proper one, and we give it our unqualified approval by adopting it as written by Chief Judge Cardozo.\n\n\"Duty of Loyalty. . . . (2) The trustee in dealing with the beneficiary on the trustee's own account is under a duty to the beneficiary to deal fairly with him and to communicate to him all material facts in connection with the transaction which the trustee knows or should know.\" Restatement, Trusts, p. 431, § 170. Cited in Wool Growers Service Corp. v. Simcoe Sheep Co., 18 Wash. 2d 655, 140 P.2d 512.\n\n\"The trustee is under a duty to the beneficiary to give him upon his request at reasonable times complete and accurate information as to the nature and amount of the trust property, and to permit him or a person duly authorized by him to inspect the subject matter of the trust and the accounts and vouchers and other documents relating to the trust.\" Restatement of the Law of Trusts 447, § 173.\n\nWhere a trustee finds himself in the position where he has, either individually or as trustee for another, an interest which conflicts with that of the beneficiaries of the trust, he should resign from the trust so as not to attempt the impossible task of representing conflicting interests. In re Brown's estate, supra. These principles apply to all trustees, regardless of whether they are original or successor trustees.\n\n\"Wherever property, real or personal, which is already impressed with or subject to a trust of any kind, express or by operation of law, is conveyed or transferred by the trustee, not in the course of executing and carrying in your effect the terms of an express trust, or devolves from a trustee to a third person, who is a mere volunteer . . . or who is a purchaser with actual or constructive notice of the trust . . . , then the rule is universal that such heir, devisee, successor, or other voluntary transferee, or such\n\npurchaser with notice, acquires and holds the property subject to the same trust which before existed, and becomes himself a trustee for the original beneficiary. Equity impresses the trust upon the property in the hands of the transferee or purchaser, compels him to perform the trust if it be active, and to hold the property subject to the trust, and renders him liable to all the remedies which may be proper for enforcing the rights of the beneficiary. It is not necessary that such transferee or purchaser should be guilty of positive fraud, or should actually intend a violation of the trust obligation; it is sufficient that he acquires property upon which a trust is in fact impressed, and that he is not a bona fide purchaser for a valuable consideration and without notice. This universal rule forms the protection and safeguard of the rights of beneficiaries in all kinds of trust; it enables them to follow trust property, -- lands, chattels, funds of securities, and even of money, -- as long as it can be identified, into the hands of all subsequent holders who are not in the position of bona fide purchasers for Vallejo value and without notice; it furnished all those distinctively equitable remedies which are so much more efficient in securing the beneficiary's rights than the mere pecuniary recoveries of the law.\" 4 Pomeroy's Equity Jurisprudence (5th ed.) 102, § 1048; cited with approval in Paysse v. Paysse, 86 Wash. 349, 150 P. 622.\n\nThese rules apply to the actability of appellant subsequent to the time it had notice of the trust relationship which had existed between Mrs. Smith and Brown.\n\nAppellant, in assuming the duties of administrator de bonis non and administrator with the will annexed, stepped into the shoes of Reese Brown and became the successor trustee of the trust. As successor trustee, it assumed all the duties and was charged with all the obligations of the original trustee in so far as an accounting was concerned. This duty was not one imposed upon appellant as administrator of the Brown estate, by only incidental thereto.\n\nIt was the duty of appellant to make a full and correct accounting of all known assets of the Smith-Brown trust which had come into the possession or under the control of appellant. there are two reasons for the imposition of this duty: (1) appellant was commanded to make an accounting by this court in Tucker v. Brown, supra; (2)\n\nit is the general rule that all successor trustees must maker an accounting of the trust.\n\n\"the personal representative of a deceased trustee must account for the period his decedent was in possession as well as for that during which he himself has held it,\" 65 C.J. 890, Trusts, § 786.\n\n\"Where new or substituted trustees have been appointed, it is they or the survivor of them who is required to account rather than the original trustees. On the death of a trustee, where no successor had been appointed, the personal representative of decedent is under the duty of accounting under the trust, . . . \" 65 C.J. 886, trusts, § 785.\n\n\"The decedent was the trustee of the fund. It was his duty to have made a settlement of his accounts as trustee, and when he died without having made a settlement it was the duty of his executors to make such a settlement. When they failed to make it, the only remedy for the present trustees was a suit to have the trust settled.\" Boreing v. Faris, 127 Ky. 67, 104 S.W. 1022.\n\n\"It appears to me quite clear that the testatrix imposed a trust upon this property and that the administrator's duty was to carry out the terms of the trust. Of course, the proper course to have been pursued would have been to have had a trustee appointed to administer this trust, as, technically, it is no part of the duty of an administrator with the will annexed. However, having taken upon himself the burden of administering the trust he will be required to account for his dealings with the business.\" In re Ludlow's Estate, 3 N.J. Misc. 568, 129 Atl 429.\n\nAccord: In re Belt's Estate, 29 Wash. 535, 70 P. 74, 92 Am. St. 916: Lew You ying v. Lew Kay, 174 Wash. 83,24 P.2d 596. See, also, In re Thurston, 104 N.J. Eq.395, 145 Atl. 110; State ex rel. Karrenbrock v. Mississippi Valley Trust Co., 209 Mo. 472, 108 S.W. 97; and In re Olney Bank \u0026 Trust Co., 116 Pa. Super. Ct. 438, 176 Atl. 837.\n\n\"It is not always that a trustee is permitted to urge, against the strict examination of his accounts, all of the rules of legal warfare governing in purely adversary proceedings. His duty to render an account not only mathematically correct, but equitably fair, and to submit his performances\n\nof the trust duties to examination, operates, often, to the advantage of the cestuis que trust, who might be, otherwise, considered to be irretrievably in default. This rule is also one largely of public policy.\" Pomeroy v. Noud, 145 Mich. 37, 108 N.W. 498.\n\nThis is an equity case and is tried de novo in this court.\n\nIt is argued by appellant that the judgment entered in compliance with the terms of the remittitur sent down in Tucker v. Brown, supra, was an interlocutory order only and was not supported by any evidence. It cites in support of its contention: State ex rel. Seattle General Contract Co. v. Superior Court, 56 Wash. 649, 106 P. 150, 28 L.R.A. (N.S.) 516; State ex rel. Robinson v. Superior Court, 134 Wash. 90, 234 P. 1017; Von Herberg v. Nelson, 175 Wash. 572, 27 P.2d 1103; Bishop v. Illman, 9 Wash. 2d 360, 115 P.2d 151; and Reif v. LaFollette, 19 Wash. 2d 366, 142 P.2d 1015. The cases are not in point, for the reason that they do not decide any question concerning judgments on remittitur, but only refer to orders made during the progress of the trial.\n\nAppeal could not have been taken from the judgment entered by the trial court. Frye v. King County, 157 Wash. 291, 283 P. 18. We quote the applicable rule from that case as follows:\n\n\"The mandate of this court is binding on the superior court, and must be strictly followed. Having reversed the judgment and remanded the case to the trial court with instructions to enter judgment in accordance with our opinion, that order is conclusive, and no judgment different therefrom can be entered by the trial court. 2 R C.L., p. 289, § 244.\n\n\"Though the trial court misinterpreted the opinion of this court and entered a judgment contrary to the directions of this court, no right of appeal from that judgment exists. the statute gives none, nor does one obtain at common law. The remedy is not by appeal. This court lost jurisdiction of the case when the remittitur was sent down to the superior court. If, through some error, the decision, as remanded, does not express the real judgment of this court, we may recall the remittitur, if timely application\n\nis made therefor, for the purpose of correcting the mistake or enforcing the judgment. Peabody v. Edmonds, 72 Wash. 604, 131 P. 250.\n\n\"If the superior court proceeds contrary to the mandate of this court, that would be an interference with this court's jurisdiction, and the proper procedure for the aggrieved party to pursue would be to apply to this court for an appropriate writ requiring the superior court to enter judgment conforming to the mandate. To entertain this appeal, would be in effect, to grant a rehearing. The case has been decided once on appeal, petition for rehearing denied, and the remittitur sent down to the superior court; therefore we have no jurisdiction to grant such a rehearing. Certainly not until the recall of the remittitur by which we would reinvest ourselves with jurisdiction. That we have not been asked to do.\"\n\nApproved: Morton Organ Co. v. Armour, 179 Wash. 392, 38 P.2d 257; Corbaley v. Pierce county, 197 Wash. 102, 84 P.2d 666; and Kosten v. Fleming, 17 Wash. 2d 500, 136 P.2d 449.\n\nIf appellant was not satisfied with the judgment entered by the trial court upon the remittitur, it could have petitioned this court to correct that judgment. Having failed to take appropriate action, appellant is foreclosed from in any way objecting to the judgment. The decision of this court in Tcker v. Brown, supra, is not an authority, but is a binding, conclusive judgment which determines that the funds and property turned over to Brown by Mrs. Smith were held by him as a trustee. The judgment of the trial court on remittitur carried into effect the judgment of this court with the same force and effect of any final judgment.\n\nWhether or not the evidence was sufficient to warrant the entry of the judgment was immaterial, because the judgments of this and the trial court became the law of the case. Cannon v. Seattle Title Trust Co., 145 Wash. 691, 261 P. 642; Eyak River Packing Co. v. Parks, 148 Wash. 495, 269 P. 807; and Machenheimer v. Falknor, 151 Wash. 447, 276 P. 297.\n\nFinal judgments having been rendered, it was the\n\nduty of appellant to proceed with the accounting as directed by those judgments.\n\nAppellant contends that this action was not commenced within the time limited by the three-year statute of limitations. It bases its contention on the fact that the complaint used the word \"trust,\" but did not designate the kind of trust claimed; further, that the action was to enforce a constructive trust \"because all of the property inventoried in the Brown estate was subsequently acquired by brown, and if plaintiff has any claim thereon whatever, it is solely by reason of a subsequent alleged purchase thereof by Brown with alleged trust funds.\"\n\nThere are two answers to this argument: First, our opinion and the judgment on the remittitur state that respondent's action is not barred by any statute of limitations. That judgment, as we have stated, was final and is the law of this case. second, the complaint, while not giving any name to the kind of trust claimed, alleged an express trust which is not subject to the operation of the statute of limitations until it is terminated or is repudiated by the trustee. Tucker v. Brown, supra; 34 Am. Jur. 86, Limitations of Actions, $107;37 C.J. 905, Limitation of Actions, § 263(b).\n\nAt the time the complaint in this action was filed, October 22, 1934, the trust had not been terminated, and no repudiation was declared until the claim had been rejected by Mrs. Brown September 22, 1934, just prior to the time she resigned as executrix.\n\nThere is no diligence required of a cestui que trust until there is a repudiation of the trust. Davies v. Metropolitan Life Ins. Co., 189 Wash. 138, 63 P.2d 529.\n\nAppellant claims that respondent cannot recover a personal judgment against it, for the reason that he made his election by filing his claim and beginning his action against appellant in its representative capacity and is therefore precluded from waging his action by way of supplemental petition for recovery of a personal judgment. It will be noted that the personal judgment sought by respondent was for trust unlawfully expended by appellant.\n\nAppellant supports its contention by citing the following cases: Collins v. Denny Clay Co., 41 Wash. 136, 82 P. 1012; Bancock, Cornish \u0026 Co. v. Urguhart, 53 Wash. 168, 101 P. 713; Kimble Motor Car Co. v. Androw, 125 Wash. 225, 215 P. 340; Hoskins v. Smith, 133 Wash. 90, 233 P. 279, 43 A.L.R. 175; Rennie v. Washington Trust Co., 140 Wash. 472, 249 P. 992; Briggs v. Ronald Township, 208 Mich. 603, 176 N.W. 434; Burrows v. Johntz, 57 Kan. 778, 48 P. 27; Homer v. McCormick, 8 Kan. App. 333, 56 P. 1124; In re Jacob Berry \u0026 Co., 174 Fred. 409; Shonkweiler v. Harrington, 102 Neb. 710, 169 N.W. 258; and Arroyo-Colorado Nav. Dist. v. State Nat. Bank, 90 S.W. (2d) (Tex. Civ. App.) 881.\n\nOur attention is also called to the following statement of the rule in 65 C.J. 979, Trusts, § 904:\n\n\"As a general rule, where trust property has been diverted, and may still be traced, the cestui que trust has an election to either follow the res or to hold the trustee personally liable for the breach of trust; and if the cestui que trust has exercised his election, it is error to deny the relief sought and make a different election for him; but the cestui que trust is bound by an election one way or the other, and, although there is some authority to the contrary, it is usually held, unless the cestui has proceeded against the trustee personally before he knows that there is property into which the trust funds can be traced, that if the cestui que trust has first elected to hold the trustee personally liable, he cannot thereafter follow the res, while on the other hand, if he has first sought to follow the res, he cannot thereafter hold the trustee personally responsible. However, a previous suit, not to hold the trustee personally liable for breach of trust, but simply to establish the existence of the trust and the amount thereof, does not prevent the cestui que trust from following the trust property.\"\n\nIn Collins v. Denny Clay Co., supra, this court held:\n\n\". . . if the executor converted this stock, or wrongfully received dividends thereon which belonged to others he is liable in his individual and not in his representative capacity. This stock stood in the name of the decedent at the time of his death, and came into the hands of his executor as a part of his estate. Under such circumstances\n\nthe more equitable rule is that if the executor or administrator applies to the use of the estate money or the proceeds of property belonging to a third person, he is liable in both his individual and representative capacity, and the injured party may elect whether he will hold him in the one capacity or the other. Respondents elected to pursue the executor in his representative capacity, as they had a right to do; but having followed that course, they can only take such judgment as the law authorizes in such cases.\"\n\nThis holding was followed in Rennie v. Washington Trust Co., 140 Wash. 472, 249 P. 992. Those two cases related to the conversion of personal property.\n\nIn the Babcock was the court simply held that an election of remedies once made is irrevocable. In the Kimble Motor Car Co. case, we decided that the filing of a claim against an estate of a deceased person for the value of property sold on conditional sales contract waived the right to reclaim the property. In the Hoskins case it was held that an action for damages for fraud bars a subsequent suit to impress a trust upon the property fraudulently acquired. We have examined the other cases cited by appellant and find that they simply adhere to the general rules expressed by this court. None of the cases cited are applicable to the facts present in the case at bar.\n\nThe rule applicable to the present situation is stated in Title Ins. \u0026 Trust Co. v. Ingersoll, 158 Cal. 474, 111 P. 360. That case involved an action brought by a wife against her husband to recover property held in trust by him, the money being the separate property of the wife. The action was twofold: To recover the property in which the money had been invested, and for a money judgment for the balance. In passing, the court stated:\n\n\"The plaintiff had the right to allege the trust relation, the receipt of trust funds, the failure to account, and to recover in one action the specific property into which a portion of the fraud is traced, and a personal judgment for the remainder which cannot be identified. The beneficiary of a trust, of course, cannot have a judgment declaring the defendant a trustee of specific property bought with trust funds, and decreeing such property to be the property of\n\nthe beneficiary, and also a personal judgment for the money invested by the defendant in that property. So far as the trust fund is traced to specific property which the beneficiary elects to take, the part of the fund thus accounted for constitutes a credit on the general account and personal judgment can be given only for the balance. This was the course followed by the court. There is no objection to the practice of trying the entire case in one action, and no inconsistency in the claims of plaintiff, provided the account is thus separated and judgment is not twice given for the same money.\"\n\nRespondent instituted his action for the purpose of recovering trust funds that were then in the possession of the personal representative of the Brown estate. Later, by supplemental pleadings, he sought to recover from appellant that portion of the trust funds which he claimed had been expected by appellant. The allegations were sufficient to show that appellant had received certain property which belonged to the Smith-Brown trust, and that after so receiving the property a portion of it had been dissipated or expended for purposes foreign to the trust.\n\nAppellant cannot take trust funds after it has been sued for them, improperly expend those funds, and then hide behind the defense of election of remedies. A holding approving such procedure would be to invite fraud and render useless an action to recover trust property. In fact, there was no election of remedies. Respondent had two remedies: One to recover trust funds which were held by appellant; the other, to secure a judgment against appellant for that portion of the trust funds which had been improperly expended. He properly pursued both remedies.\n\nIt is next contended on behalf of appellant that it is released from any personal judgment because respondent released certain parties made defendants in the supplemental petition or complaint. Respondent's supplemental petition, portions of which we have already set out, sought a personal judgment against Mrs. Brown, Fred Brown, and attorneys Bonsted and Falknor, and appellant. May 24, 1940, respondents entered into a settlement agreement with all the parties just named with the exception of Mr. Bonsted.\n\nAppellant argues that the action was one in tort; that the defendants were joint tort-feasors; and that the release of Falknor and the Browns releases appellant. The rule with relation to the release of one joint tort-feasor and the effect of the release upon other joint tort-feasors is stated as follows in Richardson v. Pacific Power \u0026 Light Co., 11 Wash. 2d 288, 316, 118 P.2d 985:\n\n\"It is undoubtedly the rule in this state that the acceptance of a sum of money from one joint tort-feasor in satisfaction of a claim for damages, and the execution of a release of such joint tort-feasor from all damages by reason of the injuries inflicted, operate as a release of the other joint tort-feasor, even though the parties to the agreement stipulate that the release of one shall not discharge the other.\"\n\nSee, also, Larson v. Anderson, 108 Wash. 157, 182 P. 957, 6 A.L.R. 621.\n\nAppellant cites many authorities which hold that a trustee who wrongfully handles trust property commits a tort. Standing alone, the allegations contained in the supplemental petition might be construed as charging a tort. In this case, however, we must consider the pleadings as a whole, having taken into consideration the nature and extent of the litigation. Respondent sued to establish a trust, and in this he was successful. It then became his duty as a representative of the Smith estate to ascertain the amount of money and property turned over to Brown, and to locate the property and trace the funds and find their ultimate destination. His duty in this regard is stated in 65 C.J. 898, Trusts, § 793:\n\n\"The bill or petition for the accounting should set forth enough to make clear the grounds upon which jurisdiction is invoked; it should contain a clear and orderly statement of the facts relied upon as the ground for relief, in accordance with the general rules governing equity proceedings. The trustee should allege and show the condition of the fund when it came into his hands, what changes, if any, it has since undergone, what has been done with it, and the present amount and character of the assets. Thereupon it is competent for defendant to falsify complainant's statement, not only by direct of the allegations in the\n\ncomplaint, but by affirmative allegations, showing a disposition and present condition of the trust fund different from that which complainant insists upon.\"\n\nRespondent was faced with difficult and intricate problems in framing the allegations of the supplemental petition. He did no more than to allege facts additional to those in his original complaint, which advised the court concerning the situation surrounding the properties of the Smith-Brown trust. The settlement to which we will refer later in this opinion had only to do with the properties in the possession of Mrs. Brown and Fred Brown. The trial judge, in passing upon this question, very clearly stated proper reasons for his holding that there was no tort alleged or proved when he said:\n\n\"After that decision which found that there was a trust, the plaintiff filed some supplemental allegations, seeking to recover judgment against Mr. Bonsted and Mr. Falknor on the ground that their fees which were paid were trust funds, and that they were received knowing them to be trust funds. . . .\n\n\"Now, the gist of this entire matter still is -- the gist of the amended complaint and the supplemental complaint still is what? It is, What is trust property? Who has it? I want it and I'm going to get it if I can prove my case. That is still the gist of the plaintiff's position in this case. There is no question, in my opinion, of any tort at all. The substantiation of a trust is purely one of contract; it is not a tort at all; and whatever means or whatever allegations somebody employs to impress trust property and to recover trust property still it has its basis in contract, unless there is some fraud committed, and there is no evidence of fraud here.\"\n\nAll that respondent asked for was that the Smith-Brown funds be returned to him intact, less whatever sums were legitimately expended in taking care of the trust property.\n\nWe hold that the settlement made with Browns and Mr. Falknor did not in any way release appellant from accounting for all of the Smith-Brown trust funds and trust property.\n\nAppellant maintains that the trial court, in entering its decree, did not take into consideration evidence\n\nrelative to loans made by Mrs. Smith to Brown. The statement is made in appellant's briefs that, \"The conclusion that these loans were made is irresistible.\" It then contends that Tucker has only a general creditor's claim for $485,000, and that the expenses of administration have therefore a legal priority. The basis of this argument is Plaintiff's Exhibit 12, which reads:\n\n\"State of Washington\n\nCounty of Spokane\n\n\"Sarah E. Smith, being first duly sworn deposes and says: I have loaned R. B. Brown moneys in the aggregate of about $485,000.00. I have also entrusted him with moneys, securities and valuables to be kept in trust for me, and he has had the right to place the same in any bank or banks, or safe deposit vault as he saw fit. In loaning this money to him I reserved the right to receive from him such security for said loans as I might demand. . . . A certain deal including three lots in the Seattle Tide Lands was an accommodation deal. . . .\n\n\"SARAH E. SMITH.\n\nSubscribed and sworn to before me this 1st day of September, A.D., 1930.\n\n\"MILES F. EGBERS\n\nNotary Public in and for the State of Idaho, residing at Coeur d'Alene, Idaho; My commission expires on Feby. 7th, 1932.\"\n\nIt will be observed that the above exhibit was signed September 1, 1930. Exhibit 50 was signed October 24, 1930, and Exhibit 52 was signed November 8, 1930, the last two being set out in Tucker v. Brown, supra. All of these exhibits were considered by this court in reviewing the first trial. The contents of Exhibit 12 relate to a loan, as do the contents of Exhibit 52, and therefore add nothing to the contention that money was loaned by Mrs. Smith to Brown. We considered these alleged facts in the prior opinion, and there held adversely to appellant's contention that the money turned over to Brown was a loan. In speaking of the Smith-Brown performances, we stated:\n\n\"As a result of the transactions mentioned, it appears that Mrs. Smith had turned over to Mr. Brown all her\n\nmoney, securities, and property of every description.\" Tucker v. Brown, supra.\n\nWe hold that the question as to whether Mrs. Smith loaned money to Brown has been decided contrary to appellant's contention and cannot be again litigated.\n\nIn any event, appellant would not be in a position to complain if it should be admitted that money was loaned Brown by Mrs. Smith. Brown secured over one and one-half million dollars in money and bonds from Mrs. Smith, a great portion of which he used for various purposes which have not been identified. Brown did not keep a set of account books. All money he used was held in his own name, and if he did have any money of his own or money that was borrowed from Mrs. Smith, that money was commingled with the trust funds of which he made no accounting.\n\nIn such cases it is presumed that expenditures made by a trustee were from his own funds, and that the balance remaining is trust property.\n\n\"If the trustee mingles money belonging to the trust estate with his own funds, and then pays out some of the fund, it will be presumed that he did that which was lawful, and therefore made his payments out of his own portion of the fund. [Citing cases.]\" People's Nat. Bank v. Moore, 25 F. (2d) 599, 601.\n\nAccord: Republic Supply Co. v. Richfield Oil Co., 79 F. (2d) 375; Jarvis v. Hammons, 32 Ariz. 444, 259 P. 886; Brown v. Hammons, 32 Ariz. 456, 259 P. 890; Hammons v. National Surety Co., 36 Ariz. 459, 287 P. 292; Live Oak Cemetery Ass'n v. Adamson, 106 Cal. App. 783, 288 P. 29; Blackhurst v. Westerfeld, 111 Cal. App. 548, 295 P. 863; Glidden v. Gutelius, 96 Fla. 834, 119 So. 140, 120 So. 1; People ex rel. v. People's Bank \u0026 Trust Co., 353 Ill. 479, 187 N.E. 522, 89 A.L.R. 1328; General Motors Acceptance Corpo. v. Larson, 110 N.J. Eq. 305, 159 Atl. 819.\n\nAppellant asserts that the final decree of the trial court holding the real property held in Brown's name to be the property of the Smith-Brown trust was erroneous, because \"there was no written trust instrument of any\n\nnature signed by Brown,\" and respondent sought to establish a trust in those properties by parol evidence. Appellant states that there is no distinction \"between the establishment of a trust in real estate and tracing funds into real estate.\"\n\nThe following cases and authorities are among those cited to uphold appellant's argument: Farrell v. Mentzer, 102 Wash. 629, 174 P. 482; In re Weir's Estate, 134 Wash. 560, 236 P. 285; Pacheco v. Mello, 139 Wash. 566, 247 P. 927; Zioncheck v. Nadeau, 196 Wash. 33, 81 P.2d 811; In re Swartwood and Welcher Estates, 198 Wash. 557, 89 P.2d 203.\n\nThe cases correctly hold that an express trust in real estate cannot be established by parol evidence. However, none of them hold that trust funds cannot be traced into real estate by parol evidence. The question relative to the existence of an express trust is not before us. This court decided that question in Tucker v. Brown, supra.\n\nWe do have before us thate controversy relative to the tracing of trust funds into real property. What the trial court did was to allow a tracing of the trust funds into the real estate. In following trust funds, a court of equity will, so far as possible, aid the cestui que trust or his representative by indulging every reasonable presumption in his favor, and give consideration to every reasonable doubt. But, with all this advantage, the object of the pursuit must, in the end, in order to be charged upon or taken out of the fund, property, or estate in which it has been lodged, be definitely located therein.\n\nThe general rule is that the claimant of a trust must, in cases where the rights of creditors are affected, trace the fund by evidence that is clear and satisfactory (Rugger v. Hammond, 95 Wash. 85, 163 P. 408) and that, if he fails so to trace and identify the fund, his claim is that of a general creditor. Davis v. Shepard, 135 Wash. 124, 237 P. 21, 41 A.L.R. 163; In re Jordan's Estate, 171 Wash. 624, 18 P.2d 855.\n\nHowever, after the trust is proven and property and funds identified, the burden is on the trustee to account in\n\na satisfactory manner for the property and funds. 65 C.J. 904, Trusts, § 799. The rule last mentioned applies with full force to those funds and securities named in the order on the remittitur set out in this opinion.\n\nIt is true that most of the evidence relative to the ownership of the property held by Brown and later by his estate was shown by circumstantial evidence. However, circumstantial evidence may be used to establish any fact. It is not only sufficient, but in many cases, of which this is an example, it is the only proof which can be adduced. Abrams v. Seattle \u0026 Montana R. Co., 27 Wash. 507, 68 P. 78; Hinckley v. Shell v. Shell Co. of California, 127 Wash. 630, 221 P. 594; Nelson v. West Coast Dairy Co., 5 Wash. 2d 284, 105 P.2d 76, 130 A.L.R. 606; McFarland v. Commercial Boiler Works, 10 Wash. 2d 81, 116 P.2d 288; Vitalich v. Port of Seattle, ante p. 182, 146 P.2d 819. Circumstantial evidence often the most satisfactory in the ascertainment of any fact and is quite as conclusive in its convincing power as direct evidence. State v. Ito, 129 Wash. 402, 225 P. 63; State v. Bolen, 142 Wash. 653, 254 P. 445.\n\nIn Redfield v. Johnson, 159 Wash. 39, 291 P. 1077, it appeared that a trustee of funds used those funds to purchase real property. The question before this court was whether the trust funds could be followed into the real property. In passing upon the question, the court stated:\n\n\"And no rule is more fully recognized than the rule that a cestui que trust may follow trust funds wrongfully diverted through all its changes, and recover from any property into which it has gone.\"\n\n\"So long as the trust property can be traced and followed into other property into which it has been converted, it remains subject to the trust. The product or substitute has the nature of the original imparted to it.\" 4 Pomeroy's Equity Jurisprudence (5th ed.) 148, § 1058c.\n\nSee same authority, p. 102, § 1048, supra; Erie County v. Lamberton, 297 Pa. 406, 147 Atl. 86; Rednor v. First-Mechanics Nat. Bank of Trenton, 131 N.J. Eq. 141, 24 A.\n\n(2d) 850; Wendell P. Colton Co. v. New York \u0026 Cuba Mail S.S. Co., 27 F. (2d) 657;65 C.J. 963, Trusts, § 888.\n\nTrust funds or property do not lose their character by conversion into other funds, property, or investments. The basis of the claim is the right of property. The right of property remains in the cestui que trust regardless of the nature or character of the funds or property into which the trust funds have been converted. In tracing trust property,\n\n\"The court proceeds on the principle that the title has not been affected; that the true owner of the fund traced to the possession of another has the right to have it restored, not as a debt due and owing, but because it is his property wrongfully withheld from him; the equity, springing as it does from the right to trace the funds as property, . . .\" Northwest Lbr. Co. v. Scandinavian-American Bank, 132 Wash. 449, 231 P. 951.\n\n\"The right to follow trust property in equity being based on the theory that a right of property still exists in the cestui que trust, the equitable right of recovery or reclamation generally does not exist, or no trust or lien can be enforced, if the trust property cannot be identified, or traced into some specific fund or thing, which is sought to be charged, and into which the original trust property has gone in some form or other. The degree of identification required in an action between cestui and trustee is far less than that required where the rights of third persons are involved.\" 65 C.J. 965, Trusts, § 889.\n\nIt would be a dangerous precedent to lay down as law that a trustee could take trust funds, invest them in real property, and thereby defeat the trust. Courts of equity will not tolerate under any circumstance that a trustee shall so procure a profit or advantage through the acquirement of an interest in conflict with his fidelity as a trustee.\n\nThe court's action in allowing the funds to be traced into the real property by oral proof was entirely proper.\n\nThroughout the trial of this case, the respondent was faced with many difficult problems, chief of which was the ascertainment of the location of the funds and\n\nsecurities which Mrs. Smith had turned over to Brown. Prior to the first trial, his counsel spent a number of weeks inquiring at banks and trust companies in in this state and in Vancouver, Britist Columbia. Mr. Froude traveled to Montreal and Quebec, where he interviewed nearly one hundred fifty people. He then went to new York and made some investigation at banks and called on J.G. White \u0026 Co., bond salesmen. From New York he journeyed to Washington, D.C., and interviewed officials of the internal revenue department. He then visited banks, trust companies, and individuals in Chicago, Des Moines, Kansas City, Denver, Salt Lake, Sacramento, and San Francisco. In several of the places just mentioned, he received information concerning Brown's transactions in the selling of bonds and the purchase of stock for his farms in Yakima county and in Virginia.\n\nAfter the opinion in Tucker v. Brown, supra, was announced, respondent made further and more extensive investigations. From those investigations, respondent's counsel were able to piece together many of the activities of Brown, with the result that the stipulated evidence of one hundred eight witnesses was introduced. The witnesses produced records, and identified Brown's deposits in a large number of banks and trust companies, the sales of thousands of dollars worth of bonds which belonged to Mrs. Smith, and the purchase by him of the real property in this state and in Virginia and of personal property here and in eastern states.\n\nThe evidence also brought to light the bank accounts of Mrs. Smith. Brown had accounts in ten different banks, and had businesses relations with many others. His transactions with the National Bank of Commerce of Seattle were illustrative of his method of doing business. During the years 1931 to 1933, Brown left with the president of that bank numerous drafts and checks, drawn principally upon eastern and middle western banks, amounting to over $18,000; and during the same period of time he purchased cashiers' checks in the approximate amount of $40,790. The drafts and checks were expended at Brown's direction\n\nfor various purposes. Most of the cashiers' checks were split into two or more cashiers' checks, and these in turn were used by Brown to pay for his numerous investments.\n\nHe operated a store and woolen mills at Kirkland under the assumed names of National Supply Company and National Woolen Mills.\n\nMr. Edward Chabot, a certified public accountant, assembled the records produced by the many witnesses, and summarized them in some nineteen different schedules, which of course are too voluminous to recite in this opinion. A study of the record, aided by the schedules, proves that Brown received funds from Mrs. Smith which were deposited in his bank accounts, and that he sold her bonds and placed the proceeds thereof in these banks.\n\nMost of the bonds which he sold were traced by numbers which corresponded with the numbers on the bonds owned by Mrs. Smith. The record shows that he deposited in his various accounts checks from Mrs. Smith in the total sum of over $360,000. He made many cash deposits in banks, and paid cash for numerous cashiers' checks. When he purchased the land in Virginia, one payment was evidenced by the delivery to the seller of a ten-thousand-dollar bill issued by the United States.\n\nRespondent was able to identify many of the funds used to purchase the real and personal property secured by Brown and inventoried in the Brown estate and the Fred Brown guardianship as those of Mrs. Smith. An example of the tracing is shown by the following excerpt from the schedule of bond transactions, respondent's Exhibit 533:\n\n\"5/27/32 Sale of 3 1/2% Liberty bonds\n\nto J.G. White \u0026 Co.\n\n(Ex. 118) 40,000.00 40,780.00\n\nCheck to George Vanderveer, Seattle (Ex. 130) $2,500.00\n\nCheck to Whittlock, Indian Agent, Yakima\n\n(Ex. 131) as follows:\n\nApplied on SE 1/4 NW 1/4 and NE 1/4 SW 1/4\n\n26-11-17 (Items 6 and 7 R.B. Brown estate\n\ninventory) $6,345.90\n\nApplied on NE 1/4 NW 1/4 19-11-18\n\n(Item 15 R. B. Brown inventory) 2,716.30\n\nExcess payment (Stip. 25) 1.80\n\n$9,064.00\n\nCheck to Leigh Millikin and endorsed on\n\nback 'SE 1/4 SW 1/4 10, and NE 1/4\n\nNW 1/4 15-11-18' (Items 3 and 4 of\n\nFred Brown Guardianship) (Ex. 132) $5,000.00\n\nCheck to Mr. Reed, endorsed 'SW 1/4\n\nNW 1/4 17-11-18'\n\n(Ex. 133) (Item 13, R.B. Brown estate\n\ninventory) (Stip. 14) 3,000.00\n\nTraveler's checks to Brown (Ex. 135) 2,500.00\n\nCheck to Schwabacher Hardware Co.\n\n(Ex. 136) (Stip. 45) 3,905.98\n\nCheck to Nettleton Lumber Company (Stip. 70) 2,767.46\n\nUnknown 1,042.56\n\n$40,780.00\"\n\nWhen Brown became acquainted with Mrs. Smith in the latter part of the year 1928, he had no financial resources. The records in the office of the county clerk of Yakima county showed judgments against him aggregating over one hundred thousand dollars. His income tax return dated March 13, 1929, for the calendar year 1928, states:\n\n\"Did not make my expenses in cash. Made some trades but trades would not make up for losses I have had on land for the last few years.\"\n\nAnother exhibit, a petition filed by Brown and his wife with the Federal revenue department, shows that they were insolvent.\n\nAt the time he was negotiating for the purchase of the apartment hotels in Seattle during 1928, he told Mr. A. C. Schellenberger that \"he [Brown] was broke and that unless he got this deal through with Marcus Daly, it would be 'just too bad,'\" and that he was going after Mrs. Smith's fortune. Brown told several witnesses that he was looking after Mrs. Smith's property.\n\nAt the time Mrs. Brown was appointed administratrix of her husband's estate, she said that the estate was of little value, and in 1940 appellant alleged that \"from and after July, 1928, the said Reese b. Brown was wholly insolvent.\"\n\nFebruary 4, 1934, Mr. Bonsted received from the Yakima Abstract \u0026 Title Company a list of all real property in Yakima county standing in the name of R. B. Brown, Sadie Brown, and Fred Brown. That list showed that all of the\n\nproperty was deeded to brown subsequent to November 20, 1929.\n\nIn passing upon this phase of the case, the trial court said:\n\n\"In fact, there is not any real or personal property inventoried in this estate but what was acquired by Brown after he began handling Mrs. Smith's money and property as her trustee.\"\n\nAppellant has argued that insolvency does not prove that a man is without property. Such statement is true, of course, but no property belonging to Brown was ever brought to light in this litigation. Again we quote the trial court:\n\n\"It is unquestioned here that the trust company is successor trustee and, as a successor trustee, it has a duty to perform; and that duty, once a trust relationship is established, is for the successor trustee to proceed to determine just what is trust property and to account therefor. Now, the burden being on the plaintiff in this case to establish what property is trust property, I do not want to be understood in what I subsequently say that this burden shifts at any time, but there is or should be some effort upon the part of the trust company, if they are able to show in any respect that Brown had any property that belonged to him, to come forward with the proof; in other words, the trust company as successor has a duty to perform, but, if there was the slightest bit of property that belonged to Reese Brown, I feel that it was their duty to let us know about it and not merely sit still and say, 'Well, you prove it.' . . . Now, that is a significant fact to me, that it would be decidedly easy or should be -- perhaps not with a man of Reese Brown's habits of holding and disposing of property, may be it wasn't easy; but somewhere, somehow, there should have been some kind of a record that said, 'No, Mr. Plaintiff, you are wrong about this; Mr. Brown owned this and this and this prior to the time this trust relationship was established.' Now, that is an added circumstance to the court's conclusion, and which I do find in this case, that all of this money that is claimed by the plaintiff, these two items I have heretofore mentioned, the $545,000 and the $485,000, and all these bonds, as well, were turned over by Mrs. Smith to Brown in trust, coupled with the fact that nobody could ever tell use where Reese Brown had anything\n\nprior to the time he started throwing Mrs. Smith's money around and buying all of this property. So my conclusion is that he did get it, and we have traced enough of it so satisfy most anyone, except Mrs. Brown, Fred Brown, and some of Brown's creditors, perhaps, that he had nothing before and that he got it all from her.\"\n\nThe factual situation present in the case at bar is in some respects quite similar to the facts related in Mychel Co. v. Lashua, 124 Wash. 163, 213 P. 917. In that case, one Gardiner, who held mining claims in trust for another, sold them for $10,000. Gardiner died, and $8,160 was found in a San Francisco bank. The trial court found that the fund in the bank was the proceeds of the sale of the mining claim. In passing upon the sufficiency of the evidence to sustain the judgment of the trial court, we stated:\n\n\"The testimony shows that Gardiner was in financial difficulties to the extent that even his life insurance had been hypothecated; that he had made a contract for the sale of these claims for the sum of $10,000; that the deed showed that consideration; that the appellant, about the time the deed was made, deposited in the bank in San Francisco, far removed from the place of business of Gardiner, which was in Everett, in this state, and a bank in which he had never done business before, over $8,000, which was a large sum of money for Gardiner to be handling; that no other deposits had been made thereafter; that no withdrawals had been made, and that Gardiner had no other source of income from which this amount could have been realized. The trial court held that, under these facts and circumstances, the respondent had made out a prima facie case that this sum of money was the proceeds of the sale of the mining property and should be impressed with the trust which had been impressed upon the mining claims. The appellant introduced no evidence to overcome this prima facie case, and we are satisfied that the trial court was correct in thereupon entering the decree from which this appeal has been taken, and its action is therefore affirmed.\"\n\nAs we view the record, the court was entirely correct in its conclusions.\n\nThe evidence, direct and circumstantial, proved beyond any doubt whatever that all of the property of every kind\n\nand nature which was handled by Brown subsequent to the commencement of his business relations with Mrs. Smith in 1928 belonged to Mrs. Smith. We are equally well satisfied that all the assets which came into the possession of Mrs. Brown, Fred Brown, and appellant belonged to the Smith-Brown trust. The court's decree which determined that the property held by the Browns and appellants was that of the Smith-Brown trust will be affirmed.\n\nAppellant urges error on the part of the trial court in considering oral statements claimed to have been made by Mrs. Smith concerning gifts of property made to Brown to be held in trust for her. In the brief, we find the following statement:\n\n\"Even if it were true that Mrs. Smith had told a hundred people that she had given her property to Brown to hold in trust, neither she nor her estate would have any right to sue Brown or his estate and predicate the action upon her own oral statements.\"\n\nIn support of these contentions we have cited to us many decisions, including Allen v. Dillard, 15 Wash. 2d 35, 129 P.2d 813, and Doernbecher v. Mutual Life Ins. Co., 16 Wash. 2d 64, 132 P.2d 751. These cases state the proper rule to the effect that hearsay testimony and the repetition of self-serving declaration on the part of one since deceased, are inadmissible. Again, we must decline to discuss the question, for the reason that we have decided it in Tucker v. Brown, supra. Aside from that fact, we are satisfied that other evidence contained in the record proves conclusively that Mrs. Smith turned over all of her assets to brown to be held in trust for her.\n\nThe next question for consideration involves what is known as the Seattle tidelands property. The evidence relative to this transaction is quite definite. February 15, 1929, Mrs. Smith gave to C. J. Sims of Seattle a check for $30,000 which was used to purchase the property. Mr. Sims took title in his own name, thereafter transferring it to Mrs. Smith, who in turn deeded it to brown.\n\nFebruary 5, 1940, appellant filed a petition in the Brown estate for instructions relative to the disposition of the\n\ntidelands property. A hearing was had on the petition, and the court entered an order directing the transfer of the property to respondent, reserving, however, without prejudice, the rights and contentions of all the parties with reference thereto. After the property was convected to respondent, he sold it for $11,632.\n\nAppellant asserts that the tidelands property was not and never has been trust property, and that is is entitled to credit for the sale price as against respondent. The basis of the contention is the statement made by Mrs. Smith as contained in exhibit 12, already set out in this opinion. We have just decided that all of the property held by Brown and coming into the possession of appellant was trust property. That holding had reference to the tidelands property as well as to all other property. In this connection we again call attention to our holding in Tucker v. Brown, supra, in which it was said:\n\n\"As a result of the transactions mentioned, it appears that Mrs. Smith had turned over to Mr. Brown all her money, securities, and property of every description.\"\n\nThe trial court properly refused to credit appellant with the sale price of the tidelands property.\n\nAppellant presses upon us error of the trial court in not allowing credit for $41,696.36 paid by it to George F. Vanderveer and Samuel B. Bassett in satisfaction of a judgment held by them against Brown. The history surrounding the services of attorneys Vanderveer and Bassett for which the judgment was rendered may be summarized as follows:\n\nDuring 1929, Brown was having some difficulty with Federal Tax authorities relative to his income tax, and brought an action before the United states board of tax appeals (now the tax court) to have his tax redetermined. During the following year, the collector of internal revenue levied an assessment against Mrs. Smith for a deficiency tax aggregating several thousand dollars. She attempted to have the board of tax appeals review the action of the collector and in this action was represented by Mr. J.\n\nMarvin Haynes. Brown talked to Mr. Vanderveer about his and Mrs. Smith's appeals. However, Mr. Vanderveer did not represent Mrs. Smith before the appeal board, because he did not have a power of attorney as required by the Federal body. Mrs. Smith had been dead for more than one year prior to the time he started to render these services in the tax appeal case. He appeared for Brown and earned the fees for which the judgment was rendered against Brown.\n\nThe action was begun in King county, and thereafter judgment was rendered against Brown and wife on January 5, 1934. January 23, 1934, an abstract of the judgment was filed in Yakima county and became a lien against any real property owned by Brown. December 7, 1934, appellant presented a petition to the superior court of Yakima county, asking permission to dispose of the woolen mill and store in King county, giving as reasons therefor:\n\n\"That said woolen mill had not been operated by the decedent for approximately three years prior to his death, during all of which time, it had remained idle. That said property is deteriorating in value and is in need of some repair. That said decedent, in his lifetime, he had, and your petitioner, since its appointment, has maintained day and night watchmen to guard said property. That the insurance rates on said property are excessive; that the property is non-income-producing and that it is costing said estate approximately $400.00 per month to care for and maintain the same. That it will be for the advantage and benefit and best interests of the estate and of those interested therein that said real estate and the machinery and equipment therein installed, and the whole thereof, be sold, for the reasons aforesaid, and the proceeds applied to the payment of the judgment referred to hereinafter.\n\n\"That he said George F. Vanderveer and Samule B. Bassett, judgment creditors as aforesaid, threaten to proceed with a sale of said real estate, or portions thereof, to satisfy said judgment.\n\n\"That, in the opinion of your petitioner, it is for the best interest and advantage of said estate and of all persons interested therein that your petitioner be authorized and empowered to pay the aforesaid judgment of the said George F. Vanderveer and Samuel B. Bassett as a preferred\n\nclaim, said payment to be made out of any funds belonging to said estate, and that, for the purpose of acquiring the necessary funds with which to pay said judgment, your petitioner be authorized and empowered to sell, at private sale, the above mentioned woolen mill and the machinery and equipment therein installed, . . .\"\n\nThe record shows that respondent was notified by mail of the hearing upon the petition. The order authorizing the laws was entered December 18, 1934, and provided, inter alia:\n\n\"IT IS FURTHER ORDERED that said Guaranty Trust Company be and it is hereby authorized and empowered to apply the proceeds of said sales, or either of them, as well as any funds in its possession, irrespective of the source thereof, toward the payment and satisfaction of the above mentioned judgment of said George F. Vanderveer and Samuel B. Bassett; . . .\"\n\nThe order confirming the sale of the woolen mill was entered March 26, 1935, and the order confirming the sale of the Kirkland store property was entered March 29, 1935. The orders did not indicate the application of the proceeds of sale. A stipulation was signed by counsel for appellant and respondent which read:\n\n\"That WILMON TUCKER, as administrator with the will annexed of the Estate of Sarah E. Smith, deceased, has this day released and relieved the title to the lands and premises hereinafter described from the effect of the above entitled suit; to-wit: [property description]\n\n\"II. That the release of the fee title to said property from the effect of this litigation shall in no wise be held to prejudice any claim or demand that the plaintiff may have against the defendants, or any of them, and the purchaser shall not be required to see to the application of the proceeds of said sale, it being the intention of both parties that the lands should be sold at the present time to prevent waste to the estate of either Reese B. Brown, deceased, or Sarah E. Smith, deceased, whichever shall ultimately be entitled to receive the same.\n\n\"DATED this 16th day of April, 1935.\"\n\nOn the same day, respondent signed a release which read:\n\n\"KNOW ALL MEN BY THESE PRESENTS:\n\n\"That I, the undersigned, as Administrator with the Will annexed of the estate of Sarah E. Smith, deceased, for valuable consideration and in pursuance of the stipulation bearing even date herewith between myself and the GUARANTY TRUST COMPANY, a corporation, as Administrator de bonis non with the Will annexed of the Estate of Reese B. Brown, deceased, have released and by these presents do herby release the following described real property, situate in the County of King, State of Washington, and more particularly described as follows, to-wit: [property description] of and from the claim or lien and all right, either legal or equitable, of the said WILMON TUCKER, as administrator aforesaid, in and to said described real property and do hereby CONVEY and QUIT-CLAIM all my right, title estate and interest therein and thereto unto said GUARANTY TRUST COMPANY, a corporation of Yakima, Washington, as administrator aforesaid, and to its successors and assigns forever.\"\n\nDecember 15 , 1937, appellant filed its account current and report as administrator with the will annexed. In speaking of the judgment held by Vanderveer \u0026 Bassett, we find the following statement in the report:\n\n\"That at the time of the appointment of Guaranty Trust Company as administrator with the will annexed as aforesaid, the novae mentioned Vanderveer \u0026 Bassett had a lien upon all of the real property belonging to the estate of said decedent by virtue of their aforesaid judgment, and shortly thereafter issued special execution thereon and threatened to sell said real property. That for the purpose of avoiding the sale of said property at forced sale, the said administrator with the will annexed petitioned the court for authority to sell certain real property situate in the county of King, state of Washington, together with any and all personal property belonging to said estate, for the purpose of using the proceeds of said toward the satisfaction and discharge of the aforesaid judgment in favor of said Vanderveer \u0026 Bassett. That the above entitled court upon the hearing of said petition granted an order of sale of certain real property, situate in the county of King, together with personal property, whereupon said administrator proceeded with the sale of said real property and\n\ncertain personal property, and applied the proceeds thereof to the satisfaction and discharge of the aforesaid judgment of Vanderveer \u0026 Bassett, to the end that said judgment is now fully paid and satisfied and discharged of record.\"\n\nThe payments were shown to have been made made February 14, 1935. $5,000; March 1, 1935, $25,000; April 27, 1935, $11,696.36.\n\nRespondent made the following appearance:\n\n\" . . . herewith appear specially (and not generally) with reference to notice of hearing on report and account current and petition herein received by registered mail by the undersigned attorneys, and without taking specific exceptions or objections to any of the items of said account or any of the items referred to in said report and petition, or in any other interim account or report or petition filed or which may be filed herein, but expressly reserving the right to take exception to or objection to any such items upon the hearing of the final account and report herein, . . .\"\n\nJanuary 10, 1938, the court commissioner entered on order approving the account current and report of the administrator. Among other things, the order recited: \"That said account current and report be, and the same is hereby, in all things ratified, approved and confirmed; . . .\"\n\nAppellant bases its contention that it is not personally liable for payment of the judgment upon the following grounds: (1) That the attorneys' fees for which Vanderveer \u0026 Bassett brought their action were proper expenses of the trust; (2) that he judgment was not paid with trust funds, for the reason that the Kirkland property did not belong to the trust estate; (3) that the payment was agreed to by respondent; (4) that the appellant was not liable for obeying the order of the court; (5) that there was no proof of knowledge on the part of appellant; (6) that the court approved the expenditures upon the hearing of the account which reported payment of the judgment.\n\nUnder its first assignment, appellant argues that:\n\n\"If as the trial court held, Brown had no property and the same was all trust property of Mrs. Smith, manifestly\n\nthe legal services rendered were for thee said trust and for the cestui Mrs. Smith.\"\n\nThe conclusion sought by appellant does not follow from the facts. There is no evidence in this case that the acts of Brown in failing to pay his taxes were in any way chargeable to Mrs. Smith or were connected with the administration of the trust. It is well settled, as stated by counsel for appellant, that a trustee had the right and, at times it is his duty, to employ counsel to perform legal services for the trust. 65 C.J. 718, Trusts, § 583. However the litigation was Brown's, not Mrs. Smith's, and the legal services were for the sole purpose of keeping Brown out of further trouble and reducing his tax. Im this connection, the trial court said:\n\n\"Now, Mr. Vanderveer wasn't entitled to any judgment against Mrs. Smith. She was dead. What he had a right to do was to put in a claim against her estate, if he had any rights in the matter at all. That he did not do.\"\n\n\"Where a deed to a debtor conveys to him only a naked legal title, as a trustee for others, he takes under it no interest that can be seized under execution or attachment, nor can a judgment creditor have his claim satisfied out of property held in trust for another, no matter how completely his debtor may have exercised apparent ownership over it, unless it was on the faith of such ownership that the credit was given.\" 26 R.C.L. 1261, Trusts, § 109.\n\nThere was no evidence in this case that credit was given to Brown in the belief that he owned the property in his possession.\n\nThe general rule is that an administrator is a trustee of the estate funds. He is bound by the statute, Rem. Rev. Stat., § 1484 [P.C. § 9835], relative to the filing of claims, and cannot waive, as against the rights of heirs or creditors, any requirement of the statute. Ward v. Magaha, 71 Wash. 679, 129 P. 395; Seattle Nat. Bank v. Dickinson, 72 Wash. 403, 130 P. 372; , Walters v. Christensen, 191 Wash. 602, 71 P.2d 664.\n\nWe hold that the services rendered were neither for Mrs. Smith nor for the trust and were therefore not charge\n\nable to the trust estate, and in any event could not be allowed as against the Smith estate because no claim had been filed in that estate. It is not necessary to consider the question of ownership of the Kirkland property, because we have held that all of the property in Brown's name belonged to the Smith-Brown trust.\n\nWas the payment of the judgment agreed to by respondent? It is quite true that appellant petitioned the court for authority to sell the Kirkland property and apply the proceeds to the satisfaction of the judgment; that respondent was served with notice; that the failed to appear at the hearing upon the petition; that the court granted the petition and ordered the property sold and the proceeds of the sale applied to the satisfaction of the judgment. It is equally true that a claimant having a claim against an estate with notice cannot question a court order after having had proper notice.\n\nAppellant's representative knew that respondent was acting in a fiduciary capacity, as administrator of the estate of Mrs. Smith, and, as such, could not without permission of the superior court for King county, and after the claim had been filed and approved in the Smith estate proceeding, allow any of the assets of the Smith estate to be applied on a judgment against Brown. Respondent had permission from the King county court to agree to the sale of the property in order to preserve its value, but he did not have permission or authority to allow the proceeds of the sale to be applied to the payment of any obligation. Respondent, being unable to consent to the application of the proceeds, was not bound by the order.\n\nBut it is said that respondent consented to the payment of the judgment by the signing of the release or quitclaim deed. The fact of signing the deed was not sufficient to sustain the charge of consent by agreement, for the reason that the deed or release must be construed in connection with the stipulation of the parties signed on the same day. In giving total effect to the deed and stipulation, we must conclude that the deed or release did in no way affect any\n\nclaim or demand that respondent had against appellant as successor trustee.\n\nAppellant urges that it was an innocent holder of the trust property in that it had no knowledge of the existence of the trust or that the Kirkland property belonged to the trust estate. in support of its position, its counsel cite Restatement of Trusts, §§ 284, 296; 65 C.J. 988, Trusts, § 911: 4 Bogert on Trusts 2544, § 881; and 2 Scott on Trusts 1573, § 284. These authorities lay down the well-established rule that a purchaser who is ignorant of or has no reason to know of the trust, and who acquires the property for value, secures a good title which cannot be attacked by the cestui que trust.\n\nOn the other hand, it is well established that a purchaser with notice takes subject to the trust.\n\n\"A purchaser is chargeable with constructive notice of the trust, and of the trustee's breach, where he has knowledge of facts and circumstances, existing at the time of the purchase, such as would, or ought to , put a man of ordinary prudence upon inquiry and require him to make an investigation which would disclose the true title and authority of the trustee, but he fails to make such an investigation. However, if there is not a fraudulent or willful failure to ascertain the facts, a purchaser is not chargeable with constructive notice where he has no knowledge of facts sufficient to put a prudent man upon inquiry as to the existence of the trust; and he is chargeable with such notice only as to facts belonging to the subject of the inquiry and to the extent that the existence and nature of the trust would be discovered by the inquiry which he is put to by the facts he knows to exist at the time of the purchase. In making inquiry, it is ordinarily not sufficient for the purchaser to rely upon the statements of the trustee, but he must inquire of some one having no motive to misrepresent the facts.\" 65 C.J. 991, 992, trusts, § 917.\n\nIt must be pointed out, however, that appellant was not a purchaser for value. It was only a stakeholder, holding possession of the assets for the use and benefit of the one entitled to receive them, the administrator of the Smith estate, and therefore was not entitled to the benefit of the rule of law suggested by its counsel.\n\nBut, if it be conceded that appellant is entitled to the benefit of the rule for which it contends, and, applying the principle of law thus stated to the particular facts shown here, the question arises as to whether the appellant can claim to be an innocent holder without notice of the properties inventoried in the Brown estate. We are unable to hold that appellant was an innocent holder without notice.\n\nActual knowledge is not necessary. It is only required that a party be shown to have actual notice of the trust; and actual notice, as used in this relationship, does not necessarily mean actual notice of the fact itself, but simply notice of facts which would, or ought to. put him upon inquiry in reference to it. he is bound to follow any path which circumstances point to as a way to ascertain knowledge of the facts.\n\nIn the case of Knapp v. Bailey, 79 Maine 195, 9 Atl. 122, 1 Am. St. 295, the principle is so clearly stated, and its application seems so appropriate to the case under consideration, that we quote from it as follows:\n\n\"The doctrine of actual notice implied by circumstances (actual notice in the second degree) necessarily involves the rule that a purchaser before buying should clear up the doubts which apparently hang upon the title, by making due inquiry and investigation. If a party has knowledge of such facts as would lead a fair and prudent man, using ordinary caution, to make further inquiries, and he avoids the inquiry, he is chargeable with notice of the facts which by ordinary diligence he would have ascertained. He has no right to shut his eye as against the light before him. He does a wrong not to heed the 'signs and signals' seen by him. It may be well concluded that he is avoiding notice of that which he in reality believes or knows. Actual notice of facts which, to the mind of a prudent man, indicate notice -- is proof of notice.\"\n\nIn Wood v. Carpenter, 101 U.S. 135, 25 L. Ed. 807, Mr. Justice Swayne, writing the opinion of the court, quoted with approval the following from Kennedy v. Greene, 3 Myl. \u0026 K., 722:\n\n\"'Whatever is notice enough to excite attention and put the party on his guard and call for inquiry, is notice of\n\nevery thing to which such inquiry might have led. When a person has sufficient information to lead him to a fact, he shall be deemed conversant of it.\"\n\nCertainly, such facts as have been pointed out in this opinion in our discussion relative to the property identification and tracing of the trust funds were sufficient to put any cautious or prudent man upon inquiry. In this case, appellant had actual notice of the claim of trust, and there were sufficient definite facts known to appellant which proved or strongly indicated that the property belonged to the Smith-Brown trust.\n\nAppellant argues that the order of the court approving the current account of December 15, 1937, after actual notice to respondent, was conclusive and binding. The reason given for this stand is that the probate court had jurisdiction, and that its order, approving the account which reported the sale of the Kirkland property and the payment of the Vanderveer-Bassett judgment, was a final judgment and could not be attacked at the hearing upon the final report. The following cases are cited as upholding the argument: Bostock v. Brown, 198 Wash. 288, 88 P.2d 445; In re Rabie's Estate, 199 Wash. 207, 90 P.2d 1011; In re larson's Estate, 200 Wash. 318, 93 P.2d 431; In re Brown's Estate, 7 Wash. 2d 717, 110 P.2d 867; In re Robinson, 9 Wash. 2d 525, 115 P.2d 734; and In re Krueger's Estate, 11 Wash. 2d 329, 119 P.2d 312.\n\nThese cases hold that the superior courts sitting in probate are courts of general jurisdiction, including all matters in probate. That interim orders made during the course of probate after notice of the hearing are final in their nature and cannot be attacked or litigated at the hearing upon the final report. There can be no quarrel with the rules of law put forth by appellant. The only question is, Do they apply to the facts present in the case at bar?\n\nIn all cases, the facts present determine the rule of law which must be applied by the courts. In order to apply the law as announced in prior opinions, we must match the color of the facts in the case at hand against those spread\n\nout in the opinions, and, if the facts do not match, the opinions are of little aid in arriving at a conclusion.\n\nThe facts in the cited cases do not match those present in the case at bar. In the cases just mentioned, the claims were paid from estate funds, while here the judgment was paid not from estate funds, but from assets of the Smith-Brown trust. Did the probate court have jurisdiction to order the payment of the judgment from the trust funds which came into the hands of appellant? In this connection, we have in mind that the representative of Mrs. Smith's estate made a special appearance only, and entered into the stipulation regarding the Kirkland property that\n\n\". . . the release to such property from the effect of this litigation shall in no wise be held to prejudice any claim or demand that the plaintiff [respondent] may have against the defendant [appellant].\"\n\nJurisdiction of a court is said to depend upon various things -- for instance, upon proper service of process as provided by statute, and that the subject matter be one upon which the court is given authority by the constitution or has implied power to exercise judicial authority. Jurisdiction does not depend upon whether a judgment is correct or not, but rather upon the question of whether the court has the power to hear and determine the subject matter in controversy. State ex rel. Meyer v. Clifford, 78 Wash. 555, 139 P. 650; 21 C.J.S. 29, Courts, § 15.\n\nArt. IV, § 1, of our state constitution provides:\n\n\"The judicial power of the state shall be vested in the supreme court, superior courts, justices of the peace, and such inferior courts as the legislature may provide.\"\n\nSection 6 of the same article provides: \"The superior court shall have original jurisdiction . . . of all matters of probate, . . .\"\n\nRem. Rev. Stat., § 1371 [P.C. § 9929], states:\n\n\"The superior courts in the exercise of their jurisdiction of matters of probate shall have power to probate or refuse to probate wills, appoint administrators, executors and guardians of insane and incompetent persons and minors,\n\nand administer and settle all such estates, award processes and cause to come before them all persons whom they may deem it necessary to examine, and order and cause to be issued all such writs as may be proper or necessary, and do all things proper or incident to the exercise of such jurisdiction.\"\n\nThis court has in some thirty-seven cases passed upon questions involving the jurisdiction of superior court's sitting in probate. The following cases indicate the extent of the jurisdiction of our probate courts:\n\n\"In this state we have no probate court, properly speaking, as distinguished from the court that entertains jurisdiction of other matters. The court of general jurisdictions also hears and determines probate matters. Matters pertaining to probate are referred to what is called 'probate procedure,' as distinguished from what is denominated 'civil' or 'criminal procedure.' But when the court, sitting in a probate proceeding, discovers in a petition the statement of facts which forms the basis of a controversy, we see no reason why it may not settle the issues thereunder when an appearance has been made thereto, and then proceed to try it in a proper manner, as any other civil cause. The court may require the proceeding to be separately docketed, if, when the issues are formed, it appears to be such as should be thus docketed. Whether a citation should have issued on the strength of this petition or not, it is nevertheless true that appellant respondent to the citation, and appeared generally by demurrer to the petition, and asked its dismissal simply on the ground that the court could not hear it as a probate proceeding. We think it was not necessary to sustain the demurrer and dismiss the proceeding on that ground. But under our liberal practice as to the form of actions the petition could be treated as in the nature of a complaint. The issues could be framed thereunder, and the cause tried without requiring another statement of the same facts under some other form or name. If it developed that it was not properly a probate proceeding, it would not be treated as such. We think the court did not err in overruling the demurrer and in refusing to dismiss the petition.\" (Italics ours.) Filley v. Murphy, 30 Wash. 1, 70 P. 107.\n\n\"The contention that the court, in rendering the decree, erroneously determined who was entitled to the property\n\nas distributee upon distribution of the estate of Elsie Ostlund, goes only to the merits of the question then before the court, and is wholly foreign to the question of the jurisdiction of the court to determine who was entitled to the property then being distributed.\n\n\"Counsel for respondent calls our attention to § 1366 of Rem. \u0026 Bal. Code, which provides:\n\n\"'When a person dies seized of lands, tenements or hereditaments, or any right thereto or entitled to any interest therein in fee or for the life of another, his title shall vest immediately in his heirs or vises, subject to his debts, family allowance, expenses of administration and any other charges for which such real estate is liable under existing laws;'\n\nand, also, the case of Griffin v. Warburton, 23 Wash. 231, 62 P. 765, where it was held, under this section, that a formal decree of distribution was not necessary to vest title in the heirs or devisees of the deceased, and wherein the court said: 'As such a decree however neither creates their title nor their right of possession to the property a distribution made without it cannot be invalid.' This language was used in discussing the validity of a voluntary distribution of the property by the heirs among themselves. The argument of learned counsel seems to be that, since the decree of distribution does not create the title in the distributees, therefore, it can have no effect as an adjudication, if perchance, the court should therein erroneously determine who the distributees are. It is true the decree does not create the title in the distributees, but it is a solemn adjudication of who acquired the title of the deceased, and if rendered upon due process of law is final and conclusive upon that question. Its very object and purpose is to judicially determine who takes the property left by the deceased.\" In re Ostlund's Estate, 57 Wash. 359, 106 P. 1116.\n\nReferring to the quotation from the Ostlund case, it was said in Alaska Banking \u0026 Safe Deposit Co. v. Noyes, 64 Wash. 672, 117 P. 492:\n\n\"It was the purpose of the court in that case to forever set at rest the opinion, prevailing to some extent, that a probate proceeding was something of less importance than an ordinary civil action, and that a decree formally entered could be questioned by any one although a party, where, as in that as well as in this case, it was thereafter believed\n\nto have been entered upon a mistake of fact or an erroneous conception of the law.\"\n\n\"It is next insisted that the trial court was without jurisdiction to hear the controversy upon its merits, and that this court is likewise without such jurisdiction, for the reasons stated in the motion to quash the citation. But a citation in a probate proceeding is only a means of giving a party notice of the pendency of adversary proceedings, and service thereof is waived by a voluntary appearance of such party. While the respondent in this jurisdiction of at first appear specially and of subject to the jurisdiction of the court because of defects in the citation, he also, when his special appearance was overruled, demurred generally to the petition without saving his special appearance. This was a general appearance, and waived any right thereafter to claim want of jurisdiction over his person, or want of regularity in the citation.\" In re Martin's Estate, 82 Wash. 226, 144 P. 42. (Italics ours.)\n\n\"Under the constitution, the superior court is a court of general jurisdiction. It has jurisdiction of equity cases, actions at law, and proceedings in probate. . . . The constitution does not make the superior courts probate courts. On the contrary, it makes them courts of general jurisdiction including 'all matters of probate.' As a court of general jurisdiction, it has the power to construe wills at the suit of proper parties.\" Bayer v. Bayer, 83 Wash. 430, 145 P. 433.\n\n\"Contrary to the contention of respondent, this is not a will contest nor a claim against the estate upon a money demand. Perkins v. Allen, 133 Wash. 455, 234 P. 25; McCullough v. McCullough, 153 Wash. 625, 280 P. 70.\n\n\"In the last cited case, we held that an action to enforce specific performance of an oral agreement to make a will is in the nature of recovery of property impressed with a trust, and not a contest of the will probated; and that Rem.Rev. Stat., § 1385, barring any contest of a will six months after notice, has no application. We also held that it was not necessary to file a claim in probate under the statute of non-claim, as a condition precedent to an action against executors to enforce specific performance of an oral agreement to make a will.\n\n\"Contrary, also, to a contention of respondent, an action like this is as much an action in equity to enforce such a contract as if brought separately and independently in some\n\nother proceeding than the probate matter. All adversaries brought in may have complete relief. It has long been held that a superior court sitting in probate may settle issues and try the case as in any other civil cause, in this state.\" In re Krause's Estate, 173 Wash. 1, 21 P.2d 268.\n\nAccord: State ex rel. Keasal v. Superior Court, 76 Wash. 291, 136 P. 147; Meeker v. Waddle, 83 Wash. 628, 145 P. 967; State ex rel. Neal v. Kauffman, 86 Wash. 172, 149 P. 656; In re Babcock's EState, 112 Wash. 556, 192 P. 939; In re Wren's EState, 163 Wash. 65, 299 P. 972; In re Kelley, 193 Wash. 109, 74 P.2d 904; Golden v. McGill, 3 Wash. 2d 708, 102 P. 219; In re Iver's Estate, 4 Wash. 2d 477, 104 P.2d 467; Tacoma Sav. \u0026 Loan Ass'n v. Nadham, 14 Wash. 2d 576, 128 P.2d 982.\n\nFrom these cases, we find the rule to be that the superior court sitting in probate has the power to determine all controversies relative to the properties or interest of the estate or of the heirs or creditors, whether those controversies relate to civil, equity, or strictly probate cases. Further, that anyone responding by a general appearance in obedience to a legal notice or citation to appear cannot question the jurisdiction of the probate court even though he might be entitled to wage an independent action.\n\nThe probate court has no jurisdiction to try title to real estate as between the executor of an estate and the husband of the deceased. The law is stated as follows:\n\n\"In the case at bar, the person claiming adversely to the estate was the husband of the deceased party, and it appears that this fact was thought to affect the question. We, however, do not think so. For while it is true that the probate court has jurisdiction to determine the claims to property as between those interested in the estate, this authority only goes to the extent of determining their relative interests as derived from the estate, and not to an interest claimed adversely thereto. In the case before us the husband, though interested in the estate of his deceased wife, was, so far as the claim he was attempting to assert, an entire stranger thereto.\" Stewart v. Lohr, 1 Wash. 341, 25 P. 457, cited in Christianson v. King County, 239 U.S. 356, 60 L. Ed. 327, 36 S. Ct. 114.\n\n\"The respondent renews here the objection which he made in the trial court that the controversy over the title to the property between the parties to this appeal could not be litigated in the probate proceeding. This objection must be sustained. This is a controversy between outside parties which in no way affects the interests of the estate itself. In re Gorkow's Estate, 28 Wash. 65, 68 P. 174, a similar question was presented. In that case a legatee had contracted with a firm of attorneys that she would pay them the sum of $500 when they should obtain for her a certain legacy contained in the will of Rudolph Gorkow. By the contract, the $500 was to be paid out of the legacy when collected. In due time, the right to the legacy was established and, with the exception of $500, was paid to the legatee, who refused to recognize the rights of the attorneys whom she had employed. The attorneys filed a petition in the probate proceeding asking that the $500 be paid to them. The legatee objected to the question being litigated in that proceeding because it was a matter which in no way affected the interests of the estate. The objection was sustained, and the court, in the course of the opinion, said:\n\n\"'No powers are given to the court in its probate jurisdiction to hear and determine controversies between third persons which in no way affect the interests of the estate itself. It is constituted a tribunal to guard the interests of the estate only, and its powers cannot be invoked to determine outside controversies, the result of which can in no way affect the estate, either adversely or favorably. . . .'\n\n\"The rule of that case is recognized in the case of State ex rel. Keasal v. Superior Court, 76 Wash. 291, 136 P. 147, where it is referred to and distinguished.\" In re Decker's Estate, 105 Wash. 221, 177 P. 718.\n\nA decree of distribution, following the terms of a void attempt to devise land not owned by the administratrix, does not create a title, and is not binding on the owner who had no personal notice of, and made no appearance in, the proceeding.\n\n\"Nor did the decree of distribution in her estate create a title. Kempf v. Michelbach, 115 Wash. 193, 196 P. 661; In re ostlund's Estate, 57 Wash. 359, 106 P. 1116, 135 Am. St. 990. The function of a decree of distribution is to declare\n\nthe title which accrues under the law of descents, or under the provisions of a will. Here, as to the property involved in this action, upon the death of Rosannah Parr, no title or interest accrued by either of those means. Nor was George W. Parr bound or estopped by the terms and provisions of her will nor of the decree of distribution in her estate. He entered no appearance in, nor did he have any personal notice of those proceedings. The terms of a will or a decree of a court in administering an estate cannot thus deprive a third person of his property.\" Parr v. Davison, 146 Wash. 354, 262 P. 959.\n\nThe superior court sitting in probate has no jurisdiction to try the title to property, but the court does have power to determine the fact whether or not property in dispute belongs to an estate as an asset thereof or for the purpose of inclusion in the inventory.\n\n\"Where a person dies possessed of trust funds, such funds do not, by reason of the death of the trustee, become liable for the debts of his estate. The relation of the cestui que trust is not changed. The property still belongs to him. While the administrator is no doubt entitled to the possession of the trust funds, he is liable to account therefor to his principal either in his individual or representative capacity. De Valengin's Admrs. v. Duffy, 14 Pet. 282. He is not bound to proceed in the execution of the trust, but must preserve the fund for those entitled thereto. 2 Woerner, American Law of Administration (2d ed.) § 321. It has been held that an inventory is not conclusive as to the decedent's ownership of the property, either against a third person or against an executor or administrator. Lamme v. Dodson, 4 Mont. 560 (2 P. 298); Anthony v. Chapman, 65 Cal. 73 (2 P. 889); Baker v. Brickell, 87 Cal. 329 (25 P. 489, 1067); Fulcher V. Mandell, 83 Ga. 715 (10 S.E. 582); Stewart's Estate, 137 Pa. St. 175 (20 Atl. 554); White v. Shepperd, 16 Tex. 163. If the filing of an inventory is not conclusive against the claim of an administrator to property therein contained, certainly where the administrator comes into possession of property, and refuses to inventory it upon the claim that it does not belong to the estate, but belongs to some third person or to himself, no estoppel as to the title can be pleaded simply because, as in this case, the property was received in a representative capacity.\" In re Belt's Estate, 29 Wash. 535, 70 P. 74, 92 Am. St. 916.\n\n\"If appellant is the equitable owner of land the title to which was in the deceased, he has a right to his property without regard to administration. Where land is paid for with the funds of one person and title thereto is taken in the name of another, a resulting trust in such property may be established, and if established, enforced by the person whose money is thus applied, or, after his death by his heirs. Reese v. Murnan, 5 Wash. 373, 31 P. 1027.\n\n\" Where a person dies posses of trust funds, such funds do not, by reason of the death of the trustee, become liable for the debts of his estate. The relation of the centui que trust is not changed. The property still belongs to him. While the administrator is not doubt entitled to the possession of the trust funds, he is liable to account therefor to his principal either in his individual or representative capacity.. . . He is not bound to proceed in the execution of the trust, but must preserve the fund for those entitled thereto.' In re Belt's Estate, 29 Wash. 535, 70 P. 74, 92 Am. St. 916.\n\n\"The last cited case is also authority to the effect that the superior court, sitting in probate, had no jurisdiction to determine the title of third parties claiming the fund; that it has jurisdiction to determine prima facie the fact whether or not the property belongs to the estate and is an asset thereof. Such adjudication is not binding upon any person afterwards claiming the property in another forum, but is for the purpose only of determining whether the administrator shall bre forced to make an inventory thereof.\" Lew You Ying v. Lew Kay, 174 Wash. 83, 24 P.2d 596. (Italics ours.)\n\nSee, also, In re Williamson, 75 Wash. 353, 134 P. 1066; Scott v. Stanley, 149 Wash. 29, 270 P. 110; Perkins v. Allen, 133 Wash. 455, 234 P. 25; McCullough v. McCullough, 153 Wash. 625, 280 P. 70; De Valengin v. Duffy, 39 U.S. (14 Pet.) 282, 10 L. Ed. 457; In re Jacobsen's Estate, 178 misc. 479, 35 N.Y.S (2d) 40; State ex rel. Karrenbrock v. Mississippi Valley Trust Co., 209 Mo. 472, 108 S.W. 97; 26 R.C.L. 1260, Trust, § 109.\n\nSpeaking directly on the question of the jurisdiction of the probate court in its relation to trust estates, Judge Dunbar stated in Smith v. Smith, 15 Wash. 239, 46 P. 249:\n\n\" . . . for there is no case which goes to the extent of holding that where the decedent was himself a trustee of the property devised, either his executor or trustee, by whatever name he might be called, or the property so held in trust, would be subject to the jurisdiction of a probate court.\"\n\nIn Moore v. Kirkman, 19 Wash. 605, 54 P. 24, it is held:\n\n\" . . . Where trustees of the property of an estate, instead of executors, have been appointed by a will, the probate court has no jurisdiction of questions involving their management of the estate, but the same are cognizable in equity.\"\n\nSee, also, Schubach v. redelsheimer, 92 Wash. 124, 158 P. 739; In re Megrath's Estate, 142 Wash. 324, 253 P. 455, 256 P. 503; In re Krueger's Estate, 180 Wash. 165, 39 P.2d 381; Jones v. Peabody, 182 Wash. 148, 45 P.2d 915, 100 A.L.R. 64.\n\nIt is true that these cases refer to those trustees named in will. However, we are unable to ascertain any essential difference in the power of the probate court to assume jurisdiction in trust estates, regardless of how the trusts are created. In the cited cases, the trusts were created by wills. Here the trust was created by contract between the parties. In neither event does the probate court have jurisdiction of the trust estate.\n\nThe cases to which we have referred lay down the rule that trust funds in the possession of a trustee do not change their character, but remain in the ownership of the trust; that the owner has the right to property, regardless of administration. Further,that the superior court sitting in probate has no power to determine title to the property, nor subject it to the debts or obligations of the deceased trustee, nor may the trust funds be used to pay any of the expenses of probate.\n\nIt is true that, in In re Brown's Estate, supra, we held that the probate court had jurisdiction to determine whether or not the trust fund should be charged with the expense incident to the litigation and accounting in the case of Tucker v. Brown. In that case, however, the representative\n\nof the Smith estate made a general appearance and contested the request of appellant, which brought him within the rule laid down in the first series of cases just cited.\n\nIn this case, the property inventoried in the Reese B. Brown estate belonged to the Smith-Brown trust, which trust constituted an outside party claiming no interest in the estate being probated. The court ordered respondent to show cause why the trust fund should not be used to pay the Vanderveer judgment. Respondent made a special appearance and objected to all of the items of the account. In so doing, he did not subject himself to the jurisdiction of the probate court, and was not bound by its order approving the interim accounts. We hold that the probate court did not have jurisdiction to order the Kirkland property sold for the purpose of satisfying the Vanderveer-Bassett judgment; further, that it did not have jurisdiction to determine the question of the application of the proceeds of the sale at the hearing had December 15, 1937.\n\nAppellant, Bonsted \u0026 Nichoson, and Cheney \u0026 Hutcheson take the position that the court was in error in disallowing, as a charge against the funds in the possession of appellant, certain allowances for compensation and attorneys' fees. Inasmuch as the errors of law complained of by appellant and its counsel are almost entirely alike, we shall discuss them together.\n\nFor a complete understanding of the issues involved in the controversy over the allowance of fees, costs, and expenses, and as the basis for decision, it is necessary to relate some of the various incidents attendant upon the activities of appellant and its attorneys.\n\nMrs. Smith's body was cremated in Montreal during the month of July, 1932. Her ashes, the death certificate, and certificate of cremation were delivered to Brown, who brought them to his home at Brownstown, near Yakima, where they were retained in a bureau drawer. The ashes and certificates were delivered to Mr. Bonsted, attorney for appellant, in February, 1934, by Fred Brown. During the same month, Wilmon Tucker was appointed\n\nguardian of Mrs. Smith, an incompetent person. In June of the same year, he was appointed trustee of the property of Sarah E. Smith, an absentee, and thereafter gave notice as provided by Rem Rev. Stat., § 1715-1 [P.C. § 9776]. The notice was published in several papers, including one in Yakima county, and read as follows:\n\n\" . . . a request is hereby made that any and all persons having information or knowledge concerning the said Sarah E. Smith or her whereabouts, shall advise this Court, of any and all facts relating thereto within their knowledge; such information may be disclosed either by personal interview with the Presiding Judge of the above entitled Court or the Judge presiding over the Probate Department thereof or by written communication addressed to 'The Judge of the Probate Department of the Superior Court of King County, State of Washington, Seattle, Washington.'\"\n\nThe information contained in the notice came to the attention of Mrs. Brown and appellant.\n\nJune 11, 1934, appellant filed a supplemental report and final account in which it was stated:\n\n\"That subsequent to the preparation and prior to the filing of said first and final account and petition for discharge, to-wit, on June 8, 1934, your petitioner was served with a copy of a summons and complaint in an action in the Superior Court of the State of Washington, for King County, entitled as follows:\n\n\"'SARAH E. SMITH, by WILMON TUCKER as GUARDIAN of the Person and Estate of SARAH E. SMITH, an Incompetent Person, and as Trustee of the Property of SARAH E. SMITH, an Absentee from the State of Washington,\n\nPlaintiff,\n\n-vs-\n\nSADIE R. BROWN, FRED R. BROWN, a MINOR, and SADIE R. BROWN, as GUARDIAN of the Person and Estate of FRED R. BROWN, a Minor, and GUARANTY TRUST CO. a corporation, as Administrator of the Estate of REESE B. BROWN, Deceased, and SADIE R. BROWN, as Executrix of the Estate of REESE B. BROWN, Deceased,\n\nDefendants.'\n\nthe gist of which action is that all of the property disclosed by the inventories filed in the above entitled estate is the property of one Sarah E. Smith, and prays for a decree that said Sarah E. smith be adjudged to be the owner of all of said Sarah E. Smith be adjudged to be the owner of all of said property and that defendants, and each of them, be restrained and enjoined from selling, transferring, encumbering or in any way disposing of any of the property and particularly that your petitioner be restrained and enjoined from selling, transferring, encumbering or in any way disposing of any of the property coming or to come into its hands or under its control as administrator of the estate of Reese B. Brown, deceased.\"\n\nIt has never been explained why the court was not notified of the fact of Mrs. Smith's death. At the time the report was made and filed, her ashes and the certificates were in the office of counsel for appellant.\n\nThe ashes and certificates were delivered June 22, 1934, at the time a hearing was being conducted on the report of appellant, to attorney Reba J. Hurn of the Spokane bar, who representing Mrs. Brown in relation to a claim against the Brown estate. Upon receiving the articles, attorney Huron promptly delivered them to Mr. Rummens, counsel for respondent, who, evidently much surprised by the news of Mrs. Smith's death, stated, \"I came into court with a client -- I have nothing but ashes.\"\n\nIn its answer to the action instituted by respondent, appellant denied the trust and claimed that Mrs. Smith gave her property to Brown. Appellant refused to cooperate when, as will be shown later in this opinion, respondent secured the surrender of all the property held by Mrs. Brown and her son, Fred. Appellant refused to cooperate at a time when respondent had an opportunity to sell the Brown ranch properties.\n\nThe two trials consumed many weeks in the superior court. The trust company's brief on the first appeal consisted of 410 pages, and its briefs presented in this appeal are 783 pages in length. The transcript has 1688 pages. We have, in addition, 680 exhibits, many of which contain numerous items. During the trial, in their briefs, and in their arguments to this court, counsel with marked ability\n\ncontested every effort made by respondent to establish the trust and to secure an accounting after the trust had been established and an accounting ordered. In this appeal, as shown by the numerous questions raised, appellant has attempted to relitigate most of the questions considered and decided by this court in Tucker v. Brown, supra.\n\nThe attitude of the trust company is made manifest by the following testimony of Mr. Boyle, is trust officer, given in November, 1939:\n\n\" Q. Of course, you knew during the trial and the preparation of the case for the Supreme Court and the presentation of the case in the Supreme Court that Falknor and Bonsted's firm were working together on it? A. I did. Q. And that they were doing everything they could to retain the property or to defeat the Tucker claim? A. And retain the property for the Brown heirs. Q. And retain the property for the Brown heirs, and nothing that you know of was ever produced in Court by either of those attorneys that would be helpful to the Smith heirs? A. That is quite difficult to answer, Mr. Gallagher. I was not at the trial, but I assume they were out primarily to protect the Brown interest. Q. That is right, and oppose the Smith? A. And oppose the Smith, yes. Q. That is right. Of course, their activity in that regard was manifested very early in the case, wasn't it, in the preparation of the case? A. Certainly. Q. And followed all through the case? A. Followed clear through to the final decree.\n\n\"Q. Now, at the present time we have a judgment which provides that Reese Brown in his lifetime received in trust for Sarah Smith a large amount of money -- I hate to keep mentioning this million six hundred thousand dollars; have you taken any steps or made any investigation to determine whether or not that money has been trasmuted or traced into the present assets that you now have? A. No. . . . Q. Assuming that it can be demonstrated from a mathematical certainty that every dollar's worth of property you have got up there was paid for with the property of Mrs. Smith, would you still want to retain the management of that property, or would you want to turn it back to us? A. If it is established -- MR. BONSTED: (Interposing) I don't think he should be called upon to answer such a question. MR. GALLAGHER: I want to know what his attitude is going to be. It is very material to us what his\n\nattitude is going to be, the attitude of the Trust Company. They have possession of this property, and it is ours, and I want to know how long we are going to have to litigate to try to get it back, and I want his attitude, then, as a basis for another question. MR. BONSTED: I will answer it for him, that they will hold onto the property until the estate is closed. MR. GALLAGHER: Until the Reese Brown Estate is closed? MR. BONSTED: Until the estate is closed by proper probate proceedings. MR. GALLAGHER: Even though your records show that this property you are now claiming as assets of the Reese Brown Estate was actually paid for with these trust funds? MR. BONSTED: Yes, sir. MR. GALLAGHER: And you don't intend to yield up possession of them until you have closed the Brown Estate? MR. BONSTED: Absolutely not. Q. Do you concur in that, Mr. Boyle? A. He has answered it for me, and we will follow his advice. Q. You are going to follow his advice? A. Yes.\"\n\nAppellant has never in any of this extensive litigation attempted to serve the two parties. It services were at all times in aid of the Reese B. Brown estate. The trial court, in a comprehensive statement, demonstrated appellant's stand on all the issues of this case:\n\n\"THE COURT: I think the difficulty with the Trust Company's position is purely and simply this, . . . they chose to occupy inconsistent positions. . . .\n\n\"They at all times purported to act for the estate of Reese B. Brown, never did concede that there was any trust relationship ever existing, and all of the acts that they have done must be considered as having been done on behalf of the estate of Reese B. Brown. . . .\n\n\"They had at all times denied that there was a trust and it wasn't until the Supreme Court said there was a trust that anybody would ever admit it. Now, they at all times continued to act as administrator for Mr. Brown; denied the trust. Everything that the Trust Company did was on behalf of the estate of Reese B. Brown. Now, I don't think that statement can be controverted, . . .\"\n\nCharacterizing the trial court's decree an \"outrageous judgment,\" counsel for appellant Guaranty Trust Company have argued a great length the question of the allowance\n\nof costs, fees, and expenses in the defense of the action of Tucker against Brown. They state:\n\n\"The principal question in this case is simply this: Is it to be the law of this state that an administrator must cravenly abdicate his duties as such and submit to any claims filed against the estate, without a court adjudication thereof, upon penalty of being held personally liable if he does not successfully defend the suit? Is it to be the duty of an administrator to resign whenever anyone files a claim to the inventoried property? Is it to be the brave new American doctrine that an officer of the court must either resign and flee like a coward in dereliction of his duty -- or else be mulcted in damages and required to personally guarantee the ultimate correctness of his attorney's advice? Must an administrator be an insurer of the successful outcome of any contested lawsuit which he defends?\"\n\nCounsel's criticism of the judgment is without any foundation.\n\nThe eminent trial judge gave every attention to the numerous details of the long and tedious trial, and allowed counsel every opportunity to submit any and all evidence they desired to introduce. At the close of the hearing, he made a learned summation of the evidence and the law applicable thereto. His judgment reflected a keen knowledge of the facts presented and the equitable principles applying to those facts.\n\nTheir argument includes a statement of the situation which faced appellant when it took over the assets of the Brown estate for the purposes of administration. We mention the principal facts as contended for by appellant: It had no knowledge then and none now of any facts justifying the conclusion that any property in the possession of the Brown estate was owned by the Smith-Brown trust. Appellant's counsel state that no one expected or reasonably would have anticipated that appellant would deliver the valuable property to respondent in response to his rejected claim until the court should adjudicate that there was no valid gift, that the action was not barred by the statute of limitations, that a valid trust existed, and that\n\nTucker had succeeded in proving that all or a definite part of the property belonged to the trust; that appellant and its attorneys acted in entire good faith and had reasonable grounds to contest the Tucker suit. That the superior court judge trying the fist case gave the matter very fair and careful consideration and, after seeing and hearing the witnesses, decided that there was a valid gift and there was not a valid trust; that appellant had every reason to believe that there was a valid gift, as shown by the exhibits 50 and 52, and that this court, in Tucker v. Brown, supra, did not adjudicate that any specific property was held in trust. Counsel then point out that none of the property, real or personal, inventoried in the Brown estate, had ever been owned by Mrs. Smith.\n\nBased upon these facts and contentions and those which we will mention in describing Mr. Bonsted's activities, counsel earnestly contend that the costs and expenses of defending the case of Tucker v. Brown and the fees for the attorneys conducting the defense should be allowed and paid from the funds now in the possession of appellant.\n\nOn the other hand, respondent contends that neither appellant nor its attorneys are entitled to any compensation from the trust funds. He bases his contention on the attitude and conduct of appellant throughout the extended period of this litigation in denying the trust and expending large sums of money for purposes foreign to the trust. Respondent's attorneys state:\n\n\"The record in this case does not justify the Court's tolerant treatment of the acts of the Guaranty Trust Company, and the allowance of generous compensation to the Trust Company, after its continued repudiation of the trust and eight years of litigation against the appellant, is wholly unwarranted. It is entitled to no sympathy. It deliberately and wilfully assumed an attitude hostile to the trust and persisted in following that attitude after repeated demands for the return of the trust property and after it had in its possession facts conclusively demonstrating that the property was appellant's trust property. . . .\n\n\"Its entire attitude from the beginning to the end of this case can produce only one result in an unprejudiced\n\nmind, and that is, that regardless of the merits of appellant's claim and regardless of the duties imposed upon it by law, it had determined to secure this entire estate for the benefit of itself and its attorneys in fees, and the Browns.\"\n\nThe same contention is made in regard to the activities and conduct of the attorneys for appellant.\n\nMr. Bonsted had been acting for Brown in certain matters prior to the time of his death, and was asked by Mrs. Brown to represent her and her husband's estate. At the time, it was not known that a will was in existence, so Mrs. Brown, represented by Mr. Bonsted, was appointed as administratrix of her husband's estate. Counsel ascertained in a short time that Brown was occupying a ranch in Yakima county upon which there were a great number of registered cattle and horses; also that Brown had a woolen mill and a general store in Kirkland. Mr. Bonsted had searches made in the auditor's offices of Yakima and King counties to ascertain the extent of Brown's holdings.\n\nShortly after her appointment, Mrs. Brown found that she was unable to handle the business of the estate, and asked to be relieved and that the Guaranty Trust Company be appointed in her stead. The court agreed, and the company succeeded Mrs. Brown.\n\nThe properties were varied in character and location, so that it was necessary to make inventories in separate sections. This required considerable work.\n\nShortly after the appointment of appellant, Fred Brown delivered documents known in this litigation as exhibits 50 and 52 to attorney Bonsted. Mr. Bonsted was advised that Fred Brown had found these instruments in a secret compartment in Brown's desk located at his home in Seattle. Feeling that the documents evidenced a gift of a large amount of property from Mrs. Smith to Brown, Mr. Bonsted began an extensive investigation to find out the extent of the funds or properties that might have been given to Brown. He made a trip to vancouver, British Columbia, where he secured some information concerning the execution of the exhibits. After his trip to Canada,\n\nMr. Bonsted received a letter from a man named Kresge of Kansas City who had been at Yakima at the time of Brown's funeral and had made some statements relative to Mr. Brown's business. Bonsted was then requested by appellant to make a trip east for the purpose of investigating the facts concerning the death of Mrs. Smith and those concerning the execution of the exhibits 50 and 52, and also for the purpose of interviewing Kresge. Bonsted then made a trip east, visiting the cities of Chicago, Montreal and Thorold, Canada, New York City, Washington, D.C., Tazewell, Virginia, Kansas City, Missouri, and Des Moines, Iowa. Shortly before he started on the trip east, Mr. Brown's will had been discovered, in which his widow was named as one of the executors. Upon his return to Yakima, Mrs. Brown requested counsel to have the will admitted to probate. This was done, and resulted, of course, in the termination of the administration by the trust company.\n\nDuring the course of the administration up to this point ninety-six claims of creditors had been filed, the greater portion of which were acted upon by Mrs. Brown. A large number were rejected. Among the claims presented was that of respondent involving approximately $5,250,000; the claim of Lybrand, Ross Bros., and Montgomery, involving $15,000; the claim of Harry Newman, involving $90,000; the judgment of Vanderveer \u0026 Bassett, involving $41,696.36; and the claim of Rummens \u0026 Griffin of $32,000. There was also pending in King county an action by John S. Hudson for approximately $220,000. All of these claims were rejected. There were also twelve additional suits involving smaller amounts.\n\nWhile Mrs. Brown was acting as executrix, she retained the firm of Poe, Falknor, Emory \u0026 Howe, who joined with appellants Bonsted \u0026 Nichoson in the defense of the cases of Tucker and of Rummens \u0026 Griffin and Harry Newman against the Brown estate.\n\nDue to the inability of Mrs. Brown to secure a satisfactory bond, she resigned as executrix and appellant was appointed administrator de bonis non with the will annexed\n\nof Brown's estate. Thereafter the suit on the Tucker claim was commenced, and Bonsted, in conjunction with the firm of Poe, Falknor, Emory \u0026 Howe, appeared for defendants and alleged, by way of affirmative defense, that all of the property obtained by Brown from Mrs. Smith was obtained as an absolute gift.\n\nIn the fall of 1935, Mr. Bonsted made a second trip east for the purpose of taking the depositions of witnesses in Montreal in support of appellant's affirmative defense, and, second, to work out an adjustment of the contract between the Brown estate and W. R. Moss relative to the property in Virginia. In 1936, Mr. Bonsted made another trip east. At that time, respondent took the depositions of approximately one hundred twenty witnesses scattered throughout numerous cities and states. The eastern trips occupied more than two months of time.\n\nThe first trial occurred during the months of October and November, 1936, occupying approximately five weeks. At the conclusion of taking the testimony in the superior court, it was stipulated that additional depositions would be taken at Vancouver, British Columbia, and in Los Angeles. Mr. Bonsted attended the taking of these depositions. Final argument in the superior court extended over a period of two weeks. Then an additional trial was had which occupied three weeks of time. The decision of the trial court was favorable to appellant, being reversed in Tucker v. Brown, supra.\n\nIn the meantime, the other cases were brought on for trial. Considerable work was devoted to the preparation of the defense in the Hudson and Newman cases, and many depositions were taken in the preparation of those trials. The Hudson case was settled by stipulation for $1,100 and the Newman case for $6,500. The case brought by a man named Thomas resulted in a verdict against the estate for $900.\n\nMr. Bonsted ceased his connection with the estate in January, 1940, since which time Cheney \u0026 Hutcheson have\n\nappeared for the trust company. Of course, Mr. Bonsted performed many other services not mentioned in the resume which we have just given. He prepared many leases for Indian lands in connection with the operation of the stock ranch, made several trips to Kirkland, and was interviewed frequently by a representative of appellant.\n\nMr. Cheney of the firm of Cheney \u0026 Hutcheson has, since January, 1940, represented appellant in all of its litigation with respondent and acted as counsel in the affairs of the estate. He had many consultations with respondent's counsel relative to the case and the management of the Brown stock ranch. At one time, it was agreed that an action should be brought in the name of appellant to recover the property which stood in the names of Mrs. Brown and Fred Brown. A draft of the complaint against the Browns was prepared by Mr. Froude. Mr. Cheney then drew a complaint based upon three theories:\n\n\"One, that the property was Reese Brown's and Sadie and Fred were merely dummies; secondly, that there was a fraudulent conveyance and that it was a gift at the time Reese Brown was not solvent in view of the amount of the claim that had been established; and, thirdly, of the successor trustee recovering trust property if any of it appeared to be such.\"\n\nThe complaint was filed and served. In addition, a show cause order was prepared for an injunction and the appointment of a receiver. The Browns were represented by the firm of Poe, Falknor, Emory \u0026 Howe. The cause came on for hearing March 18, 1940. By consent in open court, the Browns' property was turned over to the management of appellant without the payment of rent. Later, Mr. Cheney was notified by Mr. Froude that the respondent had \"practically arrived at the point of consummation between them and the Browns for a settlement.\"\n\nTo their credit, on May 24, 1940, the Browns, acting on the advice of Mr. Falknor, decided to turn over the property held in their name to respondent, acting in his capacity as administrator of the Smith estate. A stipulation\n\napproved by the probate court of King county provided for the entry of a decree which provided, among other things, for the surrender of all the real and personal property held by the Browns to the Smith estate. The stipulation further provided that the Browns would also, by quitclaim deed and bills of sale, convey title to that property. The real property consisted of twenty-three tracts. The personal property was made up of leases, accounts receivable, stock and supplies on the ranch, and their interest in bank deposits, and certain described bonds. The Browns retained some items of personal property.\n\nAppellant refused to dismiss the case, though requested to do so by respondent's counsel. Respondent then filed a petition for intervention and a motion to dismiss. The petition and the motion to dismiss were denied. A restraining order against the Browns had been entered and remains in force. The reason for refusal to dismiss the action was stated as follows:\n\n\"It was my position that, first, in the event the estate was insolvent we were trying to recover all of that property that had been given by Brown to his wife or children for the benefit of all of the estate of Reese Brown, expenses of administration, general claims against his estate, and otherwise; that, from my information, at least half, if not more, of the property that was being transferred by Browns to Tucker was property that under no contention could be claimed to have been trust property and that, in the event that there was any merit to the position taken by Tucker, that property was entitled to be in the estate for all purposes upon the final accounting.\"\n\nA stipulation was entered into concerning the sale of property standing in the names of Sadie and Fred Brown.\n\nDuring the years 1940, 1941, and 1942, Mr. Cheney contributed a great deal of legal work in connection with sales of the various assets in the possession of appellant and in the filing of petitions for instructions from the probate court. He asked for allowance of fees as follows:\n\n\"Guaranty Trust Company v. Brown $4500.00\n\nServices in connection with the care of the prop-\n\nerty and sales aside from litigation 2500.00\n\nServices in connection with petitions for in-\n\nstructions other than the one referring to de-\n\nfense of Tucker case 750.00\n\nServices in connection with petitions for instruc-\n\ntions heard several times before Judge McGuire\n\nrelative to defense of Tucker suit, which was\n\nappealed to Supreme Court 750.00\n\nInvestigation of charges in plaintiff's supple-\n\nmental petition in Tucker v. Brown, and brief-\n\ning in connection therewith, and preparation of\n\nTrial of this case and briefing in connection\n\ntherewith 2500.00\n\nTotal $13,500.00\"\n\nThe activities of appellant trust company were carried on by Mr. Lon Boyle, its trust officer. Mr. Boyle, an attorney at law, had been in the banking business from 1920 until January 2, 1932, at which time he became connected with appellant company.\n\nWhen appellant entered upon its duties as administrator, Mr. Boyle found a chaotic condition at the Brown ranch. The laborers were demanding their pay, and were afraid that they were not going to get it. He found many registered horses and cattle at the ranch which needed attention. The Kirkland properties were found to be in a deplorable condition. Neither the woolen mill nor the store had been operated for quite some time and, of course, had deteriorated in value. Arrangements were made to insure that property and to have it inventoried. The properties in King and Yakima counties were duly appraised. Boyle filed a final account when his company first turned the property over to Mrs. Brown. After the second appointment, he made several reports, including the final account. By order of court, and with the consent of respondent, Mr. Boyle managed the ranch from his office in Yakima. He had to attend to the matters of securing and paying for water used in irrigation and the payment of taxes and in the general superintendency of the various interests connected with the Brown estate. In speaking of his work in connection with the farming operations, he stated:\n\n\". . . it's impossible to tell how much time you put in, but it probably would take two to three days a week along in the early part of it that you'd be called down to the ranch and have to devote your time there, and that continued up to -- well, every Saturday afternoon I figured on spending there and a part of Sunday, usually, checking over the property and meeting buyers for stock, and they'd call up that somebody was there and wanted to buy a stallion or wanted to buy a bull or something, and I'd always go down. Q. In addition to that, was there something practically every day to do at the office? A. Practically every day. I think our books will show practically every day there was.\"\n\nHe spoke of the agricultural condition in the following language:\n\n\"Well, it was in a very depressed condition. Produce was difficult to sell; finances were almost impossible to obtain, and in fact most of the banks refused to finance.\"\n\nIn 1940, most of the property was leased, and in 1941 everything was leased and the personal property sold so that the farming operations were at a minimum. All of the control and main accounts were kept in a trust account with appellant. All bookkeeping records relative to the farm operations were kept at the ranch and checked each year. Boyle employed on the ranch a superintendent, ranch foreman, stock foreman of the cattle and horses, and a foreman under him. From eighteen to forty-seven men were employed to do the work. In addition, a bookkeeper was retained at the ranch. All these men were paid from estate funds.\n\nThe accounts presented to the court were prepared by a firm of certified public accountants. Mr. Boyle stated that he had nothing to do with the accounts. Mr. Straight, one of the members of the firm of public accountants, testified that he copied the items in the various accounts from the books at the farm.\n\nThe question presented requires the determination of what expenses may be charged against a trust estate which has been the subject of care and extended litigation. The settlement of trust estates has resulted in much litigation\n\nand has been the subject of many decisions of courts of last resort. Due to the great amount involved in the trial of this case and the importance of the issues, we feel that we should give the question extended consideration.\n\nFebruary 20, 1940, appellant filed a petition for instructions. After a hearing, the probate court entered an order, a portion of which is set out in In re Brown's Estate, 7 Wash. 2d 717, supra. That order allowed appellant to expend funds of the Smith-Brown trust in the litigation involved in the accounting. In passing upon the order, we stated:\n\n\"We do not understand that respondent is here seeking instruction in any other capacity than that of administrator, and we therefore have no occasion to pass upon, and are not herein passing upon, the right of respondent, as a trustee, to reimbursement from the trust funds, for the expense of the accounting, or any other claimed expense.\n\n\"In no sense can the expenses asked for herein be treated as proper expenses to be incurred by respondent as a trustee in administering the trust for the benefit of the cestui que trust. The acts for which respondent seeks reimbursement are those of an administrator seeking to protect the interest of the estate, and any expense thus incurred would be an expense of administration, properly chargeable against the estate for whose benefit the services were rendered, but would not be a proper charge against the trust property . \"\n\n\"In his accounting a trustee should receive credit for all proper disbursements which have been made by him on account of the trust, including ordinary expenses of administration and preservation of the estate, the payment of debts, and similar authorized expenditures, for properly incurred counsel fees or costs and expenses of litigation, for the difference in value between the approximate estimate of value of property and that actually turned over to the trustee, and for his compensation.\" 65 C.J. 908, Trusts, § 804.\n\n\" Counsel fees are a charge on the trust fund, however, only when they are for legal services and are reasonably necessary and proper to the administration and protection of the trust, and not reasonably to be expected of the trustee, and contribute to the due administration of the trust for a common benefit. They are not allowable against\n\nthe estate for services rendered in proceedings to declare the trustee a lunatic, or in litigation in which the trustee has no interest but is only a formal party, or in litigation which is caused solely by the mismanagement or maladministration of the trustee, or which is necessary to enforce the rights of the cestui que trust; or for services rendered to the trustee individually, or rendered in a suit brought by the trustee improvidently and for his own protection. So, also, counsel fees cannot be allowed out of the trust estate for services rendered for one of the claimants of the trust fund, or in relation to funds which the trustee is administering as administrator, or in litigation of the trustee's accounts, . . .\" 65 C.J. 720, Trusts § 583.\n\n\"When the compensation of a trustee by way of commissions or otherwise is fixed by a settlor, by statute or by a court, it is of course implied that the amount is to be paid for the administration of the trust in accordance with the terms of the trust and the standards set by the court of equity. The sum is allotted for an execution of the trust with the highest degree of good faith and ordinary skill and care. It follows that if the administration of any particular trustee falls below this level, his compensation should be reduced or forfeited entirely. The court having jurisdiction to approve the award of compensation also has power to direct that a trustee shall receive none of the compensation he would get fro normal performance, . . . .\" 4 Bogert Trusts 2877, § 979.\n\nIn Pollard v. Lathrop, 12 Colo. 171, 20 P. 251, a trustee denied the existence of the trust, and his compensation was denied. In passing upon the question, the court stated:\n\n\"Appellant, in his answer to the complaint, denied the allegations charging him with having taken title to the property as trustee for the use and benefit of Joseph H. Lathrop, deceased, and he claimed title thereto as absolute owner. The court found against him upon this issue, and that his claims of an interest in said property were falsely asserted. The trust was at all times denied by the appellant. We know of no principle of equity that would, under these circumstances, allow such trustee compensation for his services in the management of the property . \"\n\n\"Where a trustee is unfaithful to the trust, it is properly denied compensation. The court in such cases acts in the\n\nexercise of a sound discretion in refusing to allow compensation, which discretion will not be disturbed on appeal, except in a case of clear abuse.\n\n\"It might be supposed that the term \"breach of trust\" was confined to willful and fraudulent acts which have a quasi criminal character, even if they have not been made actual crimes by statute. The term has, however, a broader and more technical meaning. It is well settled that every violation by a trustee of a duty which equity lays upon him, whether willful and fraudulent, or don through negligence, or arising through mere oversight and forgetfulness, is a breach of trust. The term, therefore, includes every omission and commission of either of the three great obligations already described, of carrying out the trust according to its terms, of care and diligence in protecting and investing the trust property, and of using perfect good faith.' Pomenoy's Eq. Jur. 1079.\n\n\"In Perry on Trusts, at section 919, the author speaks concerning this subject, as follows:\n\n\"'If they (trustees) are guilty of any breach of trust, or of any vexatious or improper conduct the courts can withhold all compensation, or they can allow such compensations as will pay for the value of their services so far as they have been beneficial to the estate.'\n\n\" Even though the trustee acts in good faith, if his conduct is a breach of trust, compensation will be denied . Weakley v. Meriwehter, 156 Ky. 304, 160 S.W. 1054. And the refusal of a trustee to do his duty until compelled deprives him of the right to compensation. Lehman v. Rothbarth, 159 Ill. 270, 42 N.E. 777.\n\n\"It is axiomatic in the law of trusts and trustees that the trustee shall receive no compensation where he denies the trust.\" H.B. Cartwright \u0026 Bro. v. U.S. Bank \u0026 Trust Co., 23 N.M.82, 167 P. 436.\n\nIn Haines v. Hay, 169 Ill. 93, 48 N.E. 218, the court disallowed solicitor's fees where litigation was necessary to enforce the rights of the cestui que trust. We find in Haines v. Hay facts very much like those in the instant case. A woman bequeathed to her trustee a certain sum of money, the income to be paid to her son. The trustee died and his administrator refused to recognize the trust, and he was sued by the cestui que trust, who prevailed in the trial anc appellate courts. Later, costs were allowed\n\nthe administrator by the probate court for his expenses in the litigation. In passing upon the question, the court said:\n\n\"the first error assigned is the allowance of a credit for the items of expense claimed by the administrator. These items were the costs in the circuit court, the costs in the Appellate and Supreme Courts, including the printing of briefs and abstracts, in the former litigation between the cestuis que trust and the administrator over the $10,000 trust fund. The allowance of these expenses was improper. In the first place, the decree of the circuit court, which was entered in that case on June 26, 1891, ordered Bradford, as administrator of the estate of Treat, to pay the costs in due course of administration. That was an adjudication as to the costs in the circuit court and settled by the affirmance of that decree on the former appeal. That decree was also an adjudication of the fact that the $10,000 did not belong to the estate of Samuel H. Treat. Had the cestuis que trust brought suit against Treat in his lifetime, on his declining to recognize his trust relation, the latter certainly would have been liable for costs, and on the same principle his estate must be held, the suit being against his personal representative. The order of the court was not that Bradford pay the costs out of the trust estate, but that he should pay them out of the estate of his in estate, in due course of administration. This litigation was not in the interest of the trust fund, but hostile to it, and no principle of equity will, as we conceive, permit the trust fund to be diminished to pay the expenses of such litigation. (Meek v. Allison, 67 Ill. 46.)\n\n\"An equally strong equity exists against the allowance of the costs in the Appellate and Supreme Courts, and the charges for printing abstracts and briefs. The decree of the circuit court was a protection to the administrator against the claims of all parties to the suit. The appeal taken was manifestly deemed for the benefit and advantage of the estate, and the adverse decision must carry with it the costs to be paid by the administrator in due course of administration. The administrator had no right to pay any of the above items out of funds which in no sense were the property of his intestate in his lifetime, and which it was expressly held in the original action did not pass to his administrator as assets of his estate. The administrator represented the estate, and as such he had a right to make\n\nsuch defense as he thought its interests demanded, and the estate is liable for all costs so incurred, and not the party or estate against whom the defense was unsuccessfully made. \"\n\nThis statement of the law was adhered to in Billings v. Warren, 216 Ill. 281, 74 N.E. 1050, and Bennet v. Weber, 323 Ill. 283, 154 N.E. 105, and was quoted from by this court in In re Brown's Estate, supra.\n\nIn O'Day v. Annex Realty Co., 236 S.W. (Mo.) 22, we again find facts similar to those present in the case at bar. In that case, trustees denied the existence of the trust and an action was brought to establish it. The trial court entered judgment for the defendants which was reversed on appeal, the trial court being directed\n\n\"'. . . to declare in favor of plaintiffs a constructive trust, as prayed for in the petition, and to require at the hands of defendants an accounting.'\"\n\nUpon the accounting, it was held in the trial court that the plaintiff recover a certain sum of money. The defendant was denied commissions upon the ground that it had denied the trust, claimed the property as its own, and was not entitled to any compensation for its services in the management of the property. Speaking on this question, the supreme court of Missouri stated:\n\n\"He did in fact manage and control it in the name of the Annex Realty Company. He and it were in effect cotrustees -- he the active and managing trustee and it the depositary of the legal title, the income and the proceeds of sales. However, during his lifetime they conjoined, by their acts and conduct, in repudiating the trust. And after his death appellant continued to deny it and when a demand was made for an accounting claimed the property as its won. As both O'Reilly and appellant at all times denied the existence of a trust, they could not, in the management of the O'Day properties, have acted in the capacity of trustees. What they did in such management they did solely for the attainment of their own ends; and while the trust estate may have thereby incidentally received some benefit, the management of its properties by them was not a service rendered for it, our in the discharge of their duties as trustees. Compensation for the alleged services cannot\n\ntherefore be allowed out of the trust property upon an enforced accounting in a court of equity.\"\n\n\"Certainly the defendant, while denying the trust, and claiming all the property as her own, was in no position to charge the plaintiffs or the property with her services or services of her agents or attorneys in respect to the same.\" Fuller v. Abee, 105 Wis. 235, 81 N.W. 401.\n\nIn Hobbs v. McLean, 117 U.S. 567, 581, 29 L. ed. 940, 6 S. Ct. 870, the supreme court passed upon the question of securing costs and attorneys' fees from a trust estate. That court announced the rule as follows:\n\n\"All he did was to get the fund into his possession. As in our view the fund belongs to the plaintiffs in this suit, all that comes out of it for the compensation of the defendant comes out of their pockets. We see no reason why they should pay the defendant, who, instead of aiding them in securing their rights, has been an obstacle and obstruction to their enforcement. The services for which the defendant seeks pay from the plaintiffs were not rendered in their behalf, but in hostility to their interest.\n\n\"When many persons have a common interest in a trust property or fund, and one of them, for the benefit of all and at his own cost and expense, brings a suit for its preservation or administration, the court of equity in which the suit is brought will order that the plaintiff be reimbursed his outlay from the property of the trust, or by proportional contribution from those who accept the benefits of his efforts. See Trustees v. Greenough, 105 U.S. 527, where the subject is discussed by Mr. Justice Bradley, and the cases cited; and Central Railroad Co. v. Pettus, 113 U.S. 116. But where one brings adversary proceedings to take the possession of trust property from those entitled to it, in order that he may distribute it to those who claim adversely, and fails in his purpose, it has never been held, in any case brought to our notice, that such person had any right to demand reimbursement of his expenses out of the trust fund, or contribution from those whose property he sought to misappropriate.\"\n\n\" Where one denies a trust he renders no service in the capacity of a trustee. Even though he may keep a fund safely, if he claims it as his own he precludes himself from also claiming compensation as a trustee, for he thereby denies his relation as a trustee. Moreover, the claim of ownership\n\nhas caused litigation to establish the title to the fund. One cannot take the chances of claiming the fund as his own, or, failing in that, to have compensation for his services.\" Stone v. Farnham, 22 R.I. 227, 47 Atl. 211.\n\nSee, also, In re Kline's Estate, 280 Pa, 41, 124 Atl. 280, 32 A.L.R. 296; IN re Johnston's Estate, 127 N.J. Eq. 576, 14A. (2d) 469; Lewis v. Ingram, 57 F. (2d) 463; In re Rosenfeldt's Will, 185 Minn. 425, 241 N.W. 573; Harrison v. Perea, 168 U.S. 311, 42 L. Ed. 478, 18 S. Ct. 129; In re Morton's Estate, 74 N.J. Eq. 797, 70 Atl. 680.\n\nIt is obvious that someone must lose in this case as a result of this litigation. Either appellant and its attorneys must forego compensation for their services, or the trust fund must be depleted.\n\nIn In re Hart's Estate, 203 Pa. 496, 53 Atl. 370, the supreme court of Pennsylvania had under consideration a trust mismanagement, and, in speaking of the leniency of the trial court in allowing some compensation to the trustee, stated:\n\n\"The personal regret for the trustee's conduct should not have moved the court to shrink from the judicial decree which logically followed the finding of facts, -- one refusing him all compensation. In the real sense of the word, it is not the infliction of a 'penalty,' for there is another court better adapted both in its procedure and judgment to that end; in the orphans' court, it is simply a refusal to reward him as for doing well that which he has done ill. That he did not intentionally wrong his cestuis que trust is immaterial on the question of compensation; if they have suffered by his neglect and mismanagement, he has no claim in law or equity to be paid for that sort of management.\"\n\nWe find the following statement on this subject in Zimmerman v. Fraley, 70 Md. 561, 17 Atl. 560:\n\n\"It is infinitely better, even in exceptional cases of manifest hardship, that a trustee should suffer the results of his own errors and mistakes of judgment, than that the settled and established principles which have uniformly governed Courts of equity in protecting the interests of the cestui que trust, against the trustee, should be relaxed or strained in the slightest degree for his acquittal or relief.\"\n\nWe have italicized portions of the foregoing cases to give prominence to their dominant purpose.\n\nAppellant cites many cases and textbooks in support of its contention that, under the law, it had an absolute duty to defend the Tucker suit. Among its citations of authority, we find: 21 Am. Jur. 496, 497, §§ 223, 224 and cases cited; Restatement of Trusts, § 178; 24 C.J. 389, § 1080; 2 Bancroft, Probate Practice, 636, § 332; 2 Woerner, American Law of Administration (3d ed.) 1023, § 324. The holding of these authorities is reflected in the following quotation from 21 Am. Jur. 496, 497, Executors and Administrators, § 223:\n\n\"It is the duty of an executor or administrator to defend all suits that may be brought against the estate and to protect the estate from invalid and doubtful claims and obligations. He should interpose against such claims every legal objection that industry and care can furnish. In a suit brought by a servant for wages, an executor or administrator may raise any ground for discharge which existed during the lifetime of the employer although unknown to him. Where a suit has been begun against the decedent in his lifetime and is still pending at his death, it is the duty of his personal representatives to defend the action and for that purpose to be substituted as defendants. When the estate is sued, an executor may not, by a bill of interpleader, call on legatees and heirs, whose interest he must protect, to assume the burdens of litigation which his office imposes on him.\n\n\"Where an executor has faithfully defended a suit against the estate, he will generally be protected from liability as to the beneficiaries though the outcome is adverse to the estate. For example, a judgment recovered against an executor on title paramount to the testator's will protects him from claimants of the same property under the will, if he commits no devastavit by making a faithless or merely colorable defense.\"\n\nAdditional cases are as follows: In re Lichtenberg's Estate, 58 Wash. 585, 109 P. 48; Abslag v. Bock, 139 Wash. 198, 246 P. 300; Watson v. Johnson, 174 Wash. 12, 24 P.2d 592, 89 A.L.R. 1527; Thompson v. Weimer, 1 Wash. 2d 145, 95 P.2d 772; In re Jolly's Estate, 3 Wash. 2d 615,\n\n101 P.2d 995, 128 A.L.R. 993; In re Brown, 6 Wash. 2d 215, 101 P.2d 1003, 107 P.2d 1104; In re Brown's Estate, 7 Wash. 2d 717, 110 P.2d 867; Monroe v. Winn, 19 Wash. 2d 462, 142 P.2d 1022.\n\nThe only question in the Lichtenberg case was the allowance of attorney's ffes for defending an action brought against the estate. Appellants assert that the holding in the Abslag case is conclusive of the issues under discussion. The facts in that case are entirely different from the factual situation here. In that case, one person sued another on the ground of fraud and was allowed recovery. In the judgment, certain money collected by a trustee who held it in trust for the defendant was subjected to the payment of the judgment. The trustee was allowed expenses paid out in the litigation. In passing upon that phase of the lawsuit, the court pointed out that the trustee was not acting for the plaintiff, but for the defendant, and that the money was expended \"in defending the title it held in trust.\"\n\nIn the Watson case, this court allowed fees to an attorney who rendered services in the protection and preservation of a trust fund. In the Thompson case, this court held that it was the duty of an executor to contest and appeal a case in which a claim was made for the assets of the estate. The Jolly case involved a will contest in which we applied and took into consideration Rem. Rev. Stat., § 1389 [P.C. § 10020a], which leaves to the discretion of the court the assessment of costs. In re Brown has no bearing upon the instant case. A fee was allowed to the guardian, to be paid from the guardsmanship funds. The opinion is not authority in any event. In In re Brown's Estate, supra, this court refused to allow the payment of costs from the trust fund.\n\nSpecial attention is directed to the Monroe case by appellant. Its counsel interpret that case as giving approval to the payment of costs of both parties, including the trustee, incurred in litigation between the cestui and the trustee. We do not agree with appellant. In that case, we had before us two sets of trustees who performed services for the trust, and it was on the basis of service to the trust fund that this court allowed costs and attorneys' fees.\n\nThese cases simply hold that administrators are entitled to compensation for services rendered the estate. They do not hold that the services rendered for the estate may be paid for from funds of a trust estate, which are in the possession of the administrator or executor.\n\nAppellant had cited additional cases, most of which were depended upon by the trust company in In re Brown's Estate, supra. We have examined those cases, but do not find that they differ in any essential way with our cases to which we have just given attention.\n\nAppellant makes a further contention that the judgment of the trial court in the first trial was presumptively correct and was conclusive and binding upon the parties as to every question therein decided, until and unless it was subsequently reversed on appeal.\n\nIt is its position, as we understand it, that, during the period of time between Judge Barnett's decision and our opinion in Tucker v. Brown, supra, it was justified in proceeding on the theory that there was no trust, and that everything done was correct, performed in good faith, and cannot now be questioned. In support of this theory, it cites In re Jolly's Estate, supra; 3 C.J. 1261 and 1262, § 1373; 4 C.J.S. 1097, § 611; and 3 Am. Jur. 189, § 520. These authorities hold that a judgment is merely suspended by appeal; that it remains in force and is binding until reversed or set aside. However, we find in the cited section from 4 C.J.S. 1096, § 611, the statement:\n\n\"Hence, if a statutory remedy by appeal provides for a complete trial de novo in the appellate court, or it expressly so provided, the perfection of the proceeding usually operates to vacate the judgment of the court below.\"\n\nThe rule of law for which appellant contends is of no aid to it in so far as the allowances of costs, compensation, and attorneys' fees is concerned, for the reason that the good or bad faith of appellant is not material. Nor does the fact, if it be one, that the judgment of the trial court in the first case was not superseded until reversed, have any effect upon the fact that there was a trust.\n\nThe trust became effective in the latter part of the\n\nyear 1928 or the early portion of 1929. Dines v. Hyland, 180 Wash. 455, 40 P.2d 140; In re Cunnigham's Estate, 19 Wash. 2d 589, 143 P.2d 852. In the last case, this court said:\n\n\"The character of the transaction is determined as of the time of conveyance: the status of the property is fixed either as a gift or a trust at the time grantee takes title. The intention of the donor is determined as of the date of the deed.\"\n\nCiting De Boe v. Prentice Packing \u0026 Storage Co., 172 Wash. 514, 20 P.2d 1107; Reynolds v. Travelers Ins. Co., 176 Wash. 36, 28 P.2d 310; Strand v. State, 16 Wash. 2d 107, 132 P.2d 1011; Twisp Mining \u0026 Smelting Co. v. chelan Mining Co., 16 Wash. 2d 264, 133 P.2d 300; and Carter v. Curlew Creamery Co., 16 Wash. 2d 476, 134 P.2d 66, as authority, appellant contends that respondent is now in no position to complain, for the reason that he waived the employment of and payment to Bonsted, and released Falknor and stood by for years and made no objections during that time when the court records showed that appellant was expending substantial sums for attorneys' fees and legal expenses. The cases adopt the proper and accepted rule regarding waiver and estoppel.\n\nIn the Reynolds case, supra, this court stated as follows:\n\n\"A waiver is the voluntary relinquishment of a known right, and may be either express or implied. An express waiver is governed by its own terms, and hence is not after the subject of much dispute. An implied waiver may arise where one party has pursued such a course of conduct as to evidence an intention to waive a right, or where his conduct is inconsistent with any other intention than to waive it. An estoppel is a preclusion by act or conduct from asserting a right which might otherwise have existed, to the detriment and prejudice of another who, in reliance on such act or conduct, has acted upon it. A waiver is unilateral and arises by the intentional relinquishment of a right, or by a neglect to insist upon it, while an estopple presupposes some conduct or dealing with another by which the other is induced to act, or to forbear to act.\"\n\nIn this connection, we call attention to the statement contained in 21 C.J. 1113, § 116, quoted with approval in\n\nthe Strand and Carter cases. It is quite true that respondent knew all the facts to which appellant has referred. However, respondent did, at every opportunity, object and complain of the allowances and payment of fees and expenses concerning which he now complains. Those objections had no effect on appellant's conduct. It had possession of the property and funds of the trust and deliberately ignored respondent's complaints and proceeded with its activities on the theory that there was no trust, no trust funds, and that all of the property was that of the Reese B. Brown estate. Clearly, appellant was in no position to urge waiver or estoppel.\n\nAppellants Bonsted \u0026 Nichoson in their argument cited many cases already mentioned. We consider the following additional authorities upon which they depend:\n\nIn re Carlin's Estate, 226 Mo. App. 622, 47 S.W. (2d) 213. The following is a quotation of the pertinent portion of that opinion:\n\n\"During the pendency of this litigation the administratrix had incurred and paid attorneys' fees in a total sum of $1250 for services therein and for all other services to the estate, and also the expenses incident to the appeal, all of which were disallowed to her in the judgment now under review. . . .\n\n\"But the learned trial court erred in its judgment in denying credit to the administratrix for attorney fees and expenses incident to the litigation instituted by DeArmond. The claim involved in the suit was that of sole owner of the entire estate, both real and personal. The administratrix as such was made a party, summons was served upon her, and she was in duty bound to defend, and it appears that she was in fact the only party who did defend. She was possessed of a personal estate which had descended to her as administratrix and which she held as trustee for the legal owner; she was a necessary party to the suit. [ Eisiminger v. Stanton, 129 Mo. App. l.c. 412.] She had no personal interest in the estate and claimed none as an individual. It was to the benefit and to the interest of the estate that the true ownership thereof be determined. Under the circumstances revealed by the record the administratrix clearly would have been derelict in her duty if she\n\nhad not defended against the claim of an apparent stranger, so far as she knew, who based his claim to the entire estate upon an oral agreement made by the deceased. Respondent suggests that the position of the administratrix should have been neutral, and insists that the defense of the title to real estate belonged only to the heirs. Such suggestion and insistence are without influence under the circumstances of the case at bar. The law suit did not merely involve title to real estate, but title to the personalty as well which was then in the administratrix. She was justified in defending said suit to the court of last resort as the expense of the estate. This is evident as revealed by the facts developed in the progress of the trial and as revealed by DeArmond's petition. She should not be required to defend at her own personal expense. There is no evidence, nor a suggestion of evidence, of bad faith upon her part or of her attorneys, and when an administrator in good faith and in the exercise of ordinary prudence employs legal counsel to defend such an action, and the attorneys in good faith and with reasonable care, skill, and judgment perform such duty, then in law the whole matter is for the benefit of the estate. Good faith and reasonable care and not the result of the litigation is the test.\"\n\nDooley v. Welch, 172 Mo. App. 528, 158 S.W. 454, involved an action to recover a shareholder's superadded liability on bank stock carried by the estate. In passing upon this question, the court said in part:\n\n\"The question of whether services rendered by an attorney for an estate at the request of the administrator are for the benefit of the estate is not to be determined solely by the results of the services. In accepting employment to prosecute or defend an action a lawyer does not become an insurer of the success of his professional efforts. He does undertake to act with the care, industry and judgment of a lawyer of reasonable skill and capacity and as long as he so conducts himself his services are for the benefit of his client whether they result in failure of success. 'An attorney is not liable for being in error as to a question of law upon which reasonable doubt may be entertained by well-informed lawyers; nor is he answerable for error in judgment upon points of new occurrence or of nice or doubtful construction.' [3 Am. \u0026 Eng. Ency. of Law (2 ed.), 308.] . . .\n\n\"Where an administrator in good faith and with ordinary prudence employs a lawyer to defend an action prosecuted against the estate and the lawyer defends the case in good faith and with reasonable care and professional skill and judgment, his employment in law is for the benefit of the estate. To hold otherwise would be to place the estates of deceased persons at a great and unnecessary disadvantage, since reputable lawyers would not care to accept employment that would put them in the position of an insurer of their client's lawsuit.\"\n\nWhile these cases do not have to do with trusts and the actions of trustees, they do, by analogy at least, tend to sustain appellants' position. However, it is our considered opinion that they represent a minority view and are in direct conflict with our holding in In re Brown's Estate, supra.\n\nIn regard to the activities of appellant, we cannot but find that it at all times asserted title to the property in its possession and under its control in the Reese B. Brown estate, and denied that any of that property belonged to the Smith-Brown trust. It denied the trust, and contended that Brown was the owner of the property and that, if Mrs. Smith turned over any of her assets to Brown, it was by way of a loan or gift. This denial of the trust was even continued after this court definitely held that a trust existed. Appellant gave financial aid and assistance from the trust funds to the Brown heirs. It concealed from the court for a considerable length of time the fact that Mrs. Smith had died. It failed properly to conserve the trust property and paid large sums of money from trust funds to discharge the individual debts of Brown. It failed to co-operate with respondent at the time he had secured a settlement with the Browns, and used all the rules of legal warfare to defeat respondent and delay final determination of this litigation. It did not comply with any of the requirements of loyalty and fidelity required of a trustee. In short, it hardly observed the standards of behavior required in a workaday world and used by people acting at arm's length. Finally, in defiance of the mandate of this court, it refused to make an accounting in the case of Tucker v. Brown.\n\nOf course, appellant had the right to choose whom it would serve -- the trust of the Brown estate. Having elected to serve the Brown estate, it cannot now be allowed to take from its adversary, the Smith-Brown trust, cost of attorneys' fees for any of its activities except those necessary to conserve and protect the trust property.\n\nThe amounts granted appellant as compensation are allowed to it in its capacity as successor trustee and not as a representative of the Brown estate. Attorneys' fees will be allowed on the same basis.\n\nThe object sought to be obtained by a court of equity in proceedings of this nature is the protection and preservation of trust funds, to the end that those funds will not be depleted to the irreparable injury of the cestui que trust. If a trustee shows a disregard for the interest of the beneficiary and does not make a complete accounting of trust property in his hands or under his control, then he cannot receive for such accounting as he has made. Action on the part of a court of equity in disallowing fees, costs, or expenses to a trustee who has not performed his full duty is not made for the purpose of punishing or imposing a penalty on the trustee for a violation of duty. Courts of equity do not impose or enforce penalties, but only furnish the adequate means of redress in order that the cestui que trust may not suffer, but will be able to receive his property without undue expense on his part. The practice of compensating the trustee from the funds of the trust has no application in cases in which the trustee is serving the interest of another party in a contest for possession of the trust funds.\n\nBased upon the conclusion at which we have arrived, we proceed to fix the compensation to be allowed appellant for its services and that to be allowed its attorneys. The trial court fixed the fees for Mr. Bonsted and his firm in the total sum of $48,000, and in so doing stated:\n\n\"I haven't criticized the trust company too severely, and because of the difficulty which it was faced with to decide what was trust property, and while I feel that, in line with what Judge Jeffers has said, they occupied a most inconsistent\n\nposition, and that they thought that their course of action was to attempt in all ways possible to defeat the plaintiff and that it is going to work a very considerable hardship on them, I still am going to make allowances for their services.\"\n\nWe have heretofore called attention to the acts of appellant and will not repeat them in considering its request for fees.\n\nAfter a careful study of the record, we are of the opinion that appellant should be allowed $750 per month for the first twenty-four months it acted as representative of the Brown estate and $250 per month for the balance of the eighty-four months of service.\n\nWe make this allowance for the reason that appellant had a great amount of work to do during the first two years of its administration, collecting the estate and putting the ranch in a working condition. We are of the opinion that after the lapse of two years appellant did not earn an amount to exceed the sums allowed. This is quite apparent when we take into consideration the facts relative to the expert help it had in continuing the ranch operations.\n\nIn allowing attorney's fees in cases of this nature, we follow the rule adopted for allowance of attorney's fees earned in probating estates:\n\n\"In fixing the amount to be allowed as a fee for the attorney of a descendent's personal representative, the court should consider the amount and nature of the services rendered, the time required in performing them, the diligence with which they have been executed, the value of the estate, the novelty and difficulty of the legal questions involved, the skill and training required in handling them, the good faith in which the various legal steps in connection with the administration were taken, and all other matters which would aid the court in arriving at a fair and just allowance. Shufeldt v. Hughes, 55 Wash. 246, 104 P. 153; In re Holmgren's Estate, 189 Wash. 94, 63 P.2d 504; 2 Bancroft, Probate Practice (1928) 810, § 432; 24 C.J. 104, Executors and Administrators, § 542;\" In re Peterson's Estate, 12 Wash. 2d 686, 123 P.2d 733.\n\nThe allowance of fees is largely a matter for the exercise of the trial court's discretion. In re Krueger's Estate 11 Wash. 2d 329, 119 P.2d 312.\n\nThis rule can have no application here for the reason that the trial court did not indicate that the allowance was for services in protecting the trust estate or were in part allowed as compensation for appellant's defense of the action brought by respondent.\n\nMr. Bonsted, in his written request for fees, asked for $60,000, and testified at the trial that that sum would be a reasonable fee. In his testimony he segregated the amount as follows:\n\nTucker v. Brown, $18,000.00\n\nHudson v. Brown, 10,000.00\n\nNewman v. Brown, 7,500.00\n\nLybrand v. Brown, 1,000.00\n\nScott, Wilcox and Thornton cases,\n\n$100.00 each, 300.00\n\nTotal, $36,800.00\n\nThe cases other than Tucker v. Brown involved the personal indebtedness of Reese B. Brown.\n\nFrom the testimony it appears that $23,200 is a reasonable fee for services in connection with preserving the Smith-Brown trust. The attorneys' fees for Bonsted \u0026 Nichoson and Fred C. Palmer, Jr., as a charge against the trust fund, will be allowed in the sum of $23,200.\n\nWe are of the opinion that this amount is ample compensation for the services rendered by the attorneys in taking care of the trust property. In making this allowance, we are mindful of the fact that four members of the Yakima bar testified that the services rendered by Mr. Bonsted were of the reasonable value of $75,000. However, they made no segregation of this amount, making it impossible for this court to ascertain the amount they deemed reasonable for services in taking care of the trust property. This court is in a position to and may ascertain from the record and its intimate knowledge of legal proceeding the reasonable amounts which should be allowed attorneys and other officers of the court.\n\nCheney and Hutcheson will be allowed the sum of $2,500 for their services in connection with the care of the trust property. Their request for $4,500 for instituting the\n\naction of Guaranty Trust Co. v. Brown cannot be allowed in full. The complaint in that action, containing twenty-one paragraphs, was in the main a history of Brown's activities and of the estate proceedings. It also set forth allegations to the effect that Reese B. Brown acquired certain property \". . . with funds which were either funds of said Brown, now deceased, or funds which he had borrowed from said Sarah E. Smith, or funds held in trust for said Sarah E. Smith\"; and cause title to the property to be placed in the name of Fred R. Brown, all without consideration from Fred R. Brown. It was further alleged that Reese B. Brown was insolvent at the time the property was placed in his son's name; and appellant asked for an order restraining and enjoining the defendants from in any way disposing of the property. Prayer was also made for the appointment of a receiver.\n\nA restraining order was duly entered by the trial court. Several motions attacking the restraining order were presented to the court. These hearings imposed considerable work on the attorneys. The respondent attempted to intervene, but was met by appellant with a contest and a motion that he be made a defendant in the action. The court entered an order to that effect. Appellant's attorneys successfully contested a demurrer to the complaint, and defendant answered. Respondent also filed an answer to the complaint.\n\nThen, on May 24, 1940, respondent and the Browns entered into the settlement agreement to which we have already referred in this opinion. Appellant, however, refused to recognize the agreement. The case was never tried on its merits. In view of these facts, we are of the opinion that $2,500 is quite sufficient to pay Cheney and Hutcheson for their services in bringing the action against Mrs. Brown and her son, Fred.\n\nThe other claims of the attorneys will be disallowed, for the reason that their services in asking for instructions, in briefing and preparing the final record, and in defending this case were not in the interest of the trust estate.\n\nIn our judgment, the fees asked for are exorbitant. There has grown up in some phases of judicial action an abuse in the allowance of fees to those appointed by the court to act in fiduciary capacities. The supreme court of the United States has called attention to this and sounded a warning and note of caution in the case of In re Gilbert, 276 U.S. 294, 72 L. Ed. 580, 48 S. Ct. 309, as follows:\n\n\"We were desirous of making it clear by our action that the judges of the courts, in fixing allowances for services to court officers, should be most careful, and that vicarious generosity in such a matter could received no countenance.\"\n\nAn in Newton v. Consolidated Gas. Co., 259 U.S. 101, 66 L. Ed. 844, 42 S. Ct. 438, in passing on the compensation of a master, the supreme court pointed out that: \"The rights of those who ultimately pay must be carefully protected.\"\n\nThere seems to have developed an idea that lawyers should received larger fees when representing receivers or estate than they would think of charging if employed by a private client for similar services. There is no reason for any difference in charges. Counsel and personal representatives of estate should be allowed fair and reasonable compensation in such cases. There is no reason why they should be overpaid. We call attention to a few cases in which excessive fees have been condemned.\n\nIn Trustees v. Greenough, 105 U.S. 527, 16 L. Ed. 1157, the supreme court of the United States called attention to the practice of allowing extravagant fees and commissions to trustees, receivers, and counsel, and said:\n\n\"Sometimes, no doubt, these allowances have been excessive, and perhaps illegal; and we would be very far from expressing our approval of such large allowances to trustees, receivers, and counsel as have sometimes been made, and which have justly excited severe criticism.\"\n\nIn the following portion of his dissent in the case, Mr. Justice Miller indicated a further thought which has a peculiar application to the case at bar in which an antagonist of the trust fund was the person who employed counsel:\n\n\". . . I do not agree to the opinion, so far as it is an argument in favor of a principle on which is founded the grossest judicial abuse of the present day; namely, the absorption of a property or a fund which comes into the control of a court, by making allowances for attorney's fees and other expenses, pending the litigation, payable out of the common fund, when it may be finally decided that the party who employed the attorney, or incurred the costs, never had any interest in the property or fund in litigation.\"\n\nIn Central R. \u0026 Banking Co. v. Pettus, 113 U.S. 116, 28 L. Ed. 915, 5 S. Ct. 387, the court decided that the amount allowed as attorney's fees was twice what it should be, and reduced it one half.\n\nIn Brown v. Pennsylvania R. Co., 250 Fed. 513, the master had been allowed $20,000 and the attorneys $20,000, and the appellate court reduced the master's fee one half and made the same holding concerning counsel fees.\n\nIn Mecartney v. Guardian Trust Co., 280 Fed. 64, the court had before it the question of attorney's fees, where a claimant was asking for $75,000 for legal services in a case formerly pending in that court. Eminent counsel testified that the services were worth from $75,000 to $200.000. The court allowed $37,500, which was one half of the lowest estimate of any claimant's witnesses.\n\nThe supreme court of Montana, in Hickey v. Parrot Silver \u0026 Copper Co., 32 Mont. 143, 79 P. 698, used this language in passing upon the allowance to a receiver:\n\n\"It is well established that the compensation allowed a receiver must be reasonable, but why compensation must be greater, in order to be reasonable, for doing certain work, when the hiring is done by the court, than it would be for the same duties if the hiring were done by an individual, is not apparent. Where extra duties are enjoined, as giving a bond or otherwise, that are not compensated for in some other manner, additional pay may be allowed; otherwise there is no reason why it should not be the same. And these remarks apply equally to allowances for counsel fees.\" Cited with approval in Walton N. Moore Dry Goods Co. v. Lieurance, 38 F. (2d) 186.\n\nWe are quite certain that appellant and its counsel would not attempt to charge a private client either the sums asked for or the amounts allowed by the court. As a matter of fact, a private business concern would soon be bankrupt if it attempted to pay similar charges.\n\nThe next objection appellant makes to the court's decree is in the disallowance of the charge it had made for interest on funds advanced to the estate.\n\nBrown had purchased a large ranch in Yakima county and stocked it with a splendid selection of pedigreed stock. In order to conserve that investment, appellant, with permission of the trial court, operated the ranch for a considerable time. The expenses of operation, including rent paid to Fred Brown, attorney's fees, and a widow's allowance paid to Mrs. Brown, depleted the funds in the hands of appellant to such an extent that other funds had to be secured to pay expenses. The funds were advanced by appellant, for which an interest charge was made in the sum of $2,258.34. The trial court refused to allowed the charge.\n\nAppellant claims that the issue here comes within our holding in Hancock v. Muldoon, 136 Wash. 243, 239 P. 546, 241 P. 684, which states:\n\n\"Nor can we agree with the trial court that the item of interest should have been stricken. The sums of money upon which interest was charged were advanced by the trustee to pay taxes and assessments on the property, and if these had not been promptly paid they would have drawn a large rate of interest, up to twelve or fifteen per cent. The advancement of these funds was for the benefit and preservation of the estate, and we see no reason why money advanced by the trustee for the preservation of the estate should not be returned with interest. The right to charge interest on funds advanced to an estate is well recognized. . . . Here there is no adverse position, for no commission is sought on moneys advanced, but merely that interest should be paid on those sums advanced for the preservation of the estate.\"\n\nThe trial judge stated:\n\n\"Any money borrowed for ranch expense, interest will be allowed; otherwise, disallowed.\n\n\"I am not going back of the judgment I rendered. If I haven't made it clear, I remember one order particularly -- at least I'm pretty sure that the record shows this -- that when they got an allowance of $10,000 for less and had authority to borrow money and pay themselves interest on it, the didn't have it in their possession, which they didn't. Now, I don't think the record is clear as to what money was borrowed to pay expenses of ranch operations. If such was the fact, I would allow the interest if they had not depleted the estate sufficiently -- that is, if they didn't have enough money in their hands, or should have had enough money in their hands to pay it; that it perhaps a better way to say it.\"\n\nWe are in agreement with the trial court. Appellant so depleted the estate assets by paying the Vanderveer judgment and by making exorbitant charges for its services that it did not have money to meet expenses, and then advanced its own funds and charged interest. Such action cannot be approved by any court of equity. The interest charge was properly disallowed.\n\nThe next question involves the payment of inheritance and estate taxes. The trial court refused to allow appellant credit for $5,803.11 paid for Federal estate taxes and $1,090.93 paid for state inheritance taxes. The amounts were charged by the Federal and state governments against the property inventoried in the Reese Brown estate. Obviously, the taxes were not a legal charge against the Smith-Brown trust and were therefore not allowable. We understand that respondent will join with appellant in asking for a refund. In any event, the court was correct in refusing to allow the charge against the estate.\n\nWe now consider the question relative to accounting expenses. Appellant expended $4,954 for the services of expert accountants for accounting and income tax work. The trial court allowed $2,500 for these services. Appellant argues that it should be allowed the full amount for the reason that \"everything that appellant did was done\n\nas trustee for someone, for the estate creditors or Brown's heirs, or Tucker or for anyone interested in the estate.\"\n\nRespondent contends that no amount should be allowed for accounting expenses to appellant, but that on the other hand it should be charged with the costs and expenses incurred by respondent in the accounting. The charges for which he asks recovery are $12,000 expended in making the accounting and $50,000 attorney's fees made necessary by the refusal of appellant to account. Respondent points out the facts that appellant as successor trustee has at all times repudiated and denied the trust and has never at any time rendered any account of the Smith-Brown trust property. In his contention as to the facts relative to accounting, respondent is entirely correct.\n\nRespondent was compelled, as we have heretofore pointed out, to expend much valuable time and a considerable sum of money to ascertain the facts regarding the ownership of property held in Brown's name. At every step he was met by the able and determined resistance of appellant and its attorneys. We are unable to see why an allowance should be made for the payment of the expert accountants employed by appellant. Appellant kept books concerning the estate's business activities, and all that the accountant did was to copy the items in a report, a service which could be supplied by any competent stenographer. It made it accounting as administrator and gave no attention to its duty to account as successor trustee. Aside from these facts, the fees allowed appellant are sufficient to pay for preparing the accounts.\n\nA more serious question is presented on respondent's claim of error on the part of the trial court in not allowing him his necessary expenses in ascertaining the existence of the Smith-Brown trust funds and in presenting to the court a real accounting of the trust. Respondent has cited 65 C.J.S. 869; In re Grollman's Estate, 273 Pa. 565, 117 Atl. 351; In re Union Real Estate Inv. Co., 331 Pa. 569, 1 A. (2d) 662; Murphy v. Merchants Nat. Bank of Mobile, 240 Ala. 688, 200 So. 894; Buder v. Franz, 27 F. (2d) 101; Haas v. Wishmier's Estate, 99 Ind. App. 31, 190 N.E. 548; In re\n\nJohnston's Estate, 127 N.J.Eq. 576, 14 A. (2d) 469, as sustaining authority for his contention.\n\nThe authorities have application in a general way to some of the facts in the case at bar. However, they are not controlling. The costs and expenses in the instant case were due almost entirely to tracing trust funds. The whereabouts of the funds and their condition were not within the knowledge of appellant. It is quite true that much of respondent's work in the trial was due to the determined resistance of appellant. However, appellant had the right to defend on the part of the Brown estate and may not be penalized for so doing. Neither party may recover accounting expenses.\n\nAppellant maintains that the trial court committed error in not allowing its claim for premiums upon its administrative mind in the total sum of $3,588.\n\nThe claim was a proper one if it can be held that the bond was given for the benefit of the trust estate. In other words, the claim should be allowed against the fund if the terms and conditions of the bond made the surety responsible to the sestui que trust for the delivery of the trust property.\n\nOur statute in effect at the time the bond was given, Rem. Rev. Stat., § 1437 [P.C. § 9953], provided:\n\n\"Every person to whom letters testamentary or of administration are directed to issue must, before receiving them, execute a bond to the state of Washington, except as hereinafter provided, with such surety, or sureties, as the court may judge sufficient, which bond shall be in a sum to be fixed by the court, and which bond must be conditioned that the executor or administrator shall faithfully execute the duties of the trust according to the law, and such bond shall be approved by the court. . . .\" (Italics ours.)\n\nThe terms of the bond given by appellant complied with the provisions of the statute just quoted.\n\nBonds of compensated sureties are to be most strictly construed against the surety where the terms are susceptible of more than one construction. Duke v. National\n\nSurety Co., 130 Wash. 276, 227 P. 2; Glaspey v. Drolet, 6 Wash. 2d 610, 108 P.2d 375. However, the liability of a surety cannot be extended by implication. Simpson Logging Co. v. American Bonding Co., 76 wash. 533, 137 P. 127.\n\nThe liability of a bondsman is always measured by the express terms of his convents, the duties and obligations of his principal, as defined by the state statutes, and the conditions contained in the bond. The surety cannot be held liable unless the principal is liable. Stte ex rel. Reitmeier v. Oakley, 129 Wash. 553, 225 P. 425.\n\nBefore proceeding with a discussion of the cases, we desire again to call attention to the fact that respondent was not a creditor within the meaning of our probate law, and was not compelled to file a claim in the Reese B. Brown estate. Perkins v. Allen, 133 Wash. 455, 234 P. 25; McCullough v. McCullough, 153 Wash. 625, 280 P. 70; Lew You Ying v. Lew Kay, 174 Wash. 83, P.2d 596; Whipley v. Mills, 9 Cal. 641; In re Kibbe's Estate, 57 Cal. 407; Connecticut Trust \u0026 Safe-Deposit Co. v. Security Co., 67 Conn. 438, 35 atl. 342.\n\nThere are two clearly defined lines of cases on the question of whether a surety on an administrative bond is liable for property held by the administrator in his administrative capacity that did not belong to the person for whom he is the representative. The majority hold that the surety is not liable for misappropriation by the administrator of property that cannot be considered assets of the estate. The minority hold that the surety is liable for mishandling by the administrator of any property received by him under color of officer.\n\nUnder the majority rule, the surety is protected against extension of his liability beyond dealings with the state proper, while in a case like the one at bar the beneficiaries of trust property in the hands of the administrator are left without remedy against an absconding administrator. The minority rule avoids this hazard, but renders the surety's possible liability less certain. The reasoning on which the\n\nmajority opinion is based runs as follows: The purpose of the administrator's bonds is\n\n\". . . to secure creditors and next of kin from loss through the default or fraud of the administrator, and to furnish indemnity to the estate.\" 34 C.J.S. 1163, Executors and Administrators. § 944.\n\nThus the surety's obligation covers all dealings with assets of the estate proper, and the administrator cannot extend the liability of his surety by taking procession of property not assets of the decedent's estate.\n\nIn the case of bank of Newton County v. American Bonding Co., 141 Ga. 326, 80 S.E. 1003, 50 L.R.A. (N.S.) 1089, the administrator of the estate had borrowed money on behalf of the estate, but without authority so to do. The court held that the borrowed funds did not become assets of the estate; hence, the administrator was liable for them in his individual capacity alone, and not in his representative capacity. The court said that, since the surety's obligation goes only to the proper administration of the assets of the intestate, the surety\n\n\". . . is not liable to a third person because the administrator may have received into his possession and treated as assets property which never belonged to the intestate.\"\n\nIn reaching this result the court laid down the following clear statement of the rule:\n\n\"If goods or money belonging to another person be amongst the goods of the deceased, and they come altogether into the hands of the administrator, the goods or money of such other person are not assets in the hands of the administrator.\"\n\nIn Campbell v. American Bonding Co. of Baltimore, 172 Ala. 458, 55 So. 306, it was held that the liability of the surety depends upon the obligation of the principal acting in his representative capacity. The court there said:\n\n\"A test of representative or individual liability is whether the judgment, the suit against the administrator as such would invite, would 'fasten or establish a liability upon or against property of the decedent.' -- \"\n\nThe court went on to hold that liability is limited to dealings with assets of the estate of the decedent. Since the money sought ot be recovered was not an asset of the estate of the deceased, the administrator was liable in his individual capacity only; the surety could not be held.\n\nThere is a large group of cases concerned with the liability of the surety for the mishandling of the proceeds of insurance policies payable to the assured's estate, where the proceeds are not properly subject to administration. A leading case of this class is that of Pace v. Pace, 19 fla. 438, in which it was held that the administrator, as such, had no title to or right to possession of the proceeds of an insurance policy for the benefit of the assured's estate; hence,\n\n\" . . . sureties of the administrator are not responsible for the management of this fund by [the administrator]. . . . The sureties upon the bond of an administrator who has collected moneys, neither assets of the estate nor subject to distribution by him, and to which, as the legal representative of the decedent, he was not entitled, are not liable for any appropriation or use of the same by the administrator for his personal benefit.\"\n\nAccord: Bradford v. Watson, 65 fla. 461, 62 So. 484, and People v. Petrie, 91 Ill. 497, 61 N.E. 499, 85 Am. St. 268.\n\nAnother group of cases which are of interest are those arising in states where the lands of the decedent are not subject to administration along with the personal property of the estate. Where, in such cases, the administrator sells the lands without authority so to do, the sureties on his bond are not responsible for misapplication of the proceeds. In the case of Costigan v. Kraus, 158 Ky. 818, 166 S.W. 755, L.R.A. 1915D, 115, the court answered in the negative he question of whether the sureties on the administrator's bond were liable for the proceeds from the sale of land in Oklahoma which the administrator in Kentucky had no authority to sell.\n\nIn Warfield v. Brand's Adm'r, 76 Ky. 77, the court held that an administrator de bonis non cannot maintain an action against his predecessor for proceeds form the sale of\n\nproperty belonging to the estate, where such proceeds did not constitute assets of the estate. The court stated that the sureties of an executor cannot be liable for any other breach than that of the legal duties of such executor, and, where the latter is also a trustee, his functions as trustee are not covered by the executor's bond. See, also, Reynolds v. Nelson, 1 Ky. Opinions 523; Campbell v. Sacray, 19 Ky. Law Reporter 1912, 44 S.W. 980.\n\nIn the case of Johnson v. Hall, 101 Ga. 687, 29 S.E. 37, the heirs of the decedent, of which the administrator was one, agreed to sell one parcel of deceased's realty and divide the proceeds. The administrator conducted the sale but failed to pay to the plaintiff his portion of the proceeds. The plaintiff sued on the administrator's bond. It was held that the sureties were not liable since, in receiving the proceeds from the sale, the administrator acted in his individual capacity and as the plaintiff's agent, not as administrator. The proceeds of the sale were not assets of the estate, and the surety was liable only for acts relating to the administration of assets of the estate.\n\nWhile we do not consider the large number of cases relating to the administration of partnership property to be exactly in point there are two which seem to be worth mentioning. the first is the case of Higbee v. American Employers Ins. Co., 283 Mich. 328, 278 N.W. 85. There the court emphasized the fact that the sureties' liability behinds upon the terms of the contract. In that case, the surety was bound to secure the \"performance . . . of 'all order and decrees of said (probate) court . . . in the premises.'\" The principle was charged with the administration according to law of the goods, chattels, rights, credits, and estate of the deceased. the order which it was alleged the principal had refused to carry out related to partnership property, and the court held the sureties not liable on the ground that the order was not \"in the premises.\"\n\nIn Morris v. Morris, 56 Tenn. (9 Heiskell) 814, we find the following succinct statement:\n\n\"The property exempt from execution goes directly to the widow on the death of the husband. The representative, as such, can have nothing to do with it. If he interfere with or convert it, he is responsible as a wrong-doer in his personal capacity and not upon his bond; hence his sureties are not liable as such.\"\n\nThe Tennessee courts applied the same principle in the case of Sykes v. White, 14 Tenn. App. 327, wherein it was held that sureties on an administrator's bond are not liable for assets coming into the hands of the administrator which did not belong to or constitute any part of his intestate's assets.\n\nThe Georgia court made the following clear statement of its position on this point in the case of National Surety Co. v. Wages, 48 Ga. App. 720, 173 S.E. 451:\n\n\"When money or property of another comes into the hands of an administrator, it does not become an asset of the estate; no creditor has the right to subject it to the payment of his demand; and the surety on the administrator's bond is not liable to the injured party for its misapplication.\"\n\nIn the case of Watson v. Watson, 61 Ga. App. 825, 7 S.E.(2d) 614, the same court said:\n\n\"Money received by an executor, to which as executor he is not entitled, . . . can not, under the law, become a part of his decedent's estate.\"\n\nThe position of the Texas courts is indicated in the case of Greenwall v. Ligon, 14 S.W. (2d) (Tex.) 829, at page 833:\n\n\"It is the settled law of this state that, where an administrator or executor collects money, and it later develops that he is not the proper party ot make such collection, he would be individually liable, but his bondsmen would not be liable therefor.\"\n\nIn the case of McKenzie v. Standard Accident Ins. Co., 198 S.C. 109, 16 S.E. (2d) 529, the supreme court of South Carolina applied the majority rule to the facts before the court. In an action on an administrator's bond by distributess, after holding that the surety has a right to stand\n\nstrictly on the terms of his contract, the court goes on the say:\n\n\"The sureties on a bond of an administrator are liable only for a due accounting by their principal for the assets of the estate, and the principal cannot extend their liability by taking possession of property which is not properly assets of the estate. . . . The surety upon the bond of an administrator who has collected moneys, neither assets of the state nor subject to distribution by him, and to which, as the legal representative of the decedent, he wasn't entitled, is not liable for any appropriation or use of the same by the administrator for his personal benefit.\"\n\nThe Federal court applied this rule in the case of Carcaba v. McNair (CCA 5), 68 F. (2d) 795, saying:\n\n\" . . . it is well settled in Florida and elsewhere that has [administrator's] bond cannot be charged for the receipt of money which in fact was not assets of the estate even though he collected it as administrator.\"\n\nAn interesting case is that of Globe Indemnity Co. v. Bruce, 81 F. (2d) 143, especially when compared with Wiseman v. Swain, 114S.W. (Tex. Civ. App.) 145, which is discussed below. In the Bruce case, the court said:\n\n\"The personal representative cannot extend the liability of the surety by taking possession of the property not an asset of the estate. . . . In Boudinot v. Locust, 55 Okl. 662, 151 P. 579, 155 P. 698, the court held that where an administrator receives and accepts funds as an administrator, neither he nor the sureties on his bond will be permitted to deny that such funds were assets of the estate. But the principle of that case has no application here. The Globe Company does not assert the quarterly payments were not assets of the estate. It asserts that they were. But the plaintiffs, as the very foundation for their action, allege that the quarterly payments were not assets of the estate, and that Patton as administrator was not entitled to receive them. They may not insist that the surety is estopped to assert a fact which they affirm as the basis for their cause of action.\"\n\nTo sum up our statement of the majority rule, we can do no better than quote at length the lucid discussion by\n\nthe Rhode Island court in the case of Probate Court v. Williams, 30 R.I. 144, 73 Atl. 382:\n\n\"The obligation of the executor is that he shall well and truly administer, according to law and the provisions of said will, all and singular, the goods, chattels, rights, and credits of the testatrix at the time of her death, or which at any time after his appointment shall come to the hands and possession of the executor, or to the hands or possession of any other person or persons for him. The failure of the executor to so administer the goods, chattels, rights, and credits of the testatrix amounts to a breach of the bond. But property which the testatrix in her lifetime held in trust, or in which she had merely a life interest, are not assets of the estate, and no act of the executor as to such property will render him or the sureties liable upon the bond.\n\n\"'If the goods of another man be amongst the goods of the deceased, and then come altogether into the hands of the executor or administrator, these goods, that are the goods of another, shall not be said to be assets in the hands of the executor or administrator.' Sheppard's Touchstone, 498. And see Cooper v. White, 19 Ga. 554; Governor v. Executors of Hooker, 19 Fla. 163.\n\n\"When an administrator received property which did not belong to the estate, and which it was not a part of his duty to receive, his sureties could not be made liable, because their undertaking was that he should faithfully discharge his duties as administrator as prescribed by law. Johnson v. Hall, 101 Ga. 687.\n\n\"When property comes into the hands of an executor which is not assets of the estate, even though in his report he charges himself as executor with said funds, this does not create a liability against the sureties upon his bond.\" (Citations omitted.)\n\nTurning now to an examination of the minorty rule, we find that there are two lines of reasoning at its foundation. The first is that, where the administrator has taken possession of property under color of office, both he and his sureties are estopped to deny the title of the decedent to such property. The leading case employing this reasoning is that of Wiseman v. Swain, 114 S.W. (Tex. Civ. App.) 145. for the sake of clarity, we quote at length from that opinion:\n\n\"The gist and substance of the whole defense of the Fidelity \u0026 Deposit Company in this case is crystalized in the following proposition, advanced by an administrator in the case of DeValengin's Administrators v. Duffy, 14 Pet. 282, 10 L. Ed. 457: \"The administrator could not, by a wrongful receipt or conversion of property which did not belong to the intestate, create a debt against the intestate, or charge against the estate of the estate, which enables the owner of the property to come in as a general creditor against the estate. The administrator alone is personally liable for such wrongful receipt or conversion, even where the property has gone to the benefit of the estate.' To that proposition the Supreme Court of the United States responded: 'There are doubtless decisions which countenance the doctrine that no action will lie against an executor or administrator in his representative character, except upon some claim or demand which existed against the testator or intestate in his lifetime and that, if the claim or demand wholly accrued in the time of the executor or administrator, he is liable therefor only in his personal character. But upon a full consideration of the nature and of the various decisions on the subject we are of opinion that whatever property or money is lawfully recovered or received by the executor or administrator, after the death of his testator or intestate, in virtue of his representative character, he holds as assets of the estate, and he is liable therefor, in such representative character, to the party who has a good title thereto.' . . . It is utterly immaterial that the money may have come from the sale of fictitious stock or mere moonshine, or the mythical pot of rainbow money. It was received by Mrs. Swain in her capacity of statutory survivor, and was appropriated by her to the uses of the estate. As said in the case of Fidelity \u0026 Deposit Company v. Mortgage Co., 40 Tex. Civ. App. 489, 90 S.W. 197: 'Whatever an administratrix lawfully receives in her official capacity her sureties become responsible for. It is immaterial that it may thereafter develop that the property so received did not in law belong to the estate. If the receipt is lawful and in an official capacity, the surety becomes bound, and so remains until proper disposition is made of the thing received.' . . .\n\n\"It is a general principle of law that an administrator or executor, coming into possession of property by virtue of his position, is estopped, while he holds possession of the property, from disputing the title of testator or intestate.\n\nThe property must be surrendered and administration abandoned before the estoppel os removed. Bigelow, Estoppel, 554. A strong and pertinent case on this subject is that of Clark v. Pence, 111 Tenn. 20, 76 S.W. 885, in which the Supreme Court of Tennessee held, as correctly stated in the syllabus, that where an administrator collects notes payable to his intestate as executrix of her former husband's estate, the sureties on his bond cannot escape liability for his failure to account for the proceeds because, as administrator of the estate, he had no authority to collect notes, executed to her as executrix of her deceased husband, which could not legally pass to him as administrator, but passed to the administrator de bonis non of the deceased husband, since, having undertaken their collection, his sureties were responsible. The effect of that decision was to hold the sureties on an administrator's bond liable fro money collected by him which did not belong to the estate represented by him, on the theory that the sureties had made it possible for the administrator to collect the money, and should be held liable for its proper disbursement. This we think is the true doctrine, and that it would not be judicious, to use a mild term, to permit the trustee, in whose hands the estate of a decedent has been placed, to appropriate funds coming into his hands by virtue of the trust reposed in him, and then defend against an action of devastavit by attacking the title of the decedent to the property.\"\n\nA further use of the estoppel theory is made in the case of State ex rel. Gnekow v. United States F. \u0026 G. Co., 150 S.W. (2d) (Mo. App.) 581, where the sureties on an administrator's bond were held responsible for all moneys and property coming into the hands of the administrator by virtue of his office.\n\nThe second theory on which the minority rule is based is well expressed in the case of Perkins, 46 N.H. 110, in which an administrator received a fund consisting of pension money which was not an asset of the estate, but belonged to the children of the deceased. The surety was held liable for misappropriation of this fund, the court saying:\n\n\" . . . and we can see no reason for holding that he shall not be liable on his bond, without which he could\n\nnot have received the appointment and could have acquired no right to receive the money at all.\"\n\nThe minority rule appears to have been most vigorously announced and adhered to by the court of Missouri. The case of Nye v. United States F. \u0026 G. Co., 225 Mo. App. 593, 37 S.W. (2d) 988, is of interest in connection with the instant case. In the Nye case the decedent had held two bonds in trust. His administrator took possession of these bonds as assets of the estate. The court there held that suit against the administrator and his surety would lie in conversion, saying that the statement that, \"The liability of a surety on a bond of a representative does not extend to funds held by the defendant in trust which may come into the hands of the representative,\" amy or may not be true according to the facts. The Missouri court quotes from the case of Hill v. Escort, 38 Tex. Civ. App. 487, 86 S.W. 367, as follows:\n\n\"'Where an administrator obtains and converts property belonging to another under the belief that it belongs to the estate of his intestate, he is liable, in his representative as well as in his individual capacity, to the owner, for the value of the property; and, when sued in his representative capacity, the sureties are liable on his official bond, if his liability is established.'\"\n\nWhile it was conceded that money recovered in a wrongful death action did not constitute assets of the estate of the deceased subject to administration, the Minnesota court held the sureties of an administrator liable in an action by the administrator de bonis non against his predecessor and the latter's sureties for misappropriation of such fund. Vukmirovich v. Nickolich, 123 Minn. 165, 143 N.W. 255.\n\nIn People ex rel. Lent v. Hascall, 22 N.Y. 188, 78 Am. Dec. 176, the court held the sureties liable for mishandling funds on the ground that it could not be shown that the administrator received the funds in other than his representative capacity. However, in later case of In re Dunbar \u0026 Sullivan Dredging Co., 244 App. Div. 9, 278 N.Y. Supp. 303, affirmed 268 N.Y. 690, 198 N.E. 560, the court specifically held that the surety was liable where an administratrix\n\nreceived a fund belonging to the plaintiff, and when ordered by the court to pay it over to the plaintiff refused so to do. The court quoted with approval the following excerpt from the opinion of Justice Taney in the case of De Valengin's Adm'rs v. Duffy, 39 U.S. (14 Pet.) 282, 290, 10 L. Ed. 457:\n\n\" . . . whatever property or money is lawfully recovered or received by the executor or administrator, after the death of his testator or intestate, in virtue of his representative character, he holds as assets of the estate; and he is liable therefor, in such representative character, to the party who has a good title thereto.\"\n\nIn O'Neill v. Maryland Cas. Co. of Baltimore, 238 Wis. 529, 300 N.W. 167, the bond in question was conditioned that the principal should \"perform all orders and judgments of the court.\" The principal failed to comply with an order of the court relating to property not assets of the estate, but which came into his hands under color of office. It was held that the administrator could be sued in his representative capacity; therefore, the surety was also liable. Recognizing the fact that the majority rule is contra, the Wisconsin court held \"the instant surety\" liable.\n\nFor other cases upon this question, see 104 A.L.R. 195, and 19 Ann. Cas. 560.\n\nSince there appear to be substantial reasons for supporting either one of these two rules, we shall now refer to Washington cases for guidance in selecting the rule in keeping with our holdings.\n\nAs pointed out in this opinion, we are committed to the rule that the personal representative of the estate of a deceased trustee has the right to take the trust property into his possession. that is to say, he takes the trust property into his possession by color of his office.\n\nIn the early case of Collins v. Denny Clay Co., 41 Wash. 136, 82 P. 1012, we read:\n\n\"It is contended that, if the executor converted this stock, or wrongfully received dividend thereon which belonged to others he is liable in his individual and not in his\n\nrepresentative capacity. This stock stood in the name of the decedent at the time of his death, and came into the hands of his executor as a part of his estate. Under such circumstances the more equitable rule is that if the executor or administrator applies to the use of the estate money or the proceeds of property belonging to a third person, he is liable in both his individual and representative capacity, and the injured party may elect whether he will hold him in the one capacity or the other.\"\n\nThis case was followed in Rennie v. Washington Trust Co., 140 Wash. 472, 249 P. 992, where the court, speaking through Judge Main, said:\n\n\"The appellant contends that she had a right, if the money and property belonged to the appellant and the respondent refused to turn it over, to maintain an action, at her election, either against the respondent individually or in its representative capacity, and she elected to sue the respondent individually. Some courts have held that, in cases of this kind, the action could only be brought against the one who was representative of the estate in his individual capacity. The courts of last resort of three or four states have held that the action could only be maintained against the administrator or executor in his representative capacity. Other courts have held that the one having the right to the property could maintain an action against the administrator or executor either in his representative capacity or individually. In other words, the administrator or executor would be liable both in his individual and representative capacity. . . .\n\n\"This court in Collins v. Denny Clay Co., 41 Wash. 136, 82 P. 1012, adopted the rule that the action might be maintained against the executor of administrator either in his individual or representative capacity. It was there said: [Quotes portion from Collins case set out above.]\n\n\"The great majority of the courts have adhered either to the rule of individual liability or to the liability in both capacities. It is sought to distinguish the Collins case from the present, but we think that the rule of that case was deliberately adopted by the court and is controlling on the question. The court was there considering what rule it would adopt and put in unequivocal words its thought on the question. it would serve no useful purpose at this time, in view of that holding, to review the many decisions on the question.\"\n\nThe purpose in quoting these cases at such length is to show the deliberation with which this court adopted the rule of liability in both individual and representative capacities for dealings with property not actually belonging to the estate of the decedent.\n\nConsideration of the cases from other jurisdictions reviewed above shows that the majority rule is applied by those courts which hold an administrator to be liable in his individual capacity only for misfeasance with respect to property not assets of the estate, while those courts applying the minority rule do so after finding liability in the representative or both capacities. It is clear that the liabilities of the sureties are logically dependent upon the liability of the principal; hence, one conclusion necessarily follows from the other.\n\nThis rule is supported by our decisions relative to the duties of loyalty which a trustee owes and the requirement that he must account to the cestui que trust for all of the trust property.\n\nIn adopting the minority rule, we do not mean to hold a surety liable for personal wrongs of the principal without the law. We simply hold that the bond covers all moneys or property received by color or virtue of office.\n\nBrown was the trustee of the fund turned over to him by Mrs. Smith, and as such it was his duty to return the trust assets to Mrs. Smith. This liability did not change with the death of Brown, but continued the liability to his successor -- the appellant. To say that appellant was not liable on its bond is to say that the trust lost its right to have the funds returned at the time Brown died. Having received the funds into its possession as successor trustee, appellant and its bondsmen became liable for their surrender to the Smith estate. In view of this holding, the charge for bond premiums will be allowed the appellant.\n\nAppellant predicates error in the refusal of the trial court to allow certain claimed credits and to a surcharge charge made against it. The refused credits were an appraiser's fee of $150; fees paid to an abstract company for a search of title records, $100; costs of investigation bearing\n\nupon the correctness or incorrectness of respondent's claim and the validity or invalidity of the trust; traveling expenses in connection with the investigation; expenses incident to the petition for instructions relative to its participation in the accounting trial, and litigation and in connection with respondent's appeal.\n\nThe expenses, with the exception of the sum paid the abstract company, were not for the benefit of the trust estate, and were properly disallowed. In order to collect and protect the trust property, it was necessary to ascertain the extent of Brown's holdings and the description of the real estate standing in his name. The item paid to the abstract company will be allowed.\n\nAppellant also claims that the money and properties received by the Browns by virtue of the settlement stipulation should have been paid to it. It argues that Mrs. Brown and Fred Brown were the heirs of the Brown estate, and that various expenses of administration and creditors' claims have legal priority over the claims of heirs. There is no merit in this contention. The property held by the Browns was that of the trust in which the Reese B. Brown estate had no interest whatever. Therefore, any settlement agreement made by the respondent and the Browns was of no concern to appellant.\n\nAppellant objects to the court's refusal to allow it credit for certain moneys expended by Brown immediately after Mrs. Smith's death. Shortly after she died, Brown expended $1,607.32 in payment of her hotel, medical, nursing, and funeral expenses at Montreal. Thereafter, he brought suit against Mrs. Smith's heirs, naming her as Sarah Patterson, to recover $16,780. The ostensible purpose of this action was to gather unto himself the balance of his victim's fortune amounting to $7,249, beside certain effects left by her in Montreal. The amount for which the action was brought included the expenses just referred to. Brown paid these amounts from the proceeds of Liberty bonds owned by Mrs. Smith and sold by him through an agent, June 26, 1932.\n\nThe court's action in disallowing this credit was entirely correct.\n\nIt is contended that the trial court erred in entering a personal judgment against appellant. The decree provided:\n\n\"21. That in respect of item (b) of paragraph 20 hereof in the sum of $48,000.00, as between Bonsted \u0026 Nichoson and Fred C. Palmer, Jr., on the one part, and Guaranty Trust Company on the other part, Guaranty Trust Company has paid to them the sum of $41,419.17, of which $7219.17 was on account of expenses and it forthwith shall pay to them the balance thereof, namely, $6580.83.\"\n\nThe only evidence relative to the contract entered into between appellant and its attorneys was given by Mr. Boyle, who testified that Mr. Bonsted and his firm should receive \" . . . so much reasonable fees as the court would allow.\" When asked as to the source of payment, he said: \"Well, they always come out of the estate, of course, where you are probating an estate.\"\n\nIn view of the fact that no definite contract was entered into concerning the source of the payment to the attorneys, and in consideration of what Boyle said concerning the custom of paying from the funds of an estate, we conclude that the attorneys were not entitled to a judgment against appellant for the $6,580.83 mentioned in the decree.\n\nThe trial court's action in allowing costs against appellant is challenged on the ground that nearly all of the costs were incurred before appellant individually was made a party to the action. It bases its claim upon the provisions of Rem. Rev. Stat., § 489 [P.C. § 7470], which reads:\n\n\"In [an] action prosecuted or defended by an executor, administrator, trustee of an express trust, or a person expressly authorized by statute, costs shall be recovered as in an action by or against a person prosecuting [or defending] in his own right, but such costs shall be chargeable only upon or collected of the estate of the party represented, unless the court shall direct the same to be paid by the plaintiff or defendant personally for mismanagement or bad faith in such action or defense.\"\n\nAppellant argues that it did not act in bad faith in defending the action instituted by respondent. There is no point in again recounting the various disloyal acts of appellant, its agents, and attorneys in doing everything possible to defeat the recovery of the trust funds. Their refusal to abide by the rules imposed upon trustees amounted to bad faith in so far as respondent and the trust were concerned. This in itself served to make appellant label. We hold that the court was entirely justified in assessing costs against appellant.\n\nThe next question concerns the expenses incurred by appellant in the defense of two actions known as the Hudson and Newman suits. Hudson had sued Bron for $200,000 for fraud growing out of an apartment house deal in Seattle. Newman brought his action against appellant based on a promissory note alleged to have been signed by Brown. The actions were each settled on the eve of trial; the Hudson suit for $1,100 and the Newman suit for $6,500.\n\nRespondent concedes that appellant is not liable for the sum of $7,600 paid under these settlements.\n\nIt is appellant's contention that it is entitled to its costs and attorneys' fees necessarily expended in the defense of these actions. Respondent, on the other hand, maintains that the actions were brought against Brown and could not have been satisfied from trust funds, and that the expenses of litigation were therefore not for the benefit of the trust. The court disallowed the claim.\n\nThe stipulation entered into between respondent and appellant relative to the settlement made no reference to costs or attorneys' fees. The following provision in the agreement indicates that respondent was not in any way responsible for the costs or fees:\n\n\". . . it being the intention that the payment of $6,500.00 to Harry Newman shall be a charge against the Reese B. Brown Estate, and shall never be a charge against the Sarah E. Smith Estate; and it being the intention that the Guaranty Trust Company shall be relieved of responsibility to any of the parties hereto in the event there shall not be sufficient funds in the Brown Estate to pay the said sum of $6500.00.\"\n\nThere is no difference, in so far as the rule of law is concerned, between these cases and that of the Vanderveer judgment already discussed and decided. The expenses incurred by appellant were not for the protection of the trust fund, and the superior court sitting in probate did not have jurisdiction to allow the expenses. The action of the trial court in denying appellant's claim for defending these actions is approved.\n\nThe trial court refused to give appellant credit for $5,000 paid by Mrs. Brown as guardian of Fred Brown. This sum was to apply upon the expense of defending the case of Tucker v. Guaranty Trust Co. That action of the court is assigned as error. The court was correct in so deciding. All the property held by the Browns was trust property. The amount paid by Mrs. Brown was but a transfer to appellant of a portion of the trust estate. Moreover, the expenses of defending the Tucker suit could not be properly charged against the trust estate.\n\nFinally, appellant questions the action of the trial court in dismissing its cross-complaint against A. J. Falknor, D. H. Bonsted, and others. The record discloses that the trial court passed upon the cross-complaint on two occasions: First, by the entry of the order dated May 27, 1942, in which it was ordered that the demurrer be sustained and the cross-complaint dismissed; and, second, in the entry of paragraph 31 of the final decree which we have set out in the first portion of this opinion. The assignments of error are:\n\n\"(1) In sustaining respondents' demurrer to appellant's amended and supplemental answer and cross-complaint.\n\n\"(2) In granting respondents' 'plea in bar and motion to dismiss.'\n\n\"(3) In dismissing with prejudice and with costs, by the same order, prior to trial, appellant's amended and supplemental answer and cross-complaint as to respondents.\n\n\"(4) In entering the order dated May 27, 1942, and filed on May 28, 1942, and particularly paragraph 1 thereof, dismissing respondents from the action prior to trial.\"\n\nRespondent says that the order was entered at the close of the trial of an issue or issues of fact, and that this appeal should be dismissed because appellant has filed no statement of facts. However, the record does not indicate that a trial was had upon the issues pertaining to the liability of the additional defendants Falknor, Bonsted, and others. The matters which the court heard, in so far as additional defendants were concerned, are described in the order appealed from, as follows:\n\n\"(a) Demurrer of A. J. Falknor, defendant, and C. K. Poe, DeWolfe Emory, Drayton F. Howe, Additional Defendants;\n\n\"(b) Supplemental Demurrer of A. J. Falknor, defendant, and D. K. Poe, DeWolfe Emory and Drayton F. Howe, additional defendants;\n\n\"(c) Demurrer of Sadie R. Brown, Fred R. Brown, a minor (now of legal age), Sadie R. Brown, as guardian of the person and estate of Fred R. Brown, a minor (now of legal age) and Sadie R. Brown, as executrix of the estate of Reese B. Brown, deceased (now resigned);\n\n\"(d) Plea in Bar and Motion To Dismiss A. J. Falknor, defendant, and C. K. Poe, DeWolfe Emory and Drayton F. Howe, additional defendants;\n\n\"(e) Plea in Bar and Motion to Dismiss of Sadie R. Brown, Fred R. Brown, a minor (now of legal age), Sadie R. Brown, as guardian of the person and estate of Fred R. Brown, a minor (now of legal age) and Sadie R. Brown, as executrix of the estate of Reese B. Brown, deceased, (now resigned);\n\n\"(f) Motion to Strike and Make More Definite and Certain of A. J. Falknor, defendant, and C. K. Poe, DeWolfe Emory and Drayton F. Howe, additional defendants, . . .\"\n\nNone of the above tenders an issue of fact, unless it be (d), called a \"Plea in Bar and Motion to Dismiss,\" a plea not provided for in our statutory procedure. Judging from those parts of the record which we have authority to notice, we cannot find anything to indicate, with certainty, that any issue of fact was tried out. There was a statement made in open court by attorney for the plaintiff, Tucker. There was a stipulation which had been entered into by\n\nsome of the parties, and which had been referred to in the pleadings, which was also discussed. But from those facts alone we are unable to determine that there was, in any real sense, a trial of an issue of fact, or that the appellant ever consented to the trial of an issue of fact at a hearing held to consider demurrers and motions.\n\nIt appears that, with the commendable purpose of attempting to simplify this extremely complicated litigation, the trial court took a kind of short cur not specifically authorized by our rules and statutory provisions relating to procedure. Simple as our statutory procedure appears on its face, a staggering proportion of the time of the courts, and of the bar also, is taken up with contentions relating to it; and we are strongly disinclined, even in order to reach what seems a common sense result in a particular case, to recognize judicially such unauthorized pleadings as \"pleas in bar\" and so-called \"speaking demurrers.\" To do so would inevitably open up vast new fields of procedural confusion.\n\nThe appellant's contention that the dismissal of the cross-complaint was premature and wholly unauthorized by law must be sustained.\n\nWe shall now consider the assignments of error urged by respondent on his appeal.\n\nThe first claim of error is the refusal of the trial court to charge appellant with the sums it paid to Mrs. Brown and her son Fred. Subsequent to October 1, 1934, appellant paid Mrs. Brown, principally as a widow's allowance, the sum of $31,779.50, and to Fred Brown the amount of $19,416.10 for rent of the property in his name. The property held by Fred Brown was a portion of the Smith-Brown trust which had been deeded to him by his father.\n\nIt is argued by respondent that these payments were made after appellant had been fully advised of respondent's interest and action had been instituted to recover the trust property; further, that the payments were made from the trust estate and not from any assets belonging to the Reese B. Brown estate. Appellant, on the other hand, contends that the payments were made in obedience to the\n\ncourt's order, that respondent forgave payment by making a settlement with the Browns, and that, having released the joint tort-feasors, the Browns and the Falknor firm, respondent cannot now recover from appellant.\n\nThe solution of the problem depends upon the answer to the following questions: Were the payments made for the benefit of the trust? Did the court's order relieve appellant? And was respondent estopped from recovering from appellant because of its settlement with the Browns and with the Falknor firm of attorneys?\n\nIt is quite obvious that the payments made to the Browns were not for the benefit of the trust. Mrs. Brown's security did not aid the trust fund, and Fred Brown was paid for the use of property already owned by Smith-Brown trust. The court's orders approving the payment did not, and could not, affect the trust property, for the reason that the court did not have jurisdiction over the trust estate. Our reasons for so holding have heretofore been set out in our discussion concerning the Vanderveer judgment. The property released by the Browns was of small value, consisting of an insurance policy upon their lives, an old automobile, and some personal belongings. Out of the assets delivered to respondent, $2,000 was used to pay attorneys' fees to Por, Falknor, Emory \u0026 Howe.\n\nThe stipulation provided, inter alia, that respondent\n\n\". . . specifically reserves the right to recover from George Vanderveer and Lybrand, Ross Bros. and Montgomery any money received in connection with the administration of the Reese B. Brown estate, and to recover from Guaranty Trust Company, individually and as administrator de bonis non of the estate of Reese B. Brown, deceased, and from D. H. Bonsted, any demands or claims asserted by party of the first part in his amended complaint and in his petition for return of trust property, application for injunction, petition for other relief and supplemental allegations filed herein, . . . provided further that the party of the first part shall indemnify and hold harmless C. K. Poe, A. J. Falknor, DeWolfe Emory and Drayton F. Howe, and each of them, from any successful claims or demands that may be made upon them, or any of them, by said Guaranty Trust Company as asministrator, for the\n\nreturn of any attorneys' fees paid to them as attorneys in this action, or in the estate of Reese B. Brown, deceased, or for any sum paid by the said attorneys or paid by the Guaranty Trust Company, as administrator, or by Sadie R. Brown, as executrix, at the request of said attorneys.\"\n\nThe action brought against the Browns, as we have heretofore indicated, was to recover the property held in the name of Fred Brown, claiming that it was portion of the Smith-Brown trust estate. That action was based upon the theory that the property was held under an express trust, and therefore it was an action upon a contract and not one in tort.\n\nOur decision in the case of North Pacific Public Service Co. v. Clark, 185 Wash. 132, 52 P.2d 1255, is controlling. That case discloses the following facts: A corporation and two individuals entered into a joint and several contract to buy a tract of timber. The individuals were subsequently released from liability, but a statement was made in the agreement of release that it did not in any wise operate to discharge the corporation's liability under the contract. The question decided in that case was whether or not the release of the two joint obligors released the third. In passing, this court stated:\n\n\"The general rule is that a release by a creditor of one of several persons who are jointly or jointly and severally obligated is to discharge them all. But that rule is not applicable where, in the release, there is an express reservation of rights against the co-obligor or co-obligors. In Restatement of the Law of Contracts, American Law Institute, Contracts, § 122, p. 142, it is said:\n\n\"'Written or oral words of a person entitled to enforce a promise which purport to discharge the promisor but expressly to reserve rights against other promisors jointly bound for the same performance do not operate as a discharge of the promisor but only as a promise not to sue him, . . .'\n\n\"Attention has been called to the fact that, in this state, the release of one joint tort-feasor, even with the reservation that it is not to be considered as a release against any other of the joint tort-feasors, operates as a release of all. There is a reason in tort cases why that should be the rule,\n\nwhich does not exist in the present case. In the case of tort, there is no fixed standard of liability, and the right of a tort-feasor, not released, to enforce contribution against the one released would be difficult and impractical. But that is not the case where there is a standard of liability which may be sustained by proof.\"\n\nThe last portion of the above quotation was approved in Haney v. Cheatham, 8 Wash. 2d 310, 111 P.2d 1003. Accord: 45 Am. Jur., Release, § 34; 23 R.C.L. 404; 53 C.J. p. 1251, Release, § 1274.\n\nWe hold that the amounts to which we have just referred were improperly expended by appellant and that they should be paid to respondent as part of the trust estate.\n\nRespondent assigns as error the court's action in allowing appellant a credit of $5,064.60 paid by it to the internal revenue department of the United States. During the time that appellant operated the ranch, it paid the amount just mentioned to the Federal government as income taxes on the theory that a net profit of $65,000 was earned in the ranch operations. October 14, 1941, the parties to this action entered into a stipulation which reads in part:\n\n\"That any and ll taxes of any kind, shape or description, heretofore or hereafter levied, paid or accrued, except Washington State Inheritance Taxes and Federal Estate Taxes heretofore paid, and including any and all taxes levied under the internal revenue laws of the United States of America, arising out of the operation or sale of any of the properties described in the inventory in the matter of the estate of Reese B. Brown, deceased, . . . shall be an expense of operation and administration of such properties, and such taxes shall be paid out of the proceeds of such properties and be a credit upon the accounts of the Guaranty Trust Company, a corporation, in any and all of the above entitled actions. The taxes so paid shall not be charged or surcharged against Guaranty Trust Company individually, as administrator aforesaid, or as trustee, or in any of its capacities.\"\n\nRespondent contends that the agreement was not binding on it, because of the provisions in the last portion of the stipulation, reading as follows:\n\n\"The execution of this stipulation or any order entered hereon shall not constitute a waiver of any of the rights, claims or contentions of any party hereto, heretofore or hereafter taken by him or it in any of these proceedings except in so far as such claims, contentions or positions are contrary to the specific provisions of this stipulation, and all of such rights, claims and contentions are hereby preserved to the parties hereto.\"\n\nIt seems clear to us that respondent, by this agreement, waived any claim as to the validity of the payment of the income tax. The trial court's decree relative to the allowance is approved.\n\nRespondent predicates error on the trial court's refusal to require appellant to deliver all the Smith-Brown trust property it received or its value. It is a fact that, under its appointment in February, 1934, appellant came into possession of trust property of the value of $439,000, and under its second appointment in October, 1934, it had returned to it most of the same property of the value of $378,000.\n\nRespondent argues that it became the duty of appellant to surrender the trust to respondent with such accounting as it could give of Brown's administration. We are in entire accord with the merits of respondent's contention; however, the property has been sold and can not be returned.\n\nIt is quite true that much has been lost due to long continued litigation, due, for the most part, to the ability of appellant, by legal means, to delay the return of trust funds. Our holding in this case effects the payment of the value of the trust less the cost of protection.\n\nRespondent argues that he should be allowed interest upon the value of the trust property which appellant withheld. He takes the position that the fact of the hostile attitude on the part of appellant, its efforts to defeat and invalidate the trust, and its hostile possession for eight and one-half years, entitle him to interest upon the value of the property for the period of time he and his principals were denied the use and possession of the property. In McBride v. McBride, 262 Ky. 452, 90 S.W. (2d) 736, we\n\nfind a situation somewhat similar to the one present here. In that case, it appears that certain individuals were trustees of a fund lent to them by the provisions of a will. They refused to surrender the funds to a person entitled to receive them, and the trial court held the trustees for the payment of interest, but forgave a certain period of time in order that they might make their report. In passing, the Kentucky court of appeals stated:\n\n\"We see no legal grounds for relieving the trustees of the interest upon the trust funds in their hands, while they continued to wrongfully withhold and manage the same beyond the time, as adjudged, when they were rightly obligated to properly distribute it among the devisees upon the termination of the trust under which same was held. Therefore we conclude that the delinquent trustees should be chargeable with interest during the whole period of their default in failing to make a due distribution of the trust fund distributable upon its termination. The adjudged pardoning of their delinquency for such period of time results in the loss and penalizing of the innocent appellant, of which we do not approve as appropriate.\"\n\nIn Russell v. Russell, 164 Miss. 335, 144 So. 542, an administrator's last act was filed January 13, 1925, but he did nothing further to close the estate until called to task in June, 1930. The trial court charged the administrator interest on the value of the estate withheld. In speaking of that action assigned as error, the supreme court said:\n\n\"First, that the court was in error in charging the administrator with interest, compounded at the rate of six per cent per annum. The court was not only right in so adjudging, but it was the duty of the court so to do, in a case such as this. When an administrator unreasonably delays to make his final settlement, and uses the funds for his own purposes or holds them dead in his hands without just cause, the interest as stated must be charged and compounded as the court did in this case. Owens v. Owens' Estate, 84 Miss. 673, 689, 37 So. 149; 24 C.J., p. 73.\"\n\nIn In re Hilliard's Estate, 83 Cal. 423, 23 P. 393, the court imposed interest on funds held by executors for approximately eight years after the estate was ready to be closed. This holding was based on undue delay in closing\n\nthe estate and making distribution. The applicable rule in California is found in the early case of Wheeler v. Bolton, 92 Cal. 159, 28 Pac 558.\n\nWe find the following in Judd v. Dike, 30 Minn. 380, 15 N.W. 672:\n\n\"The court below finds that, in the course of certain transactions relating to property held by defendant in trust for plaintiff, defendant received certain bonds -- a one-fourth interest in which defendant 'held in trust' for plaintiff; that defendant had sold four of the bonds for cash; and that plaintiff was entitled to her proportionate share of the sums received for them, with interest on the same from the times when such sums were respectively received. The defendant, expressly admitting in his brief that the judgment was entered by a computation of interest according to the finding, insists that the finding was wrong, in that interest should have been computed only from the time when the money received for the bonds was demanded. We do not agree to this. It does not lie in the defendant's mouth to deny that it was his duty to pay or offer to pay to plaintiff her proportionate share of the money realized from the sale of the bonds as soon as he received it. If he recognized the trust, this duty followed as a matter of inference. If he repudiated the trust, and accordingly appropriated the money to his own use, it was a conversion. In either event he should make good the loss ensuing to plaintiff, by paying her interest from the time when she was entitled to the money.\"\n\nIn Lasker-Morris Bank \u0026 Trust Co. v. Gans, 132 Ark. 402, 200 S.W. 1029, a trust fund was held by one Heiseman by virtue of a resulting trust. Speaking upon the question of interest which it was contended should be charged after a demand was made for the fund, the court stated:\n\n\"We are also of the opinion that interest was properly allowed on this demand. The court computed the interest from the date of each of these sales, the result of which is to charge Heiseman with the interest on the money during the time it was in his possession. The argument that a great length of time was permitted to expire before any demand was made for a settlement, has more force when made in support of the plea of laches than it has\n\nwhen made against the allowance of interest. If the estate of Heiseman should be held for this money at all, it should also be held for the interest which accrued from the date of the sales, at which time, as a matter of law, it was the duty of Heiseman to account to his associates for their pro rata share.\"\n\nAppellant calls our attention to the following cases which we will now consider: Feighan v. Reeves, 61 Wash. 465, 112 P. 627; Ryan v. Plath, 18 Wash. 2d 839, 140 P.2d 968; Fitchard v. Hirschberg's Estate, 128 Ore. 317, 272 P. 906, 274 P. 505; Haines v. Hay, 169 Ill. 93, 48 N.E. 218; and In re Kipp's Estate, 286 Pa. 90, 132 Atl. 822.\n\nIn the Feighan case the court disallowed an interest charge against a trustee who had retained a trust property for an over-long time; however, the basis of refusal to charge interest was that the owners of the beneficial estate were in fact benefited by the use of the income of the fund in that it was applied to the payment of interest-bearing obligations of the trust.\n\nThe Ryan v. Plath, supra, case is of no aid to appellant, for the reason that the denial of allowances to the Cestuis que trustent was due to a failure to allege any lack of reasonable care and diligence in the management of the property after the trustee had received a deed to the property.\n\nThe court in Fitchard v. Hirschberg's Estate, supra, held that mere delay in closing an estate would not justify the charge of interest, but that the circumstances of each case should be considered before an interest charge will be allowed or denied. The court refused to charge interest because funds were retained by the administrator to meet the possibility of having to pay a large disputed claim against the estate.\n\nIn Haines v. Hay, supra, interest was allowed cestuis que trustent against an estate which had possession of the trust fund; however, the court refused to allow this charge to be made against the administrator.\n\nIn In re Kipp's Estate, supra, interest was not allowed because the trustee acted \"with the utmost diligence.\"\n\nThough the cited cases are helpful in arriving at a just\n\nconclusion on this question, they cannot be said to be in point. Their directive force and the determination plainly indicated in all of our decisions to protect trust funds and compel exact compliance by trustees of their duties, impel us to hold that interest must be charged against appellant in this case. The real necessity of this holding is dictated by every act of appellant in its determined fight to defeat the trust and the surrender of the estate to respondent. The theory upon which courts of equity charge interest upon retained trust funds is to compensate the owners for the loss of their use. Equity will impose simple interest in ordinary cases in which there is no wilful or unlawful use or withholding, and compound interest in those cases in which the trustee wilfully withholds the property or uses it for his own purposes. Some excuse may be put forward to justify appellant's action prior to our decision in Tucker v. Brown, 199 Wash. 320, 92 P.2d 221. There is absolutely none since that time.\n\nA reasonable time should be allowed to make the report commanded by this court in the Tucker case. In our opinion the report should have been completed within six months' time. Interest at the rate of six per cent per annum shall be charged against appellant in this case from December 22, 1939, to the date of the judgment entered by the trial court; the interest to be computed upon the amount which we have decided shall be paid by appellant to respondent.\n\nRespondent complains that the trial court should have charged appellant with $6,170 which it had paid to J. W. Maxwell in payment of a loan to Reese B. Brown.\n\nIn the course of the extended dealings by Brown with the National Bank of Commerce in Seattle, J. W. Maxwell, a vice-president of that institution, made advances and loans to Brown which were evidenced by several notes in favor of Maxwell. June 10, 1933, the balance due on these loans amounted to $6,000, and at that date, one note in the amount of $6,000 was given to Brown to cover the entire indebtedness. The note was secured by Yakima water bonds pledged with Maxwell. Sometime prior to\n\nMay 28, 1936, the Guaranty Trust Company authorized Maxwell to sell the bonds. Out of the proceeds, which totaled $8,322.80, Maxwell retained $6,170 in payment of the loan and interest, and turned the balance over to the trust company. There is no evidence as to the nature of the loans made by Maxwell to Brown, no evidence as to what became of the funds so loaned, nor any evidence tending to show the terms of the bonds, the new $6,000 note, or any change of position by Maxwell on taking the new note. Neither the bonds nor the note is before the court. All the evidence relating to this transaction is found on page 17 of exhibit No. 510. Since this exhibit is a stipulation voluntarily entered into between the parties as to the evidence of this and other transactions with the National Bank of Commerce, we can only assume that it makes a record satisfactory to both parties.\n\nRespondent argues that the amount obtained from the sale of the bonds and retained by Maxwell was part of the Smith-Brown trust, and that appellant had no right or authority to agree that the debt owed by Brown should be paid from the proceeds of the sale of the bonds. It is the contention of appellant that the bonds were negotiable; hence, Maxwell became a holder in due course to the extent of the debt owing to him and the bonds could not be recovered by appellant.\n\nUnder the agreed facts of this transaction, there is no evidence tending to show that the bonds were in fact negotiable.\n\n\"The negotiability of a bonds must be determined from the writing itself, and cannot depend on extrinsic evidence and if the terms of a bond force a search beyond its stated provisions for any of the essential qualities of negotiability, then the bond is not negotiable.\" 11 C.J.S. 437, Bonds, § 64.\n\nHere the bonds are not before the court; hence, there is not a scintilla of evidence from which negotiability could be inferred. All the Property in Brown's hands prior to his death has been shown to has been held by him in trust for the Smith estate. The agreed facts show that these\n\nbonds were sold by Maxwell at the direction of the trust company, successor trustee, to pay Brown's personal debt. Such a showing makes out a prima facie case that the trust was breached. The fact, if fact it be, that the bonds were negotiable, then became a matter of affirmative defense, but the trust company introduced no evidence to this effect. From the facts to which reference has been made, we must proceed on the assumption that the bonds were nonnegotiable, and that Maxwell was not a holder in due course.\n\nThe bonds were pledge by Brown to secure a preexisting debt, and the giving of the new note did not change the character of the indebtedness in this respect. In the case of Canadian Bank of Commerce v. Sesnon Co., 68 Wash. 434, 123 P. 602, this court said at page 439:\n\n\"The contention that the indebtedness of the Kimball Company to the bank is paid is also without foundation. It is based on the fact that the indebtedness was originally represented by overdrafts and was afterwards put into the form of negotiable promissory notes. But this did not constitute a payment as between the parties. It changed the manner in which the debt was evidenced, but the debt continued to exist nevertheless.\"\n\nWhere property which is subject to a trust is pledged by the trustee to secure his own antecedent debt, the pledgee is not a bona fide purchaser for value even though he had no notice of the trust. The preexisting debt is not value, and the pledgee takes the property subject to the trust. In Scott on Trusts 1681, § 305, we find the following pertinent statement:\n\n\"Security for antecedent debt as value. If a trustee in breach of trust transfer trust property as security for a debt or other obligation owed by the trustee to the transferee, it is held by the great weight of authority, subject to the exceptions hereafter stated, that the transferee takes the property subject to the trust. The same rule is applied to other equities in the property transferred. Thus it has been held that where a person holding the legal title to land subject to a trust or other equitable claim transfers it to another as security for a pre-existing indebtedness, the transfer is not for value, and the transferee holds the property subject to the trust or other equitable claim even\n\nthough he had no notice. So also it has been held that one who takes chattels as security for an antecedent debt takes subject to equities. It has also been held that if shares of stock subject to an equity as transferred as security for a pre-existing debt, the transfer is not for value.\"\n\nThe principle that a mortgagee taking a mortgage to secure an antecedent debt does not give such value as to constitute him a bona fide purchaser for value as against prior equities, is applied in the early Washington case of Goetzinger v. Rosenfeld, 16 Wash. 392, 47 P. 882, 38 L.R.A. 257. That case involved priorities between a judgment and a mortgage where both were filed the same day. This court said:\n\n\"The judgment of Vessey was evidently filed very shortly after the mortgage, the same afternoon, after three o'clock. There was no new consideration whatever for the execution of the mortgage held by plaintiff. It was executed to secure an antecedent debt. We cannot place this mortgage in the same rank with one which was executed upon a present valuable consideration, and where the mortgagee in good faith advanced his money upon the faith of an existing clear record of unincumbered real estate.\"\n\nIn the case of Hicks v. National Surety Co., 50 Wash. 16, 96 P. 515, 126 Am. St. 883, we find the following question and its answer:\n\n\"The instrument under which the appellant claims was taken as security for a pre-existing debt or a pre-existing contingent liability. Under such circumstances does it come within the definition of an incumbrancer for value and in good faith, as that term is defined by law? Under the great weight of authority it does not.\"\n\nThis opinion then goes on to cite a number of authorities, among which is the leading case on this point in the United States supreme court, People's Sav. Bank v. Bates, 120 U.S. 556, 30 L.Ed. 754, 7 S. Ct. 679. Mrs. Justice Harlan states the problem confronting the court:\n\n\"This disposes of all the material questions in the case preliminary to the main inquiry whether the bank -- the mortgage to it having been really given to secure past\n\nindebtedness of the mortgagors -- is, in the meaning of the statute, a subsequent 'mortgagee in good faith.'\"\n\nThe learned justice then proceeded to examine the case of Swift v. Tyson, 41 U.S. (16 Pet.) 1, 10 L. ED. 865, saying:\n\n\"the general doctrine announced in Swift v. Tyson was, that one who becomes the holder of negotiable paper, before its maturity, in the usual course of business and in payment of an existing debt, is to be deemed to have received it for a valuable consideration, and is, therefore, unaffected by any equities existing between antecedent parties. In that case, Mr. Justice Story said that the rule was applicable as well as when the negotiable instrument was received as security for, as when received in payment of, a preexisting debt.\"\n\nThe writer continued:\n\n\"Do these principles apply to the case of a chattel mortgage given merely as security for a preexisting debt, and in obtaining which the mortgagee has neither parted with any right or thing of substance nor come under a binding agreement to postpone or delay the collection of his demand? Upon principle, and according to the weight of authority, this question must be answered in the negative.\"\n\nThis principle is reiterated by this court in Malm v. Griffith, 109 Wash. 30, 186 P. 647, where it is stated:\n\n\"It has become the settled law of this state, in harmony with the generally prevailing rule elsewhere, that the mortgaging or conveying of property to secure a pre-existing debt does not confer upon the grantee the right of a bona fide purchaser for value, as against the right of those acquiring a prior interest in the property, though such acquired prior interests be unknown to the grantee.\"\n\nTo the same effect are the cases of Speirs v. Jahnsen, 143 Wash. 297, 255 P. 117, and Seward v. Seward, 145 Wash. 61, 258 P. 856. Accord: Home Owners' Loan Corp. v. Tognoli, 127 N.J. Eq. 390, 13 A. (2d) 571. Also of interest is the brief comment on this point in 36 Yale Law Journal 564, where the commentator says:\n\n\"Between the original parties, a mortgage given to secure a pre-existing debt is supported by a sufficient consideration\n\neven though on the same facts, the mortgagee may not be protected against prior equities. The courts, in upholding the mortgage as between the original parties, are merely giving effect to the papers according to the intention of the parties. But a creditor receiving a mortgage to secure a pre-existing debt is not a bona fide purchaser for value entitled to protection against prior equities whether or not he has notice of them.\"\n\nSee, also, 3 Pomeroy, Equity Jurisprudence (5th ed.) 26, § 749.\n\nThus it is clear that the bonds in this case continued to be impressed with a trust in favor of the Smith estate even while they were in the hands of the pledgee, Maxwell, and that the latter was not a bona fide purchaser for value free from prior equities.\n\nThis being the case, it was the duty of appellant as successor trustee to recover the bonds from the pledgee on behalf of its cestui que trust. It should have maintained an action directly against Maxwell for the recovery of the bonds.\n\n\"Where there are successive trustees, it ordinarily is the duty of the new trustee to exercise reasonable prudence and diligence to recover the trust funds or property from his predecessor, and to compel the latter to make good any loss incurred by him; but if the trust property is in the hands of a third person, the new trustee may sue to recover it without first calling the former trustee to account for his misconduct.\" 65 C.J. 688, Trusts, § 552.\n\nThis principle was applied in the case of Hart v. Goadby, 138 App. Div. 160, 123 N.Y. Supp. 166. In that case, in discussing stock speculations wrongfully undertaken by a prior trustee, the court said:\n\n\"It is well settled that the use of trust funds for speculating in stocks, whether in the name of the executor or the trustee, as such, or on his individual account, is a devastavit of the estate, and gives rise at once to a cause of action in favor of the executor or trustee to recover the funds if they remain intact, or for an accounting for the amount or value thereof, or at the election of the executor or trustee, for the profits derived therefrom. . . . In such case the successor of the executor or trustee could bring an equitable action to recover the funds, or for an accounting\n\nby the brokers without first calling the executor or trustee, who was guilty of the misconduct to account.\"\n\nHere the trust company made no attempt to recover the bonds or the proceeds for its cestui.\n\nWhile a successor trustee is not liable for the wrongdoing of his predecessor, he is individually liable for his own wrongful acts and breaches of trust.\n\n\"If a trustee commits a breach of trust and is thereafter removed as trustee or dies or otherwise ceases to be trustee and a successor trustee is appointed, the latter is not liable for breaches of trust committed by the former. He does not by becoming trustee assume the liabilities incurred by his predecessors. He is liable only if he himself is guilty of a violation of duty to the beneficiaries.\n\n\"A successor trustee is, however, liable if he as well as his predecessor is guilty of a violation of duty to the beneficiaries. This is the case (1) where his predecessor improperly purchased or retained property and he continues to retain it; (2) where he neglects to take proper steps to compel his predecessor to turn over trust property to him; or (3) where he neglects to take proper steps to compel his predecessor to redress a breach of trust committed by him.\" Scott, Trusts, 1181, § 223.\n\nIt is the duty of the successor trustee to secure trust property and hold it for the benefit of the cestui. Scott, Trusts, 1182, § 223.2. Not only did appellant fail to obtain the property, but it went farther and actually consented to a sale of the property by the pledgee and permitted the pledgee to satisfy Brown's personal debt out of the proceeds. The trust company thereby actively participated in and furthered the breach of trust which was committed when the property was pledged by its predecessor trustee, Brown.\n\nAppellant therefore breached its trust and is liable to respondent for the full amount of money realized from the sale of the bonds.\n\nThe method of conducting the administration of this estate is subject to much criticism. At the beginning, the estate was loaded with unbearable expenses. Mrs. Brown\n\nasked for, and was allowed, $500 per month. Counsel was allowed a like amount. The allowance to appellant was $750 per month, and Fred Brown received $583 each month for the rent of the trust property which stood in his name. This made a total monthly charge against the estate of $2,333, which was beside and in addition to the expenses of conducting the operation of the ranch. Under the guise of operating the ranch, the stock was exhibited at the Pacific Livestock Exposition, the Yakima Fair, Portland shows, Vancouver, British Columbia, Victoria, British Columbia, Ogden, Denver, Los Angeles, and San Francisco. Mrs. Brown's expenses were paid at several of these shows.\n\nFor the evident purpose of making a good showing, the stock was inventoried at about sixty per cent of its value. The record discloses an inventory value of $30,900 on March 17, 1934, and a sales return of $68,014.08 prior to December 13, 1937. As an example: November 14, 1934, one horse appraised at $100 was sold for $600; November 21, a horse appraised at $100 was sold for $1,700; January 3, 1935, a horse appraised at $100 was sold for $1,000. In many instances, the sale of stock was nearly five times the appraised value.\n\nThe litigation and the estate matters could have easily been settled in less than half the time consumed. The undue extension of time was due principally to the attitude and conduct of appellant. In this account it shows a balance of $170,406.59 remaining from the appraised value of $378,000. Out of this balance appellant and its attorneys sought to have allowed additional fees in an amount in excess of $100,000. These fees together with others mentioned in this opinion evidenced a determined effort to strip the estate of its assets. We cannot but condemn these actions because they are subersive of a proper spirit in the administration of estates in the state of Washington. An economical and speedy settlement of estates is much to be desired. In fact, such action is required in all courts.\n\nThis case is remanded to the trial court with instructions\n\nto modify its decree in conformity with this opinion. The judgment of the trial court, as modified, will be affirmed. Respondent will recover the costs of this appeal.\n\nBEALS, MILLARD, STEINERT, BLAKE, ROBINSON, JEFFERS, and MALLERY, JJ., concur.\n\n",
    "body_length": 288845,
    "citedas": [
      "150 P.2d 604",
      "20 Wash. 2d 740"
    ],
    "attorneys": "Cheney \u0026 Hutcheson, for appellant Guaranty Trust Co. I. J. Bounds, for appellants Bonsted \u0026 Nichoson et al. Rummens \u0026 Griffin and Allen, Hilen, Froude \u0026 De Garmo (P. J. Gallagher, of counsel), for respondent.",
    "category": [
      "151",
      "243",
      "252"
    ],
    "judges": "Before: Simpson, C. J., Beals, Millard, Steinert, Blake, Robinson, Jeffers, and Mallery, JJ., concur.",
    "citation_count": 6
  }
}
