{
  "id": "DpA-QmYBTlTomsSBU1d7",
  "document": {
    "title": "UNITED STATES v. KUNGYS",
    "full_title": "UNITED STATES OF AMERICA, Plaintiff, v. JUOZAS KUNGYS, Defendant",
    "jurisdiction": "D. New Jersey",
    "date": "1983-09-28T00:00:00.000Z",
    "docket": "81-2305",
    "body": "DEBEVOISE, District Judge.\n\nThis is an action which the United States, acting through the Office of Special Investigations of the Criminal Division of the United States Department of Justice, instituted against defendant Juozas Kungys pursuant to Section 340(a) of the Immigration and Nationality Act of 1952, as amended, 8 U.S.C. ยง 1451(a), seeking to revoke defendant's citizenship. Jurisdiction is properly asserted under 28 U.S.C. ยง 1345, 8 U.S.C. ยง 1421(a) and 8 U.S.C. ยง 1451(a).\n\nA summary of the government's charges upon which the complaint is based is as follows: During the first two months after the June 1941 German invasion of Lithuania (which the Soviet Union then occupied) defendant organized and led an armed group of civilians which actively assisted the Germans in the arrest and execution of persons who had been government and communist party leaders in the District of Kedainiai during the Soviet occupation. Defendant's armed group assisted the Germans in confining the 2500 Jews of the Kedainiai District in a ghetto and then assisted the Germans in bringing these Jewish citizens to a horse breeding farm. Defendant's armed group under defendant's personal direction joined with German soldiers of Einsatzkommando 3 in bringing the Jewish captives in groups of 200-300 from the farm to a huge pit where the German soldiers and defendant and his group shot and then buried their victims in earth and lime. Thereafter, according to the government's charges, defendant moved to Kaunas where he became manager of a German controlled industrial concern. In 1944 when the Soviet Armies overran the German forces in Lithuania defendant preceded the retreating German army into Germany where he resided until his immigration to the United States in 1948.\n\nThe government charges that in the course of applying for entry into the United States and for citizenship, defendant made the following false statements:\n\nOn or about January 9, 1947 at Stuttgart, Germany, defendant executed under oath an \"Application for Immigration Visa (Quota)\" Number 1530 and an \"Alien Registration Foreign Service Form\" Number 6887153. Defendant was interviewed by a United States Vice Consul to determine his eligibility for immigration. An interpreter was available to assist if needed. In order to elicit the information contained in those forms, defendant was asked questions concerning his background and wartime activities. He was then asked to ratify that information under oath in the Immigration Visa and the Alien Registration forms. In providing such information, defendant misrepresented and concealed the following facts:\n\na. Defendant swore that he was born on October 4, 1913, and thereby concealed the true date of September 21, 1915.\n\nb. Defendant swore that he was born in Kaunas, Lithuania, and thereby concealed his true place of birth, Reistru, Lithuania.\n\nc. Defendant swore that he resided at Telsiai, Lithuania during the period 1940-1942, and thereby concealed his true place of residence in Kedainiai, Lithuania during the period December 1939 to October 1941.\n\nd. Defendant swore that he was not a criminal when in fact he had participated in the persecution and murder of over 2000 unarmed civilians.\n\ne. Defendant swore that during the five-year period preceeding [sic] January 1947 he had been occupied as a student, dental technician and farm and forestry worker. Defendant thereby concealed his now-claimed employment as a bookkeeper during the period 1942-1944.\n\nf. Defendant represented that he was married to Sofia Kungys nee Anuskeviciute when in fact he was not.\n\nIn connection with his visa application defendant presented United States officials with a forged Lithuanian Identity Card dated April 1944 and a false birth record fraudulently obtained from the Vatican representative in Germany.\n\nBased upon the aforementioned application, the United States Consulate at Stuttgart issued defendant on March 4, 1948 Quota Immigration Visa No. 114 pursuant to the provisions of the Immigration Act of 1924, Pub. L. No. 68-139, 43 Stat. 153, as amended.\n\nDefendant entered the United States at New York, New York on April 29, 1948 upon presentation of the aforementioned visa. The defendant was examined by an Immigration Inspector at the Port of Entry to determine his fitness to enter the United States.\n\nOn or about May 29, 1948, defendant executed under oath an \"Application for Certificate of Arrival and Preliminary Form for a Declaration of Intention\" No. 119188 (Form N-300). In said form N-300, defendant misrepresented and concealed the following facts:\n\na. Defendant swore that his date of birth was October 4, 1913, and thereby concealed his true date of birth, September 21, 1915.\n\nb. Defendant swore that he was born in Kaunas, Lithuania, and thereby concealed his true place of birth, Reistru, Lithuania.\n\nc. Defendant swore he was married to Sofia Kungys nee Anuskeviciute on August 24, 1943 at Kaunas, Lithuania when in fact he was not.\n\nOn or about May 11, 1953, defendant executed an \"Application to File Petition for Naturalization\" No. 92961 and an attached \"Statement of Facts for Preparation of Petition\" (together comprising Form N-400). In said form defendant misrepresented and concealed the following facts:\n\na. Defendant swore that he had not given false testimony to obtain benefits under the immigration and naturalization laws when in fact he had given false testimony to the United States Consul at Stuttgart, Germany in order to obtain a visa and to the Immigration and Naturalization Service (hereinafter \"INS\") in order to obtain entry to the United States and to obtain citizenship.\n\nb. Defendant swore that he had never committed a crime involving moral turpitude when in fact he had participated in the persecution and murder of over 2000 unarmed civilians.\n\nc. Defendant swore that his date of birth was October 4, 1913, and thereby concealed his true date of birth, September 21, 1915.\n\nd. Defendant swore that he was born in Kaunas, Lithuania, and thereby concealed his true place of birth, Reistru, Lithuania.\n\ne. Defendant swore that he was married on August 24, 1943 to Sofia Kungys nee Anuskeviciute in Kaunas, Lithuania when in fact he was not.\n\nOn October 23, 1953, at a naturalization examination, defendant reviewed the N-400 and swore the contents were true.\n\nOn October 23, 1953, defendant executed under oath at a naturalization examination a \"Petition for Naturalization\" No. 92961 (Form N-405). In said petition, defendant misrepresented and concealed the following facts:\n\na. Defendant swore that his date of birth was October 4, 1913 and thereby concealed his true date of birth of September 21, 1915.\n\nb. Defendant swore that he was born in Kaunas, Lithuania and thereby concealed his true place of birth, Reistru, Lithuania.\n\nc. Defendant swore that he was married to Sofia Kungys nee Anuskeviciute on August 24, 1943 in Kaunas, Lithuania when in fact he was not.\n\nOn February 3, 1954, the United States District Court at Newark, New Jersey, granted defendant's petition for naturalization and issued to him Certificate of Naturalization No. 7131022.\n\nPretrial Order pp. 9-12. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\"\n\nDefendant denies that he ever committed any crime and in particular that he participated in any way in the killing of the communist and government leaders and the Jewish population of Kedainiai. According to him in 1939 he commenced employment with the Kedainiai branch of the Lithuanian Bank and boarded at the home of the parents of the woman who later became his wife. In July 1941, before either of the mass killings which form the basis of the government's charges, he left Kedainiai to seek employment in Kaunas. From July until the fall he was employed in a print shop there; from the fall until Christmas he was a seminarian at the Telsiai Seminary; and after Christmas he returned to Kaunas and was employed first in the print shop and then in a small, family owned factory until the summer of 1944 when the Soviet forces again entered Lithuania. He claims to have participated in the work of the anti-German resistance while in Kaunas. He further claims that upon the approach of the Soviet Army, his wife and members of her family fled as refugees to Germany eventually reaching what became a part of the French occupied zone.\n\nDefendant admits that he gave false information during his immigration and naturalization proceedings concerning the date and place of his birth and concerning certain details of his employment during the period of the original Soviet occupation and the German occupation. He asserts that the false information was not material to any of the proceedings and insofar as the date and place of birth is concerned arose out of the necessity of obtaining a false identification card during the German occupation of Kaunas to avoid detection of his underground activities and to avoid mobilization into the German armed forces.\n\nTo support its most serious charges the government relies upon deposition testimony of Lithuanian witnesses taken in Vilnius with the cooperation of the Soviet authorities. Defendant contends that this testimony upon which the government relies to connect him to the killings in Kedainiai is false and is the product of a continuing effort of the Soviet Union to safeguard its hold upon the occupied Baltic states by discrediting emigres from those countries with fabricated charges that they committed war crimes during the period of the German occupation.\n\nThe case was tried without a jury. The evidence consists of the testimony of witnesses, deposition testimony, some of which was taken in this country and some of which was taken in Lithuania, and very substantial amounts of documentary evidence. I reserved decision. This opinion constitutes my findings of fact and conclusions of law.\n\nI. Historical Background\n\nThe charges, defenses and evidential rulings in this case can be understood only in the light of the historical context in which the pertinent events took place.\n\nFor centuries Lithuania, like the other Baltic states, has been in the path of conquerors from the east and from the west, see, e.g., Massie, Peter the Great (Alfred A. Knopf 1980); Hatton, Charles XII of Sweden (Weybright and Lalley 1968). Once extending from the Baltic to the Black Sea, Lithuania ceased to exist as a nation altogether in 1795 at the time of the Third Partition of Poland by Russia and Prussia.\n\nAt the time of the Russian Revolution in 1917 Lithuania was occupied by Germany. It declared and achieved its independence on February 16, 1918. During the interwar years, according to documents submitted by the government in this case, Lithuania looked primarily to France and England for cultural, political and military resources.\n\nThe years 1939-40 marked the extinction once again of independent Lithuania. Nazi Germany, having absorbed Czechoslovakia's Sudetenland after the Munich Pact, occupied Czechoslovakia's principal provinces of Bohemia and Moravia on March 15, 1939. On March 23 Germany seized, without resistance, Lithuania's City of Memel. Preparations then began for the invasion of Poland, scheduled for September 1.\n\nSeeking to avoid fighting simultaneously against major powers on the east and the west, Germany entered into negotiations with the Soviet Union. On August 23, 1939 the German-Soviet Non-Aggression Pact was signed. Discovered after the War in German archives were the secret protocols in which Germany and the Soviet Union divided between them Poland and the Baltic states. At that time Lithuania was allocated to Germany, Latvia and Estonia to the Soviet Union.\n\nThus secured against the Soviet Union in the east, Germany attacked Poland on September 1, rapidly overcoming the Polish armed forces. On September 17, implementing the secret protocols, the Soviet Union invaded Poland. On September 28 Germany and the Soviet Union executed a German-Soviet Boundary and Friendship Treaty establishing their common frontier in Poland. Another secret protocol added Lithuania to the Soviet Union's share of the seized territory. Later in 1939 the Soviet Union invaded Finland. In June 1940 Lithuania was occupied by and in due course incorporated into the Soviet Union. It's brief period of independence came to an end. Lithuania was a predominantly Roman Catholic country. The political and social reorganization of the nation required to transform it into a Soviet province entailed deportation of political and business leaders, intellectuals and Catholic priests.\n\nTurning to the west, Germany conquered Denmark and Norway. This opened the way to the assault upon the Netherlands, Belgium and France in early May 1940. With the fall of France and the evacuation of the major part of the British Expeditionary Force at Dunkirk by June 4, 1940, only England stood against Germany in the west. After failing to eliminate England's air force and after cancelling plans for the invasion of England, Germany once again turned its attention to the east. It prepared to implement Operation Barbarossa -- the invasion and conquest of the Soviet Union and the territories occupied by it.\n\nThe plans for Barbarossa included \"special tasks\" for the Reichsfuehrer SS, headed by Heinrich Himmler. These \"special tasks\" were the implementation of Hitler's program for \"Jews, communists, criminals and the insane.\" Proceeding from Nazi Germany's oppression of the Jewish population in Germany and the conquered countries of the west it was decided shortly before the invasion of the Soviet Union that the Jewish population in the east would be totally annihilated. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\"\n\nOverall responsibility for implementation of this \"special task\" was assigned to the SS's Reich Security Main Office headed by Heydrich. The actual rounding up and killing of the Jewish people was to be accomplished by four Einsatzgruppen, A, B, C and D, which were mobile units equipped with vehicles and weapons. These units were to move as rapidly as possible into the newly occupied territories in the wake of the German army, performing their assigned task as they went.\n\nEinsatzgruppen A, which had 1000 men at its peak, was assigned to Army Group North. Army Group North was to attack through the Baltic states and adjacent areas of the Soviet Union with the ultimate objective of capturing Leningrad. Commander of Einsatzgruppen A was SS Brigadefuehrer (Brigadier General) Stahlecker, author of a report (Exh. G19) which is the source of much of the information concerning the killings in Lithuania.\n\nEach Einsatzgruppen was subdivided into subgroups called Einsatzkommandos which were actually to carry out the killings. At the outset of the invasion Einsatzkommando 1b was to operate in Lithuania. As the German Army moved into Latvia, Einsatzkommando 1b was to follow and responsibility for Lithuanian operations was to be assumed by Einsatzkommando 3 headed by SS Colonel Jager.\n\nThe procedures to be followed were worked out in advance of the invasion. For a very brief period after the Einsatzgruppen were able to move into areas secured by the advancing armies, local people were to be incited to attack and kill members of the Jewish population, thus making it appear that the killings arose spontaneously in the occupied territories. Thus Heydrich's instructions to various Einsatzgruppen commanders and others responsible for the extermination program (Exh. G2) read, in part:\n\nI wish to make reference to and bring into recollection the statements which I already made on 17 June in Berlin.\n\n1) No obstacles are to be created for the self purification endeavors of anti-Communist or anti-Jewish circles in the territories to be occupied in the future. On the contrary, they are to be incited and intensified if necessary, and to be directed onto the right track without leaving evidence. This is to be done in such a manner that these local \"Self Protection Circles\" cannot recall orders or political assurances given to them, at a later time.\n\nSince such a procedure is only possible in the initial stages of the military occupation, because of obvious reasons, the Einsatzgruppen and Einsatzkommandos of the Security Police and the Security Service in cooperation with the military offices, must act as quickly as possible to at least move into the newly occupied areas with an advance detachment, in order to bring about the requirements. Only those members of the Security Police and the Security Service who possess the necessary political flair should be selected as leaders of such advance detachments.\n\nThe formation of permanent Self Protection Units with central leadership is to be avoided initially. Appropriate local population pogroms, as outlined above, are to be incited in their place.\n\nAfter a brief period of killings by local people, the extermination program was to be undertaken by the Einsatzkommando units, aided as needed by such members of the local populace as could be persuaded or forced to assist. In addition communist leaders and others who might be expected to resist the Germans were to be captured and killed.\n\nOn June 22, 1941 Germany launched a massive attack upon the Soviet Union at all points along the lengthy frontier. Army Group North moved into Lithuania and the other Baltic countries which the Soviet Union had occupied pursuant to the secret protocols to the 1939 Non-Aggression Pact and Boundary and Friendship Treaty between it and Germany. Einsatzgruppen A under Stahlecker followed close at its heels.\n\nAs the Soviet occupation forces retreated, groups of Lithuanians organized to attack them and to aid in securing self rule once again. Efforts were made to establish a provisional Lithuanian government, efforts which were quickly terminated by the German authorities.\n\nAt the outset, at least, many Lithuanians viewed the Germans as liberators from Soviet oppression, a view which facilitated the Germans' plans to use the Lithuanians for their own ends.\n\nImplementation of the \"special task\" of the Reich Security Main Office is described in the reports filed by the leaders of the Einsatzgruppen and Einsatzkommandos. Those pertaining to Lithuania were identified by the government's expert witness, Dr. Raul Hilberg, and were admitted into evidence. Their authenticity has been clearly established. In cold, bureaucratic language they describe the killing of the major portion of Lithuania's Jewish population. While they constitute evidence that Einsatzkommando 3 used local people during the course of their work, they do not refer specifically to the use of local people at the killings at Kedainiai nor do they implicate the defendant in this case in any way.\n\nHeydrich's July 2, 1941 orders (Exh. G5) summarize the general outline of the procedures being implemented in the occupied territories:\n\nThe Reichsfuhrer SS and Chief of the German Police must be continuously informed about all results of deployment of the Security Police and the Security Service.\n\n. . .\n\nTo be executed are all\n\nofficials of the Comintern (Communist International) (as well as Communist career politicians overall)\n\nthe senior, middle, and radical lower level officials of the Party, the Central Committee, the Regional and District commissars\n\nPeoples Commissars\n\nJews in Party or state positions\n\nother radical elements (saboteurs, propagandists, partisans, assassins, agitators, etc.\n\n. . .\n\nNo obstacles are to be placed before the self-purification attempts by anti-Communist or anti-Jewish circles in the areas to be occupied. To the contrary, they are to be promoted without leaving evidence, so that these local \"self-defense\" circles cannot later lay claims to regulations or political assurances granted to them.\n\nSince such a procedure is only possible during the initial period of a military occupation, for obvious reasons, the Einsatzgruppen of the Security Police and the SD have to make an effort to the furthest extent possible -- in cooperation with the military agencies -- to move into the particular newly occupied areas with all possible dispatch, at least with an advance detachment.\n\nThe daily consolidated situation report dated June 30, 1941 stated that \"Advance detachment (of Einsatzkommando 1b) moved into Kaunas on 28 June, activity taken up. . . . Lithuanian partisan groups \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\" have already shot several thousand Jews in the last three days.\" (Exh. G3). Report #12 dated July 4, 1941 concerning Einsatzgruppen A (Exh. G7) stated \"Two partisan groups are operating in Kaunas: a. 600 men under the leadership of KLIMAITIS, predominately civilian workers. b. A unit of approximately 200 men under the leadership of the physician Dr. ZIGONYS.\"\n\nThe initial stage of the extermination process in Lithuania during which the Einsatzgruppen sought to incite local groups to attack Jewish citizens is described in what will be referred to in this opinion as the Stahlecker Report (Exh. G19). The report describes particularly the killings in Kaunas, suggesting that there was more difficulty than expected in initiating a pogrom there. There is also reference in general terms to \"other parts of Lithuania\" where \"similar actions took place according to the example set in Kaunas, although on a smaller scale.\" Nowhere in the Stahlecker Report or in the other reports in evidence in this case is there anything to suggest that local groups in Kedainiai had been persuaded to take action against Jewish inhabitants of the City. According to the Stahlecker Report:\n\nIn light of the consideration that the population of the Baltic countries had suffered most heavily under the rule of Bolshevism and Judaism during the period of integration into the USSR, it could be expected that after their liberation of the foreign domination they would eliminate the enemies who were remaining in the country after the retreat of the Red Army. It was the duty of the Security Police to initiate these self-purging efforts and to guide them into the proper channels, so that the goal set for cleaning the area is reached as quickly as possible. It was no less important to establish for the future the firm and demonstrable fact that the liberated population on their own accord had taken the harshest measures against the Bolshevist and Jewish enemy, without any direction from German agencies.\n\nIn Lithuania this was accomplished for the first time in Kaunas by using partisans. Suprisingly, at first, it was not easy to initiate a large-scale Jewish pogrom there. The leader of the previously mentioned partisan group, KLIMATIS, who was primarily used here, succeeded in initiating a pogrom as a result of the advice given to him by a small advance detachment deployed by Kaunas, without any visible indication to the outside world of a German order or of any German suggestion. During the course of the first pogrom on the night of 25 June to 26 June more than 1,500 Jews were eliminated by the Lithuanian partisans; several synagogues were burned or otherwise destroyed and a Jewish residential quarter with approximately 60 houses was also burned down. During the following nights, 2,300 Jews were eliminated in the same manner. In other parts of Lithuania similar actions took place according to the example set in Kaunas, although on a smaller scale, extending as well to those Communists who had stayed behind.\n\nBy means of instruction given by the Wehrmacht agencies, which understood such activity thoroughly, the self-purging actions progressed without any problems. At the same time it was clear from the beginning that only the first few days of the occupation would provide the opportunity for carrying out pogroms. After the disarming of the partisans the self-purging activities, of necessity, had to cease.\n\nFor police protection in the Baltic states the regular police were to be supplemented by auxiliary police who were to be recruited from reliable members of recognized nationalist organizations friendly to Germany and members of former Baltic armies who had not participated in combat against the German Wehrmacht. These auxiliary police were to be selected and used locally and were to assist in the purely police functions of preserving public order in the local area. They were to be identified by armbands and were not to wear uniforms. \"For the cleansing of larger rural districts (i.e., killing all Jews in those districts), the auxiliary police may be used only with the advice and consent of a Wehrmacht command post or office.\" (Exh. G17).\n\nAfter the brief period when Einsatzgruppen A urged Lithuanian groups to slaughter Jewish inhabitants and communist sympathizers, Einsatzgruppen A turned to its next task, the seizure and execution of the Soviet and Lithuanian leaders of the nation under Soviet occupation. This too is described in the Stahlecker Report:\n\nIn addition to the search actions, a systematic search for remaining Communist functionaries, Red Army personnel and those persons tainted by their work for Communism was undertaken. In some cases the Self-Protective Forces had already spontaneously taken care of the most notorious Communists.\n\nLarge-scale actions were undertaken in the larger cities by all available personnel of the Kommandos and all the Self-Protective Forces, as well as with the support of the German Ordnungspolizei, during the course of which numerous arrests and searches were conducted.\n\nAfter these priority tasks had been completed in the cities, the mopping-up operation was undertaken in the countryside by small Teilkommandos [partial detachments]. In this task, too, the Self-Protective Forces provided valuable help. On occasion rural Self-Protective Squads transported Communists caught in their area 150 km to deliver them to the Einsatzkommandos.\n\nThe daily situation report of August 16, 1941 (Exh. G9) summarized the results of the \"Execution Activities\" or \"special operations\" of Einsatzkommando 3 during the period from July 22 to August 3, 1941. A total of 1,592 persons were killed in ten different localities. One of these was Kedainiai where on July 23, 1941 \"125 persons (83 Communist Jews, 12 Communist Jewish women, 14 Russian and 15 Lithuanian Communist functionaries, 1 Political Agent) were liquidated.\"\n\nWhile the political prisoners were being captured and exterminated Einsatzgruppen A and Einsatzkommando 3 took steps preparatory to the destruction of all of Lithuania's remaining Jewish population since \"from the very beginning it was to be expected that pogroms alone would not solve the Jewish problem in the Ostland.\" (Exh. G19T at 23). During the pogroms instigated during the early stage of the German invasion, according to the Stahlecker Report, 3,800 Jews had been killed in Kaunas and 1,200 had been killed in Lithuania's smaller cities.\n\nIt was first necessary to gather all the Jewish residents in each locality in a central place from which they could then be taken in large groups to be killed. The process of assembling these residents is described in a number of the daily situation reports and summaries in the Stahlecker Report. According to the latter document:\n\nApart from the organization and implementation of executions, the process of creating ghettos in the larger cities was already started during the first few days of operation. This was particularly urgent in Kaunas, since 30,000 Jews lived there among a total population of 152,400. For this reason, after the completion of the first pogroms a Jewish Committee was summoned and informed that the German offices had no reason until now to intervene in the differences between Lithuanians and Jews. A prerequisite for the creation of normal relationships for the time being would be the construction of a Jewish ghetto. When the Jewish Committees raised objections, they were told that there was no other possibility of preventing further pogroms. Forthwith, the Jews immediately declared themselves ready to do everything to re-settle their fellow-Jews with the utmost speed to that part of the City, called Viliampol, designated as a Jewish ghetto. This part of the city is located in the triangle created by the Niemen on one side and a tributary on the other and is connected to Kaunas by only one bridge and is therefore easy to block off.\n\n. . .\n\nSimilarly, in the other cities, where a large number of Jews reside, ghettos are being established. The identification of Jews by means of a yellow Star of David on the chest and on the back which had been initially ordered by provisional Security Police mandates has been quickly implemented as a result of corresponding orders by the Commander of the Army Rear Area and later by the Civil Administration.\n\nAfter the Jewish population had been confined in ghettos, the systematic killings began. The methods used and the results achieved are described in the December 10, 1941 report to Stahlecker from SS Colonel Jager, commandant of Einsatzkommando 3. (Exh. G14A, 14B). He described the procedures as follows:\n\nThe goal to make Lithuania \"Jew free\" could only be attained through the formation of a mobile detachment with specially selected men under the leadership of SS Obersturmfuhrer Hamann who shared my goals completely and who would guarantee the cooperation of the Lithuanian partisans and the existing civil offices.\n\nThe carrying-out of such actions is, in the first place, a question of organization. The decision to systematically make each district free of Jews necessitated a thorough preparation of each individual action and knowledge of the existing conditions in the districts in question. The Jews had to be collected in one or in several locations. Based on the numbers [of Jews] a place for the necessary pits had to be found and dug up. The route of the march from the collection point to the pits averaged 4 to 5 km. The Jews were transported to the execution site in groups of 500 and in intervals of at least 2 km. What difficulties and nerve-racking work that had to be accomplished is shown in the following random example:\n\nIn Rokiskis, 3,208 people were to be transported 4 1/2 km before they could be liquidated. In order to accomplish this work in 24 hours, 60 of the 80 available Lithuanian partisans had to be detailed for transport duty and perimeter security. The remainder, who had to be repeatedly relieved, carried out the work with my men. Trucks were seldom available for transport. Attempts to escape that happened here and there were prevented entirely by my men and with some danger to their lives. For example, 3 men of the detachment shot down 38 escaping Jews and Communist officials on a forest path near Mariampole. Not one escaped. The marching to and from [the execution site] for the individual actions amounted to ca. 160-200 km. Only through skillful use of time was it possible to carry out up to 5 actions in a week's time and to handle the work that had accumulated in Kaunas so that no bottlenecks occurred in the official functions.\n\nThe actions in Kaunas itself, where there were sufficient reasonably well-trained partisans available, were virtually duck shoots compared with the enormous difficulties which were often encountered elsewhere.\n\nJager's report sets forth chronologically and in meticulous detail the dates when each killing took place, the location of the killing and the precise number of men, women and children killed at each place on each date. There are 20 entries for August, 35 entries for September, 11 entries for October, and 10 entries for November, each entry recording the killing of anywhere from 6 to 9,200 persons. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" In all 133,346 men, women and children are reported to have been killed as a result of Einsatzkommando 3's activities during this period, plus 4,000 killed through pogroms and liquidations while Einsatzkommando 1b was responsible for the operation.\n\nThe City of Kedainiai is listed twice in the Jager report. The first entry reflects the July 23 execution of 125 persons accused of being high level communists and of working with the Soviet occupation authorities. The second entry is for August 28, 1941 which records the killing of \"710 Jews, 767 Jewesses, 599 Jewish children -- 2,076.\"\n\nOn December 10, wrote Jager, \"I can state today that the goal to solve the Jewish problem for Lithuania has been attained by EK 3. There are no more Jews in Lithuania except for those working Jews and their families\" -- those required in order for the economy to survive: 4,500 in Siauliai, 15,000 in Kaunas, 15,000 in Vilnius. Of Lithuania's 1923 population of approximately 150,000 Jews, only 34,500 remained.\n\nDecember 10, 1941, the date of Jager's report, was three days after Pearl Harbor, the extension of the War to the Pacific and the commitment of United States armed forces into the conflict in Africa and Europe.\n\nPerhaps coincidentally, in the following month the German reports first reflected signs of organized Lithuanian resistance to German occupation. The January 14, 1942 consolidated daily situation report (Exh. G15) stated:\n\n11) Reports of the Einsatzgruppen and Einsatzkommandos Einsatzgruppen A:\n\nLocation: Krasnogvardeysk\n\nWhile up to now anti-German propaganda was spread mainly through word of mouth, spreading of rumors, and whispering campaigns, now, for the first time, pamphlets, printed in the Lithuanian language were found in some places in Kaunas with the following contents.\n\n\"Appeal to the Inhabitants:\n\nThe Germans are fighting for the freedom of nations, they are dying for the rights of the new Europe. We Lithuanians have already fully experienced what this promised freedom means. The German crusaders have betrayed the Lithuanian people. Have we fought for such freedom in the first days of the war and our brothers and partisans have shed their blood? Is that the freedom we possess today? The Lithuanian today is a slave without rights. The Lithuanians have already comprehended this. You partisans, wake up and go forward along with the entire Lithuanian nation.\n\nThe Germans began to murder the Jewish citizens by your hand. They have robbed the Jews' possessions. Know for sure partisans, you will end up the same way. You are the tool of the German Crusaders in the murder of innocent Lithuanian citizens. For once we all must all say the following: \"It is enough to shed streams of innocent human blood. Today we must announce that we will fight all for one and one for all against the crusaders.\n\nPartisans, choose one of two ways. Stop with the murder of defenseless people or you will fall at the hands of your brothers. We know for sure that the Germans wish the same fate as the Jews on all other ethnic groups. We will not allow that the Lithuanian people are liquidated by your hand, you will be liquidated by your brother. Today we will have the power to fight and win. Know that our eye observes you everywhere, even among your friends.\n\nDeath to the Crusader.\n\nJudging from the entire manner of expression, this pamphlet is not likely to be of Communist origin, but rather the author is to be found mainly in the ranks of the activists or even among the ranks of the nationalists.\n\nThe evidence in this case does not purport to describe the extent of the Lithuanian resistance to the German forces. However, there is evidence concerning elements of the resistance movement which is pertinent here.\n\nUnlike the prospects faced by the resistance movements in the western nations conquered by Nazi Germany, in Lithuania the defeat of Germany did not ensure return to independence. Rather it was quite likely that Germany's defeat would simply result in the reinstatement of Soviet tyranny and religious oppression. Nevertheless, a resistance movement arose which opposed both the German occupation and renewed Soviet rule. This took place during the period from 1941 through mid-1944. During the early part of that period the Germans were enjoying staggering military successes in the Soviet Union, conquering vast territories and inflicting huge losses upon both military personnel and civilians. During the latter part of the period the Soviet Union inflicted similar losses and defeats upon the German armies driving them back towards Poland and the Baltic states. At the same time the western forces mounted offensives in Africa, Sicily and Italy and prepared for the cross-Channel invasion of France. During all that time the Nazis pursued their goal of killing the remaining Jews of eastern Europe and the Jews of western Europe, establishing the death camps in Poland and Germany.\n\nThe evidence in this case describes two kinds of Lithuanian resistance efforts.\n\nOne was the ambiguous conduct of the leaders of the Lithuanian Local Forces established in 1944 with the agreement of the Nazis occupation forces. (Exh. D16). Its role was to fight communist partisans in Lithuania who worked with the Soviet forces advancing from the east. The German SS sought to mobilize this local defense force to fight with the Germans on the eastern front. This the leadership of the Local Forces resisted. Because of this show of independence and the failure of German mobilization attempts, in May 1944 SS Police General Jeckeln called a meeting in Kaunas to which the Local Forces commandant General Plechavicius and chief of staff Colonel Urbonas were invited. Upon arrival they were arrested. In addition 28 other officers were arrested, deported and imprisoned. According to the Lithuanian Encyclopedia extract in evidence (Exh. D16) 3500 of the 10,000 Local Forces members were transported to Germany for forced labor or service in antiaircraft units. Other members of the Local Forces escaped, fleeing into forest areas with their leaders and weapons.\n\nOf more direct pertinence in the present case are the resistance efforts described by Vydaudas Vidiekunas, a 79 year old man whose testimony I found to be convincing and totally credible.\n\nWhen the Soviet Union invaded Lithuania in June 1940 pursuant to the secret protocols accompanying the September 1939 Boundary and Friendship Treaty, Vidiekunas was a lawyer in Kaunas and a leader of the Lithuanian Christian movement. In July of 1940 Soviet arrests commenced, and on July 11 and 12 a first wave of 1200 Lithuanian \"intellectuals\" was seized. Vidiekunas was on the list but was not captured because he was not at his office when he was to have been taken into custody. He fled to Germany, returning to Kaunas illegally in June 1942 to find that during the Soviet occupation his family had been deported to Siberia.\n\nUpon his return to Kaunas Vidiekunas became a member of the Lithuanian Front, a resistance group which had started during the Soviet occupation and continued during the German occupation. Ultimately Vidiekunas became a member of the Supreme Committee for the Liberation of Lithuania.\n\nThe Lithuanian Front edited an underground newspaper. One of its primary activities through its paper and otherwise was to urge young people not to respond to mobilization orders issued by SS General Jeckeln, head of the police for the Baltic states. These orders were repeated throughout the 1941-1944 period. Members of the underground worked in German controlled industries, in local government offices and in the local Lithuanian police forces. Through these sources the underground was able to procure documents enabling young persons to falsify their records and thus evade German mobilization.\n\nThis branch of the resistance movement was wiped out in the spring of 1944. A member of the Supreme Committee was arrested in Estonia, en route to Sweden. Under torture he disclosed the identities of the members of the Committee. The evidence leaves some question as to the exact date when the Germans began arresting members of the Committee and other members of the resistance. It may have been as early as mid-April; it may have been as late as April 29 or 30, 1944. Two members were arrested at that time. Vidiekunas was arrested on May 4 or 5. The arrests continued until June 1944, by which time the entire Supreme Committee for the Liberation of Lithuania was in German custody. This coincided with the June 6 Normandy landings of the American, British and Canadian armies.\n\nAt first the members of the Committee along with other members of the resistance were held in solitary confinement in Kaunas. There were 28 or 29 persons being held, of whom six were members of the Supreme Committee. In January 1945 all were taken to the Instenburg Prison in East Prussia for trial in Berlin on charges of treason. They were no longer in solitary confinement and could meet and talk with each other during yard recreation periods. During their daily periods in the yard Vidiekunas came to know a fellow prisoner, Broius Budginas, a person having significance in the present case. Budginas had worked in a resistance organization known as the Freedom Fighters, which had acted separately from Vidiekunas' Lithuanian Front. Budginas had operated a clandestine radio in communications with Stockholm. He had been arrested by the Germans in April 1944, before Vidiekunas had been arrested.\n\nThe chairman of the court before which the prisoners were to be tried was killed in a February 3, 1945 bombing raid and the trial was postponed. Thereafter the entire group, including both Vidiekunas and Budginas was transferred to a prison in Bavaria. In the summer of 1944 the western allies had advanced from Normandy and the south of France to the German frontier; in December and January they turned back the German Ardennes offensive; by February, when the Lithuanian prisoners were moved to Bavaria, they were preparing for an advance to the Rhine and beyond. On April 14, 1945 units of the American Army liberated the Lithuanians from their prison in Bavaria.\n\nOn April 25 units of the American and Soviet Armies met at the Elbe River. The partition of Germany and Berlin into the Soviet, American, British and French zones was effected. Poland and the Baltic states were occupied by Soviet troops. Although a truncated Poland allied with the Soviet Union emerged from the War, the Soviet Union proceeded to incorporate into itself Lithuania and the other Baltic states.\n\nThe foregoing is designed to summarize events which must be taken into account if the more detailed evidence in this case is to be understood.\n\nII. The Killings in Kedainiai\n\nKedainiai District in Lithuania (called Kauen-Land by the occupying Germans) had a population of 85,000 in 1923 which had increased to 102,000 in the mid 1930's. The Town of Kedainiai had a population of 8,500 in 1923 which most likely had increased somewhat by the time of the initial Russian occupation in 1940. The Jewish population of the Town of Kedainiai was 2,500 in 1923, which remained relatively stable through the 1930's.\n\nKedainiai is located 25 miles north of Kaunas, which had been Lithuania's capital. Kaunas was captured within a few days after the June 22, 1941 German attack on the Soviet Union and Kedainiai was occupied shortly afterwards.\n\nKaunas, which was the scene of the most violent of the pogroms instigated by the Germans against the Jewish population in the early days of the invasion, became the German administrative seat in Lithuania.\n\nThere is no evidence in this case that local people in Kedainiai engaged in any killings during the first phase of the Nazis annihilation program.\n\nThe German records reflect implementation of the second and third phases of the program in Kedainiai with the entries that on July 23, 1941 \"125 persons . . . were liquidated\" in Kedainiai and that on August 28, 1941 2,076 Jews were killed there. Apart from the overall role of Einsatzgruppen A and Einsatzkommando 3, the reports provide no details concerning these two events.\n\nThe government has offered, and I provisionally received in evidence the depositions taken in Lithuania of defendant's sister-in-law and of five persons who testified that they were present at one or both of these killings. Defendant has objected to admitting these depositions in evidence for a number of reasons, which I will deal with below. However, having seen and heard the videotapes of the depositions, I conclude that they are sufficiently reliable to establish that the five witnesses were present on July 23, 1941 and/or August 28, 1941 and that their testimony provides a general mosaic of the events of those two days.\n\nA. July 23, 1941: In the very early days of the German occupation the German authorities in Kedainiai encouraged the organization of groups of local persons who had had military experience or had been members of organizations such as the Riflemen (sometimes referred to as the Siauliai) which gave military training to its members. These groups were used to supplement the regular police force. Members continued in their regular employment but at night guarded bridges and patrolled the streets of Kedainiai. They wore white arm bands for identification.\n\nIn July, pursuant to the established program of the Reich Security Main Office, Lithuanians in Kedainiai District who had held leadership positions in the government under Soviet rule or who were leaders in the communist party were arrested. They were imprisoned in a barracks on Gediminas Street.\n\nOn July 23, 1941 the Kedainiai police authorities ordered two truck drivers to present themselves at the barracks on Gediminas Street in the morning. Armed members of the organized civilian groups or detachments and German soldiers had assembled there. The arrested men and women were taken from their cells and loaded on the trucks. Guards stood in the four corners of the back of each truck and the prisoners sat on the floor. They were driven to Babeniai Forest (also called Babences in the deposition testimony).\n\nMeanwhile the members of the civilian groups were given rifles and were directed to walk to Babeniai Forest. There they were assigned responsibility for guarding the site, preventing people from entering or leaving.\n\nThe two trucks proceeded back and forth between Gediminas Street and the Forest, bringing successive loads of prisoners. When a truck arrived at the Forest the prisoners were ordered off the truck and directed by German soldiers and civilians wearing white arm bands into the Forest to a place where a large pit had been dug. There approximately 20 German soldiers forced the prisoners into the pit and shot them.\n\nB. August 28, 1941: When the Germans occupied Kedainiai they imposed restrictions on the Jewish inhabitants. They were required to wear Stars of David and were not permitted to walk on the sidewalks -- only in the streets.\n\nShortly all Jewish residents of Kedainiai were moved into a small ghetto area and were confined behind barbed wire. Regular police patrolled the perimeter of the ghetto in the daytime. Members of the civilian detachments participated in guarding the perimeter at night.\n\nAfter the entire Jewish population had been assembled in the ghetto they were marched, men, women and children, to a former horse breeding farm on the outskirts of Kedainiai known as Zirginas.\n\nOn the day before August 28, 1941 a number of steps were taken in final preparation for the execution of the persons confined at Zirginas. To provide necessary transport the Kedainiai police chief (Kirkutis) ordered three truck drivers to report to the police station on the morning of August 28 -- Vladislovas Silvestravicius (a worker in the beer bottling plant in Kedainiai), Juozas Devidonis (a driver at Kedainiai's motor transport organization) and a person now dead whose last name was Mykolas. The civilian auxiliary police detachments and organized groups of workers, such as employees of the railroad, were also ordered to appear the same morning. Thus on the morning of August 28 there gathered at the yard near the police station the drivers, members of the civilian detachments wearing white arm bands, other groups of workers, the regular police and German soldiers. Some of the civilians, together with lime, beer and vodka, were loaded in trucks and taken to a spot on the Dotnuva Road not far from Zirginas where the Jewish inhabitants were being held. Other civilians were provided with rifles and taken to the place on foot.\n\nThis place was near the Smilga River, a small stream. A huge pit perhaps 100 meters long, three meters deep and four meters wide had been dug. Those who marched to the site were stationed in groups in a perimeter 50 or 60 meters from the ditch to keep persons from entering the area or from escaping. The Germans had mounted machine guns and informed the persons assigned to guard duty that they would be shot if they attempted to leave.\n\nThose assembled at the place awaited the arrival of a special group of German soldiers -- probably a detachment from Einsatzkommando 3. When these soldiers arrived the doors of the barn at Zirginas were opened and a first group of perhaps 200 was brought out. There is some confusion as to the order in which the groups were brought from the barn, but it appears that first the old men too weak to walk were loaded onto the trucks and transported to the ditch. German soldiers and civilians saw to the loading of the trucks.\n\nAt the ditch the old persons were taken off the trucks, ordered to proceed to the pit area where they were instructed to undress, placing their clothes in piles. From there they were shoved to the pit itself and forced into it. They were then shot by German soldiers using automatic weapons. The evidence is in dispute whether Lithuanians participated in the shooting.\n\nAs each group was shot Russian prisoners of war covered the bodies with earth and lime.\n\nAt Zirginas a tractor motor was kept running to drown out the sounds of the firing and of the screams of the victims. After the groups of infirm persons had been taken to the pit in trucks the remaining Jewish prisoners were brought on foot from the barn to the pit also in groups of approximately 200. German soldiers and Lithuanians directed the line of march. From midday until well into the evening groups of men, groups of women, groups of women with their children were escorted to the pit area, ordered to disrobe and forced into the pit to be shot and covered with earth and lime. Later their clothes and other possessions were sold in a special store which could be patronized only by Germans and perhaps by members of the detachments of Lithuanians.\n\nThus the December 10, 1941 Jager report's entry for August 28 was able to recite the killing of \"710 Jews, 767 Jewesses, 599 Jewish children -- 2,076.\" \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\"\n\nIII. Admissibility of Deposition Testimony Against Defendant\n\nIt is the government's contention that defendant was the leader of one of the civilian detachments organized when the Germans occupied Kedainiai, that under his leadership his detachment actively and willingly participated in the killing of the communist political and party leaders, that under his leadership the detachment participated in gathering the district's Jewish population into the ghetto area, bringing them to Zirginas and slaughtering them in the pit beside the Smilga River, and that defendant then acquired for himself possessions of the victims.\n\nA. The Deposition Testimony: The government's charges find strong support in three of the depositions taken in Lithuania. The other three Lithuanian depositions either contain testimony which neither inculpates nor exculpates defendant or else tends to exculpate him. A deposition taken in the United States supports defendant's contentions. (Exh. S-3, dep. of Kostas Januska). Perhaps the most critical issue in this case is whether the Lithuanian depositions are admissible against defendant. A summary of the Lithuanian deposition testimony insofar as it relates to defendant is as follows:\n\nIn July and August 1941 Stasys Narusevicius was a railroad employee in Kedainiai. He testified that he and his co-workers were ordered to go to the police station at 8:00 a.m. on August 28. He was among the group taken on foot to the execution site and then directed to stand guard at the perimeter, allowing no one to enter or to leave. He was unable to recognize a photograph of defendant taken during the war period, and he testified that he had never heard defendant's name until it was mentioned during the deposition.\n\nIn the summer of 1941 Juozas Devidonis worked as a driver at the Kedainiai motor transport organization. He testified that pursuant to an order of the town's chief of police he drove one of the trucks which transported Lithuanian communist officials and communist party leaders from the barracks on Gediminas Street to Babeniai Forest where they were executed. He recognized none of the Lithuanians who participated in that event. He also testified that on August 28 he was ordered to drive one of the trucks which had been procured to transport Jewish prisoners from Zirginas to the pit. However, he stopped off at a friend's house to drink vodka before arriving at Zirginas and apparently was asleep in his truck cab during most of that day. When shown defendant's wartime photograph he testified that it was a person he may have seen somewhere -- perhaps in Kaunas in the 1950's. In answer to a question by the Procurator who presided at the deposition he testified that he was not familiar with defendant, that he knows nothing about his activities and never gave evidence about him.\n\nJuzes Rudzeviciene is defendant's sister-in-law. Her parents had resided at No. 3 Radvilu Street in Kedainiai since 1928 or 1929 with their three sons and two daughters. Well before the summer of 1941 the five children had left home and the parents let out two of their four rooms to boarders. At the time of the German invasion defendant, who worked in the local bank, was one of the boarders and Jonas Dailide, who was an instructor at the trade school, was the other. Juzes Rudzeviciene and her sister Zofija, whom defendant later married, were students living in Kaunas. They visited their parents in Kedainiai from time to time during the summer of 1941 but were not present during the killings in July and August. Therefore Juzes Rudzeviciene was not in a position to testify about those events.\n\nBorn in 1910, Vladislovas Silvestravicius worked as a driver in the beer bottling plant in Kedainiai in 1941. He testified that on August 28 his superiors ordered him to fill his truck with gas and report to the police station where his truck was loaded with lime, vodka and beer. The cargo was unloaded at the pit and he then brought the truck to Zirginas where it was used to transport old people to the ditch. He testified as follows concerning people he recognized:\n\nQ Did you recognize any of the men who took part in the shooting?\n\nA I didn't know them. Later on I came to know a person named Gylys. Jankunas as well. That Gylys was a very handsome man. He worked as an engineer with electric equipment.\n\nQ Was Gylys a leader or an assistant leader of the Lithuanian armed men?\n\nA Maybe he was. He was an educated person, and I saw while shooting. I didn't know him at that time, but he was a handsome man. And later on I noticed that he was working at the electric power plant as an engineer, and I thought at that time that such a handsome man was doing such work.\n\nHe was put on trial, and he was sentenced, and I took part in his case as a witness.\n\nQ When you knew Mr. Gylys in 1941, was he in charge of a detachment of armed Lithuanian civilians?\n\nA I didn't know him, and it was hard to notice. But it's clear he was the head.\n\nQ And do you know if Mr. Gylys as a leader of the Lithuanian -- or as an assistant leader of the Lithuanian armed detachments, had a superior?\n\nA It's hard to tell.\n\n. . .\n\nQ Earlier you described an armed man who rode in the truck with you from the courtyard to the ditch. Would you describe that man?\n\nA With me sat only one person. The rest were staying in the body of the truck. It was an elderly person, but it was not Kungys who was mentioned previously, because Kungys was a person of a medium height with a round face.\n\nIf you would show me a photograph of Kungys as a young person, I would recognize him.\n\nQ When did you first meet Kungys?\n\nA It was only at that time that I saw him. Later on I didn't see him.\n\nQ Well, do you know where Kungys worked?\n\nA No, I don't know.\n\nQ Do you know where Kungys lived?\n\nA No, I don't know.\n\nQ So, in other words, Kungys was not a personal friend of yours?\n\nA No.\n\n. . .\n\nQ Mr. Silvestravicius, please open the folder and look at the pictures.\n\nA A person in this photo resembles Kungys.\n\nQ You are pointing -- would you point to the photograph you mean, sir?\n\nIt's Photograph No. 3?\n\nA Yes, Photograph No. 3.\n\nQ And who is this person? Please look at it. Who is that person -- or who do you think that person is?\n\nA It resembles Kungys, that head, that superior -- to that superior who was giving orders in Kedainiai.\n\nQ Do you know what his first name is?\n\nA No, I don't know.\n\nQ To whom was he giving orders?\n\nA To all the rest he was -- he was giving orders to all the rest.\n\nQ Did he ever give you orders?\n\nA No.\n\nQ Would you please sign your name on the bottom portion of Photograph No. 3, which you have identified, and today's date?\n\nA The person in the photo resembles Kungys, but hell knows whether it is Kungys or not. He resembles only. So how can I put my signature?\n\nQ Well, I am simply asking you to put your signature to -- as an indication that you have identified that photograph of someone -- as that of someone who looks like Kungys.\n\nWhether or not you -- I'm sorry, what did the witness say?\n\nA So I can put that he resembles Kungys. So am I to write it here?\n\nQ Yes.\n\nSilvestravicius Dep. at 60-64.\n\nThis testimony was weakened considerably by his answers on cross-examination, and one is led to question whether his knowledge of defendant is based upon his own observations and recognition or upon what others told him.\n\nQ How many people did you recognize at the ditch where the Jews were shot?\n\nA I recognized Jankunas and Gylys.\n\nQ Besides Jankunas and Gylys, did you recognize any other person?\n\nA No. Maybe they were from some other place. I don't know.\n\nQ When did you for the very first time hear the name Kungys?\n\nA I don't remember. Maybe after a week, maybe -- maybe later on. I don't remember.\n\nThere were talks that he was in charge of everything, but I don't know.\n\nSilvestravicius Dep. at 80-81.\n\nJuozas Kriunas was born in Kedainiai in 1917 and lived there all his life except for 10 years' imprisonment by the Soviet authorities commencing in 1946. He was imprisoned for his role in the Kedainiai killings. In 1941 he was chief accountant at the Cooperative Dirva. A fellow employee was Kostas Januska. Kriunas testified that his work brought him to the bank where defendant worked and consequently he knew defendant.\n\nKriunas further testified that in the first days of the German occupation certain citizens of Kedainiai organized a detachment to assist the Germans and that the detachment had 25 members. He stated that he and Januska were members, that defendant was the leader of the detachment and that a man named Gylys was his assistant.\n\nAccording to Kriunas he was not a member of the detachment at the time of the July killings at Babeniai Forest, but that defendant told him \"that we shot the whole party -- all party activists, and that's it\" and that \"he was the leader of the shooting and was shooting himself.\" (Kriunas Dep. at 23, 24).\n\nKriunas also testified that defendant and his detachment and German soldiers took the Jewish people to the ghetto and later took them to the horse breeding farm at Zirginas. On August 28 the members of the detachment gathered at the police headquarters and were given rifles. Kriunas stated that at the place of assembly defendant had said simply, \"'Men, we are moving, we are going,' and that's it.\" (Kriunas Dep. at 40). They proceeded to Zirginas, and Kriunas testified that his assignment was to drive the Jewish prisoners from Zirginas to the pit. Defendant was with them, according to Kriunas, and ordered that the doors of Zirginas be opened and the women be driven out. When the women and children were brought to the pit defendant and the German commander ordered them to undress, Kriunas testified, and after they were pushed into the pit detachment members, including defendant and Januska, and German soldiers shot the victims. As group after group was brought to the pit, defendant, according to Kriunas, ordered them to undress and with his pistol participated in shooting them.\n\nKriunas was unable to identify the wartime photograph of defendant.\n\nJonas Dailide, born in 1907, arrived in Kedainiai in 1946 when he became an instructor at the trade school. He, like defendant, was a boarder at No. 3 Radvilu Street. Although he had never served in the Lithuanian army he had been a member of the Siauliai, an organization comprised mostly of former army members. It had been disbanded during the Soviet occupation. He testified that when the Germans first occupied Kedainiai former members of the Siauliai were called to register and to serve as an auxiliary police force. An old reserve officer was their leader and their duties were to preserve order. According to Dailide, defendant \"might have been the assistant to one of the heads of the detachment of all the unit\" (Dailide Dep. at 34) and did not stand guard but checked on those who were on guard.\n\nDailide testified that the detachments did not assist the police in the arrest of communists, government leaders and party members but that on the day of their execution they stood guard at the execution site. He further testified that on that day he saw defendant twice, once in the barracks on Gediminas Street before marching to Babeniai Forest and again in the cab of one of the trucks which brought prisoners from the barracks to the Forest.\n\nDailide was ordered by the principal of his school to report to the yard of the German commandant's office in the morning of August 28. Dailide testified that defendant was at the yard and was acting as head of one of the smaller detachments consisting of 20 to 30 people. This was not the detachment of which Dailide was a member.\n\nDailide then proceeded to give two utterly different accounts of defendant's actions at the execution site. One portrayed defendant as playing a relatively minor role; the other portrayed him as participating actively in killing the prisoners and seizing a part of their possessions for himself. The second version was given when the government sought to \"refresh his recollection\", using a protocol which Dailide signed in 1977 after interrogation by the Soviet authorities and which purports to set forth what he told them then.\n\nDailide's first version: Defendant's detachment, like the other detachments, formed a perimeter guard around the general area of the pit. As Dailide testified, \". . . only I would like to emphasize that we stood on guard not at the shooting place, but in the surrounding area.\" (Dailide Dep. pp. 59, 60). At the place where the shooting took place \"only Germans were present.\" Defendant passed on instructions from the Germans to the various civilian detachments guarding the perimeter. Dailide testified that he did not see defendant \"at the execution place\" (Dailide Dep. at 60) and that he did not know if members of the detachments were allowed to select Jewish property or if defendant received any such property. Asked if he saw defendant with a wardrobe and two suitcases filled with clothes at his home, he replied, \"No, I haven't seen it. . . . He didn't have much -- he didn't have many things. He came with one suitcase and he left with one suitcase as well.\" (Dailide Dep. at 64).\n\nDailide's second version: After Dailide testified in the normal manner, the government read to him statements he supposedly gave to the Soviet authorities in 1977. Dailide then stated that he thought that \"the evidence written in the protocol was a true evidence\" and that the protocol refreshed his recollection of what happened. (Dailide Dep. at 75-85). Among the statements in the protocol which Dailide affirmed as being \"true evidence\" were the following:\n\nDuring the entire shooting Juozas Kungys was walking back and forth with a pistol in his hand directing the shooting. I did not see him shooting since I did not watch all the time.\"\n\nDailide Dep. at 80; see also 83.\n\nI was directed to stand guard about 40 meters from the ditch to prevent the Jews from running away. From this point I clearly saw the ditch where the Jews were shot. In this mass shooting of the Jews, civilians and Hitlerite uniformed soldiers participated, that is, soldiers and officers.\n\nThe civilians were the bourgeois nationalist gang members and their assistants, but where the Hitlerite soldiers came from or to what unit they belonged, I do not know.\n\nDailide Dep. at 81.\n\nAfter the mass shooting of the Jewish nationals I saw a wardrobe and two suitcases filled with clothes that belonged to the Jews at Kungys' home. I do not know how he acquired them.\n\nDailide Dep. at 85.\n\nShown the wartime photograph of defendant, Dailide stated, \"It resembles Kungys . . . though he was not quite like that. . . . He resembles Kungys, but I can't confirm it, really. . . . I doubt.\" (Dailide Dep. at 91).\n\nThe Soviet authorities questioned Dailide about the July and August 1941 killings in 1946 and 1977. On each occasion he signed a protocol as to what he told the authorities. He was never charged with any crimes for his participation in those events.\n\nAs stated above, the testimony of Silvestravicius, Kriunas and Dailide, if believed, would be strong evidence of the truth of the government's charges that defendant was an active participant in the killing of the communist government and party leaders and the killing of the Jewish residents of the Kedainiai District. For the reasons set forth below, however, I have concluded that these depositions, insofar as they purport to inculpate defendant, are unreliable and were taken under such circumstances that their use against defendant would violate fundamental considerations of fairness. No single factor compels this conclusion, but the circumstances in their totality permit no other conclusion.\n\nB. The Soviet Interests Involved and Methods Used: The prosecution of this case results from an unusual cooperative effort of the Office of Special Investigations (\"OSI\") and Soviet authorities. The Soviet authorities have provided documents from archives under their control and, more important, they have assembled, interrogated and produced for deposition the witnesses whose testimony is critical if the government's principal charges are to be sustained. This cooperation was noted at the commencement of each deposition taken in Vilnius when the procurator informed the witness: \"I act on the instructions of the Procurator General of the USSR in connection to render all the possible assistance to the USA Ministry of Justice, Office of Special Investigations.\" (E.g. Narusevicius Dep. at 4, 5).\n\nThe Soviet authorities are outside of the jurisdiction of the United States judicial system. Consequently it is impossible to provide the usual safeguards of the trustworthiness of the evidence having its source in the Soviet Union. This becomes a matter of grave concern for two reasons. First, the Soviet authorities have a strong motive to ensure that the government succeeds in this case. Second, the Soviet criminal and judicial system is structured to tailor evidence and produce results which will further the important political ends of the Soviet state at the expense, if need be, of justice in a particular case. Although these conclusions should come as no surprise, see, e.g., Dershowitz, The Best Defense, Chap. 7, \"An American Lawyer in the Soviet Court System\" (Random House 1982), the defendant's evidence in this case, uncontradicted by any evidence of the government, graphically illustrates how these characteristics of the Soviet Union are relevant to this case, bearing particularly on the admissibility of the Lithuanian depositions.\n\nThe Soviet Union's seizure and continued occupation of Lithuania has been accomplished by force, executions, deportation of Lithuanians and resettlement of non-Lithuanians in Lithuania. Many thousands of Lithuanians fled the country as the Soviet army approached in 1944. No doubt a number of these refugees were persons who had collaborated with the Germans and some no doubt had participated in the killing of Lithuania's Jewish population. Many thousands were not guilty of such offenses and of that number at least some had engaged in resistance to the German regime. These thousands fled from a renewed Soviet tyranny and frequently to avoid possible execution or deportation.\n\nDespite Soviet conquest there remain strong nationalistic feelings and continuing allegiance by a significant portion of the population to the Roman Catholic Church. The attempts by Soviet authorities to stamp out these influences and to create the myth of historic friendship between the people of the Soviet Union and its various national groups are weakened by the presence abroad of large groups of emigres who experienced personally the effects of Soviet occupation and who help keep alive Lithuanian national and religious convictions.\n\nThree witnesses, whose testimony was submitted in deposition form or in the form of testimony from other trials, described the steps the Soviet Union has taken to counter the influence of emigres from the Baltic states. These witnesses were Imants Lesinskis, a Latvian member of the KGB who defected in 1978; Melbourne Hartman, who had specialized in refugees from the Baltic states when he served as an investigator for the United States Displaced Persons Commission in 1949-1950 and who later became an employee of the CIA; and Tonu Parming, an Estonian who graduated from Princeton, was a Fulbright Scholar, received a graduate degree from Yale and has specialized in population and nationality issues and Soviet studies with emphasis on the Baltic states.\n\nLesinskis, born in Latvia, studied at the Moscow Institute for International Relations and after working briefly in Latvia returned to Moscow for KGB training. The KGB (the State Security Committee) has a central headquarters in Moscow where it is attached to the Council of Ministers, and it has a similar headquarters in each of the federal republics, including Latvia, Lithuania and Estonia.\n\nLesinskis worked for the KGB from 1956 to 1978 when he defected. One of his early assignments was with \"Motherland's Voice\", an agency engaging in propaganda designed to discredit Latvian emigres abroad by characterizing them as war criminals or collaborators during the German occupation or by characterizing them as acting under orders of western intelligence agencies. Sometimes the charges were true; sometimes they were fabricated.\n\nIn 1964 there was formed the Latvian Committee for Cultural Relations of Latvians abroad, and during 1970-76 Lesinskis was chairman of its presidium, receiving instructions from the KGB. Its objective was also to discredit Latvian emigres, particularly those who actively sought the end of the Soviet occupation. This was accomplished by publication of books and articles purporting to describe the war crimes and collaboration of which emigres were guilty. The facts were often embellished and supplemented with forged documents, false testimony and pure invention. When he was assigned to a post in the United States, Lesinskis' job was to obtain information about Latvian communities abroad, to promote discord within them and to discredit their leaders. All of this was a KGB function.\n\nLesinskis testified that there was also a Committee for Cultural Relations of Lithuanians. He was not personally involved in its activities but he knew it had the same objectives as its Latvian counterpart and was also a KGB agency.\n\nReferring to trials of war criminals within the Soviet Union, Lesinskis stated that they were considered \"political trials\", and therefore reliance could not be placed on the formal safeguards written into Soviet law to protect a defendant.\n\nThe fact that the Soviet Union's particular interests are served when a United States court finds that an emigre participated in the slaughter of Jewish citizens or otherwise collaborated with the Germans, of course, does not preclude such a finding. However, the very strong interest of the Soviet state in such a finding requires that the role of Soviet authorities in achieving its desired end in this case be examined with particular care.\n\nThe Soviet system of justice is not such as to instill great confidence in the unverified fruits of an investigation of a case involving sensitive state issues. Two witnesses, whose testimony was also submitted in deposition form, or in the form of former trial testimony, described that system insofar as it is relevant in this case. Zigmas A. Butkus graduated from Vilnius Law School, worked for the procurator's office in Kaunas as an investigator for two years, was a district judge in Kaunas for three years, and eventually became chief of the Kaunas Bar. He never worked for the KGB. Frederick Neznansky worked as a lawyer in the Soviet Union for 25 years -- 15 years in the Procurator's Office of the USSR and 15 years as a member of the Moscow Bar.\n\nBoth witnesses, but particularly Neznansky, described how the Soviet legal system functions in practice. Paralleling the constitutional organs of justice is a body not mentioned in the constitution which controls the activities of the KGB, the police, the procurators and the judges. That body is the Department of Administrative Organs of the Central Committee of the Communist Party. A corresponding body exists at each level of government. According to Neznansky, \"outside of the common system of criminal law, the law of judicial procedure and other ordinary legislation, there is the Communist Party legislation in the Soviet Union whose decrees are communicated to the parties involved through a variety of means.\" (Neznansky Dep. at 470). Failure of a procurator or judge to follow party instructions would result in the loss of his job and Party membership.\n\nNeznansky and Butkus each testified concerning Soviet prosecution of persons charged with war crimes. The former, at least, has no reason to be sympathetic to those guilty of such charges. His grandparents were shot by the Germans in Russia in 1941; his uncle and eight of his children were buried alive in the grave they dug at the command of the Germans.\n\nThere came a time in the Soviet Union when a campaign against war criminals was given great emphasis. Appropriate instructions were issued to procurators and judges. This coincided with widely publicized claims that western nations were harboring such criminals and refusing to extradite them.\n\nAccording to this testimony, there are three kinds of cases in the Soviet Union -- (i) those involving common people, accounting for 70-80% of all cases, (ii) those involving members of the ruling circles and (iii) political cases. The latter involve inhabitants of ethnic republics seeking independence, religious persons, and political dissidents. Such cases are only nominally controlled by the codes of criminal procedure. They are subject to Party direction. They are investigated by the KGB and prosecuted by the appropriate procurator.\n\nAccording to Neznansky's testimony, the testimony and other evidence in such cases is not necessarily false. Many witnesses are truthful and many investigations are conducted honestly. However, where the evidence does not support the desired results there is intense pressure to remold it:\n\nSo far as I know from my being able to peek into Soviet official records in the Ministry of Internal Affairs back in 1977, there were 10,000 people in jail for offenses which would be called political in the west. Those cases, the whole illegal arsenal of investigation and trial is being used by the authorities. The political cases are investigated mostly by the investigative arm of the KGB. Other cases are investigated by the procurator's office or the Ministry of Internal Affairs. Witnesses are indeed trained to testify according to the wishes of the prosecution. Sometimes they are threatened, not in a serious way, but people could be told that they will be fired if their testimony was not appropriate. Or sometimes if a witness is in line for a new apartment, they would take him off that line, or they would threaten to telephone his manager at work or his Communist Party organizer and make trouble for that witness.\n\nSometimes witnesses are threatened in a more serious way of being accused of perjury, threatened with being accused of complicity in the given crime. And evidence is also falsified on occasions.\n\nFor example, a witness would be asked, did you see this man there at a given time. And the witness would say, no, I didn't. So he would be called to the interrogator again and again. He will be bothered sufficiently enough to change his testimony in the desirable way eventually. And the investigation continues even after the case was given to the court.\n\nFor example, when I was an investigator myself, a judge would call me sometimes and tell me, you sent us this witness and he changed his testimony in court. You told me one thing and he's telling us something else. We will recess the court for a couple of days. Could you work him over a little bit more. So call the witness back and make him change his testimony.\n\nFrom the experience of my colleagues and people I knew in the KGB, sometimes they falsified the transcript of a witness' testimony. For example, a witness would testify to one thing and the transcript will say another thing, and then simply force the witness to sign this testimony, usually appealing to his sense of civic duty. The way it's explained to the witness is quite often very lofty. The accused is a criminal against the Communist Party, against the state, and is probably a parasite and an enemy of the people. So it is the civic duty of the witness to testify in the appropriate way.\n\nNeznansky Dep. at 639-641.\n\nCases involving charges of war crimes were and are treated by Soviet authorities as political cases. This includes cases in which the Soviet authorities assemble evidence for the use of OSI in denaturalization proceedings such as this. It can hardly be questioned that in the present case the KGB was responsible for preparing the Lithuanian witnesses for OSI interrogation by examining them and obtaining written statements (the \"protocols\"). The February 25, 1983 issue of Izvestia (Exh. D-52) reported that \"The Committee for State Security of the USSR [KGB] paid great attention to the request from our editors to speak to them about that work, which is being carried on in searching out war criminals, individuals who during war time committed bloody crimes -- About this was our conversations with responsible employees of the USSR's KGB. I was provided with the opportunity to acquaint myself with documents, have detailed talks with the employees, who from day to day, from year to year, engage in this work which is so hard, but so necessary for the good of humanity . . . . The motto of those who search for former Nazis, traitors, persons who committed war crimes, is -- the defense of the interests of our state and justice. These interests of the state dictate all of the in depth, tense and complicated work in the search for war criminals.\"\n\nNo defense evidence establishes that any document supplied by the Soviet Union in any denaturalization case was false or that any witness whose testimony was taken in the Soviet Union was subjected to improper pressure or other influences. But, of course, no defendant in any such case has had the opportunity to investigate the circumstances under which the KGB and procurator prepared the witnesses for interrogation by the OSI.\n\nWe are faced with a situation where the Soviet Union has a continuing, strong state interest in a finding that defendant was guilty of atrocious conduct while collaborating with German occupation forces. We also are faced with the fact that the Soviet Union uses special procedures in political cases such as this which, on occasion at least, result in false or distorted evidence in order to achieve the result which the state interest requires. In these circumstances OSI received from the Soviet authorities the product of the KGB investigation primarily in the form of protocols containing the purported prior statements of witnesses.\n\nWith these factors in mind it is necessary to examine both the manner of conducting the depositions and the content of the testimony elicited in this case.\n\nC. Conducting the Foreign Depositions: The foreign depositions were taken pursuant to an order of Judge Meanor dated October 14, 1981. The order provided that the depositions would \"be governed by the Federal Rules of Civil Procedure and plaintiff should not interfere directly or indirectly with the right of defense counsel to conduct a full and free cross-examination of each witness -- no witness shall be instructed by the plaintiff not to answer any questions.\" The order also provided that the government \"shall have present at each day of each deposition in Europe translators proficient in Lithuanian and Russian who are disinterested in the outcome of the law suit. . . .\"\n\nMany aspects of the deposition procedures cast doubt upon the reliability of the testimony concerning defendant and give rise to concern that this testimony may have been affected by the Soviet Union's interest in this case and by undue pressures brought to bear upon the witnesses.\n\nPresiding over each deposition was a Soviet procurator who exercised the authority of a judge and who directed the proceedings and limited areas of inquiry. If a truly impartial person were filling this role it would not be objectionable, but in effect one of the parties to the proceeding was also acting as judge. The prosecution of the case is a joint OSI-Soviet endeavor. The fact that the Soviet authorities had completed their investigative phase of the case and had turned over the fruits of their work to the OSI does not transform them into neutral observers. They remained part of the prosecution team and in fairness the officer who presided at the depositions should not have been a part of that team.\n\nMoreover, in the case of the government's two most critical witnesses -- Jonas Dailide and Juozas Kriunas -- the presiding procuratory was Jurgis Bakucionis. Data concerning Bakucionis is set forth in The Chronicle of the Catholic Church in Lithuania, an underground, illegal publication appearing approximately six times a year. It documents Soviet violations of human rights, particularly those of a religious nature. A summary of the Chronicle's references to Bakucionis (Exh. D-32) shows him to be an aggressive prosecutor of persons charged with offenses involving the exercise of religious practices or evidencing loyalty to national Lithuanian interests. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\"\n\nEach deposition commenced with a warning by the Soviet procurator to the witness of his obligations under Soviet law. Each had previously signed a protocol after interrogation by Soviet investigators investigating this case (most likely representatives of the KGB). Then the procurator questioned the witness in broad general terms, such as \"What do you know about the execution of the Soviet activists and the Jews in Kedainiai?\" (Narusevicius Dep. at 9). This of course called for personal knowledge and knowledge based on all manner of reports and statements of others, with no means of distinguishing one form of knowledge from the other.\n\nIn the case of the critical witness Juozas Kriunas, who had spent ten years in a Soviet labor camp, it was not enough that Procurator Bakucionis presided. In addition, as one of the OSI interrogators announced to the witness and for the record, \"Present at this deposition is Mr. Zhukov, from the Soviet Procurator General's Office.\" It was the first day of testimony in Lithuania. Perhaps Zhukov was there as a courtesy to the OSI. Perhaps he was there to remind the hapless Kriunas of his obligations to the Soviet authorities.\n\nObserving the deposition it was disturbing to note the extreme deference which the OSI attorneys paid to the Soviet procurator, who was in reality nothing more than their partner in the prosecution of the case. It was disturbing to note the manner in which representatives of the Department of Justice adopted the phraseology of the Soviet Procurator -- for example, always referring to the government and Communist Party leaders shot at Babeniai as \"Soviet activists.\" No doubt this was done unconsciously. However, this deference to the Soviet officials cannot have been lost on the witnesses and it emphasizes the unwarranted role assigned to a Soviet procurator in a case where the rights of a United States citizen are being tried in a court of the United States.\n\nAfter the Soviet procurator opened each deposition with his questioning of the witness, an OSI attorney commenced his examination. The government's method of questioning the witnesses compounded the difficulties created by the procurator's sweeping generalized questions. The government attorneys persisted time and again to pose blatantly leading questions, drawing upon the protocols which the witnesses had signed and upon the answers which the witnesses had given to the procurator's questions. Before I concluded that the deposition testimony cannot be admitted for the purpose of implicating defendant in the Kedainiai killings, I attempted to separate the most clearly objectionable questions from less objectionable ones, but the entire proceeding was improperly affected by this form of questioning.\n\nDespite the fact that Judge Meanor's October 14, 1981 order required that defense counsel have the opportunity \"to conduct a full and free cross-examination of each witness,\" and despite the fact that the government's attorneys were directed not to instruct any witness not to answer, the actions of the procurator seriously limited the effect of these requirements.\n\nWhen defendant's attorney sought to cross-examine Devidonis about the Soviet investigation of his role in the 1941 events, the procurator instructed him, \"Mr. Berzins, will you please give questions in the matter of the deposition?\" (Devidonis Dep. at 67). Even the government attorney recognized that this constituted a totally unwarranted limitation of cross-examination and suggested that if the questions dealt with defendant's participation or if Devidonis was giving incriminatory testimony against himself, the inquiry should be permitted. The procurator then questioned the witness whether he knew anything about defendant (which he did not) and ascertained from the witness that he said nothing during his 1977 and 1966 investigations which were not truthful. This apparently was designed to show that there was no information of the nature which the government attorneys suggested might be the subject of cross-examination. However, even the government missed the point. A critical question was not only what Devidonis said about defendant in 1977 and 1967. A critical question was whether at those times he attributed to persons other than defendant responsibility for acts of which defendant is now charged.\n\nCross-examination of one of the government's two most important witnesses, Juozas Kriunas, was limited by the procurator. For example, after having established that Kriunas had signed a protocol in 1946 as well as in 1977 defense counsel pursued the matter of the protocols further, only to be met with an instruction from the procurator: \"I would like to remind you once more, Mr. Berzins, that we are investigating Kungys' case and not the biography of the witness and not the relations of Mr. Kriunas with the Soviet authorities.\" (Kriunas Dep. at 59). As the foregoing portions of this opinion should suggest, the relation of all the witnesses with the Soviet authorities is absolutely critical in determining the reliability and thus the admissibility of the depositions taken in Lithuania. Here cross-examination on that subject was limited, if not foreclosed.\n\nAlso during the Kriunas cross-examination the procurator sought to cut off the witness' response. As defense counsel examined concerning the disposition of the clothing of the persons who had been shot, a subject well within the scope of the direct examination, the procurator stated to Kriunas, \"I would ask the witness to give a short answer, and I would ask Mr. Berzins, in order not to waste time. . . .\" (Kriunas Dep. at 81).\n\nOn occasion the OSI attorneys impeded defense counsel's efforts to obtain information about prior statements given by the witnesses, making silly objections, thus compounding the difficulties of defense counsel who confronted one opponent across the table and one at the head of the table. For example, after establishing that Silvestravicius had testified at the trial of a person named Gylys who had been charged with participation in the Kedainiai killings, defense counsel asked him at how many other trials he had testified. The government attorney broke in with an objection asserting that the question had not specified that it related to trials arising out of the Kedainiai killings. (Silvestravicius Dep. at 77). The objection was completely unwarranted as it was perfectly obvious that the Kedainiai killings were the only subject of all the questions.\n\nAnother factor which suggests the degree of Soviet involvement in and orchestration of the depositions is the use of interpreters provided by Intourist, also an agency of the Soviet Union. The interpreters appeared to be highly qualified. There is no evidence of any complete misinterpretations. However, it is clear from the testimony of defendant's witness, Daiva Kezys, a Lithuanian interpreter, and from other evidence that translations were skewed to throw a favorable light upon Soviet procedures and to cast the most favorable light possible upon the witnesses' testimony implicating defendant. There were strategic omissions of testimony, obviously for the same reason. For example, when Narusevicius was shown a folder containing six photographs (one of them of defendant) and was asked if he could recognize anyone, his answer was translated as: \"No, I can't recognize. They all look so different. No, I can't.\" (Narusevicius Dep. at 52). Omitted from the translation was the witness' answer: \"You can chop my head off -- I don't know.\" The omitted phraseology is significant both in itself and for the cross-examination it might have elicited.\n\nIt is unnecessary to recount the numerous shadings of meaning resulting from the apparent bias of the interpreters. Use of an Intourist employee was a violation at least of the spirit of Judge Meanor's order that the interpreter be a person \"disinterested in the outcome of the lawsuit.\" It is always possible to retranslate the entire deposition testimony if necessary, but that would not assist defense counsel who had to cross-examine on the basis of the translations made on the scene. The subtle shadings of meaning and omissions during translation are simply further indicia of the interest of the Soviet authorities in the outcome of these proceedings and of the methods which may have been employed to influence the outcome.\n\nD. Questions Raised by the Content of the Depositions: The preceding discussion suggests that the Soviet authorities had an interest in the outcome of this case and that the practices employed by the Soviet authorities in this case (to the extent it is possible to ascertain what they were) were consistent with practices known to be used in political cases. The preceding discussion also shows that at the depositions themselves cross-examination directed to prior statements of witnesses and their dealings with Soviet authorities was limited by the rulings of the procurator. This does not establish that the incriminating testimony necessarily was false, but it raises serious doubts.\n\nThere is within the deposition testimony itself some evidence of improper pressures having been applied to the witnesses. All had been interrogated by Soviet authorities in 1976 or 1977 and the interrogators wrote down in the form of a protocol what each witness purportedly told them. The protocols were furnished to the OSI and ultimately to defense counsel. The OSI attorneys used the protocols to \"refresh the recollection\" of witnesses whose testimony varied from the account given in the protocols.\n\nThe testimony of two witnesses suggests that the interrogators may have attributed to the witnesses statements which they had not made.\n\nThe procurator interrogated defendant's sister-in-law, Juzes Rudzeviciene, as to the date and place of defendant's birth. This was a significant question because defendant is charged with having falsely stated the date and place of his birth in his immigration and naturalization papers. In response to the procurator's questions Rudzeviciene replied, \"I don't know. I don't know anything about his family.\" The procurator then pointed out to her: \"Witness Rudzeviciene, on the 26th of February, in 1977, you gave testimony to the Kedainiai Judge Janushkevicius, and then you testified that you know that Kungys was born in Shalialai District, in 1915.\" Despite the efforts of the procurator to persuade Rudzeviciene that she must have known this fact in 1977, Rudzeviciene insisted she never knew defendant's date and place of birth. If that is true, as seems likely, the statement in the protocol was an invention of the interrogators.\n\nMore dramatic is the contrast between Dailide's original testimony during the government's direct examination and the statements he is purported to have made in his 1977 protocol. Significantly, perhaps, he does not recall whether he read the protocol.\n\nIn any event, as described above, the statements attributed to him in the protocol are far more damaging to defendant than his prior testimony. When confronted with the protocol his demeanor changed remarkably. He was reduced to acknowledging, in effect, that if a matter was stated in the protocol it must be true. One is left to speculate whether Dailide had forgotten what he told the Soviet investigators in 1977 or whether the Soviet investigators had written a protocol which departed markedly from what Dailide actually said. One is also left to speculate whether what is stated in the protocol is true, whether what Dailide first testified to is true or whether both the protocol and the original testimony are false insofar as it relates to defendant.\n\nOne thing can be said with certainty. Dailide never used the language attributed to him in the protocol. He testified at length during the deposition taken in this case and it is possible to ascertain his manner of speech. It is inconceivable that he would have used the words attributed to him such as \"the bourgeois nationalist gang members\" and the \"Hitlerite soldiers\". That language was the invention of the Soviet interrogators. One can only speculate how much more of the protocol was the invention of the interrogators.\n\nThere are parts of the Dailide testimony given prior to the OSI attorney's reference to the 1977 protocol which raise questions as to its accuracy. Most of the observers of the killing of the Jewish prisoners described with considerable consistency the attack by Slapoberskis upon one of the guards and the German commandant at the edge of the pit. Dailide, on the other hand, describes an escape attempt of Slapoberskis at a considerable distance from the pit which is totally different from the other accounts of the Slapoberskis episode. (Dailide Dep. at 61). Also Dailide in his unrefreshed testimony stated that he and defendant were boarders at 3 Radvilu Street in the critical summer of 1941. On cross-examination he stated in seeming contradiction to the direct testimony that the boarders at that time were the owners, two of their daughters, the wife of a Red Army Officer and himself, with no reference to defendant. (Dailide Dep. at 107).\n\nThe accuracy or inaccuracy of the protocols is a critical issue. The various witnesses would have had to have an extraordinary courage to disavow any statement contained in a protocol. The depositions were presided over by a procurator, an officer of the legal system under those auspices the protocols were prepared. To have disavowed the protocols would have constituted a serious criticism of the system itself. Each witness who gave testimony implicating defendant in the killings was unusually vulnerable to pressure from Soviet authorities. Dailide testified to his own participation with defendant in the events at Babeniai Forest and on the Smilga River. He had never been subjected to charges for this conduct, but the threat of prosecution remains. Kriunas had already served 10 years' imprisonment for his role in the killings. When testifying he was confronted not only with the presence of the local procurator, but also with the presence of a representative of Moscow's Procurator General's Office. He clearly would not lightly risk a return to the Soviet penal system.\n\nLike Dailide, Silvestravicius has never been tried for his role in the 1941 killings. Also like Dailide he has been a frequent witness in cases against others. He too is under pressure to conform to the wishes of Soviet authorities and must recognize that prosecution for his role in the Kedainiai killings is always possible.\n\nE. The Missing Evidence: None of the foregoing established conclusively that Soviet authorities did in fact unduly influence the testimony of the deposition witnesses in this case. It does establish that there is a very grave risk that they may have done so and that there has been a totally inadequate opportunity to investigate this question.\n\nThere was documentary material in existence which most likely would have been of substantial assistance in determining whether the protocols and thus the testimony in this case were truthful insofar as they relate to defendant. The only protocols made available were those prepared in 1977. At that time defendant was the target of the investigation being conducted by the OSI and the Soviet authorities. If evidence was to be manipulated against him it would have been done at that time.\n\nHowever, each of the three witnesses who incriminated defendant signed protocols or gave testimony about the critical events on earlier occasions when defendant was not the target. Dailide returned to Kedainiai in 1944 and told the local KGB office of his wartime activities. In 1945 or 1946 he signed a protocol after being interviewed in the procurator's office concerning the 1941 killings. In 1946 Kriunas also signed a protocol concerning the killings in Kedainiai. Silvestravicius testified approximately 10 years ago against Gylys in a trial in which Gylys was charged with having led a detachment of civilians who assisted the Germans during the killings in Kedainiai. In the present case the government charges that Gylys was defendant's deputy in the detachment led by defendant. Thus all the evidence at his trial could be crucial in the present case.\n\nThe importance of those protocols and trial testimony is obvious. The statements were made and the testimony given at a time much closer to the event, when memories would be far fresher than they are now -- 40 years later. Further, defendant probably was not a target on those occasions, and a comparison of the facts related then with the facts related when defendant became a target might well disclose whether evidence has been distorted or manufactured for the purpose of implicating defendant.\n\nThe government elected to collaborate in the prosecution of this case with the Soviet Union, a totalitarian state. It has accepted the assistance of Soviet authorities, particularly the testimony of witnesses who had been interrogated by Soviet investigators and from whom statements had been obtained by those interrogators.\n\nKnowing the nature of the Soviet legal system, the government had an obligation to make every effort to ensure that the testimony it received under the auspices of the Soviet authorities was not tainted by the known Soviet practices designed to obtain the desired results in a particular case even at the expense of the truth. If the government deputizes a totalitarian state to obtain for it evidence to be used in a United States court, the government must take whatever steps are necessary to ensure that the evidence was not coerced or otherwise tainted by improper pressures.\n\nThe government has not fulfilled its responsibilities in this regard in this case. If it did not know about the earlier testimony and protocols of the Lithuanian witnesses prior to the taking of their testimony in Vilnius in 1982, its investigation was inadequate. If it did know about that material prior to the taking of those depositions, it was remiss in failing to insist upon its production. The government cannot excuse its failure to turn this material over to defendant, as it sought to do during the Kriunas deposition, on the grounds that it had not received the material from the Soviet government. (Kriunas Dep. at 97). At the very least, if the OSI attorneys first learned of the earlier testimony and protocols at the deposition sessions, they should then have insisted that the Soviet authorities produce them. If they were met with a refusal, then suspicions should have been aroused.\n\nDuring the trial I directed the government to proceed through diplomatic channels or through whatever other channels were available to it to obtain the earlier testimony and protocols. The trial was not held on consecutive days and there was ample time during the period from its commencement on April 5, 1983 until its conclusion on June 14 to obtain the documents. On June 14, however, the government reported that in response to its request, \". . . a return phone call was made by the Minister of Foreign Affairs to the American Embassy that while efforts continue to locate the protocols relating to the Kungys case, it is highly doubtful that they can be located by June 14th. Soviet authorities are not even certain the protocols still exist.\" (Trial Transcript at 1283). No reference was made to the requested trial transcripts but the government's attorneys assumed that the reference to protocols was also a reference to transcripts. I am left with the distinct impression that the Soviet authorities simply do not wish to produce this material. The most likely reason for not wishing to produce it is that it would reflect adversely on the 1977 protocols and therefore on the Lithuanian deposition testimony. The net result is that the best evidence from which the accuracy of this testimony can be determined is unavailable and most likely is being withheld by one of the two governments cooperating in the prosecution of this case. Under these circumstances the United States government must accept responsibility for the acts and omissions of its partner.\n\nF. Conclusion: The Lithuanian depositions will be admitted for the limited purpose of establishing the happening of the killings in Kedainiai in July and August 1941. They will not be admitted as evidence that defendant participated in the killings. In summary, the reasons for this ruling are: (i) The Soviet Union, which cooperated with the United States government by making these witnesses available, has a strong state interest in a finding that defendant participated in the Kedainiai killings; (ii) The Soviet legal system on occasion distorts or fabricates evidence in cases such as this involving an important state interest; (iii) These depositions were conducted in a manner which made it impossible to determine if the testimony had been influenced improperly by Soviet authorities in that a Soviet procurator presided over the depositions, a Soviet employee served as translator, evidencing actual bias in the manner of translation, and the procurator limited cross-examination into the witnesses' prior statements and dealings with Soviet authorities; (iv) The content of the deposition testimony suggests that the Soviet interrogators distorted the witnesses' testimony when they prepared the 1977 protocols; and (v) The United States government failed to obtain and the Soviet government refused or failed to turn over earlier -- transcripts and protocols of the witnesses which most likely would have disclosed whether the testimony in this case was the subject of improper influence. Exclusion of the deposition testimony except for the limited purpose specified above is consistent with the course followed by Judge Fullam in United States v. Kowalchuk, 571 F. Supp. 72 (E.D. Pa. 1983). In United States v. Linnas, 527 F. Supp. 426 (E.D.N.Y. 1981) the Court relied upon videotaped depositions taken in the Soviet Union. However, in that case defendant's counsel did not choose to attend, the indicia of unreliability existing in the present case were not found to exist, and there was strong corroborative evidence.\n\nWithout the use of the deposition testimony the most that the government can establish, viewing its evidence in its most favorable light, is that defendant, despite his claims to the contrary, was in Kedainiai in July and August 1941, that he was a member of the Sauliai, that he misrepresented the date and place of his birth in his various immigration and naturalization papers, and that he failed to disclose in his immigration visa and alien registration forms that he was in Kedainiai at any time during the period from 1940-1942.\n\nIn order to justify revocation of citizenship, the evidence must be \"clear, unequivocal, and convincing,\" such as not to leave \"the issue in doubt\". Schneiderman v. United States, 320 U.S. 118, 125, 87 L. Ed. 1796, 63 S. Ct. 1333 (1943). \"Any less exacting standard would be inconsistent with the importance of the right that is at stake in a denaturalization proceeding.\" Fedorenko v. U.S., 449 U.S. 490, 505, 66 L. Ed. 2d 686, 101 S. Ct. 737 (1980). As stated by the Third Circuit Court of Appeals in U.S. v. Riela, 337 F.2d 986, 988 (1964):\n\nThis burden is substantially identical with that required in criminal cases -- proof beyond a reasonable doubt. [Citing Klapprott v. United States, 335 U.S. 601, 612, 93 L. Ed. 266, 69 S. Ct. 384 (1949).]\n\nThe admissible evidence is insufficient to sustain the government's charges that defendant participated in the July and August 1941 killings in Kedainiai.\n\nIV. Facts Pertaining to Defendant\n\nIt is now necessary to turn to the facts about defendant established by the evidence other than the depositions video-taped in the Soviet Union.\n\nDefendant was born on September 21, 1915 in the Village of Reistru, Silales County, Lithuania. He had four brothers and five sisters, and during his childhood he lived at his parents' farm near Reistru Village. After attending local schools, he began studying for the priesthood at the Catholic Seminary at Telsiai in September 1932. In 1938 he left the seminary without having received Holy Orders and in July of that year, when Lithuania was still independent, he began military service. In September 1939 he graduated from the Lithuanian Cadet School in Kaunas and was commissioned as junior lieutenant. He served in the Lithuanian Army until November, at which time he was either demobilized or resigned.\n\nThereafter he obtained employment with the Lithuanian Bank and was assigned to the branch at Kedainiai in late 1939. When he lived in Kedainiai he boarded at the home of the parents of his wife-to-be at No. 3 Radvilu Street. In June 1940 the Soviet Union occupied Lithuania. Defendant remained at the bank in Kedainiai. On June 22, 1941 the Germans attacked the Soviet Union and quickly occupied all of Lithuania.\n\nThere is a major dispute between the parties as to when defendant left Kedainiai. Defendant asserts that in late June or July 1941 he went to Kaunas and commenced working in a printing plant on or about July 6. He produced a certificate of the concern for which he claims to have worked stating that he worked there as of that date. (Exh. A-13). The certificate is somewhat suspect inasmuch as the date when defendant was supposed to have commenced work was a Sunday and its letterhead is written in both Lithuanian and German. This would have represented a rather rapid transition, since the Soviet Army had been driven from the City less than two weeks before the July 6 date. However, it was certainly not beyond the capabilities of a printing concern to run off such a letterhead and after the German occupation it would have been imprudent to have continued using a Russian designation.\n\nThe government contends that defendant did not leave Kedainiai until mid-October 1941, when both sides agree he again entered Telsiai Seminary. The evidence is persuasive that the government's version of the events is correct. Defendant submitted to the Kedainiai branch of the bank a letter dated October 10, 1941 resigning effective October 16, 1941. (Exh. B-17). On September 12, 1981 defendant wrote to a person who might have been able to assist him with pertinent information, stating, \"I lived in Kedainiai from December, 1939 until October, 1941. I worked at the Bank of Lithuania.\" (Exh. K-1). I find, therefore, that defendant remained in Kedainiai until October 1941. If there were admissible evidence tending to show that defendant played a part in the killings in Kedainiai in July and August 1941, the falseness of defendant's testimony that he was in Kaunas during those months would tend to corroborate the evidence of his complicity in the killings. Since such evidence is lacking, however, the falseness of defendant's testimony as to the date he left Kedainiai bears primarily upon his credibility generally.\n\nDefendant remained at Telsiai only briefly, leaving after Christmas 1941. He moved to Kaunas where he first went to work for a printing plant and then went to work for a small brush and broom factory, employing perhaps 12 or 15 persons. It was owned and managed by a husband and wife and defendant served as a clerk-bookkeeper. While in Kaunas defendant married Sofija Anuskeviciute, the daughter of the persons with whom he had resided while living in Kedainiai. Mrs. Kungys had been studying dentistry and during the war years commenced practicing her profession.\n\nDefendant claims to have participated in the resistance movement referred to above and described in the testimony Vydaudas Vidiekunas. According to defendant he worked with a man named Broius Budginas and together they stole printing equipment for the use of the resistance and printed underground newspapers. There is some independent evidence to support this claim, and there is evidence suggesting that the claim should be viewed with suspicion.\n\nAt the end of a March 27, 1981 interview of defendant by attorneys for the OSI, defendant finally admitted that he had given false information in all his immigration and naturalization proceedings as to the date and place of his birth. From the outset he had informed the United States authorities that he was born on October 4, 1913 in Kaunas. The truth, of course, was that he had been born on September 21, 1915 in Reistru.\n\nWhen on March 27, 1981 defendant admitted that the information as to the date and place of his birth was false, he explained that he made the change in April 1944 because he was being hunted by the German authorities. The German authorities had learned of the identity of members of the Lithuanian resistance in Kaunas in that month. Defendant informed the OSI attorneys that he was warned to stay away from a meeting at which he would have been arrested and that he thereupon, with the assistance of members of the resistance, obtained a new identification card from the Kaunas Burgomaster's Office showing the false date and place of birth. (Exh. A-1). The card is dated April 26, 1944.\n\nFour considerations cast doubt upon defendant's contention. (i) In his answers to interrogatories submitted in November 1981 defendant stated, in apparent conflict with his March statement, that the reason he obtained the false identification card was to avoid mobilization into the German Army. However, this is not necessarily inconsistent with his March 27, 1981 account since a major objective of the resistance was to enable Lithuanians to avoid conscription by the Germans. (ii) The photograph on the identification card supposedly issued in April 1944 was obviously taken from the same negative as the photograph which accompanied his 1947 visa application, suggesting that perhaps defendant forged the identification card in Germany. It is possible, as he claims, that he brought the negative with him when he fled from Lithuania. (iii) Defendant asserts that he applied for the false identification card in response to the arrest of members of the resistance. According to the Lithuanian Encyclopedia (Exh. T-4), \". . . the arrests of Vlikas members and their close associates began on April 29-30, 1944,\" after the date when the card was supposed to have been issued to defendant. However, there is always the possibility that the Encyclopedia is in error or that there were other arrests at about that time. Vidiekunas testified that he was arrested on May 4 or 5 but that other members of the resistance had been arrested two weeks previously, which would have been before April 26. (iv) Finally, I fail to understand how merely changing the place and date of birth on an identification card could protect defendant from arrest. As long as he retained the same name it would seem that the Germans could readily identify and arrest him.\n\nNotwithstanding the doubtful nature of the April 26, 1944 identification card, there is some independent support for defendant's claim that he performed work for the resistance, namely, the deposition testimony of Walter Jansen and the trial testimony of Vidiekunas.\n\nJansen testified that he lived in Kedainiai and worked for the local government during the German occupation from 1942 to 1944. He and his wife knew the family of defendant's future wife Sofija and visited them often at their home on Radvilu Street. During the 1942-44 period defendant visited at the Radvilu Street home three or four times, according to Jansen. Each time he brought and gave to Jansen approximately 10 copies of an underground, anti-German newspaper printed on 2-1/4 X 5\" paper. Jansen testified that defendant told him he was in the underground and assisted by doing printing work. (Jansen Dep. at 40, 44-48, 54).\n\nAt the time he applied for his visa in 1947 defendant presented to the American Vice Consul a certificate dated June 18, 1946 from the Ex-Political Prisoners Committee to the effect that defendant had participated in the resistance movement. (Exh. A-2). The certificate was signed by Vidiekunas, whose participation in the resistance, arrest and confinement in Germany are described above. After liberation by the Allied Forces in 1945, Vidiekunas became a member of the Ex-Political Prisoners Committee. One of the purposes of the Committee was to protect prisoners of war and others from the Russians who sought to deport into Soviet occupied territory those who fled from the Baltic countries. The Committee, after checking, certified those who it determined had participated in the resistance.\n\nVidiekunas testified, truthfully I am convinced, that \". . . Mr. Budginas and some other person which I can't remember at this time\" told him about defendant's underground activities. (Trial Transcript at 930-931). Budginas told him that he and defendant stole a printing press and transported it out of Kaunas, and that they were engaged in organizing an underground newspaper. Unfortunately Budginas is dead. He did not work in the same underground group as Vidiekunas, but they were imprisoned together in Germany, and Vidiekunas had every reason to rely upon him. It seems unlikely that after his own dangerous service in the anti-German underground Budginas would provide false testimony to assist a person who had collaborated with the Germans. On the other hand it is possible he would have done so to protect a fellow Lithuanian from possible deportation by the feared and hated Russians.\n\nIn sum, the evidence is conflicting and much time has passed. It is impossible to state with any degree of certainty whether defendant did or did not participate in the resistance movement.\n\nIn any event, defendant worked at the brush and broom factory in Kaunas until July 1944 when the Soviet Army crossed the Lithuanian border. He and his wife then went to his father's farm in Reistru where he worked for farmers until October 1944.\n\nDefendant's flight from Lithuania and eventual settlement in Germany is best described by Yuozas Koncius, who for the last 27 years has been a high school teacher in Illinois and whose testimony has the ring of complete truthfulness.\n\nIn October 1944 the Soviet Army occupied the Lithuanian town where Koncius attended school and closed the school. Unable to return to his own home town because of the start of a Soviet offensive, Koncius and several school friends went to defendant's father's farm in Reistru. Koncius had known defendant's brothers in school.\n\nThe day after arriving at the farm the boys helped defendant's father bury family possessions, as the front was expected to reach the area momentarily. Shelling began at the end of the day. Defendant, his wife and a sister arrived at the farm with a horse and wagon. He told them, \"Youngsters, if you want to save your necks, get in the wagon and let's get going. This is not a place to stay.\" (Trial Transcript at 1206).\n\nDefendant and the group in the wagon joined the columns of refugees fleeing the Soviet Army and proceeded to and crossed the German border, where the journey continued. After several days they were stopped by German police. The men were taken off the wagon and the women went on. The men were placed under guard in a barn during the night and during the day were set to work digging trenches.\n\nIn some manner communication was made with the women and during the second or third night defendant, his brothers and Koncius escaped and rejoined the women. The horse was hitched to the wagon and the party proceeded westward, traveling by night and resting during the day. Upon reaching the Danzig Corridor they remained with a Polish family for a week, helping on the farm. The horse and wagon were sold and with the proceeds defendant was able to bribe officials and obtain train tickets to Tuebingen in the western part of Germany.\n\nIn Tuebingen the group was placed in a refugee camp from which defendant and his brothers went out into the countryside to find work. The men joined prisoners of war and other displaced persons working on neighboring farms. Defendant and his family found work and a place to live in nearby Poltringen. They stayed there or in neighboring towns until the area was captured by Allied Forces and the end of the War in Europe in May 1945. Until that time and thereafter defendant and his wife were required to register with local authorities. These records all reflect that he was born in Taurage (Reistru) Lithuania (not Kaunas). A few show his date of birth to be September 9, 1908; a few show his date of birth to be October 4, 1913; most show his date of birth to be September 21, 1915. Some of the information in these records concerning defendant's wife is incorrect.\n\nDuring the period after the War before defendant applied for his visa he sought to take courses given to certain displaced persons without charge, to Tuebingen University. In his applications defendant set forth the correct date and place of his birth. He exaggerated somewhat the importance of his role at the brush and broom factory in Kaunas, describing his work as \"industrial concern manager\". (E.g., Exh. N-2).\n\nIn January of 1947 visa applications were processed by vice-consuls stationed at American consulates in Germany, one of which was located at Stuttgart. An applicant was required to fill out forms seeking an immigration visa and an alien registration form and to submit with the forms verifying documents such as birth certificates and police reports. These forms were checked preliminarily by local persons employed by the consulate, and if they were found to be in order they were sent to a vice-consul for further review. If the vice-consul also found the forms to be in order he scheduled an interview with the applicant and sought to verify at the interview the information given. Of particular interest in the case of Eastern Europeans was the applicant's residences and occupations during the 1939-45 period, since that information tended to indicate the applicant's relationship to the Nazi occupation forces. If satisfied after the interview, the vice-consul forwarded the papers to the consul for issuance of a visa when one became available under the quota.\n\nDefendant and his wife applied to the consulate in Stuttgart for a visa and alien registration form in January 1947. In his application forms (Exh. A-3, A-4) defendant stated that he had been born on October 4, 1913 in Kaunas and that between 1940-1942 he had lived in Telsiai, Lithuania. He stated that during the past five years he had engaged in the following activities: \"student, dental technician, farm and forestry work\". In support of his statements as to date and place of birth defendant submitted the April 26, 1944 identification card supposedly issued by the Kaunas Burgomaster's Office (Exh. A-1), the certificate of the Ex-Political Prisoners Committee signed by Vidiekunas (Exh. A-2), a certificate as to defendant's date and place of birth issued by the National Delegate of the Vatican for the Lithuanians in Germany and Austria (Exh. A-6) and a police record of the City of Fellbach, Germany.\n\nThus, as charged by the government and as conceded by the defendant, defendant misrepresented and concealed in his visa application forms the date and place of his birth, the places of his residence during the period 1940-1942 and his occupation as a clerk, bookkeeper, accountant. The government has withdrawn its charges that defendant misrepresented the facts of his marriage, and the government has not established the other misrepresentations which it alleged in the pretrial order.\n\nI cannot understand what benefit defendant expected to achieve by placing his birth in Kaunas rather than Reistru and by dating his birth October 4, 1913 rather than September 21, 1915. It would not, as the government suggests, insulate him from charges of war crimes as long as he continued to use his own name. Defendant had evidence of his place of birth in his possession (Exh. A-18), and with a few exceptions the German municipal records reflected both the correct date and the correct place of his birth. (Exh. J-1 -- J-15). He could just as well have obtained a correct certificate from the Vatican Delegate as an incorrect one. Further, his forms named the town of Reistru as the residence of his parents. Of course, once started on a falsehood, it becomes ever more difficult to return to the truth.\n\nIronically, it would appear that had defendant given the correct information in his visa application form, his visa nevertheless would have been issued. There is nothing to suggest that his having been born on September 21, 1915 in Reistru would have had any effect whatsoever. Seymour Maxwell Finger, who served as a vice-consul in Stuttgart in January 1947 testified that disclosure of a period of residence in Kedainiai in 1941 would not have raised any questions in his mind. This is to be expected because there were few if any significant districts in Lithuania, or in all of Eastern Europe for that matter, in which German atrocities against the Jewish population did not take place. Defendant's wife's visa application listed her birth place and residence in Kedainiai. Professor Finger also testified that he would not have denied a visa even to the manager of a 15-employee brush and broom factory, although he might have wished to have asked questions on the subject during the personal interview with the applicant. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\"\n\nBased upon the information that was given by defendant, the United States Consulate at Stuttgart issued defendant on March 4, 1948 Quota Immigration Visa No. 114 pursuant to the provisions of the Immigration Act of 1924, Pub. L. No. 68-139, 43 State. 153, as amended. Defendant entered the United States on April 29, 1948 upon presentation of his visa.\n\nOn May 29, 1948 defendant executed an Application for Certificate of Arrival and Preliminary Form for a Declaration of Intention (Form N-300). (Exh. A-7). He again misrepresented the date and place of his birth. He did not, as originally charged by the government, misrepresent the facts of his marriage.\n\nOn October 23, 1953 defendant executed an Application to File Petition for Naturalization and an attached Statement of Facts for Preparation of Petition (Form N-400). (Exh. A-10). The documents were false as to defendant's date and place of birth and in that they stated that defendant had not previously given false testimony to obtain benefits under the immigration and naturalization laws. The government has withdrawn its charges that these documents contain false statements as to defendant's marriage and the evidence does not sustain the government's charge that \"Defendant swore that he had never committed a crime involving moral turpitude when in fact he had participated in the persecution and murder of over 2000 unarmed civilians.\"\n\nOn October 23, 1953, at a naturalization examination defendant reviewed the N-400 Form and swore that the contents were true. On the same date defendant executed under oath at a naturalization examination a Petition for Naturalization (Form N-405). (Exh. A-11). Again defendant misrepresented the date and place of his birth. The government has withdrawn its charge that in the document he misrepresented the facts of his marriage.\n\nOn February 3, 1954 the United States District Court of this District granted defendant's petition for naturalization and issued to him a Certificate of Naturalization. (Exh. A-12).\n\nIn the 1960's, as described above, the Soviet government resumed its investigations of Baltic emigres on charges of war crimes and collaboration with the Germans, disseminating these charges both in the Soviet Union and in western countries, particularly the United States. In the late 1970's cooperation between the Soviet authorities and the OSI in the prosecution of alleged war criminals commenced. In 1981 this action was instituted to revoke defendant's citizenship.\n\nV. Effect Upon Defendant's Citizenship\n\nThe government seeks to revoke defendant's citizenship pursuant to Section 340(a) of the Immigration and Nationality Act of 1952, as amended, 8 U.S.C. ยง 1451(a). That Section, in its present form, provides for revocation of a naturalized citizen's order and certificate of naturalization if they \"were illegally procured or were procured by concealment of a material fact or by willful misrepresentation.\" The government proceeds on both of these statutory grounds -- (i) illegal procurement and (ii) concealment of a material fact or willful misrepresentation.\n\nA. Illegal Procurement: Citizenship is illegally procured if there is a failure to comply with any of \"the congressionally imposed prerequisites to the acquisition of citizenship.\" Fedorenko v. United States, 449 U.S. 490, 506, 66 L. Ed. 2d 686, 101 S. Ct. 737 (1981). In the present case the government urges that defendant's citizenship was illegally obtained because it lacked two congressionally imposed prerequisites: (i) lawful admission into the United States by means of a lawfully acquired immigration visa, 8 U.S.C. ยง 1427(a)(1) and 8 U.S.C. ยง 1429 and (ii) good moral character, 8 U.S.C. ยง 1427(a)(3).\n\nThe government asserts that defendant's visa was unlawfully obtained for three reasons: because (i) he had committed acts of persecution and murder, (ii) his misrepresentations and concealments rendered his visa illegally procured and (iii) disclosure of truthful information would have resulted in further investigation and denial of his visa. Reasons (ii) and (iii) coincide with the second statutory ground for the government's action, i.e., concealment of a material fact or willful representation. They will be discussed below in that context.\n\nReason (i), acts of persecution and murder, finds its legal basis in the requirement in effect at the time that defendant obtained an immigration visa that aliens \"who had been guilty of, or who had advocated or acquiesced in, activities or conduct contrary to civilization and human decency on behalf of Axis countries,\" or similar acts during World War II, were inadmissible into the United States. Act of May 23, 1918 (40 Stat. 559), as amended by the Act of June 21, 1941 (55 Stat. 252) and Presidential Proclamation No. 2523 of November 14, 1941 (55 Stat. 1696), 10 Fed. Reg. 8995, 8997, 9000 (1945); 8 C.F.R. ยงยง 175.52(a), 175.53(j), 53(k) (1947s); 22 C.F.R. ยง 58 (1947s). However, as set forth above, the government has not established \"by clear, unequivocal and convincing evidence which does not leave the issue in doubt\" that defendant committed acts of persecution and murder. Schneiderman v. United States, 320 U.S. 118, 158, 87 L. Ed. 1796, 63 S. Ct. 1333 (1976). Thus the factual predicate for this claim of illegal procurement has not been established.\n\nThe government asserts that defendant lacked the prerequisite of good moral character (i) because he participated in the murder and persecution of unarmed civilians and (ii) because he gave false testimony for the purpose of gaining benefits under the Immigration and Nationality Laws.\n\nThe factual basis for the first reason has not been established. The government asserts that false testimony alone without proof of the materiality of the testimony is sufficient to establish lack of good moral character. I do not so read the Supreme Court case cited by the government in support of that proposition. Berenyi v. District Director, 385 U.S. 630, 17 L. Ed. 2d 656, 87 S. Ct. 666 (1967). In that case the Court noted specifically that the \"question asked of the petitioner was certainly material and relevant.\" 385 U.S. at 638. The Chaunt case and its progeny, discussed below, certainly do not support the government's position. Therefore, again insofar as misrepresentations, under oath or otherwise, are concerned, the government's illegal procurement ground overlaps its concealment or misrepresentation ground.\n\nApart from charges of concealment and misrepresentation the government has not established its illegal procurement allegation. In view of this conclusion it is unnecessary to address defendant's argument that he cannot be charged with illegal procurement since at the time when he applied for a visa and for citizenship the Immigration and Nationalities Act did not contain the \"illegally procured\" language, see United States v. Riela, 337 F.2d 986 (3d Cir. 1964) in which the Court stated, \"The legality of the defendant's naturalization must be determined under the applicable provisions of the statutes as they were at the time of his admission to citizenship.\" (At 989).\n\nB. Concealment and Misrepresentations: Throughout his visa and citizenship proceedings defendant misrepresented the date and place of his birth. In addition in his application for a visa defendant failed to disclose (and therefore concealed) his presence in Kedainiai during the 1940-42 period and he failed to disclose (and therefore concealed) that he had been a bookkeeper-clerk in the Kaunas brush and broom establishment during the 1941-44 period. Defendant in effect perpetuated these non-disclosures or concealments throughout his naturalization proceedings by representing that the information contained in his visa application was correct. The determination must be made whether these misrepresentations and concealments constitute \"concealments of a material fact\" or \"willful misrepresentation\" within the meaning of Section 340(a).\n\nGuidance in making this determination is provided by the Supreme Court decisions in Chaunt v. United States, 364 U.S. 350, 5 L. Ed. 2d 120, 81 S. Ct. 147 (1960) and Fedorenko v. United States, 449 U.S. 490, 66 L. Ed. 2d 686, 101 S. Ct. 737 (1981).\n\nIn Chaunt the United States petitioned under Section 340(a) to revoke and set aside the order admitting petitioner Chaunt to citizenship on the ground that the order had been obtained by concealment of a material fact or by willful misrepresentation in his petition for naturalization and in his examination under oath. The district court cancelled petitioner's naturalization finding that he had concealed and misrepresented three arrests, his membership in the Communist Party and his lack of allegiance to the United States. The court of appeals affirmed, reaching only the question of concealing the arrests.\n\nThe Supreme Court emphasized, as it has done many times before and since, that in view of the grave consequences to the citizen, \"naturalization decrees are not lightly to be set aside -- the evidence must indeed be 'clear, unequivocal, and convincing' and not leave 'the issue . . . in doubt.'\" 364 U.S. at 353. Probably moved by this consideration the Court, reversing the judgment of the court of appeals, formulated a rule which narrows considerably the kinds of concealments and misrepresentations which will provide a basis for denaturalization:\n\nSuppressed or concealed facts, if known, might in and of themselves justify denial of citizenship. Or disclosure of the true facts might have led to the discovery of other facts which would justify denial of citizenship.\n\n346 U.S. at 352, 353.\n\nOn this record the nature of these arrests, the crimes charged, and the disposition of the cases do not bring them, inherently, even close to the requirement of \"clear, unequivocal, and convincing\" evidence that naturalization was illegally procured within the meaning of ยง 340(a) of the Immigration and Nationality Act.\n\n364 U.S. at 354.\n\nAn arrest, though by no means probative of any guilt or wrongdoing, is sufficiently significant as an episode in a man's life that it may often be material at least to further inquiry. We do not minimize the importance of that disclosure. In this case, however, we are asked to base materiality on the tenuous line of investigation that might have led from the arrests to the alleged communist affiliations.\n\n364 U.S. at 354, 355.\n\nWe only conclude that, in the circumstances of this case, the Government has failed to show by \"clear, unequivocal, and convincing\" evidence either (1) that facts were suppressed which, if known, would have warranted denial of citizenship or (2) that their disclosure might have been useful in an investigation possibly leading to the discovery of other facts warranting denial of citizenship.\n\n364 U.S. at 355.\n\nIt is clear from the two part Chaunt rule that not all false statements or concealments made during the naturalization process will form a basis for revocation of citizenship, even when the person seeking citizenship made the false statements or concealments under oath. The dissent in Chaunt emphasized this point, noting, \"It is nowhere suggested, for example, that the petitioner's falsehoods were the result of inadvertence or forgetfulness -- that they were anything but deliberate lies.\" (At 356). This approach reflects the extreme care which the Supreme Court exercises when dealing with revocation of citizenship. The Chaunt rule superseded the rule which theretofore had prevailed in the Third Circuit as set forth in United States v. Montalbano, 236 F.2d 757 (1956). The Chaunt rule is reflected in the Third Circuit opinion in United States v. Riela, supra.\n\nIn Fedorenko, the government sought to revoke petitioner Fedorenko's citizenship both on grounds of illegal procurement and on grounds of concealment and misrepresentation. Petitioner failed to disclose in his application for a visa that he had served during World War II as an armed guard at the Nazi concentration camp at Treblinka, Poland. The Displaced Persons Act under which petitioner sought admission to the United States excluded individuals who had \"assisted the enemy in persecuting civilians\" or who had \"voluntarily assisted the enemy forces . . . in their operations.\"\n\nThe district court held that the petitioner did not come under the Act's exclusion of persons who had assisted in the persecution of civilians because he had served involuntarily. The district court, applying the Chaunt rule, also held that although disclosure of petitioner's service as a Treblinka guard would have prompted an investigation into his activities, the government had failed to prove that such an inquiry would have uncovered any additional facts warranting denial of a visa. The court of appeals reversed, disagreeing with the district court's interpretation of the second part of the Chaunt rule. The court of appeals held that the second Chaunt test requires only clear and convincing proof that (a) disclosure of the true facts would have led to an investigation and (b) the investigation might have uncovered other facts warranting denial of citizenship.\n\nThe Supreme Court affirmed the court of appeals but on different grounds. It found that petitioner gave false information in connection with his application for a visa under the Displaced Persons Act, thus bringing into play the Act's provision (analogous to Section 340(a)) that \"any person who shall willfully make a misrepresentation for the purposes of gaining admission into the United States as an eligible displaced person shall thereafter not be admissible into the United States.\" 62 Stat. 1013. The Court added, \"This does not, however, end our inquiry, because we agree with the Government that this provision only applies to willful misrepresentations about 'material' facts. The first issue we must examine then, is whether petitioner's false statements about his activities during the war, particularly the concealment of his Treblinka service, were 'material.'\" 449 U.S. at 507, 508.\n\nThe Court did not decide whether the Chaunt test of materiality applied. It noted that Chaunt involved statements made during applications for citizenship whereas Fedorenko involved statements made during applications for visas prior to entry into the United States. The present case, of course, involves statements made both when defendant applied for a visa and when defendant applied for citizenship.\n\nAs to the visa application stage the Court held that \"at the very least, a misrepresentation must be considered material if disclosure of the true facts would have made the applicant ineligible for a visa.\" 449 U.S. at 509. The Court then held that the true facts about petitioner's service as an armed guard at Treblinka would, as a matter of law, have made him ineligible for a visa under the Displaced Persons Act. Thus a certificate of citizenship was revocable as \"illegally procured\" under ยง 340(a).\n\nThe concurring and two dissenting opinions in Fedorenko analyze in some detail the second Chaunt test of materiality.\n\nJustice Blackmun, concurring, failed \"to see any relevant limitation in the Chaunt decision or the governing statute that bars Chaunt's application to this case. By its terms, the denaturalization statute at the time of Chaunt, as now, was not restricted to any single stage of the citizenship process. Although in Chaunt the nondisclosure arose in response to a question on a citizenship application form filed some years after the applicant first arrived in this country, nothing in the language or import of the opinion suggests that omissions or false statements should be assessed differently when they are tendered upon initial entry into this country. If such a distinction was intended, it has eluded the several courts that unquestionably, have applied Chaunt's materiality standard when reviewing alleged distortions in the visa request process.\" 449 U.S. at 519.\n\nJustice Blackmun concluded that the minimal test of materiality set forth in Fedorenko was equivalent to the first test of Chaunt -- facts which if known would have warranted a denial of eligibility are material. Thus application of the Chaunt test to the Fedorenko facts would have produced the same result. Justice Blackmun rejected the court of appeals test \"which would have diluted materiality\":\n\nThe Court of Appeals reasoned that materiality was established if the nondisclosed facts would have triggered an inquiry that might have uncovered unproved and disqualifying facts. See 597 F.2d 946, 950-952 (CA5 1979). By concluding that the Government has demonstrated the actual existence of disqualifying facts -- facts that themselves would have warranted denial of petitioner's citizenship -- this Court adheres to a more rigorous standard of proof. I believe that Chaunt indeed contemplated only this rigorous standard, and I suspect the Court's reluctance explicitly to apply it stems from a desire to sidestep the confusion whether Chaunt created more than one standard.\n\nChaunt, to be sure, did announce a disjunctive approach to the inquiry into materiality, but several factors support the conclusion that under either \"test\" the Government's task is the same; it must prove the existence of disqualifying facts, not simply facts that might lead to hypothetical disqualifying facts.\n\n. . . I conclude that the Court in Chaunt intended to follow its earlier cases, and that its \"two tests\" are simply two methods by which the existence of ultimate disqualifying facts might be proved. This reading of Chaunt is consistent with the actual language of the so-called second test; it also appears to be the meaning that the dissent in Chaunt believed the Court to have intended.\n\nSignificantly, this view accords with the policy considerations informing the Court's decisions in the area of denaturalization. If naturalization can be revoked years or decades after it is conferred, on the mere suspicion that certain undisclosed facts might have warranted exclusion, I fear that the valued rights of citizenship are in danger of erosion.\n\n449 U.S. at 523-526.\n\nIn his dissent Justice White disagreed with Justice Blackmun's interpretation of Chaunt's materiality test, stating:\n\nUnder the District Court's interpretation of the second Chaunt test and that urged by petitioner, the Government would be required to prove that an investigation prompted by a complete truthful response would have revealed facts justifying denial of citizenship. The Court of Appeals and the Government contend that under the second Chaunt test the Government must prove only that such an investigation might have led to the discovery of facts justifying denial of citizenship. In my opinion, the latter interpretation is correct.\n\n449 U.S. at 528.\n\nIn a footnote Justice White explained what the burdens of proof would be under his interpretation of Chaunt:\n\nThe Government should be required to prove that an investigation would have occurred if a truthful response had been given, and that the investigation might have uncovered facts justifying denial of citizenship. The defendant could rebut the Government's showing that the investigation might have led to the discovery of facts justifying denial of citizenship by establishing that the underlying facts would not have justified denial of citizenship.\n\n449 U.S. at 538, ftn.8.\n\nIn his dissenting opinion Justice Stevens concluded that the Court's construction of the Displaced Persons Act was erroneous and, disagreeing with Justice White, that the court of appeals had misapplied the Chaunt test. Concerning the second prong of the Chaunt test he wrote:\n\nThe Court and the parties seem to assume that the [second] Chaunt test contains only two components: (1) whether a truthful answer might have or would have triggered an investigation, and (2) whether such an investigation might have or would have revealed a disqualifying circumstance. Under this characterization of the Chaunt test, the only dispute is what probability is required with respect to each of the two components. There are really three inquiries, however: (1) whether a truthful answer would have led to an investigation; (2) whether a disqualifying circumstance actually existed, and (3) whether it would have been discovered by the investigation. Regardless of whether the misstatement was made on an application for a visa or for citizenship, in my opinion the proper analysis should focus on the first and second components and attach little or no weight to the third. Unless the Government can prove the existence of a circumstance that would have disqualified the applicant, I do not believe that citizenship should be revoked on the basis of speculation about what might have been discovered if an investigation had been initiated. But if the Government can establish the existence of a disqualifying fact, I would consider a willful misstatement material if it were more probable than not that a truthful answer would have prompted more inquiry. Thus I would presume that an investigation, if begun at the time that the misstatement was made, would have been successful in finding whatever the Government is now able to prove. But if the Government is not able to prove the existence of facts that would have made the resident alien ineligible for citizenship at the time he executed his application, I would not denaturalize him on the basis of speculation about what might have been true years ago.\n\n449 U.S. at 537.\n\nTo summarize: Chaunt and Fedorenko in combination leave us with a number of rules which could be applied in determining if defendant's misstatements and concealments were material and therefore a basis for loss of citizenship under Section 340(a). Certain of the rules are inconsistent.\n\nChaunt itself states that to succeed under Section 340(a) the government must prove (i) that facts were suppressed which, if known, would have warranted denial of citizenship or (ii) that disclosure of the true facts might have been useful in an investigation possibly leading to the discovery of other facts warranting denial of citizenship. The first Chaunt test is clear and unambiguous and courts have had no difficulty applying it. Interpretation and application of the second Chaunt test, however, is in a process of evolution, as evidenced by the four opinions in Fedorenko.\n\nThe majority opinion in Fedorenko did not decide whether Chaunt is applicable at the visa application stage and therefore did not address itself to either Chaunt test. It did hold that at the visa application stage at the very least a misrepresentation is material if disclosure of the true facts would have made the applicant ineligible for a visa. In effect the Court applied the first Chaunt test to the visa application proceedings.\n\nJustice Blackmun concluded that there is in reality only one Chaunt test, that the so-called second test is simply another method of stating what the government must establish, namely the existence of facts which would disqualify a person from citizenship.\n\nJustice White would give independent effect to the second Chaunt test. According to his formulation of that test materiality would be established if the government proves by clear, unequivocal and convincing evidence that an investigation would have occurred if a truthful response had been given and that the investigation might have uncovered facts justifying denial of citizenship.\n\nJustice Stevens concluded that the second Chaunt test required that the government establish by the requisite quantum of evidence that a truthful answer would have led to an investigation and that disqualifying circumstances actually existed. If those two elements were proved, Justice Stevens would presume that the investigation would have been successful in discovering the disqualifying facts.\n\nIt is necessary to apply these various tests to defendant's misrepresentations and concealments to determine whether they were \"material\" within the meaning of Section 340(a) as applied by the Supreme Court. In doing so I have been mindful of Justice Stevens' cautionary observation in Fedorenko, that \"the gruesome facts recited in this record create what Justice Holmes described as a sort of 'hydraulic pressure' that tends to distort our judgment.\" 449 U.S. at 538.\n\nI believe that it is most probable that when the Supreme Court decides the question it will apply Chaunt to the visa application stage as well as the citizenship application stage. There is no reason I can think of not to do so. The concurring and dissenting Justices in Fedorenko applied Chaunt to both stages. In any event the Fedorenko majority opinion suggests some tests will be applicable to the visa application stage similar to the Chaunt test or tests. I have concluded that defendant's concealments and misrepresentations both singly and in the aggregate do not meet the requirement of materiality under any of the formulations set forth above.\n\nClearly the first Chaunt test is not met. None of the suppressed facts, if known, would have warranted denial of citizenship. Birth in Reistru on September 21, 1915, residence in Kedainiai during part of the 1940-1942 period, and employment in whatever capacity in a mom and pop brush and broom establishment are not facts which, if known, would have warranted denial of citizenship.\n\nBy the same token, the minimal test under Fedorenko's majority opinion has not been met. Disclosure of these facts would not have made defendant ineligible for a visa.\n\nFinally, defendant's misrepresentations and concealments would not be deemed material for Section 340(a) purposes under any of the interpretations of the second Chaunt test.\n\nJustice Blackmun's view that under either Chaunt test the government must establish facts which would disqualify a person from citizenship forecloses the government here. The government has not established such facts by admissible evidence.\n\nJustice Stevens' formulation of the second Chaunt test required that the government must establish not only that a truthful answer would have led to an investigation but also that disqualifying circumstances actually existed. Actual existence of the disqualifying circumstances has not been established.\n\nUnder Justice White's interpretation of the second Chaunt test the government must establish by the requisite quantum of evidence that truthful and complete responses by defendant would have resulted in an investigation and that the investigation might have uncovered facts justifying denial of citizenship. The government's own proofs tend to establish that truthful answers by defendant would not have resulted in an investigation. Certainly there was nothing which would excite suspicion in the fact that defendant was born in Reistru in the year 1915. Professor Finger, a vice-consul who passed on visa applications at the time defendant and his wife applied, testified that the fact of residence in Kedainiai during 1940-42 would not have raised any questions in his mind. He also testified that wartime employment in a management capacity in a 15 employee brush and broom factory in Kaunas might have prompted him to ask further questions at the personal interview. This is far from proof by clear, unequivocal and convincing evidence that an investigation would have occurred if defendant had given truthful responses to all four of the matters as to which his answers were false. It is unnecessary to pursue the second phase of Justice White's formulation to determine if an investigation might have uncovered facts justifying denial of citizenship. Even by the least onerous test of materiality (Justice White's formulation) the government has failed to establish concealment of a material fact or willful misrepresentation.\n\nThe government's proofs are inadequate to establish any of the bases for revocation of defendant's citizenship. Judgment, therefore will be entered for the defendant. The defendant's attorneys are requested to submit an appropriate form of order.\n\n\u003cspan class=\"fn\"\u003e1. During the course of this action the government withdrew its charges that defendant misstated the facts of his marriage.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. I have refrained throughout this opinion from characterizing the events which must be described -- the systematic, mass killings of Jewish people -- limiting myself to a recital of the facts. Adjectives or expressions of horror on my part would be inadequate and an intrusion. If anyone can do justice to the dead, it must be the poet, the theologian, the philosopher, the writer, e.g., Schwarz-Bart, The Last of the Just (Atheneum 1961).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Some confusion of terminology results from the use made of the term \"partisan\". Sometimes the German reports used the term to refer to the Lithuanians who joined the local auxiliary police forces to assist in maintaining order and, in some cases, to participate in the gathering of Jewish residents into the ghettos and in the mass killings. Sometimes the term is used in the German reports to refer to groups resisting German occupation authorities. The reports quoted in this opinion usually use the term in the former sense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In addition to the Jewish dead, there were others, e.g., \"5 communist functionaries\", \"1 Lithuanian woman\", \"19 Russian communists\", \"2 murderers\", \"2 Lithuanian NKVD agents\", \"1 mayor of Jonava who gave the orders to burn the city of Jonava\", \"1 Lithuanian who stripped the bodies of German soldiers\", \"432 Russians\", \"56 Lithuanians (all active communists)\", \"3 gypsies, 1 gypsy woman, 1 gypsy child\", \"mentally ill: 269 men, 227 women, 48 children\", \"4 Russian POW's\", \"1 German citizen who married a Jew\", \"1 Reichs-German who had converted to the Jewish belief and had visited a rabbinical school\", and \"15 terrorists of the Kalinin Group\". Two poignant entries recorded the killing in Kaunas on November 25 and November 29 of \"175 Jewish children (resettled from Berlin, Munich and Frankfurt am Main)\" and \"152 Jewish children (resettled from Vienna and Breslau)\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. There was one incident which is described in a number of the depositions of eyewitnesses to the killings. One of the prisoners, Slapoberskis, a strong man, attacked a Lithuanian participant named Czygas, dragged him into the ditch, grabbed his pistol and choked him. This episode, which bears on the reliability of the deposition testimony, is described in meticulous detail by Vladislovas Silvestravicius, an employee at the Kedainiai beer bottling plant who was one of the three truck drivers ordered to transport the infirm prisoners from Zirginas to the execution site: Q Did any of the Jews fight at the ditch or try to escape? A Only that only Jew I was mentioning earlier, Slapoberskis, who strangled Czygas. Q Did you see Slapoberskis fighting with Czygas? A Yes, I saw it. Q Tell us what you saw? A Someone undressed, and he had eyeglasses. They were neatly dressed and not -- it was happening not far from my truck. And that Jew started telling Czygas that, \"I am the same person like you.\" And Czygas caught him partially by his clothes, and this way the Jew was unstripped. And then Czygas took out the pistol, which was noticed by Slapoberskis, and this Jew was a heavily built person. And then he grabbed Czygas by the collar and dragged together with him -- and dragged him together into the ditch. And in the ditch Slapoberskis was holding Czygas with one hand, by his neck, and with the other hand he was -- and with the other hand he fired the pistol at the German. The German was a commandant. But he missed him. Then he -- then the German jumped into the ditch and managed to free Czygas, but the German himself was grabbed by Slapoberskis. Then Jankunas, the person I mentioned earlier, he was also a very heavily built person. At the same time Slapoberskis was struck -- striking the German on his head with the pistol, and at the same time Jankunas jumped into the ditch. Q Did Slapoberskis survive or was he killed? A And then when Jankunas jumped into -- no. And when Jankunas jumped into the ditch he freed the German away, whereas he himself was grabbed by Slapoberskis. And Jankunas had a knife with him, near -- in his belt, and then he killed Slapoberskis with that knife. Q Did Czygas survive? A No. He died on the way to the hospital. Silvestravicius Dep. at pp. 55-56.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Three examples of the summaries of articles in the Chronicle prepared by Father Casimir Pugevicius, a Roman Catholic Priest, illustrate the nature of Bakunionis' role as procurator: The case of five persons arrested during a crackdown against ethnographers in Lithuania and Latvia was brought to trial in Vilnius and prosecuted by Assistant Chief Prosecutor Bakucionis. Prosecutor Bakunionis accused Sarunas Zukauskas of instigating the ethnocentric organization and asked the court to pass the maximum sentence of seven years under Article 68 of the LSSR Criminal Code\"anti-soviet agitation and propaganda\". Chronicle No. 10, Mar. 5, 1974, pp. 20, 23. Prosecutor Bakunionis represented the state in the trial of Viktoras Petkus, which began on July 10, 1978. Petkus was a member of the Lithuanian Group to Monitor the Helsinki Accords. Petkus was sentenced to three years in strict regime labor camp, and five years of internal exile. Chronicle No. 34, p. 6. Responding to a summons, Father Alfonsas Svarinskas, Pastor of the Catholic Church in Vidukle, reported on September 3, 19-- to the Prosecutor's Office of the Lithuanian SSR in Vilnius, at Gogolio g.4, office no. 55. He was met by Prosecutor Bakucionis who, calling the priest \"an especially dangerous recidivist\", had him don striped concentration camp clothing, and led him to another prosecutor for charges.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Professor Finger also testified that in January 1947 under applicable regulations a visa applicant who had no close relatives in the United States was not eligible for a visa unless he could prove that he was a victim of Nazi persecution. The testimony and regulations in evidence in this case suggest that Professor Finger was in error on this point, although perhaps there was an informal policy at the Stuttgart consulate to prefer Nazi victims. In any event, despite the questions which the evidence raises as to defendant's claim that he participated in the resistance movement, the government's charge that these claims are false is not supported by clear, unequivocal and convincing evidence. Therefore the certificate as to defendant's participation in the resistance (Exh. A-2) has not been established to be false in that respect.\u003c/span\u003e\n\n",
    "body_length": 159458,
    "citedas": [
      "571 F. Supp. 1104"
    ],
    "attorneys": "W. Hunt Dumont, Esq., United States Attorney, By: Joseph F. Lynch, Esq., Jovi Tenev, Esq., Roger D. Einerson, Esq., U.S. Department of Justice, Washington, District of Columbia, for Plaintiff. , Williamson \u0026 Rehill, Esqs., By: Donald J. Williamson, Esq., Newark, New Jersey, and Ivars Berzins, Esq., Babylon, New York, for Defendant. Debevoise, District Judge.",
    "category": [
      "75"
    ],
    "judges": "DEBEVOISE, District Judge.",
    "citation_count": 0
  }
}
