{
  "id": "lqKCR2YBTlTomsSBCXqq",
  "document": {
    "title": "People v. Alvarez",
    "full_title": "THE PEOPLE AND v. MANUEL MACHADO ALVAREZ AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1996-12-05T00:00:00.000Z",
    "docket": "No. S012261.",
    "body": "MOSK, J.\n\nThis is an automatic appeal (Pen. Code, § 1239, subd. (b)) from a judgment including a sentence of death rendered under the 1978 death penalty law (id., § 190 et seq.). For the reasons that follow, we shall affirm.\n\nI. INTRODUCTION\n\nIn the Sacramento Superior Court, defendant, Manuel Machado Alvarez, and a codefendant, Belinda Denise Ross, were charged in an amended information by the Sacramento District Attorney on behalf of the People, as follows.\n\nIn count 1, defendant and Ross were each charged with murdering Allen Birkman. (Pen. Code, § 187, subd. (a).) For death eligibility, they were each alleged to have committed the offense in the course of a robbery (id., § 211) or an attempted robbery (id., § 211, 664)--the so-called felony-murder-robbery special circumstance. (Id., § 190.2, former subd. (a)(17)(i), as added by § 6 of Prop. 7, approved by initiative, Gen. Elec. (Nov. 7, 1978); accord, Pen. Code, § 190.2, present subd. (a)(17)(A).) For enhancement of sentence, defendant was alleged to have personally used a deadly or dangerous weapon, viz., a knife. (Id., § 12022, subd. (b).)\n\nIn count 2, defendant and Ross were each charged with robbing Birkman. For enhancement of sentence, defendant was alleged to have personally used a deadly or dangerous weapon, viz., a knife. For the same purpose, he was also alleged to have intentionally and personally inflicted great bodily injury. (Pen. Code, former § 12022.7, as amended by Stats. 1979, ch. 145, § 17, p. 341; see Pen. Code, present § 12022.7 [making no reference to the intentional infliction of great bodily injury].)\n\nIn count 3, defendant was charged with stealing a vehicle belonging to Edwin Glidewell, viz., a 1975 Chevrolet Camaro. (Veh. Code, former § 10851, as amended by Stats. 1986, ch. 1214, § 1, pp. 4293-4294, repealed by terms of Stats. 1989, ch. 930, § 11, p. 3260; accord, Veh. Code, present § 10851.)\n\nIn count 4, defendant was charged with raping Sandra S. (Pen. Code, § 261, former subd. (2), as amended by Stats. 1986, ch. 1299, § 1, pp. 4592-4593; accord, Pen. Code, § 261, present subd. (a)(2).)\n\nIn count 5, defendant was charged with robbing Greta Slatten. For enhancement of sentence, he was alleged to have personally used a deadly or dangerous weapon, viz., a blunt instrument.\n\nFor enhancement of sentence, defendant was separately alleged to have been convicted of a serious felony, viz., voluntary manslaughter (Pen. Code, § 192, subd. (a)) with personal use of a deadly weapon, prior to his commission of the offenses identified in counts one, two, four, and five, which were themselves serious felonies. (Id., § 667, subd. (a).)\n\nFor enhancement of sentence, Ross was separately alleged to have been convicted of a serious felony, viz., robbery with personal use of a firearm (Pen. Code, § 12022.5), prior to her commission of the offenses identified in counts one and two, which were themselves serious felonies.\n\nDefendant and Ross each pleaded not guilty to the charges and denied the allegations.\n\nTrial as to guilt for defendant and Ross jointly was by jury. On Ross's motion in the midst of the proceedings pursuant to Penal Code section 1118.1, the superior court ordered the entry of a finding that the felony-murder-robbery special circumstance alleged against her was not sustained because the evidence was insufficient. The jury rendered a guilty verdict against defendant for the murder of Birkman and fixed the degree at the first; together therewith, it made an express finding that he committed the offense in the course of a robbery or attempted robbery, and that he acted with intent to kill; it made a further express finding that he personally used a deadly weapon. It rendered a guilty verdict against Ross as an accessory to the murder of Birkman, but not for the crime itself. In addition, it rendered a guilty verdict against defendant for the attempted robbery of Birkman, but not for the completed crime; together therewith, it made an express finding that he personally used a deadly weapon; it made a further express finding that he intentionally inflicted great bodily injury, and an implied finding that he did so personally. Similarly, it rendered a guilty verdict against Ross for the attempted robbery of Birkman, but not for the completed crime. It next rendered a guilty verdict against defendant for the theft of Glidewell's vehicle. It also rendered a guilty verdict against him for the rape of Sandra S. Finally, it rendered a guilty verdict against him for the robbery of Slatten; together therewith, it made an express finding that he personally used a deadly weapon. Waiving a jury trial on the question, Ross admitted that she had previously been convicted of the alleged serious felony of robbery with personal use of a firearm.\n\nThe superior court proceeded to render judgment against Ross: It imposed a sentence of imprisonment comprising a total term of eight years and eight months--three years as an accessory to the murder of Birkman; eight months for the attempted robbery of the same victim (after sixteen months were stayed); and an additional five years for the serious felony enhancement.\n\nTrial as to penalty for defendant was by the same jury. The panel rendered a verdict of death.\n\nAfter defendant waived a jury trial on the question, the superior court found that he had previously been convicted of the alleged serious felony of voluntary manslaughter with personal use of a deadly weapon.\n\nDenying, among other motions, an application by defendant for modification of the verdict of death under Penal Code section 190.4, subdivision (e), the superior court proceeded to render judgment as follows: For the murder of Birkman, it imposed a sentence of death, staying a sentence of imprisonment for a term of one year for the enhancement for personal use of a deadly or dangerous weapon. For the other offenses, it imposed a sentence of imprisonment comprising a total term of seventeen years and eight months--eight months for the theft of Glidewell's Camaro (after sixteen months were stayed); six years for the rape of Sandra S.; five years for the robbery of Slatten, with an additional year for the enhancement for personal use of a deadly or dangerous weapon; and an additional five years for the serious felony enhancement; a term of three years for the attempted robbery of Birkman, with an additional year for the enhancement for personal use of a deadly or dangerous weapon, was stayed. It also ordered payment of a restitution fine in the amount of $10,000, and a crime prevention fine in the amount of $10.\n\nII. FACTS\n\nFor convenience, we shall set out the facts as disclosed at the guilt phase and then the facts as disclosed at the penalty phase.\n\nA. Guilt Phase\n\nThe People presented the jury with a story to the following effect.\n\nIn November 1986, defendant was released on parole after serving a term of imprisonment for what would be revealed to be convictions for voluntary manslaughter and assault with a deadly weapon in the Los Angeles Superior Court in 1982. He was bound to Los Angeles by the conditions of his parole.\n\nIn March 1987, in violation of such conditions, defendant moved from Los Angeles to Sacramento. Over the following months, he lived, on and off, with Leslie Colyer and Neetelfer Hawkins. He spent the major part of his time obtaining and consuming drugs and alcohol.\n\nOn May 12, late at night, defendant was socializing outside an apartment building. Present also was Sandra S. She lived in one of the units with her lover and her son. She was then working as a prostitute. Defendant was drunk, and was vomiting. He made a sexual advance on her, but was repulsed. She eventually returned to her apartment, and went to bed.\n\nOn May 13, about noon, Sandra S. awoke. Her lover and her son were not at home. She had a \"real bad feeling.\" Looking toward the foot of the bed, she saw defendant. He was standing with his zipper open, and was masturbating. She said, \"Oh, God, no.\" In a voice that was firm and serious, he responded, \"Oh, God, yes.\" She called for her lover. With coldness and calculation, he said, \"He can't help you now.\" He then began to rape her. Percy Spence, who was one of her friends, walked in. He asked, \"Are you having a date?\" She yelled, \"No, no[,] no, no, it's not.\" Defendant stated, \"Yes, it is.\" Several times, she repeated, \"No, it's not.\" Spence said, \"Oh, man, don't be doing that,\" and ran out. When defendant was finished, he put into his pants a long knife in a sheath, which he had evidently brought to the scene. Anthony Simpkins, another of Sandra S.'s friends, had arrived by this time. As he was entering, he passed Spence. Simpkins asked, \"hat's happening[?]\" Spence answered, \"h, just let it be.\" Sandra S. ran to Simpkins almost hysterical, and told him defendant had raped her. Defendant fled. As he did so, he proceeded up the street in the direction of Edwin Glidewell, with whom he was acquainted. Glidewell owned a 1975 Chevrolet Camaro, which was parked nearby with the key in the ignition. Defendant jumped into the driver's seat, started the engine, and took off. Glidewell gave chase, but failed in the effort.\n\nOn May 15, defendant met Ross as she was cashing a welfare check she had received earlier that day. With him at the wheel of Glidewell's Camaro, they immediately set out to obtain and consume drugs and alcohol. They continued to do so over the days that followed. In the course of their wanderings, they visited, among others, defendant's friend Neetelfer Hawkins and a friend of Ross named Gail Patton.\n\nOn May 17, late in the morning, defendant asked Ross to drive Glidewell's Camaro as he rode as a passenger. She entered a shopping center. He directed her to an office of the Golden 1 Credit Union. She parked, and he exited. At 11:28 a.m., Allen Birkman, a civilian identification technician for the Sacramento Police Department, withdrew $60 from his wife's account at the credit union's automatic teller machine. Defendant accosted Birkman; a struggle ensued; defendant stabbed Birkman in the heart. Ross pulled out of the parking space, and defendant managed to jump in. They made good their escape. Birkman called for help. Within seconds, a passerby named Charles Kosobud came to his aid. Birkman was holding his right hand to his chest, and had blood flowing through his fingers; he had a wallet in his left hand; he was swaying. Steadying him, Kosobud asked if they had robbed him; Birkman responded, \"No, but they tried.\" Kosobud asked who. Birkman responded, \"Two blacks.\" (Ross is an African-American. Defendant is, in his own words, \"Spanish and Islander,\" meaning \"[a] native [Cuban].\") Birkman soon collapsed onto the ground. Officer Calvin Lim of the Sacramento Police Department arrived at the scene. Birkman was already receiving emergency medical aid. Within several minutes, he was placed in an ambulance for transport to a hospital; Lim rode along. Birkman had difficulty breathing, and appeared to be in pain; he said he felt numbness or tingling in his body. Lim asked if he knew who had attacked him; he responded, \"[a] male black, approximately six foot tall\"--like defendant--who \"got into a Camaro.\" Within several more minutes, they arrived at the hospital.\n\nSometime before noon, Ross and defendant reached Gail Patton's apartment, which was not far from the Golden 1 Credit Union. Ross parked Glidewell's Camaro nearby. She entered the apartment with a long knife and a sheath. She appeared frightened. After wiping the weapon, she told Patton to give it to defendant. Defendant entered some minutes later. He appeared normal. Patton gave him the long knife and the sheath. Police officers approached Patton's apartment. Defendant and Ross apparently directed Patton not to say anything. At the apartment's entrance, the officers told Patton that they were investigating the incident at the Golden 1 Credit Union. They asked whether she knew anything about Glidewell's Camaro. She answered no. They departed. She told defendant to go. He did so. He left behind the long knife and the sheath. He also left behind Glidewell's Camaro.\n\nAbout 1:30 p.m., Greta Slatten, who was 78 years old, drove to a convenience store in a 1987 Ford Taurus she had recently bought. The store happened to be about two-thirds of a mile from Patton's apartment. There was no other automobile in the parking lot. There was only one other person--defendant. Slatten caught sight of him, and remained in her car with the doors locked. He went to a public telephone. She then exited the vehicle with her purse and keys, locked the doors, entered the store, and made a purchase. As she went to return to her automobile, she passed defendant, who was still at the telephone. She then lost consciousness. After she came to, she found that she was in a hospital, and had suffered injuries that required suturing with 20 stitches, prevented her from opening her mouth, and blackened the left side of her face from her hairline down through her neck. Defendant had taken her car, her keys, and her purse, and had fled.\n\nOn May 18, Birkman died as a result of the stab wound he suffered to the heart. The wound could have been inflicted by the long knife that defendant left behind at Patton's apartment.\n\nThat day or soon thereafter, Leslie Colyer spoke with defendant over the telephone. She had earlier been approached by the police, who had inquired as to his whereabouts and advised they were seeking him in connection with a homicide. In the course of the telephone conversation, she told him that the victim of the homicide was a police officer.\n\nOn May 27, defendant was arrested in Mississippi and jailed. He was apprehended at the wheel of Slatten's Taurus; Charles Robinson, who was hitchhiking, was a passenger. In the automobile was found a second long knife in a sheath. The next day, Robinson was also arrested and jailed. Defendant and Robinson shared a cell. Defendant told him that \"he had killed a police officer in California\"--referring evidently to Birkman. He was later returned to California.\n\nThe tale that defendant told was different from the People's. Testifying on his own behalf and introducing other evidence, he denied he had raped Sandra S.: he said she had consented, at least in part in order to obtain some cocaine he offered. He denied he had stolen Glidewell's Camaro: he said Glidewell had given him the automobile as security for a debt he incurred when he bought about $400 worth of cocaine from him on credit. He denied he had robbed or murdered Birkman: he said he was elsewhere at the time of the attack, and was the victim of mistaken identity. He denied he had robbed Slatten: again, he asserted alibi and misidentification; he said he had gotten possession of her Taurus the day she was robbed by giving some cocaine in trade to a young man who called himself \"J.R.\" He generally denied he had ever had any knife in his possession.\n\nThe tale that Ross told was also different from the People's. Testifying on her own behalf and introducing other evidence, she did not deny defendant had robbed or murdered Birkman; rather, she denied she had possessed the requisite mental state--she said she did not even suspect what he had evidently intended, but had accompanied him out of fear.\n\nB. Penalty Phase\n\nFor the penalty of death, the People relied on the evidence introduced at the guilt phase relevant to the circumstances of the capital offense, which they understood to include the attempted robbery and murder of Birkman, the rape of Sandra S., and the robbery of Slatten. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nIn addition, the People presented evidence of three prior felony convictions. First, in 1982, in the Los Angeles Superior Court, defendant was convicted of voluntary manslaughter with personal use of a deadly weapon. Second, at the same time and in the same court, he was convicted of assault with a deadly weapon. Third, in 1983, in the San Luis Obispo Superior Court, he was convicted of escape from prison without force or violence.\n\nThe People also presented evidence of four instances of criminal activity, beyond the circumstances of the capital offense, that involved the use or attempted use of force or violence or the express or implied threat to use force or violence. The first and second instances comprised the circumstances surrounding the voluntary manslaughter and assault with a deadly weapon convictions. Late one night in 1981, a man ran into a small liquor store in Hollywood. In pursuit was defendant. The man was unarmed. Defendant was brandishing a long knife in his right hand. The man stopped, and put his hands up in front of him for protection. With his left hand, defendant pulled the man's hands down, said, \"Chinga su madre,\" stabbed him fatally through the throat, and then withdrew the blade. Knife in hand, he started to move on one of the store's clerks. He halted when another of the clerks pulled out a shotgun and told him to stop. He then fled. The third and fourth instances consisted of separate attacks on fellow jail inmates during the pendency of the present proceedings, one in 1987 and the other in 1988, in each of which he punched a victim who could not defend himself.\n\nFor life imprisonment without possibility of parole, defendant presented evidence relevant to his background and character. He was born in Cuba around 1960, and was raised there. As a young child, he suffered a significant injury to his head, which may have contributed to a condition that later showed itself as perhaps epilepsy, and also lost his mother to death. Thereafter, he lived an unstable life, and was subjected to abuse and neglect, especially at the hands of a woman with whom his father set up house. He began to exhibit problem behavior. He came to the United States in the so-called \"Mariel Boatlift\" of 1980. He was apparently detained at camps including Fort Chaffee in Arkansas. He went to Richmond, Virginia, in 1981, under the sponsorship of a married couple with small children. He lived with the family about six weeks. He displayed kindness and generosity, but also anger and immaturity. He made his way to California later that year. There ensued the crimes referred to above. For various reasons, social as well as personal, he did not successfully assimilate into American society. It was opined that he suffered from conditions including \"profound emotional immaturity\" and \"extreme culture shock.\" Nevertheless, he was capable of love and helpfulness. For example, he had shown, and continued to show, such qualities in his dealings with Neetelfer Hawkins and with her mother and her disabled son.\n\nDefendant also presented evidence responsive to that introduced by the People. Thus, he attempted to disprove one of his attacks on the two jail inmates. He went into the circumstances surrounding the prison escape conviction, showing, among other things, that, with two other Spanish-speaking prisoners, he had essentially walked away from what was little more than an \"honor camp\" (albeit after somewhat elaborate planning), offered no resistance to the correctional officers who effected the capture, and even helped them by serving as an interpreter for his two companions. He also went more deeply into the circumstances surrounding the voluntary manslaughter conviction, revealing in its course that he killed the victim apparently in revenge for the latter's burglary of the residence of a man who was his lover.\n\nIII. DISCUSSION\n\nDefendant challenges the judgment as to guilt, death eligibility, and penalty. We shall consider his attack point by point.\n\nA. Guilt\n\nDefendant makes several claims going to guilt. As will appear, none proves to be meritorious.\n\n1. Motion to Suppress\n\nPrior to trial, defendant moved the superior court to suppress certain evidence pursuant to Penal Code section 1538.5, including the second long knife and its sheath. At bottom, he claimed that the evidence in question was the fruit of a stop at a vehicle checkpoint in Mississippi, and that the stop at issue was violative of his right under the Fourth Amendment to the United States Constitution to be secure against unreasonable searches and seizures. After an evidentiary hearing, the superior court denied the motion.\n\nAt the guilt phase, the second knife and its sheath were introduced into evidence.\n\nDefendant contends that the superior court erred by denying his motion to suppress.\n\n\"An appellate court's review of a trial court's ruling on a motion to suppress is governed by well-settled principles. [Citations.] In ruling on such a motion, the trial court (1) finds the historical facts, (2) selects the applicable rule of law, and (3) applies the latter to the former to determine whether the rule of law as applied to the established facts is or is not violated. [Citations.] 'The [trial] court's resolution of each of these inquiries is, of course, subject to appellate review.' [Citations.] The court's resolution of the first inquiry, which involves questions of fact, is reviewed under the deferential substantial-evidence standard. [Citations.] Its decision on the second, which is a pure question of law, is scrutinized under the standard of independent review. [Citations.] Finally, its ruling on the third, which is a mixed fact-law question that is however predominantly one of law, . . . is also subject to independent review.\" ( People v. Williams (1988) 45 Cal. 3d 1268, 1301 [248 Cal. Rptr. 834, 756 P.2d 221].)\n\nAfter independent review, we discern no error in the legal principles that the superior court impliedly selected:\n\nThe Fourth Amendment, made applicable to the states through the Fourteenth Amendment's due process clause ( Mapp v. Ohio (1961) 367 U.S. 643, 643-660 [6 L. Ed. 2d 1081, 1081-1093, 81 S. Ct. 1684, 84 A.L.R.2d 933]; Wolf v. Colorado (1949) 338 U.S. 25, 27-28 [93 L. Ed. 1782, 1785-1786, 69 S. Ct. 1359], overruled on another point, Mapp v. Ohio, (supra) , 367 U.S. at pp. 654-655 [6 L. Ed. 2d at pp. 1089-1090]), guarantees \"the people\" \"[t]he right . . . to be secure . . . against unreasonable searches and seizures . . . .\" \" Fourth Amendment 'seizure' occurs when a vehicle is stopped at a checkpoint\" by a law enforcement officer. ( Michigan Dept. of State Police v. Sitz (1990) 496 U.S. 444, 450 [110 L. Ed. 2d 412, 420, 110 S. Ct. 2481].) \"The question thus becomes whether such [a] seizure[] [is] 'reasonable' under the Fourth Amendment.\" (Ibid.)\n\nNeither do we discern any error in the facts that the superior court impliedly found, being satisfied that they are supported by substantial evidence:\n\nAbout 8 p.m. on May 27, 1987, at the suggestion of the officer in charge, uniformed troopers of the Mississippi Highway and Safety Patrol (hereafter MHSP) established a checkpoint for routine inspection of drivers' licenses, vehicle registration, etc., alongside Highway 24, a two-lane east-west road, in Amite County, approximately one-half mile east of Liberty in the southwestern portion of the state; they parked a marked MHSP vehicle on the shoulder with its dome light and emergency lights flashing, and stationed themselves in the line of traffic with their flashlights on; the location was visible from a great distance to vehicles approaching from either direction, and at that time was lightly trafficked; apparently in accordance with MHSP policy or practice, they inspected all vehicles passing in either direction; they generally completed each inspection within 15 or 20 seconds and did not cause any vehicle to move out of its lane of traffic or any driver to exit therefrom. About 8:30 p.m., they stopped a number of vehicles. One was a Taurus--which belonged to Greta Slatten--traveling east; it bore a Colorado license plate, which had apparently been stolen. Defendant was at the wheel; Charles Robinson, who was hitchhiking, was a passenger. One of the troopers asked defendant for his license; defendant pretended to look; he then requested to pull off the road to continue to do so; the trooper gave permission; defendant eventually acknowledged that he did not have one in his possession. By this time, the trooper had formed an opinion that defendant might be under the influence of alcohol or drugs, having noticed, among other things, that his eyes were red, his speech was slurred, and his reactions were slow. The trooper asked him to exit the automobile for a field sobriety test; defendant did not comply, but took off in the car; Robinson told him to stop, defendant braked, Robinson jumped out and called on the troopers to pursue, and defendant sped away. The troopers gave chase. About 10 minutes later, they apprehended defendant sitting outside the automobile and placed him under arrest for driving without a license, speeding, etc. They soon learned that the car had been stolen. Noticing the smell of marijuana, they conducted a search therein: they found a number of items, including the second knife and its sheath, which were under a seat in the passenger compartment, and a sawed-off shotgun, which was in a suitcase in the trunk. The next day, they placed Robinson under arrest for possession of an illegal weapon after he admitted the shotgun was his.\n\nFinally, after independent review, we do not discern any error in the determination that the superior court impliedly made, as it applied the legal principles to the facts, to the effect that defendant's rights under the Fourth Amendment were not violated:\n\nIn People v. Washburn (1968) 265 Cal. App. 2d 665, 668, 670 [71 Cal. Rptr. 577] (hereafter Washburn)--on which the superior court expressly relied--the court held in substance that a stop of a vehicle by a law enforcement officer is generally a reasonable seizure for Fourth Amendment purposes, if it is made at a checkpoint for routine license and registration inspection of all passing vehicles. In Delaware v. Prouse (1979) 440 U.S. 648, 663 [59 L. Ed. 2d 660, 673-674, 99 S. Ct. 1391], the United States Supreme Court suggested as much. Indeed, on Professor LaFave's reading, the court \"manifest[ed] approval of the '[q]uestioning of all oncoming traffic at roadblock-type stops.' \" (4 LaFave, Search and Seizure (3d ed. 1996) § 10.8(a), p. 679, quoting Delaware v. Prouse, (supra) , 440 U.S. at p. 663 [59 L. Ed. 2d at p. 674].) The stop of Slatten's Taurus by the MHSP troopers was a reasonable seizure inasmuch as it was made at the Highway 24 checkpoint for routine license and registration inspection of all passing vehicles. It was not rendered otherwise by any of the circumstances peculiar to the incident, including the fact that it was established on the initiative of an officer in the field. Tried by the Fourth Amendment's \"touchstone\" of \"reasonableness\" ( Florida v. Jimeno (1991) 500 U.S. 248, 250 [114 L. Ed. 2d 297, 302, 111 S. Ct. 1801]), it is not found wanting. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nIn arguing against the denial of his motion to suppress, defendant attacks the vitality of Washburn. He is unsuccessful. In Ingersoll v. Palmer (1987) 43 Cal. 3d 1321 [241 Cal. Rptr. 42, 743 P.2d 1299], a so-called \"sobriety checkpoint\" decision on which he relies perhaps most heavily, we indicated our approval of Washburn. ( Ingersoll v. Palmer, (supra) , 43 Cal. 3d at p. 1333 [citing Washburn for the proposition that \"[r]egulatory inspections and stops have . . . been permitted under decisions of . . . the California courts . . . in . . . license and registration inspection checkpoints\"].) We did not withdraw our approval in any of the cases that followed, including People v. Banks (1993) 6 Cal. 4th 926 [25 Cal. Rptr. 2d 524, 863 P.2d 769], another \"sobriety checkpoint\" case. We will not do so here. Contrary to defendant's implication, the fact that Washburn does not anticipate the kind of analysis set out in Ingersoll and followed in Banks is not fatal. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\n2. In Limine Motion to Bar Evidence of Statements by Allen Birkman\n\nPrior to trial, defendant moved the superior court, in limine, to preclude the People from introducing certain evidence on the ground that it was inadmissible hearsay. Ross joined therein. The evidence in question comprised statements by Allen Birkman.\n\nHearsay, of course, is evidence of an out-of-court statement offered by its proponent to prove what it states. (Evid. Code, § 1200, subd. (a).) Unless it comes within an exception, it is inadmissible. (Id., § 1200, subd. (b).) One such exception is for spontaneous declarations, which: (1) \"[p]urport[] to narrate, describe, or explain an act, condition, or event perceived by the declarant\" (id., § 1240, subd. (a)); and (2) were \"made spontaneously\" (id., § 1240, subd. (b)), even if in response to questioning ( People v. Poggi (1988) 45 Cal. 3d 306, 319 [246 Cal. Rptr. 886, 753 P.2d 1082]), \"while the declarant was under the stress of excitement caused by such perception\" (Evid. Code, § 1240, subd. (b)).\n\nAt an evidentiary hearing, Charles Kosobud testified, in pertinent part, to the following effect: On May 17, 1987, late in the morning, he was near the Golden 1 Credit Union; a man later identified as Birkman called for help; within seconds, Kosobud went to his aid; Birkman--who was stipulated to have suffered a stab wound to the heart--was holding his right hand to his chest, and had blood flowing through his fingers; he had a wallet in his left hand; he was swaying; steadying him, Kosobud asked if they had robbed him; Birkman responded, \"No, but they tried\"; Kosobud asked who; Birkman responded, \"Two blacks\"; he soon collapsed onto the ground. Officer Calvin Lim of the Sacramento Police Department testified, in pertinent part, to the following effect: When he arrived at the Golden 1 Credit Union, Birkman was already receiving emergency medical aid; within several minutes, he was placed in an ambulance for transport to a hospital; Lim rode along; Birkman was semiconscious, had difficulty breathing, was very tense, and appeared to be in extreme pain; he said he felt numbness or tingling all over his body; Lim asked if he knew who had attacked him; he responded, \"a male black, approximately six foot tall,\" who \"had gotten into a Camaro\"; within several more minutes, they arrived at the hospital--where it was stipulated he died the next day.\n\nThe superior court denied the motion. It impliedly determined that evidence of Birkman's statements was indeed hearsay. But it expressly determined that it came within, among other exceptions, that for spontaneous declarations. In this connection, it stated that it \"recognized\" that Kosobud and Officer Lim \"asked questions of\" Birkman, and \"it wasn't something that [he] just blurted out. However, the law is very clear that that doesn't negate the spontaneity required for spontaneous declarations.\"\n\nAt the guilt phase, Kosobud and Officer Lim testified as to Birkman's statements in substantially the same terms as they had testified at the evidentiary hearing.\n\nDefendant contends that the superior court erred by denying his motion to preclude evidence of Birkman's statements.\n\nUnlike below, here defendant does not argue that the evidence in question was inadmissible hearsay. Indeed, he all but concedes that it came within the exception for spontaneous declarations. Unsurprisingly so.\n\nInstead, defendant argues that the evidence in question was barred by the confrontation clause of the Sixth Amendment to the United States Constitution.\n\nDefendant has not preserved his claim for review. \"It is, of course, 'the general rule' \"--to which we find no exception here--\" 'that questions relating to the admissibility of evidence will not be reviewed on appeal in the absence of a specific and timely objection in the trial court on the ground sought to be urged on appeal.' \" ( People v. Benson (1990) 52 Cal. 3d 754, 786, fn. 7 [276 Cal. Rptr. 827, 802 P.2d 330], quoting People v. Rogers (1978) 21 Cal. 3d 542, 548 [146 Cal. Rptr. 732, 579 P.2d 1048].) There was neither a \"specific\" nor \"timely\" objection below predicated on the Sixth Amendment's confrontation clause. True, there was a bare reference to the \"confrontation rule\" (capitalization deleted) in moving papers submitted by defendant. But that was all. And that was not enough.\n\nIn any event, defendant's claim is lacking in support in the law. His argument is, in substance, that, even if evidence of Birkman's statements came within the exception for spontaneous declarations, it still violated the Sixth Amendment's confrontation clause. \"But where . . . hearsay . . . come[s] within a firmly rooted exception . . ., the Confrontation Clause is satisfied.\" ( White v. Illinois (1992) 502 U.S. 346, 356 [116 L. Ed. 2d 848, 859, 112 S. Ct. 736].) Among such \"firmly rooted\" exceptions is that for spontaneous declarations. ( Id. at p. 355, fn. 8 [116 L. Ed. 2d at p. 859].) \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\n3. Motion to Sever Counts\n\nPrior to trial, defendant moved the superior court to sever trial on the counts charging the robbery and murder of Allen Birkman from trial on the counts charging the theft of Edwin Glidewell's Camaro, the rape of Sandra S., and the robbery of Greta Slatten. Relying, in part, on the evidence introduced at a preliminary examination, he claimed that the two groups of offenses were not properly joined under Penal Code section 954, and that, even if they were, they should be separated in the interests of Justice under the same provision in order to forestall potential prejudice. The superior court denied the motion. It concluded that the two groups of offenses were indeed \"properly joined\": \"each of the alleged crimes is, either, of the same class as each of the other crimes or connected in its commission . . . .\" It also determined that the offenses did not require separation in the interests of Justice: apparently in spite of the fact that he might face the death penalty, defendant had shown \"no sufficient [potential] prejudice\"--\"[w]ith respect to most of the crimes there is cross-admissibility\" of evidence; \"even if there is no cross-admissibility,\" \"none of these crimes is a high impact kind of crime in terms of likely emotional impact\" and none is substantially \"strong[er]\" or \"weak[er]\" than another.\n\nAt the guilt phase, all the counts were tried together.\n\nDefendant contends that the superior court erred by denying his motion to sever--specifically, insofar as it refused to sever trial of the Sandra S. rape from trial of the Birkman robbery and murder, the Glidewell vehicle theft, and the Slatten robbery.\n\nAn appellate court reviews a trial court's ruling on a motion to sever for abuse of discretion. (E.g., People v. Memro (1995) 11 Cal. 4th 786, 850 [47 Cal. Rptr. 2d 219, 905 P.2d 1305].) Of course, it scrutinizes underlying determinations pursuant to the test appropriate thereto. (See generally People v. Louis (1986) 42 Cal. 3d 969, 985-987 [232 Cal. Rptr. 110, 728 P.2d 180]; Crocker National Bank v. City and County of San Francisco (1989) 49 Cal. 3d 881, 888 [264 Cal. Rptr. 139, 782 P.2d 278] [following Louis ].) Thus, a Conclusion as to whether two or more offenses are properly joined under Penal Code section 954 is examined independently as the resolution of a pure question of law--whether the offenses are \"different statements of the same offense\" or are \"of the same class of . . . offenses\" (Pen. Code, § 954)--or the resolution of a predominantly legal mixed fact-law question --whether the offenses were \"connected . . . in their commission\" (ibid.). By contrast, a determination as to whether separation is required in the interests of Justice is assessed for abuse of discretion. (See ibid.; see also People v. Balderas (1985) 41 Cal. 3d 144, 170-171 [222 Cal. Rptr. 184, 711 P.2d 480].)\n\nAfter review, we believe that the superior court did not abuse its discretion by denying defendant's motion to sever and thereby refusing to sever trial of the Sandra S. rape from trial of the Birkman robbery and murder, the Glidewell vehicle theft, and the Slatten robbery.\n\nAt the outset, the superior court's implicit Conclusion that the Sandra S. rape was properly joined under Penal Code section 954 with the Birkman robbery and murder, the Glidewell vehicle theft, and the Slatten robbery survives de novo scrutiny.\n\nThe Sandra S. rape is \"of the same class of . . . offenses\" as the Birkman robbery and murder and the Slatten robbery. Rape is an assaultive crime against the person, as are robbery and murder. ( People v. Poggi, (supra) , 45 Cal. 3d at pp. 314, 320.) Defendant states that this analysis \"does not apply where, as here, multiple defendants are charged in the same information.\" His assertion, however, is without basis and must therefore be rejected.\n\nAlso, the Sandra S. rape was \"connected in [its] commission\" with the Glidewell vehicle theft. As shown by the evidence introduced at the preliminary examination--which was similar to that later introduced at trial--the rape occurred very close in time and place to the theft of the vehicle, and the theft of the vehicle may have been motivated by a desire to avoid apprehension for the rape. Defendant admits the close temporal and spatial relationship. He could not do otherwise. But he denies the possible linkage by motive as speculative. True, there was no direct evidence on this matter. There was, however, sufficient circumstantial evidence to support what the superior court rightly considered a \"fair inference.\"\n\nFurther, the superior court's implicit determination that the Sandra S. rape did not require separation from the Birkman robbery and murder, the Glidewell vehicle theft, and the Slatten robbery in the interests of Justice was not an abuse of discretion. Its reason, which is set out above, is indeed reasonable. Defendant simply failed to show \"sufficient [potential] prejudice.\" He argues now, as he argued then, that the relatively \"weak\" evidence of the Sandra S. rape might improperly be amplified by the relatively \"strong\" evidence of the Birkman robbery and murder, and that the rape might inflame the jury against him with regard to the robbery and murder. He does not persuade us, as he did not persuade the superior court. His premise is unsupported by the record on appeal: the evidence was not relatively \"weak\" as to the Sandra S. rape and relatively \"strong\" as to the Birkman robbery and murder; and the rape was not potentially inflammatory as to the robbery and murder. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\n4. Motion to Sever Trials\n\nPrior to trial, Ross moved the superior court to sever her trial from defendant's. In like manner, defendant then moved the superior court to sever his trial from hers. Relying, in part, on the evidence introduced at the preliminary examination, each claimed, inter alia, that the superior court should separate the trials because his or her defense would conflict with the other's--defendant's would be alibi and misidentification, Ross's would be lack of the requisite mental state. Penal Code section 1098 provided then, as it provides now, that \"When two or more defendants are jointly charged with any public offense, whether felony or misdemeanor, they must be tried jointly, unless the court order separate trials.\" The superior court denied the motions, concluding, as pertinent here, that there was an insufficient showing that defendant and Ross would present conflicting defenses and that, even if there had been such a showing, it would not require separate trials: \"the mere fact that [they] may well be pointing fingers at each other doesn't justify necessarily severance.\"\n\nAt the guilt phase, defendant and Ross were jointly tried.\n\nDefendant contends that the superior court erred by denying his motion for separate trials.\n\nAn appellate court reviews a trial court's ruling on a motion for separate trials for abuse of discretion. (See Pen. Code, § 1098; see also, e.g., People v. Hardy (1992) 2 Cal. 4th 86, 167 [5 Cal. Rptr. 2d 796, 825 P.2d 781].)\n\nWe find no such abuse here. Under Penal Code section 1098, a trial court must order a joint trial as the \"rule\" and may order separate trials only as an \"exception.\" (5 Witkin \u0026 Epstein, Cal. Criminal Law (2d ed. 1989) Trial, § 2518, p. 3021.) The superior court not unreasonably conformed to the rule and avoided the exception. Its Conclusion--that separation was not required even if there had been a sufficient showing that defendant and Ross would present conflicting defenses and might each attempt to shift responsibility to the other--anticipated People v. Cummings (1993) 4 Cal. 4th 1233, 1287 [18 Cal. Rptr. 2d 796, 850 P.2d 1], in which we held to that very effect. (Cf. Zafiro v. United States (1993) 506 U.S. 534, 538 [122 L. Ed. 2d 317, 325, 113 S. Ct. 933] [decided under Fed. Rules Crim.Proc., rules 8(b) and 14, 18 U.S.C., which are similar to Pen. Code, § 1098: declining \"to adopt a bright-line rule, mandating severance whenever codefendants have conflicting defenses\"].) \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\n5. Motion to Limit Physical Restraints\n\nPrior to trial, defendant moved the superior court to limit, inter alia, the physical restraints to which it would subject him in the presence of the jury. After a hearing on the motion, it granted his request not to be placed in fetters. It also stated its intention to cause him to sit in a \"security chair\" both at counsel table and on the witness stand, and to cause him to be put into, and removed from, such chair outside the jury's presence. The chair in question was generally similar to others in the courtroom; it was different only in that it allowed a chain encircling his waist to be attached at its back and prevented the chain from being seen so long as he placed his clothing properly. The superior court asked, \"Is there any objection to that procedure?\" Defense counsel responded, \"No.\" It commented that, in the absence of an objection, \"it is not necessary . . . to specifically state good cause . . . .\" Nevertheless, it \"stat[ed] . . . for the record\" that it had obtained information to the effect that, not two months earlier, defendant had been found in possession of an \"explosive device\" in jail, \"apparently consistent with what's commonly called a match bomb,\" which was, specifically, a \"device approximately four inches long wrapped tightly in plastic,\" containing \"match heads\" and \"several nitroglycerine pills,\" with a \"paper-wrapped fuse protruding from one end of it.\" Defendant did not dispute the information.\n\nSubsequently, in the course of jury selection, the superior court ordered defendant placed in manacles that could be concealed in his lap. It did so because it impliedly determined that he might attempt to escape or at least might injure someone if he became displeased with events as they transpired. It based its determination on information such as the following: Defendant had attempted to saw through his waist chain; he had tried to take contraband into jail; he had drawings in his cell for the fashioning of a realistic \"gun\" out of soap; he had engaged in misconduct in jail on several occasions, including \"threatening officers, fighting with other inmates, starting fires, [and] possessing weapons of various sorts\"; he had exhibited \"little if any control over his emotions and little, if any, respect for authority or anyone's rules\"; and he had previously been convicted of an escape from prison, which, although executed without force or violence, had been somewhat elaborately planned. The superior court stated for the record that he had exposed his manacles to prospective jurors. It told him: \"hat's your choice. If you don't care that they see that, that's fine.\" IT REITERATED: \"Again, it's your choice. If it doesn't bother you that they see that, then that's fine with the Court.\" Before long, it modified its order to allow his right hand to be free.\n\nLater, at the guilt phase, the superior court noted outside the presence of the jury that defendant, who was then on the witness stand, had made no attempt to conceal his waist chain at any point during the proceedings. It offered to give a curative admonition--such as a statement, which it acknowledged was not \"entirely true,\" that it was \"simply flat Court policy\" to so restrain a defendant at a death penalty trial. Defendant declined. On reconsideration, it determined that, because the waist chain had been visible, it was required to give an admonition under People v. Duran (1976) 16 Cal. 3d 282, 292 [127 Cal. Rptr. 618, 545 P.2d 1322, 90 A.L.R.3d 1], to the effect that \"such restraints should have no bearing on the determination of the defendant's guilt.\" It stated that it would in fact give an admonition of this sort unless defendant should object. It further stated that, in giving such an admonition, it would say \"something that is not the truth,\" such as, \"this is standard procedure in all homicide cases or in all death penalty cases, to so restrain the defendant.\" Defendant objected. Defense counsel expressed a view that an admonition that restraints should have no bearing on guilt draws \"undue attention\" to the restraints themselves. He stated that defendant would probably request an instruction on the matter. The superior court proceeded not to give an admonition.\n\nFinally, after defendant did in fact make a request, the superior court instructed the jury as follows: \"In your deliberations, the fact that a defendant has been subjected to physical restraints during the trial is not to be discussed or considered by you. There is no connotation of guilt of any kind because a defendant was restrained. Such restraints are a part of the normal procedures in a case of this nature and should have no bearing on your determination of a defendant's guilt or innocence.\"\n\nDefendant now contends that the superior court erred by denying his motion to limit physical restraints.\n\nWe reject the claim at the threshold. The superior court did not in fact deny defendant's motion. Rather, it granted what he sought. He asked it to limit physical restraints. It indeed limited such restraints. It ordered no fetters. It ordered only confinement to a security chair. It questioned whether he objected. Through defense counsel, he answered no.\n\nWe would also reject the claim on the merits. An appellate court reviews a trial court's ruling on a motion to limit physical restraints for abuse of discretion. (See, e.g., People v. Duran, (supra) , 16 Cal. 3d at p. 293.) Even if we were to deem that the superior court denied defendant's motion--which we do not--we could not conclude that it erred thereby. In view of the undisputed information it had obtained about such matters as his possession of a \"match bomb\" in jail, it could have determined, not at all unreasonably, that confinement to a security chair was appropriate. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\n6. Wheeler/Batson Motion\n\nIn People v. Wheeler (1978) 22 Cal. 3d 258, 276-277 [148 Cal. Rptr. 890, 583 P.2d 748] (hereafter sometimes Wheeler), we held that the use of peremptory challenges by a prosecutor to strike prospective jurors on the basis of group membership violates the right of a criminal defendant to trial by a jury drawn from a representative cross-section of the community under article I, section 16 of the California Constitution. Subsequently, in Batson v. Kentucky (1986) 476 U.S. 79, 84-89 [90 L. Ed. 2d 69, 79-83, 106 S. Ct. 1712] (hereafter sometimes Batson), and its progeny, the United States Supreme Court held that such a practice violates, inter alia, the defendant's right to equal protection of the laws under the Fourteenth Amendment to the United States Constitution. African-Americans are a cognizable group for purposes of both Wheeler ( People v. Wheeler, (supra) , 22 Cal. 3d at p. 280, fn. 26) and Batson ( Batson v. Kentucky, (supra) , 476 U.S. at pp. 84-89 [90 L. Ed. 2d at pp. 79-83]). Latinos are also such a group under both Wheeler ( People v. Trevino (1985) 39 Cal. 3d 667, 686 [217 Cal. Rptr. 652, 704 P.2d 719], disapproved on another point, People v. Johnson (1989) 47 Cal. 3d 1194, 1221 [255 Cal. Rptr. 569, 767 P.2d 1047]) and Batson (e.g., U.S. v. Chinchilla (9th Cir. 1989) 874 F.2d 695, 698; see, e.g., Hernandez v. New York (1991) 500 U.S. 352, 355 [114 L. Ed. 2d 395, 403, 111 S. Ct. 1859] (plur. opn. by Kennedy, J.)).\n\nUnder Wheeler, there is a presumption that a prosecutor uses his peremptory challenges in a constitutional manner. ( People v. Wheeler, (supra) , 22 Cal. 3d at p. 278.) The defendant bears the burden to show, prima facie, the presence of purposeful discrimination. ( Id. at p. 280.) If he succeeds, the burden shifts to the prosecutor to show its absence. ( Id. at p. 281.) If he fails, the defendant's prima facie showing becomes conclusive. (See id. at p. 282.) In such a situation, the presumption of constitutionality is rebutted. (Ibid.) Substantially the same principles apply under Batson. (See Batson v. Kentucky, (supra) , 476 U.S. at pp. 89-98 [90 L. Ed. 2d at pp. 82-89].) Under both Wheeler ( People v. Wheeler, (supra) , 22 Cal. 3d at p. 281) and Batson ( Powers v. Ohio (1991) 499 U.S. 400, 404-416 [113 L. Ed. 2d 411, 429, 111 S. Ct. 1364]), the defendant need not be a member of the group in question in order to complain.\n\nIn this cause, the superior court selected the jury substantially as follows. With the parties' stipulation, it determined to swear 15 jurors to try the case and, after instructions at the guilt phase, to have whatever number that then remained over 12 selected out at random to serve as alternates. It caused a panel of prospective jurors to be called. It conducted voir dire as to hardship and other matters, including individual, sequestered examination bearing on the death penalty; in the course of such voir dire, it excused several prospective jurors; it had the names of those who remained sorted at random and placed on a list; it then had those panelists drawn into the jury box in accordance with the order on the list; the parties alternately made a peremptory challenge against one of the prospective jurors in the jury box or passed the opportunity and thereby accepted those then sitting (the People had 30 strikes and defendant and Ross had 20 jointly and 5 each individually); in the case of a peremptory challenge, the superior court had the prospective juror subject to the strike replaced with the next one on the list. It caused a second and then a third panel of prospective jurors to be called, and proceeded in similar fashion.\n\nIn the midst of voir dire for the first panel of prospective jurors, defendant made a motion, under Wheeler and Batson, for the superior court to commence the process anew, claiming that the prosecutor had used peremptory challenges to strike African-American and Latino prospective jurors on the basis of group membership. Defense counsel asserted that defendant was \"of mixed ancestry, black and Spanish . . . .\" Defendant himself declared that he was \"Spanish and Islander,\" meaning \"[a] native [Cuban].\" The superior court stated that, \"by looking at [defendant], he doesn't appear to be--[t]o be a mixture of black and Cuban. His appearance, which at least in my opinion, is Cuban or somewhat of that general extraction of Hispanic type.\" Ross joined in defendant's motion. She identified herself as African-American. The prospective jurors in question were seven in number: Maximina Troyer, identified as Latina (in part); James Del Rosario, identified as Filipino; Charso Elliott, identified as African-American; Sylvia Gonzalez, identified as Latina; Thomas Harris, identified as African-American; Rachel Klose, identified as Latina (in part); and Leon Soto, identified as Puerto Rican.\n\nThe superior court determined that defendant made a prima facie showing of the presence of purposeful discrimination. It did so in view of the pattern that had by then emerged: up to that point in time, the prosecutor had peremptorily challenged twelve prospective jurors, comprising the seven identified above and five others, who were apparently European-American; and that, out of the first panel, there remained only one Latino (one had been struck by defendant and Ross jointly) and no African-American (one who was African-American in part had been struck by defendant and Ross jointly).\n\nIn response, the prosecutor undertook to state his reasons for each of the seven peremptory challenges in question. Generally, he ranked prospective jurors on a scale of one to five, ranging from the most favorable to the least. He apparently rated Troyer a \"five,\" citing, among other things, strong personal feelings she expressed on voir dire against the death penalty in general and an acknowledgment she made in the course of examination that her son had been tried for murder and acquitted of that offense. He apparently rated Del Rosario a \"five\" as well, on grounds including comments he made on voir dire suggesting an inclination away from the death penalty on facts similar to those the evidence at trial was expected to show. He did not state or imply a precise rating for Elliott, but referred to factors such as certain confusion she displayed on voir dire and what he said was a preference she expressed in the course of examination for life imprisonment without possibility of parole, and also his own belief, at the time of the strike, that there were more favorable prospective jurors about to be called into the jury box. He rated Gonzalez a \"three,\" citing, among other things, comments she made on voir dire suggesting an inclination away from the death penalty on facts similar to those the evidence at trial was expected to show and also his own belief, at the time of the strike, that there were more favorable prospective jurors about to be called into the jury box. He apparently rated Harris a \"five,\" because, inter alia, some of his remarks on voir dire supported an inference that he was generally disposed against the death penalty. He rated Klose a \"three,\" on grounds including substantial upset she exhibited on voir dire resulting from a recent death in her family and also his own belief, at the time of the strike, that there were more favorable prospective jurors about to be called into the jury box. He did not state or imply a precise rating for Soto, but referred to factors such as certain comments he made on voir dire suggesting he accepted the death penalty formally but not personally and also his own belief, at the time of the strike, that there might be more favorable prospective jurors called into the jury box.\n\nAfter reviewing the record, as it pertained to the seven prospective jurors identified above and also to others, the superior court determined that the prosecutor made a showing of the absence of purposeful discrimination. Considering the peremptory challenges in question within the process of jury selection as a whole, it stated that he \"was able to put forth neutral explanations related to each individual and related directly to this case, and . . . I'm satisfied that these were neutral explanations and they're not just sham excuses that were contrived to avoid admitting acts of group discrimination . . . .\"\n\nOn this basis, the superior court denied defendant's Wheeler / Batson motion. Because it found no prohibited intent on the prosecutor's part, it deemed it unnecessary to reach the question whether Puerto Ricans and/or Filipinos, as defendant suggested, came within the cognizable group of Latinos, or whether each or either of them constituted such a group in their own right.\n\nSubsequently, in the midst of voir dire for the second panel of prospective jurors, after the prosecutor peremptorily challenged prospective juror Katrina George, identified as African-American, defendant made another motion, expressly under Wheeler and impliedly under Batson. Ross joined therein. Determining that defendant had not made a prima facie showing of the presence of purposeful discrimination, the superior court denied the motion. Acknowledging that he may have acted \"somewhat premature[ly],\" defense counsel sought a denial of the motion without prejudice to renewal. The superior court impliedly granted the request. Defendant did not renew the motion.\n\nIn due course, the superior court had 15 jurors, 1 of whom was African-American, sworn to try the case. After instructions at the guilt phase, it had two of the then remaining fourteen jurors selected out of the panel at random to serve as alternates. The African-American juror remained on the panel.\n\nDefendant now contends that the superior court erred by denying his motions under Wheeler and Batson. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nAn appellate court reviews a trial court's ruling on a motion under Wheeler and/or Batson for substantial evidence. ( People v. Jackson (1992) 10 Cal. App. 4th 13, 18-23 [12 Cal. Rptr. 2d 541] [so holding as to a Wheeler motion]; People v. Tapia (1994) 25 Cal. App. 4th 984, 1014 [30 Cal. Rptr. 2d 851] [following Jackson ]; cf. Hernandez v. New York, (supra) , 500 U.S. at pp. 364-369 [114 L. Ed. 2d at pp. 408-412] (plur. opn. by Kennedy, J.) [concluding that the federal \"clearly erroneous\" standard--which is practically the same as the California substantial evidence test--is applicable on direct review of a state court decision involving a Batson motion]; id. at p. 372 [114 L. Ed. 2d at p. 414] (conc. opn. of O'Connor, J.) [same]; but see People v. Turner (1994) 8 Cal. 4th 137, 164-172 [32 Cal. Rptr. 2d 762, 878 P.2d 521] [seeming to assume that the standard for a ruling on a motion under Wheeler and/or Batson is abuse of discretion].) Although such a ruling broadly resolves a predominantly factual mixed law-fact question, as a general matter, at least, it narrowly depends on the answer to a purely factual question, viz., whether the prosecutor acted with the prohibited intent--which in turn typically depends on the answer to another purely factual question, viz., whether the prosecutor's customary denial of such intent is true (see People v. Jackson, (supra) , 10 Cal. App. 4th at p. 20 [speaking of a Wheeler motion]; Hernandez v. New York, (supra) , 500 U.S. at p. 365 [114 L. Ed. 2d at pp. 409-410] (plur. opn. by Kennedy, J.); id. at p. 372 [114 L. Ed. 2d at p. 414] [speaking of a Batson motion] (conc. opn. of O'Connor, J.) [same]). It follows that the determinations underlying a ruling of this sort, that is, whether the defendant bore his burden of a prima facie showing of the presence of purposeful discrimination and, if he succeeded, whether the prosecutor bore his consequent burden of a showing of its absence, are themselves examined for substantial evidence: they are each reducible to an answer to a purely factual question, as identified above.\n\nAs to the superior court's denial of defendant's first motion under Wheeler and Batson, we find no error.\n\nWe shall assume that substantial evidence supports the superior court's determination that defendant made a prima facie showing of the presence of purposeful discrimination in the prosecutor's exercise of peremptory challenges against the seven prospective jurors in question.\n\nBut we believe that substantial evidence also supports the superior court's subsequent determination that the prosecutor made a showing of the absence of purposeful discrimination in this regard. Looking to the prospective jurors themselves, including the seven identified above, and also to the timing of the prosecutor's peremptory challenges, including the seven strikes at issue here, we cannot set aside the superior court's finding. Our review of the record on appeal allows the following Conclusion: The appearance of prohibited intent in this cause arose solely from the bare pattern of the strikes. It was dissipated by the reality of permissible intent. In making the seven strikes, the prosecutor simply sought to obtain a jury that was as favorable to his position as possible, especially as to the death penalty, regardless of the group membership of individual jurors. We do not mean to assert that prohibited intent may not coexist with permissible intent. But, unless we indulge in speculation, we cannot say that it did so here.\n\nDefendant argues that the superior court's determination of the absence of purposeful discrimination by the prosecutor fails at the threshold. A trial court is required to assess whether the prosecutor stated adequate neutral reasons for the peremptory challenges in question--in other words, whether the reasons for the strikes were \"explanation[s]\" \"connecting . . . specific [prospective] juror[s] to the facts of the case,\" and were not mere \"surrogate[s]\" or \"prox[ies]\" for group membership. ( U.S. v. Bishop (9th Cir. 1992) 959 F.2d 820, 826; see People v. Hall (1983) 35 Cal. 3d 161, 167 [197 Cal. Rptr. 71, 672 P.2d 854].) It is also required to assess whether he actually made those strikes for those reasons--in other words, whether the reasons for the strikes were \"genuine.\" ( People v. Hall, (supra) , 35 Cal. 3d at p. 167.) Defendant asserts that, although the superior court did indeed make an affirmative Conclusion as to the former issue, \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e it made no finding at all as to the latter. Not so. By finding that the prosecutor's \"neutral explanations\"--which \"related to each individual and related directly to this case\"--were \"not just sham excuses that were contrived to avoid admitting acts of group discrimination,\" the superior court necessarily found that they were in fact \"genuine.\" We review such a finding for substantial evidence: It is plainly the resolution of a pure question of fact. Because the prosecutor's \"neutral explanations\" indeed \"related to each individual and related directly to this case,\" the superior court's finding of genuineness was supported by substantial evidence. To be sure, at least one of these \"neutral explanations\" may be without basis in the record on appeal--viz., that, on voir dire, Elliott expressed a preference for life imprisonment without possibility of parole. But this fact, if fact it be, does not undermine the \"genuineness\"--or the sufficiency--of the other \"neutral explanations.\"\n\nDefendant then argues that the superior court's determination of the absence of purposeful discrimination by the prosecutor fails in its substance. He asserts, in effect, that its underlying analysis was not sufficiently \"comparative.\" That is not the case. As noted, the superior court considered the seven peremptory challenges in question within the process of jury selection as a whole: it looked to the prospective jurors themselves and also to the timing of the prosecutor's strikes. That is more than defendant does. He focuses on the former but ignores the latter.\n\nNeither do we find any error as to the superior court's denial of defendant's second motion under Wheeler and Batson. We believe that substantial evidence supports the superior court's determination that defendant did not make a prima facie showing of the presence of purposeful discrimination in the prosecutor's exercise of a peremptory challenge against prospective juror George. All that he showed was that George was African-American. That, of course, is not enough. Below, defendant practically conceded as much: defense counsel acknowledged that he may have acted \"somewhat premature[ly].\" Here, however, he argues to the contrary. He asserts that the superior court's determination that he had made a prima facie showing of the presence of purposeful discrimination by the prosecutor as to his first motion perdured. It did not. As stated, there is a presumption that a prosecutor uses his peremptory challenges in a constitutional manner. That presumption is suspended when the defendant makes a prima facie showing of the presence of purposeful discrimination. It is reinstated, however, when the prosecutor makes a showing of its absence. So was it here. Defendant was free to attempt to make another prima facie showing. But he had to make it, and make it in fact. This he did not do. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\n7. In Limine Motion to Bar Evidence About Sandra S.\n\nImmediately prior to trial, the People moved the superior court, in limine, to preclude defendant and Ross from inquiring into certain areas in their questioning of Sandra S. in the presence of the jury, on grounds including that any testimony in response would not be relevant, i.e., would not have any tendency in reason to prove or disprove a disputed fact bearing on a material issue (Evid. Code, § 210). The areas were these: (1) her general \"sexual habits,\" including prior misdemeanor convictions she had suffered for prostitution; (2) her general \"drug use,\" other than on the date of the charged rape and the date of her testimony; and (3) a rape complaint she had made against an unidentified man only after she had been approached by the police about an unrelated matter--she subsequently made a rape complaint against defendant only after she had been approached by the police about the theft of Glidewell's Camaro. The prosecutor represented that, on direct examination, he would have her admit that, as of the date of the charged rape, she was working as a prostitute.\n\nDefendant opposed the motion insofar as it sought to bar, as irrelevant, evidence of Sandra S.'s general \"drug use.\" He argued that such evidence might be relevant for impeachment if she should deny such use. He also opposed the motion insofar as it sought to bar, as irrelevant, evidence of her prior belated rape complaint. He argued that such evidence would be relevant for impeachment because it assertedly revealed a \"propensity to fabricate.\" But on the prosecutor's representation that she would admit working as a prostitute, he did not oppose the motion insofar as it sought to bar, as irrelevant, evidence of her general \"sexual habits.\" Indeed, when the superior court observed, \"I don't see any reason why\" evidence of her prior misdemeanor prostitution convictions \"would be admissible,\" defense counsel agreed, \"I'm not even going to argue that.\" The statement and response were both apparently predicated on Evidence Code section 787, which expressly renders evidence of misconduct generally inadmissible for impeachment, and impliedly does the same for evidence of prior misdemeanor convictions, or more precisely, evidence of the misconduct underlying such convictions.\n\nRoss did not oppose the motion in any respect, since she was not charged with the rape of Sandra S.\n\nThe superior court proceeded to grant the motion. It found unpersuasive defendant's argument that evidence of Sandra S.'s general \"drug use\" might be relevant for impeachment: It was speculative. It also found unpersuasive his argument that evidence of her prior belated rape complaint would be relevant for impeachment: its premise was that the prior complaint was false; the support proffered therefor--viz., defense counsel's speculation that the police might not have \"really fe[lt] it was a crime\" because they apparently \"did not even write a formal report of the incident,\" but \"told her if she ever sees the guy again to let them know\"--was insufficient.\n\nAt the guilt phase, Sandra S. testified on the People's behalf. On direct examination, she admitted that, as of the date of the charged rape, she was working as a prostitute. On cross-examination, defendant inquired into her work as a prostitute, and did so openly and repeatedly. But he did not inquire into her general \"sexual habits,\" including her prior misdemeanor prostitution convictions; her general \"drug use,\" other than on the date of the charged rape and the date of her testimony; or her prior belated rape complaint. Forgoing any cross-examination at all, Ross made no inquiry whatsoever.\n\nDefendant now contends that the superior court erred by granting the People's motion to bar, as irrelevant, the introduction of evidence of Sandra S.'s prior misdemeanor prostitution convictions and her prior belated rape complaint. He argues that evidence on each of these matters would have been relevant for impeachment.\n\nIn its first part, as to evidence of Sandra S.'s prior misdemeanor prostitution convictions, we reject the claim at the threshold. Defendant has not preserved the point for review in this respect. He may not offer an argument here that such evidence would have been relevant for impeachment because he did not offer any to that effect below. ( People v. Rowland (1992) 4 Cal. 4th 238, 262, fn. 2 [14 Cal. Rptr. 2d 377, 841 P.2d 897]; People v. Gordon (1990) 50 Cal. 3d 1223, 1251-1252 [270 Cal. Rptr. 451, 792 P.2d 251].) We recognize that, at the time of the motion, we had yet to decide People v. Wheeler (1992) 4 Cal. 4th 284 [14 Cal. Rptr. 2d 418, 841 P.2d 938], in which we held that article I, section 28, subdivision (d) of the California Constitution supersedes Evidence Code section 787 insofar as it impliedly renders evidence of prior misdemeanor convictions, or more precisely, evidence of the misconduct underlying such convictions, generally inadmissible for impeachment. But that is of no consequence. Defendant could surely have argued that it did. Indeed, on another point, he relied on People v. Adams (1988) 198 Cal. App. 3d 10 [243 Cal. Rptr. 580], in which the court held that article I, section 28, subdivision (d), of the California Constitution supersedes Evidence Code section 787 insofar as it expressly renders evidence of misconduct generally inadmissible for impeachment. If he had so argued, the superior court might well have been persuaded. To the extent that he attempts to excuse his omission by asserting that any act would have been futile, he fails: his assertion is mere conjecture. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nIn its second part, as to evidence of Sandra S.'s prior belated rape complaint, we reject the claim on the merits. Broadly speaking, an appellate court reviews any ruling by a trial court as to the admissibility of evidence for abuse of discretion. (See, e.g., People v. Rowland, (supra) , 4 Cal. 4th at p. 264.) Specifically, it scrutinizes a decision on a motion to bar the introduction of evidence as irrelevant for such abuse: it does so because it so examines the underlying determination whether the evidence is indeed irrelevant. (E.g., People v. Gordon, (supra) , 50 Cal. 3d at p. 1239.) After review, we find no abuse of discretion. The superior court impliedly determined that any relevance that evidence of Sandra S.'s prior belated rape complaint might have for impeachment was premised on the falseness of the prior complaint. It was not unreasonable in this regard. Indeed, under the reasoning of People v. Neely (1964) 228 Cal. App. 2d 16, 18 [39 Cal. Rptr. 251, 20 A.L.R.3d 679], if her prior complaint was in fact true, it would have no relevance for impeachment whatsoever. The superior court also impliedly determined that the premise that the prior complaint was false was without sufficient support. In this regard too, it was not unreasonable. Defense counsel's speculation that the police might not have \"really fe[lt] it was a crime\" could obviously have been deemed inadequate. Defendant here asserts that Neely entitled him to inquire of Sandra S. in the presence of the jury in the hope of establishing the falseness of her prior complaint. It did not. The Neely court held only that the defendant therein should have been allowed to so inquire of a woman who \"was a mentally ill person who had been\" institutionalized \"for several years,\" and had \"indicate[d] some uncertainty and confusion concerning the exact nature of her charges . . . .\" ( People v. Neely, (supra) , 228 Cal. App. 2d at p. 19.) From all that appears, Sandra S. was not such a woman. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\n8. In Limine Motion to Bar Evidence About Anthony Simpkins\n\nIn the course of trial, the People moved the superior court, in limine, to preclude defendant and Ross from impeaching Sandra S.'s friend, Anthony Simpkins, in the presence of the jury with evidence of prior convictions, including one for the misdemeanor of petty theft. Neither defendant nor Ross opposed the motion. The superior court observed that \"there does not seem to be any impeachable prior convictions.\" Defense counsel expressly \"agreed with that.\" The superior court granted the motion. Defendant requested permission to inquire in the jury's presence whether Simpkins was then in custody. The superior court gave leave to do so.\n\nAt the guilt phase, Simpkins testified on the People's behalf. On direct examination, he admitted that he was then in custody following a prior, otherwise unidentified, misdemeanor conviction. On cross-examination by defendant, he was impeached with evidence of misconduct, but not such as underlay his prior petty theft misdemeanor conviction. On cross-examination by Ross, he was not impeached at all, testifying inter alia that he had never seen her previously.\n\nDefendant now contends that the superior court erred by granting the People's motion to bar impeachment of Simpkins with his prior petty theft misdemeanor conviction.\n\nWe reject the claim at the threshold. Defendant has not preserved the point for review. He may not offer an argument in favor of impeachment because he did not offer any to that effect below. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\n9. In Limine Motion to Bar Testimony by Leslie Colyer\n\nAt the guilt phase, Charles Robinson testified on behalf of the People that, while in jail in Mississippi, defendant told him that \"he had killed a police officer in California.\" Allen Birkman was not a police officer, but rather a civilian identification technician for a police department. At defendant's request, the superior court admonished the jury to the effect that Birkman was not a police officer, and that his homicide was the only one at issue.\n\nIn advance of the People calling Leslie Colyer to the witness stand, defendant moved the superior court, in limine, to preclude them from eliciting certain testimony as inadmissible hearsay--viz., that, in the course of a telephone conversation soon after the Birkman homicide, she told him that the victim was a police officer. Expressly determining that the testimony was not hearsay, it denied the motion.\n\nLater, Colyer testified in substance that, in the course of a telephone conversation soon after the Birkman homicide, she told defendant that the victim was a police officer. In line with his motion to bar such testimony, defendant objected on the basis of hearsay; in line with its denial of that motion, the superior court overruled the objection. Colyer also testified that, earlier, the police had inquired of her as to his whereabouts. She then testified that they advised her they were seeking him in connection with a homicide. Defendant objected on the basis of hearsay; impliedly determining that the testimony was not hearsay, the superior court overruled the objection.\n\nDefendant contends that the superior court erred by denying his motion to preclude, as inadmissible hearsay, Colyer's testimony that she told him the victim of the homicide was a police officer and also by overruling his hearsay objection to her testimony that the police advised her they were seeking him in connection with a homicide.\n\nAs stated, an appellate court reviews any ruling by a trial court as to the admissibility of evidence for abuse of discretion. Specifically, it scrutinizes a decision on a motion to bar the introduction of evidence as inadmissible hearsay for such abuse: it does so because it so examines the underlying determination whether the evidence was indeed hearsay. ( People v. Rowland, (supra) , 4 Cal. 4th at pp. 262-264.) It follows that it gives the same level of scrutiny for the same reason to the passing on a hearsay objection.\n\nWe believe that the superior court did not abuse its discretion by denying defendant's motion to preclude, as inadmissible hearsay, Colyer's testimony that she told him the victim of the homicide was a police officer. Hearsay is evidence of an out-of-court statement that is offered by its proponent to prove what it states. Colyer's testimony was not such. Manifestly, it was not offered by the People to prove that Birkman was a police officer: he was not. Rather, it was offered by them to prove that, in admitting that he had killed a \"police officer,\" defendant effectively admitted he had killed Birkman, who he had been told was a police officer. The superior court was not unreasonable in expressly determining that the testimony was not hearsay. Indeed, it would have been unreasonable had it determined otherwise.\n\nWe also believe that the superior court did not abuse its discretion by overruling defendant's hearsay objection to Colyer's testimony that the police advised her they were seeking him in connection with a homicide. This testimony too was not hearsay. It was not offered by the People to prove the existence of a police investigation into his whereabouts. Rather, it was offered by them to prove the source of the information she obtained and then communicated to him--in order to prove that, in admitting he had killed a \"police officer,\" he effectively admitted he had killed Birkman. The superior court was not unreasonable in impliedly determining that the testimony was not hearsay. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\n10. Objection to Testimony About Photographic Display\n\nAt the guilt phase, in their case-in-chief, the People called Greta Slatten to the witness stand. On direct examination, she testified that she was robbed, and identified defendant as the perpetrator. On cross-examination by defendant, who inquired into the reliability of the identification, she stated in substance as follows: Not long after the robbery, she saw a photograph, which proved to be defendant's, accompanying an article in a local newspaper about the homicide of Allen Birkman; she believed it depicted the robber; Detective Darrell Edwards of the Sacramento Sheriff's Department came to her home; she showed him the newspaper photograph and told him her belief; he then showed her a display of photographs--which she described on defendant's inquiry; she selected one, which turned out to be defendant's; she thought the newspaper and display photographs of defendant might have derived from the same source.\n\nIn his case, defendant called Detective Edwards. On direct examination, Edwards testified that he went to Slatten's home to show her the photographic display in order to determine whether she could identify defendant as the robber; before he could show her the display photographs, she showed him the newspaper photograph and said she believed it depicted the robber; he then showed her the display photographs--which he then described on defendant's inquiry; she selected defendant's; the newspaper and display photographs of defendant did in fact derive from the same source.\n\nDefendant then asked Detective Edwards how he prepared the photographic display. The People objected that any response would be irrelevant. Determining that the appearance of the display might have some tendency in reason to prove or disprove a disputed fact bearing on a material issue, viz., the identity of the robber, but that its genesis would not, the superior court sustained the objection. Edwards did not respond.\n\nDefendant apparently expressed an intention to question Robert Shomer, Ph.D., a psychologist, as to how one should prepare a photographic display. The superior court stated that it would sustain an objection that any response would be irrelevant for the same reason.\n\nDefendant called Dr. Shomer. On direct examination, Dr. Shomer gave expert testimony on the suggestiveness of photographic displays in general and also on the suggestiveness of the photographic display in this cause in particular. More broadly, he gave similar testimony on the unreliability of identification by eyewitnesses in general and also on the unreliability of the identification by Slatten in particular.\n\nDefendant now contends that the superior court erred by sustaining the People's objection that any response by Detective Edwards as to how he prepared the photographic display would be irrelevant, and also by stating that it would sustain a similar objection concerning any response by Dr. Shomer as to how one should prepare such a display.\n\nAn appellate court reviews a trial court's passing on an objection based on the irrelevance of evidence for abuse of discretion. That is because, as we have stated, it so scrutinizes the underlying determination whether the evidence is indeed irrelevant.\n\nWe find no abuse of discretion here. As to both Detective Edwards and Dr. Shomer, the superior court could have determined, not at all unreasonably, that the genesis of the photographic display had no tendency in reason to prove or disprove any disputed fact bearing on a material issue. Defendant's contrary argument is that the display might have been unduly suggestive. But that fact, if it is a fact, turns on its appearance. He was not prevented from inquiring into that matter. Indeed, he did so inquire, in his cross-examination of Slatten, his direct examination of Detective Edwards, and his direct examination of Dr. Shomer. He was not entitled to more. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\n11. Objection to Cross-examination of Neetelfer Hawkins\n\nIn his case, defendant called Neetelfer Hawkins to the witness stand. On direct examination, he elicited testimony that she welcomed him to stay at her home in March, April, and May of 1987--apparently, other evidence suggested, as a lover. He also elicited testimony in an attempt to support his alibi defense: at 7 a.m. on May 17, 1987--the date of the charged robbery and murder of Allen Birkman and the charged robbery of Greta Slatten--he placed a telephone call to her and made an (evidently) unsuccessful request of her to pick him up.\n\nOn cross-examination, the People sought to inquire, for purposes of impeachment, into an interview that officers of the Sacramento Police Department conducted with Hawkins about 10 p.m. on May 17. Defendant objected on the grounds that any responsive testimony would be irrelevant and also inadmissible hearsay. Outside the presence of the jury, the People made an offer of proof: in the course of the interview, the officers posed specific questions to Hawkins about defendant and her contacts with him, and she gave detailed answers in response, but failed to mention any telephone call that day; if she did not admit the omission on cross-examination, they would call one of the officers in their case in rebuttal to establish it as a fact. Defendant then effectively objected to the People's inquiry into specific questions by the officers and detailed answers by Hawkins as lacking in foundation, in advance of their introduction of evidence that she indeed failed to mention any call that day. The superior court overruled all defendant's objections.\n\nOn cross-examination, the People inquired into the May 17 interview. Hawkins testified to specific questions by the officers and detailed answers by her in response. But she denied that she failed to mention any telephone call from defendant that day.\n\nSubsequently, taking the witness stand on his own behalf, defendant testified, inter alia, that sometime early in the morning of May 17, he placed a telephone call to Hawkins and made an (evidently) unsuccessful request of her to pick him up. He further testified that, about 11:30 or 11:40 a.m. that same day, he placed another call and made another unsuccessful request.\n\nIn their case-in-rebuttal, the People called Hawkins. She restated that, on May 17, defendant placed a telephone call to her at 7 a.m. She added that, on that day, to her knowledge he did not place any other call to her at any other time.\n\nThe People also called Sergeant Ralph Coyle. He was one of the police officers who interviewed Hawkins on May 17. He testified that she failed to mention any telephone call from defendant that day.\n\nDefendant now contends that the superior court erred by overruling his lack-of-foundation objection to the People's inquiry into specific questions by the officers and detailed answers by Hawkins in the course of the May 17 interview, in advance of their introduction of evidence that she failed to mention any telephone call from him that day.\n\nAs a general matter, an appellate court reviews a trial court's ruling as to the order of proof for abuse of discretion. That is because, as a general matter, the trial court has authority to \"regulate the order of proof\" in the exercise of \"its discretion.\" (Evid. Code, § 320.)\n\nWe examine the superior court's passing on defendant's lack-of-foundation objection for abuse of discretion. We do so inasmuch as it amounts to the kind of ruling as to the order of proof that is generally entrusted to its discretion.\n\nAfter such examination, we discern no abuse of discretion. The superior court was not unreasonable in allowing the People's inquiry into specific questions by the officers and detailed answers by Hawkins in the course of the May 17 interview, in advance of their introduction of evidence that she failed to mention any telephone call from defendant that morning. They had made an offer of proof of her omission. Defendant did not contest the issue. Through the testimony of Sergeant Coyle, they subsequently furnished the proof. We do not see any basis for a Conclusion that the superior court's regulation of these matters was wanting in any particular.\n\n12. Defendant's Testimony: Assistance of an Interpreter\n\nPrior to trial, defendant moved the superior court to appoint an interpreter to assist him throughout the proceedings. In support, defense counsel declared, in substance, that defendant had spent most of his life in Cuba, and there spoke Spanish; he had been in the United States for only eight or nine years; he could carry on a conversation in English on a limited basis; but he \"appear[ed] not to understand where the conversation involves anything technical such as explaining different Court procedures\"; and he \"indicated that he does have a great deal of difficulty when the language becomes technical in nature.\" The superior court granted the motion. It made an interpreter from the interpreter's office for the superior and municipal courts available to assist him throughout the proceedings. An interpreter did in fact assist.\n\nIn his case, defendant took the witness stand on his own behalf. At the commencement of direct examination, defense counsel asked, \"Now, you're going to be testifying in English today; is that correct?\" Defendant answered, \"Yes.\" DEFENSE COUNSEL: \"And that's at your request; is that right?\" DEFENDANT: \"Right.\" DEFENSE COUNSEL: \"hat's your native language?\" DEFENDANT: \"Spanish.\" DEFENSE COUNSEL: \"And the interpreter is next to you here, and if you have any problems either understanding me or expressing yourself, then just feel free to ask the interpreter to help out. Will you do that?\" DEFENDANT: \"Okay.\" The superior court made plain that, if anyone was unable to understand defendant, he should so indicate.\n\nSubsequently, in a recess during cross-examination by the People, defense counsel requested the superior court, outside the presence of the jury, to cause the interpreter to simultaneously translate for defendant \"the questions that are being asked on cross-examination, because I noted that, it appeared to me at least, that he had misunderstood a couple of the questions that were asked, and\" had given answers \"not necessarily responsive to them . . . .\" The superior court declined to order simultaneous translation, stating that it \"prefer[red] to continue the way we're going,\" that is, with sequential translation. \"If you feel . . . that he's misunderstanding the question, you may use that as an objection, in this case.\" Defense counsel said, \"Okay.\" Later, the superior court explained its \"preference\" by calling on the interpreter to state for the record: \"e never do simultaneous [translation] at the witness stand, only at counsel table\"; \"[t]he main reason is, because of the confusion of hearing two languages at the same time, . . . and also, you lose the continuity of the questioning . . . .\" Defense counsel commented, \"I think that by giving me an additional grounds [ sic ] of objection, other than those provided for in the vidence ode itself, to solve the problem, . . . at least I can stop the proceedings and make sure that he understands what the question is.\" The superior court stated, \"I think things went well, that way, and we'll continue that way.\"\n\nDefendant now contends that the superior court erred by denying him his right to the assistance of an interpreter in the course of his testimony.\n\nWe shall assume that defendant did in fact have a right to the assistance of an interpreter. For example, article I, section 14 of the California Constitution provides that \"[a] person . . . who is charged with a crime has a right to an interpreter\"--meaning an interpreter's assistance --if he is \"unable to understand English.\" For present purposes, defendant may be deemed to have been \"unable to understand English.\"\n\nWe cannot conclude, however, that the superior court denied defendant any right he had to the assistance of an interpreter. It made an interpreter available to assist him throughout the proceedings. Furthermore, an interpreter did in fact assist. Taking the witness stand, he chose to testify in English. The superior court continued to make the interpreter available to assist him there--and the interpreter did in fact continue to assist. True, it impliedly prohibited simultaneous translation. But it expressly allowed sequential translation.\n\nAgainst our Conclusion, defendant argues that the superior court denied him any right he had to the assistance of an interpreter, at least when it impliedly prohibited simultaneous translation. We disagree. The superior court did not disallow assistance. Even with the implied prohibition, it merely affected the manner in which it was provided. A trial court has the power--indeed, the duty--to conduct the proceedings in an orderly manner. (Code Civ. Proc., § 128, subd. (a)(3).) An appellate court reviews the exercise of such power for abuse of discretion. ( People v. Jackson (1967) 250 Cal. App. 2d 851, 855 [58 Cal. Rptr. 776]; People v. Miller (1960) 185 Cal. App. 2d 59, 77 [8 Cal. Rptr. 91].) There was no such abuse here. The superior court did not act unreasonably. As indicated, simultaneous translation was explained by the interpreter to be impracticable. As also indicated, sequential translation was found satisfactory by the superior court, and was even accepted by defense counsel. We do not overlook the fact that, during his testimony, defendant experienced difficulties in understanding and in making himself understood. But neither can we overlook the fact the superior court did not refuse him any assistance.\n\nDefendant also argues that he did not effectively waive any right he had to the assistance of an interpreter. That is true. But it does not matter. The reason is simple: Defendant retained any right he had, and went on to exercise it as he saw fit, subject only to the superior court's implied prohibition of simultaneous translation. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\n13. Defendant's Testimony: Disqualification as a Witness\n\nBy the end of his first day on the witness stand, defendant had not completed his testimony on direct examination. The next day, before the morning session commenced, he commented that he had not been administered certain medication that had been prescribed. The superior court asked, \"You feel okay today?,\" and he answered, \"Yeah, I'm feeling okay.\" It stated, \"Let's get started. We'll talk about this later,\" and he added, \"Fine.\" His direct examination resumed. The morning recess was called. During its course, he was administered his medication. His direct examination resumed again. The lunch recess was called. Before the afternoon session was to commence, the superior court stated that it had been informed by defense counsel that defendant was \"groggy\" from his medication. Defendant gave confirmation. He also remarked that he had not eaten anything that day. The superior court gave him an opportunity to have some food and drink. Afterwards, it asked, \"Okay, . . . how do you feel now?,\" and he answered, \"I feel much better.\" It then asked, \"Do you feel like continuing on and testifying for another hour?,\" and he answered, \"My--my tongue feel [ sic ] kind of thick.\" Defense counsel requested a continuance of trial until the next day. The superior court granted what he sought, stating to defendant that \"I'm satisfied . . . by the expression of your face and the sound of your voice that you're not as alert as you should be.\" It then asked defense counsel, \"Do you want me to tell the jury that he's taking medication or that he just simply isn't feeling well? Maybe the best thing is simply tell them that he just isn't feeling well, and we gave him an opportunity to have a little food and see if that helped, and it just really didn't.\" Defense counsel answered, \"That would be fine.\" The superior court so informed the jury. The next day, defendant's direct examination resumed. At its opening, he was asked, \"re you feeling better today?,\" and answered, \"Yes, I do.\"\n\nDefendant contends that the superior court erred: (1) by failing to strike, sua sponte, the testimony he gave immediately after he was administered his medication; (2) by failing to admonish the jury, sua sponte, not to consider such testimony; (3) by failing to inform the jury, sua sponte, that he had been administered medication and had been affected thereby; and (4) by failing to admonish the jury, sua sponte, not to consider the demeanor he displayed while he gave the testimony in question.\n\nWe reject the claim. Defendant's premise is that the superior court was under a duty to intervene, even in the absence of a request, because, in the period of time immediately after he was administered his medication, he was \"disqualified to be a witness,\" under Evidence Code section 701, subdivision (a)(1), on the ground that he was \"[i]ncapable of expressing himself . . . concerning the matter so as to be understood . . . .\" It fails. The superior court was not under a duty because he was not disqualified. The record on appeal does not show that he was incapable of expression. Indeed, it does not even raise any such suggestion. That is true as to the period of time immediately after he was administered his medication. It is true as well as to the point at which the superior court granted defense counsel's request for a continuance. Perhaps, as the superior court commented, defendant was then \"not as alert as [he] should be.\" But that is all. Contrary to defendant's implication, the superior court did not grant defense counsel's request because it found any incapability of expression on his part. Rather, it did so simply to accommodate his inDisposition. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\n14. Defendant's Testimony: Mental Competence to Stand Trial\n\nDefendant contends that the superior court erred by failing to order a hearing under Penal Code section 1367 et seq., sua sponte, in order to determine whether he was mentally incompetent to stand trial, that is, whether, \"as a result of mental disorder or developmental disability,\" he was \"unable to understand the nature of the criminal proceedings or to assist counsel in the conduct of a defense in a rational manner\" (Pen. Code, § 1367, subd. (a)).\n\nWe disagree. A trial court is not under a duty to order a hearing on a defendant's mental incompetence to stand trial, in the absence of a request, unless it has been presented with \"substantial evidence of mental incompetence,\" i.e., \"evidence that raises a reasonable doubt on the issue.\" ( People v. Howard, (supra) , 1 Cal. 4th at p. 1163.) The superior court was not presented with any such evidence whatsoever. Defendant did not display any mental disorder or developmental disability of any kind. Neither did he reveal any inability to understand the criminal proceedings or to give his assistance to defense counsel. The most that can be said is that, because of anger and other emotions, he was sometimes unwilling to participate. To say that, however, is to say too little.\n\n15. Prosecutorial Misconduct\n\nOn direct examination, defendant gave testimony in which he presented an alibi for the time and place of the charged robbery of Greta Slatten. He stated, inter alia, that he had gotten possession of Slatten's Taurus the day of the robbery by giving some cocaine in trade to a young man who called himself \"J.R.\"; in the automobile, he found a purse, which evidently belonged to Slatten; he drove south and eventually arrived in Fresno; there, he disposed of the purse.\n\nOutside the presence of the jury, defendant moved the superior court to preclude the People from inquiring into whether he used certain credit cards in Slatten's purse. His basis included that any response would be unduly prejudicial, i.e., insufficiently probative in light of, inter alia, the risk to the fairness of the proceedings or the reliability of the outcome. On that basis, the superior court ruled as follows: the People could ask whether he used the credit cards; if he answered yes, they could not go any further; if he answered no, they could.\n\nIn the course of cross-examination, the prosecutor asked whether he used any of Slatten's credit cards, and defendant answered yes; the prosecutor asked if he kept the credit cards after he disposed of the purse or disposed of the purse after he used them, and he answered he used a gasoline company credit card and then disposed of the purse; the prosecutor asked whether he disposed of the purse and all the other credit cards, and he answered yes; the prosecutor asked if the only credit card he used was that of the gasoline company, and he answered yes.\n\nAt this point, defendant objected that the prosecutor's questions violated the superior court's ruling. The superior court overruled the objection.\n\nThereupon, the prosecutor asked whether he used a chain-store credit card belonging to Slatten, and defendant answered no; he asked whether he went into one of the stores in the chain, and he answered no.\n\nDefendant contends in substance that the superior court erred by effectively determining that the prosecutor did not commit misconduct by asking all but the initial question on his use of Slatten's credit cards.\n\nAs a general matter, an appellate court reviews a trial court's ruling on prosecutorial misconduct for abuse of discretion. (Cf. 2 Childress \u0026 Davis, Federal Standards of Review (2d ed. 1992) § 12.01, pp. 12-1 to 12-16 [setting forth the standard of review under federal law].)\n\nWe believe that the superior court did not abuse its discretion. \" 'In general, a prosecutor commits misconduct by the use of deceptive or reprehensible methods to persuade either the court or the jury.' [Citation.] His 'good faith vel non ' is not 'crucial.' [Citation.] That is because the standard in accordance with which his conduct is evaluated is objective.\" ( People v. Berryman (1993) 6 Cal. 4th 1048, 1072 [25 Cal. Rptr. 2d 867, 864 P.2d 40].) Under this rule, the superior court was not unreasonable in impliedly concluding that the prosecutor did not commit misconduct. For it was not unreasonable in impliedly finding that he did not use any method of persuasion that may be deemed deceptive or reprehensible. Defendant argues that, by asking all but the initial question on his use of Slatten's credit cards, the prosecutor violated the superior court's ruling. Plainly, to Judge from its overruling of his objection, the superior court discerned no substantial violation. Neither do we. As noted, the prosecutor asked whether he used any of the credit cards, and defendant answered yes. The prosecutor then turned from the matter of \"use\" to that of \"time,\" asking if he kept the credit cards after he disposed of the purse or disposed of the purse after he used them. Of his own accord, defendant returned to the matter of \"use,\" answering he used a gasoline company credit card and then disposed of the purse. By following where defendant led, the prosecutor cannot be held to have substantially violated the superior court's ruling.\n\n16. Objection to Cross-examination of Codefendant Ross\n\nOn direct examination, defendant gave testimony in which he presented an alibi for the time and place of the charged robbery and murder of Allen Birkman. In the course of cross-examination by the People, he denied that he had acted violently during an argument with Neetelfer Hawkins at the latter's home on May 16, 1987, the day before the crimes in question.\n\nIn her case, Ross took the witness stand in her own defense. On direct examination, in an effort to shift responsibility for the charged robbery and murder off her shoulders and onto defendant's, she testified in substance that she did not even suspect what he had evidently intended, but had accompanied him out of fear.\n\nOn cross-examination by the People, Ross was asked, \"Why were you afraid of him?,\" and answered, \"Because I had just witnessed what he did to . . . Miss Hawkins.\"\n\nLater in the People's cross-examination, Ross was asked, \"What was the thing at Neetlefer's [ sic ] that made you afraid of [him]?,\" but was prevented from answering by defendant's objection that any response would be irrelevant.\n\nAt defendant's request, the People then made an offer of proof outside the presence of the jury, by taking Ross on voir dire: She testified about defendant's argument with Hawkins as a \"lover's quarrel type of thing,\" in the course of which she screamed and swore at him and he forcibly covered her mouth almost to the point of stifling and handled her roughly, she telling him she was going to call the police and he threatening her he would kill her if she did.\n\nDefendant restated his objection that any response by Ross to the People's question about his argument with Hawkins would be irrelevant. In addition, he raised objections that such response would be unduly prejudicial and would amount to inadmissible character evidence, i.e., evidence of his character or a trait of his character offered to prove his conduct on the specified occasion of the charged robbery and murder (Evid. Code, § 1101, subd. (a)).\n\nAfter a hearing, at which it ultimately appears to have accepted the People's position that whether Ross was afraid of defendant was the \"nut\" of her defense and why she was afraid of him was crucial thereto, the superior court generally overruled all defendant's objections to Ross's expected response to the People's question about his argument with Hawkins, but sustained that based on undue prejudice as to any threat to kill.\n\nSubsequently, on cross-examination by the People, Ross was asked about defendant's argument with Hawkins, and she answered in accordance with her testimony on voir dire, making plain that he had acted violently, but without mentioning his threat to kill Hawkins.\n\nLater, in their case-in-rebuttal, the People called Hawkins and Sergeant Coyle. Hawkins denied that defendant had acted violently during the argument. Sergeant Coyle asserted that she had told him the opposite.\n\nDefendant now contends that the superior court erred by generally overruling his irrelevance, undue prejudice, and inadmissible character evidence objections to the People's question to Ross about his argument with Hawkins.\n\nAs stated, an appellate court reviews a trial court's passing on an objection based on irrelevance for abuse of discretion. The same is true for an objection based on undue prejudice. (See People v. Gordon, (supra) , 50 Cal. 3d at p. 1239.) Likewise, for an objection based on inadmissible character evidence. ( People v. Memro, (supra) , 11 Cal. 4th at p. 864.)\n\nThere was no abuse of discretion.\n\nThe superior court was not unreasonable in impliedly determining that Ross's expected response about defendant's argument with Hawkins would be relevant. It had a tendency in reason to prove a disputed fact bearing on a material issue, viz., the relative responsibility of defendant and Ross for the charged robbery and murder. To the extent that his argument with Hawkins would show a supported fear of him on her part, it might be able to diminish her culpability over against his. But to the extent that it would not, it might not. Defendant argues the evidence was irrelevant: insofar as it would favor Ross's position vis-a-vis the People, it could be presented by her but not elicited by them. He furnishes no support for his assertion, and we find none. Relevance does not depend on the identity of the evidence's proponent. Neither does admissibility. With exceptions not applicable here, \" all relevant evidence is admissible.\" (Evid. Code, § 351, italics added.) \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nNeither was the superior court unreasonable in impliedly determining that Ross's expected response about defendant's argument with Hawkins would not be unduly prejudicial (except as to his threat to kill her). Certainly, even though it could be considered somewhat collateral and would (and in fact did) lead to rebuttal testimony by Hawkins and Sergeant Coyle, it did not threaten substantial harm to the fairness of the proceedings, as by confusing the issues or misleading the jury. In contrast, it promised substantial benefit to the reliability of the outcome. It arguably constituted the strongest evidence supporting Ross's fear of defendant. Evidence in support was indeed needed: Ross's fear could not be accepted at face value. Defendant argues the evidence was unduly prejudicial. At most, he shows that his argument with Hawkins might have been used by the jury to draw a forbidden inference. That is not enough. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nLastly, the superior court was not unreasonable in impliedly determining that Ross's expected response about defendant's argument with Hawkins would not amount to inadmissible character evidence. True, it might have provided an indication of a propensity toward violence on his part. But it was not offered to prove his conduct on the specified occasion of the charged robbery and murder. Defendant argues the evidence was inadmissible character evidence. Here, as above, the most that he shows is that it might have been used by the jury to draw a forbidden inference. Here, as above, that is not enough. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nEven if the superior court had, in fact, erred by overruling any of defendant's objections to the People's question to Ross about his argument with Hawkins--which it did not--reversal would not be called for. \"It is the general rule for error under [California] law\"--which we believe is applicable here--\"that reversal requires prejudice and prejudice in turn requires a reasonable probability of an effect on the outcome\" under People v. Watson (1956) 46 Cal. 2d 818 [299 P.2d 243]. ( People v. Gordon, (supra) , 50 Cal. 3d at p. 1253.) \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Such a probability does not appear. In view of all the evidence that was properly admitted on each of the charged crimes, Ross's testimony concerning the \"lover's quarrel\" between defendant and Hawkins was of no marginal significance.\n\n17. Instruction on Pity and Prejudice\n\nIn accordance with the pattern instruction set out as CALJIC No. 1.00 (5th ed. 1988), as modified, the superior court told the jury: \"You must not be influenced by pity for a defendant or by prejudice against him or her. You must not be biased against the defendant because he or she has been arrested for this offense, charged with a crime, or brought to trial. None of these circumstances is evidence of guilt and you must not infer or assume from any or all of them that he or she is more likely to be guilty than innocent. You must not be influenced by prejudice, public opinion or public feeling.\" (Brackets omitted.) Where the instruction as delivered admonished against influence \"by prejudice, public opinion or public feeling,\" the unmodified pattern instruction admonished against influence \"by mere sentiment, conjecture, sympathy, passion, prejudice, public opinion or public feeling.\"\n\nDefendant contends that the superior court erred by instructing as it did on pity and prejudice.\n\nAgainst a claim of this kind, an appellate court reviews a trial court's instruction independently: The underlying \"question is one of law, involving as it does the determination of . . . applicable legal principles . . . .\" ( People v. Berryman, (supra) , 6 Cal. 4th at p. 1089.)\n\nAfter independent review, we find no error. In People v. Hawthorne (1992) 4 Cal. 4th 43, 73 [14 Cal. Rptr. 2d 133, 841 P.2d 118], we concluded that, under California law, a trial court should indeed instruct the jury on pity and prejudice. The superior court gave a plainly adequate instruction on the issue. Although it did not expressly admonish against influence \"by mere sentiment, conjecture, sympathy, [or] passion,\" it did so impliedly by admonishing against influence \"by pity . . . or . . . prejudice . . . .\" In spite of what defendant appears to suggest, CALJIC No. 1.00 is not itself the law. Like other pattern instructions, it is merely an attempt at a statement thereof. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\n18. Instruction to View an Accomplice's Testimony With Distrust\n\nAt the guilt phase, defendant and Ross each testified on his or her own behalf, denied guilt, and incriminated the other, at least to some extent. Moreover, each was an accomplice of the other, inasmuch as he or she was \"liable,\" and actually subject, \"to prosecution for the identical offense[s] charged against\" the other, specifically, the robbery and murder of Allen Birkman. (Pen. Code, § 1111.)\n\nIn accordance with the pattern instruction set out as CALJIC No. 3.18 (1979 re-rev.) (4th ed. pocket pt.), as modified, the superior court told the jury: \"The testimony of an accomplice which tends to incriminate a co-defendant ought to be viewed with distrust. This does not mean that you may arbitrarily disregard such testimony, but you should give to it the weight to which you find it to be entitled after examining it with care and caution and in light of all the evidence in the case.\" In its first sentence, the unmodified pattern instruction provided simply, \"[t]he testimony of an accomplice ought to be viewed with distrust,\" and did not contain the relative clause, \"which tends to incriminate a co-defendant.\" The superior court stated that the \"purpose\" of its modification \"is to tell the jury they should view with caution that portion that incriminates the defendant, rather than cast a shadow over all of the testimony of a co-defendant . . . .\"\n\nDefendant contends that the superior court erred by instructing that the testimony of an accomplice that tends to incriminate a codefendant ought to be viewed with distrust. He argues, in substance, that it was without authority to so instruct.\n\nAgainst a claim of this kind, which involves the determination of applicable legal principles, an appellate court reviews a trial court's instruction independently.\n\nAfter such review, we conclude that the superior court did not err. In People v. Terry (1970) 2 Cal. 3d 362, 399 [85 Cal. Rptr. 409, 466 P.2d 961], we stated that when, as here, a defendant testifies on his own behalf, denies guilt, and incriminates his codefendant, a trial court has authority to instruct the jury that his testimony should be viewed with distrust as that of an accomplice. We believe our statement was sound, and now so hold. The superior court delivered such an instruction: the testimony of an accomplice-defendant that tends to incriminate his codefendant should be viewed with distrust. Its limitation--the accomplice-defendant's testimony should be viewed with distrust to the extent that it tends to incriminate his codefendant --was altogether proper. (Cf. People v. Williams, (supra) , 45 Cal. 3d at pp. 1313-1314 [implying that a trial court may instruct the jury that an accomplice's testimony should be viewed with distrust insofar as it tends to incriminate the defendant, but should not be so viewed insofar as it does not].)\n\nStrictly speaking, defendant does not complain of the instruction insofar as it benefits him as the incriminated codefendant. Understandably so. An accomplice who testifies against a defendant deserves \"close scrutiny.\" ( People v. Garrison (1989) 47 Cal. 3d 746, 775 [254 Cal. Rptr. 257, 765 P.2d 419].) For he has the motive, opportunity, and means to attempt to help himself at the other's expense. (See ibid.; People v. Graham (1978) 83 Cal. App. 3d 736, 743 [149 Cal. Rptr. 6].) That remains true when the accomplice who testifies against a defendant is himself a defendant.\n\nDefendant does complain of the instruction, however, insofar as it burdens him as the incriminating accomplice-defendant. But without sufficient basis. If an accomplice who testifies against a defendant deserves \"close scrutiny\" --and he does--he deserves such scrutiny even if he is himself a defendant. Like any other accomplice, an accomplice-defendant has the motive, opportunity, and means to try to help himself at the other's expense.\n\nIt is true that the testimony of a defendant ought not to be viewed with distrust simply because it is given by a defendant. Indeed, to such effect was the superior court's instruction on pity and prejudice. (See, ante, at p. 217.)\n\nIt is also true, however, that the testimony of a defendant ought not to be viewed without distrust simply because it is given by a defendant. Under the law, a defendant is surely equal to all other witnesses. But, under that same law, he is superior to none. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\n19. Instruction on Concurrence of Act and \"Specific Intent\"\n\nIn accordance with the pattern instruction set out as CALJIC No. 3.31 (1989 rev.) (5th ed. pocket pt.), the superior court told the jury: \"In each of the crimes charged in Counts Two, Three and Five of the information, namely, robbery, auto theft and robbery, there must exist a union or joint operation of act or conduct and a certain specific intent in the mind of the perpetrator and unless such specific intent exists the crime to which it relates is not committed.\"\n\nDefendant contends that the superior court erred by instructing as it did on the concurrence of act and so-called \"specific intent.\" He argues, in substance, as follows: The language did not include the crime charged in count 1, i.e., murder, or the special circumstance alleged therein, i.e., felony-murder robbery; hence, it did not require an intent to kill a human being, which belonged to murder of the first degree under the theory of willful, deliberate, and premeditated killing and, at that time, \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e also belonged to the felony-murder-robbery special circumstance.\n\nAgainst a claim of this kind, which involves the determination of applicable legal principles, an appellate court reviews a trial court's instruction independently.\n\nAfter such review, we conclude that the superior court did in fact err insofar as its instruction on the concurrence of act and \"specific intent\" did not include the crime of murder. Even in the absence of a request, a trial court must deliver an instruction of this sort as to a given crime if it is one of \"specific intent.\" ( People v. Turner (1971) 22 Cal. App. 3d 174, 184 [99 Cal. Rptr. 186]; see People v. Germany (1974) 42 Cal. App. 3d 414, 418-419 [116 Cal. Rptr. 841] [following Turner ].) Murder is such a crime. ( People v. Whitfield (1994) 7 Cal. 4th 437, 450 [27 Cal. Rptr. 2d 858, 868 P.2d 272].)\n\nThe error, however, does not call for reversal. We believe that a defect of this sort is subject to the general rule for error under California law that reversal requires prejudice and prejudice in turn requires a reasonable probability of an effect on the outcome. Such a probability does not appear. An instruction on murder substantially covered the concurrence of act and \"specific intent.\" IT DECLARED AS FOLLOWS: Either it \"must be proved\" that defendant \"unlawfully kill[ed] a human being during the commission or attempted commission of robbery\"--which was included in the instruction on the concurrence of act and \"specific intent.\" Or it \"must be proved\" that he \"unlawfully kill[ed] a human being with malice aforethought . . . .\" (Italics added.) Another instruction expressly required intent to kill for murder of the first degree under the theory of willful, deliberate, and premeditated killing. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nNext, we conclude that the superior court did not err insofar as its instruction on the concurrence of act and \"specific intent\" did not include the felony-murder-robbery special circumstance. By its very terms, this instruction applies only to \"crimes\" and not to special circumstances.\n\nAny such error, however, would not require reversal. There was no prejudice because there was no reasonable probability of an effect on the outcome. An instruction on the felony-murder-robbery special circumstance substantially covered the concurrence of act and \"specific intent.\" It declared that \"it must be proved\" both that defendant \"committed\" the \"murder\" either \"while he was engaged in the commission or attempted commission of a robbery\" or \"during the immediate flight\" thereafter and that he \"intended to kill.\" (Brackets omitted.) Not only did this instruction impliedly require the concurrence of act and \"specific intent,\" it expressly required intent to kill.\n\n20. Instruction on Causation as to the Crime of Murder\n\nIn accordance with the pattern instruction set out as CALJIC No. 8.10 (5th ed. 1988), the superior court told the jury that, in order to be \"guilty of the crime of murder,\" a person must \"unlawfully kill[] a human being with malice aforethought or during the commission or attempted commission of\" an enumerated felony, here \"robbery.\" (Certain brackets omitted.) It defined murder of the first degree under the theory of willful, deliberate, and premeditated killing. It also defined murder of the first degree under the theory of felony-murder robbery or attempted robbery. Specifically, in conformity with the pattern instruction of CALJIC No. 8.21 (5th ed. 1988), it stated that the \"unlawful killing of a human being, whether intentional, unintentional or accidental, which occurs during the commission or attempted commission of\" an enumerated felony, here \"robbery,\" \"is murder of the first degree when the perpetrator had the specific intent to commit such\" felony. (Brackets omitted.)\n\nDefendant contends, in substance, that the superior court erred by assertedly failing to instruct on causation as to the crime of murder.\n\nAgainst a claim of this kind, which involves the determination of applicable legal principles, an appellate court reviews a trial court's instruction independently.\n\nThere was no error. The superior court did not fail to instruct on causation as to the crime of murder. It did indeed instruct thereon. Moreover, it did so adequately. It did not allow guilt to turn on the perpetrator's unrelated act and the victim's unrelated death. Rather, by requiring the perpetrator to kill the victim, it required the act to cause the death. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nIn part, defendant argues to the effect that the superior court should have amplified its instructions: In defining murder pursuant to CALJIC No. 8.10, he says, it should have referred to, and explained, proximate cause. Had he desired such an amplification, he should have requested it of the superior court. He made no request of this sort. Indeed, defense counsel stated, \"I'm not gonna make any issue out of the proximate cause . . . .\" Because defendant did not request amplification of the otherwise adequate instructions below, he may not complain here. (E.g., People v. Sanders (1995) 11 Cal. 4th 475, 533 [46 Cal. Rptr. 2d 751, 905 P.2d 420].) \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nIn other part, defendant argues to the effect that the superior court should have clarified its instructions: In defining murder of the first degree under the theory of felony-murder robbery or attempted robbery pursuant to CALJIC No. 8.21, he says, it should have referred not to an unlawful killing occurring \"during the commission or attempted commission of . . . [a] robbery,\" but rather to one occurring \"as a direct causal result\" thereof. Had he desired such a clarification, he should have requested it of the superior court. He made no request of this sort. Indeed, defense counsel acquiesced in the \"unclarified\" instruction containing the during-the-commission language instead of the as-a-direct-causal-result alternative. The reasons are plain. The first is \"legal.\" An unlawful killing is deemed to occur during the commission or attempted commission of an enumerated felony so long as the fatal blow is struck in its course, even if death does not then result. (2 LaFave \u0026 Scott, Substantive Criminal Law (1986) Felony Murder, § 7.5(f), p. 223, fn. 88.) Even though Allen Birkman did not die until the next day, he was fatally stabbed during the commission or attempted commission of a robbery. The second reason is \"factual.\" Since Birkman died the day after he was fatally stabbed, the during-the-commission language was more favorable than the as-a-direct-causal-result alternative: the jury would readily find that Birkman was killed \"as a direct causal result\" of the commission or attempted commission of a robbery, but might hesitate to find that he was killed \" during [its] commission or attempted commission.\" (Italics added.) Because defendant did not request clarification of the otherwise adequate instructions below, he may not complain here. (E.g., People v. Sanders, (supra) , 11 Cal. 4th at p. 533.) \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\n21. Instruction on Implied Malice Aforethought\n\nIn accordance with the pattern instruction set out as CALJIC No. 8.10 (5th ed. 1988), the superior court told the jury that, in order to be \"guilty of the crime of murder,\" a person must \"unlawfully kill[] a human being with malice aforethought . . . .\" In conformity with the pattern instruction of CALJIC No. 8.11 (5th ed. 1988), it defined malice aforethought thus: \" 'Malice' may be either express or implied. Malice is express when there is manifested an intention unlawfully to kill a human being. MALICE IS IMPLIED WHEN: 1. The killing resulted from an intentional act, 2. The natural consequences of the act are dangerous to human life, and 3. The act was deliberately performed with knowledge of the danger to, and with the conscious disregard for, human life.\" (Certain brackets omitted.)\n\nDefendant contends that the superior court erred by failing to modify its instruction defining malice aforethought, sua sponte, in order to preclude it from reaching the felony-murder-robbery special circumstance. He argues that the instruction as delivered conflicted with that dealing with the special circumstance and specifically with its requirement of intent to kill.\n\nWe reject the claim on the threshold as not preserved for review. \"If defendant believed that a modification . . . was required, he was obligated to request it.\" ( People v. Rodrigues (1994) 8 Cal. 4th 1060, 1142 [36 Cal. Rptr. 2d 235, 885 P.2d 1].)\n\nWe also reject the claim on the merits as without support. The instruction on the felony-murder-robbery special circumstance, which is quoted above (see, ante, at p. 221), required intent to kill, and did so expressly. The instruction defining malice aforethought did not. There was no conflict. The subject of the latter was the crime of murder. The subject of the former was the felony-murder-robbery special circumstance, which demanded murder and more, including intent to kill.\n\n22. Sufficiency of the Evidence for First Degree Felony Murder\n\nDefendant contends, in substance, that the evidence is insufficient under the due process clause of the Fourteenth Amendment to the United States Constitution to support his conviction for the murder of Allen Birkman in the first degree under the theory of felony-murder robbery or attempted robbery.\n\n\"In reviewing the sufficiency of evidence under the due process clause of the Fourteenth Amendment to the United States Constitution, the question we ask is 'whether, after viewing the evidence in the light most favorable to the prosecution, any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt.' \" ( People v. Rowland, (supra) , 4 Cal. 4th at p. 269, quoting Jackson v. Virginia (1979) 443 U.S. 307, 319 [61 L. Ed. 2d 560, 573, 99 S. Ct. 2781], original italics.)\n\nDefendant claims that the evidence is insufficient to support his first degree murder conviction under the theory of felony-murder robbery or attempted robbery on the ground that it is inadequate to establish intent to steal--which is an element of robbery and attempted robbery (see, e.g., People v. Ledesma (1987) 43 Cal. 3d 171, 243 [233 Cal. Rptr. 404, 729 P.2d 839]).\n\nDefendant is wrong. A rational trier of fact could surely have found beyond a reasonable doubt that he did in fact intend to steal. One need recall only the following. In his out-of-court statement, Birkman declared that the two persons who had accosted him attempted a robbery, and thereby implied that they intended to steal. On the witness stand, Ross testified that one of two persons was defendant. More evidence there is. But more is not required. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\n23. Sufficiency of the Evidence for Personal Use of a Deadly Weapon\n\nDefendant contends that the evidence is insufficient to support the finding that he personally used a deadly weapon in the robbery of Greta Slatten. The question is whether, after viewing the evidence in the light most favorable to the prosecution, any rational trier of fact could have found the elements of the underlying enhancement beyond a reasonable doubt. ( People v. Dominguez (1995) 38 Cal. App. 4th 410, 421 [45 Cal. Rptr. 2d 153]; People v. Jacobs (1987) 193 Cal. App. 3d 375, 380 [238 Cal. Rptr. 278].) The answer is yes. Contrary to defendant's claim, such a trier of fact could have determined to the requisite degree of certainty that whatever it was that he personally used in the crime was indeed a deadly weapon: it could have inferred from the nature and extent of the injuries that Slatten suffered--which required suturing with 20 stitches, prevented her from opening her mouth, and blackened the left side of her face from her hairline down through her neck--that it was a blunt instrument that caused them and that such instrument was in fact capable of inflicting death.\n\nB. Death Eligibility\n\nDefendant raises a single claim against his eligibility for the penalty of death.\n\nSubstantially remounting the attack he made on his conviction for the murder of Allen Birkman in the first degree under the theory of felony-murder robbery or attempted robbery, defendant contends that the evidence is insufficient to support the finding of the felony-murder-robbery special circumstance, which includes both robbery and attempted robbery.\n\n\"In reviewing the sufficiency of evidence for a special circumstance, the question we ask is whether, after viewing the evidence in the light most favorable to the People, any rational trier of fact could have found the essential elements of the allegation beyond a reasonable doubt.\" ( People v. Mickey (1991) 54 Cal. 3d 612, 678 [286 Cal. Rptr. 801, 818 P.2d 84], original italics.) \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nSubstantially repeating the argument he made against his first degree murder conviction under the theory of felony-murder robbery or attempted robbery, defendant claims that the evidence is insufficient to support the felony-murder-robbery special circumstance finding on the ground that it is inadequate to establish intent to steal--which, as stated, is an element of robbery and attempted robbery, which underlie this special circumstance (Pen. Code, § 190.2, subd. (a)(17)(i), as added by § 6 of Prop. 7, approved by initiative, Gen. Elec. (Nov. 7, 1978); accord, Pen. Code, § 190.2, present subd. (a)(17)(A)).\n\nDefendant is wrong. We need not restate the reason. (See, ante, at pp. 224-225.) \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nC. Penalty\n\nDefendant makes several claims going to the penalty of death. As will appear, none proves to be meritorious.\n\n1. Application for Funds for Trip to Cuba\n\nDefendant presents a number of contentions relating to an application he made to the superior court for authorization to incur expenses for a trip to Cuba in order to prepare and present a defense at the penalty phase. Properly to address his points, we must set out the pertinent proceedings at some length.\n\nPenal Code section 987.9 provides in pertinent part: \"In the trial of a capital case . . . the indigent defendant, through the defendant's counsel, may request the court for funds for the specific payment of investigators, experts, and others for the preparation or presentation of the defense. . . . The fact that an application has been made shall be confidential and the contents of the application shall be confidential. Upon receipt of an application, a Judge of the court, other than the trial Judge presiding over the case in question, shall rule on the reasonableness of the request and shall disburse an appropriate amount of money to the defendant's attorney. The ruling on the reasonableness of the request shall be made at an in camera hearing. . . .\"\n\nPrior to trial, specifically on January 17, 1989, through appointed defense counsel W. Bradley Holmes and Hayes H. Gable III, defendant filed a confidential application in the superior court for authorization to incur expenses, in an amount not to exceed $9,726, for the payment of investigators to make a trip to Cuba in order to compile his social history in aid of a defense at the expected penalty phase. In a supporting declaration, Attorney Gable stated that he proposed to send to Cuba Rodrigo Mayorga, a \"Spanish-speaking attorney with many years of criminal law experience,\" and David Myers, a \"certified Spanish-English interpreter\" and investigator; he estimated that their trip would take about 14 days; he based his estimate \"upon the understanding that there will be a delay in Mexico City\"-- there being no direct travel between the United States and Cuba--because \"the necessary visas\" would have to be obtained and \"air travel to Cuba is restricted to twice a week.\" The application was assigned to Judge Cecily Bond. Judge Darrel W. Lewis presided over defendant's case.\n\nOn January 18, following a hearing in camera, Judge Bond granted the application for authorization to incur expenses for the trip to Cuba by Mayorga and Myers. She did so subject to the condition that expenses were not actually to be incurred before the cause was assigned to a courtroom, on the chance--which turned out not to eventuate--that the prosecutor, Patrick Marlette, might decline to seek the death penalty as part of a negotiated Disposition.\n\nOn June 13, Judge Lewis met with Prosecutor Marlette and Attorneys Holmes and Gable to schedule the commencement of the penalty phase. (The guilt phase had closed on June 9 when the jury rendered its verdicts and made its findings.)\n\nAttorney Holmes requested a date around July 3. Attorney Gable explained: \"Of major concern, your Honor, to us, is ascertaining whether or not we're going to be able to send\" Mayorga and Myers, \"who have already been [ sic ], funds have already been approved for this purpose some time ago, to Cuba. We've had numerous assurances from [the] Cuban government that we would be allowed to go there. We started our attempts to get down there to gather information regarding [defendant's] background at the time that we were first assigned to this courtroom, . . . in February . . . .\" \"e had thought we'd have this problem licked . . . about a month ago. In fact, we got the people all the way to Mexico City before we found out that the Cuban government decided to throw a roadblock in our way again . . . .\"\n\nTo accommodate his schedule, Judge Lewis suggested a date of July 10. Asked his position, Prosecutor Marlette stated, inter alia, that \"I have a general objection to a delay of that long, and I realize how much or how little weight that will carry in light of the defense concerns.\"\n\nJudge Lewis inquired: \"Let me ask, when do you expect to get some sort of a definitive answer on whether you're going to get into Cuba?\"\n\nAttorney Holmes responded: \"This thing has literally been going on for weeks now. I think Mr. Mayorga has been in almost daily phone contact with these people, at least the last two weeks, and at one point I thought I could have predicted the date they were going to say yes, yes you can have your special visa and away you go. At this point I really think they're doing everything they can do [to] discourage us from getting in at all. I can't really answer your question, and it could be tomorrow, could be three months from now.\"\n\nAttorney Gable added: \"Your Honor, . . . we really can't offer the Court any kind of definitive deadline or time limit on when we might hear something from the Cuban government. We're kind of hoping since they know this really is a penalty phase of the trial, and it really is happening, that they might be moved to grant us access to records and individuals there in Cuba . . . .\"\n\nThereupon, Judge Lewis set the date for July 10. In so doing, he offered: \"f there's anything you feel I can do to assist the defense, maybe just by simply stating that the case will proceed on July the 10th, regardless of whether you are allowed to get into Cuba or not, may be the most beneficial thing the Court can do.\" ATTORNEY GABLE REPLIED: \"If we could ever get some sort of response from the Cuban government to even know that they're alive down there, we would certainly come to the Court, and if that was something that they wanted, but as it is right now, it's just a question of going through, quote, diplomatic channels and see what we can do.\"\n\nOn June 16, again meeting with Prosecutor Marlette and Attorneys Holmes and Gable, Judge Lewis rescheduled the commencement of the penalty phase to June 26 on his own motion, in large part because he believed that July 10 was too far away. In response to an invitation, Attorney Gable stated that he was \"prepared to make an offer of proof in camera regarding the necessity of continuing the start of the defense presentation of mitigating circumstances until the 10th\" or \"until at least . . . the 6th or so.\" Asked subsequently whether he would be able to proceed on July 5, he answered that he believed he would. Judge Lewis then ordered the People's case to open on June 26 and defendant's to open on July 5. Attorney Gable stated for the record that, \"as a result of the roadblocks that have been placed in the way of us getting to Cuba,\" \"I don't want the Court to feel that I'm representing and guaranteeing right now that the [5th] is solid and we're going to be ready to go . . . .\" He reiterated that he was prepared to make an offer of proof in camera. Judge Lewis asked him to do so.\n\nIn camera, Attorney Gable represented in substance that he and Attorney Holmes were continuing to experience \"difficulty securing passage to Cuba\" for Mayorga and Myers \"to gather relevant mitigating evidence,\" and were exploring alternative means to obtain such evidence. Judge Lewis asked, \"What type of evidence do you want to bring from Cuba?\" He answered, \"he type of evidence that we would love to bring from Cuba is the actual testimony of family members and records from schools that [defendant] has attended, and any friends that he had back there. It's just the typical kind of evidence that we would be presented [ sic ] in any penalty phase of a capital case, the evidence of past good acts, of love and affection shown to parents, and also of the type of childhood that [defendant] had . . . .\" HE ADDED: \"We have no real hopes of being able to subpoena, if you will, people from Cuba to come and testify here, but what we had intended to do all along was send a team down to Cuba, armed with video recorders, and interview these people, and the hope was that we would conduct a sufficiently reliable interview that we would be able to present the interview at the penalty phase under the authority of\" Green v. Georgia (1979) 442 U.S. 95, 97 [60 L. Ed. 2d 738, 741, 99 S. Ct. 2150]--which held in a per curiam opinion that, \"under the facts of [that] case,\" the exclusion of certain evidence \"constituted a violation of the Due Process Clause of the Fourteenth Amendment,\" even if it was barred by the state's hearsay rule, because it \"was highly relevant to a critical issue in the punishment phase of the trial\" and \"substantial reasons existed to assume its reliability.\" Judge Lewis expressed his view that \"you'd have great difficulty having the Court deem reliable, just a statement by an ordinary person, particularly a family member or a relative who obviously has an interest in the case.\"\n\nOn June 26, the penalty phase commenced. The People opened their case. Later that same day, having been granted leave to reopen to call a possible witness, they rested. At the close of the session, Judge Lewis asked: \"Does the defense feel any need to have any further Discussions in camera regarding your case?\" ATTORNEY GABLE ANSWERED: \"Not at this time . . . . I think that the prosecutor is well aware that we're trying to gather information from [defendant's] homeland, and in fact, it appears that although we may not be able to send people down there ourselves, that we have made some contacts in Cuba, to where they can go and locate some of the family . . . .\"\n\nOn July 5, with the People not seeking to reopen their case and stating again that they rested, defendant opened his case. At the close of the session, Attorney Gable informed Judge Lewis and Prosecutor Marlette that he and Attorney Holmes had an \"expert\" \"going to Cuba\" \"[r]ight around the 10th.\" Judge Lewis called for \"a more thorough offer [of] proof.\" ATTORNEY GABLE RESPONDED: \"The expert is an expert in the field of cultural anthropology with a specific expertise in the area of Cuba, having received a math or science degree at the University of Havana in cultural anthropology, and this individual has conducted extensive interviews with [defendant] already and has now the basis to obtain additional information in Cuba, regarding [defendant's] upbringing, and will be offering her opinions as an expert qualified in cultural anthropology.\" JUDGE LEWIS COMMENTED: \"t some point, we're gonna have to disclose a certain amount to the prosecution to make it so that I can make some predetermination as to whether or not it's even necessary to have this witness, because somewhat for cost, but more so for time and timing, it[']s useless to send somebody to Cuba and postpone this trial for an entire week and a half just to find out this person is not going to be able to testify . . . .\" ATTORNEY GABLE REPLIED: \"I can just say that in the past I've used psychologists, sociologists and anthropologists to testify regarding the facets of the background of the defendant, and that's what it's being offered for. In other words, the expert can offer an opinion regarding the individual, based upon background information, of course, . . . and that's the type of evidence that this witness would be offering.\" Judge Lewis inquired further in camera. Attorney Gable offered to make the \"expert\" available the next day for in camera examination. Judge Lewis accepted.\n\nOn July 6, Judge Lewis conducted a hearing in camera. Taking the witness stand on voir dire was Gail McGarrity. McGarrity testified, inter alia, that she was a candidate for the degree of doctor of philosophy in anthropology at the University of California at Berkeley; she specialized generally in cultural anthropology and specifically in \"ethno medicine [ sic ], ethno psychiatry [ sic ], . . . nutritional anthropology and medical anthropology\" in Latin America; she had lived and studied in Cuba, and was fluent in Spanish; she had undertaken to compile defendant's social history; to that end, she had interviewed defendant on a number of occasions; because he had \"memory gaps,\" she needed to communicate with persons who knew him as a child and youth in Cuba; moreover, she needed to do so in person because, \"given the fact that Cuba and the United States have such poor relations, it's not easy to telephone there or get letters back and forth\"; having lived and studied in Cuba, \"it's very easy for me to move around\" there \"and not have to go through officials channels, 'cause that's the most difficult way,\" especially for an American; she would attempt to leave for Cuba on July 10 or 12, and to return a week to 10 days later, but was uncertain of success; she would pose as a tourist, lest she arouse any suspicion on the part of the Cuban government that she was \"up to something political\"; she would \"travel[] with an investigator who would have a video camera.\" Attorney Gable requested to continue her appearance as a witness in defendant's case until July 24. Judge Lewis expressed concern about the delay. Attorney Gable stated that he and Attorney Holmes considered the Cuban trip important, and had been attempting to send investigators there for a long time. Judge Lewis asked, \"What's the cost involved?\" Attorney Gable answered, \"That's already been approved . . . .\" Judge Lewis told him to \"see what you can get done,\" and put off a decision on his request to continue McGarrity's appearance.\n\nLater on July 6, Judge Lewis met with Attorneys Holmes and Gable in the presence of Prosecutor Marlette. Attorney Gable stated that the \"expert\"--meaning McGarrity--had \"a confirmed flight to Mexico City on the 11th, the tour is set, . . . the flight [is] to leave from Mexico City on the 15th, the return to Mexico City into the United States is on the 22nd . . . .\" Judge Lewis asked, \"Why is she going down to Mexico on the 11th, . . . is she going to be paid this whole time, and if so, why is she going down five days or four days before?\" Attorney Gable answered, \"It's a tour package, that's how you have to do it. You have to get there three days in advance, you have to go to the Cuban Embassy and get your passports in order, that's just the way that they set it up.\"\n\nOn July 10, Judge Bond conducted a hearing in camera with Attorneys Holmes and Gable to inquire into the trip to Cuba by Mayorga and Myers for which she had authorized defendant to incur expenses.\n\nJudge Bond acted on her own motion, in response to a communication by Judge Lewis, who she said \"was very unsatisfied with the need to go to Cuba\": \"He . . . wanted to know whether I had authorized any trip or not, and I told him that I had. But then he told me that this trip had been changed rather substantially since . . . when I authorized it.\" Specifically, she had learned from him that an \"anthropologist,\" namely, McGarrity, was to go in place of Mayorga and Myers: \"I didn't approve that, and you didn't come in and ask for any change in approval.\"\n\nAttorney Gable attempted to explain: Mayorga and Myers \"got all the way to Mexico City and were turned back by the Cuban government for reasons that had to do, I think, primarily with the fact that . . . they advised them what they were actually going down there for\"; \"since that time they have been trying to get back down there, . . . and all to no avail\"; they were each now \"persona non grata\"; in the meantime, he and Attorney Holmes hired McGarrity to compile defendant's social history; they subsequently decided to send her to Cuba with an interpreter with the given name of Patricia--her surname was later identified as Santivanias--who had been recommended by Myers ; \"apparently the [main] interpreter that we have for [defendant],\" Carmen Krewson, \"got in a snit over the fact that she couldn't go to Cuba,\" and \"went to Gladys Cook,\" who was the coordinator of Spanish-English interpreters in the interpreter's office, \"and told her some tale . . . that these people were just going down there to go on vacation\"; \"[t]he first thing I knew about it, I got a call from the newspapers, apparently Gladys Cook called all the newspapers, called the district attorney, and this is all supposed to be confidential, I might add, and apparently went and talked to Judge Lewis ex parte.\"\n\nJudge Bond commented: \"hat was alarming, I think, to Judge Lewis, and the reason he called me just to have me handle the matter was, as I understand it, they were going to go to Mexico and they're going to be there for four or five days.\"\n\nAttorney Gable responded: \"No. And this is the thing that I think was prompted by\" interpreters Krewson and Cook. He went on to explain that \"you have to spend at least two days\" in Mexico City \"to acquire the visa from the Cuban Embassy.\"\n\nJudge Bond then asked, \"What connection is there with some kind of vacation tour . . . [?]\"\n\nAttorney Gable responded, \"It's not exactly a vacation tour. It's a package put together to take people who are interested in going to Cuba . . . .\" He made plain that the tour in question was simply a \"cover[]\" under which McGarrity and Santivanias would be able to enter Cuba. He also made plain that they would be able to enter Cuba only under such a \"cover\": \"That's the only way we can do it.\"\n\nJudge Bond stated: \"hat you're really telling me is that they're going to go in under a subterfuge. I never authorized that. I did authorize, initially, Mr. Mayorga and Mr. Myers to go there aboveboard for the purpose for which they're being sent. I did not authorize anybody to create some sort of subterfuge to get into a country which we do not have any relations [with] on false pretenses and then go off and do investigations.\" \"I never authorized anyone to do any subterfuge to get into another country.\" \"I did not authorize anyone ever to join up with a tour for some purpose which is not in fact the true purpose in order to gain entrance to Cuba so they could then go off and do their own investigation.\"\n\nJudge Bond went on: \"Now the way you have this set up, it's a subterfuge, and I just don't think the Court or the state ought to be a party to that. You're talking about an international incident here. You're not talking about . . . going into Georgia. You're talking about going into a foreign country, with which the United States does not have diplomatic relations, under a guise that's not true. And . . . I just can't authorize that. I'm not going to do that.\" \"hen I authorized this originally . . . I was within that ambit of authority to give you authorization to do it straightforwardly, but I am not going to allow this Court or the state to be drawn into what is in effect a subterfuge in a foreign government. I mean, you're talking about an international incident, potentially, there. What if these people get arrested while they're there? What kind of protection are they going to have?\" \"It's not up to the Superior Court of Sacramento County to start making foreign policy decisions for the United States.\"\n\nJudge Bond reiterated, \"ou had an obligation to come to me and tell me this has changed because what I authorized is not what you were intending to do. I did not authorize you to go in in some surreptitious manner.\"\n\nAttorney Gable replied, \"I couldn't do that because I was going to be a little concerned about making the Court a party.\"\n\nJudge Bond stated, \"his Court can't be party to some sort of subterfuge.\"\n\nAttorney Gable responded, \"I know that. And I wouldn't ask you to be party to some kind of subterfuge, either.\"\n\nJudge Bond proceeded to withdraw authorization to incur expenses for a trip to Cuba: \"I can't authorize you to do it the way you're going to do it . . . .\"\n\nIn the wake of Judge Bond's ruling, defendant moved Judge Lewis to recuse the interpreter's office on the ground that it had committed misconduct by improperly disclosing information about the trip to Cuba by McGarrity and Santivanias. Defendant also moved Judge Lewis to declare a mistrial and, later, to preclude the People from seeking the death penalty and to sentence him to a term of imprisonment for life without possibility of parole. For purposes of these motions, defendant moved Judge Lewis to order an evidentiary hearing, and also to recuse himself and Prosecutor Marlette, and to appoint new counsel for him in place of Attorneys Holmes and Gable, on the ground that each of the identified persons might be called to testify at such a hearing as a witness. For these same purposes, defendant assumed that Judge Bond's ruling withdrawing authorization to incur expenses for a trip to Cuba was not erroneous. After an evidentiary hearing at which he presided and in which Attorneys Holmes and Gable and Prosecutor Marlette participated, Judge Lewis denied all the motions. In the course thereof, he determined, inter alia, that neither he nor Judge Bond had committed judicial misconduct. He also determined that, even if the interpreter's office had committed misconduct through an improper disclosure, defendant was not entitled to the relief he sought. Moreover, he barred him from using the evidentiary hearing as an investigative tool to identify which interpreter or interpreters, if any, actually made any improper disclosure.\n\nInterpreter Krewson did not further assist defendant during the proceedings. McGarrity and Santivanias were unable to make a trip to Cuba. By means including a telephonic interview with defendant's father in Cuba, McGarrity compiled his social history. In the presence of the jury, she testified to her opinion, as a cultural anthropologist, on matters concerning his background and character in Cuba, and expressed the view that he suffered from conditions including \"profound emotional immaturity\" and \"extreme culture shock.\" In so doing, she stated that she had been unable to go to Cuba to conduct an investigation and hence had been unable to corroborate certain information on which she relied.\n\nDefendant now presents a number of contentions relating to his application for authorization to incur expenses for a trip to Cuba.\n\nAt the threshold, defendant claims that Judge Bond erred by withdrawing authorization to incur expenses for the trip to Cuba by McGarrity and Santivanias.\n\nAn appellate court reviews a trial court's ruling on an application for authorization to incur expenses to prepare or present a defense for abuse of discretion. (See, e.g., People v. Daniels (1991) 52 Cal. 3d 815, 851 [277 Cal. Rptr. 122, 802 P.2d 906]; People v. Mattson (1990) 50 Cal. 3d 826, 847 [268 Cal. Rptr. 802, 789 P.2d 983].)\n\nWe find no such abuse here. Judge Bond was not unreasonable in authorizing the \"aboveboard\" trip to Cuba by Mayorga and Myers, of which she had been informed, for the purpose of compiling defendant's social history: The end was proper and so were the means. But neither was she unreasonable in withdrawing authorization for the \"surreptitious\" trip to Cuba by McGarrity and Santivanias, of which she had not been informed: although the end remained proper, the means had become otherwise, threatening harm to international relations and also to the two travelers. Defendant argues in substance that, at least on the facts of a case like this, a Judge may not withdraw authorization for improper means. Because he did not offer such an argument below--indeed, Attorney Gable agreed that a Judge could do so--he may not offer any to that effect here. He also argues that Judge Bond did not in fact withdraw authorization for improper means, but did so for her own improper reasons. The record on appeal is otherwise.\n\nEven if error had occurred, it would not entail reversal. It is the general rule for error under California law bearing on the penalty of death--which includes the one asserted here--that reversal requires prejudice and prejudice in turn requires a reasonable possibility of an effect on the outcome under People v. Brown (1988) 46 Cal. 3d 432 [250 Cal. Rptr. 604, 758 P.2d 1135]. ( People v. Ashmus, (supra) , 54 Cal. 3d at p. 983; People v. Gordon, (supra) , 50 Cal. 3d at p. 1267.) No such possibility appears as a result of the withdrawal of authorization to incur expenses for a trip to Cuba. McGarrity herself stated that she was uncertain of success. Hence, it is merely conjectural whether McGarrity and Santivanias would have made it to Cuba, and if so, whether they would have discovered more favorable information than what McGarrity had already obtained, as through her telephonic interview with defendant's father in Cuba, and if so, whether they would have made it back to the United States in a timely fashion. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nDefendant also claims, in effect, that the interpreter's office committed misconduct by improperly disclosing information about the trip to Cuba by McGarrity and Santivanias. It is improper for an interpreter to disclose information reflecting \"privileged communications between counsel and client.\" (Cal. Standards Jud. Admin., § 18.3(c).) Judge Lewis impliedly assumed that at least one interpreter had indeed improperly disclosed information of this sort. We shall expressly do the same.\n\nWe cannot conclude, however, that any improper disclosure would require reversal. We believe that a defect of this sort is subject to the general rule for error under California law that reversal requires prejudice. When, as here, it bears on the penalty of death, prejudice requires a reasonable possibility of an effect on the outcome. No such possibility appears. Attorneys Holmes and Gable had themselves disclosed to Judge Lewis and Prosecutor Marlette a significant part of the information concerning the trip to Cuba by McGarrity and Santivanias. Although revealing varied misconceptions and resentments, the interpreter who we assume made an improper disclosure disclosed nothing of substance other than the names of the travelers. That fact, however, was inconsequential. Indeed, while they were still pursuing the trip to Cuba by Mayorga and Myers, Attorneys Holmes and Gable had themselves disclosed their names.\n\nWe do not ignore the fact that Judges Lewis and Bond initially looked with disfavor on Attorneys Holmes and Gable as a result of what we assume to be the improper disclosure by at least one interpreter of information about the trip to Cuba by McGarrity and Santivanias. We agree with defendant that the Judges appear to have falsely believed that the attorneys were \"misusing court-approved funds.\" We also agree that they may consequently have doubted their \"credibility.\" For example, Judge Lewis admitted that he had thought that \"it seemed like this could be a boondoggle,\" and might have told Judge Bond \"something like this sounds like a county paid vacation.\"\n\nBut the disfavor of Judges Lewis and Bond toward Attorneys Holmes and Gable passed as the Judges learned of the difficulties the attorneys faced. Judge Lewis told them that he recognized that they found themselves in a \"very frustrating\" situation, and that he did \"not doubt[] the good faith of either of you.\" For his part, Judge Lewis stated: \"rom now what I understand about the situation,\" \"I'm of the opinion that you have done nothing wrong . . . .\" \"Your credibility before this Court is just as high as it has ever been, which is high, I must say . . . .\"\n\nNeither do we ignore the fact that what we assume to be the improper disclosure by at least one interpreter of information about the trip to Cuba by McGarrity and Santivanias might have had a \"chilling effect\" ( Barber v. Municipal Court (1979) 24 Cal. 3d 742, 753 [157 Cal. Rptr. 658, 598 P.2d 818]) on communications between defendant and Attorneys Holmes and Gable, and indeed on their relationship. But even a reasonable possibility of an effect on attorney-client communications or even the attorney-client relationship--which we do not discern here--does not amount to a reasonable possibility of an effect on the outcome. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nDefendant next claims that Judge Lewis erred by determining that neither he nor Judge Bond committed judicial misconduct by communicating between themselves about his application for authorization to incur expenses for a trip to Cuba. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\n\nAny such judicial misconduct would not entail reversal. A defect of this sort is subject to the general rule for error under California law that reversal requires prejudice. ( People v. Anderson (1987) 43 Cal. 3d 1104, 1133-1134 [240 Cal. Rptr. 585, 742 P.2d 1306].) When, as here, it bears on the penalty of death, prejudice requires a reasonable possibility of an effect on the outcome. No such possibility appears. \"The fundamental . . . harm\" threatened in this situation is \"the disclosure of potentially significant information to the prosecution.\" ( Id. at p. 1134.) There was no disclosure of this kind. Even before Judges Lewis and Bond communicated between themselves about defendant's application for authorization to incur expenses for a trip to Cuba, Attorneys Holmes and Gable had themselves disclosed its existence and substance to Prosecutor Marlette. Defendant argues that the communications in question had a \"tendency . . . to deprive [him] of the right to challenge 'questionable facts or opinions' . . . .\" The tendency, however, did not result in a deprivation. Judges Lewis and Bond themselves brought the communications to light. Defendant then exercised his \"right,\" and mounted a successful \"challenge.\" It is true that the communications between Judges Lewis and Bond resulted in the withdrawal of authorization to incur expenses for a trip to Cuba. But, as explained above, such withdrawal of authorization did not affect the outcome within a reasonable possibility. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nDefendant then claims that Judge Lewis erred by denying his motion to recuse himself from his other motions relating to his application for authorization to incur expenses for a trip to Cuba.\n\nAs a general matter, an appellate court reviews a trial court's ruling on a recusal motion for abuse of discretion. (Cf. 2 Childress \u0026 Davis, Federal Standards of Review, (supra) , § 12.05, pp. 12-35 to 12-40 [setting forth the standard of review under federal law].)\n\nNo such abuse appears. Judge Lewis was not unreasonable in declining to recuse himself. Certainly, he was not required to do so. Defendant argues to the contrary. He asserts that Judge Lewis had \"personal knowledge of disputed evidentiary facts concerning the proceeding\" (Code Civ. Proc., § 170.1, subd. (a)(1))--including whether he and Judge Bond communicated about his application for authorization to incur expenses for a trip to Cuba--and hence might, and indeed did, serve as a \"de facto\" witness. Judge Lewis cannot be deemed to have had \"personal knowledge of disputed evidentiary facts\": he removed such facts from dispute by resolving them for present purposes in defendant's favor, as through his implicit concession that he and Judge Bond communicated about the application. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nDefendant also claims that Judge Lewis erred by barring him from using the evidentiary hearing as an investigative tool to identify which interpreter or interpreters, if any, actually made any improper disclosure about the trip to Cuba by McGarrity and Santivanias.\n\nAs a general matter, an appellate court reviews a trial court's ruling as to the conduct of a hearing for abuse of discretion. (See Erreca's v. Superior Court (1993) 19 Cal. App. 4th 1475, 1494 [24 Cal. Rptr. 2d 156]; cf. 1 Childress \u0026 Davis, Federal Standards of Review, (supra) , § 4.08, pp. 4-50 to 4-61 [setting forth the standard of review under federal law].)\n\nAgain, no such abuse appears. Judge Lewis was not unreasonable in barring defendant from using the evidentiary hearing as an investigative tool to identify which interpreter or interpreters, if any, actually made any improper disclosure. Judge Lewis's concern was whether defendant was entitled to the relief he sought--not with whether any interpreter deserved discipline. Defendant argues that, had he been permitted to proceed as he wished, he might have been able to ensure against the possibility of a similar improper disclosure in the future. He may well be right. But he shows only that Judge Lewis might not have been unreasonable if he had made a different decision. He does not show that he was unreasonable in making the decision he did. This is especially true since Attorneys Holmes and Gable expressed a firm belief that it was interpreters Krewson and Cook who were to blame, and presumably took appropriate precautions against them for the future.\n\nDefendant then claims that Judge Lewis erred by failing to require Prosecutor Marlette to testify, sua sponte, as to his receipt of what we assume to be the improper disclosure by at least one interpreter of information about the trip to Cuba by McGarrity and Santivanias. We disagree. Defendant's premise is that Judge Lewis was under a duty to demand such testimony, even in the absence of a request. It is unsupported. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\n\nUnderlying all the foregoing points urged by defendant is a broad and somewhat undefined claim of violation of the right to the assistance of counsel granted him by the Sixth Amendment to the United States Constitution.\n\nA defendant's Sixth Amendment right to the assistance of counsel includes a right to effective assistance. (E.g., People v. Ledesma , (supra) , 43 Cal. 3d at p. 215.) For present purposes, \"counsel\" may embrace an attorney's agent, such as an interpreter. (See Chacon v. Wood (9th Cir. 1994) 36 F.3d 1459, 1463-1465.)\n\nTo establish ineffective assistance of counsel entitling him to relief, a defendant must demonstrate that counsel performed deficiently under an objective standard of professional reasonableness and thereby caused prejudice under a test of reasonable probability of an effect on the outcome. (E.g., People v. Ledesma, (supra) , 43 Cal. 3d at pp. 215-218.)\n\nDefendant expressly attempts to establish ineffective assistance of counsel. He fails. We shall assume for argument's sake that there was deficient performance on the part of at least one interpreter. (There would be no basis for a similar assumption about either Attorney Holmes or Attorney Gable.) We cannot, however, find prejudice. There is no reasonable probability of an effect on the outcome as a result of the withdrawal of authorization to incur expenses for a trip to Cuba. That is because, as explained above, there is no reasonable possibility: with McGarrity herself stating that she was uncertain of success, it is merely conjectural whether McGarrity and Santivanias would have made it to Cuba, and if so, whether they would have discovered substantially more favorable information than what McGarrity had already obtained, as through her telephonic interview with defendant's father in Cuba, and if so, whether they would have made it back to the United States in a timely fashion. Neither is there any reasonable probability of an effect on the outcome on any other basis.\n\nA defendant's Sixth Amendment right to the assistance of counsel also includes a right to loyal assistance. (See, e.g., People v. Bonin (1989) 47 Cal. 3d 808, 834 [254 Cal. Rptr. 298, 765 P.2d 460] [holding that included in the right to counsel \"is 'a correlative right to representation that is free from conflicts of interest . . .' \"].) For these purposes too, \"counsel\" may embrace an attorney's agent, such as an interpreter.\n\nTo establish \"disloyal\" assistance of counsel entitling him to relief, a defendant must demonstrate that counsel served an interest other than his (see Cuyler v. Sullivan (1980) 446 U.S. 335, 350 [64 L. Ed. 2d 333, 347-348, 100 S. Ct. 1708] [considering the right to conflict-free counsel]; People v. Bonin, (supra) , 47 Cal. 3d at pp. 834-835 [same]), and that, in so doing, \"counsel 'pulled his punches,' i.e., failed to represent [him] as vigorously as he might have\" otherwise ( People v. Easley (1988) 46 Cal. 3d 712, 725 [250 Cal. Rptr. 855, 759 P.2d 490] [same]).\n\nDefendant does not expressly attempt to establish \"disloyal\" assistance of counsel. He speaks much about an \"invasion[] of the defense camp\" by the state ( Barber v. Municipal Court, (supra) , 24 Cal. 3d at p. 760 (conc. and dis. opn. of Manuel, J.); accord, United States v. Mastroianni (1st Cir. 1984) 749 F.2d 900, 906 [\"intrusion\"]; United States v. Seale (7th Cir. 1972) 461 F.2d 345, 364 [same]), which assertedly requires automatic reversal or at least raises a presumption of prejudice. He does so inappropriately. There was no true \"invasion\" or \"intrusion\" into the \"defense camp.\" Rather, as he himself recognizes at times, there was simply a \"leak\" therefrom. Beneath his talk about \"invasion\" and \"intrusion,\" he impliedly attempts to establish \"disloyal\" assistance of counsel. Here, too, he fails. We shall assume for argument's sake that at least one interpreter served an interest other than his. (Here, too, there would be no basis for a similar assumption about either Attorney Holmes or Attorney Gable.) We cannot, however, find any \"pulling\" of \"punches.\" The record on appeal is simply barren of any indication thereof.\n\n2. Ineffective Assistance of Counsel\n\nIn his case, defendant called Gail McGarrity to the witness stand. As noted, she testified to her opinion, as a cultural anthropologist, on matters concerning his background and character in Cuba, and expressed the view that he suffered from conditions including \"profound emotional immaturity\" and \"extreme culture shock.\" In so doing, she stated that she had been unable to go to Cuba to conduct an investigation and hence had been unable to corroborate certain information on which she relied. As she was relating certain out-of-court statements on direct examination by Attorney Gable, Prosecutor Marlette made a hearsay objection and requested the superior court to instruct the jury that it could not consider any such statement for its truth. Attorney Gable declared that he was not offering statements of that sort for that purpose, but solely to reveal the basis of her opinion. He also declared that he did not object to the instruction requested. The superior court largely overruled the hearsay objection, and instructed the jury that it could not consider any out-of-court statement she related for its truth, but only as a basis for her opinion. Attorney Gable completed the direct examination. Prosecutor Marlette then subjected her to cross-examination. After she left the stand, he moved the superior court to \"withdraw\" the instruction it had given at his request, and to instruct the jury instead that it could consider any out-of-court statement she related for its truth. The superior court declared that it would do so only if defense counsel stipulated. They refused. It effectively denied the motion.\n\nComplaining of defense counsel's refusal to stipulate to Prosecutor Marlette's motion, defendant contends that he was provided with ineffective assistance of counsel in violation of the Sixth Amendment. We disagree.\n\nDefendant does not demonstrate either deficient performance or prejudice. As to the absence of deficient performance: Evidently, Prosecutor Marlette made his motion in order to prevent the jury from drawing any inference favorable to defendant or adverse to the People based on McGarrity's inability to go to Cuba to conduct an investigation and her consequent inability to corroborate certain information on which she relied. Without offending any objective standard of professional reasonableness, defense counsel could have refused to stipulate, and apparently did refuse to stipulate, in order to allow the jury to draw precisely such an inference. Of course, they had to pay a price for their refusal: They had to give up an opportunity to use the out-of-court statements she related for their truth. The price, however, was not too high: the statements in question had little independent mitigating weight, coming as they did largely from defendant himself, who was affected by self-interest. As to the absence of prejudice: There is no reasonable probability of an effect on the outcome. By giving up an opportunity to use these statements for their truth, they gave up little. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\n3. Prosecutorial Misconduct\n\nIn the course of his summation, the prosecutor made comments characterizing defendant, including remarks to the effect that he was a \"creep,\" was worse than a \"predator[]\" because he \"enjoy[ed] . . . unnecessary violence,\" was \"your worst nightmare, . . . society's worst nightmare.\" Defendant objected to such comments as \"disparaging.\" Finding in substance that the remarks were not \"[i]nflaming the jury,\" the superior court overruled the objection.\n\nDefendant contends in substance that the superior court erred by effectively determining that the prosecutor did not commit misconduct.\n\nAs a general matter, an appellate court reviews a trial court's ruling on prosecutorial misconduct for abuse of discretion.\n\nThere was no such abuse here. The superior court was not unreasonable in effectively determining that the prosecutor did not commit misconduct. For it was not unreasonable in impliedly finding that he did not use any method of persuasion that may be deemed deceptive or reprehensible, including inflammatory comments. Such remarks as those quoted above did indeed characterize defendant in negative terms. Although perhaps unnecessarily colorful, they were consistent with the evidence. Hence, they were not improper. (See, e.g., People v. Berryman, (supra) , 6 Cal. 4th at p. 1076.) Defendant argues that \"the prosecutor in fact was testifying on behalf of his recommendation of death.\" The assertion is unsupported. It may be rejected out of hand.\n\n4. Request for an Instruction Not to Consider Guilt Phase Evidence\n\nIn the course of the penalty phase, the superior court discharged two of the jurors who had sat on the jury when it rendered its verdicts and made its findings at the guilt phase, and put two alternates in their place. By stipulation of the People and defendant, it discharged one because of unavoidable scheduling conflicts. By necessity, it discharged the other because of death.\n\nDefendant moved the superior court to instruct the jury not to consider the guilt phase evidence. He relied on Penal Code section 190.4, subdivision (d), which provides that, \"[i]n any case in which the defendant may be subject to the death penalty, evidence presented at any prior phase of the trial . . . shall be considered at any subsequent phase of the trial, if the trier of fact of the prior phase is the same trier of fact at the subsequent phase.\" The superior court refused.\n\nDefendant contends that the superior court erred thereby.\n\nAgainst a claim of this kind, which involves the determination of applicable legal principles, an appellate court reviews a trial court's instruction independently.\n\nAfter such review, we find no error. Penal Code section 190.4, subdivision (d), declares in substance that, if the trier of fact at the penalty phase is the same as that at the guilt phase, it must consider the guilt phase evidence. Here, the trier of fact at the penalty phase was the same as that at the guilt phase. It was a jury. Indeed, it was the same jury: it was not rendered otherwise by the substitution of jurors with alternates. (See People v. Green (1971) 15 Cal. App. 3d 524, 528 [93 Cal. Rptr. 84].) It therefore had to consider the guilt phase evidence. Had it been instructed not to, as requested by defendant, error would have been committed.\n\n5. Instruction on Bias and Prejudice\n\nDefendant contends that the superior court erred by delivering an instruction that he asserts was \"virtually identical\" to the \"no pity\" instruction held to be erroneous in People v. Easley (1983) 34 Cal. 3d 858, 875-876 [196 Cal. Rptr. 309, 671 P.2d 813]: \" 'As jurors, you must not be influenced by pity for a defendant . . . .' \"\n\nHere too, against a claim that involves the determination of applicable legal principles, an appellate court reviews a trial court's instruction independently.\n\nHere too, we find no error. In accordance with the pattern instruction set out as CALJIC No. 8.84.1 (1989 new) (5th ed. pocket pt.), the superior court told the jury, in pertinent part, that \"[y]ou must neither be inf[l]uenced by bias or prejudice against the defendant . . . .\" This is the instruction that defendant challenges. It plainly survives his attack. For it plainly does not admonish against pity. It is true that the reporter's transcript originally presented the language in question as \"pity as or prejudice.\" But it was subsequently corrected to replace the meaningless \"pity as\" with \"bias.\"\n\n6. Instruction on the \"Circumstances of the Crime\"\n\nIn accordance with the pattern instruction set out as CALJIC No. 8.85 (5th ed. 1988)--and ultimately with Penal Code section 190.3--the superior court told the jury that, in choosing between the penalty of death and life imprisonment without possibility of parole, it should be guided by certain factors, if applicable, including \"[t]he circumstances of the crime of which the defendant was convicted in the present proceeding . . . .\"\n\nDefendant contends that the superior court erred by delivering its instruction on the \"circumstances of the crime.\"\n\nHere too, against a claim that involves the determination of applicable legal principles, an appellate court reviews a trial court's instruction independently.\n\nHere too, we find no error. Penal Code section 190.3 impliedly requires a superior court to instruct \"on any factor that is applicable on the record of the individual case\" ( People v. Marshall (1990) 50 Cal. 3d 907, 932-933 [269 Cal. Rptr. 269, 790 P.2d 676], italics omitted)--which always and everywhere includes the \"circumstances of the crime.\" The superior court here complied. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nDefendant argues that the superior court should have clarified its instruction on the \"circumstances of the crime\" (1) to specify that the \"crime\" referred to was the capital offense involving the murder of Allen Birkman, and (2) to state \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e that its \"circumstances\" did not embrace the rape of Sandra S., which was assertedly unrelated. Had he desired such a clarification, he should have requested it of the superior court. He made no request of this sort below. Hence, he may not raise a complaint here. \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\n7. Application for Modification of the Verdict of Death\n\nDefendant made an application for modification of the verdict of death under Penal Code section 190.4, subdivision (e). After a hearing, the superior court denied the request.\n\nDefendant contends that the superior court erred thereby.\n\nWe review a superior court's ruling on a verdict-modification application independently. (E.g., People v. Berryman, (supra) , 6 Cal. 4th at p. 1106.)\n\nAfter such review, we find no error. The superior court did all it was required to do. That is to say, it effectively \"review[ed] the evidence\"; \"consider[ed], [took] into account, and [was] guided by the aggravating and mitigating circumstances\"; \"ma[d]e a determination\" that \"the jury's findings and verdicts\" were not \"contrary to law or the evidence presented\"; \"state[d] on the record the reasons for [its] findings,\" and also \"set forth the reasons for [its] ruling\" and \"direct[ed] that they be entered on the Clerk's minutes\" (Pen. Code, § 190.4, subd. (e)).\n\nIn arguing to the contrary, defendant makes a \"formal\" challenge. He attacks on four fronts.\n\nFirst, defendant asserts that, before making its ruling on his verdict-modification application, the superior court read a probation report, and thereby failed to anticipate our statement in People v. Lewis (1990) 50 Cal. 3d 262, 287 [266 Cal. Rptr. 834, 786 P.2d 892] that the \"preferable procedure\" is not to do so. But we presume that it was not improperly influenced by the report. (E.g., People v. Berryman, (supra) , 6 Cal. 4th at p. 1106.) Our presumption is not rebutted by anything in the record on appeal.\n\nSecond, defendant asserts that, in making its ruling on his verdict-modification application, the superior court undertook to independently determine whether the penalty of death was appropriate, and did in fact so determine, instead of simply proceeding to assess whether the jury's choice was contrary to the law or the evidence. He is right in stating that such an assessment is required and that an independent determination of this sort is not called for. (E.g., People v. Berryman, (supra) , 6 Cal. 4th at pp. 1105-1106.) He is wrong, however, in implying that he has any cause for complaint. For if we assume, as he claims, that the superior court undertook to independently determine that the penalty of death was appropriate, and did in fact so determine, we must conclude that it necessarily found that the jury's choice was not contrary to the law or the evidence.\n\nThird, defendant asserts that, in making its ruling on his verdict-modification application, the superior court \"review[ed] the evidence\" (Pen. Code, § 190.4, subd. (e)) in an improper manner. He says that it was required to, but did not, \"employ the same type of analysis the jury would have done [ sic ] under the instructions.\" He fails to provide any support for the existence of such a requirement. We find none. To the extent that he maintains that it could not consider the evidence of the rape of Sandra S. or the robbery of Greta Slatten, he is incorrect. Indeed, in his verdict-modification application, he expressly conceded that it could. Correctly so. The Sandra S. rape and the Slatten robbery were each relevant to one or the other of two issues material to the question of penalty under Penal Code section 190.3, viz., the \"nature and circumstances of the present [capital] offense\"--if it was deemed related thereto--or the \"presence or absence of other criminal activity by the defendant which involved the use or attempted use of force or violence or which involved the express or implied threat to use force or violence\"--if it was not so deemed. \u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nFourth, defendant asserts that, in making its ruling on his verdict-modification application, the superior court was not sufficiently specific in the \"reasons\" it \"state[d]\" and \"set forth\" (Pen. Code, § 190.4, subd. (e)). It was. The proof is apparent on the face of the record on appeal: the reporter's transcript contains six pages of \"reasons,\" and the clerk's transcript incorporates them by reference.\n\nIn addition to his \"formal\" challenge, defendant makes a \"substantive\" challenge. He attacks on only a single front.\n\nDefendant asserts that the superior court's ruling on his verdict-modification application is unsound as a matter of law. He says that the evidence is insufficient to support the finding of the felony-murder-robbery special circumstance, on which death eligibility rests. We have concluded to the contrary. (See, ante, at pp. 225-226.) \u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\n8. Effect of the \"Three Strikes and You're Out\" Laws\n\nDefendant contends that each of the two so-called \"Three Strikes and You're Out\" laws exempts him from the death penalty and thereby renders unauthorized the sentence of death that the superior court imposed on him under the 1978 death penalty law.\n\nWhile this appeal was pending, section 667 of the Penal Code was amended by the Legislature to establish a sentencing scheme for fixing the term of imprisonment for any person convicted of a felony who had previously been convicted of one or more specified felonies (Stats. 1994, ch. 12, § 1), effective March 7, 1994 (id., § 2). This is the first Three Strikes law. Subsequently, section 1170.12 was added to the Penal Code by the voters to establish a similar scheme (initiative measure Prop. 184, § 1, approved at Gen. Elec. (Nov. 8, 1994)), effective November 9, 1994 (Cal. Const., art. II, § 10, subd. (a)). This is the second Three Strikes law. \u003cspan class=\"fnref\"\u003e44\u003c/span\u003e\n\nDefendant's argument is as follows: Penal Code sections 667 and 1170.12 each establish a sentencing scheme for fixing the term of imprisonment for any person convicted of a felony who had previously been convicted of one or more specified felonies; each scheme is exclusive; as a result, each supersedes the 1978 death penalty law; each would have applied to him, inasmuch as he was convicted of five felonies in the present proceeding and had previously been convicted of the specified felony of voluntary manslaughter, if he had committed the five felonies on or after its effective date; each should be applied retroactively to his benefit as mitigatory.\n\nWe are not persuaded. At least one crucial step in defendant's argument is unsound. It is true that Penal Code sections 667 and 1170.12 each establish a sentencing scheme for fixing the term of imprisonment for any person convicted of a felony who had previously been convicted of one or more specified felonies. It does not follow, however, that either supersedes the 1978 death penalty law. For, contrary to defendant's assertion, neither is \"exclusive\": each declares itself to \"apply\" not exclusively, but rather \" in addition to any other . . . punishment provisions which may apply\" (Pen. Code, § 667, subd. (e), 1170.12, subd. (c), italics added)--including those of the 1978 death penalty law. (Cf. People v. Williams (1995) 40 Cal. App. 4th 446, 457-458 [46 Cal. Rptr. 2d 730] [rejecting a similar argument as to Penal Code section 667 for different reasons].) \u003cspan class=\"fnref\"\u003e45\u003c/span\u003e\n\nIV. DISPOSITION\n\nFor the reasons stated above, we conclude that we must affirm the judgment.\n\nIt is so ordered.\n\nGeorge, C. J., Kennard, J., Baxter, J., Werdegar, J., Chin, J., and Brown, J., concurred.\n\nAppellant's petition for a rehearing was denied February 19, 1997.\n\n\u003cspan class=\"fn\"\u003e1. See footnotes 41 and 42, post, and accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. To the extent that decisions of sister states are to the contrary (see, e.g., Com. v. Amaral (1986) 398 Mass. 98 [495 N.E.2d 276]; State v. One 1987 Toyota Pickup (1989) 233 Neb. 670 [447 N.W.2d 243]; Simmons v. Com. (1989) 238 Va. 200 [380 S.E.2d 656]; cf. State v. Kirk (1985) 202 N.J.Super. 28 [493 A.2d 1271] [based on the state constitutional counterpart to the Fourth Amendment]), they prove unpersuasive in light of the authorities cited in the text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In denying defendant's motion to suppress, the superior court impliedly determined that the search of Slatten's Taurus was not independently violative of his rights under the Fourth Amendment. On appeal, he does not claim that it was. If he did, he would fail.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Defendant claims in substance that, because the superior court committed error under the confrontation clause of the Sixth Amendment to the United States Constitution, it thereby committed error under the confrontation clause of article I, section 15 of the California Constitution. In the text, we have rejected his Sixth Amendment point as not preserved for review and as legally unsupported. Here, we reject his article I, section 15 point on the same basis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDefendant also claims in substance that the superior court's error under the Sixth Amendment's confrontation clause entails error under the Eighth Amendment's cruel and unusual punishments clause. We have found no Sixth Amendment error. Hence, we find no Eighth Amendment error.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Defendant claims in substance that, because the superior court committed reversible error under California law by denying his severance motion, it thereby committed reversible error under the Fifth, Eighth, and Fourteenth Amendments to the United States Constitution. As explained in the text, the superior court did not commit error under California law, reversible or otherwise.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Defendant claims in substance that, because the superior court committed reversible error under California law by denying his motion for separate trials, it thereby committed reversible error under the Fifth, Eighth, and Fourteenth Amendments to the United States Constitution. As explained in the text, the superior court did not commit any error under California law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn People v. Pinholster (1992) 1 Cal. 4th 865, 933 [4 Cal. Rptr. 2d 765, 824 P.2d 571], we stated: \" 'After trial, of course, the reviewing court may nevertheless reverse a [judgment] where, because of the [joint trial], a gross unfairness has occurred such as to deprive the defendant of a fair trial or due process of law.' \" No such unfairness occurred here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Defendant claims in substance that, because the superior court committed reversible error under California law by denying his motion to limit physical restraints, it thereby committed reversible error under the Fifth, Eighth, and Fourteenth Amendments to the United States Constitution. As explained in the text, the superior court did not deny the motion and hence did not commit any error under California law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTo the extent that defendant claims that the superior court erred by subjecting him, or continuing to subject him, to any or all physical restraints after its ruling on his motion, he has not preserved the point for review. He had to make a motion against such restraints. (See People v. Tuilaepa (1992) 4 Cal. 4th 569, 583 [15 Cal. Rptr. 2d 382, 842 P.2d 1142], affd. sub nom. Tuilaepa v. California (1994) 512 U.S. 967 [129 L. Ed. 2d 750, 114 S. Ct. 2630].) He did not do so. Insofar as he complains about the visibility of such restraints, he will not be heard. On that score, he has only himself to blame.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. At the outset, defendant maintains that his Wheeler / Batson claim must be resolved in his favor on the ground that the record on appeal is not adequate to permit meaningful review. The deficiency of which he complains is the absence of certain questionnaires, which were completed by prospective jurors, then lodged with the superior court, subsequently lost by its clerk's office, and finally determined by the superior court to be beyond reconstruction. A criminal defendant is indeed entitled to a record on appeal that is adequate to permit meaningful review. That is true under California law. ( People v. Howard (1992) 1 Cal. 4th 1132, 1165 [5 Cal. Rptr. 2d 268, 824 P.2d 1315].) It is true as well under the United States Constitution--under the Fourteenth Amendment generally, and under the Eighth Amendment specifically when a sentence of death is involved. ( People v. Howard, (supra) , 1 Cal. 4th at p. 1166.) The record on appeal is inadequate, however, only if the complained-of deficiency is prejudicial to the defendant's ability to prosecute his appeal. (See id. at pp. 1165-1166.) It is the defendant's burden to show prejudice of this sort. ( Id. at p. 1165.) Defendant attempts to carry this burden, but does not succeed. He simply does not show that the absence of the questionnaires is prejudicial to his ability to urge his Wheeler / Batson claim--or any other. Indeed, material from the now lost items survives in the reporter's and clerk's transcripts through quotation and paraphrase.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. We note in passing that an appellate court independently reviews a trial court's Conclusion on whether the prosecutor stated adequate neutral reasons for the peremptory challenges in question: It amounts to the resolution of a pure question of law (see U.S. v. Bishop, (supra) , 959 F.2d at p. 821, fn. 1)--whether, as stated in the text, the reasons for the strikes were \"explanation[s]\" \"connecting . . . specific [prospective] juror[s] to the facts of the case,\" and were not mere \"surrogate[s]\" or \"prox[ies]\" for group membership ( id. at p. 826). On such review, we agree with the superior court that the prosecutor succeeded.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Defendant claims in substance that, because the superior court committed reversible error by denying his motions under Wheeler and Batson, it thereby committed independently reversible error under the Fifth, Sixth, and Fourteenth Amendments to the United States Constitution. As explained in the text, the superior court did not commit any error under Wheeler or Batson.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. We note in passing that, although defendant was precluded from using evidence of Sandra S.'s prior misdemeanor prostitution convictions for impeachment, he could, and did, use evidence of her work as a prostitute for that very purpose. Strictly speaking, evidence of prior misdemeanor convictions themselves is not relevant for impeachment, but rather the misconduct underlying such convictions ( People v. Wheeler, (supra) , 4 Cal. 4th at p. 299)--and then only if it involves \"moral turpitude\" ( id. at p. 295).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Defendant claims in substance that, because the superior court committed reversible error under California law by granting the People's motion, it thereby committed reversible error under the Fifth, Sixth, Eighth, and Fourteenth Amendments to the United States Constitution. In the text, we have rejected the assertion that the superior court committed error under California law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Defendant claims in substance that, because the superior court committed reversible error under California law by granting the People's motion, it thereby committed reversible error under the Fifth, Sixth, Eighth, and Fourteenth Amendments to the United States Constitution. In the text, we have rejected the assertion that the superior court committed error under California law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. To the extent that defendant claims that the superior court erred by denying his motion and by overruling his objection on such grounds as that Colyer's testimony was irrelevant and, if relevant, unduly prejudicial, he has not preserved his point for review. He did not comply with the general rule requiring a \"specific\" and \"timely\" objection below, except as to hearsay. No exception covers his noncompliance. In any event, he fails on the merits. The testimony had a tendency in reason to prove a disputed fact bearing on a material issue, viz., the identity of Birkman's killer: in admitting he had killed a \"police officer,\" he effectively admitted he had killed Birkman. Further, the testimony cannot be considered insufficiently probative in light of, inter alia, the risk to the fairness of the proceedings or the reliability of the outcome. (Evid. Code, § 352.) Any such risk was nullified by the superior court's admonition that Birkman was not a police officer and that his homicide was the only one at issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDefendant may be understood to argue that irrelevant evidence--such as he now asserts Colyer's testimony to be--is, by that very fact, hearsay evidence. That is not the case. Evidence is hearsay if it is offered in the form of an out-of-court statement to prove what it states. By contrast, evidence is irrelevant if it has no tendency in reason to prove or disprove a disputed fact bearing on a material issue; it need not be offered in the form, or for the purpose, specified for hearsay.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDefendant may also be understood to argue that Colyer's testimony somehow undermined the superior court's admonition that Birkman was not a police officer and that his homicide was the only one at issue. Not at all. It merely, and properly, allowed or supported an inference that, in admitting he had killed a \"police officer,\" he effectively admitted he had killed Birkman.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Defendant claims in substance that, because the superior court committed error under California law by ruling as it did, it thereby committed error under the Fifth, Sixth, Eighth, and Fourteenth Amendments to the United States Constitution. As explained in the text, the superior court did not commit error under California law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. At oral argument, defendant attempted to raise a claim that, in the proceedings recounted in the text, defense counsel provided ineffective assistance, apparently in violation of his rights under the Sixth Amendment to the United States Constitution and article I, section 15 of the California Constitution. He \"assert[ed] the point perfunctorily. We deny it in the same fashion.\" ( People v. Ashmus (1991) 54 Cal. 3d 932, 1011, fn. 29 [2 Cal. Rptr. 2d 112, 820 P.2d 214].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Defendant claims in substance that, because the superior court committed error under the Evidence Code by failing to do what he asserts it should have done sua sponte, it thereby committed error under the Fifth, Eighth, and Fourteenth Amendments to the United States Constitution and also under article I, section 15 of the California Constitution. As explained in the text, the superior court did not commit error under the Evidence Code.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Underlying defendant's argument seems to be a concern that, if a party introduces relevant evidence favorable to his opponent, he may be doing so in the hope that it will be used by the jury to draw a forbidden inference. A limiting instruction, however, can prevent such an eventuality. No instruction of this sort was sought by defendant. No complaint may therefore be raised.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Again, a limiting instruction could have prevented such an eventuality. No instruction of this sort was sought by defendant. No complaint may therefore be raised.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Yet again, a limiting instruction could have prevented such an eventuality. No instruction of this sort was sought by defendant. No complaint may therefore be raised.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDefendant claims in substance that, because the superior court committed error under California law by ruling as it did, it thereby committed error under the Fifth, Eighth, and Fourteenth Amendments to the United States Constitution. As explained in the text, the superior court did not commit error under California law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eTo the extent that defendant claims that the superior court erred under either California law or the United States Constitution by failing to reconsider his motion to sever his trial from Ross's sua sponte, he does not succeed. Contrary to his implication, the superior court was not under a duty to reconsider in the absence of a request.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. By contrast, it is the general rule for error under the United States Constitution that reversal requires prejudice and prejudice in turn is presumed unless the state shows that the defect was harmless beyond a reasonable doubt under Chapman v. California (1967) 386 U.S. 18 [17 L. Ed. 2d 705, 87 S. Ct. 824, 24 A.L.R.3d 1065]. ( People v. Gordon, (supra) , 50 Cal. 3d at p. 1267.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. In Hawthorne, we made plain that, in instructing on pity and prejudice, a trial court may use the language of CALJIC No. 1.00. (See People v. Hawthorne, (supra) , 4 Cal. 4th at pp. 71-73.) But we did not suggest that it must rigidly adhere to its very words. Our statement that \"the trial court\" there \"should have given the complete text of CALJIC No. 1.00\" ( id. at p. 73) should not be read to the contrary. The trial court there did not merely deviate from the language in question in certain particulars. Rather, it omitted it entirely. ( Id. at p. 71, fn. 18.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. In support of his claim that the superior court erred by instructing that the testimony of an accomplice that tends to incriminate a codefendant ought to be viewed with distrust, defendant relies on, among other decisions, People v. Hartung (1950) 101 Cal. App. 2d 292 [225 P.2d 614], People v. Sawyer (1967) 256 Cal. App. 2d 66 [63 Cal. Rptr. 749], and People v. Gonzales (1970) 4 Cal. App. 3d 593 [84 Cal. Rptr. 863]. Hartung holds, in substance, that \"it is error to give\" an instruction that the testimony of an accomplice-defendant should be viewed with distrust \" 'as its effect is to discredit' \" him \" 'and thereby . . . trench upon his constitutional rights by invading the province of the jury.' \" ( People v. Hartung, (supra) , 101 Cal. App. 2d at p. 295.) Gonzales cites Hartung and follows it on this point. ( People v. Gonzales, (supra) , 4 Cal. App. 3d at p. 607.) Sawyer does not refer to Hartung but is to similar effect. ( People v. Sawyer, (supra) , 256 Cal. App. 2d at pp. 73-74.) Hartung is unsound. In 1934, the California Constitution had been amended through the addition to article VI of former section 19, present section 10, which provides in its current wording that a trial court \"may make such comment on the evidence and the testimony and credibility of any witness as in its opinion is necessary for the proper determination of the cause.\" Hartung, however, is based on pre-1934 authority, to the effect that a trial court may not do so under the state charter. More important, Hartung, Gonzales, and Sawyer are unpersuasive in and of themselves. Each assumes that a defendant is superior to all other witnesses. As stated in the text, he is not: He is equal, and that is all.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. \"In Carlos v. Superior Court (1983) 35 Cal. 3d 131, 153-154 . . ., we concluded in substance that intent to kill is an element of the felony-murder special circumstance. In People v. Anderson [(1987)] 43 Cal. 3d 1104, 1147, . . . we overruled Carlos and held to the contrary. But when, as here, the 'felony-murder special circumstance is alleged to have occurred after Carlos and before Anderson, the former governs.' \" ( People v. Berryman, (supra) , 6 Cal. 4th at p. 1088.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. In People v. Turner, (supra) , 22 Cal. App. 3d at page 184, the court concluded, with a citation to Chapman v. California, (supra) , 386 U.S. 18, that an erroneous failure to instruct on the concurrence of act and \"specific intent\" \"was not prejudicial . . . .\" Subsequently, in People v. Germany, (supra) , 42 Cal. App. 3d at page 419, the court concluded, without citing Chapman, that a like error \"was harmless.\" Despite what its language may be read to suggest, the Turner court did not hold that the error in question was of federal constitutional dimension or even that the general rule for error of this sort was applicable. The Germany court all but expressly avoided such a holding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Defendant claims in substance that, because the superior court committed error under California law, it thereby committed error under, apparently, the Sixth, Eighth, and Fourteenth Amendments to the United States Constitution. As explained in the text, the superior court did not commit error under California law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. In the course of his argument, defendant asserts that the superior court should have referred to, and explained, proximate cause in accordance with the pattern instruction set out as CALJIC No. 8.55 (5th ed. 1988): \"To constitute . . . murder . . . there must be, in addition to the death of a human being, an unlawful act which was a proximate cause of that death. A proximate cause of a death is a cause which, in natural and continuous sequence, produces the death, and without which the death would not have occurred.\" We note in passing that, in light of our all but express disapproval in People v. Roberts (1992) 2 Cal. 4th 271, 311-313 [6 Cal. Rptr. 2d 276, 826 P.2d 274], CALJIC No. 8.55 was revised in 1992 to remove \"proximateness\": \"To constitute . . . murder . . . there must be, in addition to the death of a human being, an unlawful act which was a cause of that death.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. In the course of his argument, defendant cites the first paragraph of the Use Note to CALJIC No. 8.21: \"If the death occurs substantially contemporaneously with the commission of the crime, use [the during-the-commission language] and [not the as-a-direct-causal-result alternative]. On the other hand, if death occurs at a later period, use [the as-a-direct-causal-result language] and [not the during-the-commission alternative].\" He asserts that Birkman's death did not occur \"substantially contemporaneously\" with the commission or attempted commission of a robbery, but rather \"at a later period.\" He then concludes that the superior court should have used the as-a-direct-causal-result language instead of the during-the-commission alternative. His unstated premise is that use notes, like the one here, have the force of law. They do not.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Defendant claims in substance that, because the due process clause of the Fourteenth Amendment to the United States Constitution is violated by the insufficiency of the evidence to support his first degree murder conviction under the theory of felony-murder robbery or attempted robbery, the cruel and unusual punishments clause of the Eighth Amendment is violated as well. As explained in the text, the due process clause is not violated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. In this case, \"[w]e need not, and do not, reach the question whether the sufficiency-of-evidence review specified in the text is required under the due process clause of the Fourteenth Amendment to the United States Constitution.\" ( People v. Rowland, (supra) , 4 Cal. 4th at p. 271, fn. 11.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Defendant claims in substance that, because the due process clause of the Fourteenth Amendment to the United States Constitution is violated by the insufficiency of the evidence to support the felony-murder-robbery special-circumstance finding, the cruel and unusual punishments clause of the Eighth Amendment is violated as well. As implied in the text and footnote 30, ante, the due process clause is not violated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Defendant claims in substance that, because Judge Bond committed reversible error under California law by withdrawing authorization to incur expenses for the trip to Cuba by McGarrity and Santivanias, she thereby committed reversible error under the Fifth, Sixth, Eighth, and Fourteenth Amendments to the United States Constitution. As explained in the text, the superior court did not commit any error under California law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Defendant claims in substance that what we assume to be misconduct by the interpreter's office through the improper disclosure of information about the trip to Cuba by McGarrity and Santivanias amounts to reversible error under, apparently, the Fifth, Sixth, Eighth, and Fourteenth Amendments to the United States Constitution. Any such error is not reversible. The People have shown that any improper disclosure was harmless beyond a reasonable doubt: As explained in the text, such improper disclosure revealed nothing of substance other than the names of the travelers--a fact that was inconsequential.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. At the outset, defendant asserts that Judge Lewis conducted an inadequate hearing on the question of judicial misconduct, but does not follow through successfully.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. To the extent that defendant claims that Judge Lewis erred by determining that he did not commit judicial misconduct by receiving from interpreter Cook her complaint about Santivanias's participation in the trip to Cuba with McGarrity, he fails to persuade. As a general matter, an appellate court reviews a trial court's ruling on judicial misconduct for abuse of discretion. (Cf. 2 Childress \u0026 Davis, Federal Standards of Review, (supra) , § 12.03, pp. 12-23 to 12-31 [setting forth the standard of review under federal law].) There was no such abuse here. Judge Lewis was not unreasonable in determining that he did not commit judicial misconduct. \"A Judge may consult with court personnel whose function is to aid the Judge in carrying out the Judge's adjudicative responsibilities . . . .\" (Cal. Code Jud. Ethics, canon 3B(7)(b), asterisk omitted; accord, former Cal. Code Jud. Conduct, canon 3A(4) commentary, eff. Jan. 1, 1975.) Such \"court personnel\" include interpreter Cook. Since Judge Lewis could actively \"consult\" with her, we believe he could passively receive her complaint. But, even if judicial misconduct had occurred, it would not be reversible because it would not have been prejudicial: there is no reasonable possibility of an effect on the outcome.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Defendant claims in substance that, because Judge Lewis committed reversible error under California law by denying his motion to recuse himself, he thereby committed reversible error under the Fifth and Sixth Amendments to the United States Constitution. As explained in the text, he did not commit any error under California law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Defendant claims in substance that, because Judge Lewis committed reversible error under California law by failing to require Prosecutor Marlette to testify sua sponte, he thereby committed reversible error under the Fifth, Sixth, and Fourteenth Amendments to the United States Constitution. As explained in the text, Judge Lewis did not commit any error under California law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. To the extent that defendant claims that, because defense counsel refused to stipulate to Prosecutor Marlette's motion, he was provided with ineffective assistance of counsel in violation of article I, section 15 of the California Constitution, he is unsuccessful. Here, as with the Sixth Amendment to the United States Constitution, he would have to demonstrate deficient performance under an objective standard of professional reasonableness and prejudice under a test of reasonable probability of an effect on the outcome. (E.g., People v. Ledesma, (supra) , 43 Cal. 3d at pp. 215-218.) As explained in the text, he cannot do so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn a single paragraph in his reply brief, defendant claims for the first time that he was provided with ineffective assistance of counsel in violation of the Sixth Amendment if any of defense counsel's acts or omissions resulted in a failure to preserve any of 11 issues for review. Again, he \"asserts the point perfunctorily,\" and \"[w]e deny it in the same fashion.\" ( People v. Ashmus, (supra) , 54 Cal. 3d at p. 1011, fn. 29.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Defendant claims in substance that, because the superior court committed error under California law, it thereby committed error under the Eighth Amendment to the United States Constitution. As explained in the text, the superior court did not commit error under California law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Contrary to certain--unobjected-to--comments in the prosecutor's summation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Pursuant to Penal Code section 190.3, the Sandra S. rape was relevant to one or the other of two issues material to the question of penalty, viz., the \"nature and circumstances of the present [capital] offense\"--if it was deemed related thereto--or the \"presence or absence of other criminal activity by the defendant which involved the use or attempted use of force or violence or which involved the express or implied threat to use force or violence\"--if it was not so deemed. Pursuant to that same provision, it could be considered under one or the other of two parallel factors, viz., the \"circumstances of the crime of which the defendant was convicted in the present proceeding . . .\" and the \"presence or absence of criminal activity by the defendant which involved the use or attempted use of force or violence or the express or implied threat to use force or violence.\" Had the superior court's instructions suggested otherwise, they would have been erroneous--against the People, not defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. See footnote 41, ante.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Defendant claims in substance that, because the superior court committed error under California law by denying his verdict-modification application, it thereby committed error under the Eighth and Fourteenth Amendments to the United States Constitution. As explained in the text, the superior court did not commit error under California law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. For the \"legislative history\" of Penal Code sections 667 and 1170.12, see People v. Superior Court (Romero) (1996) 13 Cal. 4th 497, 504-505 [53 Cal. Rptr. 2d 789, 917 P.2d 628].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Having reviewed the record on appeal, we conclude that the jury found that defendant himself killed, and intended to kill, Allen Birkman, and did so on substantial evidence. Accordingly, we further conclude that the superior court's imposition of the sentence of death does not violate the cruel and unusual punishments clause of the Eighth Amendment to the United States Constitution. ( Cabana v. Bullock (1986) 474 U.S. 376, 386 [88 L. Ed. 2d 704, 716-717, 106 S. Ct. 689].)\u003c/span\u003e\n\n",
    "body_length": 209456,
    "citedas": [
      "14 Cal.4th 155",
      "926 P.2d 365",
      "58 Cal.Rptr.2d 385"
    ],
    "attorneys": "Terrence Verson Scott and Andrew E. Rubin, under appointments by the Supreme Court, for Defendant and Appellant. Daniel E. Lungren, Attorney General, George Williamson, Chief Assist ant Attorney General, Robert R. Anderson, Assistant Attorney General, Margaret Venturi and Shirley A. Nelson, Deputy Atttorneys General, for Plaintiff and Respondent.",
    "category": [
      "36",
      "78"
    ],
    "judges": "Opinion by Mosk, J., expressing the unanimous view of the court.",
    "citation_count": 1339
  }
}
