{
  "id": "kogcQGYBTlTomsSBc_1O",
  "document": {
    "title": "Summerlin v. Stewart",
    "full_title": "WARREN WESLEY SUMMERLIN -APPELLANT, v. TERRY L. STEWART, DIRECTOR OF ARIZONA DEPARTMENT OF CORRECTIONS -APPELLEE.",
    "jurisdiction": "Ninth Circuit",
    "date": "2003-09-02T00:00:00.000Z",
    "docket": "No. 98-99002",
    "body": "FOR PUBLICATION\n\nArgued and Submitted October 10, 2000-Pasadena, California\n\nOpinion Filed October 12, 2001\n\nWithdrawn February 11, 2002\n\nOrder Granting En Banc Hearing November 23, 2002\n\nArgued and Submitted December 10, 2002\n\nOpinion by Judge Thomas; Concurrence by Judge Reinhardt; Dissent by Judge Rawlinson\n\nOPINION\n\nIn this appeal we consider whether the district court erred in denying a writ of habeas corpus sought as to petitioner's conviction and death sentence. We affirm the district court's judgment as to the conviction. However, we conclude that the Supreme Court's decision in Ring v. Arizona, 536 U.S. 584 (2002), applies retroactively so as to require that the penalty of death in this case be vacated.\n\nI.\n\nIt is the raw material from which legal fiction is forged: A vicious murder, an anonymous psychic tip, a romantic encounter that jeopardized a plea agreement, an allegedly incompetent defense, and a death sentence imposed by a purportedly drug-addled judge. But, as Mark Twain observed, \"truth is often stranger than fiction because fiction has to make sense.\"\n\nThere is no doubt that Warren Summerlin is an extremely troubled man. He has organic brain dysfunction, was described by a psychiatrist as \"functionally retarded,\" and has explosive personality disorder with impaired impulse control. His father was a convicted armed robber who was killed in a shootout. As a youth, his alcoholic mother beat him frequently and punished him by locking him in a room with ammonia fumes. At his mother's behest, he received electroshock treatments to control his explosive temper. He dropped out of school in the seventh grade due to dyslexia and committed numerous petty juvenile offenses. In 1975, he was diagnosed as a paranoid schizophrenic and treated with the anti-psychotic medication Thorazine.\n\nBefore his murder conviction, his only dangerous adult felony was a conviction for aggravated assault. That conviction arose out of a road rage incident in which a car veered off the road, jumped the curb and struck Summerlin's wife, who was hospitalized for her injuries. At the scene, Summerlin brandished a pocket knife at the errant driver, an act that occasioned the filing of the criminal assault charge. Summerlin was not convicted of this offense until after these capital proceedings had commenced. However, this conviction later served as one of two statutory aggravating factors that qualified Summerlin for the death penalty.\n\nOn the morning of April 29, 1981, Brenna Bailey, a delinquent account investigator for Finance America, went to Summerlin's home to speak with Summerlin's wife about an overdue account. When Bailey's boyfriend, Marvin Rigsby, learned that she had not returned to work as scheduled, he obtained the addresses of the places she had planned to visit that day and began to retrace her travel. In the early evening, he spoke with Summerlin, who told Rigsby that Bailey had left that residence at 10:30 a.m. The woman residing at the next address Bailey was slated to visit told Rigsby that she had been home all day and had not received a visit from anyone. After making additional attempts to find Bailey, Rigsby reported Bailey's disappearance to the police that evening.\n\nLater that evening, the police received a tip from a female caller to an anonymous crime hotline service who stated that she believed that the missing woman from \"Pacific Finance Company\" had been murdered by Summerlin, who had rolled up the victim's body in a carpet. The caller later was identified as Summerlin's mother-in-law who testified that the basis of her information was her daughter's extra-sensory perception.\n\nEarly the next morning, a road paving crew outside a market approximately a mile from the Summerlin residence alerted the market's manager to a smell emanating from the trunk of a parked car, later determined to have been owned by Bailey. The manager recognized the odor as that of a decaying body and telephoned the police. Upon arrival, the officers observed a pair of panties, pantyhose, and shoes on the floorboard of the back seat. They forced open the trunk and found Bailey's body, wrapped in a bloody bedsheet. Her skull was crushed, and she was partially nude.\n\nThe police obtained a search warrant for the Summerlin residence and found numerous items of incriminating evidence. After the search warrant was read to Summerlin, he stated, \"I didn't kill nobody.\" When the detective did not respond, Summerlin asked: \"Is this in reference to the girl that was at my house?\" In response to the officer's inquiry as to which girl he was referring, Summerlin described Bailey. Summerlin's wife identified the bloody bedspread found with the victim as belonging to the Summerlin household. Summerlin was then arrested for the murder of Brenna Bailey. At the police station, Summerlin asked to speak to his wife and then made several incriminating statements while police officers were within listening distance.\n\nThe state trial court appointed the public defender's office to represent Summerlin. The first attorney assigned to the case moved for a mental competency examination pursuant to Ariz. R. Crim. P. 11. Thereafter, the assigned attorney left the public defender's office, and an attorney whom we shall refer to as \"Jane Roe\" was designated to represent Summerlin.\n\nIn June 1981, Summerlin was examined by two courtappointed psychiatrists, Drs. Maier Tuchler and Otto Bendheim. Each found him competent to stand trial and legally sane under the M'Naghten standard, which then governed the determination of competency under Arizona law. Although there was no evidence of mental disease or defect, Dr. Tuchler observed that dyslexia and illiteracy made Summerlin \"functionally mentally retarded.\" He further found that Summerlin's impulse control was extremely impaired due to an explosive-type personality disorder and that he had an antisocial personality. Upon reading the reports, Judge David G. Derickson found Summerlin competent to stand trial.\n\nDuring this time period, Roe had conversations with Dr. Leonardo Garcia-Bunuel, a psychiatrist who treated Summerlin at the Maricopa County Jail, regarding a possible diagnosis of psychomotor epilepsy. Summerlin had described to Dr. Garcia-Bunuel details of the murder, particularly his experiences of sensing an intense perfume odor, and this led Dr. Garcia-Bunuel to suspect that Summerlin may have had a temporal lobe seizure at the time of the killing. Subsequently, in August 1981, Roe arranged for neurological testing by Dr. Mark Winegard. An electroencephalogram (EEG) showed some slowing in Summerlin's posterior temporal area but was insufficient to support a diagnosis of epilepsy. CAT scans and a second EEG performed in October 1981 were normal. As a result, Dr. Garcia-Bunuel withdrew his concerns.\n\nRoe also secured a psychological evaluation of Summerlin from Dr. Donald Tatro in November 1981. Although concluding there was no evidence to support an insanity defense, Dr. Tatro found indications of organic brain impairment, borderline personality disorder, and paranoid personality disorder. In Dr. Tatro's opinion, Summerlin \"is deeply emotionally and mentally disturbed, unaware of the motives underlying much of his behavior, and unable, because of his problems, to exercise normal restraint and control, once his highly unstable and volatile emotions are aroused.\"\n\nIn November 1981, Roe began plea negotiations with the prosecution and obtained an extremely favorable plea agreement, which Summerlin entered into on November 17, 1981. The prosecutor, whom we will call \"John Doe,\" had been willing to enter into the agreement because he did not believe that the offense satisfied the Arizona legal standard of \"heinous, cruel and depraved.\" At the time, Summerlin had not been convicted of the aggravated felony arising out of the road rage incident, so it did not qualify as an aggravating factor under Arizona's capital sentencing statute. See Ariz. Rev. Stat. § 13-703(F)(2) (1981) (amended in 1993). Thus, Doe did not believe that Summerlin had committed a capital offense.\n\nUnder the proposed plea agreement, Summerlin was to enter an Alford plea, see North Carolina v. Alford, 400 U.S. 25 (1970), which enabled him, without admitting guilt, to plead guilty to second-degree murder and aggravated assault and to be sentenced accordingly. The agreement stipulated that Summerlin would be sentenced to twenty-one years in prison for the murder of Ms. Bailey, of which he would be required to serve fourteen. In exchange, Summerlin would plead guilty to aggravated assault for the road rage incident with a maximum sentence of fifteen years and would admit that he violated his probation in another case charging burglary. The plea agreement provided that Summerlin's sentences on the three charges would run concurrently. However, the agreement was subject to court approval. If the court rejected the stipulated sentence, Summerlin could either (1) allow his plea to stand and be sentenced to a term of up to thirty-eight-and-one-half years, according to the court's sole discretion, or (2) withdraw from his plea of guilty and have the matters proceed to trial and disposition.\n\nOn the day he entered the plea, Summerlin properly answered all the questions required to validate his Alford plea. He had second thoughts a few days later, however, and formally sent to the court a pro se motion to withdraw his plea and to fire his public defender. In a court appearance on December 15, 1981, scheduled to address his motion, Summerlin openly registered dissatisfaction with the plea, the stipulated sentence, and Roe's handling of his case.\n\nAfter hearing his complaints, Judge Derickson denied Summerlin's motions, but took the occasion to inform Summerlin that it was his intention on the upcoming sentencing date not to accept the stipulated sentence. Therefore, Summerlin would have the option either to withdraw from the plea or to allow it to stand and be sentenced accordingly.\n\nRealizing that her client's intention to withdraw from the agreement might again make him eligible for the death penalty, Roe promptly attempted to have the case transferred to another judge who might look more favorably on the deal. On December 18, 1981, the presiding judge denied her motion to disqualify Judge Derickson on the ground of prejudice towards her client and allowed Judge Derickson to continue with the case.\n\nThat same evening, Roe attended a Christmas party. She and prosecutor Doe left the party together and had what she later described as a \"personal involvement . . . of a romantic nature.\" As a result of that, as she later testified, she felt she \"could no longer ethically represent Mr. Summerlin.\" Because of the circumstances, she believed \"that it would be appropriate for another Public Defender to handle the case and take it to trial, since it looked like it might be a trial at that point, because Mr. Summerlin indicated he wanted a trial and Judge Derickson had indicated he was going to reject the plea.\" She reported the situation to her supervisor, and it was determined that the entire office probably was compromised.\n\nNotwithstanding her belief that she could not represent Summerlin due to a personal conflict of interest, Roe took no immediate steps to accomplish her withdrawal. Neither she nor her office informed either the court or their client of her conclusion that she could no longer be Summerlin's attorney. Instead, she accompanied him to and represented him at the next hearing before Judge Derickson on December 22, 1981.\n\nAt the hearing, Judge Derickson advised Summerlin of his decision not to be bound by the sentencing part of the plea agreement, and that if Summerlin allowed his plea to stand, he was facing up to thirty-eight-and-one-half years in prison for the three offenses. After some confusion during which Summerlin told the court twice that he did not understand the Judge's explanation of the sentence he now might face, Roe privately conferred with her client. Their discussion ended with Roe's statement to the court, \"I believe he understands, your Honor.\" Summerlin's immediate response was, \"No, I don't understand,\" to which Roe replied, \"Then what is your question?\" Summerlin then asked about the number of years he might face on the three charges. Judge Derickson explained again the sentence that Summerlin would face if he permitted his plea to stand. To this Summerlin said that he finally understood, adding, \"Okay. I would like to withdraw from my plea agreement. Is that what you want me to say?\" Judge Derickson appropriately told Summerlin that he did not \"want\" Summerlin to say that, he simply wanted to make sure that Summerlin understood what would happen if he permitted the plea to stand. This exchange prompted another confidential discussion between Summerlin and Roe, followed by Summerlin's statement that, \"It says, if this plea agreement should be changed in any way, I can withdraw.\" \"Yes, that's the question he asked you,\" Roe replied. Summerlin then withdrew from the agreement. The court immediately reinstated his pleas of not guilty to the two consolidated cases, vacated its findings in the pending probation violation matter, and ordered that the matters be sent to the presiding judge for trial setting. Summerlin's courtroom decision to withdraw his plea made him eligible for a conviction of first-degree murder and a sentence of death.\n\nAt this point in the hearing, Summerlin moved once again for new counsel. Roe remained silent. The court denied his motion, stating that \"the record may further reflect that you failed to establish any grounds upon which counsel should be changed.\" Judge Derickson later submitted an affidavit indicating that had he then known of the conflict, he would have granted Summerlin's request to change counsel and would have continued the proceeding rather than proceeding with the plea colloquy.\n\nOn December 28, 1981, six days after Summerlin withdrew his plea, Roe finally broached the problem with Doe. On behalf of her client, she wanted Doe to stay on the case because he favored disposing of it with a lesser plea. He could discern no reason to step down as the prosecutor. After this discussion, a hearing was arranged for December 28, 1981, at which Roe planned to move to withdraw as counsel and to permit the rest of the Public Defender's Office to withdraw also. By this time, the case had been assigned to another judge, Judge Riddel, for trial. On December 28, Judge Riddel's calendar was being handled by Judge McCarthy. Roe did not inform Summerlin of her intent to seek withdrawal or of the conflict that had precipitated her decision. At the hearing, Judge McCarthy began by noting that it had been \"brought to the attention of the Court that defendant Mr. Summerlin is dissatisfied with the legal representation he is presently receiving.\" The judge asked Summerlin if that was correct, to which Summerlin responded, \"Yes, sir.\" The judge then noted that he had spoken with counsel in chambers \"and apparently it is their feeling that it would be in the best interest of justice that new counsel be appointed.\" Judge McCarthy then appointed George Klink, a private practitioner, as new counsel. Following the reassignment of counsel, Roe did not advise Summerlin of her conflict of interest because she saw \"no reason to beat a dead horse.\" Klink then assumed representation of Summerlin in both of the charges stemming from Bailey's murder and in the separate charge of aggravated assault arising out of the road rage incident, which was unrelated to the murder.\n\nApproximately six weeks later, the Arizona Attorney General's Office assumed control of the prosecution due to the conflict of interest between Doe and Roe. The Attorney General made it plain that the case would not be settled by way of a lesser plea. Klink filed a motion disqualifying Judge Riddel, and Summerlin's murder case was then assigned to Judge Philip Marquardt.\n\nKlink had intended to disqualify Judge Riddel as to the separate aggravated assault charge filed on the basis of the road rage incident. However, he failed to take the appropriate measures to accomplish this aim. After discovering this, Klink moved for a continuance of the assault trial because he was unprepared. His motion was denied and the assault trial proceeded. Klink called only one witness, Summerlin's wife. Summerlin was convicted of aggravated assault and this conviction served several months later as one of the two aggravating circumstances in the penalty phase of his murder trial.\n\nKlink spoke with Roe about the murder case and the medical reports. However, he never spoke with any of the experts who had interviewed Summerlin. He attempted to get another psychiatric expert, but he failed.\n\nKlink's main defense theory for the murder trial was Summerlin's putative lack of premeditation. Klink presented no evidence supporting that theory. He cross-examined several prosecution witnesses in an attempt to cast reasonable doubt on the rape charge as a way of proving lack of premeditation. Because the prosecution offered no psychiatric evidence, Klink could not cross-examine anyone regarding Summerlin's psychiatric problems and how they would affect his ability to premeditate the murder. Klink called only one witness, Roe, and he only asked her a few questions in order to impeach one of the coroner's statements regarding the length of time seminal fluid remains in the body. The entire case lasted only four days, and the jury was out for a little over three hours. The jury found Summerlin guilty of both first-degree murder and sexual assault.\n\nThe judge set a sentencing hearing to hear testimony and argument on aggravating and mitigating circumstances approximately one month after the verdict. In that month, Klink never met with Summerlin. Klink knew that the prosecution planned to call Drs. Tuchler and Bendheim at sentencing, but he never contacted either of them. Klink knew that Summerlin had been convicted of only one dangerous felony -the aggravated assault that Klink had tried before another judge. He also knew of mitigating circumstances surrounding that assault, including that the victim was not physically harmed and that Summerlin's reaction was in response to witnessing the woman striking his wife with her car. Klink nonetheless did not present this information to the judge. Klink prepared no evidence regarding Summerlin's social history despite references in Dr. Tatro's report that Summerlin possibly experienced severe physical and emotional abuse in his childhood.\n\nThe sentencing hearing commenced on the afternoon of July 8, 1982. It was an extremely short proceeding, extending only twenty-six transcript pages, more than half of which constituted colloquy between counsel and the court. The court first entertained argument on the defense motion for a new trial, which the judge indicated he would consider over the weekend. The State's aggravation case consisted of only one exhibit, specifically certified copies of documents relating to the aggravated assault conviction. The State then asked the judge to consider the trial testimony and rested its case. The entirety of the State's aggravation case was recorded in one page of transcript.\n\nFor the defense case in mitigation, Klink called Dr. Tatro to the stand. However, before the witness could be sworn in, Summerlin interrupted and-although the conversation is not in the trial transcript-apparently requested that his attorney not present Dr. Tatro. Klink requested a five-minute recess, at the conclusion of which he stated: \"With the consent of the Defendant, the Defendant has no witnesses in mitigation at this time and . . . we'll rest.\" The judge then reminded Klink and Summerlin that this was the time set aside for the aggravation and mitigation hearing and that he planned to proceed with sentencing the next Monday. The judge then said, \"so you tell me that you have one witness that you may present on Monday?\" Klink replied: \"Well, I would not call any witnesses at all.\" The judge then indicated that he would allow Summerlin to make any statement that he wished to make, either at the present hearing or on Monday. Subsequently in the hearing, Klink noted that he would rely on the written report of Dr. Tatro attached to the presentence report. The State proceeded by presenting two rebuttal psychiatric witnesses.\n\nJudge Marquardt advised the parties that he would deliberate over the weekend and announce his decision on Monday. Unbeknownst to Summerlin, Judge Marquardt was a heavy user of marijuana at the time, a fact that the State conceded in the federal habeas proceedings before the district court in this case.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe amount of marijuana that Judge Marquardt may have used during the trial or deliberations is unknown because the district court did not allow discovery on this issue, although there is record support for Summerlin's claim that Judge Marquardt was either having difficulty concentrating or experiencing short-term memory loss.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nIn any event, Judge Marquardt adjourned the penalty phase proceedings on Friday, indicating that he would deliberate over the sentence during the weekend and would also consider the motion for a new trial. However, on Monday, he either forgot or elected not to rule on the motion for a new trial and immediately proceeded with sentencing. Judge Marquardt began the hearing simply by announcing the case and inquiring whether Summerlin had anything to say or legal cause to show why judgment and sentence should not be pronounced. Klink stated he knew of no legal cause. Summerlin stated that he had a motion to vacate the judgment for the judge to consider. The judge examined the motion, took a five-minute recess, then denied it. The judge then heard brief oral arguments from the State and from Klink. He neither asked Summerlin whether he had anything further to say nor advised him of his right to allocution with respect to the sentence.\n\nJudge Marquardt then sentenced Summerlin to death after finding two aggravating circumstances and no sufficiently substantial mitigating circumstances. The judge based his decision as to aggravating circumstances on two statutory grounds: (1) that the defendant had a prior felony conviction involving the use or threatened use of violence on another person, Ariz. Rev. Stat. § 13-703(F)(2) (1981) (amended in 1993); and (2) that Summerlin committed the offense in an especially heinous, cruel, or depraved manner, id. § 13-703(F)(6). He found no mitigating circumstances.\n\nThe same day, Judge Marquardt also sentenced James Clifford Fisher to death. Fisher had been charged with murdering Marguerite Bailey-no relation to Brenna Bailey-with a blunt instrument. See State v. Fisher, 686 P.2d 750, 758 (Ariz. 1984). As in the case with Summerlin, Judge Marquardt found two aggravating circumstances (including that the victim had been killed in an especially heinous and depraved manner) and no mitigating circumstances sufficiently substantial to call for leniency. Id. at 775-76. Fisher eventually received post-conviction relief on the basis of an unethical plea agreement that Judge Marquardt expressly entered into as a party and subsequently allowed into evidence at trial. See State v. Fisher, 859 P.2d 179, 184 (Ariz. 1993). Summerlin alleges that Judge Marquardt confused some of the facts between the cases during Summerlin's sentencing hearing.\n\nThe Supreme Court of Arizona reviewed and affirmed Summerlin's convictions and his sentence. See State v. Summerlin, 675 P.2d 686 (Ariz. 1983), recons. den. Jan. 17, 1984. After an initial petition for writ of habeas corpus in federal district court and four unsuccessful post-conviction attempts in state court to overturn his conviction, Summerlin filed a second amended petition for writ of habeas corpus in the federal district court in Arizona on November 22, 1995. See 28 U.S.C. § 2254 (1994). The federal district court denied Summerlin's second amended petition for writ of habeas corpus on October 31, 1997. Pursuant to Fed. R. Civ. P. 59(e), Summerlin moved to vacate the judgment on November 28, 1997. The district court denied this motion on January 12, 1998. However, the district court issued a certificate of probable cause enabling Summerlin to appeal pursuant to Fed. R. App. P. 22(b)(1). This timely appeal followed.\n\nA divided three-judge panel of this Court issued its opinion on October 12, 2001, affirming the district court in part and reversing in part. See Summerlin v. Stewart, 267 F.3d 926 (9th Cir. 2001). The case was remanded for an evidentiary hearing as to whether Judge Marquardt was competent when he was deliberating on whether to impose the death penalty. Id. at 957.\n\nIn the meantime, the United States Supreme Court granted certiorari in State v. Ring, 25 P.3d 1139 (Ariz. 2001), cert. granted, 534 U.S. 1103 (2002), which involved a potential reexamination of Arizona's death penalty statute in light of the Sixth Amendment. Because this was an issue that had been raised by Summerlin in his state and federal court petitions, the panel withdrew its decision and deferred submission of the case pending the Supreme Court's resolution of Ring. See Summerlin v. Stewart, 281 F.3d 836, 837 (9th Cir. 2002). Later that year, the Supreme Court issued its decision in Ring v. Arizona, holding that Arizona's capital sentencing scheme was incompatible with the Sixth Amendment right to a trial by jury. 536 U.S. at 609.\n\nFollowing the Supreme Court's Ring decision, Summerlin moved to stay the proceedings in this case. Summerlin desired the stay so that he could request that the Arizona Supreme Court recall the mandate in his direct appeal to consider Ring's application to his case. Such a procedure is cognizable under Arizona state law. See Lindus v. N. Ins. Co. of N.Y., 438 P.2d 311, 313 (Ariz. 1968) (describing doctrine); see also State v. Ariz. Dep't of Corrs., 928 P.2d 635, 636 (Ariz. 1996) (applying procedure to consider retroactivity of judicial ruling). The panel granted the stay request. Subsequently, the Arizona Supreme Court denied Summerlin's motion to recall the mandate. This decision exhausted all of Summerlin's potential state remedies. Cf. Wood v. Kemna, 13 F.3d 1244, 1245-46 (8th Cir. 1994) (noting that habeas petitioners need not ordinarily resort to extraordinary state remedies, such as recall of the mandate, to satisfy federal exhaustion requirements, but holding that exhaustion might be required when there was a real possibility of relief under extraordinary and unique circumstances).\n\nAfter the Arizona Supreme Court denied Summerlin's motion to recall the mandate, the panel requested a vote of our Court as to whether this case should be reheard en banc. Following an affirmative vote of a majority of the non-recused active members of the Court, see Summerlin v. Stewart, 310 F.3d 1221 (9th Cir. 2002), the case was reheard en banc on December 10, 2002.\n\nWe have jurisdiction pursuant to 28 U.S.C. § 2253. The Warden does not contend that Summerlin failed to exhaust his state remedies or that any of his claims are procedurally defaulted. Because this appeal was filed after the effective date of the Antiterrorism and Effective Death Penalty Act of 1996, Pub. L. No. 104-132, 110 Stat. 1214 (\"AEDPA\"), the right to appeal in this case is governed by AEDPA rules. See Slack v. McDaniel, 529 U.S. 473, 482 (2000). However, because the petition for habeas corpus was filed before AEDPA's effective date, pre-AEDPA law governs the petition itself. See Lindh v. Murphy, 521 U.S. 320, 327 (1997).\n\nSummerlin argues on appeal that:\n\n1. He did not receive effective assistance of counsel during the guilt phase of his trial in violation of his rights under the Sixth Amendment;\n\n2. The Arizona death penalty statute, as applied to him, is unconstitutional in that it permits a judge rather than a jury to determine the elements necessary for a capital sentence;\n\n3. He did not receive effective assistance of counsel during the sentencing phase of his capital trial in violation of his rights under the Sixth Amendment;\n\n4. His court-appointed public defender had a conflict of interest that adversely affected her representation at a critical stage of the proceedings, in violation of his rights under the Sixth Amendment;\n\n5. He was deprived of his right to due process of law because the trial judge was addicted to marijuana during his trial and deliberated over his sentence while under the influence of marijuana; and\n\n6. Cumulative errors require reversal of his sentence and conviction.\n\nSummerlin's only claim specific to the conviction phase alone is his argument that he received ineffective assistance of counsel during his guilt-phase trial. With the exception of his cumulative error contention, the remainder of Summerlin's claims relate to the imposition of the death sentence.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nII.\n\nSummerlin alleges that he was denied the effective assistance of counsel at the guilt phase of his murder trial in violation of the Sixth Amendment as interpreted in Strickland v. Washington, 466 U.S. 668 (1984). We review the dismissal of a habeas petition de novo, including the mixed questions of law and fact raised by claims alleging ineffective assistance of counsel. See Williams v. Woodford, 306 F.3d 665, 684 (9th Cir. 2002); Hendricks v. Calderon, 70 F.3d 1032, 1036 (9th Cir. 1995).\n\nTo prevail on this claim, Summerlin must demonstrate first that the performance of his counsel fell below an objective standard of reasonableness, and second that \"there is a reasonable probability that, but for counsel's unprofessional errors, the result of the proceeding would have been different.\" Strickland, 466 U.S. at 694. Failure to satisfy either prong of the Strickland test obviates the need to consider the other. See id. at 687.\n\nWe begin with the \"strong presumption that counsel's conduct falls within the wide range of reasonable professional assistance,\" and with the acknowledgment that \"[j]udicial scrutiny of counsel's performance must be highly deferential.\" Id. at 689. However, defense counsel has \"a duty to make reasonable investigations or to make a reasonable decision that makes particular investigations unnecessary.\" Id. at 691. \"[S]trategic choices made after less than complete investigation are reasonable precisely to the extent that reasonable professional judgments support the limitations on investigation.\" Id. at 690-91.\n\nSummerlin alleges that his trial lawyer failed to investigate and to present his \"only viable defense,\" namely, that Summerlin had an organic brain dysfunction and an \"impaired ability to premeditate or to exercise self-control.\" To analyze this issue properly, we must examine the mental defenses then available under Arizona law. At the time, Arizona had adopted the M'Naghten test \"as the sole standard for criminal responsibility.\" State v. Ramos, 648 P.2d 119, 121 (Ariz. 1981) (internal quotation marks omitted). To sustain a defense of legal insanity:\n\nAn accused must have had at the time of the commission of the criminal act: (1) Such a defect of reason as not to know the nature and quality of the act, or (2) If he did know, that he did not know he was doing what was wrong.\n\nState v. Christensen, 628 P.2d 580, 583 (Ariz. 1981).\n\nAt the time Summerlin was charged, Arizona already had rejected the affirmative defense of diminished capacity. See State v. Mott, 931 P.2d 1046, 1051 (Ariz. 1997) (\"Because the legislature has not provided for a diminished capacity defense, we have since consistently refused to allow psychiatric testimony to negate specific intent.\"). Thus, the situation that confronted Klink was unlike that in Pirtle v. Morgan, 313 F.3d 1160, 1169-73 (9th Cir. 2002) (holding that counsel had been constitutionally ineffective for not asserting a diminished capacity defense then available under Washington law).\n\nThe Arizona Supreme Court also had held, as a matter of law, that criminal defendants could not present psychiatric testimony to negate the element of specific intent. State v. Laffoon, 610 P.2d 1045, 1047 (Ariz. 1980). Arizona did allow the introduction of psychiatric evidence as to a defendant's tendency to act on impulse as probative of an absence of premeditation. Christensen, 628 P.2d at 582-83. However, under Arizona law, the standard for establishing premeditation is not high. The prosecution only need show that the defendant \"had time to reflect after forming the intent to kill.\" Clabourne v. Lewis, 64 F.3d 1373, 1380 (9th Cir. 1995) (citing State v. Neal, 692 P.2d 272, 276 (Ariz. 1984)). \"This length of time could have been as instantaneous as it takes to form successive thoughts in the mind, and premeditation may be proven by circumstantial evidence.\" Neal, 692 P.2d at 276 (citing State v. Lacquey, 571 P.2d 1027, 1030 (Ariz. 1977)).\n\nThus, Summerlin's trial counsel faced formidable legal hurdles in presenting a psychiatric defense at the guilt phase. Nonetheless, counsel conducted a substantial amount of investigation into a potential psychiatric defense. Summerlin's first counsel moved for a mental examination under Ariz. R. Crim. P. 11 to determine whether Summerlin was competent to stand trial. Upon examination, Dr. Tuchler concluded that Summerlin, although \"functionally mentally retarded,\" did not have a mental disease or defect. Before she withdrew from the case, Roe thoroughly investigated Dr. Garcia-Bunuel's suspicion of psychomotor epilepsy. She obtained neurological testing and pursued this possible diagnosis with Dr. Bendheim, as revealed in the following letter the doctor sent to Judge Derickson in December 1981:\n\nWe again discussed the possibility of psychomotor epilepsy, especially in view of Dr. Garcia-Bunuel's findings that this man had very vivid olfactory (smell) hallucinations preceding outbursts. I went over this whole situation again and told Miss [Roe] that the neurologists have been unable to find psychomotor epilepsy, although there was some slowing of the wave patterns in the temporal lobes, where psychomotor epileptic attacks usually originate.\n\nWhile a positive electroencephalogram, which was not obtained here, would make a positive diagnosis, an essentially negative EEG does not entirely rule out the possibility of epileptic-type seizures, and for this reason I see absolutely no harm and potentially quite a bit of benefit to place this defendant on antiepileptic, anti-seizure type medication, even though the diagnosis has not been established.\n\nDuring post-conviction hearings, Roe testified that she met with trial counsel Klink on two or three occasions and spent a number of hours discussing her investigative efforts and the viability of a possible insanity defense. She stated that she discussed this aspect of the case with Klink \"at great length,\" explaining to Klink the examinations and conclusions of all of the examining doctors. Klink testified that, after consulting with Roe, he made a tactical decision not to pursue an insanity defense due to the lack of evidence.\n\nKlink did not follow up on Dr. Garcia-Bunuel's earlier suspicion of psychomotor epilepsy because the doctor had changed his opinion and was out of the country at the time of trial. Instead, Klink made a decision to defend his client by arguing that the facts and circumstances of the prosecution's case did not support a verdict of first-degree murder. Summerlin himself desired this fact-based defense.\n\nIn assessing an attorney's performance, a reviewing court must make every effort \"to eliminate the distorting effects of hindsight, to reconstruct the circumstances of counsel's challenged conduct, and to evaluate the conduct from counsel's perspective at the time.\" Strickland, 466 U.S. at 689. As the Supreme Court recently reiterated, this evaluation must include \"an objective review of [counsel's] performance, measured for 'reasonableness under prevailing professional norms,' which includes a context-dependent consideration of the challenged conduct.\" Wiggins v. Smith, ___ U.S. ___, 123 S. Ct. 2527, 2536 (2003) (quoting Strickland, 466 U.S. at 688).\n\n[1] A review of the record indicates that Klink's trial performance did not fall below the objective standard of reasonableness required under Strickland. In deciding whether to pursue evidence of Summerlin's mental state, Klink was entitled to rely on the opinions of the mental health experts who already had examined Summerlin. See Hendricks, 70 F.3d at 1038. At the time, none of the doctors would opine that Summerlin was suffering from a mental disease or defect that would provide a foundation for an insanity defense. None of the physicians, including Dr. Garcia-Bunuel, was able to diagnose Summerlin as clearly suffering from psychomotor epilepsy. It thus was reasonable for Klink not to investigate this possibility further. Cf. Wiggins, 123 S. Ct. at 2536-38 (upholding an ineffective assistance claim against counsel who curtailed investigation despite promising leads in preliminary discovery).\n\nLikewise, given the doctors' inability to make a diagnosis, Klink's tactical decision to forgo presenting what little evidence he had of epilepsy was certainly within the \"wide range of professionally competent assistance.\" Strickland, 466 U.S. at 690; see also Harris v. Vasquez, 949 F.2d 1497, 1525 (9th Cir. 1990) (\"It is also acceptable trial strategy to choose not to call psychiatrists to testify when they can be subjected to cross-examination based on equally persuasive psychiatric opinions that reach a different conclusion.\").\n\nPsychiatric testimony would have been admissible concerning Summerlin's impulsive personality to show absence of premeditation. See Vickers v. Ricketts, 798 F.2d 369, 372-73 (9th Cir. 1986). However, under the circumstances of the case, Summerlin has not shown that he was prejudiced by the failure to introduce such testimony. The basis of the State's premeditation theory was not that Summerlin had planned the crime; rather, it was that he formed the required premeditation during the commission of the crime. To prove its point, the State relied on the circumstances surrounding the crime, including the fact that sexual assault occurred prior to the murder and the fact that Summerlin had retrieved a blunt object after the assault to commit the murder.\n\nThe State also relied on the uncontroverted evidence as to how the murder was committed, specifically that Bailey had been hit repeatedly and forcefully on each side of her head. As the Supreme Court of Arizona later noted, Summerlin's \"excessive and purposeful actions demonstrate more than just a 'reactionary' homicide.\" State v. Summerlin, 675 P.2d at 694. The State underscored this theory with presentation of graphic photographic evidence of the numerous wounds sustained by Bailey. The State's witness testified that any one of the blows to the victim's head was sufficient to kill the victim, yet numerous, deep lacerations were evident from the photographs.\n\n[2] Klink was not questioned during the post-conviction hearings about his choice not to present psychiatric evidence of impulsiveness, so we do not know whether this decision was strategic. However, after carefully reviewing the record, the district court concluded that there is no reasonable probability the jury would have acquitted Summerlin of first-degree murder had Klink introduced evidence of Summerlin's impulsive personality. The district court therefore concluded that Summerlin could not establish Strickland prejudice as to this claim. See 466 U.S. at 691 (\"An error by counsel, even if professionally unreasonable, does not warrant setting aside the judgment of a criminal proceeding if the error had no effect on the judgment.\").\n\n[3] The district court's assessment was correct. The psychiatric testimony on this point would have been limited to a general description of Summerlin's behavioral tendencies. Given the State's theory, this would have had only marginal probative value in determining whether Summerlin formed premeditation during the commission of the offense. The jury was instructed properly on the State's premeditation theory, which was a correct statement of Arizona law. In this context, and considering the \"totality of the evidence,\" additional psychiatric testimony would not have generated a \"reasonable probability that at least one juror would have struck a different balance.\" Wiggins, 123 S. Ct. at 2543. Thus, Summerlin has not established a \"probability sufficient to undermine confidence in the outcome\" of the guilt phase of his trial. Strickland, 466 U.S. at 694.\n\nIII.\n\nThe first penalty-phase question presented to us is whether the Arizona death penalty statute, as applied to Summerlin, is unconstitutional in that it permits a judge rather than a jury to determine the elements necessary for a death sentence. The Supreme Court recently has held that Arizona's capital sentencing scheme was incompatible with the Sixth Amendment right to a trial by jury \"to the extent that it allow[ed] a sentencing judge, sitting without a jury, to find an aggravating circumstance necessary for imposition of the death penalty.\" Ring, 536 U.S. at 609. The Supreme Court did not decide whether the holding in Ring applied to petitioners, such as Summerlin, who raised the constitutional challenge in collateral post-conviction proceedings rather than on direct appeal.\n\nBecause the Warden has argued that Teague v. Lane, 489 U.S. 288 (1989), bars relief on this issue, we must decide whether Ring has retroactive application to cases on federal habeas review. Horn v. Banks, 536 U.S. 266, 272 (2002) (holding that the court of appeals erred by not performing a Teague analysis when the issue was \"properly raised by the state\") (citing Caspari v. Bohlen, 510 U.S. 383, 389 (1994) (\"[I]f the State does argue that the defendant seeks the benefit of a new rule of constitutional law, the court must apply Teague before considering the merits of the claim.\") (emphasis in original)).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nIn short, now that the Supreme Court has decided that Timothy Ring's capital murder conviction must be vacated because the judge was constitutionally disqualified from deciding whether Ring was eligible for the death penalty, the question is whether others who received the same constitutionally infirm sentence, including those who previously raised the identical issue,\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e are eligible for the same relief or whether they should remain subject to execution.\n\nThe question of whether a newly announced constitutional rule will apply retroactively on collateral review is a relatively recent inquiry in American jurisprudence. As Justice Holmes observed at the turn of the century, \"[j]udicial decisions have had retrospective operation for near a thousand years.\" Kuhn v. Fairmont Coal Co., 215 U.S. 349, 372 (1910) (Holmes, J., dissenting). At common law, the retroactivity question never arose because judges were believed to be discovering rules rather than declaring them. John C. Gray, The Nature and Sources of the Law 222 (1st ed. 1909). Even now, a presumption exists that \"a court is to apply the law in effect at the time it renders its decision, unless doing so would result in manifest injustice or there is statutory direction or legislative history to the contrary.\" Bradley v. Sch. Bd. of Richmond, 416 U.S. 696, 711 (1974). As the Supreme Court noted, \" '[B]oth the common law and our own decisions' have 'recognized a general rule of retrospective effect for the constitutional decisions of this Court.' \" Harper v. Va. Dep't of Taxation, 509 U.S. 86, 94 (1993) (quoting Robinson v. Neil, 409 U.S. 505, 507 (1973)).\n\nFollowing the Civil War and enactment of the Fourteenth Amendment, Congress expanded the scope of habeas corpus review to cover challenges brought by those in state custody, see Act of 1867, ch. 28, § 1, 14 Stat. 385 (codified as amended at 28 U.S.C. § 2241(c)(3)), prompting the Supreme Court to determine the proper scope of federal habeas jurisdiction. By 1953, the Supreme Court confirmed the cognizability of all federal constitutional claims filed by state prisoners. Brown v. Allen, 344 U.S. 443 (1953). The expanding scope of federal review, coupled with a significant increase in the filing of federal habeas petitions by state prisoners, provided the Supreme Court with the opportunity to review for the first time a number of alleged constitutional deprivations. Walter V. Schaefer, Federalism and State Criminal Procedure, 70 Harv. L. Rev. 1, 21-22 (1956). Epochal constitutional criminal procedural protections were announced, and in their wake, a novel discussion arose as to whether a new constitutional rule of criminal procedure should be applied retroactively on direct or collateral review. This debate, a \"product of the Court's disquietude with the impacts of its fast-moving pace of constitutional innovation in the criminal field,\" Mackey v. United States, 401 U.S. 667, 676 (1971) (Harlan, J., concurring in part and dissenting in part), culminated in Linkletter v. Walker, 381 U.S. 618 (1965).\n\nIn Linkletter, a defendant was convicted based on evidence that was obtained during a warrantless search. A year after the defendant had exhausted his state appeals, the Supreme Court decided Mapp v. Ohio, 367 U.S. 643 (1961). Subsequently, the defendant filed a habeas petition arguing that Mapp required reversal of his conviction. The Supreme Court held that even though \"the Constitution neither prohibits nor requires retrospective effect,\" Linkletter, 381 U.S. at 629, a constitutional rule of criminal procedure would not be retroactive unless, under a case-by-case analysis, three factors-the purpose of the new rule, reliance on prior doctrine, and the effect of retroactivity on the administration of justice-favor retroactive application of the rule. Id. at 636. The Linkletter rule applied to convictions pending on direct review as well as to final convictions challenged collaterally by a federal habeas petition. Johnson v. New Jersey, 384 U.S. 719, 732 (1966).\n\nThe tripartite Linkletter test proved difficult to apply. Justice Harlan observed that it had fostered the creation of \"an extraordinary collection of rules to govern the application of that principle.\" Desist v. United States, 394 U.S. 244, 256-57 (1969) (Harlan, J., dissenting). He contended that the test produced inconsistent results, leading to different treatment for similarly-situated defendants. See id.\n\nJustice Harlan remained critical of the Linkletter test throughout a series of subsequent cases. See, e.g., Mackey, 401 U.S. at 675 (Harlan, J., concurring in part and dissenting in part); Coleman v. Alabama, 399 U.S. 1, 19 (1970) (Harlan, J., concurring in part and dissenting in part); Von Cleef v. New Jersey, 395 U.S. 814, 817 (1969) (Harlan, J., concurring in result); Jenkins v. Delaware, 395 U.S. 213, 222 (1969) (Harlan, J., dissenting); Desist, 394 U.S. at 256 (Harlan, J., dissenting). He argued instead that new constitutional rules ought to apply to all cases that were not final or that were pending on direct review. Mackey, 401 U.S. at 678-80. He also contended that new procedural (as opposed to substantive) due process rules ought not to apply retroactively on habeas review unless the claim implicated procedures \"implicit in the concept of ordered liberty\" or addressed rules that \"alter our understanding of the bedrock procedural elements that must be found to vitiate the fairness of a particular conviction.\" Id. at 693-94 (internal quotation marks and citations omitted).\n\nThe analytical framework propounded by Justice Harlan ultimately proved persuasive. In Griffith v. Kentucky, 479 U.S. 314 (1987), the Supreme Court adopted the first portion of Justice Harlan's analysis, noting that \"[i]n Justice Harlan's view, and now in ours, failure to apply a newly declared constitutional rule to criminal cases pending on direct review violates basic norms of constitutional adjudication.\" Id. at 322.\n\nThe Court therefore held that \"a new rule for the conduct of criminal prosecutions is to be applied retroactively to all cases, state or federal, pending on direct review or not yet final.\" Id. at 328.\n\n[4] Two years later, the Court clarified its retroactivity jurisprudence in the habeas context in Teague. Importing Justice Harlan's analysis, Teague held that \"[u]nless they fall within an exception to the general rule, new constitutional rules of criminal procedure will not be applicable to those cases which have become final before the new rules are announced.\" 489 U.S. at 310.\n\n[5] Teague also adopted Justice Harlan's two exceptions, providing that a new rule of criminal procedure would be retroactive if it \"place[d] certain kinds of primary, private individual conduct beyond the criminal law-making authority to proscribe,\" or if the rule \"require[d] the observance of those procedures that . . . are implicit in the concept of ordered liberty.\" Id. at 311 (internal quotation marks omitted). The Supreme Court explained that the second exception had two components, formulated by combining aspects from Justice Harlan's dissents in Desist and Mackey. The Court thus limited the exception for \"watershed rules of criminal procedure\" to those procedures that both \"alter our understanding of the bedrock procedural elements that must be found to vitiate the fairness of a particular conviction,\" id. (quoting Mackey, 401 U.S. at 693) (internal quotation marks omitted; emphasis added in Teague), and \"without which the likelihood of an accurate conviction is seriously diminished.\" Id. at 313.\n\n[6] Before applying these concepts to the instant case, it is important to set the appropriate analytic framework. The threshold question in a Teague analysis is whether the rule the petitioner seeks to apply is a substantive rule or a procedural rule, because \"Teague by its terms only applies to procedural rules.\" Bousley v. United States, 523 U.S. 614, 620 (1998). If the rule is procedural, the court then conducts a three-step analysis to determine whether Teague bars its application. See O'Dell v. Netherland, 521 U.S. 151, 156-57 (1997). First, the reviewing court \"must ascertain the date on which the defendant's conviction and sentence became final for Teague purposes.\" Caspari, 510 U.S. at 390. Second, the court must survey \"the legal landscape as it then existed,\" Graham v. Collins, 506 U.S. 461, 468 (1993), to determine whether existing precedent compelled a finding that the rule at issue \"was required by the Constitution.\" Lambrix v. Singletary, 520 U.S. 518, 527 (1997) (internal quotation marks and citations omitted). If existing precedent already required application of the rule, the Teague bar does not apply. If, by contrast, the procedure at issue is considered a new rule for Teague purposes, the court must proceed to the third step and determine whether either of the two announced exceptions applies. Teague, 489 U.S. at 307 (plurality). The presumption against retroactivity is overcome only if the new rule prohibits \"a certain category of punishment for a class of defendants because of their status or offense,\" Penry v. Lynaugh, 492 U.S. 302, 330 (1989), abrogated on other grounds by Atkins v. Virginia, 122 S. Ct. 2242 (2002), or presents a new \"watershed rule of criminal procedure\" that enhances accuracy and alters our understanding of bedrock procedural elements essential to the fairness of a particular conviction. Teague, 489 U.S. at 311 (plurality; citations omitted).\n\nIV.\n\nWe first consider the threshold Teague question, namely whether Ring announced a substantive rule or a procedural rule. See Bousley, 523 U.S. at 620. Unlike strictly procedural rules, \"new rules of substantive criminal law are presumptively retroactive.\" See, e.g., Santana-Madera v. United States, 260 F.3d 133, 138 (2d Cir. 2001) (citing United States v. Mandanici, 205 F.3d 519, 525 (2d Cir. 2000)), cert. denied, 534 U.S. 1083 (2002). Thus, the Teague retroactivity bar does not apply if the rule Ring announced is substantive, rather than procedural, in nature. Bousley, 523 U.S. at 620.\n\nAs Erie doctrine demonstrates in the context of civil litigation, the distinction between \"substantive\" and \"procedural\" is not always easy to divine. Erie R.R. Co. v. Tompkins, 304 U.S. 64 (1938); see also Hanna v. Plumer, 380 U.S. 460, 471-74 (1965); Guar. Trust Co. of N.Y. v. York, 326 U.S. 99, 109 (1945). The Supreme Court acknowledged this problem in a pre-Teague consideration of the difference between substantive and procedural criminal law, noting that \"[w]e would not suggest that the distinction that we draw is an ironclad one that will invariably result in the easy classification of cases in one category or the other.\" Robinson, 409 U.S. at 509.\n\nHowever difficult it is to locate, though, \"[t]his distinction between substance and procedure is an important one in the habeas context.\" Bousley, 523 U.S. at 620. In giving shape to this important distinction, the Supreme Court has understood decisions of \"criminal procedure\" to be those decisions that implicate how the criminal trial process functions. Under Teague, only those decisions of \"procedure\" that insert into the criminal trial process a mechanism \" 'without [which] the likelihood of an accurate conviction is seriously diminished' \" apply retroactively. Id. (quoting Teague, 489 U.S. at 313).\n\n[7] Decisions of \"substantive criminal law,\" by contrast, are those that reach beyond issues of procedural function and address the meaning, scope, and application of substantive criminal statutes. Id. (noting that a Supreme Court holding is \"substantive\" for Teague purposes when it impacts the scope and application of a \"substantive federal criminal statute\"); see also Davis v. United States, 417 U.S. 333, 346 (1974) (including within the definition of \"substantive\" those decisions that remove primary conduct from the purview of criminal punishment). Thus, for Teague purposes, a new rule is one of \"procedure\" if it impacts the operation of the criminal trial process, and a new rule is one of \"substance\" if it alters the scope or modifies the applicability of a substantive criminal statute. Bousley, 523 U.S. at 620.\n\nIn Bousley, the Supreme Court applied this substantiveprocedural logic, rejecting the government's Teague-based non-retroactivity argument because the case called for a construction of a federal statute. Teague, Chief Justice Rehnquist explained, \"is inapplicable to the situation in which this Court decides the meaning of a criminal statute enacted by Congress.\" Id. For the same reason, we recently determined that the rule announced in Richardson v. United States, 526 U.S. 813, 815 (1999), requiring jury unanimity on individual violations alleged as part of a continuing criminal enterprise, is substantive, not procedural, under Teague. See United States v. Montalvo, 331 F.3d 1052 (9th Cir. 2003). All of our sister circuits that have considered the question agree with this categorization.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\n\"[S]ignificant\" to both this court's and our sister circuits' understanding of Richardson's rule as substantive is the fact that Richardson \"was 'decid[ing] the meaning of a criminal statute.' \" Montalvo, 331 F.3d at 1056 (citation omitted; alteration in original); see also Murr, 200 F.3d at 906. Explaining or redefining elements of an offense, we observed in Montalvo, constitutes a decision of substantive criminal law for Teague purposes. 331 F.3d at 1055-56; see also United States v. Dashney, 52 F.3d 298, 299 (10th Cir. 1995). Thus, because Richardson expressly \"analyz[ed] what constitutes 'elements' as opposed to brute facts or 'means' \" of an offense, the rule Richardson announced was substantive for Teague purposes. Montalvo, 331 F.3d at 1056.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nIn the habeas context in particular, as Chief Judge Becker has observed, there are those cases that do \"not fall neatly under either the substantive or procedural doctrinal category.\" United States v. Woods, 986 F.2d 669, 677 (3d Cir. 1993). In such cases, \"the best approach is to recognize that [the case at issue] is neither entirely substantive nor procedural.\" Id. at 678. Ring is such a decision.\n\nIn one sense, Ring-like Apprendi-announced a procedural rule: Ring mandated that a jury, rather than a judge, must find aggravating circumstances in a capital case. Ring's holding thus addressed, at least in part, the procedure by which any capital trial must be conducted. See Cannon v. Mullin, 297 F.3d 989, 994 (10th Cir. 2002) (assessing the operation of Ring on Oklahoma law).\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\n[8] In the context of substantive Arizona criminal law, however, Ring did more than answer a strictly procedural question. Thus, Ring is unlike Apprendi, in which the Supreme Court expressly declared that its decision had no impact on substantive criminal law, noting that \"[t]he substantive basis for New Jersey's enhancement is not at issue.\" 530 U.S. at 475. By important contrast, the substantive basis for Arizona's capital sentencing scheme was precisely at issue in Ring.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Ring rendered Arizona's substantive capital murder statute unconstitutional. More than a procedural holding, Ring effected a redefinition of Arizona capital murder law, restoring, as a matter of substantive law, an earlier Arizona legal paradigm in which murder and capital murder are separate substantive offenses with different essential elements and different forms of potential punishment. That is, as applied to the particular Arizona murder statute at issue here, Ring's holding was \"substantive\" for Teague purposes. See Bousley, 523 U.S. at 620 (noting that a Supreme Court holding is \"substantive\" when it impacts the scope and application of a \"substantive federal criminal statute\"). A careful analysis of the structure and history of the relevant Arizona statutes, coupled with a close examination of the underlying rationale of Ring and the Supreme Court's related jurisprudence, reveals that Ring is, as to Arizona, a \"substantive\" decision, even if its form is partially procedural.\n\nIn 1901, the Territory of Arizona enacted its first death penalty statute, leaving capital sentencing to the discretion of the jury except where the defendant entered a plea of guilty. See Ariz. Territorial Rev. Stat., tit. 8, § 174 (1901). In relevant part, the 1901 Arizona statute provided that\n\n[e]very person guilty of murder in the first degree shall suffer death or imprisonment . . . for life, at the discretion of the jury trying the same, or, upon the plea of guilty, the court shall determine the same.\n\nId.\n\nIn 1916, Arizona abolished the death penalty by state initiative, see Act of Dec. 8, 1916, 1917 Ariz. Session Laws, Initiative and Referendum Measures, at 4-5, but the 1901 death penalty statute was restored through similar political means in 1918. See Act of Dec. 5, 1918, 1919 Ariz. Sess. Laws, Initiative and Referendum Measures, at 18.\n\nFollowing the 1918 initiative, Arizona's death penalty scheme remained largely unchanged for more than 50 years. From 1919 until 1972, Arizona committed the decision as to whether to impose the penalty of death following a criminal trial to the complete discretion of the jury. See Hernandez v. State, 32 P.2d 18, 20-21 (Ariz. 1934) (\"It is clear from this that the question of punishment in first-degree murder cases is wholly within the jury's discretion and that the court has no duty in connection therewith other than to advise it that it must determine which of the penalties-death or life imprisonment-shall be imposed upon the defendant if it finds him guilty of that offense.\").\n\nIn 1972, however, the Supreme Court held that death penalty statutes vesting complete discretion in the judge or in the jury, like Arizona's, were unconstitutional. Furman v. Georgia, 408 U.S. 238 (1972) (per curiam). The impact of Furman particularly is instructive in this context. There was no doubt, importantly, that Furman had retroactive effect. See Moore v. Illinois, 408 U.S. 786, 800 (1972) (applying Furman on habeas review); United States v. Johnson, 457 U.S. 537, 550 (1982) (discussing same). Following the dictates of Furman and Stewart v. Massachusetts, 408 U.S. 845 (1972), the Supreme Court vacated a number of Arizona death sentences, both on direct appeal and on collateral habeas review. See, e.g., Alford v. Eyman, 408 U.S. 939 (1972) (habeas); Kruchten v. Eyman, 408 U.S. 934 (1972) (habeas); Sims v. Eyman, 408 U.S. 934 (1972) (habeas); Gause v. Arizona, 409 U.S. 815 (1972) (direct review). In light of this Supreme Court precedent, the Arizona Supreme Court declared the Arizona death penalty statute to be unconstitutional under the Eighth and Fourteenth Amendments. See State v. Endreson, 506 P.2d 248, 254 (Ariz. 1973). The Arizona court acknowledged, after examining the structure of the relevant Arizona criminal statutes, that the Supreme Court, through Furman, had \"abolished 'capital offenses' in Arizona\" substantively. In re Tarr, 508 P.2d 728, 729 (Ariz. 1973). In short, the effect of Furman in declaring Arizona's capital murder statute unconstitutional was unquestionably substantive.\n\nA year later, in 1973, Arizona enacted a new \"capital offense\" statute. This new statute established sentencing standards in capital cases and provided for sentencing by judge, rather than by jury. See Act of May 14, 1973, ch. 138, § 5, 1973 Ariz. Sess. Laws 966, 968-70. The 1973 statute identified six aggravating circumstances and four mitigating circumstances for sentencing courts to consider and required the court to impose a death sentence only if it found (1) one or more aggravating circumstances to exist and (2) no countervailing mitigating circumstances \"sufficiently substantial to call for leniency.\" Id. In State v. Richmond, 560 P.2d 41 (Ariz. 1976), the Arizona Supreme Court upheld the constitutionality of the 1973 death penalty statute.\n\nBut the Supreme Court's decisions in Lockett v. Ohio, 438 U.S. 586 (1978), and Bell v. Ohio, 438 U.S. 637 (1978), which declared unconstitutional death penalty statutes that restricted the right of the defendant to show mitigating circumstances in capital cases raised anew questions of whether the 1973 Arizona statute could pass constitutional muster. To this end, in Bishop v. Arizona, 439 U.S. 810 (1978), the Supreme Court vacated and remanded an Arizona death sentence for reconsideration in light of Lockett. Following this remand, the Arizona Supreme Court held that Arizona's 1973 death penalty statute was unconstitutional insofar as it precluded the defendant from proving non-statutory mitigating circumstances. State v. Watson, 586 P.2d 1253, 1257 (Ariz. 1978).\n\nSoon thereafter, in 1979, the Arizona legislature amended the State's death penalty statute to conform to Lockett by defining as relevant mitigating circumstances \"any factors offered by the state or the defendant which are relevant in determining whether to impose a sentence less than death.\" These factors included, but were not limited to, the factors enumerated in the statute itself. Act of May 1, 1979, ch. 144, § 1, 1979 Ariz. Sess. Laws 449, at 450-51. The legislature added various aggravating and mitigating factors to the terms of the statute in 1977, 1978, 1984, and 1985, but, during this period, the essential structure of Arizona's death penalty statute remained the same. In 1983, the United States Supreme Court confirmed that, to be constitutional under the Eighth Amendment, a state's capital sentencing scheme must \"genuinely narrow the class of persons eligible for the death penalty and must reasonably justify the imposition of a more severe sentence on the defendant compared to others found guilty of murder.\" Zant v. Stephens, 462 U.S. 862, 877 (1983). Finding at least one aggravating factor \"narrows the class of persons eligible for the death penalty.\" Lowenfield v. Phelps, 484 U.S. 231, 244 (1988). Arizona's substantive revisions to its capital murder statute were designed to pass these constitutional requirements. Thus, as a result of Furman and its progeny, the crime of capital murder in Arizona was substantively altered. As Justice Thomas has observed: \"[I]n the area of capital punishment, unlike any other area, we have imposed special constraints on a legislature's ability to determine what facts shall lead to what punishment-we have restricted the legislature's ability to define crimes.\" Apprendi, 530 U.S. at 522-23 (Thomas, J., concurring).\n\nIn 1988, we considered a defendant's Sixth Amendment challenge to the Arizona death penalty statute. See Adamson v. Ricketts, 865 F.2d 1011 (9th Cir. 1988) (en banc). In Adamson, we noted that, \"[u]nder Arizona's revised code, all murder is not capital murder,\" id. at 1025, and that, under the code, Arizona had in effect defined capital murder to be a substantive offense separate from non-capital murder. Id. at 1026; see id. at 1025 (\"[W]e recognize that the mere use of labels . . . to compartmentalize the functions of judge and jury[ ] does not negate the very real possibility that what are called 'sentencing' decisions may in fact usurp jury fact-finding responsibilities.\"). We concluded in Adamson that, because the Arizona statute required the finding of aggravating factors before the death penalty could be imposed, the Arizona statute made these aggravating factors elements of the \"distinctive offense of capital murder,\" not mere sentencing factors relevant to increasing the punishment for a lesser offense. Id. at 1026-27 (emphasis in original). Accordingly, we held that \"Arizona's aggravating circumstances function as elements of the crime of capital murder requiring a jury's determination.\" Id. at 1027. Based on this understanding of Arizona law, we found Arizona's identification and treatment of the \"elements of the crime of capital murder as sentencing factors for determination by a judge,\" rather than as offense elements to be determined by the jury, to be \"impermissibl[e]\" and \"in violation of the Sixth Amendment.\" Id. at 1029.\n\nIn Walton, the Supreme Court abrogated our decision in Adamson. In pertinent part, Walton held that aggravating circumstances under Arizona law were only \"sentencing considerations,\" not \"elements of the offense\" of capital murder. Id. at 648 (citing Poland v. Arizona, 476 U.S. 147, 156 (1986)). But cf. id. at 710-14 (Stevens, J., dissenting) (suggesting that, \"under Arizona law,\" the aggravating factors are \"elements of a capital crime [ ] [that] must be determined by a jury\") (citations omitted). Thus, Walton refuted our decision in Adamson and concluded \"that the Arizona capital sentencing scheme does not violate the Sixth Amendment.\" Id. at 649.\n\nRing expressly overruled Walton in relevant part. 536 U.S. at 589. In considering the same statutory scheme at issue in Walton and Adamson, Ring squarely rejected Walton's interpretation of Arizona law, holding that \"Arizona's enumerated aggravating factors operate as 'the functional equivalent of an element of a greater offense.' \" Id. at 609 (quoting Apprendi, 530 U.S. at 494 n.19).\n\nIn so doing, Ring restored, as a matter of substantive law, the pre-Walton structure of capital murder law in Arizona; and, in so doing, Ring confirmed what we stated in Adamson: Under substantive Arizona law, there is a distinct offense of capital murder, and the aggravating circumstances that must be proven to a jury in order to impose a death sentence are elements of that distinct capital offense. 865 F.2d at 1025-28; see also Sattazahn v. Pennsylvania, 537 U.S. 101, 123 S. Ct. 732, 739 (2003) (\"Put simply, if the existence of any fact (other than a prior conviction) increases the maximum punishment that may be imposed on a defendant, that fact-no matter how the State labels it-constitutes an element, and must be found by a jury beyond a reasonable doubt.\") (opinion of Scalia, J.). That is, when Ring displaced Walton, the effect was to declare Arizona's understanding and treatment of the separate crime of capital murder, as Arizona defined it, unconstitutional. And when Ring overruled Walton, repositioning Arizona's aggravating factors as elements of the separate offense of capital murder and reshaping the structure of Arizona murder law, it necessarily altered both the substance of the offense of capital murder in Arizona and the substance of Arizona murder law more generally. Cf. Jones v. United States, 526 U.S. 227, 229 (1999) (holding that the federal carjacking statute established three separate offenses rather than a single crime with a choice of three maximum penalties). In response to Ring, the Arizona Supreme Court vacated all death sentences in cases pending on direct appeal, see State v. Smith, 50 P.3d 825, 831 (Ariz. 2002), and the Arizona legislature once more changed the substantive law pertaining to capital punishment-this time providing for jury sentencing in capital cases. See Act of Apr. 27, 2001, ch. 260, § 1, 2001 Ariz. Sess. Laws 1334, 1334.\n\nRing's understanding of capital murder as an offense both greater than and distinct from other murder crimes is neither unusual among the various States nor unrecognized by the Supreme Court. See, e.g., Atkins v. Virginia, 536 U.S. 304, 307 n.1 (2002) (noting that the two defendants were both \"indicted for capital murder\" but \"[t]he prosecution ultimately permitted [one] to plead guilty to first-degree murder in exchange for [ ] testimony against\" the other); Beck v. Alabama, 447 U.S. 625, 628 (1980) (noting that Alabama law treats \"[f]elony murder [as] [ ] a lesser included offense of the capital crime of robbery-intentional killing\").\n\nIn assessing the operation of Apprendi, in fact, Justice Scalia recently explained that \"the underlying offense of 'murder' is a distinct, lesser included offense of 'murder plus one or more aggravating circumstances.' \" Sattazahn, 123 S. Ct. at 739. Noting that there was \"no principled reason to distinguish . . . what constitutes an offense for purposes of the Sixth Amendment's jury-trial guarantee and what constitutes an 'offence' for purposes of the Fifth Amendment's Double Jeopardy Clause,\" Justice Scalia concluded \"that 'murder plus one or more aggravating circumstances' is a separate offense from 'murder' simpliciter.\" Id. at 739-40 (also citing Ring for the proposition that \" 'first-degree murder' . . . is properly understood to be a lesser included offense of 'first-degree murder plus aggravating circumstance(s)' \"); see also Apprendi, 530 U.S. at 501 (Thomas, J., concurring) (\"[I]f the legislature defines some core crime and then provides for increasing the punishment of that crime upon a finding of some aggravating fact[,] . . . the core crime and the aggravating fact together constitute an aggravated crime . . . . The aggravating fact is an element of the aggravated crime.\").\n\nRing compelled Arizona to reorder its substantive murder law in order to recognize this two-offense structure. With regard to Arizona murder law, then, Ring did more than announce a procedural rule vis-a-vis whether a judge or a jury is to decide if elements of a particular offense have been proven satisfactorily. Ring reintroduced \"capital murder\" as a separate substantive offense under Arizona law, redefining, in the process, what the substantive elements of this \"separate offense\" of capital murder are. See Apprendi, 530 U.S. at 541 (O'Connor, J., dissenting) (observing that the Arizona first-degree murder statute \"authorizes a maximum penalty of death only in a formal sense\" and only to the extent it explicitly cross-references the separate Arizona statutory provision requiring the finding of an aggravating circumstance before imposition of the death penalty). In this sense, Ring had an inescapably substantive impact in Arizona for Teague purposes.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\n[9] To be sure, states must ensure that their capital sentencing schemes comply with the minimal procedural requirements set forth in Ring. Still, in the context of Arizona capital murder law, Ring's rule is not limited to procedure. Ring did, as to Arizona, announce a substantive rule: It \"decide[d] the meaning of a criminal statute,\" see Bousley, 523 U.S. at 620, and it did so in a manner that both redefined the separate substantive offense of \"capital murder\" in Arizona and reinserted the distinction between murder and capital murder into Arizona's substantive criminal law structure. Under the Supreme Court's articulation of \"substantive\" decisions in Bousley, then, Ring announced a \"substantive\" rule, Bousley, 523 U.S. at 620, for it \"altered the meaning of [Arizona's] substantive criminal law.\" Santana-Madera, 260 F.3d at 139; cf. Cannon, 297 F.3d at 994 (holding Ring's rule to be procedural in a different capital murder context). When a decision affects the substantive elements of an offense, or how an offense is defined, it is necessarily a decision of substantive law. Dashney, 52 F.3d at 299. And because Ring is a \"substantive\" decision with regard to the meaning, structure, and ambit of the relevant provisions of Arizona's criminal law, Teague does not bar retroactive application of Ring to cases decided under those Arizona provisions, regardless of whether those cases are considered on direct or collateral review.\n\nThe Arizona Supreme Court considered this question in State v. Towery, 64 P.3d 828 (Ariz. 2003), and concluded that Ring was not a substantive decision. Id. at 833. More recently, the Arizona Supreme Court considered related issues in State v. Ring, 65 P.3d 915 (Ariz. 2003) (\"Ring II\"). In each case, the Arizona Supreme Court's conclusion was founded on an interpretation of federal law, namely a construction of Teague and Allen v. Hardy, 478 U.S. 255 (1986) (per curiam), in Towery and an analysis of the Ex Post Facto Clause in Ring II. Because the decisions in Towery and Ring II rest on federal law, and not state law, they do not bind us. Moore v. Sims, 442 U.S. 415, 428 (1979) (reiterating the familiar maxim that state courts possess final interpretive \"authority\" only regarding \"laws of the state\") (citing R.R. Comm'n v. Pullman Co., 312 U.S. 496, 498 (1941), and Gilchrist v. Interborough Co., 279 U.S. 159 (1929)); Kern-Limerick, Inc. v. Scurlock, 347 U.S. 110, 121 (1954) (noting that a federal court \"decide[s] for itself facts or constructions upon which federal constitutional issues rest\"); Crew Levick Co. v. Pennsylvania, 245 U.S. 292 (1917) (noting that federal courts determine federal questions independently); see also Haynes v. Washington, 373 U.S. 503, 515-16 (1963); Congoleum Corp. v. DLW Aktiengesellschaft, 729 F.2d 1240, 1242 (9th Cir. 1984); Calkins v. Graham, 667 F.2d 1292, 1295 n.1 (9th Cir. 1982). This is particularly true in the Eighth Amendment context. Wainwright v. Goode, 464 U.S. 78, 84 (1983). Nonetheless, the two opinions are worthy of analysis.\n\nIn Towery, the Arizona Supreme Court correctly concluded that Ring's rule is partially procedural under Teague. For the reasons previously stated, however, we respectfully disagree with Towery's conclusion that Ring's rule is entirely procedural. Ring's invalidation of Arizona's capital murder statute under the United States Constitution did more than alter \"who decides.\" Towery, 64 P.3d at 833. It restructured Arizona law and it redefined, as a substantive matter, how that law operates. It is, thus, incorrect to conclude that the repositioning of aggravating factors as elements of a separate offense did not constitute a \"substantive\" rule. Such a construction ignores that Ring's restructuring of the elements of the separate offense of capital murder is, at the very least, a determination of the \"meaning of a criminal statute,\" which is precisely the kind of decision that Towery itself recognizes as \"substantive.\" Id. at 832. Of equal importance is the fact that Ring's revival of the pre-Walton two-offense structure of Arizona murder law does \"address the criminal significance of certain facts,\" another kind of decision that Towery recognizes as \"substantive.\" Id.\n\nThe Arizona Supreme Court's analogy to Apprendi in Towery is flawed as well. As noted above, in Apprendi, \"[t]he substantive basis for New Jersey's enhancement [was] not at issue.\" 530 U.S. at 475. In Ring, conversely, the substantive basis of Arizona's capital murder regime was at issue, so much so that Ring restored as a matter of substantive law the pre-Walton capital murder paradigm in Arizona. As we held in Adamson, this regime had defined capital murder as a substantive offense separate from non-capital murder. 865 F.2d at 1026. This distinction was required to satisfy the Eighth Amendment's requirement that a capital sentencing scheme \"genuinely narrow the class of persons eligible for the death penalty.\" Zant, 462 U.S. at 877. Ring further required the Arizona legislature to amend the Arizona murder statute to conform to the requirements of the United States Constitution.\n\nThe Arizona Supreme Court's Ex Post Facto analysis in Ring II likewise does not alter our analysis. In Ring II, the Arizona Supreme Court concluded that applying Arizona's new sentencing statutes to previously convicted defendants did not violate the federal or state prohibitions against Ex Post Facto application of laws. Ring II, 65 P.3d at 928. To reach this conclusion, Ring II relied on three decisions: the Supreme Court's decisions in Dobbert v. Florida, 432 U.S. 282 (1977), and Collins v. Youngblood, 497 U.S. 37 (1990), and the Arizona Supreme Court's decision in State v. Correll, 715 P.2d 721 (Ariz. 1986), rev'd in part on other grounds by Correll v. Stewart, 137 F.3d 1404 (9th Cir. 1998). Ring II, 65 P.3d at 926-28. Like Dobbert, Ring II concluded, \"the statutory change between the two sentencing methods was 'clearly procedural' \" in that this legislative enactment merely addressed the \"who decides\" question. Id. at 927 (quoting Dobbert, 432 U.S. at 293-94).\n\nIn contrast to the post-Ring legislative changes at issue in Ring II, the Supreme Court's Ring decision itself was not merely procedural. Ring declared a portion of Arizona's prior law unconstitutional, demanded a redefinition of the meaning of that criminal statute, and prompted the legislative response at issue in Ring II, not by announcing a purely procedural rule, but by announcing, as a matter of substantive law, that Arizona's understanding and treatment of the separate crime of capital murder was unconstitutional. This is exactly the kind of decision that is \"substantive\" under Bousley, 523 U.S. at 620. Indeed, the very case law on which Ring II relies understands precisely this kind of rule to be of a \"substantive nature.\" See Collins, 497 U.S. at 51 (noting that a rule is substantive in the Ex Post Facto context where it implicates \"the definition of crimes, defenses, or punishments\"); Correll, 715 P.2d at 735 (holding that changes relating to aggravating circumstances constituted substantive changes to the offense of capital murder).\n\nTeague requires a different analytical lens from the one used by the Arizona Supreme Court in Ring II. We do not necessarily assess whether the action of the Arizona legislature, in response to Ring, effected a \"substantive\" change to Arizona law; rather, we examine whether the rule announced by the Supreme Court in Ring was a \"substantive\" one for Teague purposes. Analyzed under Teague, the rule announced by the Supreme Court in Ring, with its restructuring of Arizona murder law and its redefinition of the separate crime of capital murder, is necessarily a \"substantive\" rule. See Bousley, 523 U.S. at 620. Thus, Teague does not bar its application in this case.\n\nV.\n\n[10] In addition to Ring's substantive effect on Arizona law, a full Teague analysis of the unique procedural aspects of Ring provides an independent basis upon which to apply Ring retroactively to cases on collateral review.\n\nA.\n\n[11] In undertaking a Teague procedural analysis, we first must ascertain the date that Summerlin's conviction became final. Caspari, 510 U.S. at 390. Here, the Arizona Supreme Court denied rehearing of its opinion affirming his conviction and death sentence in 1984, see State v. Summerlin, 675 P.2d at 686, and Summerlin did not file a petition for a writ of certiorari with the Supreme Court. The relevant date thus is 1984. See Lambrix, 520 U.S. at 527 (noting that the defendant's conviction became final when his time for filing a petition for a writ of certiorari expired).\n\nNext, we \"survey the legal landscape\" as it existed in 1984 to determine whether the result in Ring was dictated by then-existing precedent. Graham, 506 U.S. at 468. Such examination is not limited to Supreme Court decisions. Williams v. Taylor, 529 U.S. 362, 381 (2000). Summerlin's conviction became final before the Supreme Court had decided Ring, which overturned Walton, which in turn abrogated our decision in Adamson.\n\nSummerlin contends that Ring does not announce a new rule because Adamson had found that Arizona's sentencing scheme denied defendants the \"right to a jury decision on the elements of the crime in violation of the Sixth and Fourteenth Amendments.\" 865 F.2d at 1023. Regardless of the merits of such argument for convictions made final in 1988, the operative time period is 1984. At that time, Summerlin in fact raised this exact challenge to the Arizona Supreme Court, which soundly rejected it. State v. Summerlin, 675 P.2d at 695. The state supreme court reasoned that Proffitt v. Florida, 428 U.S. 242 (1976), foreclosed such a challenge for two reasons. First, Proffitt found that jury sentencing in the capital context never has been held to be \"constitutionally required,\" and second, the United States Supreme Court speculated that judicial sentencing \"should lead, if anything, to even greater consistency\" in capital punishment. State v. Summerlin, 675 P.2d at 695 (quoting Proffitt, 428 U.S. at 252) (internal quotation marks omitted).\n\n[12] \"[T]he Teague doctrine 'validates reasonable, goodfaith interpretations of existing precedents made by state courts even though they are shown to be contrary to later decisions.' \" O'Dell, 521 U.S. at 156 (quoting Butler v. McKellar, 494 U.S. 407, 414 (1990)). Further, \"there can be no dispute that a decision announces a new rule if it expressly overrules a prior decision,\" Graham, 506 U.S. at 467, which Ring indisputably did. Ring, 536 U.S. at 608-609.\n\n[13] We therefore cannot say that a state court in 1984 \"would have acted objectively unreasonably by not extending the relief later sought in federal court.\" O'Dell, 521 U.S. at 156. Summerlin's argument fails because there is no doubt that Ring announced a new rule as that term is construed for Teague purposes. We must then proceed to the third stage of analysis, namely whether either of Teague's two exceptions apply.\n\nB.\n\n[14] The first Teague exception examines whether certain primary conduct has been decriminalized or whether certain classes of individuals are immunized from specified forms of punishment by the newly announced rule. Saffle v. Parks, 494 U.S. 484, 494 (1990) (permitting retroactive application of a new rule \"if the rule places a class of private conduct beyond the power of the State to proscribe or addresses a substantive categorical guarantee accorded by the Constitution\") (internal citations, quotation marks, and modifications omitted). Because Ring did not \"decriminalize a class of conduct nor prohibit the imposition of capital punishment on a particular class of persons,\" Graham, 506 U.S. at 477 (quoting Saffle, 494 U.S. at 495), the first exception is inapplicable to the instant ruling.\n\nC.\n\nTo fall within the second Teague exception, a new rule must: (1) seriously enhance the accuracy of the proceeding and (2) alter our understanding of bedrock procedural elements essential to the fairness of the proceeding. Sawyer v. Smith, 497 U.S. 227, 242 (1990).\n\nIn considering Ring's effect on the accuracy of the proceeding, it is important to note that this is a capital case. \"Where the State imposes the death penalty for a particular crime, . . . the Eighth Amendment imposes special limitations on that process.\" Payne v. Tennessee, 501 U.S. 808, 824 (1991). Under Teague, the focus on the \"accuracy of the . . . proceeding\" generally is understood to mean \"accurac[y] [in] determin[ing] . . . innocence or guilt.\" Graham, 506 U.S. at 478 (internal quotation marks omitted). However, as the United States Supreme Court has stated, penalty-phase proceedings also \" 'have the hallmarks of the trial on guilt or innocence.' \" Sattazahn, 123 S. Ct. at 737 (quoting Bullington v. Missouri, 451 U.S. 430, 439 (1981)). For this reason, a verdict rejecting the imposition of the death penalty prohibits a subsequent capital prosecution. See id.; Bullington, 415 U.S. at 439. This is consistent with the substantive consideration of capital murder as a crime distinct from ordinary murder. Sattazahn, 123 S. Ct. at 739. Accordingly, in the capital context, Teague's reference to \"accuracy in the proceedings\" contemplates the ultimate verdict in both the conviction and penalty phases.\n\n[15] The Supreme Court has long recognized that, in the capital context, \"the Eighth Amendment requires a greater degree of accuracy and factfinding than would be true in a non-capital case.\" Gilmore v. Taylor, 508 U.S. 333, 342 (1993).\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Indeed, as Justice Kennedy has observed, \"[a]ll of our Eighth Amendment jurisprudence concerning capital sentencing is directed toward the enhancement of reliability and accuracy in some sense.\" Sawyer, 497 U.S. at 243. Reformation of capital sentencing procedures has been presumed to meet the first requirement that the new rule substantially enhance the accuracy of the legal proceeding at issue. See id. (but emphasizing that the second \"bedrock procedural element\" requirement also must be met). Thus, on its face, the procedure at issue in Ring is sufficient to meet the first component of Teague's second exception. Moreover, upon close examination, the actual impact of procedural change dictated by Ring provides further support for finding that the Ring rule enhances the accuracy of the determination of capital murder in Arizona.\n\nThe Supreme Court recently observed that, in light of the past thirty years of actual experience, \"the superiority of judicial factfinding in capital cases is far from evident.\" Ring, 536 U.S. at 607. An examination of the procedure at issue makes apparent several reasons why fact-finding by a jury, rather than by a judge, is more likely to heighten the accuracy of capital sentencing proceedings in Arizona.\n\nFirst, Arizona penalty-phase presentations to judges bear much greater resemblance to traditional non-capital sentencing hearings than to proceedings required to \" 'have the hallmarks of the trial on guilt or innocence.' \" Sattazahn, 123 S. Ct. at 737 (quoting Bullington, 451 U.S. at 439). Penalty phases in jury trials are characterized by the orderly presentation of evidence and argument. In contrast, penalty-phase presentations to Arizona judges are capable of being extremely truncated affairs with heavy reliance on presentence reports and sentencing memoranda, and with formal court proceedings frequently limited to a brief argument by counsel. Whether this has been the product of the participants treating penalty-phase trials as mere sentencing hearings, or whether this is the natural product of the shorthand communication typical of non-capital sentencing proceedings is unknown. However, the results are clear. A quick survey of recent Ninth Circuit cases from Arizona illustrates the point. See, e.g., Beaty v. Stewart, 303 F.3d 975, 988 (9th Cir. 2002) (no mitigating evidence presented), petition for cert. filed, No. 02-1611, 71 U.S.L.W. 3530 (Jan. 23, 2003); Lambright v. Stewart, 241 F.3d 1201, 1202-03 (9th Cir. 2001) (no argument presented, and mitigating evidence consumed three transcript pages), cert. denied, 534 U.S. 1118 (2002); Smith v. Stewart, 189 F.3d 1004, 1010 (9th Cir. 1999) (attorney asked court for advice on what legal and evidentiary considerations could be relevant in establishing mitigation; only brief argument on day of sentencing); Correll v. Stewart, 137 F.3d 1404, 1410 (9th Cir. 1998) (no defense witnesses presented; only brief argument); Clabourne, 64 F.3d at 1384 (no witnesses presented; only one mitigating circumstance argued).\n\nIn addition, because penalty-phase presentations to judges tend to resemble non-capital sentencing proceedings, the sentencing judge receives an inordinate amount of inadmissible evidence, which he or she is expected to ignore. Indeed, the focus of penalty-phase proceedings before judges has been the presentence report prepared by the probation officer, rather than evidence formally presented and tested at trial.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nAlthough presentence reports are an extremely useful sentencing tool, by their nature the information they contain is \"generally hearsay, even remote hearsay at the second and third remove.\" United States v. Frushon, 10 F.3d 663, 666 (9th Cir. 1993) (quoting United States v. Fine, 975 F.2d 596, 603 (9th Cir. 1992)). As a result, presentence reports are generally inadmissible at trial to prove any of the hearsay reports they contain. See United States v. Matta-Ballesteros, 71 F.3d 754, 767 (9th Cir. 1995), as amended by 98 F.3d 1100 (9th Cir. 1996). Because they are not subject to evidentiary standards, presentence reports may also contain factual errors.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e In Arizona capital cases, presentence reports have also frequently contained inadmissible victim impact statements, including sentencing recommendations from the victim's family.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIn addition, capital sentencing judges in Arizona have often received letters directly from the victim's family and friends expressing their opinions about sentencing, prompting the Arizona Supreme Court to explain that: \"[w]e have no way of preventing members of the community from writing judges.\" Mann, 934 P.2d at 792.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e The net result, prior to Ring, was a capital sentencing system that allowed a large amount of inadmissible evidence to be submitted to capital sentencing judges that could not be considered by a penalty-phase jury.\n\nThe penalty-phase presentation in the instant case was typical of pre-Ring Arizona capital sentencing cases and illustrates both problems. The actual penalty-phase proceeding was exceedingly truncated and bore more resemblance to traditional non-capital judge sentencing than a trial. Before hearing any presentation by the parties, Judge Marquardt received a presentence report prepared by a probation officer who did not testify during the penalty phase. It contained numerous sentencing recommendations from the victim's family and friends, police officers, and others. Attached to the presentence report were a large number of letters from members of the community expressing their opinions, including a petition with over 500 signatories. The presentence report also contained the probation officer's opinion as to the heinous nature of the crime and expressed her opinion as to the sentence that the judge should impose.\n\nIn contrast, the formal presentations by the parties were extremely abbreviated. The admissible evidence actually presented to the judge paled in comparison with the inadmissible material contained in the presentence report. The State submitted a four-page sentencing memorandum urging imposition of the death penalty. Summerlin's attorney submitted nothing. Neither side made an opening statement. The State's formal evidentiary presentation on aggravation consisted of less than one transcript page. Summerlin's counsel declined to introduce testimony as to mitigation; rather, he asked the judge only to review the material contained in the presentence report. Thus, the cumulative presentation of each side's case in chief resulted in less than one page of trial transcript. The only live testimony was a brief presentation by the State to rebut medical statements contained in the presentence report. When viewed by volume, well over ninety percent of the material received by the sentencing judge in this case could not have been presented to a capital sentencing jury. Such a proceeding is not one that bears \"the hallmarks of a trial on guilt or innocence.\"\n\nThe point of this discussion is not to examine whether trial errors occurred in any particular case, including this one, but to analyze whether requiring a jury to make the relevant findings would reduce the risk of an erroneous decision. A review of the cases demonstrates that judge capital sentencing proceedings have been contaminated by a large volume of inadmissible evidence and marked by truncated presentations by the parties. We have presumed that the sentencing judge could sort out the truly relevant, admissible evidence from this morass. The relevant question is not whether judges have been able to do so, but whether subjecting penalty-phase evidence to the crucible of a formal trial by jury would reduce the risk of error.\n\nThere is little doubt that it would. As Harry Kalven, Jr. and Hans Zeisel described it in their seminal study on the jury system:\n\nIn addition to his wide experience with the likelihood that the defendant before him is guilty, the judge is exposed to prejudicial information which the law, in its regard for the right of the defendant, aims to screen out of the evaluation of his guilt or innocence. The law's ideal in this situation may be something of a libertarian luxury. Our only point is that the law cannot easily achieve it without a jury.\n\nHarry Kalven, Jr. \u0026 Hans Zeisel, The American Jury 127 (Little, Brown 1966).\n\nIf there is any place in which adherence to evidentiary rules, constitutional restraints, and the defendant's confrontation rights is paramount, it must be when the defendant is exposed to the penalty of death. Subjecting penalty-phase presentations to the rigors and restrictions of a jury trial necessarily will improve the quality of presentation and diminish the risk of an erroneous verdict.\n\nA second primary accuracy-enhancing role of a jury in capital cases is to make the important moral decisions inherent in rendering a capital verdict. The Supreme Court \"has emphasized that a sentence of death must reflect an ethical judgment about the 'moral guilt' of the defendant.\" Schiro v. Indiana, 475 U.S. 1036, 1038 (1986) (Marshall, J., dissenting from the denial of certiorari) (citing Enmund v. Florida, 458 U.S. 782, 800-01 (1982)). One of the critical functions of a jury in a capital case is to \"maintain a link between contemporary community values and the penal system.\" Witherspoon v. Illinois, 391 U.S. 510, 520 n.15 (1968). Thus, \"in a capital sentencing proceeding, the Government has 'a strong interest in having the jury express the conscience of the community on the ultimate question of life or death.' \" Jones v. United States, 527 U.S. 373, 382 (1999) (quoting Lowenfield v. Phelps, 484 U.S. 231, 238 (1988)).\n\n\" '[T]he men and women of the jury may be regarded as a microcosm of the community.' \" Harris v. Alabama, 513 U.S. 504, 517 (1995) (Stevens, J., dissenting) (quoting Royal Commission on Capital Punishment 1949-1953, Report 200 (1953)). There could \"therefore be no more appropriate body to decide whether the fellow-citizen whom they have found guilty of murder should suffer the penalty of death prescribed by the law or should receive a lesser punishment.\" Id. Thus, as Justice Breyer noted in his concurring opinion in Ring, entrusting a jury with the authority to impose a capital verdict is an important procedural safeguard, because the jury members \"are more attuned to the community's moral sensibility,\" \"reflect more accurately the composition and experiences of the community as a whole,\" and act to \"express the conscience of the community on the ultimate question of life or death.\" 536 U.S. at 615-16 (Breyer, J., concurring in the judgment) (internal citations and quotation marks omitted).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThis principle is not only true as a general matter in capital murder verdicts, but it has specific application to determination of some of the aggravating factors contained in Arizona's death penalty scheme. For example, one of the two aggravating circumstances found by Judge Marquardt in this case was that the murder was committed \"in an especially heinous, cruel or depraved manner.\" Ariz. Rev. Stat. § 13-703(F)(6). The Arizona Supreme Court has noted that these are \"admittedly broad subjective terms.\" State v. Vickers, 768 P.2d 1177, 1188 n.2 (Ariz. 1989). The assessment of whether a crime is \"heinous\" depends on the \"mental state and attitude of the perpetrator as reflected in his words and actions.\" State v. Gretzler, 659 P.2d 1, 10 (Ariz. 1983) (citations omitted). As we noted in discussing this aggravating factor in Adamson: \"These assessments directly measure a defendant's 'moral guilt' and overall culpability-traditionally the jury's domain of decision.\" 865 F.2d at 1027.\n\nThese assessments may be influenced by the possible acclimation of the judge to the capital sentencing process. Most jurors in capital cases will never sit on another case in which the death penalty is sought. Judges, by contrast, confront death penalty cases on a regular and sometimes routine basis in Arizona. For instance, Judge Marquardt, who sentenced Summerlin to death, imposed capital punishment on James Fisher in a separate case on the same day. A reasonable inference from the habituation brought about by imposing capital punishment under near rote conditions is that a judge may be less likely to reflect the current conscience of the community and more likely to consider imposing a death penalty as just another criminal sentence. Indeed, when questioned about another capital case in which his judgment was being assailed because he purportedly slept through portions of the short penalty-phase hearing, Judge Marquardt answered that he was unable to recall the case, but \"said he had no doubt that the death penalty was warranted.\" Adam Liptak, Judge's Drug Use at Issue in 2 Death Sentences, N.Y. TIMES, May 16, 2002, at A1. \"These guys have sentenced themselves,\" he is reported to have said. Id.\n\nOf course, Judge Marquardt's conduct is not at all representative of the Arizona judiciary-a point that must be underscored. However, the extremity of his actions highlights the potential risk of accuracy loss when a capital decision is reposed in a single decision-maker who may be habituated to the process, or who may not treat capital sentencing in accordance with the heightened requirements that the Eighth Amendment imposes. Obviously, in Summerlin's case, the concern is not merely theoretical.\n\nIn addition, unlike judges, juries do not stand for election in Arizona and therefore are less apt to be influenced by external considerations when making their decisions. As Justice Stevens has commented, \"given the political pressures they face, judges are far more likely than juries to impose the death penalty.\" Harris, 513 U.S. at 521 (Stevens, J., dissenting). This postulate has empirical support: Judges who face election are far more likely to impose the death penalty than either juries or appointed judges. See Stephen B. Bright \u0026 Patrick J. Keenan, Judges and the Politics of Death: Deciding Between the Bill of Rights and the Next Election in Capital Cases, 75 B.U. L. Rev. 759, 793-94 (1995) (discussing studies documenting the existence of a statistically-significant correlation between an increased override of juries' recommendations against the death penalty by state judges and occurrence of judicial elections in Alabama, Florida, and Indiana); Fred B. Burnside, Comment, Dying to Get Elected: A Challenge to the Jury Override, 1999 Wis. L. Rev. 1017, 1039-44 (same); see also Sam Kamin, Harmless Error and the Rights/Remedies Split, 88 Va. L. Rev. 1, 62 (2002) (citing empirical examination of death penalty decisions issued by the California Supreme Court between 1976 and 1996). It also has anecdotal support.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nThese reasons underscore Justice Breyer's observation in Ring that \"the danger of unwarranted imposition of the penalty cannot be avoided unless 'the decision to impose the death penalty is made by a jury rather than by a single governmental official.' \" 536 U.S. at 618 (Breyer, J., concurring in the judgment) (quoting Spaziano v. Florida, 468 U.S. 447, 469 (1984) (Stevens, J., concurring in part and dissenting in part)).\n\n[16] For all of these reasons, exemplified by the facts of this case, there is little doubt that the rule announced in Ring will significantly improve the accuracy of capital trials in Arizona. This conclusion is not-and should not be considered as-a negative assessment of the many excellent state trial judges in Arizona, many of whom have been national leaders in improving the jury system. See, e.g., B. Michael Dann \u0026 George Logan III, Jury Reform: The Arizona Experience, 79 Judicature 280 (1996). However, the structure of Arizona capital sentencing allows extra-judicial factors to enter into the ultimate judgment such as the consideration of inadmissible evidence, political pressure, truncated evidentiary presentation, and prior experience with other capital defendants that would be absent from a jury's consideration of penalty-phase evidence.\n\n[17] If the allegations concerning Judge Marquardt are true, Summerlin's fate was determined by a drug-impaired judge, habituated to treating penalty-phase trials the same as non-capital sentencing, who relied upon inadmissible evidence in making the factual findings that sentenced Summerlin to death. Although no system is perfect, relying on a jury to administer capital punishment unquestionably reduces the risk of error by reposing trust in twelve individuals who must agree as to the presence of aggravating factors beyond a reasonable doubt, whose continued job security is not threatened by their decision, and whose consideration is based solely on admissible evidence subject to the rigors of crossexamination.\n\nTaking into account the heightened attention that the Eighth Amendment obligates us to afford capital cases, the inevitable conclusion must be that a requirement of capital findings made by a jury will improve the accuracy of Arizona capital murder trials.\n\nThe second requirement of the Teague exception provides that the newly announced rule must be a \"watershed rule\" that alters our understanding of bedrock procedural elements essential to the fairness of the proceeding. Sawyer, 497 U.S. at 242. Although Eighth Amendment concerns are implicated in Ring, the bedrock procedural element at issue is the provision of the Sixth Amendment right to a jury trial.\n\nRing not only changed the substantive criminal law of Arizona, but it fundamentally altered the procedural structure of capital sentencing applicable to all states. Ring established the bedrock principle that, under the Sixth Amendment, a jury verdict is required on the finding of aggravated circumstances necessary to the imposition of the death penalty. 536 U.S. at 609. Ring requires the vacation of a capital judgment based on judge-made findings.\n\nA structural error is a \"defect affecting the framework within which the trial proceeds, rather than simply an error in the trial process itself.\" Arizona v. Fulminante, 499 U.S. 279, 310 (1991). If structural error is present, \"a criminal trial cannot reliably serve its function as a vehicle for determination of guilt or innocence, and no criminal punishment may be regarded as fundamentally fair.\" Rose v. Clark, 478 U.S. 570, 577-78 (1986) (citation omitted).\n\nDepriving a capital defendant of his constitutional right to have a jury decide whether he is eligible for the death penalty is an error that necessarily affects the framework within which the trial proceeds. Indeed, the trial has proceeded under a completely incorrect, and constitutionally deficient, framework. In short, allowing a constitutionally-disqualified factfinder to decide the case is a structural error, and Ring error is not susceptible to harmless-error analysis.\n\nThis conclusion is compelled by the analysis in Sullivan v. Louisiana, 508 U.S. 275 (1993). In that case, the Supreme Court considered whether a deficient reasonable-doubt instruction\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e was subject to harmless-error analysis. Id. at 277. In resolving the question, Justice Scalia first noted that the Sixth Amendment right to a jury trial \"includes, of course, as its most important element, the right to have the jury, rather than the judge, reach the requisite finding.\" Id. at 277 (citing Sparf v. United States, 156 U.S. 51, 105-06 (1895)). To determine whether harmless error exists, he noted, the Supreme Court must examine \"the basis on which 'the jury actually rested its verdict.' \" Id. at 279 (quoting Yates v. Evatt, 500 U.S. 391, 404 (1991) (emphasis added in Sullivan)). Given that, Justice Scalia observed the \"illogic of harmless-error review\" under those circumstances because a review could occur only if a court \"hypothesize[d] a guilty verdict that was never in fact rendered.\" Id. at 279-80. The Court thus concluded that the Cage error was structural because any constitutionally defective reasonable doubt jury instruction \"vitiates all the jury's findings\" and \"[a] reviewing court can only engage in pure speculation-its view of what a reasonable jury would have done.\" Id. at 281 (emphasis in original). \"And when it does that, 'the wrong entity judge[s] the defendant guilty.' \" Id. (quoting Rose, 478 U.S. at 578) (alteration in original).\n\nIn our case, the wrong entity found Summerlin to be guilty of a capital crime. Here, as in Sullivan, there was no jury verdict within the meaning of the Sixth Amendment and no constitutionally cognizable finding to review. A complete deprivation of the right to a jury is an error that does not arise during a presentation to a jury. Rather, such an error indisputably affects \"the framework within which the trial proceeds.\" Rose, 478 U.S. at 310. This type of error cannot be cured, or determined harmless, by examining other mitigating circumstances that may have been presented at trial because, as Justice Scalia observed:\n\nThe Sixth Amendment requires more than appellate speculation about a hypothetical jury's action, or else directed verdicts for the State would be sustainable on appeal; it requires an actual jury finding of guilty.\n\nSullivan, 508 U.S. at 280 (citing Bollenbach v. United States, 326 U.S. 607, 614 (1946)).\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nSullivan's logic thus applies with even greater force where, as here, there was no jury finding at all. As Justice Scalia observed in Sullivan, under the Sixth Amendment, a judge \"may not direct a verdict for the State, no matter how overwhelming the evidence.\" Id. at 277. If a judge is constitutionally precluded from directing a verdict for the State, then, perforce, a judge sitting without a jury cannot constitutionally enter a judgment of conviction for capital murder. In this sense, Ring error indisputably affects the framework of the trial and must therefore constitute structural error.\n\nThe Supreme Court's recent opinion in Nguyen v. United States, 123 S. Ct. 2130 (2003), reaffirms that any decision of an improperly constituted judicial body must be vacated. In Nguyen, the Supreme Court assessed a series of judgments rendered by a federal appellate court panel on which a \"non-Article III judge\" served. 123 S. Ct. at 2133-34. Vacating this group of judgments, the Supreme Court reasoned that an appellate panel that included a non-Article III judge proved an \"impermissible\" and \"unauthorized\" decisional body, one that necessarily conflicted with a \"strong policy concerning the proper administration of judicial business.\" Id. at 2135-36 (citation and internal quotation marks omitted). Because the \"validity\" of the relevant judicial body was fundamentally flawed, and because this \"plain defect\" was incurable, Nguyen explained, the decisions reached by that body must be vacated. Id. at 2137-38; see also N. Pipeline Constr. Co. v. Marathon Pipe Line Co., 458 U.S. 50, 83-85 (1982) (holding that delegation to adjunct bankruptcy judges of powers beyond those conferred to non-Article III judges rendered an entire administrative scheme unconstitutional).\n\nThe principle animating Sullivan, Nguyen, and Northern Pipeline provides that where an improperly constituted or situated tribunal reaches a decision, that decision is infected with a \"plain defect\" and must be vacated. Nguyen, 123 S. Ct. at 2137-38. Whether before an improperly constituted federal appellate panel, a flawed jury panel, a biased judge, or a judge without fact-finding authority in particular contexts, even an otherwise error-free trial is subject to reversal because the error affects the very framework within which the trial proceeds. Id. Such structural error indisputably arises here.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nApplication of the heightened scrutiny commanded by the Eighth Amendment in capital cases underscores the structural nature of this Sixth Amendment constitutional infirmity. The Sixth Circuit recently considered whether harmless-error analysis could apply in a capital case under similar circumstances in Esparza v. Mitchell, 310 F.3d 414 (6th Cir. 2002), petition for cert. filed, Nos. 02-1369, 02-8849, 71 U.S.L.W. 3613 (Mar. 4, 2003). In that case, the Sixth Circuit held that a death sentence could not be imposed when the state had failed to charge the aggravating circumstance and the jury had not found the aggravating circumstance beyond a reasonable doubt. Id. at 420. In reaching its decision, the Sixth Circuit specifically rejected the theory that a harmless-error analysis under a Neder theory could apply, noting that \"[t]here is no suggestion in the Chief Justice's opinion in Neder that harmless error would protect a directed verdict for the State on a crucial finding under the Eighth Amendment in a capital case.\" Id. at 421. The court further noted:\n\nHarmless-error review in [capital] cases should apply only when the jury has actually performed its function under the Eighth Amendment. The jury in this case never made a judgment at all on the only possible aggravating circumstance-a constitutionally indispensable requirement without which the death penalty cannot be imposed. The State's argument that the error here can be excused as harmless would lead to the conclusion that any, or all, elements required by a state's capital sentencing system may be supplied by judges rather than the jury. Neither the Eighth Amendment nor Ohio's own statutes adopted in order to comply with it permit such a gross deviation from the principle of jury sentencing according to expressly stated, clear statutory standards.\n\nId. at 422.\n\nGiven Ring's declaration that a defendant is entitled under the Sixth Amendment to a jury verdict in the penalty phase of a capital case, the substitution of a non-jury verdict cannot be subject to harmless-error analysis. Ring error is one \" 'affecting the framework within which the trial proceeds, rather than simply an error in the trial process itself.' \" Neder, 527 U.S. at 8 (quoting Fulminante, 499 U.S. at 310).\n\nThat Ring error is structural is a critical consideration in determining whether the second Teague exception has been satisfied. It does not, however, end our inquiry. See Tyler v. Cain, 533 U.S. 656, 666-67 (2001). The Supreme Court has explained on numerous occasions that a \"truly watershed case\" is one of a \"small core of rules\" that is \"groundbreaking.\" See, e.g., O'Dell, 521 U.S. at 167; Caspari, 510 U.S. at 396; Graham, 506 U.S. at 478. The newly announced rule must enhance accuracy, improve fairness, and dictate \"observance of those procedures that . . . are implicit in the concept of ordered liberty.\" Teague, 489 U.S. at 311 (plurality) (internal quotation marks omitted).\n\nAs previously noted, the procedure at issue in Ring had been reviewed by the Supreme Court on prior occasions and had been found constitutionally sound. See Apprendi, 530 U.S. at 496-97; Walton, 497 U.S. at 649. In a sharp reversal of course, however, the Supreme Court in Ring determined that when the Arizona court adhered to prior Supreme Court law, it violated the defendant's fundamental right to have his guilt determined by a jury trial.\n\nThe Supreme Court's decision in Ring affects the structure of every capital trial and has rendered unconstitutional every substantive statute in conflict with its dictates. It involves the structure of penalty-phase trials which, unlike non-capital sentencing proceedings, are subject to the constraints of the Double Jeopardy Clause. Bullington, 415 U.S. at 439. Thus, Ring's effect on capital murder cases is akin to that of Furman, which declared that death penalty statutes vesting complete discretion in the judge or in the jury, like Arizona's, were unconstitutional. Furman, as already noted, was given full retroactive effect for the purposes of federal habeas review. See Moore, 408 U.S. at 800.\n\nRing's impact thus is far greater than the impact of the Mills/McKoy rule, which some of our sister circuits have determined to be a \"watershed rule\" under Teague. See Gall v. Parker, 231 F.3d 265, 323-24 (6th Cir. 2000), cert. denied, 533 U.S. 941 (2001); Williams v. Dixon, 961 F.2d 448, 455-57 (4th Cir. 1992).\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nIn Williams, Chief Judge Ervin analyzed the Mills/McKoy rule in detail and concluded that: \"Given the history of the Eighth Amendment jurisprudence and the constitutional requirement of individualized sentences, we believe that a rule striking down an arbitrary unanimity requirement has the same 'primacy and centrality' of Gideon [v. Wainwright, 372 U.S. 225 (1963)].\" 961 F.2d at 456. The Fourth Circuit underscored the language in Mills that \"it would certainly be the height of arbitrariness to allow or require the imposition of the death penalty under the circumstances [where one holdout juror prevents the consideration of mitigating evidence].\" Id. (quoting Mills, 486 U.S. at 374) (emphasis added and alterations inserted in Williams).\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nRing does not merely announce a supplemental procedural safeguard. Rather, it establishes bedrock procedural requirements that affect the structure of every penalty-phase hearing in a capital case. Application of the rule in Ring, like the Mills/McKoy rule and other watershed rules, will increase the accuracy of capital murder trials significantly. The absence of the rule's protection necessarily constitutes structural error and deprives a defendant of a fundamental right.\n\n[18] Moreover, Ring implicates the foundation of the capital murder trial itself by declaring that judges are constitutionally unqualified to decide whether a defendant is eligible for the death penalty. Thus, the rule in Ring is central to the conduct of every capital murder trial. Ring \"effectively declare[d] five States' capital sentencing schemes unconstitutional,\" Ring, 536 U.S. at 621 (O'Connor, J., dissenting), and cast doubt on the viability of at least four other state capital murder statutes. Id.; see also Brief for Amici Curiae Alabama, Colorado, Delaware, Florida, Idaho, Indiana, Mississippi, Montana, Nebraska, Nevada, New York District Attorney's Ass'n, Pennsylvania, South Carolina, Utah, and Virginia to the Supreme Court in Ring at *4 \u0026 n.2, Ring (No. 01-488), available at 2002 WL 481140. In short, Ring directly impacted the substance of approximately one-fourth of the 38 state capital murder statutes and established irreducible minimum structural requirements for all. It fundamentally altered our view of how the Sixth Amendment right to a jury trial affected the Eighth Amendment's requirement that state statutes narrow the class of individuals eligible for the penalty of death. By deciding that judges are not constitutionally permitted to decide whether defendants are eligible for the death penalty, the Supreme Court altered the fundamental bedrock principles applicable to capital murder trials. When viewed in both theoretical and practical terms, Ring redefined the structural safeguards implicit in our concept of ordered liberty.\n\n[19] The Teague doctrine was based on the notion that one of the \"principal functions of habeas corpus [is] to assure that no man has been incarcerated under a procedure which creates an impermissibly large risk that the innocent will be convicted.\" Bousley, 523 U.S. at 620 (alteration in original; internal quotation marks omitted). The rule announced in Ring, like other watershed rules, is designed to reduce significantly the risk of an erroneous capital verdict. Thus, the rule announced in Ring defines structural safeguards implicit in our concept of ordered liberty that are necessary to protect the fundamental fairness of capital murder trials. Ring satisfies the criteria of Teague and must be given retroactive effect on habeas review.\n\nD.\n\nThe Warden's primary argument against applying Ring retroactively relies on United States v. Sanchez-Cervantes, in which we held that Apprendi may not be applied retroactively on habeas review. United States v. Sanchez-Cervantes, 282 F.3d 664, 670 (9th Cir. 2002). However, our analysis in Sanchez-Cervantes does not conflict with our conclusion that Ring must be applied retroactively. First, as we have noted, the decision in Apprendi clearly was not one of substantive criminal law. Unlike the result in Ring, Apprendi did not cause the relevant statute to be declared unconstitutional. Second, Apprendi errors are not structural and therefore are subject to harmless-error analysis. Id. at 669-70 (citing Buckland, 277 F.3d at 1184) (internal quotation marks omitted). Third, as we reasoned in Sanchez-Cervantes, Apprendi was neither a rule that greatly enhanced the accuracy of sentencing proceedings nor a \"sweeping rule\" in light of the finding that it \"would apply only in a limited number of cases.\" Id. at 669. Accordingly, it could not qualify as a \"watershed\" rule. Fourth, capital cases are structurally much different from non-capital criminal trials. As already noted, non-capital sentencing has historically been within the province of the judge. In contrast, the penalty-phase proceeding of a capital murder case \"resembles a trial,\" Walton, 497 U.S. at 704, and, unlike the non-capital sentencing proceedings, is subject to the constraints of the Double Jeopardy Clause. See Bullington, 451 U.S. at 439. Finally, the Eighth Amendment constraints applicable to capital trials demand a heightened analysis inapplicable to the usual Apprendi situation. Thus, neither Sanchez-Cervantes nor the retroactive application of Apprendi governs our analysis.\n\nVI.\n\n[20] In summary, we affirm the district court's judgment denying Summerlin's petition for habeas corpus for relief from his conviction for first-degree murder. We hold, both on substantive and procedural grounds, that the Supreme Court's decision in Ring has retroactive application to cases on federal habeas review. Thus, we reverse the judgment of the district court insofar as it relates to the imposition of the penalty of death.\n\nGiven our resolution of the penalty-phase issues based on the retroactive application of Ring, we need not, and do not, reach the merits of any of the other penalty-phase errors raised on appeal. We also need not reach the issue of whether cumulative errors require reversal.\n\nAFFIRMED IN PART; REVERSED IN PART; REMANDED\n\nREINHARDT, Circuit Judge, concurring:\n\nI join fully in Judge Thomas's excellent opinion for the court. I could not improve on the legal arguments he has offered. I agree entirely that Ring establishes a new substantive rule and that to the extent the rule is procedural it constitutes a watershed rule that enhances the accuracy of capital sentencing and alters our understanding of a bedrock procedural provision.\n\nI write separately only to emphasize that a contrary result would be unthinkable in a society that considers itself both decent and rational. Few seriously doubt that the death penalty is generally imposed in an arbitrary manner in this nation. The vagaries of the process by which prosecutors select those they believe worthy of death; the chances that defendants will be assigned incompetent rather than competent legal counsel, and that such representation will continue throughout the state and federal direct and collateral proceedings; the fortuitous circumstances which in combination account for the factfinders' decisions in capital proceedings as to who shall live or die: all result in a system of execution by chance or fate. And this is wholly aside from factors such as race, IQ, poverty, wealth, geography, and sex, each of which plays a significant part in the business of determining which persons the state decides to execute.\n\nBut surely there is a limit to arbitrariness - even to arbitrariness in the imposition of the death penalty. And executing people because their cases came too early - because their appeals ended before the Supreme Court belatedly came to the realization that it had made a grievous constitutional error in its interpretation of death penalty law, that it had erred when it failed to recognize that the United States Constitution prohibits judges, rather than jurors, from making critical factual decisions regarding life and death in capital cases - is surely arbitrariness that surpasses all bounds.\n\nIt is not uncommon for the Supreme Court to make significant errors in interpreting the constitution, see, e.g., Plessy v. Ferguson, 163 U.S. 537 (1896); Bowers v. Hardwick, 478 U.S. 186 (1986); Walton v. Arizona, 497 U.S. 639 (1990), and to correct those errors when it recognizes its mistakes, see, e.g., Brown v. Bd. of Educ., 347 U.S. 483 (1954); Lawrence v. Texas, 123 S.Ct. 2472 (2003); Ring v. Arizona, 536 U.S. 584 (2002). The Court is to be commended for the integrity it displays in acknowledging its failures in such cases. Ordinarily, the consequences are that the judicial reversal is greeted with relief and the error has no further adverse effects. Certainly, all must agree that constitutional errors made by the Court should not have any greater adverse consequences than necessary. Here, however, in the dissent's view, additional people should now be put to death following unconstitutional proceedings even though the Court has recognized the unconstitutionality inherent in those future executions, and even though had the Court not erred initially, the death sentences in question would previously have been set aside. To me, this represents a seriously warped view of the nature of our legal system, and the relationship of that system to its ultimate objective: justice.\n\nThe dissent expresses a peculiar lack of confidence in juries, and states that the \"conscience of the community is not necessarily the fairest adjudication for a capital defendant\" because considerations of race and other biases influence jurors' actions. Our recent experience shows precisely the opposite. When the Attorney-General decided to order federal death penalty prosecutions in a far wider range of cases and places than ever before, juries responded by expressing the \"conscience of the community.\" Since General Ashcroft has launched his expanded federal death penalty campaign, sometimes over the objections of local federal prosecutors, juries have returned 21 verdicts. In 20 of them they have voted for life rather than death.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e Despite those who distrust it, the \"conscience of the community\" is indeed, a fair, democratic, and unbiased expression of societal values. To distrust juries is plainly to distrust democracy.\n\nBut even more important, my dissenting colleagues believe that it is perfectly proper for the state to execute individuals who were deprived of their constitutional right to have a jury make their death penalty decisions, if the judicial machinery had brought the direct appeal portion of their legal proceedings to an end before the day on which the Supreme Court recognized its constitutional error. In other words, my colleagues believe that those who had reached the stage of habeas proceedings as of the day of the Court's belated enlightenment may be executed, but those who were still awaiting a final answer to their appeals may not.\n\nWholly aside from the fact that the majority is unquestionably correct with respect to its careful analysis of retroactivity law, I remind my dissenting colleagues that \"death is different.\" Ring v. Arizona, 536 U.S. 584, 606 (2002); Ford v. Wainwright, 477 U.S. 399, 411 (1986) (plurality opinion) (\"This especial concern [for reliability in capital proceedings] is a natural consequence of the knowledge that execution is the most irremediable and unfathomable of penalties; that death is different\"); Gardner v. Florida, 430 U.S. 349, 357 (1977) (plurality opinion); Woodson v. North Carolina, 428 U.S. 280, 305 (1976) (plurality opinion); Furman v. Georgia, 408 U.S. 238, 289 (1972) (Brennan, J., concurring) (\"The unusual severity of death is manifested most clearly in its finality and enormity. Death, in these respects, is in a class by itself.\"). We do not execute people according to ordinary legal principles that may be good enough for our more routine decisions. When the state assumes the role of the Deity, it must exercise greater care. Thus, even if the dissenting argument were more closely attuned to traditional retroactivity law -even if that law demanded a different result in run-of-the-mill cases - I would not apply those rules here. In order to understand why, we need only look to the facts revealing the inherent fallibility of our criminal justice system.\n\nThis country imposed approximately 5,760 death sentences between 1973 and 1995.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e During that time, \"courts found serious, reversible error in nearly 7 of every 10 of the thousands of capital sentences that were fully reviewed during the period.\"\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e State courts reviewed 4,578 of those cases and reversed 41% for serious error on direct appeal; another 10% were reversed on state collateral review.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Federal courts found error in 40% of the 599 cases which state courts affirmed. 82% of defendants who received a second trial after a successful state collateral petition did not receive a death sentence; 7% of those defendants were found innocent or had their charges dropped. Recently in Illinois, a conservative Governor declared a moratorium on executions after discovering that since the death penalty was reinstated, more individuals convicted of capital crimes and sent to death row had been exonerated than executed. Following a full investigation, he pardoned some of the prisoners on death row and commuted the sentences of the rest.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\n\nSince 1973, one hundred and eight people nationwide have been released from death row upon evidence of their innocence; there is no comparable statistic yet available for those who have been executed.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e It is virtually certain that other people who are actually innocent - much less those convicted in violation of the Constitution - currently await execution.\n\nLet me put the abstract problem of the retroactivity of Ring in perspective, and let me state it as clearly as possible. In Walton v. Arizona, 497 U.S. 639 (1990), Jeffrey Alan Walton tried to persuade the then-members of the Supreme Court that a jury, not a judge, must make the critical factual decisions regarding his ultimate fate. In rejecting his argument, the Court erred, as it now concedes. In Walton, the Court mistakenly decided that the Constitution did not entitle capital defendants to a jury trial at the penalty phase. All death row prisoners who advanced the constitutional argument that Walton had unsuccessfully asserted subsequently received the same answer that he did. Some capital defendants continued to assert the claim, hoping that the Court would change its mind. Others believed that it would be futile to continue to make an argument that the Court had just rejected. As a result of the Court's error, some of these individuals have already been executed in violation of their constitutional rights. Others are still awaiting execution. The question before us is: may the state now execute those persons as to whom the Supreme Court ruled erroneously (directly or indirectly) with respect to their constitutional claims, although it is prevented from executing those as to whom the Court had not yet formally erred? May the state execute the \"Jeffrey Alan Waltons\" who are now on death row - the prisoners who previously correctly argued (or were incorrectly deterred from arguing) that their executions would be unconstitutional, the prisoners whose causes were erroneously turned down by the Supreme Court - the prisoners who were right about the Constitution when the Supreme Court was wrong?\n\nTo put it differently, may the state now deliberately execute persons knowing that their death sentences were arrived at in a manner that violated their constitutional rights? Is it possible that prisoners will now be executed by the state solely because of the happenstance that the Supreme Court recognized the correctness of their constitutional arguments too late - on a wholly arbitrary date, rather than when it should have? Will we add to all of the other arbitrariness infecting our administration of the death penalty the pure fortuity of when the Supreme Court recognized its own critical error with respect to the meaning of the Constitution? Can we justify executing those whose legal efforts had reached a certain point in our imperfect legal process on the day the Supreme Court changed its mind, while invalidating the death sentences of those whose cases were waiting slightly further down the line?\n\nI do not think it rational for a society to make its decisions regarding whom it will kill in the manner that my dissenting colleagues suggest. A state's decision to take the life of a human being, if it can be justified at all, must rest on a far less arbitrary foundation. And if our society truly honors its constitutional values, it will not tolerate the execution by the state of individuals whose capital sentences were imposed in violation of their constitutional rights. It should not take a constitutional scholar to comprehend that point.\n\nRAWLINSON, Circuit Judge, with whom O'SCANNLAIN and TALLMAN, Circuit Judges, join, dissenting:\n\nI must respectfully dissent from that portion of the majority opinion discussing the retroactive application of Ring v. Arizona. The majority opinion negates the presumption against retroactive application of a new rule articulated in Teague v. Lane, 489 U.S. 288, 304, 310 (1989). The underpinning of the majority opinion is an assumption that the Supreme Court's ruling in Ring v. Arizona, 536 U.S. 584 (2002), represents a new substantive rule or, alternatively, a new procedural rule that seriously enhances accuracy of capital sentencing proceedings, and alters our understanding of \"bedrock procedural elements essential to the fairness of the proceeding.\" Maj. Op. at 12760 (citing Sawyer v. Smith, 497 U.S. 227, 242 (1990)).\n\nI. The Ring Decision Announces A Procedural Rule Rather Than A Substantive One.\n\nA. Ring's Reliance upon and Similarity to Apprendi\n\nIn my view, the majority opinion wanders afield in the first instance by holding that Ring contains a new substantive rule despite the teaching of Apprendi v. New Jersey, 530 U.S. 466 (2000), upon which the Supreme Court expressly relied in deciding Ring. See Ring v. Arizona, 536 U.S. at 602.\n\nIn Apprendi, the defendant pled guilty to two counts of second-degree possession of a firearm and one count of unlawful possession of a bomb. 530 U.S. at 469-70. After accepting Apprendi's guilty plea, the trial court conducted a hearing and concluded that Apprendi's firing of several bullets into the home of an African-American family was \"motivated by racial bias.\" Id. at 470-71. This conclusion resulted in a \"hate crime enhancement,\" doubling the maximum potential sentence. Id. Apprendi was sentenced to a twelve-year term of imprisonment, two years more than the ten-year maximum for the firearms offense. Id. at 474.\n\nThe Supreme Court recognized that the constitutional guarantees embedded in the Sixth Amendment and the Fourteenth Amendment were at stake. Id. at 476-77. In keeping with those guarantees, the Court rendered the ruling that resonated throughout the country: \"Other than the fact of a prior conviction, any fact that increases the penalty for a crime beyond the prescribed statutory maximum must be submitted to a jury, and proved beyond a reasonable doubt.\" Id. at 490.\n\nIn Ring v. Arizona, quoting extensively from Apprendi, the Supreme Court addressed the Sixth Amendment right to a jury trial in the context of capital sentencing. 536 U.S. at 602-03.\n\nThe Supreme Court described its holding in Apprendi as a determination \"that Apprendi's sentence violated his right to a jury determination that he is guilty of every element of the crime with which he is charged beyond a reasonable doubt. That right attached not only to Apprendi's weapons offense but also to the hate crime aggravating circumstance.\" Id. at 602 (citation, internal quotation marks and alteration omitted).\n\nIn overruling Walton v. Arizona, 497 U.S. 639 (1990), the Supreme Court in Ring noted that, as with the \"hate crime\" aggravator in Apprendi, \"Arizona's enumerated aggravated factors [necessary for imposition of the death penalty] operate as the functional equivalent of an element of a greater offense . . . . at Ring, 536 U.S. at 609 (citation and internal quotation marks omitted).\n\nThe Supreme Court quoted Justice Thomas's concurring opinion in Apprendi in recognizing that:\n\nif the legislature defines some core crime and then provides for increasing the punishment of that crime upon a finding of some aggravating fact, the core crime and the aggravating fact together constitute an aggravated crime, just as much as grand larceny is an aggravated form of petit larceny. The aggravating fact is an element of the aggravated crime.\n\n536 U.S. at 605 (citation, internal quotation marks and alterations omitted) (emphasis added).\n\nThis conclusion of the Ring court is pivotal because it is the unlikely linchpin of the majority's conclusion that the Supreme Court's holding in Ring is a rule of substance rather than procedure for purposes of the Teague retroactivity analysis.\n\nThe majority opinion urges us to accept the following syllogism:\n\n* Creation of a separate substantive criminal offense renders a new rule one of substance rather than procedure for purposes of the Teague analysis. Maj. Op. at 12751.\n\n* Ring's holding requiring that a jury determine the existence of aggravating factors necessary for imposition of the death penalty, creates a distinct offense of capital murder. Maj. Op. at 12749.\n\n* Ring's ruling is one of substance rather than procedure for purposes of the Teague retroactivity analysis. Maj. Op. at 12752-53.\n\nAt first glance, the majority opinion's reasoning exudes considerable appeal. However, closer examination of the first point of the syllogism tarnishes the initial appeal of the majority's logic. Why? Because merely saying that creation of a separate substantive criminal offense renders a rule one of substance rather than procedure does not make it so. If that were true, Apprendi would have been a substantive rather than a procedural ruling. As the Supreme Court noted in Ring, the \"hate crime\" aggravator in Apprendi operated in the same manner as the death penalty factors in Walton to establish a \"greater offense.\" 536 U.S. at 609.\n\nThe linkage in Ring of the Walton death penalty factors and the Apprendi hate crime aggravator is fatal to the majority's syllogism. The majority opinion acknowledges, as it must, our recent holding that Apprendi may not be applied retroactively on habeas review. See United States v. Sanchez-Cervantes, 282 F.3d 664, 670 9th Cir. 2002. Maj. Op. at 12780. The majority makes the following four points in an attempt to distance itself from our holding in Sanchez-Cervantes:\n\n1. The decision in Apprendi clearly was not one of substantive law. Maj. Op. at 12780.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nCounterpoint: It is equally clear that Ring is not a decision of substantive law. As the United States Supreme Court noted in Ring, the aggravator in Apprendi operated in the same fashion as the aggravators in Walton to establish a separate offense. See Ring, 536 U.S. at 609. That similarity is more telling than whether or not the statute in question is declared unconstitutional.\n\n2. Apprendi violations are subject to harmless error analysis. Maj. Op. at 12780.\n\nCounterpoint: The Supreme Court in Ring strongly implied, if not outright held, that harmless error analysis is equally applicable to any imposition of the death penalty by a judge rather than a jury. See 536 U.S. at 609. n.7 (citing Neder v. United States, 527 U.S. 1, 25, 119 S. Ct. 1827, 144 L. Ed. 2d 35 (1999) (\"this Court ordinarily leaves it to lower courts to pass on the harmlessness of the error in the first instance\"); see also id. at 621 (O'Connor, J., dissenting) (\"I believe many of these [Ring] challenges will ultimately be unsuccessful, either because the prisoners will be unable to satisfy the standards of harmless or plain error review, or because, having completed their direct appeals they will be barred [by Teague] from taking advantage of today's holding on collateral review.\") (citations omitted).\n\n3. Apprendi was not a watershed rule of procedural law. Maj. Op. at 12780.\n\nCounterpoint: Neither is Ring a watershed rule of procedural law. For the reasons discussed in section II below, the rule pronounced in Ring would not greatly enhance the accuracy of sentencing proceedings, and would affect only a limited number of cases.\n\n4. Capital cases are structurally different. Maj. Op. at 12780.\n\nCounterpoint: The existence of a capital murder offense does not per se establish the substantive nature of the Ring ruling. In fact, the Supreme Court recognized in Ring that even before the adoption of the Bill of Rights, juries were determining which homicide defendants would be subject to capital punishment. 536 U.S. at 599 (quoting Walton v. Ariz., 497 U.S. 639, 711, Stevens, J., dissenting). A return to that well-established tradition does not lead to the ineluctable conclusion that a substantive rule of law has been established.\n\nProper application of the holdings in Ring and Apprendi leads to the opposite conclusion than that reached in the majority opinion: Ring did not create a new substantive rule.\n\nB. The Arizona Supreme Court's Ring Analysis\n\nThe majority opinion recognizes that the Arizona Supreme Court has reached the opposite conclusion, namely that Ring did not create a new substantive rule. Maj. Op. at 12752. The majority opinion justifies its disregard of the Arizona Supreme Court's holding by stating that \"[b]ecause the decisions in [State v.] Towery [65 P.3d 828 (Ariz. 2003),] and [State v.] Ring [65 P.3d 915 (Ariz. 2003)] rest on federal law, and not state law, they do not bind us.\" Maj. Op. at 12752. However, the Supreme Court suggested otherwise in Ring, ruling that \"the Arizona court's construction of the State's own law is authoritative[.]\" 536 U.S. at 603 (citation omitted). The Supreme Court was addressing \"the Apprendi majority's portrayal of Arizona's capital sentencing law.\" Id. Similarly, in this case we are addressing the Ring majority's portrayal of Arizona's capital sentencing law, with the Arizona Supreme Court's construction carrying the same authority. See id.\n\nIn Towery, the Arizona Supreme Court examined Arizona's capital sentencing scheme in light of the Ring decision. The Arizona Supreme Court, with its presumably authoritative grasp of Arizona's statutory scheme, declared that Ring:\n\nchanged neither the underlying conduct that the state must prove to establish that a defendant's crime warrants death nor the state's burden of proof; it affected neither the facts necessary to establish Arizona's aggravating factors nor the state's burden to establish the factors beyond a reasonable doubt. Instead, Ring [ ] altered who decides whether any aggravating circumstances exist, thereby altering the fact-finding procedures used in capital sentencing hearings.\"\n\n64 P.3d at 833 (emphasis in the original).\n\nIn short, Ring changed the \"who\" of the capital sentencing determination, not the \"what.\" A change in who determines the existence of the aggravating factors is quintessentially procedural. See Sanchez-Cervantes, 282 F.3d at 668.\n\nThe decision of the Arizona Supreme Court in Towery is consistent with the United States Supreme Court's explanation of Apprendi in Ring and our Teague analysis of Apprendi in Sanchez-Cervantes.\n\nC. Our Sister Circuits' Ring Analysis\n\nThe Tenth and Eleventh Circuit Courts of Appeal have both addressed and rejected retroactive application of Ring.\n\nThe Tenth Circuit court matter-of-factly concluded that Ring \"is simply an extension of Apprendi to the death penalty context. Accordingly, this court's recent conclusion . . . that Apprendi announced a rule of criminal procedure forecloses [the] argument that Ring announced a substantive rule.\" Cannon v. Mullin, 297 F.3d 989, 994 (10th Cir. 2002) (citation omitted).\n\nLikewise, our recent ruling in Sanchez-Cervantes that Apprendi pronounced a new rule of criminal procedure, 282 F.3d at 668, forecloses the majority's conclusion that Ring pronounced a new substantive rule. As our colleague recently observed when discussing our holding in Sanchez-Cervantes:\n\nWe arrived at this conclusion even though every application of the constitutional rule [announced in Apprendi] requires distinguishing between the statute's 'elements' and 'sentencing factors' and even though it's almost certain, as a simple matter of mathematical probability, that some defendants would not have been convicted had the statutory elements been submitted to a jury of twelve, instead of decided by a judge alone. There may well be a plausible argument that, because Apprendi narrows the class of persons who is likely to be convicted, the rule is substantive. But we have already rejected this argument. Instead, we characterized the rule as procedural because Apprendi affects only the identity of the decisionmaker and the burden of proof . . . .\n\nUnited States v. Montalvo, 331 F.3d 1052, 1061 (9th Cir. 2003) (Kozinski, J., concurring).\n\nThe Eleventh Circuit case, Turner v. Crosby, 2003 WL 21739734 (11th Cir. July 29, 2003), contains a more expansive discussion of the Ring retroactivity issue. The court, as did the court in the Tenth Circuit, linked its characterization of Ring as a procedural rule to Ring's \"status as an extension of Apprendi.\" Id. at *35. The court concluded that \"because Apprendi was a procedural rule, it axiomatically follows that Ring is also a procedural rule.\" Id. at *34.\n\nThe analysis in Turner is remarkably similar to Judge Kozinski's concurring opinion in Montalvo, discussing our holding in Sanchez-Cervantes. See 331 F.3d at 1061.\n\nThe Eleventh Circuit court reasoned:\n\nJust as Apprendi constitutes a procedural rule because it dictates what fact-finding procedure must be employed, Ring constitutes a procedural rule because it dictates what fact-finding procedure must be employed in a capital sentencing hearing. Ring changed neither the underlying conduct the state must prove to establish a defendant's crime warrants death nor the state's burden of proof. Ring . . . altered only who decides whether any aggravating circumstances exist and, thus, altered only the factfinding procedure.\n\nTurner, 2003 WL 21739734 at *34 (internal quotation marks and citations omitted) (emphasis in the original).\n\nII. Ring's Procedural Rule Does Not Fit Within Any Exception to Teague's Retroactivity Prohibition.\n\nThe majority opinion's alternative holding is that even if Ring announced a procedural rule, it nonetheless fits within an exception to the Teague retroactivity prohibition. Maj. Op. at 12758.\n\nI disagree with the majority's conclusion that Ring is a new procedural rule that seriously enhances the accuracy of capital sentencing proceedings and alters our understanding of bedrock procedural principles. Maj. Op. at 12771.\n\nA. Serious Enhancement of the Proceedings' Accuracy\n\nThe majority opinion makes its case for accuracy by attacking the objectivity of judges in the capital sentencing context. Maj. Op. at 12760-71. The majority opinion lists the following five problematic circumstances with judge-based capital sentencing:\n\n1. Presentation of inadmissible evidence to judges;\n\n2. More truncated and informal presentation of evidence and argument;\n\n3. Lack of \"the conscience of the community\";\n\n4. Acclimation of the judge to the capital sentencing process; and\n\n5. Political pressure on judges facing election.\n\nId.\n\nAs with most other matters, there is another side to the story, reflecting the fact that juries have their own problems in the capital sentencing context.\n\nThe Capital Jury Project, funded by the National Science Foundation, is an empirical study of \"death penalty decision making by jurors.\" Theodore Eisenberg and Martin T. Wells, Deadly Confusion: Juror Instructions in Capital Cases, 79 Cornell L. Rev. 1, 2 (1993). 916 capital jurors, from 257 capital trials in eleven states, were interviewed. The study revealed that:\n\nmany jurors reached a personal decision concerning punishment before the sentencing stage of the trial, before hearing the evidence or arguments concerning the appropriate punishment, and before the judge's instructions for making the sentencing decision. Moreover, most of the jurors who indicated a stand on punishment at the guilt stage of the trial said they were \"absolutely convinced\" of their early stands on punishment and adhered to them throughout the course of the trial.\n\nWilliam J. Bowers, Marla Sandys, and Benjamin D. Steiner, Foreclosed Impartiality in Capital Sentencing: Jurors' Predispositions, Guilt-Trial Experience, and Premature Decision Making, 83 Cornell L. Rev. 1476, 1477 (1998).\n\nThe study also disclosed that many \"early pro-death jurors\" presumed that overwhelming proof of guilt justified imposition of the death penalty. Id. at 1497. More than half of the jurors were of the view that \"death was the only acceptable punishment for . . . repeat murder, premeditated murder and multiple murder.\" Id. at 1504. The data in the study has been described as supporting a conclusion that:\n\nthe presence of structural aggravation and the nature of the life or death decision itself will continue still to promote premature punishment decision making, thus discouraging a full and open evaluation of constitutionally sanctioned sentencing considerations. Beyond this, the data show that punishment concerns also invade and befoul the work of guilt decision making. Jurors frankly admit that they consider punishment in deciding guilt, despite admonitions not to do so.\n\nId. at 1541.\n\nAny indecision in death penalty deliberations is more likely to be resolved in favor of death. Eisenberg and Wells, Deadly Confusion, 79 Cornell L. Rev. at 13. The study suggests that \"a defendant on trial for his life at the punishment stage has one foot in the grave . . . . The juror favoring life faces a struggle . . . that will last throughout the deliberations . . .\" Id. at 14.\n\nOne analysis of the Project's data focused on the South Carolina component of the study. South Carolina \"yielded the most extensive set of data of all the states participating . . . encompass[ing] interviews with 187 jurors in fifty-three cases tried in South Carolina between 1988 and 1997.\" Stephen P. Garvey, The Emotional Economy of Capital Sentencing, 75 N.Y.U. L. Rev. 26, 28-29 (2000). This subset of data reveals that sympathy and pity pervade capital sentencing deliberations despite instructions to the contrary, id. at 34, and race is a dominant factor in determining who is sentenced to death. Id. at 45.\n\nThe empirically established problems with jury sentencing deliberations calls into question the majority's facile conclusion that transfer of capital sentencing responsibility to a jury will enhance the accuracy of the process.\n\nThe majority opinion bemoans the fact that inadmissible evidence is presented to judges. Maj. Op. at 12762-63. However, in most states the same inadmissible evidence that most concerns the majority, victim impact statements, is available to jurors. See Garvey, The Emotional Economy of Capital Sentencing, 75 N.Y.U. L. Rev. at 48.\n\nThe majority opinion also laments the informal presentation of evidence to a judge. Maj. Op. at 12761. In contrast, the Capital Jury Project reveals that more formal presentation of evidence is not of assistance to capital juries. To the contrary, jurors are confused by the aggravating and mitigating standards of proof, Eisenberg and Wells, Deadly Confusion, 79 Cornell L. Rev. at 10; are unclear as to whether and when the law mandates death, Bower, Sandys and Steiner, Foreclosed Impartiality, 83 Cornell L. Rev. at 1523; and make up their minds before any evidence is presented as to the appropriate penalty. Id. at 1477.\n\nThe majority opinion views jury determination of the penalty as an indispensable manifestation of the jury's role as the \"conscience of the community.\" Maj. Op. at 12766. However, empirical evidence suggests that the \"conscience of the community\" is not necessarily the fairest adjudication for a capital defendant. Not only do jurors prejudge defendants, they also engage in penalty negotiations during the guilt phase. Bowers, Sandys and Steiner, Foreclosed Impartiality, 83 Cornell L. Rev. at 1477, 1527. Their decisions are tainted by considerations of sympathy, pity, anger and disgust. Garvey, The Emotional Economy of Capital Sentencing, 75 N.Y.U. L. Rev. at 34. And their death determinations are influenced by race. Id. at 45.\n\nThe majority opinion notes that the judge's acclimation to capital sentencing may negatively influence the judge's assessment of the sentence. Maj. Op. at 12767-68. But not everyone views judges' experience as a negative. See Hon. Randall R. Jackson, Missouri's Jury Sentencing Law: A Relic the Legislature Should Lay to Rest, 55 J. Mo. B. 14, 17 (opining that unjust sentencing disparity is greatly reduced when judges rather than juries impose sentencing).\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nFinally, the majority refers to the pressures on judges facing election to impose the death penalty. Maj. Op. at 12768. The majority cites to a law review article to support its statement that \"judges who face election are far more likely to impose the death penalty.\" See Stephen B. Bright and Patrick J. Keenan, Judges and the Politics of Death: Deciding Between the Bill of Rights and the Next Election in Capital Cases, 75 B.U. L. Rev. 759, 793 (1995). However, the statement made in the law review article is just that-a bald statement, with no accompanying empirical evidence.\n\nThe other law review article cited, Fred B. Burnside, Dying to Get Elected: A Challenge to the Jury Override, 1999 Wis. L. Rev. 1017, 1039-44, is a discussion of judicial overrides of jury determinations in Alabama, Florida, Indiana, and Delaware. The article does not even attempt to compare the relative rate of death sentences imposed by juries as opposed to judges. In any event, the comprehensive Capital Jury Project informs us that judges are not alone in facing pressure. Jurors are subjected to similar pressure when deliberating in capital cases. Jurors negotiate votes in order to \"avoid [ ] the stigma of being a hung jury.\" Bowers, Sandys, and Steiner, Foreclosed Impartiality, 83 Cornell L. Rev. at 1527. In the final analysis, the jury is still out on the question of whether the decision in Ring enhances the accuracy of the capital sentencing process.\n\nThat fact defeats the majority opinion's premise that Ring fits within the first prong of the Teague exception applicable to new procedural rules. Its analysis fares no better when the second prong is considered.\n\nB. Ring's Alteration of Our Understanding of Bedrock Procedural Principles\n\nThe majority opinion rests its conclusion on the observations that Ring is not subject to harmless error analysis, and is of widespread application. Maj. Op. at 12772, 12776.\n\nAs previously discussed, the Supreme Court implied, if not held, that Ring requirements are subject to harmless error analysis. See 122 S. Ct. at 2443 n.7. Coupled with that circumstance is the limited application of Ring when contemplated in the proper context. Juries alone are responsible for deciding capital sentences in 29 of the 38 states with capital punishment laws. Holly Shaver Bryant, Capital Punishment/ The Death Penalty: Trends in 2002, Report on Trends in the State Court, National Center for State Courts (2002). Accordingly, Ring's application is limited to capital cases in 9 states, a far cry from the majority's ambitious description of Ring as \"affect[ing] the structure of every capital trial.\" Maj. Op. at 12777.\n\nIn addressing Ring's exemption as a procedural rule from the Teague bar on retroactive application, the Eleventh Circuit court described Ring as \"not sufficiently fundamental\" to constitute a \"watershed\" rule of criminal procedure. Turner, 2003 WL21739734 at *36. (citations omitted). Instead, the court characterized Ring as creating a rule \"based on the Sixth Amendment right to a jury trial and not on a perceived, much less documented, need to enhance accuracy or fairness of the fact-finding in a capital sentencing context.\" Id. at *37.\n\nThe majority's contrary holding that Ring created a new substantive rule or, in the alternative, a watershed rule of criminal procedure precipitates an unwarranted circuit split.\n\nIII. Conclusion\n\nWhether analyzed as a new substantive rule or as a new rule of procedure, the decision in Ring does not fall within any of the exceptions set forth in Teague. The majority opinion's analysis is not compatible with Supreme Court precedent, our prior rulings, or the law of our sister circuits. In light of Ring's adherence to the precepts in Apprendi, I would declare the non-retroactivity of Ring, and affirm the district court's denial of Summerlin's habeas petition.\n\n\u003cspan class=\"fn\"\u003e1. During his later disbarrment proceedings, Judge Marquardt admitted that he was addicted to the drug, although he did not specify how long he had been addicted. In support of his allegations against Judge Marquardt, Summerlin submitted to the district court an official report from the Phoenix Police Department dated June 3, 1991. The report details a purchase of marijuana by Judge Marquardt from Barbara Moffett in May of 1991, which was intercepted from the United States mail by the police. When the delivery went awry, the report states that Judge Marquardt called Barbara Moffett to see if she had spoken to the authorities about the purchase, and when she told him she had not, Judge Marquardt told her that everything would \"work out okay\" because his daughter Tiffany's boyfriend Butch \"was going to take the rap for the marijuana.\" The official police report also states that Barbara Moffett told Phoenix police in 1991 on the basis of first-hand knowledge that Judge Marquardt \"was a frequent user of marijuana, had been when she met him [sixteen years earlier], and has continued to be so since.\" The envelope in which Judge Marquardt sent a cashier's check to Ms. Moffett for the marijuana carried the printed official heading, \"Philip Marquardt, Superior Court Judge, Phoenix, Arizona.\" In a separate episode, Judge Marquardt was convicted in 1988 in Texas of misdemeanor possession of marijuana which was found on his person at the port of entry in Houston. In re Marquardt, 778 P.2d 241, 242-43 (1989). His apparently false explanation documented in that case was that a stranger gave him the marijuana wrapped in a small piece of plastic that he stuck in his watch pocket. Id. at 242. For that offense, the Supreme Court of Arizona suspended him from his judicial position without pay for one year from September 2, 1988, through September 2, 1989, a sanction considered by that court to be more severe than a mere censure or reprimand. Id. at 250. Despite this serious and career-threatening incident, Judge Marquardt continued to use marijuana. Eventually, Judge Marquardt stepped down from the bench and was ordered disbarred in Arizona and by the United States Supreme Court after the 1991 incident came to light. See In re Disbarrment of Marquardt, 503 U.S. 902 (1992); In re Marquardt, 821 P.2d 161 (Ariz. 1991).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. There are instances during pre-trial hearings and at trial when Judge Marquardt exhibited confusion over facts that had just been presented to him. He also made some quite perplexing, if not unintelligible, statements at various times during the trial. Obviously, because there was no discovery or evidentiary hearing permitted, the question of whether these episodes were related to impairment was, and is, unresolved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Summerlin's claim that his counsel had a conflict of interest does not implicate the guilt phase because his argument is that he was deprived of a favorable sentence. Summerlin's counsel clarified at oral argument that the claim concerning the trial judge's impairment was limited to the judge's penalty phase deliberations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Some of our sister circuits have addressed the question of whether Ring is retroactive as to cases governed by the AEDPA retroactivity rule, 28 U.S.C. § 2244(b)(2)(A). See Cannon v. Mullin, 297 F.3d 989, 994 (10th Cir. 2002) (holding that Ring was not retroactive under AEDPA, but not reaching the question of retroactivity under Teague); see also Whitfield v. Bowersox, 324 F.3d 1009, 1012 n.1 (8th Cir. 2003) (declining to address whether death sentence contravened Ring because Supreme Court had not expressly made Ring retroactive under AEDPA); Moore v. Kinney, 320 F.3d 767, 771 n.3 (8th Cir. 2003) (en banc) (same), petition for cert. filed, No. 02-10093 (Apr. 14, 2003). The question of whether a rule has retroactive application under AEDPA is a different inquiry from the question of whether Teague precludes retroactive application of a rule. Most importantly, AEDPA precludes retroactive application of a new rule of constitutional law unless \"made retroactive to cases on collateral review by the Supreme Court.\" 28 U.S.C. § 2244(b)(2)(A). Because the Supreme Court has not addressed whether Ring should be applied retroactively, the analysis of the retroactively of Ring under AEPDA and Teague is necessarily distinct. As the Eighth Circuit noted in Moore, in analyzing whether Ring should be applied retroactively in a case governed by AEDPA, \"[a]bsent an express pronouncement on retroactivity from the Supreme Court, the rule from Ring is not retroactive.\" 320 F.3d at 771 n. 3. To date, only the Eleventh Circuit has addressed the retroactivity of Ring under a Teague analysis. See Turner v. Crosby, ___ F.3d ___, No. 02-14941, 2003 WL 21739734 (11th Cir. July 29, 2003). In Turner, the Eleventh Circuit held that the petitioner's claim was procedurally barred, but held in the alternative that Ring was a procedural rule that should not be applied retroactively. Id. at *30-*37.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Most notably, Jeffery Walton, who raised the identical issue a decade ago, see Walton v. Arizona, 497 U.S. 639 (1990), but whose claim was rejected by the Supreme Court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. See, e.g., United States v. Barajas-Dias, 313 F.3d 1242, 1245 (10th Cir. 2002); Ross v. United States, 289 F.3d 677, 681 (11th Cir. 2002), cert. denied, 123 S. Ct. 944 (2003); Santana-Madera, 260 F.3d at 138-39; Lopez v. United States, 248 F.3d 427, 431-32 (5th Cir.), cert. denied, 534 U.S. 898 (2001); Lanier v. United States, 220 F.3d 833, 838 (7th Cir. 2000); Murr v. United States, 200 F.3d 895, 905-06 (6th Cir. 2000).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In contrast, our opinion in United States v. Buckland, 289 F.3d 558 (9th Cir.) (en banc), cert. denied, 122 S. Ct. 2314 (2002), illustrates how a decision with some substantive implications may be considered a procedural rule for Teague purposes. In Buckland, we assessed the impact of Apprendi v. New Jersey, 530 U.S. 466 (2000), on \"type and quantity\" findings under 21 U.S.C. § 841(b). 289 F.3d at 562-63. Apprendi held that \"[o]ther than the fact of a prior conviction, any fact that increases the penalty for a crime beyond the prescribed statutory maximum must be submitted to a jury, and proved beyond a reasonable doubt.\" 530 U.S. at 490. Rejecting the contention that Apprendi rendered § 841 unconstitutional, id. at 564, we concluded that Apprendi did not alter, restructure, or redefine as a matter of New Jersey law the substantive elements of the underlying offense there at issue, nor did it create or resurrect a separate substantive offense. Further, we noted, Apprendi did not demand that we do so when assessing \"type and quantity\" evidence under § 841. Id. at 565, 568. Rather, Apprendi imposed a particular procedure through which the existing \" 'elements' in § 841[ ]\" must be established, viz., through submission to the jury and proof beyond a reasonable doubt. Id. Accordingly, we determined in Buckland that the impact of Apprendi on \"type and quantity\" under § 841 was one of a procedural-not substantive-ilk. Id. at 563 (noting that Apprendi was retroactive nevertheless because the case arose through direct review) (citing Griffith, 479 U.S. at 328).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The Eleventh Circuit did not address the question of whether Ring had substantive impact on Florida law in its consideration of whether Teague barred the retroactive application of Ring. See Turner, 2003 WL 2173934, *33-*37. Thus, our consideration in this respect is different from the issue addressed by the Eleventh Circuit. To the extent that the Eleventh Circuit relied on a pure analogy to Apprendi in its Ring analysis, we respectfully disagree with its conclusions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In its assessment of the \"linkage\" between Ring and Apprendi, the dissent contends that we hitch our distinction of Apprendi solely to the putative inapplicability of harmless-error analysis in the Ring context. However, the crux of the analysis is different. What \"distance[s]\" Ring from Apprendi is not simply a harmless error consequence. Rather, the very focus of the Supreme Court's analysis in the two cases proves Ring and Apprendi distinct: Apprendi expressly refused to reach \"[t]he substantive basis\" of law at issue in that case, see 530 U.S. at 475; Ring, conversely, did reach the relevant substantive basis. See 536 U.S. at 589-90. In eliding this aspect of Ring's analysis, the dissent both overstates Ring's affinity to Apprendi and mischaracterizes the first step of our \"syllogism.\" See Dissent at 12789. The \"substantive\" aspect of Ring rests on more than the creation of a separate substantive offense. It rests, in addition, on the Supreme Court's wholesale invalidation of Arizona's capital sentencing scheme. See Bousley, 523 U.S. at 620. This kind of consideration of the \"substantive basis\" of the law was wholly absent from the Supreme Court's analysis and decision in Apprendi.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Justice O'Connor recognized this in her dissent in Ring, noting that \"[t]he Court effectively declares five States' capital sentencing schemes unconstitutional.\" Ring, 536 U.S. at 620 (O'Connor, J., dissenting) (referencing Arizona, Idaho, Montana, Colorado, and Nebraska).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. This concern is not merely theoretical. See James S. Liebman, et al., Broken System: Error Rates in Capital Cases, 1973-1995 at 5 (2000) available at .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. The capital murder statute effective at the time contemplated the consideration of presentence reports by capital sentencing judges. Ariz. Rev. Stat. § 13-703(C) (1998) (repealed Laws 1999, Ch. 104, § 1). Consideration of presentence reports was routine. See, e.g., State v. Bocharski, 22 P.3d 43, 56 (Ariz. 2001); State v. Mann, 934 P.2d 784, 792 (Ariz. 1997); State v. Kemp, 912 P.2d 1281, 1295 (Ariz. 1996); State v. Gulbrandson, 906 P.2d 579, 599 (1995); State v. Stokley, 898 P.2d 454, 468 (Ariz. 1995); State v. Brewer, 826 P.2d 783, 801 (Ariz. 1992); see also infra note 12.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. During the period relevant to this case, a study commissioned by the Federal Judicial Center noted that \"[t]he principal problem inherent in the use of the presentence report is its potential for introducing inaccurate or misleading information into the sentencing decision.\" Stephen A. Fennell \u0026 William N. Hall, Due Process at Sentencing: An Empirical and Legal Analysis of the Disclosure of Presentence Reports in Federal Courts, 93 Harv. L. Rev. 1615, 1628 (1980). The study cited an Arizona state case as a primary example in which an inaccurate presentence report caused \"defendants [to be] incarcerated for a significantly longer period than they should have been because of untrue statements in the presentence report.\" Id. at 1628-29 (citing State v. Killian, 370 P.2d 287, 290 (Ariz. 1962)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See, e.g., State v. Sansing, 26 P.3d 1118, 1129 (Ariz. 2001), cert. granted and judgment vacated by Sansing v. Arizona, 536 U.S. 954 (2002); Bocharski, 22 P.3d at 56; State v. Soto-Fong, 928 P.2d 610, 633 (Ariz. 1996); State v. Spears, 908 P.2d 1062, 1077 (Ariz. 1996); Gulbrandson, 906 P.2d at 599; State v. Williams, 904 P.2d 437, 454 (Ariz. 1995); State v. Bolton, 896 P.2d 830 (Ariz. 1995); State v. Apelt, 861 P.2d 634, 644 (Ariz. 1993); Brewer, 826 P.2d at 800; State v. Greenway, 823 P.2d 22, 29 (Ariz. 1992); State v. Amaya-Ruiz, 800 P.2d 1260, 1287 (Ariz. 1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Of course, the proper admission of victim impact evidence by itself does not necessarily violate the Eighth Amendment. Payne, 501 U.S. at 827. However, the Supreme Court has held that \"the admission of a victim's family members' characterizations and opinions about the crime, the defendant, and the appropriate sentence violates the Eighth Amendment.\" Id. at 830 n.2 (citing Booth v. Maryland, 482 U.S. 496 (1987)). In addition, if the material \"is so unduly prejudicial that it renders the trial fundamentally unfair, the Due Process Clause of the Fourteenth Amendment provides a mechanism for relief.\" Id. at 825 (citing Darden v. Wainwright, 477 U.S. 168, 179-183 (1986)). The Arizona Supreme Court has acknowledged that a defendant's constitutional rights would be violated if a capital sentencing jury received sentencing recommendations from the victim's family and friends, but has allowed capital sentencing judges to receive the information on the basis that judges will disregard \"the irrelevant, inflammatory, and emotional factors.\" Bolton, 896 P.2d at 856.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The dissent assails the use of juries in capital sentencing. This criticism misses the central issue. The presence of some imperfections in jury sentencing does not affect the conclusion that juries are ultimately more accurate than judges. While individual jurors may hold emotional or legally inaccurate views, the requirement of unanimity across twelve individuals significantly reduces the chance that these views will hold sway. Moreover, the fact that some jurors feel sympathy or pity does not imply that the verdict is ultimately governed by these emotions. See, e.g., Stephen P. Garvey, The Emotional Economy of Capital Sentencing, 75 N.Y.U. L. Rev. 26, 65 (2000) (noting the lack of correlation between feelings of sympathy or pity and a juror's final vote).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See John Blume \u0026 Theodore Eisenberg, Judicial Politics, Death Penalty Appeals, and Case Selection: An Empirical Study, 72 S. Cal. L. Rev. 465, 470-75 (1999) (describing a variety of campaigns to unseat state judges based on their alleged failure to impose or affirm death sentences); Stephen B. Bright et al., Breaking the Most Vulnerable Branch: Do Rising Threats to Judicial Independence Preclude Due Process in Capital Cases, 31 Colum. Hum. Rts. L. Rev. 123 passim (1999) (providing additional examples of judges under attack due to the outcomes of capital cases over which they presided); Symposium, Politics and the Death Penalty: Can Rational Discourse and Due Process Survive the Perceived Political Pressure?, 21 Fordham Urb. L.J. 239, 270-73 (1994) (presenting statements by judges participating in symposium in which they described criticism they faced during elections based on their decisions in capital cases).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The instruction at issue in Sullivan was similar to the one held unconstitutional in Cage v. Louisiana, 498 U.S. 39 (1990) (per curiam). Thus, the question in Sullivan was whether Cage error was subject to harmlesserror analysis under Chapman v. California, 386 U.S. 18 (1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Likewise, we have held that a constitutionally deficient indictment is a structural defect requiring reversal because the indictment \"fail[ed] to ensure that [the defendant] was prosecuted only 'on the basis of the facts presented to the grand jury.' \" United States v. Du Bo, 186 F.3d 1177, 1179 (9th Cir. 1999) (quoting United States v. Rosi, 27 F.3d 409, 414 (9th Cir. 1994)). We noted that \"[f]ailing to enforce this requirement would allow a court to 'guess as to what was in the minds of the grand jury at the time they returned the indictment.' \" Id. (quoting United States v. Keith, 605 F.2d 462, 464 (9th Cir. 1979)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The Arizona Supreme Court did not have the benefit of Nguyen when it decided Towery and Ring II. Thus, the Court assumed that the question of \"who[ ] decides\" the existence of aggravating circumstances was susceptible to harmless-error review. Towery, 64 P.3d at 834-35. For the reasons already discussed, however, harmless error cannot be assessed in a void, and, without a jury finding, there is nothing for the appellate court to review. The Arizona Supreme Court primarily relied on Neder v. United States, 527 U.S. 1 (1999), but Neder in fact buttresses, rather than controverts, our conclusion that Ring error is structural. In Neder, the Supreme Court held that the failure to submit a materiality instruction was subject to harmless-error analysis. 527 U.S. at 8-15. This, the Arizona Supreme Court reasoned, was akin to depriving a defendant a jury trial in a capital case penalty phase. Towery, 64 P.3d at 834-35. But Neder itself provides the crucial analytic distinction by identifying structural errors not susceptible to harmless-error analysis, namely errors that \"infect the entire trial process.\" 527 U.S. at 8 (citing Brecht v. Abrahamson, 507 U.S. at 630). These are errors that \"deprive defendants of 'basic protections' without which 'a criminal trial cannot reliably serve its function as a vehicle for determination of guilt or innocence . . . and no criminal punishment may be regarded as fundamentally fair.' \" Id. (quoting Rose, 478 U.S. at 577-78). Examples of structural error provided by Neder are racial discrimination in jury selection, see Vasquez v. Hillery, 474 U.S. 254 (1986); biased judges, see Tuney v. Ohio, 273 U.S. 510 (1927); and denials of public trials, see Waller v. Georgia, 467 U.S. 39 (1984). Neder, 527 U.S. at 8. As Neder makes clear, for structural error, it does matter \"who decides\" the case and in what context. There is a vast difference between not submitting the element of materiality to the jury for decision and having no jury decision at all.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The Mills/McKoy rule struck down state procedures that limited any given juror's consideration of mitigating circumstances in capital sentencing to such evidence that the entire jury had found relevant. McKoy v. North Carolina, 494 U.S. 433 (1990); Mills v. Maryland, 486 U.S. 367 (1988). Both the Fourth and the Sixth Circuits have held that the \"Mill/ McKoy\" rule is a \"watershed rule\" that warrants retroactive application.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. But see Cordova v. Collins, 953 F.2d 167, 173 (5th Cir. 1992) (holding without analysis that Teague bars retroactive application); Miller v. Lockhart, 65 F.3d 676, 686 \u0026 n.6 (8th Cir. 1995) (holding that Teague bars retroactive application of Mills and observing that the defendant never raised argument that Mills falls into a Teague exception).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. See list of cases on file in Clerk's office.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See James S. Liebman, et al., Broken System: Error Rates in Capital Cases, 1973-1995 at 5 (2000) available at .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Id. at i (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. See id. at 38-40.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. See, e.g., Jodi Wilgoren, Citing Issue of Fairness, Governor Clears out Death Row in Illinois, N.Y. TIMES, Jan. 12, 2003, at 1.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. See Death Penalty Info. Ctr., Innocence and the Death Penalty, at www.deathpenaltyinfo.org/article.php?did=412\u0026scid=6 (visited July 5, 2003). As of June 2003, DNA tests - a reasonably new scientific development - have established the innocence of at least 128 individuals who were wrongly convicted and imprisoned. See David Feige, The Dark Side of Innocence, N.Y. TIMES, June 15, 2003, § 6, at 15.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The Majority Opinion's discussion of the retroactivity of Apprendi is included in its alternative discussion of Ring as a new procedural rule. However, that discussion is also pertinent to the comparison of Ring, Walton, and Apprendi.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Although this article addresses the unique Missouri statutory scheme whereby juries determine all sentences, the principle applies with equal force to capital sentencing.\u003c/span\u003e\n\n",
    "body_length": 174885,
    "citedas": [
      "341 F.3d 1082",
      "3 Cal. Daily Op. Serv. 8013",
      "2003 Daily Journal D.A.R. 9927"
    ],
    "attorneys": "Counsel Ken Murray and Leticia Marquez, Federal Public Defender'sOffice, Phoenix, Arizona, for the petitioner-appellant. John Pressley Todd, Attorney General's Office, Phoenix, Arizona, for the respondent-appellee.",
    "category": [
      "36",
      "78",
      "75"
    ],
    "judges": "Before: Mary M. Schroeder, Chief Judge, andHarry Pregerson, Stephen Reinhardt,Diarmuid F. O'Scannlain, Michael Daly Hawkins,Sidney R. Thomas, M. Margaret McKeown,Kim McLane Wardlaw, Raymond C. Fisher,Richard C. Tallman, and Johnnie B. Rawlinson,Circuit Judges.",
    "citation_count": 56
  }
}
