{
  "id": "b4JCPmYBTlTomsSBSoSW",
  "document": {
    "title": "Lewis v. Alamance County",
    "full_title": "ERNESTINE LEWIS; SYLVESTER J. LEWIS AND MINNETTA E. HILL v. ALAMANCE COUNTY, NORTH CAROLINA, INCLUDING ITS BOARD OF COMMISSIONERS AND BOARD OF ELECTIONS .",
    "jurisdiction": "Fourth Circuit",
    "date": "1996-11-04T00:00:00.000Z",
    "docket": "No. 95-2002",
    "body": "Opinion\n\nLUTTIG, Circuit Judge:\n\nAppellants Ernestine and Sylvester Lewis, black voters of appellee Alamance County, North Carolina, challenged the County's at-large method of electing county commissioners, arguing that black citizens have been denied an equal opportunity to elect representatives of their choice through vote dilution, in violation of Section 2 of the Voting Rights Act, 42 U.S.C. § 1973. The district court granted summary judgment for the County, holding that plaintiffs failed to demonstrate that minority-preferred candidates are usually defeated by white bloc voting, as required by Thornburg v. Gingles, 478 U.S. 30, 92 L. Ed. 2d 25, 106 S. Ct. 2752 (1986). For the reasons that follow, we affirm.\n\nI.\n\nAlamance County is governed by a Board of Commissioners, the five members of which are elected, in at-large partisan elections, to four-year staggered terms. Voters are allowed to cast votes for as many candidates as there are vacant seats, but they cannot cast more than one vote for any one candidate. Since the 1965 passage of the Voting Rights Act, black candidates have run for seats on the Board in eight of fourteen election cycles. Only one black candidate, Jack O'Kelley, has been elected, although he was elected three times, in 1974 (after first being appointed to fill a vacancy), 1976, and 1980. Moreover, white candidates supported by a majority (often substantial) of black voters, either in the primary election, the general election, or both, have repeatedly won election.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nSection 2(a) of the Voting Rights Act of 1965 prohibits a State or its political subdivisions from imposing any voting practice \"in a manner which results in a denial or abridgement of the right of any citizen of the United States to vote on account of race or color.\" 42 U.S.C. § 1973(a). Section 2(b) of the Act, as amended in 1982, further provides that a violation of § 2(a) occurs,\n\nif, based on the totality of circumstances, it is shown that the political processes leading to nomination or election in the State or political subdivision are not equally open to participation by members of a class of citizens protected by subsection (a) of this section in that its members have less opportunity than other members of the electorate to participate in the political process and to elect representatives of their choice.\n\n42 U.S.C. § 1973(b) (emphasis added).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nIn Thornburg v. Gingles, 478 U.S. 30, 92 L. Ed. 2d 25, 106 S. Ct. 2752 (1986), the Supreme Courtinterpreted the amended Voting Rights Act as it applied to a challenge to multi-member districts in which candidates were elected at large. Rejecting the claim that an at-large election scheme is per se violative of the Voting Rights Act, id. at 48, the Court established three preconditions to proving that such a voting system dilutes minority group voting strength sufficiently to violate the Act:\n\nFirst, the minority group must be able to demonstrate that it is sufficiently large and geographically compact to constitute a majority in a single-member district. . . .\n\nSecond, the minority group must be able to show that it is politically cohesive. . . .\n\nThird, the minority must be able to demonstrate that the white majority votes sufficiently as a bloc to enable it . . . usually to defeat the minority's preferred candidate.\n\n478 U.S. at 50-51. If these preconditions are met, the court must then determine under the \"totality of circumstances\" whether there has been a violation of Section 2. See Johnson v. De Grandy, 512 U.S. 997, 114 S. Ct. 2647, 2657, 129 L. Ed. 2d 775 (1994); Collins v. City of Norfolk, Va., 816 F.2d 932, 938 (4th Cir. 1987) (\"Collins I\") (\"[The] ultimate determination [of vote dilution under the Voting Rights Act] still must be made on the basis of the 'totality of the circumstances.'\").\n\nIn an effort to meet Gingles ' second and third preconditions, plain tiffs' expert in this case conducted bivariate ecological regression analyses on the eleven primary and general elections in which a black candidate was on the ballot. Based on those regression analyses, the expert estimated the level of support among black voters for each candidate.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Plaintiffs then proffered the voter preference estimates as proof of both black voter cohesion (the second Gingles element) and white bloc voting sufficient to usually defeat black-preferred candidates (the third Gingles element). After reviewing the voter preference estimates from plaintiffs' expert on these selected elections, the district court held that plaintiffs had failed to provide evidence sufficient to satisfy the third Gingles element, because they had not shown that black-preferred candidates were usually defeated. Based upon the limited data before the court, this Conclusion was fully supported even by plaintiffs' own expert witness, who admitted during his deposition that twenty of the thirty-one candidates \"generally preferred\" by black voters in the select number of elections he analyzed won election or nomination, thirteen of twenty-two \"strongly preferred\" candidates won election or nomination, and eleven of the seventeen \"strongest preferred\" candidates won election or nomination. If only the five general elections analyzed by plaintiffs' expert are considered, eight of the eleven candidates most strongly preferred by black voters were elected to seats on the Board.\n\nPlaintiffs advance on appeal four arguments as to why the district court's Conclusion was in error. We reject plaintiffs' claim that those white candidates who received overwhelming support from black voters in general elections, assertedly only because they were Democrats, should not have been considered as black-preferred candidates by the district court. And we also reject plaintiffs' argument that the district court erred in not discounting the repeated success of one of the minority-preferred candidates because of the alleged effects of incumbency. We agree with plaintiffs, however, that the district court improperly aggregated primary and general election results, and also that it failed to conduct an individualized determination into whether some candidates should be treated as black-preferred candidates. Additionally, we conclude that the district court erred in a third respect, by basing its decision exclusively on data from elections in which a black candidate was on the ballot, rather than on a more representative sample of elections. By limiting its consideration to elections in which a candidate of the minority's race was on the ballot, the district court may have failed to include as black-preferred candidates some white candidates who may very well have been the representatives of choice of the black community.\n\nII.\n\nTurning first to what we perceive to be the overarching error, we believe that, by considering only elections in which a black candidate was on the ballot, the district court failed to analyze a sufficient number of elections to enable it to determine whether white bloc voting usually operates to defeat minority-preferred candidates. As noted, the district court considered only election data from eleven of the twentyeight primary and general elections held since passage of the Voting Rights Act -- six of fourteen primary elections and only five of fourteen general elections. Although we recognize that this election data was the only data proffered by plaintiffs, we believe that, without a larger, more representative sample of elections, the district court simply did not have before it sufficient evidence to determine whether the black-preferred candidates usually were defeated,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e unless one is will ing to assume (which we are not) that the black community will never have a preferred candidate in an election in which no black candidate is on the ballot, or, more fundamentally, that a black voter can never prefer a candidate who is white.\n\nAlthough the district court erred in this regard, we do not reverse its judgment because of this error, for it is the plaintiffs' burden to establish a violation of Section 2, and therefore their burden to proffer data from a sufficient number of elections to enable the district court to determine whether white bloc voting usually defeats minority-preferred candidates. Where, as here, plaintiffs fail to carry their burden to proffer sufficient evidence, and the district court correctly concludes on the basis of the proffered evidence that no Section 2 violation has been established, then the plaintiffs cannot be heard to complain.\n\nA.\n\nSection 2 of the Voting Rights Act prohibits the use of voting procedures, such as at-large elections, that afford minority voters less opportunity than other members of the electorate \"to elect representatives of their choice,\" 42 U.S.C. § 1973(b) (emphasis added), or, in the language of Gingles, that afford minority voters less opportunity to elect minority-preferred candidates. Gingles, 478 U.S. at 51. The only possible interpretation of this unambiguous language is that Section 2 prohibits any election procedure which operates to deny to minorities an equal opportunity to elect those candidates whom they prefer, whether or not those candidates are themselves of the minority race. As Justice Brennan observed in Gingles, \"it is the status of the candidate as the chosen representative of a particular racial group, not the race of the candidate,\" which is relevant in determining whether Gingles ' third precondition is satisfied. Gingles, 478 U.S. at 68 (plurality opinion of Brennan, J., joined by Blackmun, Marshall, and Stevens, JJ.); see Collins I, 816 F.2d at 937 n.5 (\"The question is not . . . so simple as how many blacks versus whites were elected. The court must examine the parties' studies of voting preferences to determine which were the preferred candidates of the majority and minority communities.\"); see also Lani Guinier, The Triumph of Tokenism: The Voting Rights Act and the Theory of Black Electoral Success, 89 MICH. L. REV. 1077, 1103 n.115 (1991) (\"Authentic repre sentatives [of the black community] need not be black as long as the source of their authority, legitimacy, and power base is the black community.\"). That is, a minority-preferred candidate may be a non-minority, just as a minority candidate may be the preferred candidate of the voters of the majority's race. The black community may prefer a white candidate, as the white community may prefer a black candidate. A Martin Luther King, Jr. or a Colin Powell can represent white Americans, no less than a John Fitzgerald Kennedy or a Hubert Humphrey can represent black Americans. To indulge the contrary presumption, that every black person necessarily prefers a black candidate over a white candidate, or that every white person necessarily prefers a white candidate over a black candidate, would itself constitute invidious discrimination of the kind that the Voting Rights Act was enacted to eradicate, effectively disenfranchising every minority citizen who casts his or her vote for a non-minority candidate. To acquiesce in such a presumption would be not merely to resign ourselves to, but to place the imprimatur of law behind, a segregated political system -- in Judge Cabranes' words, an \"electoral apartheid,\" NAACP v. City of Niagara Falls, N.Y., 65 F.3d 1002, 1016 (2d Cir. 1995) -- in derogation of the most fundamental principles of our representative democracy and in betrayal of our most cherished beliefs about individual autonomy and political self-determination.\n\nOur understanding of Section 2 that the minority-preferred candidate may be either a minority or a non-minority, and therefore that both elections in which the candidates are of the same race and elections in which the candidates are of different races must be considered in order to determine whether white bloc voting usually defeats the minority-preferred candidate, is confirmed within Section 2 itself, by the express proviso that \"the extent to which members of a protected class have been elected to office\" is but \"one circumstance which may be considered\" in assessing whether minority voters have been denied an equal opportunity \"to participate in the political process and to elect representatives of their choice.\" See 42 U.S.C. § 1973(b); see also id. (\"Nothing in this section establishes a right to have members of a protected class elected in numbers equal to their proportion in the population.\"). Were this proviso, coupled with the statute's plain reference to the minority's representatives \"of choice,\" not enough, the plurality in Gingles itself, as noted, expressly stated that \"only the race of the voter, not the race of the candidate, is relevant\" in determining whether a plaintiff has met Gingles ' preconditions, Gingles, 478 U.S. at 68 (emphasis added), and not a single Justice suggested that only candidates of the minority race could be considered minority-preferred candidates, see infra note 5. Indeed, as the Third Circuit has held, a candidate of the minority's race need not even be the minority-preferred candidate. Jenkins v. Red Clay Consol. School Dist. Bd. of Educ., 4 F.3d 1103, 1126 (3d Cir. 1993), cert. denied, 129 L. Ed. 2d 891, 114 S. Ct. 2779 (1994).\n\nAlthough at times they suggest otherwise, see Appellant's Br. at 30 (\"Under the law, black voters must have an opportunity not just to elect candidates of their choice, but to elect black candidates of their choice\"), plaintiffs no doubt agree with our interpretation of Section 2. They themselves conducted a bivariate regression analysis on the eleven elections in which a black candidate was on the ballot precisely in order to determine whether the black candidate or the white candidate was the minority-preferred candidate in those elections. Had they not believed, as we do, that a white candidate may be the minority-preferred candidate, then they would have advanced their claim solely on the basis that only one black candidate had actually won in these elections. To conduct a regression analysis with respect to a black-white election, ostensibly in part to identify the blackpreferred candidate, makes sense only if it is possible for the preferred candidate not to be the black candidate.\n\nWe recognize that the plaintiffs' expert in Gingles had only analyzed elections in which a black candidate had appeared on the ballot, see Gingles, 478 U.S. at 52, and that the Court there relied upon that data in invalidating North Carolina's at-large election scheme. The Court in Gingles, however, never addressed the question of whether plaintiffs' exclusion of evidence from white-white races rendered their proffer insufficient; it merely assumed for purposes of that case that the black candidates there were the representatives of choice of black voters. Justice Brennan, in fact, could not have been clearer in this regard:\n\nBecause both minority and majority voters often select members of their own race as their preferred representatives, it will frequently be the case that a black candidate is the choice of blacks, while a white candidate is the choice of whites. . . . Indeed, the facts of this case illustrate that tendency -- blacks preferred black candidates, whites preferred white candidates. Thus, as a matter of convenience, we and the District Court may refer to the preferred representative of black voters as the \"black candidate\" and to the preferred representative of white voters as the \"white candidate.\" Nonetheless, the fact that race of voter and race of candidate is often correlated is not directly pertinent to a § 2 inquiry. Under § 2, it is the status of the candidate as the chosen representative of a particular racial group, not the race of the candidate, that is important.\n\nId. at 68 (emphasis added, in part) (plurality opinion);\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e cf. Harvell v. Blytheville School District No. 5, 71 F.3d 1382, 1386 (8th Cir. 1995) (en banc) (\"We do not categorically state that a candidate is the minority-preferred candidate simply because that candidate is a member of the minority. Such stereotyping runs afoul of the principles embodied in the Equal Protection Clause.\" (citing Miller v. Johnson, 132 L. Ed. 2d 762, 115 S. Ct. 2475, 2486 (1995))), cert. denied, 116 S. Ct. 1876, 135 L. Ed. 2d 172 (1996).\n\nWhere the results of not even a majority, much less a substantial majority, of elections are considered, it is simply not possible for the district court to determine whether minority-preferred candidates are \"usually\" defeated. We therefore hold that, in assessing whether \"the white majority votes sufficiently as a bloc to enable it . . . usually to defeat the minority's preferred candidate,\" a district court must consider, at a minimum, a representative cross-section of elections, and not merely those in which a minority candidate appeared on the ballot, at least where elections in which minorities were on the ballot do not constitute a substantial majority of the total number of elections. Cf. Niagara Falls, 65 F.3d at 1016-17 (\"The trial court . . . properly attempted to analyze white-white elections, as well as to evaluate the success of white candidates in black-white elections, to determine whether whites voted as a bloc to defeat blacks' preferred candidates.\"). Only by considering such a representative sample can the district court meaningfully determine whether a white voting bloc usually defeats the minority-preferred candidate. See, e.g., Uno v. City of Holyoke, 72 F.3d 973, 985 (1st Cir. 1995) (\"To be legally significant, racially polarized voting in a specific community must be such that, over a period of years, whites vote sufficiently as a bloc to defeat minority[-preferred]\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e candidates most of the time. . . . In order reliably to tell whether racial groups do (or do not) band together behind particular candidates with regularity, all elections in the relevant time frame (or, at least, a representative sampling of them) must be studied -- not just those elections that, taken in isolation, reveal the cicatrices of racially polarized voting.\" (emphasis added)). By focusing exclusively on elections in which a minority candidate appeared on the ballot, it can only be determined whether the \"minority candidate\" is usually defeated, not, as required by Section 2, whether the \"minority-preferred candidate\" is usually defeated. See, e.g., Harvell, 71 F.3d at 1393 n.2.\n\nOur sister circuits interpret section 2 and the third Gingles element as do we. As the Tenth Circuit recognized in affirming a district court's finding that plaintiffs' evidence was \"inadequate\" to measure the success of minority-preferred candidates because it did not consider elections in which only whites were on the ballot:\n\n[A] per se rule against examining races that have only white candidates . . . would be clearly contrary to the [Gingles] plurality opinion, which views the race of the candidates as irrelevant in voting analysis [and] . . . is questionable in light of the language of § 2, which seeks to give minorities equal opportunity to \"elect representatives of their choice.\"\n\nSanchez v. Bond, 875 F.2d 1488, 1495 (10th Cir. 1989), cert. denied, 498 U.S. 937, 112 L. Ed. 2d 305, 111 S. Ct. 340 (1990); SCLC v. Sessions , 56 F.3d 1281, 1293-94 (11th Cir. 1995) (en banc) (approving district court's Conclusion that the analysis by plaintiff's expert \"was flawed because he only analyzed elections . . . involving a black candidate.\"), cert. denied, 133 L. Ed. 2d 660, 116 S. Ct. 704 (1996); see also Uno, 72 F.3d at 988 n.8 (\"The VRA does not require for a successful section 2 showing that minority-preferred candidates be members of the minority group . . . .\"); Niagara Falls, 65 F.3d at 1016 (district court properly analyzed white-white elections to determine which candidates were black-preferred); Clarke v. City of Cincinnati, 40 F.3d 807, 810 n.1 (6th Cir. 1994) (\"Plaintiffs suggest that white candidates cannot be included among blacks' preferred candidates, but we disagree.\" (quotation marks omitted)), cert. denied, 131 L. Ed. 2d 851, 115 S. Ct. 1960 (1995); Nipper v. Smith, 39 F.3d 1494, 1540 (11th Cir. 1994) (en banc) (\"We do not foreclose the consideration of electoral races involving only white candidates where the record indicates that one of the candidates was strongly preferred by black voters.\"), cert. denied, 131 L. Ed. 2d 723, 115 S. Ct. 1795 (1995); Jenkins, 4 F.3d at 1125 (\"There may be majority candidates who truly may be the minority community's representative of choice.\"); Valladolid v. City of National City, 976 F.2d 1293, 1297 (9th Cir. 1992) (\"[Appellants' argument] that minorities have long been underrepresented on the city council, and that a significant number of minority candidates have failed in their efforts to win election to that body. . . too easily equates the presence or absence of minority individuals on the council with the victory or defeat of minority-preferred candidates.\").\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThe Fifth Circuit in Citizens for a Better Gretna v. City of Gretna, La., 834 F.2d 496 (5th Cir. 1987), cert. denied, 492 U.S. 905, 106 L. Ed. 2d 564, 109 S. Ct. 3213 (1989), agreed that \"Gingles is properly interpreted to hold that the race of the candidate is in general of less significance than the race of the voter,\" 834 F.2d at 503, and it even noted that \"Justice Brennan's plurality opinion is careful not to state that a black candidate is tantamount to the black preference.\" Id. But, it found \"implicit\" in Gingles ' undiscussed reliance on data only from black-white elections \"the notion that black preference is determined from elections which offer the choice of a black candidate,\" and thus concluded that the race of the candidate was less significant than that of the voters \"only within the context of an election that offers voters the choice of supporting a viable minority candidate.\" Id. at 503-04; see also id. at 504 (\"The various Gingles Concurring and Dissenting opinions do not consider evidence of elections in which only whites were candidates. Hence, neither do we.\"); Campos v. City of Baytown, Tex., 840 F.2d 1240, 1244 (5th Cir. 1988) (\"The district court was warranted in its focus on those races that had a minority member as a candidate.\" (citing Gretna, 834 F.2d at 503)), cert. denied, 492 U.S. 905, 106 L. Ed. 2d 564, 109 S. Ct. 3213 (1989). However, the Fifth Circuit has, since, substantially retreated from its dictum in Gretna in Overton v. City of Austin, 871 F.2d 529 (5th Cir. 1989), holding that it is, indeed, permissible to consider elections in which a minority is not on the ballot. Id. at 538 (relying only on elections in which a minority was on the ballot and on election results rather than extrinsic factors \"is not the only permissible way to approach § 2 claims.\"); cf. LULAC v. Clements, 986 F.2d 728, 748 (5th Cir.) (\"[A] court may properly give more weight to elections in which the minority-preferred candidate is a member of the minority group.\"), on reh'g en banc, 999 F.2d 831, 864 (1993) (\"This court has consistently held that elections between white candidates are generally less probative in examining the success of minority-preferred candidates . . . .\" (emphasis added) (citing Campos, 840 F.2d at 1245; Gretna, 834 F.2d at 503)), cert. denied, 114 S. Ct. 878 (1994).\n\nIn short, though some courts have held that black-white elections are more probative than white-white elections, see, e.g., Uno, 72 F.3d at 988 n.8; Jenkins, 4 F.3d at 1128; LULAC, 999 F.2d at 864; Smith, 687 F. Supp. at 1316,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e to our knowledge, no court has held that a white candidate cannot, as a matter of law, be a minority-preferred candidate, and therefore that white-white elections are irrelevant to the Gingles third element inquiry.\n\nB.\n\nBy failing to consider evidence of elections in which no minority candidate appeared on the ballot, the district court, insofar as can be discerned, could have understated (or overstated) the extent to which minority-preferred candidates were usually defeated in Alamance County.\n\nFor example, the record includes election data from the 1974 general election because O'Kelley, a black candidate, was on the ballot seeking election to the unexpired term of the seat to which he had been appointed following a vacancy. But it does not include election data from the 1974 primary election, notwithstanding that the two Democrats elected in the primary for the two full-term seats, both of whom were white, each received 99+% of the black vote in the general election. Although it may well be that either or both of these candidates were the minority-preferred candidates in the 1974 primary, and therefore would have counted as minority-preferred electoral successes (both did receive a majority of black support in other primary elections -- Long received 84% in 1972, and Newlin 60%, in 1978), it could be that neither was a minority-preferred candidate in the 1974 primary, in which case there were uncounted minority-preferred defeats.\n\nSimilarly, the record does not include election results from the 1972 or 1978 general elections, although Long was successful in the 1972 primary with 84% of the black vote (second only to the 98% received by Morris, a black candidate), and Newlin was successful in the 1978 primary with 60% of the black vote (second only to the 78% received by black candidate Harris). Based upon the record data from other general elections, it may be that both of these candidates received near unanimous support of the black community in their general elections, and thus should have been considered the blackpreferred candidates in those elections. But, without the data from these elections, it simply cannot be known whether they, or others, were the black-preferred candidates, and therefore whether the blackpreferred candidates were successful or defeated.\n\nAnd there are no election returns, general or primary, for the 1966, 1968, 1970, 1982, 1988, or 1990 election cycles. The district court therefore likewise could not have known who were the representatives of choice of black voters in those elections, or whether or not they were defeated.\n\nIn making these observations, we do not suggest that the district court need analyze every election since 1965 in order to determine whether the minority-preferred candidates are usually defeated. We leave to another day the question of precisely how many elections must be considered in order for a district court's Conclusions to be adequately supported. Cf. Gingles, 478 U.S. at 57 (\"[A] pattern of racial bloc voting that extends over a period of time is more probative of . . . legally significant polarization than are the results of a single election.\"); Hines v. Mayor and Town Council of Ahoskie, 998 F.2d 1266, 1272 (4th Cir. 1993) (\"[The] 'results' test [of section 2 of the VRA] 'supposes the need to consider multiple electoral contests.'\" (quoting Baird v. Consolidated City of Indianapolis, 976 F.2d 357, 359 (7th Cir. 1992), cert. denied, 508 U.S. 907, 124 L. Ed. 2d 246, 113 S. Ct. 2334 (1993))); Baird, 976 F.2d at 359 (\"Any approach that depends on outcomes supposes the need to consider multiple electoral contests -- the same position over many years, many positions during the same year, or both.\"); Collins I, 816 F.2d at 936 (\"Whether there is a 'pattern of racial bloc voting that extends over a period of time' [is] a critical factor in a claim of vote dilution under § 2.\"); see also Uno, 72 F.3d at 985 (\"Race-conscious politics (or its absence, for that matter) can more readily be seen by producing a documentary that spans a series of elections than by taking an isolated snapshot of a single election.\"). Today, we hold merely that it is insufficient to consider selectively only those elections in which minority candidates were on the ballot, at least where such elections are not such a substantial majority of the total elections that a fair assessment can be made of whether the minority-preferred candidates are usually defeated by white bloc voting.\n\nIII.\n\nPlaintiffs challenge the methodology employed by the district court on numerous other grounds. Specifically, plaintiffs urge: 1) that the district court improperly viewed as minority-preferred candidates some candidates who finished second and third among black voters; 2) that it improperly treated candidates in the general election as black-preferred when those candidates assertedly received a majority of black votes only because they were Democrats; 3) that it improperly viewed success in the primary election as electoral success; and 4) that it failed to discount the weight attributed to the one repeatedly successful black candidate due to the effects of incumbency. We address each of these challenges in turn, finding no reversible error by the district court.\n\nA.\n\nPlaintiffs first contend that, contrary to our holding in Collins v. City of Norfolk, Va., 883 F.2d 1232 (4th Cir. 1989) (\"Collins II\"),cert. denied, 498 U.S. 938, 112 L. Ed. 2d 305, 111 S. Ct. 340 (1990), the district court considered as \"blackpreferred\" some successful candidates who finished second and third among black voters, behind a successful black-preferred candidate. We agree that the district court erred, but not in the manner plaintiffs suggest. Rather, we conclude the district court erred in plaintiffs' favor by not treating as \"black-preferred\" some successful candidates who placed second or third among black voters (and with a significant majority of black votes) behind an unsuccessful candidate who was the first choice of black voters.\n\n1.\n\nBecause Alamance County's Board of Commissioners is elected from a single, multi-member district, citizens are permitted to vote for either two or three candidates in both the primary and general elections, depending on the number of seats up for election in any given year. Consequently, the district court in most cases treated the top two or three vote-recipients among black voters as the black-preferred candidates, as did plaintiffs' expert. If the first choice of black voters did not win an election, however, the district court excluded from consideration even as possible minority-preferred candidates those candidates who placed second or third among black voters behind the losing black-preferred candidate, in attempted reliance on our opinion in Collins II, 883 F.2d at 1238. In so doing, the district court, as even counsel for the plaintiffs conceded at oral argument, seems to have misread our opinion in Collins II. We did not, in Collins II, adopt a per se rule against considering, as minority-preferred, candidates who finished second or third among minority voters behind an unsuccessful candidate who was the minority community's first choice. We held only that,\n\nthe mere election of a candidate who appears to have received votes from more than fifty percent of minority ballots does not count as a minority electoral success, when each ballot may contain votes for more than one candidate. In such a situation, if there were other candidates, preferred by a significantly higher percentage of the minority community, who were defeated in the same election, then it cannot be fairly said that the minority community has successfully elected representatives of its choice. Each such situation must be reviewed individually to determine whether the elected candidates can be fairly considered as representatives of the minority community. The presumption must be that they cannot if some other candidate has received significantly more minority votes.\n\nId. at 1238 (emphases added) (quoting Collins I, 816 F.2d at 937). Collins II, in other words, requires that a two-step inquiry be undertaken by the court in order to determine whether candidates who receive less support from black voters than an unsuccessful first choice may nevertheless be deemed black-preferred candidates in multi-seat elections. First, if the unsuccessful candidate who was the first choice among minority voters did not receive significantly higher percentage\" of the minority community's support than did other candidates who also received a majority among minority voters,\n\nCollins II, 883 F.2d at 1238 (quoting Collins I, 816 F.2d at 937); see also id. at 1239 (referring to the level of support given to the unsuccessful candidate as \"much greater\"), then the latter should also be viewed by the district court as minority-preferred candidates. Cf. Niagara Falls, 65 F.3d at 1018 (treating as black-preferred a candidate who finished behind an unsuccessful first choice among black voters whose support \"was not dramatically higher.\"). Second, if the level of support received by the unsuccessful first-place finisher among black voters was \"significantly higher\" than the support given the second- and third-place finishers by those same voters, then successful candidates who finished behind the unsuccessful first choice \"are presumed not to be the minority's preferred candidates or representatives of choice.\" 883 F.2d at 1238. Even so, the district court must still review \"each such situation . . . individually to determine whether the elected candidates can be fairly considered as representatives of the minority community.\" Id. This is to say that Collins II requires an individualized determination in the circumstance where the unsuccessful first choice of black voters received significantly more support than the next-place finishers of the black voters. In this circumstance, the individualized determination is undertaken in order to ensure that the second- or third-place finishers, who, based upon their substantial support from the minority community would seem to be minoritypreferred candidates, may in fact fairly be characterized as such.\n\nIn this case, black candidate Morris, for example, received 98% of the black vote in the 1972 Democratic primary election, and white candidates Long, Fleming, and Horne received 84%, 29%, and 16% of the black vote, respectively.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Long, Fleming, and Horne won the primary election. Notwithstanding the impressive support that Long received from black voters in the primary, the district court did not even consider whether Long might have been a black-preferred candidate. Because Morris' support among black voters was not \"significantly higher\" than Long's, the district court appears to have erred in not automatically treating Long as a black-preferred candidate. But even had Morris' level of support among black voters been significantly higher than Long's, the district court still would have erred in not making an individualized determination before rejecting Long as a black-preferred candidate.\n\nMorris' support was significantly higher than the 29% received by Fleming. In such a circumstance, as in the case directly addressed by Collins II,\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e a presumption against viewing Fleming as blackpreferred is required by our holding in Collins II, which, as a panel, we are bound by. However, the district court should have made an individualized determination to assess whether that candidate, too, could properly have been deemed black-preferred.\n\nThe district court also declined to treat successful white candidate Newlin as a black-preferred candidate in the 1978 Democratic primary, merely because Harris, the first choice of black voters, lost. There were two seats up for election that year, and Harris and Newlin were the top two vote-recipients among black voters, by far, with an estimated 78% and 60% of the black vote, respectively. Significantly, the third place finisher among black voters was a black candidate, who received only 12% of the black vote. Even were we to conclude that Harris' support among black voters was \"significantly higher\" than Newlin's, an individualized determination would still have been required before declining to treat Newlin as a black-preferred candidate. Again, we held in Collins II only that successful candidates who receive more than 50% of the black vote should not automatically be viewed as a black-preferred candidate if they receive significantly less support from black voters than another, losing candidate, not that they should never be treated as black-preferred.\n\n2.\n\nWhile the district court erred in automatically excluding, as possible minority-preferred candidates, the second- and third-place finishers behind an unsuccessful first choice among black voters, we do not believe the court erred, as plaintiffs contend, in not conducting an individualized determination with respect to every candidate who finished second or third among black voters behind successful blackpreferred candidates, before treating them as black-preferred. Plaintiffs object to the fact that the district court considered some of the second and/or third place finishers as black-preferred in the three primary elections in which the first choice of black voters was successful -- 1976, 1980, and 1984. In the 1976 primary, for example, the district court treated both successful black candidate O'Kelley, who won 99+% of the black vote, and successful white candidate Fleming, who finished second among black voters with 47% of the vote, as blackpreferred. The district court did not, however, consider successful white candidate Paris as black-preferred because he received only 16% of the black vote, even though that percentage placed him in a tie for third among black voters and thus may have been sufficient to win had the election been held only among black voters. See supra note 10. All three candidates went on to win in the general election, with 99+% of the black community's vote.\n\nPlaintiffs object to the district court's treatment of these second and third place finishers as black-preferred candidates on the ground that, \"in most of these elections, . . . the black community fielded only one [black] candidate,\" Appellant's Br. at 20. In advancing this argument, plaintiffs rely not on the holding in Collins II, but on a single passage from that case in which we said the following:\n\nIf black voters exercised their right to cast all of their allotted votes, they ran the risk that their second and third choices would be declared their preferred candidates. Only by single-shot voting -- withholding all votes save for their first choice, and forfeiting the opportunity to cast all votes allotted to each voter -- could the minority be assured that its second and third choices would not be declared its preferred candidates. In contrast, under the at-large system, the white voters can freely cast all votes allotted to them without suffering the penalty imposed on the minority voters.\n\n883 F.2d at 1239-40. Because Collins II, as explained above, addressed only the treatment of second- and third-place finishers behind an unsuccessful, not a successful, minority-preferred candidate, this passage is obviously dictum and not controlling here. And even were it applicable, the passage does not suggest the level of support necessary in order for such candidates to be considered minority-preferred.\n\nWe believe that it would be unwise to extend the holding in Collins II to instances in which the first choice among black voters was successful. Where the first choice of black voters was successful, there is simply no reason to presume that the minority community has been unsuccessful in electing representatives of its choice. Accordingly, we now hold that, in multi-seat elections in which voters are permitted to cast as many votes as there are seats, at the very least any candidate who receives a majority of the minority vote and who finishes behind a successful candidate who was the first choice among the minority voters is automatically to be deemed a black-preferred candidate, just like the successful first choice. Cf. Niagara Falls, 65 F.3d at 1018 n.18 (noting that parties did not dispute that candidates who received more than 50% were black-preferred). Candidates who receive less than 50% of the minority vote, but who would have been elected had the election been held only among black voters, are presumed also to be minority-preferred candidates, although an individualized assessment should be made in order to confirm that such a candidate may appropriately be so considered.\n\nThe district court appears generally to have conducted its analysis in the manner that we have described as appropriate. It considered as black-preferred candidates only those candidates who received sub stantial support from black voters;\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e it did not unquestioningly denominate as black-preferred the top two or three vote-recipients among the black community. Moreover, the court seems to have made an individualized determination before considering, as black-preferred, candidates such as Fleming who, in 1976, received slightly less than 50% of the black vote (47%), and in rejecting Paris, who in that same election only tied for third, with 16% of the black vote. We accordingly discern no reason to disturb the district court's determinations with respect to those candidates who finished second and third among minority voters, behind the minority community's successful first choice. Those determinations are not clearly erroneous. See Gingles, 478 U.S. at 77-79.\n\nB.\n\nPlaintiffs next object to the fact that the district court treated, as black-preferred, Democratic candidates who received 99+% of the black vote in general elections. Plaintiffs contend that to consider these candidates as black-preferred ignores that blacks in Alamance County overwhelmingly support Democrats in partisan elections. They argue that Democrats should be treated as black-preferred only if they were also black-preferred in the primary election. Therefore, they would have us discount, for example, the general election victories of Fleming in 1976 and Paris in 1980, both of whom received nearly unanimous black voter support, merely because they received \"only\" 47% and 48%, respectively, of the black vote in the primary elections. This argument is flawed in two fundamental respects.\n\nFirst, as we discuss infra, acceptance of this argument would require that we carry forward the candidates' black-preferred status from the primary to the general election, when the Voting Rights Act is clearly concerned with whether blacks have an equal opportunity to elect the candidate of their choice in both nominations and elections. See 42 U.S.C. § 1973(b) (\"A violation . . . is established if . . . it is shown that the political processes leading to nomination or election. . . are not equally open to participation by [citizens on account of race or color].\" (emphasis added)); cf. NAACP v. City of Columbia, S.C., 850 F. Supp. 404, 417 (D. S.C. 1993) (noting, as ironic, the fact that second choice of black voters, behind unsuccessful first choice, who went on to prevail in run-off election with majority of support from black voters, would not be considered preferred by either blacks or whites if level of support received in the initial primary election was the benchmark), aff 'd as modified on other grounds, 33 F.3d 52 (4th Cir. 1994) (per curiam), cert. denied, 115 S. Ct. 1095 (1995). Thus, candidates who receive 99+% of the black vote in general elections are the black-preferred candidate in that election, regardless of their level of support in the primary. We reject the proposition that \"success of a minority-preferred candidate in a general election is entitled to less weight when a candidate with far greater [minority] support was defeated in the primary.\" Niagara Falls, 65 F.3d at 1018. Such a view is grounded in the belief that minority voters essentially take their marbles and go home whenever the candidate whom they prefer most in the primary does not prevail, a belief about minority voters that we do not share. And such a view ignores altogether the possibility that primary election winners will become the minority's preferred candidate during the general election campaign, or that where, as here, the overwhelming majority of blacks vote in the Democratic primary, that a Republican could in fact become the black-preferred candidate in the general election by addressing himself to issues of interest to the minority community in a way that appeals to them as participants in the political process.\n\nSecond, under plaintiffs' theory, the district court would be required, contrary to Gingles, to assess the cause of the minority community's support of the candidate in determining whether the minority-preferred candidates usually are defeated by white bloc voting. See infra note 12. In Gingles, defendants argued that the plaintiffs were required to use multiple regression analysis, rather than bivariate regression analysis, to ensure that only those defeats of blackpreferred candidates that were actually caused by race, and not some other reason such as party affiliation, were considered defeats of black-preferred candidates for purposes of a vote dilution claim. The Gingles plurality explicitly rejected such a requirement in the context of assessing the second and third Gingles preconditions. 478 U.S. at 62.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nMoreover, even the limited election data in this record demonstrate that black voters do not vote monolithically, even in partisan general elections. White Democrats Holt and Thompson only received 69% and 83% of the black vote, respectively, in the 1984 general election, and Democrat Morris, who is black, received only 57% of the black vote in the 1986 general election -- behind Democrat Bennett, who is white, who received 99+% of the black vote.\n\nWe therefore hold that the district court properly deemed all general election candidates who received 99+% of the black community's vote as black-preferred, without reference to the underlying primary election.\n\nC.\n\nPlaintiffs next contend that the district court erred in not distinguishing between, and separately analyzing, primaries and general elections, in determining whether black-preferred candidates were \"usually\" successful. With this contention, we agree.\n\nSection 2(b) of the Voting Rights Act provides that a violation occurs if \"the political processes leading to nomination or election . . . are not equally open\" to all voters. 42 U.S.C. § 1973(b) (emphasis added); see also 42 U.S.C. § 1973l(c)(1) (\"The terms 'vote' or 'voting' shall include all action necessary to make a vote effective in any primary, special, or general election . . . .\"). The statute thus requires that minorities have an equal opportunity to participate not only in primary elections but also in general elections. From this, we believe it follows that the results in these two phases of the single election cycle must be separately considered and analyzed, and, in recognition of this statutory requirement, that Gingles ' third precondition can be satisfied by proof that, in either the primary or the general election, the minority-preferred candidate is usually defeated by white bloc voting. Not to separately consider primary and general elections risks masking regular defeat in one of these phases with repeated successes in the other, and thereby misperceiving a process that is palpably in violation of the Voting Rights Act, as not violative of the Act at all.\n\nBy way of illustration, an at-large voting method under which the candidates preferred by the minority community are always successful in the primary election but, because of white bloc voting, are always defeated in the general election (or one in which minoritypreferred candidates are essentially barred from the general election ballot because of racial-bloc voting in the primary, see White v. Regester, 412 U.S. 755, 767, 37 L. Ed. 2d 314, 93 S. Ct. 2332 (1973) (\"The black community has been effectively excluded from participation in the Democratic primary selection process.\")), is a voting method under which minorities are, because of white bloc voting, always unsuccessful in attaining elective office. By aggregating primary and general elections, however, a court would ineluctably find in both circumstances that minority-preferred candidates were successful fifty percent of the time, and therefore not \"usually\" defeated by white bloc voting.\n\nThe Supreme Court has held, in an analogous context, that courts must not rely on \"aggregated\" data \"when considering several separate vote dilution challenges in a single case.\" See Gingles, 478 U.S. at 59 n.28; see also id. at 101 (O'Connor, J., Concurring in judgment) (\"The District Court clearly erred in aggregating data from all of the challenged districts . . . .\"). Because plaintiffs' challenge is, in reality, two separate vote dilution challenges -- one to the at-large primary election scheme, and one to the at-large general election scheme -we believe that like reasoning must obtain here. Accordingly, we hold that primary and general election results should not be aggregated for purposes of determining whether black-preferred candidates are \"usually\" successful, and that the district court erred in so doing. Because plaintiffs in this case would not prevail on their Section 2 claim even were the primaries and general elections considered separately, however, we will not reverse the district court on account of this error.\n\nD.\n\nPlaintiffs' final claim is that the district court erred in not discounting the weight attributed to O'Kelley's electoral successes because he was an incumbent. See Gingles, 478 U.S. at 57 (\"Special circumstances, such as the absence of an opponent, incumbency, or the utilization of bullet voting, may explain minority electoral success in a polarized contest.\" (emphasis added)); but see Smith, 687 F. Supp. at 1317 (\"The materiality of [evidence of incumbency] is questionable.\" (citing Gingles, 478 U.S. at 63 (plurality opinion))). O'Kelley, one of the successful black-preferred candidates whom the district court considered in determining whether black-preferred candidates usually were defeated, won three straight general elections (and, apparently, 5 elections total, including primaries) after first being appointed to a vacant seat. Although the district court provided no explanation of its decision not to discount O'Kelley's successes, we will not disturb that decision, given that plaintiffs' own expert did not analyze the effects of incumbency for O'Kelley or for any other candidate. To reverse as clearly erroneous the district court's decision under these circum stances would be to transform what was at most a narrow or \"special\" circumstance envisioned by the Court only in dicta into a categorical rule that all electoral successes of a minority-preferred incumbent are to be discounted. See, e.g., Clarke, 40 F.3d at 813-14 (\"Incumbency plays a significant role in the vast majority of American elections. To qualify as a 'special' circumstance, then, incumbency must play an unusually important role in the election at issue; a contrary rule would confuse the ordinary with the special, and thus 'make practically every American election a \"special circumstance.\"'\" (quoting Collins II, 883 F.2d at 1250 (Chapman, J., Dissenting)). Of course, as the defendants point out, and as counsel for the plaintiffs conceded at argument, \"if incumbency were to be considered to discount the weight to be given to the success of one black candidate, O'Kelley, it likewise would have to be used to discount the weight given to the defeat of other black candidates who lost to incumbents, such as Harris in 1978 and Freeman in 1984.\" Appellee's Br. at 24, citing Nipper v. Smith, 39 F.3d 1494, 1538-39 (11th Cir. 1994)).\n\nThe purpose of the Voting Rights Act is to ensure to minority citizens an equal opportunity to participate in the democratic processes and to elect candidates of their choice, candidates whom they believe will best represent their political interests. The Act's purpose is not to ensure the election of candidates of the minority's race, nor is it to ensure the election of candidates of any particular political party. In guaranteeing that minorities will be afforded an equal opportunity to participate in the political processes and to elect representatives of \"their choice,\" the Act at once embodies the presumption and embraces the ideal that, in this Country, a candidate of any color can represent citizens of all colors, that a candidate of either party can represent the interests of all parties. Few presumptions are more fundamental to our system of representative democracy or more revealing of our commitment to equality and individual autonomy.\n\nAt bottom, through their collective arguments, plaintiffs urge a reading of the Supreme Court's decision in Gingles, and therefore an interpretation of Section 2, that would be \"at war\" with this fundamental presumption, this ideal, which we believe not only informed Congress' enactment of Section 2, but underlay the Court's interpreta tion of that provision in Gingles. The reading of Gingles urged upon us would not simply guarantee to minority voters an equal opportunity to elect representatives of their choice, but would require the election of minority candidates: \"Under the law, black voters must have an opportunity not just to elect candidates of their choice, but to elect black candidates of their choice.\" Appellant's Br. at 30. Such an interpretation, of course, is grounded ultimately in the twin presumptions that all members of a particular racial group will always prefer the same candidate and that that preferred candidate will always be of that group's race. We simply disagree that Gingles requires, or even permits, any such presumptions; indeed, we believe Gingles forbids such presumptions based upon race alone. And to the extent it can be read otherwise, we are convinced the Court would not so read the case today, given its unequivocal pronouncements that the principles of equal protection are offended by \"assumptions that voters of a particular race, because of their race, 'think alike, share the same political interests, and will prefer the same candidates at the polls'.\" Miller v. Johnson, 132 L. Ed. 2d 762, 115 S. Ct. 2475, 2486 (June 29, 1995) (quoting Shaw v. Reno, 509 U.S. 630, 647, 125 L. Ed. 2d 511, 113 S. Ct. 2816 (1993)); see also Shaw, 509 U.S. at 648 (\"'The principle of equality is at war with the notion that District A must be represented by a Negro, as it is with the notion that District B must be represented by a Caucasian, District C by a Jew, District D by a Catholic, and so on.'\" (quoting Wright v. Rockefeller, 376 U.S. 52, 66-67, 11 L. Ed. 2d 512, 84 S. Ct. 603 (1964) (Douglas, J., Dissenting))).\n\nThe judgment of the district court is affirmed.\n\nAFFIRMED\n\nDisposition\n\nAFFIRMED\n\nWILKINSON, Chief Judge, Concurring:\n\nI agree that the judgment of the district court should be affirmed, and I concur in Judge Luttig's fine opinion. I write separately, however, to express my concern about the way in which my Dissenting colleague interprets Thornburg v. Gingles, 478 U.S. 30, 92 L. Ed. 2d 25, 106 S. Ct. 2752 (1986). That case commands us, when analyzing claims of minority vote dilution, to determine whether \"the white majority votes sufficiently as a bloc to enable it . . . usually to defeat the minority's preferred candidate.\" Id. at 51.\n\nThe Dissent's intensely race-conscious approach to that inquiry seems to me at odds with three recent Supreme Court cases which have held race-based redistricting schemes to be in violation of the Constitution. See Bush v. Vera, 135 L. Ed. 2d 248, 116 S. Ct. 1941 (1996); Shaw v. Hunt, 135 L. Ed. 2d 207, 116 S. Ct. 1894 (1996); Miller v. Johnson, 132 L. Ed. 2d 762, 115 S. Ct. 2475 (1995). Gingles may require us to engage in an inquiry which focuses on racial considerations, but it cannot be read to require us to adopt rules that unconstitutionally tie American politics to racial identity. If my Dissenting brother's view of Gingles prevails, we will be well on our way to the creation of racially separate electorates and a racially separate society. Nothing in Supreme Court precedent compels us to take America in that direction.\n\nBy reversing the district court, the Dissent would lead us not only to a relentlessly race-conscious trial, but also toward the restructuring of Alamance County electoral districts along racial lines. This is just what the Supreme Court does not allow. Bush, Shaw, and Miller did not overrule Gingles, but they surely set limits on the ability of federal courts to cast voters as members of racial blocs rather than as individuals. In order to identify the \"minority-preferred\" candidate, we have been forced to wade into a bog of slippery assumptions and statistics. In this case alone, we have been asked to assault such impenetrable questions as: May a candidate who receives more than 50% of the minority vote, but who finishes behind a successful minority-preferred candidate, also be considered preferred by the minority? If the candidate who is most preferred by the minority is unsuccessful, may other successful candidates who received substantial minority support be considered as preferred by the minority? Should votes for candidates cast by minority voters in general elections be held not to express their true preferences when a candidate favored by minority voters in the primary election failed to win a place on the ballot for the general election? And, should votes for a minority-preferred candidate who is also an incumbent be disregarded when analyzing the successes of minority-preferred candidates?\n\nWhere will this road of race-consciousness end? As the above questions demonstrate, the Gingles inquiry is complicated enough in a biracial community. Is the inquiry to become ever more refined and ever more complex as America becomes more multicultural? How do we identify minority-preferred candidates under Gingles when multiple minorities are present? How shall we determine whether a candidate supported to a greater or lesser extent by different minorities is the preferred candidate of a single minority? To what extent are the electoral interests of different racial minorities to be aggregated or kept separate? How broadly or narrowly are the categories of racial minorities to be defined? At some point, this race-based calculus will demonstrate only how far the law has set us on the path to disunion.\n\nEntering this maze of racially laden inquiries reflects a view of American political life as a competition between highly segregated racial forces. Indeed, this is precisely the mistake of the Dissent. The Dissent's interpretation of Gingles will not allow courts to accept the votes of minority individuals as expressing their personal preferences. Instead, the Dissent mandates that we pass the votes of minority individuals under a microscope in order to determine the racial preferences expressed by those voters.\n\nUnder the Dissent's view, all electoral behavior is reducible to race. Thus, the Dissent suggests that because voters prefer candidates of their own race, elections in which no minority was a candidate need not be counted. The Dissent further suggests that minority votes for a candidate in a general election do not express a preference by the minority unless that candidate was also preferred by the minority in the primary election; that a successful candidate who received more than 50% of the minority vote, but finished behind a successful candidate who received a higher degree of minority support, should not automatically be considered to be preferred by the minority; and that certain electoral successes of incumbent, minority-preferred candidates should not count towards the success of minority individuals in electing their preferred candidate.\n\nAnd these are but a few of the racially-driven factors that the Dissent would fasten upon the judicial review of American elections. In its recent cases, the Supreme Court has made it clear that there is no room in the Constitution for congressional redistricting schemes predicated predominantly on the basis of race. See Bush v. Vera, 135 L. Ed. 2d 248, 116 S. Ct. 1941 (1996); Shaw v. Hunt, 135 L. Ed. 2d 207, 116 S. Ct. 1894 (1996); Miller v. Johnson, 132 L. Ed. 2d 762, 115 S. Ct. 2475 (1995). The Dissent's interpretation of Gingles flies in the face of this command by proposing a set of intricate inquiries designed to reinforce the view of American politics as a contest between separate racial voting blocs. The tendency of such rules to \"disrupt[ ] nonracial bases of political identity,\" Bush, 116 S. Ct. at 1962 (plurality opinion), will be no less than that of drawing district boundaries based on race, and they should be no more acceptable under the Constitution. \"It takes a shortsighted and unauthorized view of the Voting Rights Act to invoke that statute, which has played a decisive role in redressing some of our worst forms of discrimination, to demand the very racial stereotyping the Fourteenth Amendment forbids.\" Miller, 115 S. Ct. at 2494. In leading us ineluctably to electoral remedies based on racial shares, the Dissent \"carries us further from the goal of a political system in which race no longer matters -- a goal that the Fourteenth and Fifteenth Amendments embody, and to which the Nation continues to aspire.\" Shaw v. Reno, 509 U.S. 630, 113 S. Ct. 2816, 2832, 125 L. Ed. 2d 511 (1993).*fn*\n\nIt will be said that racial bloc voting is already ensconced in American political life and that courts must learn to embody in law what is established in fact. A Constitution, however, has its aspirational as well as descriptive aspect. It is informed by the way things ought to be. Were the Fourteenth Amendment no more than a concession to the racial realities of the day, Brown v. Board of Education would have remained an untaken step. Separation of the races is no better for America now than it was in 1954. It is a sad turn that has led the courts to rebuild the walls they once brought down.\n\nMICHAEL, Circuit Judge, Dissenting:\n\nSince 1980 no minority candidate has been elected to Alamance County's five-member Board of Commissioners. Indeed, since the Voting Rights Act was first passed in 1965, only one minority candidate has ever been elected to the Board of Commissioners. That candidate was initially appointed (not elected), and when he was first elected after his appointment, he ran in a special election that was not subject to Alamance County's at-large voting system. In light of this history, I believe that members of the black community in Alamance County would be truly surprised to learn that they enjoy the same opportunity as white voters to elect their preferred candidates as county commissioners. Yet, in light of this same history, the majority concludes that the plaintiffs have failed to demonstrate that minority-preferred candidates are usually defeated by white bloc voting and affirms the award of summary judgment to the County.\n\nThe majority offers two main reasons for its decision. First, the majority believes that the plaintiffs have failed to defeat the County's motion for summary judgment because the plaintiffs have not \"proffered data from a sufficient number of elections to enable the district court to determine whether white bloc voting usually defeats minority-preferred candidates.\" Ante at 8. That is, because the plaintiffs have not proffered evidence from elections in which no minority was a candidate, the County is entitled to judgment as a matter of law. The majority reaches this Conclusion even though the plaintiffs have proffered election data from every election in which a minority was a candidate, and even though the Supreme Court in Thornburg v. Gingles, 478 U.S. 30, 92 L. Ed. 2d 25, 106 S. Ct. 2752 (1986), upheld a finding of vote dilution based on an analysis of election data that included results from only those elections in which a minority was a candidate and that covered only three election years.\n\nSecond, the majority believes that even if we only consider the election data that the plaintiffs have proffered, the plaintiffs have still failed to establish a violation of section 2 of the Voting Rights Act, 42 U.S.C. § 1973. In particular, under the majority's approach for determining who is and who is not a minority-preferred candidate, the plaintiffs have failed to show that minority voters' preferred candidate is usually defeated by white bloc voting. In reaching this Conclusion, the majority adopts a methodology that is unsound and unsupported by precedent. For example, even though primary election results provide a means for assessing minority voter preference without the effects of partisanship, under the majority's approach it is improper to consider primary election data when determining who is and who is not a minority-preferred candidate in the general election. Ante at 23-24. Thus, according to the majority, we should take raw election data in isolation and disregard the probative value of considering general election data in conjunction with primary election data (or in conjunction with any other circumstance in most cases).\n\nBecause I believe that neither of the majority's two reasons provide grounds for affirming the district court's grant of summary judgment, I respectfully Dissent. At the very least, I believe that it is clear that the plaintiffs have offered ample evidence showing that there is a genuine issue of material fact of whether minority-preferred candidates are usually defeated by white bloc voting. Therefore, the district court's order granting summary judgment should be reversed and the case remanded for trial.\n\nI.\n\nThe Supreme Court's decision in Gingles makes clear that the plaintiffs have the burden of proving each of the Court's three preconditions, see Gingles, 478 U.S. at 48, including whether \"the white majority votes sufficiently as a bloc to enable it--in the absence of special circumstances, . . . usually to defeat the minority's preferred candidate.\" Id. at 51 (citations omitted). And the plurality opinion of Justice Brennan emphasizes that \"it is the status of the candidate as the chosen representative of a particular racial group, not the race of the candidate, that is important.\" Id. at 68 (Brennan, J., plurality opinion) (emphasis in original).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Yet, the Court's decision in Gingles notes that:\n\nThe number of elections that must be studied in order to determine whether voting is polarized will vary according to pertinent circumstances. One important circumstance is the number of elections in which the minority group has sponsored candidates. Where a minority group has never been able to sponsor a candidate, courts must rely on other factors that tend to prove unequal access to the electoral process. Similarly, where a minority group has begun to sponsor candidates just recently, the fact that statistics from only one or a few elections are available for examination does not foreclose a vote dilution claim.\n\nId. at 57 n.25; see Jenkins v. Red Clay Consol. School Dist. Bd. of Educ., 4 F.3d 1103, 1130 (3d Cir. 1993) (\"The Supreme Court's language clearly indicates that an inability to offer statistical evidence on a large number of elections should not foreclose a voting rights claim.\") cert. denied, 129 L. Ed. 2d 891, 114 S. Ct. 2779 (1994); Citizens for a Better Gretna v. City of Gretna, 834 F.2d 496, 502 (5th Cir. 1987) (\"Gingles. . . suggests flexibility in the face of sparse data.\"), cert. denied, 492 U.S. 905, 106 L. Ed. 2d 564, 109 S. Ct. 3213 (1989).\n\nAccordingly, the plaintiffs here, faced with the prospect of having to establish their vote dilution claim at trial, conducted a statistical analysis of all general and primary elections since 1972 in which a minority candidate was on the ballot for county commissioner. In total, the plaintiffs proffered election data from five general elections and six primary elections extending over twenty years. The election data included the general elections in 1974, 1976, 1980, 1984, and 1986, and the Democratic primaries in 1972, 1976, 1978, 1980, 1984, and 1992. See Gingles, 478 U.S. at 57 (\"a pattern of racial bloc voting that extends over a period of time is more probative of a claim that a district experiences legally significant polarization than are the results of a single election\").\n\nIn turn, the County proffered no election data of its own. Instead, the County moved for summary judgment arguing that the plaintiffs' own election data fails to support their contention that the minority group's preferred candidates are usually defeated by bloc voting among white voters of Alamance County. Neither before the district court, nor in its briefs to this court, did the County argue that it was entitled to summary judgment because the plaintiffs had only analyzed elections involving minority candidates. In essence, however, that is what the majority has held here today.\n\nI disagree with this result because I believe that the plaintiffs have in fact offered sufficient evidence from which a fair assessment can be made of whether minority-preferred candidates are usually defeated by white bloc voting. In addition, I believe that if the County wishes to rebut the plaintiffs' evidence of racial polarization based on evidence from elections in which no minority was a candidate, then the County should have the burden to produce such evidence.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e I will elaborate on each of these points below.\n\nA.\n\nNo court before today has ever dismissed a vote dilution claim because the plaintiffs failed to proffer evidence of elections in which no minority was a candidate. And, of course, the majority does not expressly say that is what it is doing here. According to the majority, it \"holds merely that it is insufficient to consider selectively only those elections in which minority candidates were on the ballot, at least where such elections are not such a substantial majority of the total elections that a fair assessment can be made of whether the minority-preferred candidates are usually defeated by white bloc voting.\" Ante at 17. Yet, the majority makes clear that it believes that \"both elections in which the candidates are of the same race and elections in which the candidates are of different races must be considered in order to determine whether white bloc voting usually defeats the minority-preferred candidate . . . .\" Id. at 9 (emphasis added).\n\nOf course, I agree that there must be sufficient election data presented from which a \"fair assessment can be made\" of the third Gingles precondition. I cannot, however, agree that a \"fair assessment\" must be based on data from a \"substantial majority of the total elections.\" Nor can I agree that elections in which no minority was a candidate must be considered in all circumstances.\n\nDespite what the majority believes, there is no requirement under section 2 of the Voting Rights Act or Supreme Court precedent that the plaintiffs offer election data from \"a substantial majority of the total elections\" in order to show that minority-preferred candidates are usually defeated by white bloc voting. Likewise, even though \"a minority-preferred candidate may be either a minority or a non-minority,\" neither section 2 of the Voting Rights Act nor Supreme Court precedent requires, as the majority claims, that we \"must\" consider (and plaintiffs must proffer) data from elections in which no minority was a candidate. See ante at 9. As I have said, not only did the decision in Gingles uphold vote dilution claims based on election data that included only those elections in which a minority was a candidate, but the Court specifically noted that \"the number of elections that must be studied in order to determine whether voting is polarized will vary according to the pertinent circumstances.\" 468 U.S. at 57 n.25 (emphasis added). And no court (at least before today) has ever said that there is a per se rule requiring that election data from elections in which no minority was a candidate \"must\" be proffered. Cf. Sanchez v. Bond, 875 F.2d 1488, 1495 (10th Cir. 1989) (\"We do not believe that a per se rule against examining races that have only white candidates is implicit in Gingles.\") (emphasis added), cert. denied, 498 U.S. 937, 112 L. Ed. 2d 305, 111 S. Ct. 340 (1990).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThis makes complete sense. While minority voters might prefer a candidate from the majority (i.e., white) group, common experience shows that minority voters frequently prefer minority candidates. The opposite is true as well. Gingles, 478 U.S. at 68 (Brennan, J., plurality opinion) (\"Because both minority and majority voters often select members of their own race as their preferred representatives, it will frequently be the case that a black candidate is the choice of blacks, while a white candidate is the choice of whites.\") (citation omitted); Jenkins, 4 F.3d at 1126 (\"experience does demonstrate that minority candidates will tend to be candidates of choice among the minority community\").\n\nMoreover, even though voter preference is what matters, minority sponsorship of a candidate is the basis for determining whether a candidate is minority preferred. Of course, sponsorship can be proven in a number of different ways, and election data is only one of them. However, when a defendant neither argues nor proffers evidence that the minority has sponsored such a significant number of white candidates that a fair assessment can not be made without an analysis of election data from elections in which no minority was a candidate, I do not believe that we may require a plaintiff to proffer election data from white/white elections before a vote dilution claim can be proven.\n\nIndeed, when the minority's only choice is to vote for a white candidate or not to vote at all, such elections are, in general, less probative on the issue of racial polarization than elections involving both black and white candidates. As the Fifth Circuit has said:\n\n\"The evidence most probative of racially polarized voting must be drawn from elections including both black and white candidates.\" \"When there are only white candidates to choose from it is 'virtually unavoidable that certain white candidates would be supported by a large percentage . . . of black voters.'\" Thus, it is not particularly surprising--and not particularly probative--that analysis of elections that included only white candidates did not reveal any racial polarization.\n\nWestwego Citizens for Better Gov't v. City of Westwego, 946 F.2d 1109, 1119 n.15 (5th Cir. 1991) (Westwego III ) (citations omitted; quoting Westwego I, 872 F.2d 1201, 1208 n.7 (5th Cir. 1989); Citizens for a Better Gretna v. City of Gretna, 834 F.2d 496, 502 (5th Cir. 1987), cert. denied, 492 U.S. 904 (1989)); see ante at 15 (listing cases in which courts have held that black/white elections are more probative than white/white elections). Therefore, if the defendant does not bring forth evidence of particular circumstances showing that minority voters often choose to sponsor, Gingles, 478 U.S. at 57 n.25, and not merely vote for white candidates, I believe that \"a fair assessment can be made\" of the third Gingles precondition without the proffer of election data from elections in which no minority was a candidate.\n\nA fair assessment is just that, and the plaintiffs in this case have offered more than sufficient election data from which we may discern election patterns in Alamance County. The plaintiffs' election data spans the twenty years preceding the filing of the plaintiffs' complaint in October of 1992. During those twenty years, there were ten county commissioner elections, and of those ten elections the plaintiffs have offered election data from five general elections and six primary elections. In other words, the plaintiffs have offered election data from a majority of the county commissioner elections held within the two decades preceding the filing of their complaint. I believe it is clear that the proffer of such extensive election data as this satisfies the plaintiffs' burden to produce sufficient election data from which a fair assessment can be made. See, e.g., Gingles, 478 U.S. at 61 (concluding that \"the District Court's approach, which tested data derived from three election years in each district, and which revealed that blacks strongly supported black candidates, while, to the black candidates' usual detriment, whites rarely did, satisfactorily addresses each facet of the legal standard\"); Uno v. City of Holyoke, 72 F.3d 973, 985 (1st Cir. 1995) (\"race-conscious politics (or its absence, for that matter) can more readily be seen by producing a documentary that spans a series of elections than by taking an isolated snapshot of a single election\").\n\nB.\n\nWhile the plaintiffs have the burden of proving the Gingles preconditions, nothing prevents the defendant from offering election data of its own. And, as I have said, black/white elections are generally more probative than white/white elections. It therefore follows that if the plaintiffs have proffered election data sufficient to provide a \"fair assessment\" of the third Gingles precondition, and that election data only involves black/white elections, the defendant is free to counter with evidence of election data from elections in which no minority was a candidate. As the Third Circuit has said:\n\nWe . . . do not believe that plaintiffs are required to present evidence on white versus white elections if they do not believe that those elections are probative. If the defendants want to introduce evidence on those elections in an attempt to rebut the plaintiffs' evidence of cohesiveness or white bloc voting, they may do so. Nevertheless, because white versus white elections tend to be less probative, there may still be cases in which \"the evidence of polarized voting . . . is so strong . . . that it cannot be overcome even when all reasonable inferences are accorded to the evidence of elections involving only white candidates.\"\n\nJenkins, 4 F.3d at 1128-29 (quoting Smith, 687 F. Supp. at 1317); see Uno, 72 F.2d at 988 \u0026 n.8 (noting that when district court only examined elections involving minority candidates, \"evidence exhumed from 'white only' elections may still be relevant in assessing the totality of the circumstances in a vote dilution case, especially if it tends to rebut the evidence of cohesion or white bloc voting extracted from 'mixed' elections\") (emphasis added; citation omitted).\n\nIn this case, the County offered no evidence from white/white elections. And, in fact, the County has not even argued that such elections are probative. Accordingly, the majority is simply wrong to uphold the district court's decision granting summary judgment because the plaintiffs have not offered evidence from elections in which no minority was a candidate.\n\nII.\n\nThe majority is also wrong to conclude that if we only consider the election data that the plaintiffs have proffered from black/white elections, the plaintiffs have still failed to establish a violation of section 2 of the Voting Rights Act, 42 U.S.C. § 1973. Ante at 8. In particular, I believe that the majority's (and the district court's) methodology for determining who is and who is not a minority-preferred candidate is fundamentally flawed and that the County is not entitled to summary judgment when the election data put forth by the plaintiffs is properly considered.\n\nInitially, I emphasize that the majority opinion does not squarely address the issue of the procedural posture of this case. We are hearing this case on appeal from the district court's grant of summary judgment in favor of the County, and not after a trial on the merits. Therefore, it is the moving party (i.e., the County) that has the burden of showing that there is no genuine issue of material fact requiring a trial, and we must draw all reasonable inferences in favor of the nonmoving party (i.e., the plaintiffs). In addition, while the plaintiffs here bear the ultimate burden of persuasion on their vote dilution claim, the County must show that there is an absence of evidence to support the plaintiffs' claim in order to succeed on summary judgment. See, e.g., Marylanders for Fair Representation, Inc. v. Schaefer, 849 F. Supp. 1022, 1030 (D. Md. 1994) (three-Judge court) (citing Celotex Corp. v. Catrett, 477 U.S. 317, 322-23, 91 L. Ed. 2d 265, 106 S. Ct. 2548 (1986)). And while we have previously said that plaintiffs in a vote dilution case cannot \"pass the summary judgment threshold\" unless they establish all the Gingles\n\npreconditions, McGhee v. Granville County, 860 F.2d 110, 117 (4th Cir. 1988) (internal quotes and citation omitted), I believe that the plaintiffs here have adequately established the Gingles preconditions for purposes of defeating the County's motion for summary judgment.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nMoreover, because we are reviewing this case on summary judgment, I do not believe that the district court's factual findings are entitled to deference. The district court assessed a paper record, and we should, as we normally do on summary judgment, review the court's findings de novo. Cf. ante at 22-23, 27-28 (upholding district court's factual findings under the clearly erroneous standard of Rule 52(a) of the Federal Rules of Civil Procedure).\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nOf course, the legal standards that the district court applied are not entitled to any deference. And even if there had been a trial on the merits in this case, we would still have the \"power to correct errors of law, including those that may infect a so-called mixed finding of law and fact, or a finding of fact that is predicated on a misunderstanding of the governing rule of law.\" Gingles, 478 U.S. at 79 (internal quotes and citations omitted). Accordingly, I turn now to the errors of law that infected the district court's decision in this case-errors that the majority has simply compounded.\n\nA.\n\nThe plaintiffs challenge the methodology employed by the district court on several grounds. First, the plaintiffs argue that the district court erred \"by grouping together white candidates for whom black voters voted only in the absence of other alternatives with candidates who were enthusiastically and overwhelmingly supported by black voters (and who were, with one exception, black) . .. .\" Appellants' Brief at 16. According to the plaintiffs, the fact that many white Democratic candidates received substantial electoral support from black voters in general elections does not show that these candidates are minority preferred. Rather, it is a reflection of the fact that when the only electoral choice is to vote for a white Republican or a white Democrat, blacks in Alamance County usually choose the white Dem ocrat. Therefore, the district court should have conducted an individualized assessment of each candidate that received a majority of the minority's support in the general election to determine if that candidate was truly minority preferred. For example, the district court should have examined primary election results (nominating elections where the effects of partisan voting are minimized) to determine the black community's true level of support for a particular candidate.\n\nSecond, while the district court failed to examine primary elections to help determine who is and who is not minority preferred, the plaintiffs argue that the district court erred because it equated success in primary elections with success in general elections. This, according to the plaintiffs, is wrong because \"winning the primary does not place the winner in office.\" Id. at 25.\n\nFinally, the plaintiffs believe that the district court erred because it failed to discount the three election victories of Jack O'Kelley, the only black candidate ever elected to Alamance County's Board of Commissioners. Id. at 26. In particular, the plaintiffs contend that the district court should not have counted O'Kelley's election victories because O'Kelley first gained office by appointment, not election. In other words, unlike every other county commissioner, O'Kelley has always been an incumbent. Thus, the factual circumstances surrounding his election victories are not typical, and they provide little guidance for determining whether white bloc voting usually defeats the minority's preferred candidate.\n\nThe majority disagrees with much of what the plaintiffs argue, though to its credit the majority does correctly recognize that \"primary and general elections results should not be aggregated for purposes of determining whether black-preferred candidates are 'usually' successful . . . .\" Ante at 27. Thus, the majority evidently agrees with the plaintiffs that even though a minority-preferred candidate wins in the primary, this success alone does not count for purposes of determining whether the minority is usually able to elect its preferred candidates to office. And I too agree on this point.\n\nNevertheless, I cannot agree with the majority's Conclusions with respect to the plaintiffs' other assigned errors. According to the majority, the district court actually \"erred in plaintiffs' favor by not treating as 'black-preferred' some . . . candidates who placed second or third among black voters (and with a significant majority of black votes) behind an unsuccessful candidate who was the first choice of black voters.\" Ante at 17-18. Also, the majority believes that the district court did not err when it failed to conduct an individualized determination of candidates who placed second or third among minority voters when the minority's first choice was successful. Ante at 22-23. Furthermore, the majority rejects the plaintiffs' argument that primary election results provide a basis to help determine whether a candidate is minority preferred in the general election. See ante at 23-26. And the majority believes that the district court did not err in giving full weight to the three election victories of Jack O'Kelley. Ante at 27.\n\nI believe that in reaching these Conclusions the majority has seriously misread the Supreme Court's decision in Gingles, our own precedent, and precedent from our sister circuits. As I explain below, the critical error that both the majority and the district court make is to isolate election data from the actual circumstances surrounding an election and then to treat such data as dispositive for purposes of determining who is a minority-preferred candidate (though, under most circumstances, the majority does not treat the data as dispositive for purposes of determining who is not a minority-preferred candidate).6Granted, election data (taken in isolation) provides some guidance in making a determination of who is and who is not a minority-preferred candidate. However, both section 2 of the Voting Rights Act and Gingles demand a more searching inquiry than mere reference to the percentage of minority voter support that a candidate has received, particularly when the candidate is not a minority and an at-large voting system is employed. At the very least, we must examine the particular circumstances of each case to discern whether the electoral support that minority voters give a candidate (especially in general elections) truly reflects minority voters' preference or whether such support is itself a manifestation of a structural inequality in the challenged voting system.\n\n1.\n\nWe have covered much of this ground before. See Collins v. City of Norfolk, 883 F.2d 1232 (4th Cir. 1989) (Collins II), cert. denied, 498 U.S. 938, 112 L. Ed. 2d 305, 111 S. Ct. 340 (1990).\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e At-large voting schemes may work to create the appearance of minority preference where none actually exists because once the number of seats up for election exceeds the number of candidates that minority voters \"prefer,\" minority voters face the choice of either voting for a candidate that they do not actually prefer or not voting at all. Thus, the fact that a candidate receives a majority of the minority vote does not automatically make that candidate a minority-preferred candidate for purposes of the third Gingles precondition. As we explained in Collins II:\n\nThe mere election of a candidate who appears to have received votes from more than fifty percent of minority ballots does not count as a minority electoral success, when each ballot may contain votes for more than one candidate. In such a situation, if there were other candidates, preferred by a significantly higher percentage of the minority community, who were defeated in the same election, then it cannot fairly be said that the minority community has successfully elected representatives of its choice. Each situation must be reviewed individually to determine whether the elected candidates can be fairly considered as representatives of the minority community. The presumption must be that they cannot, if some other candidate has received significantly more minority votes.\n\n883 F.2d at 1238 (emphasis added; quoting Collins IV, 816 F.2d 932, 937 (4th Cir. 1987)).\n\nCollins II thus demands a two-step inquiry. In the first step we decide whether there is a presumption that a candidate is or is not minority preferred. When an unsuccessful candidate receives a significantly higher percentage of the minority vote than candidates who win election with a majority of the minority vote, the elected candidates are presumed not to be minority preferred. When, however, an unsuccessful candidate receives a percentage of the minority vote which is not significantly higher than that of the elected second- and third-place finishers, we presume that the second- and third-place finishers are minority preferred. Either way, however, the election data only creates a presumption.\n\nIn the second step of the inquiry the district court must determine whether the presumption is supported by other facts. The court must make an individualized determination of \"whether the elected candidates can be fairly considered as representatives of the minority community.\" Depending on the outcome of the first step, there may be a presumption for or against finding that a candidate is minority preferred, but regardless of the presumption the district court must make an individualized determination in \"each situation.\" Such an individualized determination is required, because as both Congress and the Supreme Court recognize, \"whether the political processes are equally open depends upon a searching practical evaluation of the past and present reality, and on a functional view of the political process.\" S. Rep. No. 417, 97th Cong., 2d Sess. 30 (1982), reprinted in 1982 U.S.C.C.A.N. 177, 208; Gingles, 478 U.S. at 45 \u0026 79.\n\nThe majority recognizes that Collins II demands a two-step inquiry. See ante at 19. The majority, however, misconstrues the inquiry. Under the first step, according to the majority, a second- or thirdplace finisher is minority preferred if the unsuccessful first choice received a percentage of the minority vote which is not significantly higher than that of the elected second- and third-place finishers. Id. In this situation, the majority believes that a district court need not (and evidently cannot) proceed to the second step of the inquiry in order to make the individualized determination required under the Act and Gingles. Id. at 20 (\"Because[unsuccessful candidate] Morris' support among black voters was not 'significantly higher' than [successful candidate] Long's, the district court appears to have erred in not automatically treating Long as a black-preferred candidate.\") (emphasis added).\n\nNeedless to say, cutting off the inquiry at the first step makes a court's \"searching practical evaluation of the past and present reality\" dependent exclusively upon election results taken in isolation. Yet, because at-large voting systems often fail to provide an accurate view of the political process (among other things, they may create the appearance of minority preference), I believe that a court must proceed to the second step of the inquiry even when \"the unsuccessful first choice among minority voters did not receive a 'significant higher percentage' of the minority community's support.\"\n\nOf course, when the level of support received by the unsuccessful first-place finisher among minority voters is \"significantly higher\" than the support given the second- and third-place finishers by those same voters, the majority agrees that only a presumption is created against finding that the second- and third-place finishers are minority preferred. Id. at 21 (asserting that \"we held in Collins II (sic) only that successful candidates who receive more than 50% of the black vote should not automatically be viewed as a black-preferred candidate if they receive significantly less support from black voters than another, losing candidate, not that they should never be treated as blackpreferred\") (emphasis in original). I fail, however, to discern any reason for creating the presumption (and proceeding to the second step) only when an unsuccessful first-place finisher receives a significantly higher percentage of the minority vote, and neither the Act, nor Gingles, nor Collins II supports the majority's Conclusion to the contrary.\n\nFor much the same reason, the majority is also wrong to conclude that \"any candidate who receives a majority of the minority vote and who finishes behind a successful candidate who was the first choice among the minority voters is automatically to be deemed a blackpreferred candidate . . . .\" Ante at 22 (emphasis in original). Indeed, under the majority's theory even when a successful minority-preferred candidate garners significantly higher minority support than successful second- and third-place finishers (who receive over 50 percent of the minority vote), a district court must automatically treat the successful second-and third-place finishers as minority-preferred candidates. And, in fact, the majority goes so far as to conclude that even though a candidate fails to gain a majority of the minority vote, there is a presumption that the candidate is minority preferred provided that the candidate would have won a seat in an at-large election among black voters. Id. at 22 (stating that \"candidates who receive less than 50% of the minority vote, but who would have been elected had the election been held only among black voters, are presumed also to be minority-preferred candidates, although an individualized assessment should be made in order to confirm that such a candidate may appropriately be so considered\"). That has never been the law, nor should it be.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nThe only way that the majority can reach these Conclusions is todisregard our clear language in Collins II and other precedent throughout the circuits. These are decisions that hold that a successful candidate is not automatically minority preferred merely because that candidate receives more than 50% of the minority vote. And these are decisions that either hold or assume that a candidate who receives less than 50% of the minority vote cannot (by definition) be minority preferred. As we stated in Collins II:\n\nThe district court's error in finding successful candidates who received over 50% of the minority vote to be the chosen representatives of the minority community, despite the fact that other candidates received a much greater percentage of the minority vote, is not simply technical or semantic.\n\nA moment's reflection shows how the district court's method of identifying the black community's representatives of choice defeats a primary purpose of the Act. In 1974, 21 candidates sought the 4 open seats on the council. In 1980, 12 candidates vied for 3 open seats. In 1974, each voter--black and white--could cast four votes and in 1980 three votes. If black voters exercised their right to cast all of their allotted votes, they ran the risk that their second and third choices would be declared their preferred candidates. Only by single-shot voting--withholding all votes save for their first choice, and forfeiting the opportunity to cast all votes allotted to each voter--could the minority be assured that its second and third choices would not be declared its preferred candidates. In contrast, under the at-large system, the white voters can freely cast all votes allotted to them without suffering the penalty imposed on the minority voters. The district court's construction of the Act defeats the congressional purpose of assuring that the opportunity to participate in the electoral process is open to all citizens.\n\nWe are aware of no case that supports the district court's construction of the Act.\n\n883 F.2d at 1239-40 (emphasis added); see NAACP v. Niagara Falls, 65 F.3d 1002, 1019 (2d Cir. 1995) (\"a candidate cannot be 'minority preferred' if that candidate receives support from fewer than 50% of minority voters.\") (emphasis added); id. (\"even if a candidate receives 50% or more of the minority vote, a court need not treat the candidate as minority-preferred if another candidate receives significantly higher support\"); Jenkins, 4 F.3d at 1126 (\"it is important to look beyond whether a white candidate received a majority of the minority community's vote and determine whether that white candidate is truly the minority community's representative of choice\"); Campos v. City of Baytown, 840 F.2d 1240, 1245 (5th Cir. 1988) (rejecting the argument that \"any time a candidate gets a majority of the minority votes he is the 'chosen representative' of the minority group\"), cert. denied, 492 U.S. 905, 106 L. Ed. 2d 564, 109 S. Ct. 3213 (1989). See also Uno, 72 F.3d at 989 (\"Determining whether racial bloc voting exists is not merely an arithmetic exercise that consists of toting up columns of numbers, and nothing more. To the contrary, the district court should not confine itself to raw numbers, but must make a practical, commonsense assay of all the evidence.\") (citations omitted).\n\nThe effect of the majority's unprecedented decision will be to undermine the Voting Rights Act. After today, structural inequalities that may be at work in at-large voting systems will be masked by the structure itself, perpetuating those very inequalities that the Act is intended to remedy. The reason for this is simple. As I have explained, at-large voting systems may work to create the appearance of minority preference where none actually exists. Thus, to allow election results alone to dictate whether a candidate is minority preferred is to validate the structural inequalities which may be present in at-large voting systems based on the system itself. That is circular reasoning, I believe.\n\nWe are bound to follow Collins II. In sum, therefore, we should hold that a district court must always make an individualized determination of whether any second- or third-place finisher who receives a majority of the minority vote is actually minority preferred. When a minority-preferred candidate (whether successful or not) receives a significantly higher percentage of the minority vote, we must presume that the second- or third-place finisher who receives a majority of the minority vote is not minority preferred. When a minority-preferred candidate (whether successful or not) does not receive a significantly higher percentage of the minority vote, we must presume that the sec ond-or third-place finisher is minority preferred, provided that the second- or third-place finisher received a majority of the minority vote. And when any candidate receives less than a majority of the minority vote, that candidate can never be deemed minority preferred.\n\n2.\n\nI also believe that it is clear that when making an individualized determination of who is and who is not a minority-preferred candidate, a district court must examine the particular facts and circumstances surrounding each election and candidate in order to ascertain which, if any, candidate or candidates the minority community has sponsored. See Gingles, 478 U.S. at 57 n.25. In other words, the district court must look at the totality of the circumstances in each situation.\n\nThere is nothing unique about this approach, and depending on the facts, it may help or hurt plaintiffs' ability to prevail in a vote dilution case. See, e.g., Uno, 72 F.3d at 989 (criticizing district court for failing to take into account city's \"rapidly changing political environment\" which may have allowed the minority group to sponsor successful candidates); Jenkins, 4 F.3d at 1129 (\"In deciding which, if any, of the white candidates were minority preferred, the court must engage in a detailed, practical evaluation of the extent to which any particular white candidate was, as a realistic matter, the minority voters' representative of choice.\"); Collins II , 883 F.2d at 1238 (\"in addition to the bare statistics, it is appropriate to consider testimony revealing how political observers and the candidates themselves viewed the city's claim that [the candidates] were the minority's preferred candidates and representatives of choice\"); Smith, 687 F. Supp. at 1316-17 (emphasizing that \"considerable weight\" should be given to elections between black and white candidates, but still examining multiple factors to determine minority voters' representatives of choice).\n\nBecause we should examine the totality of the circumstances, a district court should not hesitate to look at any evidence that might be probative. Accordingly, I can not agree with the majority that primary election results do not bear on the question of who is and who is not a minority-preferred candidate. See ante at 23-26. Cf. Niagara Falls, 65 F.3d at 1019 (\"When a candidate receives support from 50% or more of minority voters in a general election, a court need not treat the candidate as minority-preferred when another candidate receiving greater support in the primary failed to reach the general election.\"); Sanchez, 875 F.2d at 1496 (examining totality of the circumstances, including \"testimony to the effect that no candidate could secure the Democratic slot in county races without the support of a group of Hispanics that included some of the plaintiffs\"). Moreover, I believe that while the race of the candidate is not dispositive, it too is a fact which in the totality of the circumstances the court may consider. See Jenkins, 4 F.3d at 1129. Again, \"whether the political processes are equally open depends upon a searching practical evaluation of the past and present reality, and on a functional view of the political process.\" S. Rep. No. 417, 97th Cong., 2d Sess. 30 (1982), reprinted in 1982 U.S.C.C.A.N. 177, 208; Gingles, 478 U.S. at 45 \u0026 79. A district court should not therefore refrain from examining election data from primaries in order to help determine who is and who is not a minority-preferred candidate. Nor should the district court ignore the fact that minority voters often support minority candidates.\n\nWhen, for example, a white candidate fails to gain a majority of the minority vote in the primary election (yet still wins nomination), the fact that such a candidate subsequently gains a majority of the minority vote in the general election is of minimal probative value. This is especially true when minority voters strongly support a losing minority candidate in the primary election process.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Simply put, while the majority may be correct to say that minority voters do not \"take their marbles and go home whenever the candidate whom they prefer most in the primary does not prevail,\" ante at 24, the requirements of the Voting Rights Act are not met if \"candidates favored by blacks can win, but only if the candidates are white.\" Smith, 687 F. Supp. at 1318.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\n3.\n\nAs a district court must examine the totality of the circumstances to determine who is and who is not a minority-preferred candidate, a district court must also examine whether \"special circumstances\" have resulted in a minority-preferred candidate winning a particular election or elections. Gingles, 478 U.S. at 51 \u0026 57. In such a case, a claim of vote dilution may still succeed because a pattern of racial bloc voting may still result in the defeat of minority-preferred candidates under normal election conditions. See id. at 57 (\"the success of a minority candidate in a particular election does not necessarily prove that the district did not experience polarized voting in that election; special circumstances, such as the absence of an opponent, incum bency, or the utilization of bullet voting, may explain minority electoral success in a polarized contest\") (footnote omitted).\n\nHere, for example, I believe that the district court erred when it counted as minority electoral success all three election victories of black candidate Jack O'Kelley. At the very least the district court should have discounted O'Kelley's first election victory in 1974. That election and the candidacy of O'Kelley were atypical for two reasons. First, O'Kelley was initially appointed (not elected) to fill a vacant slot on the Board of Commissioners. He thus ran as an incumbent even though he had never been elected. Second, and more importantly, the 1974 general election was both a special election for the seat to which O'Kelley had previously been appointed, and it was an at-large election for two other seats on the Commission. And, of course, O'Kelley ran in the special election, not the at-large election. Thus, I would hold that as a matter of law O'Kelley's incumbency, coupled with his appointment and the unique nature of his 1974 election, constitute special circumstances requiring that we discount this election victory.\n\nAs for O'Kelley's second and third elections in 1976 and 1980, it may or may not be appropriate to count these elections as instances where the minority was successful in electing its preferred candidate. Because of the odd nature of the 1974 election, O'Kelley was forced to run for reelection after only two years (not the normal four years). Accordingly, there is evidence that \"special circumstances\" exist that also might require us to discount O'Kelley's 1976 election. As for the 1980 election, the effects of O'Kelley's initial appointment, coupled with his incumbency, may still persist. And, as the Court in Gingles expressly recognizes, incumbency may constitute a special circumstance in certain situations. 478 U.S. at 57. Accordingly, because we hear this case on an appeal from summary judgment, I would hold that there are genuine issues of material fact as to whether O'Kelley's second and third election victories should be counted for purposes of Gingles ' third precondition. These fact issues should be resolved at trial, after the district court has examined the totality of the circumstances surrounding O'Kelley's second and third election victories.\n\nB.\n\nIn light of the proper methodology described above, I turn now to examine the election data that the plaintiffs have proffered. Of course, because there has been no trial, and thus no \"individual determinations\" of who is and who is not a minority-preferred candidate, the district court's grant of summary judgment should be reversed for this reason alone. In addition, even if we merely examine the election data, I believe it clear that the presumptions we recognized as appropriate in Collins II indicate that minority-preferred candidates have rarely been successful. I would therefore hold that there is a genuine issue of material fact as to whether minority-preferred candidates are usually defeated by white bloc voting and that the case should be remanded for trial.\n\nThe 1972 Election :\n\nIn 1972 Morris (a black candidate) received 98% of the black vote in the Democratic primary but was defeated nonetheless. Long (a white candidate) received 84% of the black vote and was nominated. No other candidate received a majority of the minority vote. Thus, assuming that 98% of the vote is not \"significantly higher\" than 84% of the vote, there is a presumption that we have two minority-preferred candidates--one of whom we know lost (Morris). Because neither party has proffered election data from the 1972 general election, it would appear that we cannot determine whether Long was successful or not in the general election. However, candidate Long also ran in the 1974 election. It is thus apparent that Long was not elected in 1972. Accordingly, we may presume that minority voters were not able to elect either of their preferred candidates in 1972.\n\nThe 1974 Election :\n\nThe parties have failed to provide the primary results from the 1974 Democratic primary, but Newlin (a white candidate) won the general election with 99% of the black vote, and Long lost with 99% of the black vote. I will therefore count Newlin as a successful minority-preferred candidate and Long as an unsuccessful minority candidate (though again the record is incomplete on this point). Also, as I have said, O'Kelley's election is not counted because he had recently been appointed to the Board of Commissioners, and he was running to fill a single vacant seat. Thus, as of 1974 there is a presumption that there had been four minority-preferred candidates, one candidate who was elected and three candidates who were not. The 1976 Election :\n\nIn 1976 only O'Kelley received the support of a majority of black voters in the Democratic primary election. Therefore, he is the only candidate that should be presumed minority preferred. But again, because O'Kelley did not serve a full term after his 1974 election, it may be inappropriate to count his success in the general election. Thus, as of 1976 there still had been only four minority-preferred candidates, only one of whom was elected.\n\nThe 1978 Election :\n\nIn the 1978 Democratic primary, Harris (a black candidate) received 78% of the black vote but was not nominated, and Newlin (a white candidate) received 60% of the black vote and was nominated. The majority does not disagree that Harris's support among minority voters was significantly higher than Newlin's support. See ante at 20-21. In addition, the district court reached the same Conclusion. We should therefore presume that there was only one minority-preferred candidate in 1978 (Harris). Because he was unsuccessful, as of 1978 there had been five minority-preferred candidates, one candidate who was elected and four candidates who were not.\n\nThe 1980 Election :\n\nIn the 1980 Democratic primary, O'Kelley received 99% of the black vote and was nominated, and Fleming (a white candidate) received 57% of the black vote but was not nominated. No other candidate received a majority of the minority vote in the primary. Thus, for purposes of summary judgment I would not count either O'Kelley or Fleming as minority preferred. The effects of O'Kelley's initial appointment (coupled with his incumbency) may still persist, though less so than in 1974 and 1976. And Fleming did not receive \"significantly\" close to the same amount of support as O'Kelley. Accordingly, as of 1980, there remained five minority-preferred candidates, one candidate who was elected and four candidates who were not.\n\nThe 1984 Election :\n\nIn the 1984 Democratic primary, Freeman (a black candidate) received 98% of the black vote and was nominated. Paris (a white candidate) received 50% of the black vote but was not nominated. Because Freeman's minority support was significantly higher than Paris's, I would presume that Paris was not a minority-preferred candidate. In the general election, Freeman lost. Therefore, as of 1984 there had been six minority-preferred candidates, one who was elected and five who were not.\n\nThe 1986 Election :\n\nThe parties have not provided primary results for 1986. In the general election, however, Bennett (a white candidate) won with 99% of the black vote. I will therefore count him as a successful minoritypreferred candidate. However, Morris (a black candidate) lost the general election, though he got 57% of the black vote. Although Morris is a minority and received a majority of the minority vote, I will nonetheless presume that he is not a minority-preferred candidate because Bennett received significantly higher support. Therefore, as of 1986 we should presume that there had been seven minoritypreferred candidates, two who were elected and five who were not.\n\nThe 1992 Election :\n\nIn the 1992 Democratic primary, Torain (a black candidate) received 74% of the black vote in the primary but was not nominated. No one other candidate received a majority of the black vote. I thus presume that Torain was the only minority-preferred candidate in 1992.\n\nIn total, therefore, we should presume that there have been eight minority-preferred candidates, two who were elected and six who were not. Accordingly, based only upon the election data proffered, I believe that the County is not entitled to summary judgment. See Gingles, 478 U.S. at 75 (\"the language of § 2 and its legislative history plainly demonstrate that proof that some minority candidates have been elected does not foreclose a § 2 claim\"). And, I reemphasize, this analysis only shows which candidate (whether black or white) the court should presume to be minority preferred. An individual determination as to each candidate should be made after trial to ensure that all minority-preferred candidates have been properly identified. * * * *\n\nIt is no doubt true that we may not (and should not) simply assume that \"'voters of a particular race, because of their race, \"think alike, share the same political interests, and will prefer the same candidates at the polls\".'\" Ante at 29 (quoting Miller v. Johnson, 132 L. Ed. 2d 762, 115 S. Ct. 2475, 2486 (1995) (quoting Shaw v. Reno, 509 U.S. 630, 647, 125 L. Ed. 2d 511, 113 S. Ct. 2816 (1993))). Some black voters may prefer white candidates, some white voters may prefer black candidates, and most voters (I would hope) may not care if their preferred candidate is black or white. Still, a particular voting system may work to prevent black voters from having the same opportunity to elect their chosen representatives as white voters, and such a system violates the law. See Shaw, 509 U.S. at 652 (recognizing that a vote dilution claim is \"analytically distinct\" from a claim that the state has used race as a basis for separating voters into districts). Accord Miller, 115 S. Ct. at 2485-86.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nHere, the plaintiffs have proffered sufficient evidence to defeat the County's motion for summary judgment because that evidence shows that a genuine question of fact exists as to whether the at-large method for electing commissioners in Alamance County deprives black voters of the same opportunity to elect representatives of choice as is enjoyed by white voters. The County may ultimately prevail on that question, but without a trial neither we, nor the County, nor the citizens of Alamance will know. Again, I respectfully Dissent.\n\n\u003cspan class=\"fn\"\u003e1. The census data of 1990 shows that Alamance County's population is 79.8% white, 19.2% black. Voting age population is 81.2% white, 18.0% black. As of April 1994, the population of registered voters was 84.1% white, 15.5% black. While 59% of all registered voters in the county are Democrats, blacks in Alamance County are overwhelmingly Democrats (94%). For this latter reason, when we refer to primary elections, we are referring only to the Democratic primaries.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The full statute provides as follows: (a) No voting qualification or prerequisite to voting or standard, practice, or procedure shall be imposed or applied by any State or political subdivision in a manner which results in a denial or abridgement of the right of any citizen of the United States to vote on account of race or color, or in contravention of the guarantees set forth in section 1973b(f)(2) of this title, as provided in subsection (b) of this section. (b) A violation of subsection (a) of this section is established if, based on the totality of circumstances, it is shown that the political processes leading to nomination or election in the State or political subdivision are not equally open to participation by members of a class of citizens protected by subsection (a) of this section in that its members have less opportunity than other members of the electorate to participate in the political process and to elect representatives of their choice. The extent to which members of a protected class have been elected to office in the State or political subdivision is one circumstance which may be considered: Provided, That nothing in this section establishes a right to have members of a protected class elected in numbers equal to their proportion in the population.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In the face of the County's intended challenge to the use of such statistical evidence, we again caution against overreliance on bivariate ecological regression analysis in the estimation of voter preferences for purposes of a vote dilution claim. See, e.g., Smith v. Brunswick County, Va., Bd. of Supervisors, 984 F.2d 1393, 1400 n.6 (4th Cir. 1993). Bivariate regression analysis, as used in Voting Rights Act cases, only allows one to determine the correlation between the percentage of the vote received by a particular candidate and the racial composition of voting precincts. See, e.g., Jenkins v. Red Clay Consol. School Dist. Bd. of Educ., 4 F.3d 1103, 1119 n.10 (3d Cir. 1993) (citing Richard L. Engstrom \u0026 Michael D. McDonald, Qualitative Evidence in Vote Dilution Litigation: Political Participation and Polarized Voting, 17 URB. LAW. 369, 374 (Summer 1985)), cert. denied , 114 S. Ct. 2779, 129 L. Ed. 2d 891 (1994); City of Carrollton Branch of the NAACP v. Stallings , 829 F.2d 1547, 1556 (11th Cir. 1987), cert. denied, 485 U.S. 936, 108 S. Ct. 1111, 99 L. Ed. 2d 272 (1988). The relevant correlation for vote dilution claims, however, is that between the race of the voters and the votes cast for a particular candidate, not that between the racial composition of precincts and the votes cast for a particular candidate, for it is only the former from which one can accurately estimate actual voter preferences. One can derive estimates of voter preferences from the regressions employed here only by assuming that the level of minority support for the candidate is fairly constant across precincts -- an \"ecological\" assumption that runs counter to the common sense observation that blacks and whites who live in integrated neighborhoods are more likely to vote for candidates of another race. See, e.g., Bernard Grofman et al., Minority Representation and the Quest for Voting Equality 89 (1992) (\"The principal disadvantage [of ecological regression is] the possibility of errors owing to ecological inference.\"); id. (\"The 'ecological fallacy' . . . is the error of attributing the average behavior of voters in a given geographic area (ecological unit) to all voters in that area.\"). In other words, the bivariate ecological regression analysis merely assumes that which it is the purpose of the analysis to prove -- political cohesiveness and constancy of candidate preference among minority voters and racial bloc voting among majority voters. See Overton v. City of Austin, 871 F.2d 529, 539 n.12 (5th Cir. 1989) (\"[Bivariate ecological regression analysis] assumes that the voters in most precincts voted according to their ethnicity.\"); id. at 539 (\"Trial court should not ignore the imperfections of the data used nor the limitations of[bivariate ecological regression] analysis\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. We do not imply that the third Gingles element is met if plaintiffs merely show that white bloc voting defeats the minority-preferred candidate more often than not. The terms used by the Gingles Court are \"usually,\" \"normally,\" and \"generally.\" 478 U.S. at 49, 51, 56. We need not in this case specify a meaning for these terms; suffice it to say that they mean something more than just 51%. See Clarke v. City of Cincinnati, 40 F.3d 807, 812-13 (6th Cir. 1994) (finding that 47% success rate was \"no reason to find that blacks' preferred black candidates have 'usually' been defeated.\"), cert. denied, 131 L. Ed. 2d 851, 115 S. Ct. 1960 (1995); Uno v. City of Holyoke, 72 F.3d 973, 985 (1st Cir. 1995) (\"To be legally significant, racially polarized voting in a specific community must be such that, over a period of years, whites vote sufficiently as a bloc to defeat minority [-preferred] candidates most of the time .\" (emphasis added)). Indeed, Justice O'Connor suggested in Gingles that a finding of \"usually defeated\" should be based on a success rate by minority-preferred candidates that is less than proportional representation, although greater than mere tokenism. 478 U.S. at 99-100 (O'Connor, J., Concurring in judgment) (\"[A] reviewing court should be required to find more than simply that the minority group does not usually attain an undiluted [that is, proportional] measure of electoral success. The court must find that even substantial [that is, less than proportional but more than token] minority success will be highly infrequent under the challenged plan before it may conclude, on this basis alone, that the plan operates 'to cancel out or minimize the voting strength of [the] racial group.'\" (quoting White v. Regester, 412 U.S. 755, 765, 37 L. Ed. 2d 314, 93 S. Ct. 2332 (1973))); see also Jenkins, 4 F.3d at 1122 (\"If minority-preferred candidates are consistently able to prevail in representative numbers. . . , then it cannot be said that white voters vote sufficiently as a bloc usually to prevent the election of the minority preferred candidates.\" (emphasis added)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Although Justice White, who joined the remainder of Justice Brennan's opinion, did not join this portion of the opinion, neither Justice White nor Justice O'Connor, who concurred only in the judgment, as much as hinted that only elections in which a black candidate was on the ballot need be considered; they each merely argued that Justice Brennan's Conclusion that the race of the candidate is always irrelevant was in conflict with Whitcomb v. Chavis , 403 U.S. 124, 29 L. Ed. 2d 363, 91 S. Ct. 1858 (1971), and was not necessary to the Disposition of the case. Id . at 82, 83 (White, J., Concurring); id. at 83, 101 (O'Connor, J., Concurring in the judgment, joined by Burger, C.J., and Powell and Rehnquist, JJ.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Although the First Circuit referred in this passage to \"minority candidates,\" not to \"minority-preferred candidates,\" it is evident from its citation to Gingles at p. 56 that the court meant by \"minority candidate\" the \"minority-preferred candidate.\" At that page in Gingles, the Supreme Court refers only to the \"minority's preferred candidates\" and the \"representatives of their choice.\" It does not once refer to minority candidates.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See also Smith v. Clinton, 687 F. Supp. 1310, 1316 (E.D. Ark. 1988) (three-Judge panel) (\"We assume without deciding that all of the evidence [of white-white elections] offered by the defendants is admissible and properly to be considered.\"); Brown v. Board of Commissioners of the City of Chattanooga, 722 F. Supp. 380, 391 (E.D. Tenn. 1989) (\"[A] review of white/white elections as well as white/black elections is necessary to determine the existence of racially polarized voting.\"); Southern Christian Leadership Conference of Alabama v. Evans, 785 F. Supp. 1469, 1473 (M.D. Ala. 1992) (\"Court will . . . consider political races generally -- white on black and white on white-- in seeking to determine the question of whether the political process is open to minority voters. The Court must keep in mind the mandate of the statute that Section 2 does not require that minorities be given equal opportunity to elect minority candidates, but that they be given equal opportunity to 'elect representatives of their choice.'\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. We do not decide here the extent to which, if any, white-white elections are deserving of less evidentiary weight than elections in which a minority candidate is on the ballot. It seems to us, however, that if whitewhite elections are entitled to less weight, then they are so only on the question of whether racial polarization exists, not on the question of whether, because of that polarization, minority-preferred candidates are usually defeated. Cf. Harvell, 71 F.3d at 1382 (distinguishing between \"racial cohesiveness,\" the second Gingles precondition, and \"racial polarization, . . . the essential element of the third Gingles precondition,\" and holding that in measuring whether racial polarization \"permits the majority usually to defeat the minority's preferred candidates,\" evidence such as \"elections in which there was no African-American candidate [on the ballot] . . . becomes relevant.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Three other white candidates received 9%, 8% and 5% of the black vote, respectively.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Our holding in Collins II actually does not address this circumstance directly, since Fleming received less than majority support among black voters; Collins II addressed only the circumstance where a candidate receives more than 50% of the minority community's vote. Nevertheless, we do not believe that the mere failure to achieve a threshold of 50% in a multi-candidate election necessarily means that a candidate cannot be viewed as a black-preferred candidate. If the election had been held only among black voters, a hypothetical inquiry given some credence by the Gingles plurality, see 478 U.S. at 68 (\"The essence of a submergence claim is that minority group members prefer certain candidates whom they could elect\" if the election were held in a majority-black district), then Fleming would have won, because he was the third-place finisher among black voters in an election in which three seats were to be filled.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The level of support that may properly be deemed \"substantial\" will vary, of course, depending on the number of candidates on the ballot and the number of seats to be filled.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Although only a four-Member plurality joined Section III(C) of the opinion, in which the rejection of defendant's multiple regression claim is found, Section III(C) is lengthy, and the dispute that cost Justice White's vote on the section was not over the \"cause\" issue. Although most of our sister circuits have by now adopted the position that an inquiry into cause is relevant, see, e.g., LULAC, 999 F.2d at 850 (\"[The] rigorous protections [of the Voting Rights Act], as the text of § 2 suggests, extend only to defeats experienced by voters 'on account of race or color.'\"), they are still in disagreement about the stage in the vote dilution inquiry in which causation evidence is appropriate, compare Nipper, 39 F.3d at 1515 (\"If the evidence shows, under the totality of the circumstances, that the community is not motivated by racial bias in its voting patterns, then a case of vote dilution has not been made.\") with Clarke, 40 F.3d at 812-14 (considering \"cause\" of the success rate of black-preferred candidates in assessing third Gingles element). We think the best reading of the several opinions in Gingles, however, is one that treats causation as irrelevant in the inquiry into the three Gingles preconditions, see Gingles, 478 U.S. at 62 (Brennan, J., plurality opinion), but relevant in the totality of circumstances inquiry, see 478 U.S. at 100 (O'Connor, J., Concurring in judgment) (agreeing that use of racial polarization data \"solely\" to prove Gingles second and third elements cannot be rebutted by \"evidence that the divergent racial voting patterns may be explained in part by causes other than race,\" but disagreeing with plurality's claim \"that such evidence can never affect the overall vote dilution inquiry.\"). Of course, whether causation is relevant to the second and third precondition inquiries or to the totality of circumstances inquiry, it would be just as relevant for determining whether particular minority-preferred candidates lose for some reason other than racial polarization, as it would be for determining, as plaintiffs urge, whether particular minority-preferred candidates win merely because of party affiliation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e* My good colleague suggests in Dissent that the Concurring opinion fails to follow the law -- \"even when it is a law that we might think unwise or unnecessary in today's world.\" Of course, the district court followed the law when it found that the Alamance County system conformed fully to section 2 of the Voting Rights Act and did not operate to deny black citizens an equal opportunity to elect candidates of their choice. In voting to reverse the district court, it is the Dissent, I respectfully suggest, that has failed to follow the law, because it has mandated a collection of intensely race-conscious inquiries destined to result by way of remedy in the proportional allocation of electoral districts based on race. To pursue this course in the wake of the Supreme Court's repeated cautions against race-conscious districting is simply not supportable.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Justice Brennan's opinion on this point failed to gain a majority of the Court, and it was joined by only Justices Marshall, Blackmun, and Stevens. Justice White, who otherwise joined Justice Brennan's opinion, rejected the notion that the race of the candidate is irrelevant. §§ Id. at 83 (White, J., Concurring). Justice O'Connor, in an opinion joined by Chief Justice Burger and Justices Powell and Rehnquist, agreed with Justice White that race of the candidate might affect the overall vote dilution inquiry. Id. at 101 (O'Connor, J., Concurring). Justice White and Justice O'Connor were concerned that ignoring the race of the candidate may cause the successful election of a black candidate not to be counted for purposes of identifying racial polarization. For instance, because black voters often support the Democratic party, there was concern that the election of a black Republican candidate would not be viewed as a minority success. See id., 478 U.S. at 83 (White, J., Concurring) (\"This is interest-group politics rather than a rule hedging against racial discrimination.\"); id. at 101 (O'Connor, J., Concurring) (agreeing with Justice White that \"Justice Brennan's Conclusion that the race of the candidate is always irrelevant in identifying racially polarized voting conflicts with Whitcomb [v. Chavis, 403 U.S. 124, 29 L. Ed. 2d 363, 91 S. Ct. 1858 (1971)] and is not necessary to the Disposition of this case.\"). Of course, the majority opinion in the present case turns the opinions of Justice Brennan, Justice White, and Justice O'Connor on their collective heads. That is, whereas the Supreme Court in Gingles was concerned with whether to count the election of a black Republican for purposes of identifying racial polarization, the majority holds that the plaintiffs' action cannot withstand summary judgment because we must consider whether to count the election of white Democrats for purposes of identifying racial polarization.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Also, I do not share the majority's uneasiness with the plaintiffs' reliance on bivariate regression analyses. See ante at 5 n.3. If the County wishes to challenge the plaintiffs' statistical evidence as flawed, then it should do so, and we should refrain from criticizing the statistical evidence in the absence of such a challenge. For instance, while it may (or may not) be true that \"blacks and whites who live in integrated neighborhoods are more likely to vote for candidates of another race,\" id., the County has put forth no evidence or argument on this appeal that the plaintiffs' election data is flawed because it treated minority preference as constant across precincts. Cf. Smith v. Clinton, 687 F. Supp. 1310, 1315 n.6 (E.D. Ark.) (three-Judge court) (noting that the defendants did not dispute the fact that a regression analysis is the \"standard method for inferring the behavior of population groups from data collected for political units\") (internal quotes omitted), aff'd mem., 488 U.S. 988 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The majority cites the decision in Brown v. Board of Commissioners, 722 F. Supp. 380, 391 (E.D. Tenn. 1989), for the proposition that \"a review of white/white elections as well as white/black elections is necessary to determine the existence of racially polarized voting.\" Ante at 13 n.7. What, however, the majority fails to say is that the district court made this remark in the context of \"this particular case.\" Brown, 722 F. Supp. at 391 (providing overview of elections in Chattanooga and stating that \"blacks have . . . found themselves having to support white candidates in an effort to achieve a measure of political influence\"). See also Sanchez, 875 F.2d at 1496 (affirming district court's decision to examine elections in which no minority was a candidate because the evidence showed that a candidate could not receive the nomination and support of the Democratic party without receiving minority support). Also, a court's leeway to examine elections in which no minority is a candidate does not mean that a court must examine such elections before a vote dilution claim can be established, and it certainly does not mean that a plaintiff must proffer such evidence in all cases (and on summary judgment). Cf. Jenkins, 4 F.3d at 1129 (\"district court may, in its discretion, decide to allow the defendants to introduce evidence on which, if any, white candidates were minority-preferred\") (emphasis added; footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. As I have noted, the County has not even argued that the plaintiffs must submit election data from white/white elections, nor has the County submitted any such data. In short, the County has not shown that the absence of data on white/white elections means that there is insufficient evidence to support the plaintiffs' vote dilution claim. Therefore, under basic summary judgment principles, I am at a loss as to how the majority can conclude that the County is entitled to summary judgment because the plaintiffs have not proffered election data from white/white elections.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The Court in Gingles did not discuss what level of deference an appellate court is to accord a district court's factual findings on summary judgment. The Court did, however, stress that because of the fact intensive nature of a vote dilution claim, a district court's factual findings made after trial are subject to the clearly erroneous standard of Rule 52(a). As the Court said: We reaffirm our view that the clearly-erroneous test of Rule 52(a) is the appropriate standard of appellate review of a finding of vote dilution. As both amended § 2 and its legislative history make clear, in evaluating a statutory claim of vote dilution through districting, the trial court is to consider the \"totality of the circumstances\" and to determine, based \"upon a searching practical evaluation of 'the past and present reality,'\" [S. Rep. No. 417, 97th Cong., 2d Sess. 30 (1982), reprinted in 1982 U.S.C.C.A.N. 177, 208 (footnote omitted)], whether the political process is equally open to minority voters. \"'This determination is peculiarly dependent upon the facts of each case,'\" Rodgers [v. Lodge, 458 U.S. 613, 621, 73 L. Ed. 2d 1012, 102 S. Ct. 3272 (1982)], quoting Nevett v. Sides, 571 F.2d 209, 224 (5th Cir. 1978), and requires \"an intensely local appraisal of the design and impact\" of the contested electoral mechanisms. 458 U.S. at 622. Gingles, 478 U.S. at 79 (emphasis added). In the absence of a trial, it is difficult to imagine how the district court can make \"a searching practical evaluation of 'the past and present reality'\" to determine who is and who is not a minority-preferred candidate. Without such an evaluation, there is no reason or basis for deferring to the district court's factual findings under the clearly erroneous standard.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In Collins II the minority plaintiffs challenged the at-large voting system used to elect the City Council in Norfolk, Virginia. We explained that \"'the essence of a § 2 claim is that a certain electoral law, practice, or structure interacts with social and historical conditions to cause an inequality in the opportunities enjoyed by black and white voters to elect their preferred candidates.'\" Id. at 1236 (quoting Gingles, 478 U.S. at 47). We then stated that \"the proper identification of minority voters' 'representatives of their choice' is critical.\" Id. at 1237. And, we recognized that the plaintiffs' primary complaint was not that minority voters were unable to elect their first choice to the city council, but rather that the at-large voting system prevented minority voters from electing a second preferred candidate as well. Id. at 1240 (\"In the context of this case it is necessary to apply Gingles ' teaching to the black community's attempt to elect a second black councilman.\"). For this reason alone, the majority is wrong to say that Collins II left open the question of how to treat second- and third-place finishers when the minority's first choice is successful. See ante at 22. Because minority voters in Norfolk were able to elect one candidate, Collins II clearly addresses the situation where there is a successful minority-preferred candidate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The flaw in the majority's approach is illustrated by the following hypothetical. An at-large election for four slots is held. There are eight candidates. Candidate number 1 wins with 99 percent of the minority vote; candidate number 2 loses with 95 percent of the minority vote; candidate number 3 wins with 51 percent of the minority vote; candidate number 4 wins with 20 percent of the minority vote; candidate number 5 loses with 15 percent of the minority vote; candidate number 6 loses with 10 percent of the minority vote; candidate number 7 loses with 5 percent of the minority vote; and candidate number 8 wins with 3 percent of the minority vote. According to the majority, we must automatically treat candidate number 3 as minority preferred even though that candidate received far less support than candidate number 1 or candidate number 2. Also, according to the majority, there is a presumption that candidate number 4 is minority preferred even though that candidate received the support of only one in five minority voters. That cannot be right. It also directly conflicts with our holding in Collins II, because as I have previously noted, see supra at 49 n.7, in Collins II (as in the above hypothetical), the minority was successful in electing its first candidate of choice. See 883 F.2d at 1240.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Obviously, while we should treat the defeat of a minority-preferred candidate in a primary as a defeat for purposes of determining whether Gingles ' third precondition has been met, we should not treat the success of a minority-preferred candidate in receiving his or her party's nomination as a success for purposes of the same inquiry. Only if a minority-preferred candidate is actually elected has the minority succeeded in the electoral process. Winning the primary is all to the good, but without winning the general election, white majority bloc voting may have still succeeded in defeating the minority-preferred candidate or candidates.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In Jenkins the Third Circuit outlined the following non-exhaustive list of factors that a court should examine when deciding whether a white candidate may properly be considered minority preferred: One relevant consideration is the extent to which the minority community can be said to have sponsored the candidate. In determining whether the minority community sponsored the candidate, the court should look to the level of minority involvement in initially advancing the particular candidate and in conducting or financing that candidate's campaign. Additionally, the attention which the candidate gave to the particular needs and interests of the minority community, including the extent to which the candidate campaigned in predominately minority areas or addressed predominately minority crowds and interests, may be relevant factors. Another relevant consideration would be the rates at which black voters turned out when a minority candidate sought office as compared to elections involving only white candidates. Finally, bearing in mind the disincentives that may exist for minority candidates to seek office, the extent to which minority candidates have run for office and the ease or difficulty with which a minority candidate can qualify to run for office may be relevant considerations. 4 F.3d at 1129 (citations omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Evidently, however, under the views expressed in the Concurring opinion such a system would not violate the law. Of course, to reach that Conclusion we would have to read the Voting Rights Act out of existence, something I do not believe that the Supreme Court has done in Bush v. Vera, 135 L. Ed. 2d 248, 116 S. Ct. 1941 (1996), Shaw, supra, or Miller, supra. Indeed, I know of nothing unconstitutional about Congress forbidding electoral schemes that \"are not equally open\" and that operate to provide minority members with \"less opportunity than other members of the electorate to participate in the political process and to elect representatives of their choice.\" 42 U.S.C. § 1973(b). Likewise, there is nothing unconstitutional about requiring the trial court \"to consider the totality of the circumstances and to determine, based upon a searching practical evaluation of the past and present reality, whether the political process is equally open to minority voters.\" Gingles, 478 U.S. at 79 (citation and internal quotes omitted). While we, as the appellate court, might therefore be faced with hard questions on review (though I doubt that they are \"impenetrable\" ones), we must nonetheless decide whether the trial court has correctly followed the law -- even when it is a law that we might think unwise or unnecessary in today's world. And I must respectfully differ with my Concurring colleague if he regards that as an \"intensely race-conscious approach.\" See ante at 32.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. When questioned at his deposition, the plaintiffs' expert fell into somewhat the same trap as the majority and the district court, acknowledging minority-preferred candidates based on election data taken in isolation.\u003c/span\u003e\n\n",
    "body_length": 143122,
    "citedas": [
      "99 F.3d 600"
    ],
    "attorneys": "ARGUED: Donnell Van Noppen, III, PATTERSON, HARKAVY \u0026 LAWRENCE, Raleigh, North Carolina, for Appellants. J. Michael Crowell, THARRINGTON, SMITH, Raleigh, North Carolina, for Appellees. ON BRIEF: E. Hardy Lewis, THARRINGTON, SMITH, Raleigh, North Carolina; S. C. Kitchen, Alamance County Attorney, Graham, North Carolina, for Appellees.",
    "category": [
      "128",
      "75"
    ],
    "judges": "Before Wilkinson, Chief Judge, and Luttig and Michael, Circuit Judges. Judge Luttig wrote the majority opinion, in which Chief Judge Wilkinson joined. Chief Judge Wilkinson wrote a Concurring opinion. Judge Michael wrote a Dissenting opinion.",
    "citation_count": 27
  }
}
