{
  "id": "C7hwTmYBTlTomsSB-8C9",
  "document": {
    "title": "State v. Martini",
    "full_title": "STATE OF NEW JERSEY v. JOHN MARTINI, SR. .",
    "jurisdiction": "Supreme Court of New Jersey",
    "date": "1994-12-21T00:00:00.000Z",
    "docket": "No. A-16",
    "body": "The opinion of the court was delivered by CLIFFORD, J.\n\nDefendant, John Martini, kidnapped Irving Flax, a Fair Lawn businessman, and held him for $25,000 ransom. After receiving the ransom money, defendant killed Flax by shooting him three times in the back of the head at extremely close range. A jury convicted defendant of purposeful or knowing murder by his own conduct, felony murder, kidnapping, and two weapons offenses. After the penalty-phase proceedings the trial court sentenced defendant to death for the purposeful or knowing murder and to a life term with a thirty-year parole bar for the felony murder, and merged those sentences. Defendant also received a consecutive life term with a twenty-five-year period of parole ineligibility for the kidnapping, and two concurrent four-year terms for the weapons offenses. This Court affirmed defendant's convictions, except for possession of a handgun without a permit, and his sentences, expect for that imposed for kidnapping. State v. Martini, 131 N.J. 176 (1993). We granted defendant's request for proportionality review of his death sentence, see N.J.S.A. 2C:11-3e, and now find no disproportionality.\n\nI\n\nFACTS\n\nThe facts are set forth in detail in Martini, supra, 131 N.J. at 191-207. We repeat here only those facts that are relevant to our proportionality review.\n\nIn November 1988, Martini returned to New Jersey from Arizona. His girlfriend, Therese Afdahl, for whom defendant had left his wife of thirty-nine years, accompanied him. Using a credit card borrowed from a friend, defendant rented an apartment in Fairview under the friend's name. Lacking money, defendant sought from another friend, John Doorhy, advice on a quick method of replenishing his dwindling supply of funds. Doorhy, having recently worked at Flax's home and having noticed large amounts of cash and several bankbooks in the house, suggested that Martini kidnap Flax, and acquainted defendant with the Flax family's morning schedule. In exchange for driving Martini to Flax's house and giving him written directions that defendant would later use to return there, Doorhy accepted defendant's promise of a percentage of the money that defendant anticipated receiving from the kidnapping.\n\nIn preparation for the kidnapping, defendant retrieved from Doorhy's house a revolver that Doorhy had been holding for him, and purchased another revolver in Jersey City. On January 23, 1989, Martini and Afdahl drove to Flax's house. When Flax came out of the house, defendant alighted from his car and called Flax by a nickname that he knew Flax had formerly used, having been acquainted with him some thirty years previously. Flax asked whether defendant had been in the Army. Defendant lied, saying \"yes,\" and suggested that they go in Flax's car to a diner for a cup of coffee.\n\nFlax agreed. After the two men entered the car, Martini pulled out his recently-purchased revolver, told Flax that he was being kidnapped, and directed him to drive to a Garden State Plaza parking lot in Paramus. Afdahl followed them. After both cars had reached the lot, defendant ordered Flax into defendant's car and drove to the Fairview apartment.\n\nMartini made Flax place a call to his wife, then bound Flax and told Mrs. Flax that if she wanted to see her husband alive, she would have to give defendant $100,000. Defendant also threatened to kill both her husband and her if she notified the police. Defendant called again at 1 p.m. to see if Mrs. Flax had raised the ransom money. When she said that she could not obtain that much cash, Martini he said that he would call back at 6 p.m. to see if she could raise $25,000. Throughout the call defendant repeatedly threatened to kill both the Flaxes.\n\nDuring the afternoon, the police placed taps on Mrs. Flax's telephone. After Mrs. Flax withdrew the $25,000, F.B.I. agents recorded the serial numbers of the bills. At 5:30 p.m., defendant called again, arranged the delivery of the ransom money, and again threatened that someone would come to kill the Flaxes if defendant were arrested. The F.B.I. recorded the conversation. Shortly thereafter, Mrs. Flax received a call from her hysterical husband, begging her to give defendant the money.\n\nAs arranged, Mrs. Flax dropped off the money and Martini picked it up. F.B.I. agents followed him, but defendant, fearful of being followed, drove into the Bronx, managing to lose the agents during the course of an hour's drive in traffic. He returned to the Fairview apartment and retrieved Afdahl and the victim, whom defendant ordered to drive to the Garden State Plaza parking lot, where defendant's car was parked. When they arrived, defendant shot Flax three times in the back of the head, because, defendant claimed, Flax had opened the driver's door and placed his foot on the ground, and defendant feared that Flax would escape.\n\nLeaving Flax's body in the car, Martini drove his own car onto the Staten Island Ferry, from which he threw both his gun and his victim's car keys into the New York Harbor. He then drove to the Bronx with Afdahl, disposed of the car, and arranged for a ride back to Fairview from the friend whose credit card he had been using.\n\nThe next day, January 24, 1989, a security guard discovered Flax's body in his car at the Garden State Plaza parking lot. That afternoon, an acquaintance of Martini identified the male voice on the taped telephone conversation as Martini's.\n\nAlerted by a flyer that defendant and Afdahl were wanted in connection with a double homicide in Arizona, police in Fort Lee saw the two leave a motel and, carrying a black bag, walk to a telephone booth at a gas station, where defendant placed a call. When a taxi arrived, defendant and Afdahl entered it, whereupon police arrested them. A search of the bag revealed $23,760 bearing serial numbers that the F.B.I. had recorded, the borrowed credit card that defendant had been using, the second revolver, and a key for the motel that they had just left. Police did not observe in defendant any signs of drug-related intoxication.\n\nAfter being arrested, receiving Miranda warnings, and being allowed to consult with Afdahl, whom he advised to cooperate with the authorities as he intended to do, defendant gave the police written and oral statements and his consent to search his motel rooms and his rented apartment.\n\nAt trial, the State's forensic expert testified that the pattern of blood spattering and other physical evidence indicated that Flax had been shot at a range so close that the victim could not have opened the door and placed his foot on the ground as defendant had claimed. A physician with whom Martini had consulted on December 12, 1988, testified that he had observed no evidence of cocaine use. Mrs. Flax testified without objection to the telephone conversations with both her husband and defendant. Finally, a police officer who had taken statements from defendant read them into the record.\n\nDefendant presented evidence of his cocaine habit, which, in addition to his ten-year affair with Afdahl, a former prostitute, had broken up his marriage, and, defendant claimed, had diminished his capacity to commit his crimes purposefully or knowingly. His defense expert testified that Martini was \"unquestionably\" under the influence of cocaine, but the witness could not give an opinion within a reasonable degree of medical probability whether defendant had acted purposefully or knowingly during the shooting. The State's rebuttal expert testified that defendant had, within a reasonable degree of medical probability, acted purposefully or knowingly during the shooting.\n\nThe jury found defendant guilty on all counts. At the penalty trial for the purposeful or knowing murder, the State sought to prove two aggravating factors: c(4)(f) (murder to escape detection), and c(4)(g) (murder during the course of a kidnapping). Defendant offered five mitigating factors: c(5)(a) (extreme mental or emotional disturbance insufficient to constitute a defense to prosecution), c(5)(c) (age of defendant), c(5)(d) (diminished capacity due to mental disease or defect, or intoxication), c(5)(g) (furnishing substantial assistance to the State in prosecuting another person for murder), and c(5)(h) (the catchall factor). The trial court granted the State's motion to strike mitigating factor c(5)(g). Martini offered evidence of his drug abuse and its effects on his personality, and the State offered rebuttal evidence concerning defendant's character.\n\nThe jury found both aggravating factors beyond a reasonable doubt. No juror found mitigating factors c(5)(a) (extreme mental or emotional disturbance) or c(5)(d) (diminished capacity). Six jurors found mitigating factor c(5)(c) (defendant's age), and six found c(5)(h) (the catchall factor). The jury unanimously found that the aggravating factors, whether considered together or individually, outweighed the mitigating factors.\n\nFrom the judgments of conviction and sentences of death for the murder and prison terms for the other offenses, defendant appealed directly to this Court, R. 2:2-1(a)(3). We affirmed defendant's conviction for murder and the sentence of death, but reversed the conviction for possession of a handgun without a permit for failure to prove an essential element of the offense. 131 N.J. at 191, 320. We further vacated defendant's kidnapping sentence because it violated the statutory term, and remanded for resentencing on that count. Id. at 321.\n\nII\n\nPROPORTIONALITY REVIEW\n\nThe purpose of proportionality review is to determine whether a specific defendant's death sentence is disproportionate. See N.J.S.A. 2C:11-3e. A capital sentence is excessive and thus disproportionate if other defendants with characteristics similar to those of the defendant under review generally receive sentences other than death for committing factually-similar crimes in the same jurisdiction. State v. Bey, 137 N.J. 334, 343 (1994) (Bey IV); State v. Marshall, 130 N.J. 109, 131 (1992) (Marshall II). We have declined to set a numerical standard to determine at what point defendants \"generally\" receive sentences of death, Marshall II, supra, 130 N.J. at 152-53, because such a standard would introduce unacceptable arbitrariness into proportionality review.\n\nProportionality review is a procedural, or \"offender-oriented,\" safeguard -- that is, it focuses on the defendant, not on the crime committed. Marshall II, supra, 130 N.J. at 126-27. In focusing on the offender and not the offense, that form of review presumes that death is proportional to the crime, Pulley v. Harris, 465 U.S. 37, 43, 104 S. Ct. 871, 876, 79 L. Ed. 2d 29, 36 (1984), and is therefore different from the traditional Eighth Amendment substantive review. In contrast, substantive review considers the offense, not the offender, to determine whether the punishment is excessive for the crime itself. Coker v. Georgia, 433 U.S. 584, 592, 97 S. Ct. 2861, 2866, 53 L. Ed. 2d 982, 989 (1977). For a sentence to be facially constitutional, the magnitude of the punishment must measurably serve the acceptable goals of punishment and may not be \"grossly out of proportion\" to the degree of harm. Gregg v. Georgia, 428 U.S. 153, 173, 96 S. Ct. 2909, 2925, 49 L. Ed. 2d 859, 875 (1976) (finding that death sentence does not per se violate Eighth Amendment); accord Coker, supra, 433 U.S. at 592, 97 S. Ct. at 2866, 53 L. Ed. 2d at 989 (concluding that death sentence is grossly disproportional and excessive for crime of rape); Marshall II, supra, 130 N.J. at 129 (tracing U.S. Supreme Court's development of substantive review); see Enmund v. Florida, 458 U.S. 782, 797, 801, 102 S. Ct. 3368, 3376, 3378-79, 73 L. Ed. 2d 1140, 1151, 1154 (1982) (finding that Eighth Amendment prohibits capital sentence for defendant who aids and abets felony in course of which murder is committed by others but who does not himself kill, attempt to kill, or intend that killing or use of lethal force take place).\n\nProportionality review is a response to Furman v. Georgia, 408 U.S. 238, 92 S. Ct. 2726, 33 L. Ed. 2d 346 (1972), which reversed three death sentences, one for murder and two for rape. In Marshall II, supra, this Court cited Justice Stewart's Concurring opinion to state that the decision whether to sentence a defendant capitally, if left to the unfettered discretion of a jury, violates the Eighth Amendment because the sentence can be \"'wantonly and * * * freakishly imposed.'\" 130 N.J. at 125 (quoting Furman, supra, 408 U.S. at 310, 92 S. Ct. at 2762-63, 33 L. Ed. 2d at 390 (Stewart, J. Concurring)). Proportionality review, which allows this Court to monitor the results of jury discretion, is neither required by the Eighth Amendment nor the only way through which to make a capital-sentencing scheme constitutional. See Pulley, supra, 465 U.S. at 44-46, 104 S. Ct. at 876-77, 79 L. Ed. 2d at 36-37. However, it permits New Jersey's capital-sentencing scheme to comply with the dictates of Furman and with the Eighth Amendment, which prohibit arbitrary and inconsistent application of the death penalty. See id. at 44, 104 .S. Ct. at 876, 70 L. Ed. 2d at 36.\n\nThe goals of that kind of review are to ensure that a substantial distinction exists between capitally-sentenced and life-sentenced defendants; to limit capital sentencing to those cases that are most aggravated and in which death sentencing is the expected result; and to promote a rational, consistent, and fair application of the death sentence. Marshall II, supra, 130 N.J. at 131; David C. Baldus, Death Penalty Proportionality Review Project Final Report to the New Jersey Supreme Court 24-25 (Sept. 24, 1991) (hereinafter Final Report). The burden is on the defendant to show disproportionality by establishing that similar defendants who commit factually-similar crimes generally receive sentences other than death. Bey IV, supra, 137 N.J. at 343, 349. We impose that burden on the defendant, not on the State, because the statute, N.J.S.A. 2C:11-3(e), speaks in terms of proving disproportionality, not proportionality. Id. at 349.\n\nWe believe that the Dissent reveals a fundamental misperception of the role of proportionality review. That review is not a \"system of death-sentence validation,\" post at (slip op. at 1), but is instead a vehicle to ensure that the penalty-phase jury's decision is not insupportable. That purpose stems from the mandate of the statutory language itself: \"the Supreme Court * * * shall determine whether the sentence is disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\" N.J.S.A. 2C:11-3e. Thus, our search is not for proportionality, but rather one in which our goal is to determine whether the jury's decision to sentence a defendant to death is comparable to decisions reached in the appropriate capital cases in our universe of cases. The question is whether other defendants with similar characteristics generally receive sentences other than death. Marshall II, supra, 130 N.J. at 153.\n\nThe Dissent finds \"a palpable bias in favor of the proportionality of a death sentence.\" Ibid. That bias, if present, does not stem from what our colleague describes as a \"selective and convenient rationalization.\" Rather, our imposing on the defendant the burden of showing disproportionality stems from the statutory language itself, discussed above. It is settled law. We held as much in Bey IV, supra, 137 N.J. at 343, 349. The Dissent unearths nothing new or \"treacherous,\" post at (slip op. at 5), here. On the contrary, it simply attempts to rewrite established proportionality jurisprudence. Therefore, the statement that the \"Court is determined to put the burden of proof on the defendant,\" post at (slip op. at 24), although accurate, is hardly a damning accusation.\n\nLikewise, the Dissent's claims concerning first-impression murders are incorrect statements of the law. Being the first murderer in a given category of intentional homicide does not \"apparently guarantee[] the proportionality of the sentence.\" Post at (slip op. at 25). Instead, that status requires only that we weigh our comparison of such a defendant with other capital murderers in light of the differences in the respective categories. That approach guarantees sensitivity of process, not certainty of result.\n\nA. The Universe of Cases\n\nThe first step in proportionality review is to determine the universe of cases to which we compare a defendant's case. In 1992, the Legislature amended N.J.S.A. 2C:11-3e to limit the comparison group to only those cases in which a death sentence has actually been imposed. L. 1992, c. 5, ยง 1. However, the Legislature did not state whether it intended the amendment to apply to pending appeals. Bey IV, supra, 137 N.J. at 343-44. In Marshall II and Bey IV, we declined to apply the amendment to those appeals for the reason, among others, that those defendants' appeals were pending before the Legislature enacted the amendment. The same situation pertains here: Martini was sentenced to death on December 12, 1990, and his appeal was pending before the effective date of the amendment. We therefore will not apply N.J.S.A. 2C:11-3e as amended to defendant's proportionality review.\n\nThe Administrative Office of the Courts (AOC) is responsible for maintaining the data base of homicide cases used by this Court for proportionality review. It has developed its statistics based on the procedure created by Professor David Baldus, the Special Master appointed by this Court to create a model for proportionality review, and on the modifications thereto that this Court outlined in Marshall II. The universe of cases that we employ in this case is compiled in the Martini Report prepared by the AOC. That report includes cases collected from 1983 to June 25, 1993. It contains 298 death-eligible cases, 125 of which went to penalty trial, a rate of forty-two percent. Martini Report tbl. 3. Of the 125 death-eligible cases, thirty-eight resulted in a death sentence, a rate of thirty percent. Martini Report tbl. 2. The overall death-sentencing rate is thirteen percent (38/298). Martini Report tbl. 1.\n\nB. Method of Classifying Cases\n\nAfter establishing the universe of comparison cases, we must sort those cases in a data base. As in Marshall II and Bey IV, we use two approaches: an a priori determination and an empirical method. The a priori procedure requires us to analyze cases according to features that experience has shown influenced the decision whether to sentence capitally. Bey IV, supra , 137 N.J. at 345; Marshall II, supra, 130 N.J. at 141-42. In the empirical process we assemble life-sentenced and death-sentenced cases to identify the characteristics that determine the patterns of life sentencing versus capital sentencing. Marshall II, supra, 130 N.J. at 142-44. That approach reveals which factors prosecutors and juries consider determinative. Bey IV, supra, 137 N.J. at 345.\n\nAny attempt to define in advance all characteristics of a murder that \"capture the critical facts of [a] defendant's case,\" as the Dissent urges us to do, post at (slip op. at 16), would fail to distinguish between individual defendants. Because each capital case is unique, defining all the important facts that a murder might include is impossible. However, that circumstance hardly amounts to a fatal flaw. Instead of turning disproportionality review into \"a selective and convenient rationalization for proportionality,\" post at (slip op. at 15), dealing with each case on its own merits in a manner sensitive to its unique set of facts is the only way to give capital defendants the full review to which they are entitled, given the finality of the death sentence.\n\nDefendant makes a number of \"alternative assumptions\" that he seeks to persuade this Court to adopt in our review of his sentence. First, he argues that three cases, State v. Ramseur, 106 N.J. 123 (1987), State v. Lodato, 107 N.J. 141 (1987), and State v. Hunt, 115 N.J. 330 (1989), should be coded as life-sentenced cases because of errors at trial. Second, defendant would have us exclude nine other cases from the death-sentenced pool for \"deliberative errors.\" Those cases are State v. Biegenwald, 106 N.J. 13 (1987); State v. Kise (unreported); State v. Koedatich, 112 N.J. 225 (1988); State v. Zola, 112 N.J. 384 (1988); State v. Gerald, 113 N.J. 40 (1988); State v. Williams, 113 N.J. 393 (1988); State v. Coyle, 119 N.J. 194 (1990); State v. Johnson, 120 N.J. 263 (1990); and State v. Oglesby, 122 N.J. 522 (1991). Third, he excludes his own case from the pool of comparable cases.\n\nIn Bey IV we rejected defendant Bey's argument that Ramseur-, Biegenwald, and Coyle should be treated as life-sentenced cases. Those cases, involving death sentences that were reversed, either were not pursued after reversal as penalty-trial cases or resulted in life sentences. Bey argued that those cases therefore could not be considered reliable indicators of deathworthiness. Bey IV, supra, 137 N.J. at 345-46. The AOC coded those as death-sentenced cases, and we concluded that they reflected juror evaluations of deathworthiness. Id. at 347. We observed in Marshall, supra, 130 N.J. at 194 n.10, that penalty trials that result in death are most often reversed for burden-of-proof and Gerald issues. (A Gerald error is one in which a capital sentence followed a conviction for purposely or knowingly causing serious bodily injury that results in death, instead of for purposely or knowingly causing death. See Gerald, supra, 113 N.J. at 69.) Burden-of-proof and Gerald errors, which affect the procedural fairness of the trial, not the substance of the crime, \"do not necessarily bear on the jury's determination of deathworthiness.\" Bey IV, supra, 137 N.J. at 347; accord Marshall II, 130 N.J. at 169 n.5, 194 n.10. In our proportionality review of Bey's sentence we therefore continued to include Ramseur, Biegenwald, and Coyle, in the category of death-sentenced cases. We do so here as well.\n\nThe Dissent repeats its criticism of the Court for not accepting the Dissent's proposition that reversed death sentences may not be used in proportionality review as death-sentenced cases. That criticism is based on the notion that \"the only objective indicator that can establish 'deathworthiness' is the imposition of a death sentence.\" Post at (slip op. at 6). For support, the Dissent cites examples of cases involving improper jury instructions that required reversal of the death sentence. Post at (slip op. at 7-8). That leads our Dissenting colleague to insist again that the Court adopt a \"rebuttable presumption that reversed death sentences are invalid determinations of deathworthiness.\" Post at (slip op. at 10). As we stated in Marshall II, supra, 130 N.J. at 169 n.5, Bey IV, supra, 137 N.J. at 347, and again today, errors that do not affect the substance of the crime, as opposed to procedural fairness, do not necessarily affect a jury's determination of deathworthiness.\n\nWe similarly reject defendant's \"deliberative error\" argument. Martini claims that errors such as (1) the failure to instruct a jury that it must find beyond a reasonable doubt that the aggravating factors outweigh the mitigating factors before it can impose a death sentence, (2) an improper charge on aggravating factor c(4)(c) (torture), or (3) a charge that a jury must unanimously find a mitigating factor before it can weigh that factor so undermine the reliability of the capital sentence that when a life sentence is given on retrial, those cases may not be coded as death sentenced. Defendant argues that we have never squarely considered cases involving the \"fundamental fairness\" of such overturned death sentences. We continue to believe that the death sentences in cases overturned for procedural error are acceptably-reliable societal determinations of deathworthiness.\n\nWe also note, as we did in Bey IV, supra, that the State's decision not to reprosecute a defendant capitally is not necessarily a reflection of that defendant's lack of deathworthiness. The State's decision may be based on unrelated issues such as the availability of witnesses or the amount of financial resources that the State is willing to commit to retrial. Accordingly, we reject defendant's \"fundamental fairness\" argument and continue to code Kise, Koedatich, Zola, Gerald, Williams, Johnson, and Oglesby, as death-sentenced cases. As in Bey IV, supra, we acknowledge that our data are not scientifically infallible, 137 N.J. at 348, because all coding decisions contain some degree of subjectivity. Marshall II, supra, 130 N.J. at 120 (\"We recognize that a value judgment is built into every practical measurement.\"). However, we remain convinced that \"even reversed death sentences are sufficiently valid indicators\" of \"the conscience of the community\" to be used as death-sentenced cases. Bey IV, supra, 137 N.J. at 348.\n\nFinally, we reject defendant's assumption that he will not be included in the universe of cases comparable to his own. As we did in Bey IV, we will evaluate the data both including and excluding Martini. We acknowledge that including a defendant in his or her own proportionality review will increase the rate of death sentencing to an extent that is inversely proportional to the number of cases that are used in the analysis. However, proportionality review is a search for community values, and the case under review is a partial reflection of the those values that we seek to discover. Using two sets of data, one including defendant's case and one excluding it, will give us the broadest picture of societal standards while alerting us to the bias produced by including defendant's case.\n\nIII\n\nCOMPARISON OF CASES\n\nHaving established, first, the universe of cases on which we shall rely, specifically, those contained in the Martini Report, and, second, the criteria for coding those cases as either death sentenced or life sentenced, we must next group those cases according to their comparative levels of blameworthiness. Bey IV supra, 137 N.J. at 350. In Marshall II and in Bey IV we determined blameworthiness by considering statutory aggravating and mitigating factors as well as \"nonstatutory factors based on 'objectively verified measures of blameworthiness.'\" Ibid. (quoting Marshall II, supra, 130 N.J. at 145).\n\nWe evaluate those factors through two approaches: frequency analysis and precedent-seeking review. Our purpose in that evaluation, stated above, is to determine whether defendant's sentence is disproportionate in comparison to similar cases. Marshall II, supra, 130 N.J. at 148. As we declared in Bey IV, supra, \"Proportionality review seeks to determine only whether a particular death sentence is aberrational, not whether it compares perfectly with other sentences.\" 137 N.J. at 352.\n\nThe frequency analysis allows us to determine the rate of imposition of death sentences in similar cases. It is designed to reveal how jurors and prosecutors treat similar cases. In precedent-seeking review we compare the defendant's case to factually-similar cases to determine whether the defendant is deathworthy in light of similarly-situated defendants. We then compare the results of the two analyses to ensure that our proportionality review is reliable. However, the size of the sample pools used in the frequency approach remains small. Therefore, because frequency-analysis results are not entirely reliable statistically, we rely more heavily on the results of the precedent-seeking review. See Bey IV, supra, 137 N.J. at 351.\n\nThe Dissent objects to the Court's use of a relatively-small number of cases in our search for disproportionality. In our Dissenting colleague's view, the uniqueness of a case under review makes \"the project of frequency review * * * a sham.\" Post at (slip op. at 22). We recognize the small sample size and the fact that defendant's case is unique in our universe of capital cases. As we have noted, those considerations preclude us from giving great weight to frequency analyses derived under those conditions. In contrast to the Dissent, however, we do not see that frequency review, the model agreed on by the offices of both the Attorney General and the Public Defender, and approved of by both the Administrative Office of the Courts and this Court, \"falters.\" Post at (slip op. at 22). Instead, we use the cases most similar or analogous as guides, discounting the guidance they provide by their degree of dissimilarity. Our reliance on frequency analysis will increase as our universe of cases grows. In the meantime, we will use frequency analysis as a tool in our review. The absence of more complete data necessarily forces us to place greater emphasis on precedent-seeking review.\n\nThe Dissent's Discussion of defendant's low predicted frequencies, post at (slip op. at 16-19), overlooks their function and purpose. They are predictors only. They provide not answers but only guidance. A low predicted value, therefore, does not mean that we must automatically overturn a death sentence as disproportionate. Instead, it shows a danger of the presence of disproportionality, requiring us to scrutinize more carefully the other elements of review. See Marshall II, supra, 130 N.J. at 159.\n\nA. The Frequency Approach\n\nIn Marshall II and Bey IV, we separated the frequency analysis into three parts: the salient-factors test, the numerical-preponderance-of-aggravating-and-mitigating-factors test, and the index-of-outcomes test. Bey IV, supra, 137 N.J. at 350-51, Marshall II, supra, 130 N.J. at 154. Each is a different statistical method of gauging a defendant's relative criminal culpability. Bey IV, supra, 137 N.J. at 351. The basic question in the frequency approach is whether the degree of blameworthiness in the instant case reasonably supports an expectation that such a case will generally result in a death sentence. We use that method to determine whether a defendant is in a category that makes him or her more likely than other types of killers to receive the death penalty.\n\nAs indicated supra at (slip op. at 9-10), we employ no set level to determine at what point death sentences may be considered as \"generally\" imposed for a given type of murder. However, the lower the frequency of death sentences in a class of murderers, the greater scrutiny we must bring to bear to determine whether any impermissible factor has had a role in determining the sentence. Likewise, the greater the frequency of death sentences in a class of cases, the more certain we are that a given death sentence is proportionate for any member of that class. Bey IV, supra, 137 N.J. at 351; Marshall II, supra, 130 N.J. at 153. Accordingly, we use the frequency approach not as a strict rule but as a measure of consistency in our capital-sentencing regime. Marshall II, supra, 130 N.J. at 153.\n\nAs pointed out above, the rate of penalty trials in death-eligible cases and the rate of death sentencing for cases that advanced to a penalty trial are both fairly low -- forty-two percent (125/298) and thirty percent (38/125) respectively. Martini Report tbls. 2, 3. That yields a total death-sentencing rate of thirteen percent (38/298). However, we are looking for a potential aberration, not a perfect comparison to all other cases. As we stated in Bey IV, supra, \"Not every statistical disparity establishes disproportionality.\" 137 N.J. at 352. Moreover, we must compare defendant's case to \"similar cases, considering both the crime and the defendant,\" N.J.S.A. 2C:11-3e, before we can make any determinations about relative frequency.\n\nFinally, we heed the admonition of the AOC that at this time we should place little substantive reliance on the statistical models. The small number of cases, especially death-sentenced cases, combined with the large number of factors used as independent variables undermines the reliability of the results of the regression models used.\n\nWhatever concerns we recognize with frequency analysis, nonetheless, do not mean that sentences for unique murders must automatically be struck down and that only those of run-of-the-mill defendants may be upheld. A capital defendant is not entitled to a perfect universe of identical cases, but instead only the best that we can achieve. See generally Bey IV, supra, 137 N.J. at 352 (stating that proportionality review searches for aberration, not for perfect comparison), 362 (limiting search to identifying irrationality and arbitrariness).\n\nWe pause here for a brief explanation of some technical terms. A regression analysis uses an algebraic model to represent a decision-making process by showing the influence of an independent variable on a dependent variable. Here, the decision-making process represented is the sentencing determination. The independent variable, which, once designated, does not change, represents a factor such as a prior murder or a contemporaneous sexual assault that is believed to influence the result of the decision-making. The dependent variable is influenced by the presence or absence of an independent variable, and here represents the decision whether to sentence capitally. A multiple regression analysis simply includes more than one independent variable in the algebraic model.\n\nBecause the results produced by the regression models are of uncertain reliability, we use the predicted probability of death sentences that those models generate only for purposes of comparison and guidance. We do not accord them final or determinative weight. See Memorandum from John P. McCarthy, Jr., Assistant Director, AOC, to Stephen W. Townsend, Clerk of the Supreme Court, State v. John Martini: Proportionality Review 3 (July 28, 1993) (on file with AOC).\n\nNonetheless, a main area of disagreement between the Court and the Dissent involves the presence of standards. Our Dissenting colleague laments our refusal \"to set any standard by which to distinguish a high from a low predicted frequency of death,\" post at (slip op. at 15), as well as the lack of \"any established category that captures the critical facts of defendant's case.\" Post at (slip op. at 16).\n\nWe avoid setting numerical standards to determine disproportionality because such an absolute, numerical system suffers from an inherent failure to distinguish between defendants. For example, if we set at thirty percent the acceptability of a certain frequency criterion as indicating no disproportionality, we would then be bound to hold that the sentence of one defendant who, at thirty percent, met that characteristic was not disproportionate. Likewise, we would be bound to find disproportionality in the case of another defendant who achieved only twenty-nine percent in that category. Yet overall, the latter defendant might be more deathworthy under our statutory scheme, and of the two, might actually be the one properly sentenced.\n\nEven with the foregoing problems, however, the statistical approach receives our attention because it permits us to distinguish cases by culpability; because it allows us to determine a community consensus, in contrast to the individual assessment of the case-by-case approach; and because it creates a basis for evaluating the fairness of the entire sentencing system. Unlike the precedent-seeking approach, the statistical method provides a means for deciding whether the cases used for comparison are themselves disproportional. Therefore, we use both approaches as complementary techniques.\n\n1. The Salient-Factors Test\n\nThe salient-factors test allows us to measure the relative frequency of a defendant's sentence by comparing it to sentences in factually-similar cases. Its purpose is to help us determine whether the death sentence is imposed in a category of comparable cases often enough to create confidence in the existence of a societal consensus that death is the appropriate remedy. We group cases initially around specific statutory aggravating factors and then subdivide that group according to circumstances that serve either to aggravate or to mitigate the blameworthiness of the defendants in those cases. We view that method as the most persuasive of the frequency tests, Bey IV, supra, 137 N.J. at 353; Marshall II, supra, 130 N.J. at 168, because of its close link to statutory factors and its sensitivity to nuance. Final Report 82-83.\n\nFor Martini, similar cases are those involving kidnapping with particular violence and terror. Martini Report tbl. 6, group H(2). Of the six death-eligible cases in that group, three went to penalty trial, and defendant's was the only case resulting in a death sentence. That creates death-sentencing rates of thirty-three percent for penalty-trial cases and seventeen percent for all death-eligible cases. Martini Report tbl. 7, group H(2). Those ratios are somewhat higher than the overall sentencing rates of thirty percent for penalty-trial cases and thirteen percent for all death-eligible cases. See supra at (slip op. at 15). The figures for the similar cases are as follows:\n\nDeath-Sentencing Rates for H(2) Non-Stranger Kidnapping\n\nDeath-\n\nDeath- Sentencing Proportion of\n\nSentencing Rate for All Cases\n\nRate at Death-Eligible Advancing to\n\nPenalty Trial Cases Penalty Trial\n\nIncluding .33 (1/3) .17 (1/6) .50 (3/6)\n\nMartini\n\nExcluding .00 (0.2) .00 (0/5) .40 (2/5)\n\nMartini\n\n[Martini Report tbl. 7, group H(2) (Table does not exclude defendant).]\n\nDefendant argues that his sentence is excessive because he is the only defendant in category H(2) to receive the death sentence. The State contends that defendant does not fit well in sentence category H(2) because he is the only murderer to have kidnapped for ransom. Moreover, the State adds, a sample size of six cases is too small to create statistical reliability. The AOC concurs with the State's view. It notes that its sample size is too small to generate reliable figures. Additionally, according to the AOC, the five other cases are factually dissimilar, because, as pointed out, no other case in that group involved a ransom or terrorizing non-decedent victims. The AOC suggests that Martini's case may be compared to other murders involving a pecuniary motive.\n\nWe agree with the State and the AOC that the H(2) comparison is not instructive. Unlike Martini's case, none of the other five cases involves ransom or an extended period of terrorizing and threatening the lives of the victim's family. The rates of death-sentencing, nevertheless, are high enough to show that to the extent that Martini may be compared to others who murder in the course of kidnapping, his sentence is not disproportionate. Although defendant is the only one to be sentenced to death in category H(2), his rates, thirty-three percent for penalty-trial cases and seventeen percent for all death-eligible cases, are comparable to Marshall's. For Marshall, placed in group I(2), contract-murder principals, the percentage of death sentencing was thirty-three for penalty-trial cases and twenty-five for all death-eligible cases. Marshall II, supra, 130 N.J. at 168; Martini Report tbl. 7, group H(2), I(2); Marshall Report, tbl. 7, group I(2). Like Martini, Marshall was the only person in his category to receive the death sentence, yet we found no disproportionality. Similarly, Marko Bey was the first multiple murderer whose death sentence we upheld on proportionality review. Being the first murderer in a category does not support a Conclusion of disproportionality. See Bey IV, supra, 137 N.J. at 349-50; Marshall II, supra, 130 N.J. at 166.\n\nAside from the feature of kidnapping of a non-stranger with particular violence or terror, defendant's case may be profitably compared to kidnapping of a stranger with particular violence or terror, to contract killers, to principals in contract killings, and to other pecuniary-advantage killers. We may compare Martini to kidnappers of strangers, because although Martini had singled out Flax in advance, the two were, practically speaking, strangers. Thirty years before the kidnapping, defendant and Flax had had an acquaintanceship, but apparently they had not seen each other since. From the victim's perspective, defendant was a virtual stranger. The numbers in the stranger kidnapping are somewhat higher, but with a sample size (including Martini) of two, the stranger-kidnapping rates' statistical reliability is very low. The figures are:\n\nDeath-Sentencing Rates for H(1) Stranger Kidnapping\n\nDeath\n\nDeath- Sentencing Proportion of\n\nSentencing Rate for All Cases\n\nRate at Death-Eligible Advancing to\n\nPenalty Trial Cases Penalty Trial\n\nIncluding .50 (1/2) .50 (1/2) 1.0 (2/2)\n\nMartini\n\nExcluding .00 (0/1) .00 (0/1) 1.0 (1/1)\n\nMartini\n\n[Martini Report tbl. 7, group H(1) (Table does not include defendant).]\n\nTo the extent that we give weight to those rates, they support a finding of no disproportionality.\n\nWe may compare Martini to contract killers because he killed his victim as the result of his plan to endanger Flax for money. Moreover, the successful completion of his crime depended in part on the death of Flax. Defendant needed to kill Flax to prevent the victim from identifying him and from later being a witness against him, and he stated that he shot Flax because he thought that Flax would escape. See Martin, supra, 131 N.J. at 279-85.\n\nContract killers show an extremely high frequency of receiving a death sentence. Forty-three percent of such death-eligible defendants received a capital sentence, as did sixty percent of those who advanced to a penalty trial. The figures, with and without Martini, are as follows:\n\nDeath-Sentencing Rates for I(1) Contract Killers\n\nDeath-\n\nDeath- Sentencing Proportion of\n\nSentencing Rate for All Cases\n\nRate at Death-Eligible Advancing to\n\nPenalty Trial Cases Penalty Trial\n\nIncluding .66 (4/6) .50 (4/8) .75 (6/8)\n\nMartini\n\nExcluding .60 (3/5) .43 (3/7) .71 (5/7)\n\nMartini\n\n[Martini Report tbl. 7, group I(1) (Table does not include defendant).]\n\nThose rates, strikingly high, show no disproportionality. When placed into group I(1), defendant shows a sixty-six-percent probability of receiving the death sentence at his penalty trial. We note that the sample size, eight including defendant, is small and that defendant is obviously not perfectly comparable to a contract killer. A contract killer generally is not involved in the selection of the victim but kills simply for the money and reputation. Here, defendant was actively involved in the selection of the victim and killed to ensure the successful completion of his plan. Although defendant is related closely enough to the contract-killer group to allow an analogy, the problems with the comparison merit consideration in the weight we give to its results.\n\nDefendant may be compared to principals in contract killings because of the similarity of their roles in planning the crime. Without Martini, twenty-five percent of such death-eligible cases resulted in a capital sentence, as did thirty-three percent of those cases that advanced to a penalty trial. The figures, with and without defendant, are:\n\nDeath-Sentencing Rates for I(2) Contract Principals\n\nDeath-\n\nSentencing Proportion of\n\nDeath- Rate for All Cases\n\nSentencing at Death-Eligible Advancing to\n\nPenalty Trial Cases Penalty Trial\n\nIncluding .50 (2/4) .40 (2/5) .80 (4/5)\n\nMartini\n\nExcluding .33 (1/3) .25 (1/4) .75 (3/4)\n\nMartini\n\n[Martini Report tbl. 7, group I(2) (Table does not include defendant).]\n\nThose figures, like the contract-killer results, clearly support a finding of no disproportionality. Placed in group I(2), defendant shows a fifty-percent chance of receiving a death sentence at the penalty trial. However, the sample size, five with defendant and four without him, is too small to allow us to rely heavily on the percentages generated by the I(2) table.\n\nThe last category is group I(3), other pecuniary-advantage killers. We compare Martini to defendants in that group because he committed his crime for money. With defendant in group I(3), his percentages are high: fifty percent of death-eligible cases receive the death penalty, as do fifty percent of penalty-trial cases.\n\nDeath-Sentencing Rates for I(3) Pecuniary-Advantage Killers\n\nDeath-\n\nDeath- Sentencing Proportion of\n\nSentencing Rate for All Cases\n\nRate at Death-Eligible Advancing to\n\nPenalty Trial Cases Penalty Trail\n\nIncluding .50 (1/2) .50 (1/2) 1.0 (2/2)\n\nMartini\n\nExcluding .00 (0/1) .00 (0/1) 1.0 (1/1)\n\nMartini\n\n[Martini Report tbl. 7, group I(3) (Table does not include defendant).]\n\nAlthough a capital-sentencing rate of fifty percent supports a finding of no disproportionality, the sample size of two, including defendant, precludes reliance on those results.\n\nAccordingly, we conclude that the salient-factors measure, the most persuasive of the statistical measures, supports a finding of no disproportionality. It shows that defendant's class generally receives the death penalty. Although the small sample sizes of the groups in the salient-factors test preclude us from investing those results with great weight, we will use them as a check against our findings under both the other two statistical tests and under the precedent-seeking approach.\n\n2. The Numerical-Preponderance-of-Aggravating-and-Mitigating-Factors Test\n\nThis test compares Martini's case to other cases having the same number of aggravating and mitigating factors. It uses those raw numbers to measure blameworthiness, on the assumption that the presence of more aggravating factors and fewer mitigating factors renders a case more blameworthy. The purpose of using the numerical-preponderance test is to provide a means to control for the fundamental problem of the salient-factors test, i.e., that our universe contains too few cases in any one factual category to permit reliable inferences. The obvious problem with the numerical-preponderance approach is that it assumes that juries weigh each factor equally. Its inability to account for the qualitative character of jury deliberations makes this test more problematic than either the salient-factors test or the index-of-outcomes test. Marshall II, supra, 130 N.J. at 171. To alleviate that problem, the numerical-preponderance test attempts to weight the statutory factors to account for qualitative determinations.\n\nHere, the jury found two aggravating factors: c(4)(f), murder to escape detection, and c(4)(g), murder during the course of a kidnapping. Six of the twelve jurors found mitigating factor c(5)(c), age, and six found mitigating factor c(5)(h), the catchall factor. All jurors rejected mitigating factors c(5)(a), extreme mental or emotional disturbance, and c(5)(d), diminished capacity. As we stated in Bey IV, supra, \"In the frequency analysis, we will consider only those mitigating factors that the jury found relevant to the imposition of the death penalty.\" 137 N.J. at 361. Unlike precedent-seeking review, in which we will consider \"objective factors that are clearly present in the record even if the jury did not find them to be relevant,\" on frequency analysis we will not use additional factors \"because of the need to maintain the uniformity of the statistics.\" Ibid. If we reworked one case, a valid statistical comparison would require that we rework and reweigh all the cases in the universe.\n\nThe Martini Report identifies twenty-three penalty-trial cases that contain two aggravating and two mitigating factors. Thirteen of those cases resulted in death penalties, producing a death-sentencing rate of fifty-seven percent. Martini Report tbl. 8. For the forty-eight death-eligible cases in that class, the percentage is twenty-seven percent (13/48). Id. at tbl. 9. The figures without defendant are slightly lower:\n\nDeath-Sentencing Rates By Statutory Factors\n\nDeath-Sentencing Death-Sentencing\n\nRate at Penalty Rate for All Death-\n\nTrial Eligible Cases\n\nIncluding Martini .57 (13/23) .27 (13/48)\n\nExcluding Martini .55 (12/22) .26 (12/47)\n\n[Martini Report tbls. 8, 9 (Tables do not exclude defendant).]\n\nOf those cases in which aggravating factor c(4)(f) (murder to escape detection) was present and that contain a total of two aggravating and two mitigating factors each, the death-sentencing rate in death-eligible cases is twenty-seven percent (5/18) with Martini and twenty-four percent (4/17) without him. For cases including aggravating factor c(4)(g) (contemporaneous felony), the death-sentencing rate in cases containing two aggravating and two mitigating factors is nineteen percent (8/41) with defendant and eighteen percent (7/40) without him. Martini Report App. H, tbls. 6, 7 (Tables do not exclude defendant). The overall death-sentencing rate for all cases containing aggravating factor c(4)(f) is nineteen percent (6/32) with defendant and sixteen percent (5/31) without him. For all cases containing aggravating factor c(4)(g), the overall death-sentencing rate is seventeen percent (15/87) with defendant and sixteen percent (14/86) without him. Ibid.\n\nArranged by aggravating and mitigating factors, the numbers are:\n\nDeath-Sentencing Rates By Aggravating and Mitigating Factors\n\nDeath Sentencing Rate\n\nDeath-Sentencing Rate at for All Death-Eligible\n\nPenalty Trial Cases\n\nIncluding Excluding Including Excluding\n\nMartini Martini Martini Martini\n\nAggravat- .37 (14/37) .36 (13/36) .23 (14/60) .22\n\ning Factor (13/59)\n\nc(4)(f)\n\n(escape\n\ndetection)\n\nAggravat- .32 (26/81) .31 (25/80) .12 .11\n\ning Factor (26/221) (25/220)\n\nc(4)(g)\n\n(kidnap-\n\nping)\n\nMit igating .16 (7/43) .14 (6/42) .08 (7/91) .07 (6/90)\n\nFactor\n\nc(5)(c)\n\n(age)\n\nMitigating .26 .26 .10 .1 0\n\nFactor (30[Marshall Report tbl. 10 (Table does not exclude Martini).]\n\nDefendant argues that the foregoing frequencies are so low as to demonstrate the disproportionality of his sentence. The State contends that those figures do not indicate disproportionality, because death sentencing is reserved for only the worst murderers. The rates of death sentencing per statutory factors are comparable to those in Bey IV. Bey had a penalty-trial\n\ntrial death-sentencing rate of fifty-five percent and a death-eligible rate of twenty-six percent, Bey IV, supra, 137 N.J. at 359, compared to Martini's rates of fifty-seven and twenty-seven percent. Defendant Marshall had rates of twenty percent and seven percent. We concluded that although those frequencies were low, Marshall's aggravating factor, payment for murder, more frequently produces a death sentence than do other aggravating factors. Marshall II, supra, 130 N.J. at 171-72. Here, Martini's aggravating factors taken separately produce rates of thirty-seven percent (escape detection) and thirty-two percent (kidnapping), which are somewhat low. They do not establish disproportionality, however. As with defendant Marshall, Martini's actions, kidnapping for ransom and extreme terrorization of the victim's family, create a factual situation not readily comparable to that of other murderers in defendant's class.\n\n3. Index-of-Outcomes Test\n\nThrough this approach we attempt to identify those characteristics that establish the degree of a defendant's blameworthiness. We consider both statutory and non-statutory factors, but, as in all areas of frequency analysis, the factors that we consider are only those that the jury found to be relevant to the imposition of the death penalty. We leave to precedent-seeking review our consideration of those factors that are objectively present in the record but that the jury did not find relevant to the decision on whether to sentence capitally.\n\nThe Dissent challenges the inclusion of non-statutory factors in frequency review, stating that they belong in precedent-seeking review only. Post at (slip op. at 20). That objection misses the point of the index-of-outcomes test. That part of frequency review necessarily considers non-statutory factors that the jury found to be relevant in deciding to sentence a defendant to death. Our use of that approach is not \"expedient\" or \"result driven.\" Post at (slip op. at 21). Rather, we use it because of our recognition that restricting ourselves to statutory factors only may not always allow us to quantify the jury's decision. See Marshall II, supra, 130 N.J. at 156-59 (discussing use of non-statutory factors in frequency review). For that reason we reject the Dissent's otherwise well-thought-out argument for limiting frequency-approach consideration to objective measures defined by the Legislature. Post at (slip op. at 30-31). If we did not consider non-statutory factors in some part of the frequency approach, we would fail to account for the uniqueness of a defendant's case, and that would fail the purpose of our search for disproportionality.\n\nBy looking at all facts of all cases, instead of only the salient factors or the raw number of factors, we seek to determine a pattern in capital sentencing. Unlike the salient-factors test, in the index-of-outcomes test we compare cases that are factually dissimilar but that are nevertheless comparable from the perspective of the defendants' blameworthiness. In contrast to the numerical-preponderance test, we attempt here to account for the different weights that juries give the various factors. Unlike the other tests, the basis for comparison here is not similar factual patterns or numerical indices but \"a roughly-equivalent measure of blameworthiness.\" Marshall II, supra, 130 N.J. at 172.\n\nWe compare the blameworthiness of different defendants by the statistically-relevant measures of culpability found in the circumstances of their cases, such as the infliction of severe pain or suffering, the existence of a contemporaneous sexual assault or robbery, or the prior commission of murder. See Bey IV, supra, 137 N.J. at 362; Martini Report Technical App. 9 at 3. In the Martini Report, the AOC has prepared tables listing death-sentencing rates that measure defendant culpability based on case characteristics that appear to be important to prosecutors and jurors. Martini Report Technical App. 9 at 1. Those tables group cases in five levels of culpability based on predicted probabilities of a return of a death sentence. The levels of culpability are: level one, less than a twenty-percent likelihood of a death sentence; level two, twenty to less-than-forty percent; level three, forty to less-than-sixty percent; level four, sixty to less-than-eighty percent; and level five, eighty to one-hundred percent. Id. at 5. The purpose of grouping cases in that manner is to ensure that groups contain only cases involving similar levels of blameworthiness. From those groups, we derive the actual probabilities of death sentencing for cases in the various levels of culpability. Again, the AOC urges caution in using the findings of those regression analyses, especially concerning comparatively rare factors. Id. at 7. Because Martini's case involves the only murder that resulted from a kidnapping for ransom, we treat the index-of-outcomes findings accordingly.\n\nConsidering both statutory and non-statutory factors in penalty-trial cases, defendant has a predicted probability of eighty-eight percent, with a probability range containing a lower limit of twenty-five percent and an upper limit of ninety-nine percent. (The upper and lower limits establish the probability range required to yield a confidence interval of ninety-five percent. A confidence interval simply designates the chance, expressed as a percentage, that a defendant's case will fall within a certain range of predicted probabilities of receiving a death sentence.)\n\nThe predicted probability of eighty-eight percent places Martini in level five, the highest level of culpability. Martini Report tbl. 12. The penalty-trial death-sentencing rate in that category is eighty-eight percent (23/26). Martini Report tbl. 11. Cases with a predicted rate of death sentencing of seventy percent or greater (culpability level five and the upper half of culpability level four) account for sixty-one percent of all death sentences imposed in that category. Ibid.\n\nConsidering both the statutory and non-statutory factors in all death-eligible cases, defendant has a predicted probability of five percent, with a lower limit of one percent and an upper limit of thirty percent. That places him in culpability level one. Martini Report tbl. 14. The overall death-sentencing rate in that category is four percent (10/248). Martini Report tbl. 13. In the death-eligible universe, cases with a predicted capital rate of less than seventy percent yield an actual capital rate of nine percent (26/284). However, for actual death-sentenced cases, those cases with a predicted probability of fifty percent or less account for fifty-five percent of all capital sentences imposed (21/38). Ibid.\n\nWhen we consider only statutory aggravating and mitigating factors (which does not allow weighing the ransom scheme or the terrorizing of non-decedents), compared to other penalty-trial defendants, Martini has a predicted probability of receiving a death sentence of fifteen percent, with lower and upper limits of three and fifty-one percent respectively, placing him in culpability level one. Martini Report tbl. 16. That gives him an actual death- sentencing rate of five percent (3/58) among penalty-trial cases. Martini Report tbl. 15. Again considering only statutory factors, when we compare Martini's case to all other death-eligible cases, defendant has a predicted probability of eight percent, with respective lower and upper limits of two percent and twenty-seven percent, again placing him in culpability level one. Martini Report tbl. 17. Here again, his actual death-sentencing rate is five percent (12/249). Martini Report tbl. 15.\n\nDefendant argues that the index-of-outcomes frequencies are so low as to show that his sentence is disproportionate and that death penalties in cases such as his are random and aberrational. He further urges this Court not to weigh heavily the eighty-eight percent actual probability of death sentencing based on comparison to other penalty-trial cases because of that measurement's seventy-four percent probability range. Last, he asks this Court to accept re-worked tables that account for his alternative assumptions. The State claims that the numbers do not indicate any disproportionality, and cites the AOC's admonition that the small sample size and the large number of variables considered make the results of the index-of-outcomes analysis vulnerable.\n\nWe are satisfied that the index-of-outcomes test indicates no disproportionality. As was the case in Bey IV and in Marshall II, the small sample size of cases with similar levels of blameworthiness precludes us from giving great weight to these results. See Bey IV, supra, 137 N.J. at 364; Marshall II, 130 N.J. at 173-74. Thus, although the index-of-outcomes results are higher for Bey, see Bey IV, supra, 137 N.J. at 362-65, and slightly higher for Marshall, see Marshall II, supra, 130 N.J. 172-74, they do not indicate disproportionality or any aberration in Martini's case. Although the index-of-outcomes test's disparate results cause us to scrutinize defendant's case closely, we conclude, first, that the tables that yield extremely low percentages do not include non-statutory factors and therefore do not account well for the gravamen of defendant's crime (ransom and extreme terrorizing of the victim's family), and, second, that defendant is unique in our case universe. On the other hand, the test that does account for the non-statutory aggravating factors, and yields an eighty-eight percent likelihood of receiving the death penalty, has a probability range of seventy-four percent. Although that test best accounts for a defendant's culpability, its large span between upper and lower limits detracts from the reliability of that test's results. Accepting the AOC's cautionary suggestion concerning rare factors, we do not find that the index-of-outcomes test shows any aberration in the imposition of the death penalty in Martini's case. Last, for the reasons expressed in Part II B. above, supra at - (slip op. at 15-20), we reject defendant's re-worked tables and use only those tables constructed by the AOC.\n\n4. Frequency-Approach Conclusion\n\nCompared to other penalty-trial cases, Martini's case shows predicted probabilities of receiving the death sentence of thirty-three percent under the salient-factors test; fifty-seven percent under the numerical-preponderance test; and, under the index-of-outcomes test, five percent considering only statutory factors and eighty-eight percent considering both statutory and non-statutory factors. Martini Report tbl. 19. Compared to all death-eligible cases, defendant has a predicted salient-factors-test probability of seventeen percent; a numerical-preponderance-test probability of twenty-seven percent; and index-of-outcomes-test probabilities of five percent, considering statutory factors only, and four percent, considering both statutory and non-statutory factors. Martini Report tbl. 20. Those results produce no showing of randomness or aberration. Defendant has failed to offer reliable evidence of disproportionality, and we do not find that for cases such as his a sentence other than death is generally imposed. See Bey IV, supra, 137 N.J. at 365; Marshall II, supra, 130 N.J. at 174.\n\nB. The Precedent-Seeking Approach\n\nThe second part of proportionality review is the precedent-seeking test, or comparative-culpability review. It is the traditional, case-by-case form of review in which we compare similar death-eligible cases. Bey IV, supra, 137 N.J. at 366. In contrast to the frequency approach, in which we look to groups of cases, in the precedent-seeking approach we consider cases individually. The need for comparative-culpability review, which complements frequency review, Bey IV, supra, 137 N.J. at 366, increases as the overall rates in the frequency analysis decrease. Where the frequency of death sentencing in a given type of murder is low, we use the precedent-seeking method to detect the influence of impermissible factors.\n\nIn both proportionality-review cases that have considered the interaction of the two forms of review, we have relied more heavily on the precedent-seeking approach than on the frequency analysis. Supra at (slip op. at 21-22) (placing greater reliance on precedent-seeking review); Bey IV, supra, 137 N.J. at 350 (same). Thus, the Dissent's reliance on Marshall II to argue that we have up to now regarded precedent-seeking approach as \"primary,\" and that we here \"thoroughly deconstruct frequency review,\" post at (slip op. at 24), is without support. Marshall II makes no such designations. It states merely that the lower the predicted frequencies, the more intense our scrutiny must be. 130 N.J. at 159. That has not changed.\n\nWe continue to adhere to the proposition first announced in Marshall II that lower predicted frequencies require greater scrutiny in the precedent-seeking. 130 N.J. at 120. We may not base the relationship between the two forms of review on any arbitrary numerical standards. The two methods must, of course, have \"some degree of commensurability,\" post at (slip op. at 37), but their relationship is only a tool in our review. We seek to determine if the jury's decision is insupportable, and the two approaches and their interaction guide us.\n\nThrough this method we determine whether a defendant's criminal culpability exceeds that of similar life-sentenced defendants and whether it is equal to or greater than that of other death-sentenced defendants, such that the defendant's culpability justifies the capital sentence; or whether a defendant's culpability is more like that of similar life-sentenced defendants and less than that of death-sentenced defendants, such that the defendant's culpability requires a reduction of sentence to a life term. We note that statutory proportionality does not require identical verdicts even in closely-similar cases. Marshall II, supra, 130 N.J. at 181. It merely requires that the defendant was not singled out unfairly for capital punishment. Id. at 159.\n\nMoreover, contrary to the Dissent's assertion, the Court does not adopt the proposition that \"similar defendants committing similar crimes are equally blameworthy.\" Post at (slip op. at 14). Those defendants are similarly blameworthy, and therefore may usefully be compared in proportionality review, but we never state that any two defendants are equally blameworthy regardless of the factual similarity of the murders that they have committed. Such a holding would replace the jury's discretion with our own. Thus, the Dissents's \"direct question, which asks only whether, other things being equal, a murder that necessary to complete a criminal scheme is worse than other murders,\" post at (slip op. at 31), is irrelevant, because the \"other things,\" that is, the facts surrounding the murder, will never be \"equal\" from one murder to the next.\n\nWe reject our colleague's proposed bright-line measures of culpability. Adopting them would encourage arbitrariness. The Dissent can argue for simplistic markers of blameworthiness only by assuming away the uniqueness of each case. For example, it asserts that one who murders more than one victim, \"other things being equal,\" unquestionably is more culpable than a killer of only one. Post at (slip op. at 28). The number of victims obviously affects blameworthiness, and is an extremely important component of it. However, the \"other things\" that the Dissent apparently overlooks may actually control in a comparison of any two cases. For example, someone who shoots two persons who die instantly might be less blameworthy under our statutory scheme than one who kills only one through protracted torture. In our refusal to adopt inadequate and simplistic standards of blameworthiness, we do not \"evade[]\" any \"obvious, direct answers,\" post at (slip op at 28), to disingenuously-easy questions. Rather, we recognize realistic, more troubling issues.\n\nFinally, we do not \"endlessly debate\" even \"moral judgments\" concerning the relative culpability of capital defendants. As we stated in Bey IV, supra, our search is limited to irrationality or aberrancy in sentencing, and closure is necessary even in capital cases. 137 N.J. at 362 (\"At some point, even a death-penalty case must end.\").\n\n1. Relevant Factors\n\nTo identify comparison cases to be used in precedent-seeking review, we identify all relevant aggravating and mitigating factors, both statutory and non-statutory, that are \"rooted in traditional sentencing guidelines.\" Marshall II, supra, 130 N.J. at 159 (citing N.J.S.A. 2C:44-1). We use here, as we did in Bey IV and Marshall II, a structure of criminal culpability that consists of three main categories. The first main category is a defendant's moral blameworthiness, which includes elements such as motive; premeditation; justification or excuse, such as provocation; evidence of mental disease, defect, or disturbance; knowledge of the helplessness of the victim; knowledge of the murder's effects on any non-decedent victims; defendant's age and maturity; and defendant's involvement in planning the murder. The second main category is the degree of victimization, which includes the violence and brutality of the murder, and the existence of injury to non-decedent victims. The last main category is the character of the defendant, which includes components such as any prior record, unrelated acts of violence, cooperation with authorities, remorse, and capacity for rehabilitation. Marshall II, supra, 130 N.J. at 155; accord Bey IV, supra, 137 N.J. at 366.\n\nAs in Bey IV, we limit the universe of cases to those used in the frequency approach. The purpose of using two different kinds of proportionality tests, frequency and precedent-seeking, is to confirm our interpretation of the data. That purpose requires that the two methods analyze the same group of cases. See Bey IV, supra, 137 N.J. at 366-67.\n\nFrom the universe of death-eligible cases, we select comparable cases according to the aggravating factors present in defendant's case. (We no longer use the term \"salient factors\" in precedent-seeking review because of potential confusion with the use of that term in the frequency approach, in which its use, as a term of art, is limited to statutory aggravating factors. Compare Bey IV, supra, 137 N.J. at 367 (using term \"salient factors\" in Discussion of precedent-seeking review).) In precedent-seeking review, we consider both statutory and non-statutory aggravating factors to \"encompass all of the characteristics that affect the blameworthiness or deathworthiness of persons who commit murders.\" Marshall II, supra, 130 N.J. at 158. Although we do not use mitigating factors to make the initial determination of comparability, we do use mitigating factors in our evaluation of the comparable cases. Bey IV, supra, 137 N.J. at 367. We do so because the aggravating factors, not the mitigating factors, make a case deathworthy. Here, the relevant factors for determining the proportionality of defendant's death sentence are, first, the statutory factors of the contemporaneous felony of kidnapping and the murder to escape detection, and, second, the demand for ransom, which likens Martini's case to other murders that involve a pecuniary motive.\n\nAs in Bey IV, supra, we evaluate the comparison cases based only on objective criteria that were presented to the jury. 137 N.J. at 368. We consider non-statutory factors because we recognize that a jury may use such information both in its process of finding or rejecting statutory factors and in its decision to impose the death penalty. Ibid. To qualify for consideration, such non-statutory factors must be objective, be rooted in traditional sentencing guidelines, have been clearly submitted to the jury, and be likely to influence a jury's decision. Ibid. We recognize as well that in finding the catchall mitigating factor, a jury may be influenced by evidence that a defendant presents in support of a specific statutory factor that the jury ultimately rejects. See ibid.\n\nAccordingly,, we will consider those cases in the Martini Report in which the defendants committed kidnapping with particular violence or terror, were contract principals, or were contract killers. We will then decide whether Martini's culpability is more like that of defendants who received death sentences or of those who received life terms. In doing so, we consider objective factors that are clearly present in the record and that reflect blameworthiness, victimization, and defendant's character. See id. at 368-69.\n\nWe therefore reject the Dissent's \"corrections\" to the data base. Post at (slip op. at 17). We rejected defendant's \"alternative assumptions\" earlier in this opinion, see supra at 16-20, and we do not revisit that decision here. In respect of the thirty-four cases that the Dissent lists as comparable to defendant's inasmuch as pecuniary motives were present in the murders, we have included some in our comparison, specifically, Robert Marshall, Anthony DiFrisco, James Clausell, and Jamie Barone. Infra at (slip op. at 65-66, 73-82). The others, whose crimes did not involve kidnapping with particular violence or terror, contract principles or killers, or other non-robbery pecuniary-advantage killers, we find to be inapplicable to our precedent-seeking review, because murders committed in the course of a robbery or burglary, or those relating to multiple victims, torture, or sexual assault do not match well this defendant's crime of kidnapping.\n\n2. Application of Precedent-Seeking Approach\n\nWe begin application of the precedent-seeking approach by identifying the cases that we will use. They consist of those cases that appear in the AOC's tables for kidnapping of non-strangers with particular violence or terror, kidnapping of strangers with particular violence or terror, contract-murder principals, contract killers, and other non-robbery pecuniary-advantage killers. Martini Report tbl. 7, groups H(2), H(1), I(2), I(1), I(3). The total number of cases is eighteen. Ibid. By comparing Martini to those other eighteen defendants in the traditional manner of review, we seek to determine the existence of any aberration in defendant's sentencing. Bey IV, supra, 137 N.J. at 369. We note, as we did in Bey IV, supra, that even closely-similar cases do not require identical verdicts to be proportionate, in light of the different defendants, juries, facts, and legal issues involved. Ibid.\n\nPrecedent-seeking review reveals no disproportionality in Martini's sentence.\n\na. Parties' Arguments\n\nDefendant argues that his case is most like murders involving premeditated robbery or kidnapping arising from a pecuniary motive. He takes pains to distinguish himself from contract principals and contract killers. He argues that such murders are \"fatal precondition crimes,\" that is, crimes in which the killing is either itself the purpose of the crime or directly required to complete the criminal scheme. In that way, for example, Martini sees himself as different from Robert Marshall, who sought to collect on his wife's life-insurance policies. Marshall's plan obviously required the death of his wife. Similarly, defendant sees himself as distinguishable from hitmen who seek to impress organized-crime figures through their willingness to kill.\n\nThe basis of defendant's distinction is that the completion of his crime, the collection of ransom, did not depend on the death of his victim. He argues that crimes such as his are necessarily less blameworthy than the so-called \"fatal precondition\" crimes. That distinction, defendant argues, minimizes his deathworthiness. We disagree.\n\nWe reject defendant's \"fatal precondition\" argument. We do not accept the proposition that one who, with intent to kill, commits a crime such as robbery or rape is always less culpable than one who commits a \"fatal precondition\" crime. Moreover, defendant's arguments to the contrary notwithstanding, defendant's implied promise to Mrs. Flax to release her husband once she paid the ransom does not establish his intent to do so. Because Martini took no steps to hide his identity from Irving Flax, the likelihood that defendant entertained any thought of freeing his victim is remote indeed.\n\nThus, we cannot find that fatal-precondition crimes are always more blameworthy than all other murders in which the killing arguably was not essential to the crime. Again, our decision in that regard simply recognizes the reality that, the Dissent notwithstanding, we may not assume that \"other things [are] equal.\" Post at (slip op. at 35). We will, of course, consider as an element of blameworthiness the necessity of the victim's death in the defendant's plan. However, we refuse to restrict ourselves to such absolute, artificial constructions that ignore the nuances of individual cases.\n\nWe reject as well defendant's arguments that one who purposefully and knowingly murders a single victim is less deathworthy than one who murders more than one victim. We cannot say that a murderer who kills one person through torture is necessarily less culpable than a murderer who kills more than one person quickly. Nor do we accept defendant's arguments that one who kidnaps for ransom is never more culpable than one who commits other types of kidnapping, or that the length of premeditation does not affect a defendant's level of culpability. Finally, we reject defendant's request to treat all cases not prosecuted capitally as non-deathworthy. As we stated in Koedatich, supra, a prosecutor may elect not to prosecute a case capitally for reasons unrelated to the deathworthiness of the case. 112 N.J. at 256. In the absence of proof of the actual reasons, we will not speculate either way about decisions concerning deathworthiness. See Marshall II, supra, 130 N.J. at 202-04.\n\nThe State argues that juries are not required to return identical verdicts even in closely-similar cases. Therefore, it continues, proportionality should be limited to a search for the influence of impermissible factors in the decision to sentence a given defendant capitally. Those propositions are essentially correct. In proportionality review, we seek to ensure that the defendant has not been singled out for capital punishment unfairly. Marshall II, supra, 130 N.J. at 159, 181.\n\nThe Dissent also characterizes as \"irrational[]\" our acceptance of different results even in closely-similar cases, even though each case involves different facts, defendants, juries and legal issues. Post at (slip op. at 26); compare supra at 54 (discussing treatment of closely-similar cases). The Dissent bases that description on the importance of the issue at stake: the life of the defendant. Post at (slip op. at 27). Our Dissenting colleague argues that \"admitting the uniqueness of every case\" makes review \"unmanageable.\" Post at (slip op. at 27). We disagree. That every case is unique makes proportionality review difficult but not impossible. Moreover, to treat capital cases as interchangeable would rob defendants of the thorough, searching review to which they are statutorily entitled.\n\nThe State also contends that the jury's failure to find a mitigating factor should be accorded great weight. Although proportionality review is not a proceeding in which this Court should second-guess the penalty jury's findings, we are required in comparative-culpability review to weigh all evidence that is objectively present in the record and that is rooted in traditional sentencing guidelines. Therefore, in precedent-seeking review, we consider mitigating evidence even though the jury found it insufficient to establish a statutory mitigating factor. Bey IV, supra, 137 N.J. at 367-69.\n\na. Summaries of Similar Cases\n\nWe base our summaries on published opinions or, if the cases are unpublished, on the Discussion of those cases contained in the AOC's Detailed Narrative Summaries.\n\ni. Non-Stranger Kidnapping\n\nNelson Jalil Jalil, a thirty-two-year-old male, planned for five months to kill his pregnant, twenty-two-year-old wife because of frequent arguments between them. He decided to carry out his plan on November 23, 1987. He asked his wife to accompany him that evening when he went to clean an office. At 4 a.m. on November 24, he began arguing with his wife, handcuffed her hands behind her back, beat her back and face, and strangled her. Both his and his wife's clothes and shoes were bloody, as was the interior of the car. The victim's face was swollen, bruised, and bloody. Jalil covered his wife's body with a blanket and drove to two jobs, leaving the body in his car while he worked. On November 25, at about 1:30 a.m., defendant dumped his wife's body in a deserted area of a junkyard, where a worker at the yard discovered it later that morning.\n\nJalil confessed to having killed his wife. Charged with purposeful and knowing murder, unlawful possession of a weapon, and kidnapping, he pleaded guilty to aggravated manslaughter and kidnapping. The court sentenced him to a thirty-year term with a fifteen-year parole disqualifier for manslaughter and a consecutive twenty-year term with a five-year parole bar for the kidnapping.\n\nJalil came to the United States in 1971, dropped out of high school at the tenth grade when his ability to speak English became sufficient to allow him to work, and was a maintenance worker at an office, a hospital, and a race track. He is in poor physical health, suffers from depression and anxiety, and has no prior record.\n\nGary Mayron On March 26, 1986, twenty-two-year-old Mayron met his seventeen-year-old female victim at an arcade. They left in Mayron's truck, bought a six-pack of beer, and went to a motel, where they engaged in sex. Shortly thereafter, Mayron strangled the victim with his belt. After the victim lost consciousness, the belt broke. Mayron dressed her, placed her in his truck, and drove to a secluded area, where the victim regained consciousness and pleaded for her life. Defendant said that he was not going to hurt her but was going to teach her \"a lesson about promiscuity.\" He then shoved her down, hit her head with a rock, dragged her down a hill, and punched and kicked her. The victim tried to defend herself with a stick, but defendant overpowered her and left her face-down in water. Defendant then went to a bar to wash his hands and shoes.\n\nAfter Mayron told his girlfriend about the assault, she called the police. On being arrested, Mayron first denied but then confessed to the killing, claiming that he had not intended to kill his victim and that he thought that she was still alive when he left her. He was found guilty of knowing and purposeful murder and of kidnapping. At the penalty trial, the jury found both aggravating factors that the State had asserted: c(4)(c), extreme suffering, and c(4)(g), murder in the course of a kidnapping. Defense experts testified that when Mayron combined sex and alcohol, he experienced violent, psychotic episodes. Mayron's sister and biological mother testified that he had spent much of his childhood in foster care. The jury found mitigating factors c(5)(a), emotional disturbance; c(5)(d), mental disease, defect, or intoxication; and c(5)(h), the catchall factor. It rejected mitigating factor c(5)(c), age. Because one juror could not agree on the imposition of a death sentence, Mayron received a life term with a thirty-year parole bar for the murder and a consecutive thirty-year period of parole ineligibility for the kidnapping.\n\nMayron previously had been charged with rape and assault with a deadly weapon, and had been convicted of the assault charge. He had also been convicted of aggravated assault. He had been graduated from high school, had enlisted in the Army, and had received a dishonorable discharge for committing an aggravated assault. He had consumed beer every day since age eighteen, had been committed to the Vroom Building at Trenton Psychiatric Hospital, and had been in treatment programs for both alcohol and cocaine abuse.\n\nClifton McKenzie On January 9, 1985, McKenzie, age twenty nine, met the twenty-six-year-old victim at her place of employment, went with her to her apartment, and held her there against her will, while repeatedly assaulting her physically and sexually. When her family arrived at her apartment on January 12, 1985, McKenzie fled through a back window. The victim's family took her to the police station to file a report. She was supposed to return to sign a complaint, but disappeared before doing so.\n\nOn February 9, 1985, a motel manager notified police that the staff was unable to awaken one of the guests. Police and a first-aid squad responded and transported the occupant, McKenzie, to the hospital for drug-overdose treatment. Police then searched McKenzie's car and found the victim's body in the trunk. An autopsy showed that she had died of oxygen deprivation or exposure or both.\n\nMcKenzie told police that he and the victim had been riding in his car and had begun arguing, that he had covered her nose and mouth with his hand until she lapsed into an unconscious state, and that he then had placed her in his trunk. Over the next two days, he had checked on his victim, noticing that she had become \"cold\" and was \"shrinking.\" He was convicted of knowing and purposeful murder, felony murder, and kidnapping.\n\nThe State served notice of aggravating factors c(4)(f), murder to escape detection, and c(4)(g), contemporaneous felony. The jury found only c(4)(g). It also found mitigating factors c(5)(d), mental disease, defect, or intoxication; c(5)(f), no prior criminal history; and c(5)(h), the catchall factor. It rejected mitigating factor c(5)(c), age. It did not find that the aggravating factor outweighed the mitigating factors. McKenzie received a life term with a thirty-year parole disqualifier for the knowing and purposeful murder and a consecutive fifteen-year term for the kidnapping. The sentencing court merged the felony-murder conviction into the knowing-and-purposeful-murder conviction.\n\nDefendant had completed one semester of college but had dropped out to work full time. He was a heroin addict and had been through two treatment programs and a mental-health evaluation at Menlo Park Diagnostic Center. He had several convictions, including burglary, disorderly-persons offenses, and forgery.\n\nGilberto Valdez On September 22, 1988, the victim told a codefendant where that codefendant could obtain some battery chargers. The chargers turned out to be defective. When the victim returned, Valdez and the two codefendants were drinking. The three defendants beat the victim, then dragged him by a tie wrapped around his neck to some railroad tracks. There, they tied him with a hose, continued beating him, and stripped him. Valdez hit the victim with a steel object and stabbed him. The victim died of the beating and of strangulation.\n\nCharged with felony murder, aggravated manslaughter, kidnapping, possession of a weapon for an unlawful purpose, and unlawful possession of a weapon, Valdez pleaded guilty to aggravated manslaughter and received a twenty-five-year term. One codefendant received a thirty-five-year term for felony murder, and the other pleaded guilty to kidnapping.\n\nValdez was homeless at the time of the offense. He was unemployed, having formerly worked as a mechanic and as a stonemason. He enjoyed good mental and physical health, and denied using drugs other than alcohol.\n\nRicky Watkins Watkins was a codefendant of Valdez. Watkins was the defendant who wrapped the tie around the victim's neck and dragged him to the railroad tracks. Watkins was charged with felony murder, aggravated manslaughter, kidnapping, possession of a weapon for an unlawful purpose, and unlawful possession of a weapon. A jury convicted him of all counts, and the court imposed a thirty-five-year term with a thirty-year parole bar for the felony-murder conviction and an eight-year concurrent term for the aggravated assault. The court merged the other counts into the felony-murder conviction.\n\nWatkins is an eleventh-grade drop-out who at the time of the offense lived in a trailer house inside a warehouse where he worked as a forklift operator. He had no mental-health problems but suffered from dizziness, was addicted to cocaine, and had convictions for burglary, larceny, resisting arrest, and invasion of privacy.\n\nii. Stranger Kidnapping\n\nJamie Barone On August 21, 1987, the victim left her place of employment to meet a friend at a mall. She never returned. Fifty-two days later her body was found in a wooded area several miles from the mall. She had died of a fractured skull caused by bludgeoning that had separated her skull from her body.\n\nThe victim's car was discovered in Barone's possession in another state. Barone had also used several of the victim's credit cards. Police investigation revealed that Barone had been shopping at the mall from which the victim had disappeared. An eyewitness had seen the victim with Barone at the mall. Barone denied any involvement in the abduction, and claimed that someone had given him a ride in the car and then had given him the car and the victim's wallet.\n\nThe defendant was convicted of knowing and purposeful murder, kidnapping, robbery, unlawful possession of a weapon, and felony murder. At the penalty trial, the jury found aggravating factors c(4)(f), murder to escape detection, and c(4)(g), contemporaneous felony. The jury also found mitigating factors c(5)(c), age, and c(5)(f), the catchall factor. It rejected c(5)(a), extreme mental or emotional disturbance. Because the jury was unable to reach a decision in the weighing process, the trial court sentenced Barone to a life term with a thirty-year parole bar. He also received a thirty-year term with a fifteen-year period of parole ineligibility for kidnapping, consecutive to the murder sentence, and a twenty-year term with a ten-year parole bar for the robbery, consecutive to the kidnapping term. The court merged the felony-murder conviction into the purposeful-and-knowing-murder conviction.\n\nBarone, age twenty-six, had been in the Army, where he had earned college credits. He had no significant history of drug abuse but admitted to prior crack use. He was previously convicted of grand larceny, possession of a stolen motorcycle, driving without a license, two burglaries, and auto theft.\n\niii. Contract Principals\n\nFrancis Brand In 1988, Brand, thirty-two years old, began importuning Randy Burroughs, Brand's long-time high-school friend, to kill Brand's brother Arthur. Arthur was selling drugs from out of the home and abusing his family. He also sold drugs to another brother, Joey.\n\nBrand promised Burroughs ever-increasing amounts of money for the murder, and also asked at least two others persons to comment the killing. In October 1988, Burroughs agreed to kill Arthur, but was unable to carry out the murder. Later, on July 4, 1989, Burroughs attempted to break up a fight between Arthur and Joey, in the course of which Burroughs and Arthur fought. The next week, on July 11, 1989, at 3:00 a.m., Burroughs, carrying a shotgun, entered the Brands' house through an unlocked door and went into the bedroom where Arthur slept. As Arthur began to rise, Burroughs said, \"You got to stop hurting people,\" and \"you're done.\" He then shot Arthur twice.\n\nBurroughs and defendant met later and also during the day without discussing payment. That night Burroughs returned to the Brands' home. He told the police, who were present at the crime scene, that he had stopped by only to pick up a hat that he had left there the previous day. Questioned by police the following day, Burroughs admitted to the killing, told police that the shotgun was in his attic, and implicated Francis.\n\nFrancis Brand denied any involvement in the killing of his brother, expressed remorse over his death, and claimed that Burroughs had acted solely out of anger over the fight on July 4. A jury convicted him of murder and conspiracy to commit murder. The case was not presented as a capital case, although the State could have asserted aggravating factor c(4)(e) and Francis could have presented mitigating factors c(5)(a), c(5)(f), and c(5)(h).\n\nBrand had no criminal record. Although he dropped out of high school in the twelfth grade, he later received his diploma. Unemployed at the time of his arrest, he had previously worked sporadically as a janitor. He is single, has no children, no history of drug abuse, and denies any mental illness.\n\nWilliam Engel and Herbert Engel This case is reported as State v. Engel, 249 N.J. Super. 336 (App. Div. 1991), certif. denied, 130 N.J. 336 (1992). The State tried the defendants together, seeking the death penalty. William, married to the victim, Xiomara Engel, suspected his wife of infidelity. He hired a private investigator, who found no evidence of infidelity, but that finding did not overcome William's jealousy. He often confronted his wife with his groundless suspicious, abusing her both verbally and physically.\n\nXiomara's aunt and mother witnessed two beatings, during which William claimed that Xiomara deserved to be killed. The marriage ended in an annulment, but William continued to harass Xiomara and sought to prevent her from obtaining employment to ensure that she did not meet other men. He also began calling Andres Diaz, for whom Xiomara had worked as a secretary and with whom Xiomara had developed a relationship, to pose unwarranted and insinuating questions.\n\nOn December 13, 1984, Xiomara agreed to meet William at his office preparatory to a shopping trip for their daughter's Christmas presents. Dropping off her children and her grandfather at her apartment, she explained to her grandfather, who was to babysit for the children, that she was on her way to meet with William. That evening, William called twice to tell the grandfather that Xiomara had failed to keep the appointment.\n\nAt 8:00 that night, police responded to a burglar alarm at William's place of business. They saw Herbert Engel's car in the parking lot. William Engel responded to the officers' knocks, assured them that everything was in order, and quickly closed the door. Suspicious, the officers remained at the scene. When William reappeared, the officers ordered him to open the door. William, appearing nervous, came outside and shut the door. He answered the officers' questions in an evasive manner, but because the policemen recognized William as the owner of the building, they did not detain him or otherwise pursue the matter.\n\nThe next day, Xiomara's oldest daughter told Xiomara's mother that the victim had never returned, and later that morning William called to say that Xiomara had failed to appear for their shopping trip. When the mother said that she was going to call the police, William suggested that she wait until he could accompany her to the police station that afternoon. When by 11:00 p.m. William had failed to arrive, the mother, accompanied by Diaz, went to the police without William.\n\nAs part of their search for Xiomara, police interviewed William at his home, during which he chain-smoked and appeared very nervous. He repeated his claim that he had not seen the victim on the night of December 13.\n\nOn December 14 South Carolina police discovered a body in a burned station wagon. The license plates had been removed, but police were able to trace the car's ownership to Xiomara and to identify her body through her dental records.\n\nFor reasons not stated in the record, police arrested James McFadden. In return for the State's promise to waive capital prosecution and to recommend that sentences run concurrently, McFadden revealed that Xiomara had been murdered, explained his role in the killing, and implicated both William and Herbert.\n\nIn early December 1984, McFadden had been hired by Herbert as a salesman, although they had never agreed on a salary. Shortly after hiring McFadden, Herbert invited McFadden to meet him at a restaurant, where he introduced William to McFadden as his \"cousin\" and told McFadden that William had a girlfriend who was harassing him. When Herbert said that William would pay $25,000 to have her killed, McFadden did not respond. At Herbert's request, they met again several days later. Herbert repeated the offer, and McFadden agreed to commit the murder. They were to meet at William's warehouse the following Thursday. McFadden arrived, carrying a briefcase in which he had placed a wire cord that he had removed from the back of a refrigerator. When Herbert learned that McFadden was not carrying a gun, he opened his own briefcase to reveal a revolver.\n\nHerbert directed McFadden to strangle the victim when she arrived with William, who was to pretend to turn on the light, after which McFadden was to transport the body to the Engels' grandparents' home in South Carolina. McFadden was told to place the body in a hole and cover it with acid, and to have the car crushed. For purposes of disposing of the body in acid, Herbert gave McFadden a pair of elbow-length, thick rubber gloves. He then gave McFadden $1300 in cash and told him to hide in the bathroom.\n\nWilliam entered with Xiomara. He fumbled with the light switch, claimed that it did not work, and walked past the bathroom to get a flashlight. As Xiomara followed, McFadden jumped out and pulled the cord around her neck. When she fell to the floor, McFadden strangled her. During the four-minute-long ordeal, William watched, smoked a cigarette, and called his former wife a \"bitch.\"\n\nAfter Xiomara expired, McFadden backed her station-wagon into the garage and with William's help threw the body into the car. William went outside while McFadden covered the body. When he returned to the garage, William was nervous and said that the police were outside. After William dealt with the police, McFadden left, driving Xiomara's station-wagon. After picking up an acquaintance, Lewis \"Pee Wee\" Wright, he drove with Wright to South Carolina. Wright, uninformed of the drive's purpose, discovered the body during the trip. On arrival in South Carolina, Wright burned the car, after which the two men celebrated the occasion at a bar.\n\nOn their return to New Jersey, Herbert gave McFadden $5000. When Herbert later discovered that Wright had accompanied McFadden on the trip, he instructed McFadden to kill Wright, paying him another $1000.\n\nAt trial, William and Herbert were convicted of murder and conspiracy to commit murder. The jury found that the defendants had paid to have the murder committed. At the penalty phase, the jury did not find that the aggravating factor c(4)(e), hiring a killer, outweighed mitigating factors c(5)(a), extreme mental or emotional distress, c(5)(e), duress, c(5)(f), no prior criminal record, and c(5)(f), the catchall factor, wherefore the court sentenced them to a life term with a thirty-year period of parole ineligibility.\n\nRobert Marshall Reported as State v. Marshall, 123 N.J. 1 (1991) (Marshall I), proportionality aff'd, Marshall II, supra, 130 N.J. 109. Marshall, a fifty-four-year-old insurance agent, began having an extra-marital affair with Sarann Krausharr in June 1983. As early as the following December, the defendant mentioned to Krausharr the prospect of killing his wife, Maria. Although Marshall was wealthy, he lived beyond his means and was indebted to the extent of more than $168,000. He increased the amount of insurance on Maria's life to about $1,400,000 while neglecting his own policies.\n\nMarshall also paid Billy Wayne McKinnon, a former Louisiana sheriff's officer, $5000 to meet him in New Jersey. When they met in Atlantic City on June 18, 1984, Marshall offered McKinnon $65,000 to kill Maria. He promised McKinnon $10,000 in advance and $50,000 from the insurance proceeds. He gave McKinnon $7000 and a picture of Maria, assuring him that he, Marshall, would not be suspected because he was an outstanding citizen. He instructed McKinnon to kill Maria that evening.\n\nMcKinnon did not make an attempt to carry out the murder, but instead returned to Louisiana. After a second meeting on July 19, 1984, ended without an attempt on Maria's life, Marshall offered McKinnon an extra $15,000 if McKinnon would kill Maria before Labor Day. On September 6, 1984, they met again, selected a spot on the Garden State Parkway at which McKinnon would kill Maria, and made plans to make the murder look like a robbery. After spending that evening at Atlantic City with Maria, Marshall drove his car to the Parkway's Oyster Creek picnic area as planned. While Maria lay sleeping in the car, Marshall got out on the pretext of fixing a flat tire. He then allowed himself to be hit on the head as part of the staged robbery. Maria was shot twice in the back and died instantly.\n\nMarshall's telephone records led police to McKinnon, who turned State's evidence. McKinnon identified Larry Thompson, a Louisiana man, as the gunman. The police investigation also disclosed Marshall's financial straits and the life insurance policies that he had taken out on Maria. A jury convicted Marshall of conspiracy to commit murder and of murder by hire. At his penalty trial, the jury found aggravating factor c(4)(e), procuring murder by payment, and mitigating factors c(5)(f), no prior record, and c(5)(h), the catchall factor. Based on the jury's finding that the aggravating factors outweighed the mitigating factors, the trial court sentenced Marshall to death. We affirmed both his conviction and the proportionality of his sentence.\n\niv. Contract Killers\n\nRandy Burroughs Burroughs' case is set out as part of the Discussion of Francis Brand in subsection iii, supra at - (slip op. at 66-68). Burroughs was charged with conspiracy, murder, felony murder, burglary, and possession of a weapon for unlawful purposes. He pleaded guilty to murder, and the other charges were dismissed. The court sentenced Burroughs to a thirty-year term with a thirty-year period of parole ineligibility.\n\nBurroughs was graduated from high school, having taken special-education classes. He has had several jobs but has not held any of them for longer than six months. He is single and has three children by three different women. He has no history of drug abuse. His record shows one conviction for terroristic threats, which resulted in a fine.\n\nJames D. Clausell This case is reported in part as State v. Clausell, 121 N.J. 298 (1990). The victim, Edward Atwood, filed a complaint in municipal court against his neighbor, Roland Bartlett, for intentional cruelty in failing to provide his dog with water and for leaving excrement in the dog's kennel for excessive periods of time. Bartlett was acquitted of the intentional-cruelty charge but was fined for failing to clean the dog's kennel.\n\nOn August 12, 1984, Atwood was at a basketball game with his grandparents when two men arrived at the door of his house at 10:45 p.m. Atwood's wife did not recognize them, and when she told them that her husband was not home, they left. Atwood returned with his grandparents shortly after midnight, whereupon the men returned and knocked. When Atwood opened the door, his wife, grandparents, and daughter Tanya were close by. His son Darrell sat at the top of the stairs. The first man, Dwayne Wright, asked for \"Ed,\" to which Atwood replied that they had \"the wrong guy.\" As Atwood tried to close the door, Wright stepped out of the way and Clausell fired two shots from his .357 Magnum handgun. The first shot killed Atwood. The second shot narrowly missed Tanya.\n\nAn anonymous tip identified Clausell and Grant as the killers and Jennifer Schall as the driver of the getaway car. Clausell and Wright were tried together for own-conduct knowing and purposeful murder, conspiracy to commit murder, five counts of aggravated assault, possession of a weapon with unlawful intent, and possession of a handgun without a permit. Paul Grant, a friend of Wright, testified that Roland Bartlett's son, Anthony, had approached him about killing someone for $5000. He also testified that Clausell had received a phone call, had stated that they were going to receive $2000 apiece for murdering someone that evening, and had armed himself with a .357 Magnum.\n\nSchall, testifying under a grant of immunity, stated that Clausell and Wright had embarked on an attempt to collect some drug money and perhaps to beat up the debtor. She also testified that she had heard two gunshots, after which the two men had run back to the car and they drove off. She dropped them off at a club allegedly owned by Bartlett, where they expected to be paid.\n\nThe trial court dismissed the conspiracy charge. The jury convicted Clausell of purposeful or knowing murder, finding that he had fired the gun, and also convicted him of three of the five aggravated-assault charges and the two weapons charges. The jury found Wright guilty of the same charges, but because it did not find that he had fired the gun, he was not subject to death-penalty proceedings. Wright received a life term with a thirty-year parole bar for the murder, and consecutive sentences totaling six years and three months for the other charges.\n\nAt the penalty trial for Clausell, the jury found aggravating factors c(4)(b), that Clausell had knowingly or purposely subjected someone other than his victim to a grave risk of death, and c(4)(d), commission of murder for payment. It found mitigating factors c(5)(c), age; c(5)(f), no prior record; and c(5)(h), the catchall factor. It also found that each aggravating factor outweighed all the mitigating factors beyond a reasonable doubt. The court sentenced Clausell to death. It also sentenced him to a custodial term for the other convictions.\n\nWe reversed defendant's death sentence, 121 N.J. 298 (1990), because the trial court had failed to instruct the jury that Clausell could be convicted of capital murder only if he purposefully or knowingly had caused the death of Atwood, as opposed to purposely or knowingly causing serious bodily injury that resulted in death, a Gerald error. See Gerald, supra, 113 N.J. 40. On remand, defendant was not sentenced capitally.\n\nRoland Bartlett was convicted and sentenced to a life term with a thirty-year parole bar.\n\nClausell, a tenth-grade dropout, used cocaine daily. After Atwood's murder, but before Clausell's arrest for that murder, Clausell had been arrested for shooting another man in the leg three times. He had suffered a head injury as a child, resulting in severe headaches.\n\nAnthony DiFrisco Reported at 118 N.J. 253 (1988) (DiFrisco I) (affirming conviction but reversing death sentence), and at 134 N.J. 434 (1994) (DiFrisco II) (upholding death sentence but postponing proportionality review). At age twenty four, DiFrisco met Anthony Franciotti when the two were serving time in prison. After both had been released, Franciotti, who distributed drugs, became convinced that Edward Potcher, an owner of a pizzeria, intended to inform the police of Franciotti's activities. He therefore asked DiFrisco to kill Potcher in return for the cancellation of a $500 drug debt and for $2500 cash. DiFrisco agreed.\n\nIn early August 1986, Franciotti gave DiFrisco a $700 down payment, and on August 12 took DiFrisco to a bar, where they had some drinks and used marijuana. At about 7:30 p.m., Franciotti drove to the pizzeria. DiFrisco claimed also to have used heroin. He walked into the pizza shop, where he saw a man behind the counter who matched the description given by Franciotti. While DiFrisco was talking to the man, a delivery boy entered. To stall for time, DiFrisco ordered a slice of pizza and a soda. After the boy left, DiFrisco ordered a second soda. When Potcher turned to get the soda, DiFrisco shot him with a .32 caliber revolver four times in the head and once in the arm. The fatal entry wounds were in the face, forehead, ear, and the top of the head.\n\nDiFrisco returned to Franciotti's car and they drove away. The next day, Franciotti paid the remainder of the fee. Police had no leads.\n\nEight months later, New York City police arrested DiFrisco for various traffic violations, car theft, and reckless endangerment. Because DiFrisco was on probation, a conviction would have caused him to return to prison. He asked the arresting officer if he could do anything to avoid incarceration. The officer told him that revealing any major crimes would help. When DiFrisco inquired whether the assailant or the principal in a contract murder was more culpable, the officer replied that the principal was. DiFrisco subsequently confessed to the Potcher murder, although he did not know the victim's name or address.\n\nBecause the prosecution had nothing other than DiFrisco's allegations, the assistant prosecutor suggested that DiFrisco place a call to Franciotti, to induce Franciotti to make incriminating statements on tape about the murder. After being informed by the prosecutor about the meaning of aggravating and mitigating factors in a capital case and after consulting with a public defender, DiFrisco agreed to make the call. However, DiFrisco's father told him not to cooperate without the advice of paid counsel. The assistant prosecutor told him that after his arrest was made public, DiFrisco would not be given a chance to cooperate. He decided not to make the call and asked to be returned to jail.\n\nAfter DiFrisco was charged with capital murder, the State alleged aggravating factors c(4)(c), outrageously wanton or vile murder; c(4)(d), murder for pecuniary gain; and c(4)(f), murder to escape detection. DiFrisco pleaded guilty, admitted that his intention had been to kill Potcher, and waived his right to a jury for his penalty trial. The trial court found aggravating factors c(4)(d) and c(4)(f). Of the five mitigating factors submitted, c(5)(c), age; c(5)(d), mental disease, defect, or intoxication; c(5)(f), no significant prior criminal history; c(5)(g), substantial assistance to the State; and c(5)(h), the catchall factor, the court found only c(5)(g), substantial assistance. It sentenced DiFrisco to death.\n\nThis Court affirmed the defendant's murder conviction but reversed his death sentence for lack of corroborating evidence of his confession that he had been hired by Franciotti to kill Potcher. On remand of the sentencing proceedings the defendant elected to have a jury trial. The State alleged aggravating factors c(4)(d) and c(4)(f), and defendant again alleged mitigating factors c(5)(a), c(5)(d), and c(5)(h). All jurors found that DiFrisco had committed the murder for payment, but only eleven found that he had committed it to avoid detection of another crime. However, the jury found beyond a reasonable doubt that the aggravating factor outweighed all the mitigating factors that it had found, and accordingly the trial court again sentenced DiFrisco to death. We upheld that second capital sentence, 137 N.J. 434 (1994).\n\nDiFrisco was addicted to heroin and cocaine. He has two prior adult convictions, for burglary and for criminal trespass.\n\nMiguel Melendez Melendez came to the United States from Cuba in 1980, fleeing criminal convictions and military service there. He lived for a time with Lazaro Trimino. Trimino had contacts with Pedro Gerome, who offered Trimino $5000 and a vacation in Miami if Trimino killed or hired someone to kill a certain person in Jersey City. Trimino hired someone, and Gerome gave that person a gun, but the person was arrested for possessing the gun. Trimino then asked Melendez, who agreed to perform the killing as proof of his friendship with Trimino. Trimino instructed Melendez to wait in the victim's apartment building and, to confirm the victim's identity, to inquire about a car that the victim was selling.\n\nAs the victim returned to his apartment from shopping with his ten-year-old daughter, Melendez approached him and asked in Spanish about the car. The victim replied that he had already sold the car. Melendez then asked him for money. Replying that he had none, the victim walked away. The daughter then heard two shots and turned around to see her father fall to the ground. He was later pronounced dead. When police arrived at the scene, the daughter gave them a description of Melendez. A former political prisoner in Cuba and the head of a club of such former prisoners, the victim was survived by his wife and two daughters.\n\nThrough information provided by an informant, police were able to tape a telephone conversation in which Melendez admitted having been paid for killing someone in Jersey City. When arrested, Melendez waived his rights and gave a statement in which he acknowledged that he had committed the killing, after which he and Trimino had fled to Puerto Rico. Melendez and Trimino were charged with conspiracy to commit murder, purposeful and knowing murder, possession of a handgun for unlawful purposes, and unlawful possession of a handgun. A jury convicted Melendez on all counts. At the penalty trial, the jury found aggravating factor c(4)(d), murder for pecuniary gain. The defense asserted mitigating factors c(5)(a), extreme mental or emotional disturbance; c(5)(d), mental disease, defect, or intoxication; c(5)(g), assistance to the State in another prosecution; and c(5)(h), the catchall factor. The jury found only c(5)(g) and c(5)(h).\n\nBecause the jury was unable to agree on the weighing of the factors, the trial court sentenced Melendez to life with a thirty-year term of parole ineligibility, merged the conspiracy conviction into the murder conviction, gave Melendez a consecutive ten-year sentence with a three-and-one-half-year parole disqualifier for possession of a weapon for an unlawful purpose, and merged the unlawful-possession conviction into the possession-for-an-unlawful-purpose conviction.\n\nTrimino pleaded guilty to conspiracy to commit murder and received a ten-year term. Gerome has fled the country.\n\nMichael Rose Michael Rose met Zoran Cveticanin, who wanted his step-mother, Kathryn, killed to prevent her from inheriting the estate of her husband, the defendant's father, Vlado. Zoran also convinced fifteen-year-old Edwin Quinton to take part in the scheme. Quinton lived next to the Glassboro store operated by Vlado and Kathryn. Zoran had talked about having Kathryn killed since the day that he and Quinton had met a couple of months before.\n\nAbout a month before the murder, Zoran gave Quinton keys to the store and told Quinton that Rose was going to kill Kathryn. He asked Quinton to lock the door behind Rose and to act as a lookout. On the morning of July 20, 1983, Zoran gave Quinton sixty dollars and told him that the murder was to take place that day. Around noon, Zoran called Quinton from Philadelphia to say that Rose would arrive around 2:00 p.m. Rose met Quinton, told him that he would probably strangle Kathryn, and asked Quinton to enter the store to see if she was alone. Quinton did so, returned, and reported that Kathryn was indeed alone, after which Rose waited about five minutes and then entered the store. Quinton then went home.\n\nInside the store, Rose used two knives, a tackhammer, a stick, a hacksaw, and a sump pump to kill the pregnant Kathryn. He stabbed her eighty-three times and inflicted several bluntforce wounds. When Quinton returned to the store later, he saw the body lying in blood. Thereafter he returned the keys to Zoran. Several days later, Zoran and his sister gave Rose $540 of the promised $1000 and directed him to dispose of his bloodstained clothes.\n\nRose was arrested and charged with purposeful and knowing murder and with conspiracy to commit murder. At trial, he testified in his defense that he had gone to the store only to warn Kathryn that Zoran was going to kill her, whereupon she had attacked Rose with a knife. Rose claimed to have killed the victim in self defense in the course of the ensuing struggle. The State's expert stated that the bloodstains established that when struck, the victim had been backing away from her assailant and that thirty-six to thirty-eight of the eighty-three stab wounds were defensive wounds. A jury convicted Rose on both charges.\n\nAt the penalty trial, the State sought to prove aggravating factors c(4)(c), outrageously wanton or vile murder, and c(4)(d), murder for pecuniary gain. The defense urged mitigating factors c(5)(d), diminished capacity to appreciate wrongfulness; c(5)(e), duress; c(5)(f), no significant prior criminal record; c(5)(g), substantial assistance; and c(5)(h), the catchall factor. The penalty jury found aggravating factor c(4)(c) and mitigating factors c(5)(e), c(5)(f), c(5)(g), and c(5)(h). The verdict sheet wrongly required unanimity of mitigating factors. However, the jury was unable to reach a decision in the weighing process, so the trial court sentenced Rose to life with a thirty-year parole disqualifier for the murder conviction and a consecutive ten-year term with a five-year parole-ineligibility period for the conspiracy conviction.\n\nDefendant who has an I.Q. of sixty-eight, dropped out of school at the tenth grade to start working. At the time of the murder, he was collecting workers' compensation. He is separated from his common-law wife and has two children. He was a member of his church's choir. He claims to have developed memory loss due to alcohol and cocaine abuse. He also reports physical problems such as dizziness and nosebleeds from being assaulted in prison.\n\nZoran Cveticanin fled with his sister to the former Yugoslavia, where he was convicted of murder and sentenced to thirty years hard labor.\n\nv. Other Non-Robbery Pecuniary-Advantage Killers\n\nWalter Williams Williams was a thirty-six-year-old married policeman and Vietnam veteran. He lived with his wife and three daughters in a house owned by his wife and her mother.\n\nWhile on police duty at a high-school function in 1979, Williams met a young woman with whom he began an affair. After reading a book on poison, he purchased cyanide and hydrochloric acid in July 1984, falsely claiming that he would use them for official police business. Later, after falsifying a divorce decree and related papers, the defendant married his mistress on November 23, 1984. He began spending nights at the girl's parents' house, telling his actual wife that he was spending nights at a V.A. hospital to receive treatment for wartime exposure to Agent Orange. Mrs. Williams became suspicious that Williams was having an affair.\n\nOn January 31, 1985, Williams stopped by his wife's house. Having learned that the young woman had been in his car when Williams had been involved in an accident, Williams' wife asked him about it and indicated that they would discuss the matter later. Williams departed. After dinner that evening, Mrs. Williams passed out. Williams, on duty, came to the house and took her to the hospital. He did not appear upset. At the hospital, Mrs. Williams died of cyanide poisoning, the symptoms of which include headaches, an acrid taste in the mouth, difficulty breathing, and nausea.\n\nThe next morning Williams moved back into the house. He wanted Mrs. Williams' body cremated. Over his objections, the authorities performed an autopsy, which revealed a lethal dose of potassium cyanide in the victim's organs. On February 11, 1985, Williams learned that Mrs. Williams' will left her house to the daughters and only one dollar to him. One daughter heard him say that he \"knew that this would happen, that he wouldn't get anything.\" About two weeks later, another daughter found a second will that left the estate to Williams.\n\nOn March 7, 1985, Mrs. Williams' mother became ill. She too died after exhibiting the same symptoms as her daughter had displayed. The next day, Williams showed the second will to his sister-in-law and her husband. They called the police.\n\nOn July 18, 1985, the police arrested Williams. A search of the house revealed a bottle of potassium cyanide with Williams' handwriting on the label in the attic under some insulation. On May 6, 1986, he was charged with official misconduct, forgery, perjury, purposeful and knowing murder, and bigamy. The State served notice of aggravating factors c(4)(d), pecuniary motive, and c(4)(f), murder to escape detection. The defense argued mitigating factors c(5)(c), age; c(5)(f), no significant prior criminal history; and c(5)(h), the catchall factor. The jury found aggravating factor c(4)(f) and mitigating factors c(5)(f) and c(5)(h). It found the mitigating factors to be in equal balance with the aggravating factor, so the trial court sentenced Williams to a life term with a thirty-year parole bar for the murder, to a consecutive five-year term with a two-year parole bar for the official misconduct, to three concurrent five-year terms for the three forgery convictions, and to a concurrent six-month term for bigamy.\n\nWilliams is a Vietnam veteran who claims to have earned a masters degree in behavioral science, although the university from which he claims to have been graduated has no record of his enrollment. He has an associate's degree in criminal Justice. Williams has no history of drug or alcohol abuse and no prior criminal history. He was a trustee at his church. He claims to experience flashbacks relating to his service in Vietnam and to have received outpatient counseling through the Veterans' Administration.\n\nc. Analysis of Defendant's Culpability\n\nAs discussed above, supra at (slip op. at 50-51), when evaluating defendant's culpability, we consider a three-part model of criminal culpability that looks, first, to defendant's moral blameworthiness; second, to the degree of victimization; and third, to defendant's character. See Bey IV, supra, 137 N.J. at 366; Marshall II, supra, 130 N.J. at 155. To evaluate those three factors we weigh the elements set forth in the chart in Marshall II, supra, 130 N.J. at 155.\n\nApplication of the separate elements that bear on moral blameworthiness as identified in the Marshall chart, 130 N.J. at 155, leads to the Conclusion that Martini's moral blameworthiness is great. His motive was pecuniary, that is, defendant committed the crime simply to obtain first $100,000 and then $25,000 in ransom. His crime was meticulously planned and carefully premeditated. Defendant lacks any justification or excuse, such as provocation. The jury rejected his evidence of mental disease, defect, or disturbance, although defendant claims that that rejection was improper -- a contention that we do not accept.\n\nMartini's acute awareness of the effect of the crime on nondecedent victims was also clear. His attempt to obtain ransom depended on his ability to terrorize Flax's family, and he threatened to kill not only Irving Flax but Mrs. Flax as well. Only six jurors found his age, fifty-eight at the time of the crime, to be a mitigating factor. Finally, his role in planning the murder was a major one. Those considerations all establish defendant's moral blameworthiness, and their combined effect is extreme.\n\nThe second category to consider is the degree of victimization. The two components of victimization listed in Marshall II, supra, 130 N.J. at 155, are the violence and brutality of the murder and the injury to nondecedent victims. Defendant emphasizes that he did not physically torture his victim, and points out that the manner in which he murdered his victim led to a quick and painless death. He also argues that although he terrified Mrs. Flax, his calls were designed to give her hope that he would release her husband unharmed; moreover, he contends that for this Court to accord great weight to the effect of his actions on Flax's family violates our prohibition against victim-impact evidence. Although we recognize that Martini did not physically torture Flax and that other defendants have inflicted pain on their victims, we conclude nevertheless that the degree of victimization was substantial. Defendant's scheme depended on terror, a circumstance that can, like physical abuse, create a high degree of victimization. Moreover, because Martini's victimization of Mrs. Flax was essential to the completion of his crime, our consideration of her having been victimized does not run afoul of our prohibition against victim-impact evidence, which is designed to preclude the introduction of immaterial inflammatory testimony.\n\nThe third of the group of factors set out in Marshall II focuses on the character of the defendant. In that connection we note first that Martini has pleaded guilty to a double homicide in Arizona, is awaiting trial for murder in Pennsylvania, and is a suspect in four other killings. Because the jury heard neither of his prior record nor evidence of unrelated acts of violence, however, we do not consider that information. Second, although defendant confessed to the instant kidnapping and killing and told Afdahl to do the same, the trial court did not permit the jury to consider factor c(5)(g), which treats as a mitigating circumstance a defendant's substantial cooperation in the prosecution of another person for murder. Because we are free to go beyond a jury's Conclusion in respect of a mitigating factor, we have examined the evidence of Martini's cooperation with authorities and have concluded that although defendant did confess and hence \"cooperated\" with the authorities in one respect, his confession was designed to create the illusion that his actions had been a product of poor mental health. Third, his showing of remorse is limited to apologizing to his own family. Fourth, Martini was fifty-eight years old when he committed his crime in 1989; therefore his capacity for rehabilitation suffers obvious limitations.\n\nFinally, defendant argues that the jury failed to give proper credit to his mitigating evidence. Only six jurors found mitigating factor c(5)(c), age, and no juror found mitigating factor c(5)(d), diminished capacity to appreciate wrongfulness due to mental disease, defect, or intoxication. We can hardly conclude that the evidence compelled affirmative findings in respect of those factors, and we are not persuaded that we should substitute our own judgment for that of the jury.\n\nd. Comparison of Similar Cases to Defendant's Case\n\nDefendant argues that his case is not distinguishable from the other five non-stranger-kidnapping cases, each of which resulted in a life sentence. Defendant correctly notes that each victim in those cases suffered a high level of victimization. The State asserts that only Nelson Jalil's case involved extended premeditation and that juries in those other cases found mitigating circumstances not present in defendant's case.\n\nThe determinative factors in Martini's case are the pecuniary motive and the extreme victimization of defendant's family. Defendant's is the only kidnapping case involving a demand for ransom. Likewise, his is the only case in which terrorizing a family member was necessary for completion of the criminal scheme. We conclude that those elements create a different and greater kind of culpability than is present in the other non-stranger-kidnapping cases. Accordingly, we find no disproportionality in defendant's death sentence when compared to the life sentences imposed in the other non-stranger-kidnapping cases.\n\nIn that group of cases, defendant also offers for comparison James Koedatich, Richard Biegenwald, and Marko Bey. We do not include those defendants because each of their cases involved submission of aggravating factor c(4)(a), prior murder, to the jury. That factor creates one of the highest degrees of blameworthiness. See Bey IV, supra, 137 N.J. at 367; see also id. at 352 (discussing effect prior murder conviction). Accordingly, we cannot compare Martini, who at the time of his trial had pleaded guilty to the Arizona double homicide, and whose Pennsylvania murder charge remains unresolved, to defendants whose prior murders had been revealed to the jury.\n\nJamie Barone is the sole defendant in the stranger-kidnapping category. Defendant argues that he is less culpable than Barone because Barone, although protesting his innocence, failed to show any remorse. He also claims that Barone is more deathworthy because of the greater level of victimization present in his case. The State responds that Barone's crime was one of opportunity, not of premeditation, and that the case did not involve the same level of terror for the victim and her family as Martini's case did. The State tried Barone's case as a capital prosecution, but the jury was unable to reach a unanimous decision in the penalty phase. Because juries must consider each case individually, we cannot expect the same result even in similar cases. See Bey IV, supra, 137 N.J. at 369. Accordingly, even if those factually-dissimilar cases have similar levels of culpability, that circumstance does not require the Conclusion that the jury in defendant's case acted aberrantly in sentencing him to death.\n\nThe next group of cases contains the contract principals, Brand, the Engel brothers, and Marshall. Defendant characterizes the murders involved in their cases as \"fatal precondition\" murders, from which he argues that killings such as his can never be as blameworthy as a \"fatal precondition\" murder. We reject that argument. See Discussion supra at - (slip op. at 55-56). Of those cases, only Marshall received the death penalty. Brand did not have a pecuniary interest in his brother's death, but instead wanted to stop his brother's drug sales and abuse of his family. The State did not present Brand's case as a capital prosecution. The State sought the death penalty in its case against William and Herbert Engel, but the jury did not find beyond a reasonable doubt that the aggravating circumstances outweighed the mitigating circumstances. We cannot say that Martini's moral blameworthiness, egregiously accentuated by his ransom motive, is so much less than that of Brand or of the Engel brothers, whose murder of Xiomara stemmed from William's jealousy, as to render defendant's death sentence disproportionate. Likewise, his level of victimization -- terrorizing both Flax and Flax's family -- is no less than that of the defendants in the contract-principal cases. Martini therefore has failed to demonstrate that his character, when compared to that of other defendants in this group, warrants a finding that his sentence is disproportionate.\n\nIn comparing Martini's case to the remaining cases, which involve contract killing and other pecuniary motives, we also perceive no aberration in defendant's sentence. Burroughs did not kill solely out of a pecuniary motive and did not visit extensive victimization on Arthur Brand. Clausell did receive a capital sentence but that sentence was reversed for a Gerald error. On retrial, he was not sentenced capitally. DiFrisco received a death sentence that this Court reversed, and on trial was again sentenced capitally. The juries in both Melendez's and Rose's cases were unable to reach verdicts in the penalty phase. In the last pecuniary-advantage case, Williams, the jury found that the aggravating and mitigating factors weighed equally. In view of those cases, the imposition of the death penalty does not offend principles of proportionality, given the terrorizing of Flax and his family and Martini's ransom motive, Martini's moral blameworthiness, his degree of victimization, and his character. The comparison of defendant's case to similar cases under the traditional, precedent-seeking review reveals no basis on which to disturb defendant's sentence.\n\n3. Other Cases\n\nWe do not compare Martini to those defendants who committed contemporaneous sexual assaults, such as Carlos Vasquez or Jerome Dennis, or to defendants whose killings involved depravity of mind and mutilation, such as Nicholas Correa and Henry Micheliche. Cases of that kind are so dissimilar, both in their factual patterns and in their blameworthiness, that they do not offer any valuable insight into the proportionality of defendant's sentencing.\n\nFor like reasons, we reject Martini's comparison of his case to murders of multiple victims, to killings involving sexual assaults without kidnapping, to murders during robberies or burglaries, and to killings through torture. Again, those cases would yield little insight into the propriety of the jury's decision in Martini's case.\n\nIV\n\nOTHER ARGUMENTS\n\nDefendant argues that his death sentence is unconstitutional under both the federal and New Jersey Constitutions. First, he contends that because death penalties are generally not imposed for capital murder, this State's death-penalty law violates the Eighth and Fourteenth Amendments to the United States Constitution, and article one, paragraphs one and twelve of the New Jersey Constitution. He points out that the death-sentencing rate for all death-eligible cases is thirteen percent and the total death-sentencing rate at penalty trial is thirty percent, Martini Report tbls. 1, 2, and argues that those frequencies demonstrate that capital cases do not \"generally\" result in a death sentence, thus making death sentences imposed under our scheme comparatively excessive and violative of the federal and State Constitutions. We rejected those arguments in Marshall II, supra , 130 N.J. at 188-95, and continue to do so here. The low rates show a proper reservation of the death sentence for only the truly worst murderers. That phenomenon does not bespeak a constitutional violation. See id. at 192.\n\nSecond, defendant argues that statistically-significant disparities exist in the rates of death sentencing that depend on the race of the victim and on the race of the defendant. Those disparities, defendant claims, subject him to cruel and unusual punishment and deny him equal protection. Defendant relies on precisely the same arguments as were advanced on behalf of Marko Bey. We rejected them in Bey IV, supra, 137 N.J. at 388-96, as we do here.\n\nFinally, defendant argues that the data show geographic disparities in death-sentencing rates, which indicate that capital punishment is applied inconsistently and unfairly, in violation of the Eighth Amendment to the United States Constitution and of article one, paragraph twelve of the New Jersey Constitution. We rejected that argument in Bey, IV and in Marshall II, and do so here. See Bey IV, supra, 137 N.J. at 396; Marshall II, supra , 130 N.J. at 195-206.\n\nV\n\nConclusion\n\nNoting as we did in Bey IV, supra, 137 N.J. at 396-97, that the universe of cases is too small to support reliable statistical comparisons in many areas, we accept the limitations that the small universe places on proportionality review. However, both frequency review and precedent-seeking analysis support a finding of no disproportionality. Defendant, who bears the burden of proof in proportionality review, has demonstrated no aberration in the result of the penalty trial, nor has he shown the presence of impermissible factors. Accordingly, we conclude that his death sentence is not disproportionate.\n\nSentence affirmed.\n\nChief Justice Wilentz and Justices Pollock, O'Hern, Garibaldi, and Stein join in this opinion. Justice Handler has filed a separate Dissenting opinion.\n\nHANDLER, J., Dissenting.\n\nThe Court today seals the fate of this capital defendant. It determines that his death sentence is not disproportionate, and may be carried out. The looseness of the proportionality review that has led to a determination of such awesome finality demands the continued exposure of the fundamental flaws that beset our current system of death-sentence validation.\n\nOne of the most prominent defects in the Court's proportionality review is the continued use of reversed-death-sentences in the universe of comparable cases. The reversal of a death sentence robs it of reliability, disabling it as a measure of the deathworthiness of the sentenced defendant. Another major deficiency is the inconsistency and inherent subjectivity of the Court's techniques for determining proportionality -- frequency analysis, and precedent-seeking analysis. The Court persists in applying those methods without any clear standards or intelligible guidelines. As a result, its proportionality review lacks the analytical integrity necessary in the context of a life and death decision. Beyond those problems peculiar to proportionality review, there remains the great systemic flaw of our capital punishment regime, a regime founded on conflicting and contradictory principles and administered without any degree of consistency.\n\nThe deficiencies of design and application deprive proportionality review of whatever faint chance it might otherwise have had to provide constitutional legitimacy to the imposition of a death sentence. In short, as measured by notions of proportionality, the project of fairly and justly sentencing a defendant to death is doomed to failure. The Court's proportionality review has, despite good intentions and prodigious work, become so unprincipled that its result -- affirming a sentence of death -- is intolerable in a society committed to procedural fairness and due process.\n\nThis case accentuates all the fundamental difficulties of proportionality review. Defendant was indicted for the kidnapping and murder of a New Jersey businessman. The State prosecuted the case as a capital cause by serving notice that it intended to prove two aggravating factors. At the close of trial, the jury found defendant guilty on all counts of the indictment. The trial court sentenced defendant to death following the jury determination that both aggravating factors existed and outweighed any mitigating factors as found by six jurors. On appeal, this Court affirmed defendant's conviction and sentence. 131 N.J. 176 (1993). Defendant then requested proportionality review pursuant to N.J.S.A. 2C:11-3(e).\n\nThe Court acknowledges that this case, involving as it does a kidnapping for ransom, is highly unusual. The Court's method of proportionality review, problematic in other instances, breaks down in its application here.\n\nI\n\nThe purpose of proportionality review is to ensure that the death penalty is \"'imposed fairly, and with reasonable consistency.'\" State v. Marshall, 130 N.J. 109, 130 (1992) (Marshall II) (quoting Pulley v. Harris, 465 U.S. 37, 42-43, 104 S. Ct. 871, 875-76, 79 L. Ed. 2d 29, 35-36 (1984)). Ultimately, proportionality review aims to guarantee that a cognizable distinction exists between capitally-sentenced and life-sentenced defendants; to limit capital sentencing to the most aggravated cases; and to promote a rational, consistent, and fair application of the death sentence. Id. at 131; David C. Baldus, Death Penalty Proportionality Review Project Final Report to the New Jersey Supreme Court 24-25 (Sept. 24, 1991) (hereinafter Final Report). Proportionality review seeks to determine whether a defendant's death sentence fails to meet those goals and is, therefore, disproportionate. See N.J.S.A. 2C:11-3e. A capital sentence is disproportionate if other defendants with characteristics similar to those of the defendant under review generally receive sentences other than death for committing factually-similar crimes. State v. Bey, 137 N.J. 334, 343 (1994) (Bey IV).\n\nOur proportionality review evaluates the \"deathworthiness\" of a defendant, as measured by that defendant's \"blameworthiness.\" \"Blameworthiness\" is an elusive concept, but we nevertheless persist in using it because it encompasses both jury and prosecutorial decisions about the propriety of a death penalty in a particular case. Because the decisions of prosecutors, as well as juries, bear on deathworthiness, we use all death-eligible homicides, including those that prosecutors have chosen not to prosecute as capital crimes, in the comparison calculus with which we assess a defendant's deathworthiness and the proportionality of the death sentence.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Marshall II, supra, 130 N.J. at 137.\n\nThis Court has decided that reversed death sentences provide \"sufficiently-reliable information concerning the characteristics that prosecutors and juries consider important to warrant the inclusion of those cases in proportionality analysis\" -- as death-sentenced cases. Id. at 219-20. The Court's use of reversed death sentences as measures of deathworthiness is, analytically, illogical and treacherous. After all, the procedural rules that govern capital sentencing do not exist for their own sake. They exist because, in various significant ways, they attempt to ensure the rationality of the sentence. The failure to abide by those rules, then, fundamentally undercuts the reliability of the sentence. Recognizing that, the Court \"acknowledges,\" as surely it must, that a reversed death sentence is \"a less persuasive indicator of deathworthiness\" than an affirmed death sentence. Bey IV, supra, 137 N.J. at 348. The Court fails, however, to provide any cogent justification for using such death sentences at all in proportionality review. Moreover, the Court continues to leave us totally unenlightened as to how it discounts or accounts for the fact that a reversed death sentence is a \"less persuasive\" indicator of deathworthiness than an affirmed death sentence.\n\nThe Court's insistence on using reversed death sentences in the same way it uses validly-affirmed death sentences produces the anomaly that a reversed sentence, by definition too unreliable to carry out on the sentenced defendant, is yet reliable enough for the purpose of comparison with other capital sentences in proportionality review. The treachery in the Court's construct lies in the allowance of a reversed death sentence, which is never reimposed on the principal defendant, to be used collaterally to justify the death sentence of some other defendant. Bey IV, supra, 137 N.J. at 404 (Handler, J., Dissenting).\n\nThe wayward premise of the Court's decision to use reversed death sentences in proportionality review consists in the notion that a defendant's \"deathworthiness\" is somehow distinguishable from the final, legitimate verdict reached in his or her case. However, the only objective indicator that can establish \"deathworthiness\" is the imposition of a death sentence in strict conformance with the procedures set out to ensure fairness and accuracy in capital sentencing. Hence, the Court's assumption that a defendant's deathworthiness can be distinguished from his or her lawful sentence, is, I submit, illogical and unprincipled. I, therefore, strongly reaffirm my view that all reversed death cases should be excluded from the universe of cases used to assess deathworthiness and sentencing proportionality.\n\nThis Court has held that some errors requiring the reversal of death sentences negate their legality and, derivatively, derogate from their usefulness as markers of deathworthiness. These errors involve both procedural requirements and substantive principles. Both kinds of standards guide and inform the jury determination of deathworthiness. Errors implicating those standards include: (1) the failure to instruct the jury that the aggravating factors found must outweigh the mitigating factors beyond a reasonable doubt before a death sentence can be imposed; (2) an improper or misleading charge related to the c(4)(c) factor if that was the sole aggravating factor on which the State relied in its attempt to gain a death sentence; and (3) an erroneous charge to the jury that a mitigating factor must be found unanimously. See, e.g., State v. Clausell, 121 N.J. 298, 345-46 (1990) (requiring that juries be informed of legitimacy and acceptability of non-unanimous, non-death-deserving verdict at penalty trial); State v. Gerald, 113 N.J. 40, 85 (1988) (requiring that to be death-eligible, defendant must have intended to kill, not merely to have inflicted serious bodily injury); State v. Williams, 113 N.J. 393, 453-54 (1988) (reversing death sentence because prosecution relied on victim-impact evidence); State v. Bey, 112 N.J. 123, 162-77 (1988) (Bey II) (requiring reversal if Court incorrectly instructed jury concerning finding and weighing of mitigating factors); Ramseur, supra, 106 N.J. at 211 (narrowing grounds for c(4)(c) aggravating factor to infliction of severe suffering).\n\nIf a jury returns a sentence of death infected by such an error, then it defies reason to suggest that the verdict accurately, or even approximately, reflects community values about the deathworthiness of the defendant. Put differently, when a sentence of death is imposed without an adequate showing that it was reached by applying the procedural requirements or substantive standards that are essential to a sound, fair, and informed determination, in effect, no death-sentence verdict exists, and it is reckless to speculate about the verdict's reliability as a reflection of community values.\n\nThe Court's response to that criticism is unpersuasive. Ante at (slip op. at 17-20). It observes, for example, that in Bey IV the majority rejected defendant Bey's argument that certain reversed death sentence cases, Ramseur, Biegenwald, and Coyle, should be treated as life-sentenced cases because the errors that negated those death sentences related to burden of proof and the Gerald issue, which affected only the procedural fairness of the trial, not the substance of the crime, and, therefore, \"'did not necessarily bear on the jury's determination of deathworthiness.'\" Ibid. (quoting Bey IV, supra, 137 N.J. at 347). It \"continues to believe that the death sentences in cases overturned for procedural error are acceptably-reliable societal determinations of deathworthiness.\" Ibid.\n\nThe Court undervalues the significance of procedural requirements in the context of a capital prosecution and fails to understand the relationship between the procedural structure that frames and directs the jury's deliberative process and the substantive standards that govern its deliberations and inform its ultimate determination of deathworthiness. \"Death sentences are reversed,\" I submit, \"because at some point the carefully constructed environment of a capital-punishment prosecution has been contaminated, whether by procedural or substantive fault, thereby undermining the soundness and impugning the reliability of the jury's ultimate determination of deathworthiness.\" Bey IV, 137 N.J. at 405 (Handler, J., Dissenting); see also Sullivan v. Louisiana, U.S. , 113 S. Ct. 2078, 124 L. Ed. 2d 182 (1993) (reasoning that when court gives erroneous instruction on burden of proof, no verdict can be rendered consistent with the Sixth Amendment's \"right to trial by jury\").\n\nIn using a death sentence as the critical and definitive measure of deathworthiness, the Court also treats dismissively the fact that a reversed-death-sentenced case has not been retried as a capital case. Ante at (slip op. at 17-20) (\"The State's decision not to reprosecute a defendant capitally is not necessarily a reflection of that defendant's lack of deathworthiness.\"). It rationalizes that Conclusion by observing that the State's decision not to reprosecute a defendant capitally may itself be based on considerations such as the availability of witnesses or the amount of financial resources that the State is willing to commit to retrial, that, it claims, are unrelated to deathworthiness. Although this may be true in certain situations, this reasoning does not change the fact that a reversed death sentence not subsequently reimposed simply and legally does not exist as a valid death sentence. Cf. Special Master, Final Report at 61-62 (expressing opinion that some reversed death sentences might be salvageable for use in proportionality review especially if, on re-trial, another death sentence was imposed). The Court's position on that vital point bespeaks unseemly intransigence. It \"remains convinced that 'even reversed death sentences are sufficiently valid indicators' of 'the conscience of the community' to be used as death-sentenced cases,\" ante at (slip op. at 20) (quoting Bey IV, supra, 137 N.J. at 348-49), but concedes that its judgments have \"some degree of subjectivity,\" ante at (slip op. at 19) (citing Marshall II, supra, 130 N.J. at 120), and that \"our data are not scientifically infallible,\" ante at (slip op. at 19) (citing Bey IV, 137 N.J. at 348).\n\nAt the very least, the Court should impose a rebuttable presumption that reversed death sentences are invalid determinations of deathworthiness. The Special Master suggested that the Court \"examine the reason for a reversal . . . and evaluate, on a case by case basis, the likelihood that the error involved substantially influenced the jury's exercise of discretion\" or otherwise impugned the reliability of the original sentence. Final Report at 61. The Court should not create what amounts to a presumption that reversed death sentences validly indicate deathworthiness and should not require the defendant to overcome that presumption. Ante at (slip op. at 17-18).\n\nI must add, further, that the Court's use of reversed-death sentences to validate a defendant's death sentence in proportionality review is a matter of constitutional dimension. The Court professes to accept such sentences only when their \"reliability\" as indicators of deathworthiness is unquestioned. Both due-process considerations and the prohibition against cruel and unusual punishments, I think, interdict the use in our scheme of proportionality review of reversed death sentences that fail to meet a standard of \"sufficient reliability.\"\n\nIn other contexts, the Court has rightly understood that factors derogating from the reliability of a death sentence implicate the fundamental constitutional concerns for due process and for prohibiting cruel and unusual punishments. When \"reliability\" is the operative test for the satisfaction of a constitutional standard, it must be met. In Ramseur, supra, 106 N.J. at 316, the Court stressed the importance of the use of reliable information in the capital-sentencing system stating that \"the death penalty can be constitutionally imposed only if the procedure assures reliability in the determination that 'death is the appropriate punishment in a specific case.'\" (citations omitted). It has pointed out that when the c(4)(c) factor is the sole basis for the death sentence and is explained by an erroneous instruction, no reliable inference about deathworthiness in light of community values can be drawn. Ibid. The Court, in reversing the death sentence in State v. Biegenwald, 106 N.J. 13, 65-66 (1987) (Biegenwald II), similarly concluded that the erroneous instruction about the weighing of aggravating and mitigating circumstances undercuts the fundamental fairness of the entire proceeding. See Bey II, supra, 112 N.J. at 161 (1988); see also Mills v. Maryland, 486 U.S. 367, 108 S. Ct. 1860, 100 L. Ed. 2d 384 (1988) (ruling that death sentence must be reversed if jurors are not instructed that they must individually weigh mitigating factors even though they were not found unanimously); cf. Sullivan, supra, U.S. at , 113 S. Ct. at 2082, 124 L. Ed. 2d at 189-90 (holding that in criminal cases in which verdict was rendered without adequate showing that it had been reached beyond reasonable doubt as required by Sixth Amendment's \"right to a jury trial,\" no verdict existed on which to apply harmless-error analysis). In Caldwell v. Mississippi, 472 U.S. 320, 105 S. Ct. 2633, 86 L. Ed. 2d 231 (1985), the United States Supreme Court reversed a sentence of death because of a prosecutor's inaccurate statement to the jury that the ultimate responsibility for determining the appropriateness of death lay not with the jury, but with an appellate court. Justice Marshall noted that under the Eighth Amendment \"the limits that this Court has placed on the imposition of capital punishment are rooted in a concern that the sentencing process should facilitate the responsible and reliable exercise of sentencing discretion.\" Id. at 329, 108 S. Ct. at 2639, 86 L. Ed. 2d at 239. See Woodson v. North Carolina, 428 U.S. 280, 305, 96 S. Ct. 2978, 2991, 49 L. Ed. 2d 944, 961 (1976).\n\nThe constitutional requirement that a death sentence be \"sufficiently reliable\" applies as surely in proportionality review, in which a court determines whether the sentence can be validated and carried out, as when a jury makes the original determination of deathworthiness by imposing the death penalty. Thus, in its proportionality review of defendant's death sentence, the Court includes death sentences that were reversed for errors that significantly undermined the reliability of the verdicts as reflections of deathworthiness. Those errors, for example, related to aggravating and mitigating factors in the cases of Richard Biegenwald, Walter Gerald, Raymond Kise, James Koedatich, James Williams, James Zola, Bryan Coyle, and Walter Johnson, and to a reversed death sentence that was based on an erroneous c(4)(c) charge in the case of Walter Oglesby. The Court's use of reversed death sentences as reliable measures of deathworthiness is not a merely theoretical or academic exercise; it has a telling impact on the Court's assessment of this defendant's deathworthiness and on its final determination that his death sentence is proportional. Defendant is condemned by a proportionality review that uses as its primary feature comparison to seven other cases in which verdicts of death have been rejected by this Court as invalid and unreliable.\n\nThe inclusion of reversed death sentences in the comparison calculus falsely suggests that defendant's death sentence is proportional. The opposite is the truth. The Court's continued use of reversed death sentences dooms its proportionality review -- and dooms this defendant -- from the start. Because the Court persists in following a course that contradicts constitutional principles as well as basic precepts of capital-murder doctrine and common sense, I must strongly register my Dissent.\n\nII\n\nThe Court's proportionality review begins with a \"frequency analysis.\" By that analysis, the Court determines the frequency of imposition of death sentences in cases similar to that of the defendant. Frequency analysis has three methods of considering the defendant's sentence in light of other capital sentences: (1) general factual similarity; (2) similarity of aggravating and mitigating circumstances; and (3) general similarity in culpability. The thesis underlying the analysis is that \"'[a] death sentence is comparatively excessive if other defendants with similar characteristics generally receive sentences other than death for committing factually similar offenses.'\" Marshall II, supra, 130 N.J. at 153-54 (quoting Tichnell v. State, 468 A.2d 1, 17 n. 18 (Md. 1983)).\n\nImplicit in the thesis that underlies frequency analysis is the assumption that similar defendants committing similar crimes are equally blameworthy. In proportionality review, blameworthiness is the marker of deathworthiness. Hence, the determination of comparative blameworthiness is the mission of frequency review. Ante at (slip op. at 23).\n\nThe Court, however, undermines the ambition of frequency analysis before the analysis even begins, by declining to set any standard by which to distinguish a high- from a low- predicted frequency of death. Ante at (slip op. at 23-24). In the resulting analytical vacuum, the Court inserts its own preDisposition toward equalizing different levels or kinds of blameworthiness. As a consequence, it inevitably engages in a form of reasoning that amounts to little more than a selective and convenient rationalization for proportionality. Its application of frequency analysis betrays a palpable bias in favor of the proportionality of a death sentence.\n\nThe Court defends its refusal to set numerical standards by commenting on the \"inherent failure\" of such rigid numerical standards to \"distinguish between defendants.\" Ante at (slip op. at 26). I do not dispute that the establishment of a clear standard can, with regard to cases very near its threshold, produce arbitrary results. I am convinced, though, that the establishment of some numerical standard for the sake of guidance would substantially improve our proportionality review. With such a standard, we could confine arbitrariness to the cases at the boundary. Under proportionality review as now conducted, arbitrariness runs rampant, for the Court has given no hint as to what degree of infrequency of imposition of the death penalty might constitute disproportionality.\n\nThe central weakness of the first of the three methods of frequency analysis, general factual similarity, is exposed by the Court's exposition. In this case, that method fails because the salient factors of defendant's case are not similar to those of other cases, and so his case does not fall in any of the existing categories. Defendant's is the \"only kidnap for ransom case\" in the proportionality universe. Lacking any established category that captures the critical facts of defendant's case, the Court chooses to place defendant in the category of \"kidnapping/abduction with particular violence or terror.\" Ante at (slip op. at 28).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e It also compares defendant's case with other pecuniary-motive cases involving kidnapping, most of which were categorized as robbery with particular violence or terror.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Still, even accepting this ad hoc categorization as the best that can be done under the circumstances, the frequency with which the death penalty is imposed is very low.\n\nWhen a hybrid category -- cases of premeditated robbery/kidnapping with pecuniary motive, deception/entrapment, and a defenseless victim -- is used, the frequency increases to .66. However, that result is problematic. When the data base is corrected and new cases are added, that frequency drops to .20 with defendant and, indeed, drops away almost entirely to .11, if defendant's own case is removed. In all, the salient factors test indicates that, as a general matter, the frequency of death sentences for crimes with facts purportedly similar to defendant's is extremely low.\n\nThe second of the three methods of frequency analysis, similarity of aggravating and mitigating circumstances, also supports a finding of disproportionality in this case. If one begins the analysis by looking simply at cases in which two aggravating factors and two mitigating factors were found, the frequency is 13/48 or .27 (12/47 or .25 without defendant) of the broad death-eligible universe. In cases in which the c(4)(f) factor (avoiding detection) is found as one of two aggravating circumstances and two mitigating circumstances were also found, the frequency rate is 5/18 or .27 (4/17 or .23 without defendant). Also, when the c(4)(g) factor (contemporaneous felony) is found as one of two aggravating circumstances and two mitigating factors were also found, the rate is 8/41 or .19 (7/40 or .17 without defendant). Further, within only the restricted penalty-trial universe, the frequency for cases involving two aggravating and two mitigating factors is 13/23 or .57 (12/22 or .54 without defendant).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nIn short, the frequency analysis of the number of aggravating and mitigating factors reveals that as a general matter, defendant has a low predicted frequency of receiving a death sentence. Neither of the relevant aggravating factors has a high frequency of death imposition, and the mitigating factor of age has, in the opinion of the Special Master, a pronounced mitigating effect.\n\nThe third and final statistical methodology employed by the Court to assess the relative frequency with which a death sentence is imposed among a group of similar cases is the so -called \"index of outcomes\" test. This test purportedly groups cases according to their common degree of culpability. The Court, relying the AOC's analysis, draws on a broad set of factors, some statutory and some non-statutory, thought to be probative of culpability, to determine patterns of capital sentencing. The test operates on the common-sense assumption that more culpable defendants have a greater probability of receiving the death penalty. Ante at (slip. op. at 41).\n\nUsing the broadest possible test -- all death eligible cases with statutory and non-statutory variables -- defendant is assigned a rank of .05 with a margin of error having a lower limit of .01 and an upper limit of .30. That places defendant in culpability level 1, which has a predicted frequency of death-sentence imposition of .04 (10/248). Among the twenty cases nearest to defendant's on the index, none resulted in a death sentence.\n\nIn the broad death-eligible universe using a statutory factors only, defendant is assigned a rank of .08 with a margin of error having a lower limit of .02 and an upper limit of .27. Once again, defendant falls into culpability level 1 with a predicted frequency of death imposition of .05 (12/249). There is only one death sentence among the twenty cases nearest to defendant.\n\nFurther, restricting the universe of cases to penalty-trial cases and using only statutory factors as variables, contrary to expectation, one does not dramatically increase defendant's rank. In that narrower universe, defendant has a culpability rank of .15 with a margin of error having a lower limit of .03 and an upper limit of .48. Defendant remains in culpability level 1, which has a predicted frequency of death-sentence imposition of .05 (3/58).\n\nA significant increase in frequency occurs only by using statutory and non-statutory factors within the narrow universe of penalty-trial cases. In that scheme, defendant is assigned a culpability ranking of .88 with a margin of error having a lower limit of .25 and an upper limit of .99, creating a probability range of seventy-four percent. That places defendant in culpability level 5, which has a predicted frequency of death-sentence imposition of .88 (23/26). Thus, by changing the focus of analysis, the Court can reassign defendant to a ranking where the death penalty is almost uniformly imposed.\n\nThe Court does not flinch in the face of its legerdemain, reassigning defendant from culpability level 1 to culpability level 5 by the device of adjusting the parameters of the analysis. The Court explains its preference for these parameters by stating that the several tables that yield extremely low percentages do not include non-statutory factors and therefore do not account for the salient factors of defendant's crime (ransom and extreme terrorizing of the victim's family), and, also, that defendant is unique in our case universe. Ante at (slip op. at 45). The assertion that the gravamen of defendant's crime requires consideration of non-statutory aggravating factors would fit more appropriately in the Court's precedent-seeking review, for that assertion espouses the kind of subjective evaluation not susceptible to the statistical techniques of frequency review. Even accepting the Court's tactic, however, one finds that the index of outcome results are higher for Bey, see Bey IV, supra, 137 N.J. at 362-65, and slightly higher for Marshall, see Marshall II, supra, 131 N.J. 172-74. Yet the Court does not feel that those results indicate disproportionality or suggest any aberration in defendant's case with respect to the index-of-outcomes test. Ante at (slip op. at 45).\n\nThe Court's analysis and reasoning under the test, using only penalty-trial cases, is expedient and result-driven. The disparity between the results in Table 12, which yield a very high predicted frequency of death sentence, and the results obtained in Tables 13, 15c, and 15b, namely, a very low predicted frequency of death sentence, demonstrates the basic instability in the statistical framework. I cannot overemphasize that Table 12 represents an analysis that is confined to the penalty-trial universe, the results of which, the Court has already conceded, should be used for \"informational purposes only\" and not as a basic prop for proportionality. Marshall II, supra, 130 N.J. at 168. As was the situation in Bey IV and in Marshall II, the small sample size of cases with similar levels of blameworthiness prevents us from giving great weight to those results. See Bey IV, supra, 137 N.J. at 364; Marshall II, 130 N.J. at 173-74. In addition, Table 12 represents the least-reliable model in that it runs the most variables against the fewest number of cases, and therefore has a huge margin of error associated with defendant's ranking on the culpability index.\n\nThe Court proposes to overcome the index-of-outcome test's low culpability finding by insisting that defendant's case is \"unique in our case universe.\" Ante at (slip op. at 45). If so, the project of frequency review becomes a sham, because frequency review assumes the existence of similar cases, and proceeds to consider whether, in light of the sentences imposed in those similar cases, a defendant's sentence is disproportionate. If, however, the similarity of other cases is ignored or discounted and defendant's case is deemed unique, other cases are rendered automatically dissimilar and become useless for comparison, and frequency review falters. By declaring the case itself unique, the Court deserts the basic thesis of frequency review and should not pretend that a death sentence's proportionality can be established by such a review.\n\nThe Court, through a convoluted analysis, finds that compared to other penalty-trial cases, defendant's case shows predicted probabilities of receiving the death sentence of thirty-three percent under the salient-factors test; fifty-seven percent under the numerical-preponderance test; and, under the index-of-outcomes test, five percent considering only statutory factors and eighty-eight percent considering both statutory and non-statutory factors.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Ante at (slip op. at 46, referring to the Martini Report tbl. 19). The Court concludes that \"those results produce no showing of randomness or aberration\" and that defendant has not produced \"reliable evidence of disproportionality,\" and hence does not find that for cases such as his a sentence other \"than death is generally imposed.\" Ibid.\n\nIn actuality, compared to all death-eligible cases, defendant has a predicted salient-factors-test probability of seventeen percent; a numerical-preponderance-test probability of twenty-seven percent; and index-of-outcomes-test probabilities of five percent, considering statutory factors only, and four percent, considering both statutory and non-statutory factors. Martini Report tbl. 20. Thus, as a general matter, defendant's predicted frequency of death sentence imposition hovers between .05 and .27. The Conclusion that must be drawn is that under all three statistical methodologies that constitute frequency analysis, defendant fails at the low to extremely-low end of the frequency scale. The Court sidesteps that damning result by observing that death sentencing is reserved for only \"the worst murderers.\" Ante at (slip op. at 38). Obviously, the Court sincerely but subjectively believes that defendant is one of those \"worst murderers,\" and, embracing that belief, effectively abandons principled proportionality review.\n\nThe Court's opinion only deepens and perpetuates the fundamental flaws in its proportionality review methodology. Although it has lately equivocated on the matter, the Court at first regarded the frequency approach as primary and the precedent-seeking approach as supplementary. Compare Marshall II, supra, 130 N.J. at 159 (making the intensity of the precedent-seeking review depend on the outcome of the frequency analysis) with Bey IV, supra, 137 N.J. at 350 (relying \"more heavily\" on precedent-seeking as long as the pool of cases remains small). In this opinion, though, we see the Court thoroughly deconstruct frequency review, characterizing its Conclusions throughout as statistically unreliable. See ante at , , , , (slip op. at 24-25, 29, 31, 32, 34). The Court does not explain how statistics so thoroughly discredited in the body of the analysis can, at its end, be characterized, particularly with respect to the salient-factors measure, as \"the most persuasive of the statistical measures [that] supports a finding of no disproportionality.\" Ante at (slip op. at 34).\n\nInevitably, a frequency analysis bereft of clear standards produces, in the hands of a Court determined to put the burden of proof on the defendant, a finding of proportionality. Bearing the burden of proof, and arguing to a Court that introduces extraneous, precedent-seeking-type considerations into its frequency review, no defendant could establish disproportionality. Proportionality is prescripted.\n\nThe Court insists that proportionality review does not validate a death sentence, but rather is merely \"a vehicle to ensure that the penalty-phase jury's decision is not insupportable.\" Ante at (slip op. at 12). To the extent that there is a distinction between ensuring that the sentence is supportable and ensuring that it is not insupportable, the Court identifies a genuine point of disagreement. More significant, though, is the fact that the Court does not even make proportionality review into \"a vehicle to ensure that the . . . decision is not insupportable.\" Rather, the Court allows a sentence that bears compelling indicators of disproportion to be carried out because, owing to the inadequacy of the data and of the techniques for conducting proportionality review, neither the State nor any defendant can positively prove or disprove disproportionality to the satisfaction of the Court. This combination of an insistence that defendant shoulder a rather formidable burden to prove disproportionality, with the circumstances of inadequate data and techniques, makes it bitterly ironic that the Court should say that \"being the first murderer in a category does not support a Conclusion of disproportionality.\" Ante at (slip op. at 30). Indeed, it does not; on the contrary, by the Court's method, being the first apparently guarantees the proportionality of the sentence.\n\nIII\n\nThe statistical aspect of proportionality review exemplified by frequency analysis is intended to serve as a point of departure from which the Court turns to a more traditional form of judicial review -- a case-by-case assessment of the relative deathworthiness of the defendant. Marshall II, supra, 130 N.J. 153. In contrast to the frequency approach, in which we look to groups of cases, the precedent-seeking approach considers each case individually. The Court explains:\n\nThrough this method we determine whether a defendant's criminal culpability exceeds that of similar life-sentenced defendants and whether it is equal to or greater than that of other death-sentenced defendants, such that the defendant's culpability justifies the capital sentence; or whether a defendant's culpability is more like that of similar life-sentenced defendants and less than that of death-sentenced defendants, such that the defendant's culpability requires a reduction of sentence to a life term.\n\n[Ante at (slip op. at 48).]\n\nAn appropriately critical view of the whole enterprise of precedent-seeking review begins by pointing out a certain conceptual vagueness in the method itself. In introducing its review, the Court writes:\n\nWe note, as we did in Bey IV, supra, that even closely-similar cases do not require identical verdicts to be proportionate, in light of the different defendants, juries, facts, and legal issues involved.\n\n[Ante at (slip op. at 54).]\n\nThe Court's statement exemplifies both the irrationality of proportionality review and the means by which it conceals that irrationality.\n\nFirst, one notices how the statement conceals. The notion that closely similar cases do not require identical verdicts at first hardly offends, because although \"closely similar,\" the cases are of course different and so can hardly claim to warrant \"identical\" treatment. The problem, though, is that the cases that the Court dismisses as merely not \"identical\" fill the chasm between life and death. Recasting the Court's statement in plain terms, one discovers that the Court allows that from cases that do not differ much or are \"closely-similar\" one defendant can get death and another life.\n\nIf it believes that literally, the Court comes close to accepting arbitrariness, insofar as it would seem the very mark of arbitrariness if two closely-similar cases can produce two such starkly different verdicts. Because the Court does not want to abide arbitrariness, it adds the qualification quoted above: \"in light of the different defendants, juries, facts, and legal issues involved.\" Ibid. The Court explains that \"because juries must consider each case individually, we cannot expect the same result even in similar cases,\" ante at (slip op. at 95) (citing Bey IV, supra, 137 N.J. at 369). Accordingly, even if those factually-dissimilar cases have similar levels of culpability, that circumstance does not require, according to the Court, the Conclusion that the jury in defendant's case acted aberrantly in sentencing him to death. Id. at 95.\n\nThe rub is that once we admit the uniqueness of every case, precedent-seeking review becomes unmanageable. Contending with the unmanageable, the Court in this case is forced to make subjective and arbitrary decisions at each step of its analysis. For example, the Court rejects without good reason defendant's two suggested generalized features that help identify similar culpability. The first of these involves the \"number of victims.\" Can one seriously question that killers of more than one person are more culpable, other things being equal, than killers of only one? The Court evades the obvious, direct answer to that question by answering a different question:\n\nWe cannot say that a murderer who kills one person through torture is necessarily less culpable than a murderer who kills more than one person quickly.\n\n[Ante at (slip op. at 56-57).]\n\nThe Court is correct, but misses the point. In effect, the Court confuses two distinct steps in the analysis. First, there is a relevance step, in which the Court should distinguish those factors that bear on culpability from those factors that do not. Second, after identifying the factors that bear on culpability, there follows a significance step, in which the Court considers the significance or probative weight of each factor in the particular case. In this case, however, the Court condenses the two steps into one. The result of this condensation is a test for relevance that no factor can ever meet, because no factor can, by its mere absence, render any defendant \"necessarily less culpable\" than a defendant who has that factor. The point becomes clear if one substitutes the factor of pecuniary gain for the multiple victim factor. Applying the Court's test, we must exclude as irrelevant the pecuniary gain factor because one cannot say that \"a murderer who kills [without pecuniary motive but] through torture is necessarily less culpable than a murderer who kills [for pecuniary gain] quickly.\"\n\nI do not suggest that the Court in fact reject as irrelevant a comparison based on pecuniary gain. Rather, I find deficient the Court's test of the relevance of factors. In order to decide whether some suggested factor warrants consideration, we must first consider whether that factor as such bears on culpability. That analysis is undertaken by temporarily holding other things equal, enabling the Court to distinguish those factors, such as pecuniary motive, number of victims, and torture, that do bear on culpability, from those, such as for example the race of the victim, that do not bear on culpability. The Court, however, merges these steps without taking the trouble first to identify the multiple-victim factor as relevant to culpability, and then to explain what weight or significance should be accorded that factor in assessing culpability. Thus, the Court recognizes that \"the number of victims obviously affects blameworthiness,\" and, at the same time, concludes that it \"is an extremely important component of it.\" Ante at (slip op. at 49). The Court fails, however, separately to consider or elaborate on the weight or significance of the \"obvious effect\" that this factor has in assessing culpability, and almost glibly, \"rejects . . . defendant's arguments that one who purposefully and knowingly murders a single victim is less deathworthy than one who murders more than one victim.\" Ante at (slip op. at 56). Hence, without any acknowledgement that a factor, such as number of victims, is directly relevant to culpability and without an explanation of its significance, the Court's Conclusion as to defendant's deathworthiness remains imprinted with its own subjective and intuitive assessment of comparative culpability.\n\nIt is possible, but hardly edifying or productive, to engage the Court in a debate about the significance of the particular comparison cases in assessing the proportionality of defendant's sentence. Thus, against the Court's selection of and emphasis on the features surrounding those with sentences of death, one could oppose the various heinous features of the crimes of those defendants in the comparison group who were not sentenced to death. Because defendant is the first ransom killer in the universe, one who regards that crime as uniquely terrible can easily declare that defendant is the worst of his comparison group, and hence deserving of death. But how does the Court know that defendant's crime was worse than Mayron's heinous murder, or those of many others in the group?\n\nOne can find horrible features in many of the cases, and this fact should require the Court to explain how it knows that the brand of suffering inflicted by defendant is indeed worse. Objective standards by which to measure the gravity of different varieties of suffering are hard to find. Perhaps we ought to look to the Legislature for guidance. When we do so, we find that the Legislature has decided which cases are worst, by turning their particular features into aggravating factors. Until the Legislature makes the infliction of grave suffering on another besides the victim an aggravating factor, the Court ought to assume that that circumstance, although obviously relevant to culpability, is not uniquely worse than circumstances present in other cases. So long as the Court allows its unexplained intuitive moral response to the crime to dictate the outcome of its precedent-seeking review, our system of proportionality review does not live up even to the promise of Marshall II, supra. Instead, our review comes to resemble that species of proportionality review that entails no more than a recital of past cases and a bald Conclusion that the particular death sentence is proportionate. See, e.g., State v. Harris, 870 S. W. 2d 798, 819 (Mo. 1994) (en banc).\n\nRecognizing the special authority of objective factors, the Court professes to evaluate the comparison cases based only on objective criteria that were presented to the jury, citing Bey IV, supra, 137 N.J. at 368. Ante at (slip op. at 52-53). It attempts to consider non-statutory factors that are objective, rooted in traditional sentencing guidelines, clearly submitted to the jury, and likely to influence a jury's decision. Ibid.\n\nAccording to the Court, the relevant factors for determining the proportionality of defendant's death sentence are, first, the statutory factors of the contemporaneous felony of kidnapping and the murder to escape detection, and, second, the demand for ransom, which likens defendant's case to other murders that involve a pecuniary motive. Ante at (slip op. at 52). The Court recognizes that defendant's is the only kidnapping case involving a demand for ransom. Ante at (slip op. at 93-94). It chooses to consider those cases in the Martini Report in which the defendant's committed kidnapping with particular violence or terror, were contract principals, or were contract killers. It then undertakes to decide whether defendant's culpability is more like that of defendant's who received death sentences or of those who received life terms.\n\nThe Court further relies on the fact of the extreme victimization of defendant's family, a victimization made all the more responsible in the eyes of the Court for having been necessary for completion of the criminal scheme. The Court concludes that those elements create a different and greater kind of culpability than is present in the other non-stranger-kidnapping cases, and accordingly, it finds no disproportionality in defendant's death sentence when compared to the life sentences imposed in the other non-stranger-kidnapping cases. Ibid.\n\nDespite its effort at objectivity, the Court's reasoning and Conclusion expose the pervasive subjectivity of its precedent-seeking analysis. An equally convincing case can be made with respect to many of the other defendants in the comparison group that their crimes were uniquely terrible. Consider, for example, the case of Jamie Barone, the sole defendant in the stranger-kidnapping category. One could readily conclude that defendant is less culpable than Barone because Barone, although protesting his innocence, failed to show any remorse. Further, Barone could be considered more blameworthy because of the greater level of victimization present in his case. Although the State tried Barone's case as a capital prosecution, the jury was unable to reach a unanimous decision in the penalty phase.\n\nSimilarly plausible, if not just as strong, arguments can be made for the view that other defendants in the comparison group exceed defendant in blameworthiness. For example, a murder that occurs when the victim's death is itself essential and central to the successful completion of a criminal scheme could readily be viewed as most culpable. Indeed, examining the comparison group using the distinction between such preplanned murders, referred to by defendant as \"fatal-precondition murders,\" and other murders, one finds a strong correlation between death sentences and such fatal precondition murders. Thus, among the fatal-precondition murderers are Robert O. Marshall (killed wife for insurance proceeds and received death sentence), Patrick Lanzel (killed two people to ensure receipt of inheritance and did not face penalty trial), Anthony DiFrisco (contract killer who received death sentence), and James Clausell (killed to impress organized crime figures and received death sentence, which was reversed, on remand received life sentence). Furthermore, if we compare defendant's case, in which the pecuniary motive was a central part of the crime, with approximately thirty-four others\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e involving a robbery or kidnapping for pecuniary gain and a premeditated, deliberate, execution-style killing, only two, Bobby Lee Brown and Jacinto Hightower, received death sentences. Moreover, five of those cases involved the murder of two people (John Allen, Bobby Lee Brown, Frank Masini, John Marsieno, and Ray Watson), which, as defendant argues, implies greater culpability than the murder of only one person. Additionally, as defendant points out, at least twelve of the non-death-sentenced defendants in the remaining group of twenty-nine cases inflicted extreme victimization sufficient to render them more culpable and deathworthy than he is.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nWithout explanation, the Court rejects the second of defendant's suggested generalized features: the notion that a murder essentially necessary to the accomplishment of another criminal act exceeds in culpability other murders. Without saying more, it simply does \"not accept the proposition that one who, with intent to kill, commits a crime such as robbery or rape is always less culpable than one who commits a 'fatal precondition' crime.\" Ante at (slip op. at 56). Once again, the Court evades the direct question, which asks only whether, other things being equal, a murder necessary to complete a criminal scheme is worse than other murders. There may not be any objectively justified answer to that question. However, the intuition that would find such a murder worse than others cannot be gainsaid, and the Court gives no objective reason for rejecting it out of hand.\n\nThese examples illustrate the kind of \"insoluble moral conundrums\" that precedent-seeking analysis presents. Marshall II, supra, 130 N.J. at 274 (Handler, J., Dissenting). Indeed, whether one is more culpable when engaging in a crime in which death is a necessary pre-condition, as argued by defendant, or in which death is only a highly-probable outcome calls for a moral judgment. Such moral judgments are endlessly debatable. Thus, it is reasonable to believe that the purposeful killing of two persons is more heinous that the killing of just one. It is also fair to consider that defendant's crime did not include the kind of sadistic torture and depravity that surrounds so many murders in the death-eligible universe. Indeed, the Court's own moral compass has shifted in these cases, seeming most impressed in Marshall II by the culpability attached to killing for money, 130 N.J. at 166-167, and in Bey IV by the combination of sexual assault and murder. 137 N.J. at 367.\n\nMarshall II requires that when subjective value judgments are made, the Court make those judgments \"explicit so they can be analyzed and tested against whatever objective measurements are applicable.\" Id. at 120. The Court must have a coherent theory of what makes one case more deathworthy than another. It is not enough simply to say that the Court merely assesses the reasonability of a jury's determination when in fact it only speculates about a possible reason to support the jury's determination and makes its own subjective judgment of the moral significance of that reason. In proportionality review, the Court professes to review the determination of deathworthiness made by a jury to see if that determination is aberrant. Concededly, that process of review will involve some level of second-guessing. As Marshall II noted, a \"value judgment is built into practically every measurement of proportionality.\" Id. at 119. If, in reality, the Court is making its own judgment of deathworthiness, that value-laden judgment must be made explicit and must be given the force of precedent if this aspect of proportionality review is ever to be fair, consistent, and intelligible. The Court's precedent-seeking analysis in this case falls woefully short.\n\nIV\n\nThe Court, I firmly believe and emphatically urge, must recast its proportionality review of death sentences. As I noted with respect to the defendant in Bey IV, falling, as this defendant does, in the low range of predicted frequencies of death sentence imposition makes him peculiarly vulnerable to the ad hoc character of this Court's frequency analysis. 137 N.J. at 409 (Handler, J., Dissenting). The Court's analytical failure with respect to frequency analysis serves only further to devalue the already scant protections defendant is afforded by frequency analysis. Although originally designed as the more objective of the two methods that make up proportionality review, frequency analysis as applied by the Court does little more than set the stage for whatever subjective determinations or moral judgments might be made under the precedent-seeking approach. Ibid.\n\nOne cannot escape the vagueness of the Court's explication of the interaction of frequency analysis and precedent-seeking review. The Court says simply that \"We * * * compare the results of the two analyses to ensure that our proportionality review is reliable.\" Ante at (slip op. at 21). In past cases, it has said that a finding of borderline proportionality under the frequency approach will require a heightened scrutiny of the results of the other approach. Marshall II further suggests that the value determinations made at the precedent-seeking stage should be \"analyzed and tested\" by the \"objective\" criteria that are available. 130 N.J. at 120. That implies that some degree of commensurability should exist between the two approaches. With both Marshall and Bey, at least arguably, some commensurability was present between the statistical analysis and the precedent-seeking analysis. That analytical luxury is not available in this case. Here, the ambiguity of the relationship of the approaches confounds the Court's determination of proportionality.\n\nThe Court's opinion serves as a call for the re-examination and reconstruction of proportionality review. It demonstrates that precedent-seeking review and frequency analysis coexist in a muddled relationship characterized by the worst kind of circular reasoning. If these analytical tools are individually imprecise, it is unclear how the Court expects two such tools in combination to produce a mechanism that serves reliably to prevent arbitrariness in death sentencing.\n\nThe errors that infect the Court's proportionality review are symptoms of the fundamental incoherence of our capital murder jurisprudence. The Court's continued uncritical use of reversed death sentences as a measure of deathworthiness is an irrationality of the first order. The Court's application of frequency analysis is driven by no more than intellectual convenience and institutional expedience, with little care given to distinguish a high from a low frequency and with lax attention to its functional relationship to precedent-seeking review. Lacking a workable methodology, the Court over relies on a precedent-seeking analysis that is riddled with subjectivity and moral judgments.\n\nToday's decision serves as further confirmation of the failure of our experiment with capital punishment. The Court's early belief that it could fashion a constitutionally-legitimate process for imposing the death penalty, see Ramseur, supra, 106 N.J. at 331 (\"How we will resolve this paradox remains as yet fully unrevealed to us. We shall continue to labor on the process.\"), has foundered on yet another rock -- proportionality review. The inconsistency, subjectivity, and moralizing evident in today's decision are the inevitable products of a futile endeavor: the quest to devise and to apply a standard of due-process protection commensurate with the gravity of a death sentence. We noted in Ramseur that proportionality review was to assist the Court in ensuring that \"'we have designed procedures [that] are appropriate to the decision between life and death.'\" 106 N.J. at 326 (quoting Pulley, supra, 465 U.S. at 67-68, 104 U.S. Ct. at 888-89, 79 L. Ed. 2d at 52). The signal failure of proportionality review as designed and applied by this Court is now manifest. I think it also evident that the Court must either reject its effort to carry out capital punishment or accommodate itself to the juridical brutality of imposing death without due-process protections commensurate to its awesome finality. See Callins v. Collins, U.S. , 114 S. Ct. 1127, 1129, 127 L. Ed. 2d 435, 438 (1994) (Blackmun, J., Dissenting).\n\nWe are constrained in capital cases to concentrate unremittant attention and expend enormous public resources on persons who deserve no sympathy whatsoever. Sympathy has nothing to do with our judicial duty; our common humanity, however, has everything to do with it. If we allow death to be imposed without the full measure of constitutional protection and defend endlessly the legitimacy of what we do, we invite only disrespect for the law. Bey IV, supra, 137 N.J. at 429 (Handler, J., Dissenting) (citing John C. Jeffries, Jr., Justice Lewis F. Powell, Jr., 452 (1994)). Surely the time has come for the Court to concede that no death sentence can be validated under a process of review that is extraordinarily vague, rife with contradictions, wildly inconsistent, and inextricably mired in subjective valuations and intuitive moral judgments.\n\n\u003cspan class=\"fn\"\u003e1. Prior to this Court's decision in Marshall II, the Legislature amended the Capital Punishment Act to provide that only \"similar cases in which a sentence of death has been imposed\" would constitute the universe of comparable cases for purposes of proportionality review. L. 1992, c. 5 (effective May 12, 1992) (now codified at N.J.S.A. 2c:11-3(e)). In Bey IV, I expressed the view that the amendment reducing the universe of comparable cases for proportionality review would not survive a constitutional test. 137 N.J. at 402 n.1 (Handler, J., Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The death-sentence frequency in category H(2) (Kidnapping/abduction with particular violence), including the defendant, is 1/7 or .17 If the defendant is removed, the frequency is zero, 0/7 or .00 Of the three cases out of seven that went to penalty trial, 1/3 or .33 received death. Yet again, if defendant is removed the frequency is again zero, 0/3 or .00.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In the E(2) category of robbery with particular violence, only two of twenty-one cases in the death-eligible universe received the death penalty, 2/21 or .10 (not including defendant). If Raymond Kise's case is excluded, see, supra at (slip op. at 13), then the frequency drops to 1/20 or .05. Of those cases that went to penalty trial, 2/7 or .29 received the death penalty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. If two reversed death sentences are changed to life (Lodato and Ramseur) and two death sentences are eliminated because based on \"deliberative errors\" (Biegenwald 1A and James Zola 1A), the overall frequency reported in Table 9 drops to 9/46 or .19 (8/45 or .17 without defendant). Applying the alternative assumptions in relation to the analysis of the c(4)(g) factor -- changing one death sentence to life (Lodato) and deleting one case (Zola) -- results in a new frequency of 6/40 or .15 (5/39 or .13 without defendant). Applying the alternative assumption to the c(4)(f) factor does not require any changes in cases, and thus the numbers remain the same.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. As the Court concedes, the rate of penalty trials in death-eligible cases and the rate of death sentencing for cases that advanced to a penalty trial are both fairly low -- forty-two percent (125/298) and thirty percent (38/125) respectively. Martini Report tbls. 2, 3. Ante at (slip op. at 24). That yields a total death-sentencing rate of thirteen percent (38/298). It masks this problem by stating \"we are looking for a potential aberration, not a perfect comparison to all other cases,\" observing further, 'Not every statistical disparity establishes disproportionality.'\" (quoting Bey IV, supra, 137 N.J. at 352. Ante at (slip op. at 24).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The 34 cases are: (1) John Allen; (2) Jamie Barone; (3) Shawn Jackson; (4) Richard Reddon; (5) David Mark Russo; (6) Terence Robert Scales; (7) Howard Thompson; (8) Joseph Armstrong; (9) Anthony Carrozza; (10) Dwayne Caviness; (11) Frank Masini; (12) John Marsieno; (13) Ira Musgrove; (14) Corey Washington; (15) George Lazorisak; (16) Matthew Ploppert; (17) Rafael Slaughter; (18) Roy Watson; (19) Bobby Lee Brown; (20) Jacinto Hightower; (21) Benjamin Balisonomo; (22) Craig Hart; (23) Hashona Clark; (24) Carl Culley; (25) Michael Darby; (26) Marvin James; (27) Bruce King; (28) William McCray; (29) Daniel Nicini; (30) Carl Norman; (31) Kevin Smith; (32) Quincey Spruell; (33) Stanley Tucker; and (34) Richard Cain.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The twelve are: (1) Jackson; (2) Scales; (3) Thompson; (4) Carrozza; (5) Caviness; (6) Musgrove; (7) Ploppert; (8) Darby; (9) Norman; (10) Smith; (11) Tucker; and (12) Cain.\u003c/span\u003e\n\n",
    "body_length": 193936,
    "citedas": [
      "139 N.J. 3",
      "651 A.2d 949"
    ],
    "attorneys": "For appellant: Mark H. Friedman and William B. Smith, Assistant Deputy Public Defenders, argued the cause (Zulima V. Farber, Public Defender, attorney). For respondent: Craig V. Zwillman, Deputy Attorney General, argued the cause (Deborah T. Poritz, Attorney General of New Jersey, attorney).",
    "category": [
      "243",
      "36",
      "78",
      "75"
    ],
    "judges": "Chief Justice Wilentz and Justices Pollock, O'Hern, Garibaldi, and Stein join in this opinion. Justice Handler has filed a separate Dissenting opinion.",
    "citation_count": 28
  }
}
