{
  "id": "aIBxGpQBep42eRA968V6",
  "document": {
    "title": "Davis v. State",
    "full_title": "Nicholas Alexander DAVIS v. The STATE of Oklahoma",
    "jurisdiction": "Court of Criminal Appeals of Oklahoma",
    "date": "2011-12-12T00:00:00+0000",
    "docket": "No. D-2007-891",
    "body": "OPINION LUMPKIN, Judge. T1 Appellant Nicholas Alexander Davis was tried by jury and convicted of First Degree Malice Murder (Count I) @1 0.8. 2001, § 701.7(A), two counts of Shooting with Intent to Kill After Former Conviction of Two or More Felonies (Counts II and III), (21 0.98.2001, § 652), and Felonious Possession of a Loaded Firearm, After Former Conviction of a Felony, (Count IV) (21 0.8. 2001, § 1283), Case No. CF-2004-347, in the District Court of Oklahoma County. In Count I, the jury found the presence of three aggravating circumstances: 1) that the defendant knowingly created a great risk of death to more than one person, 2) the murder was committed by a person while serving a sentence of imprisonment on conviction for a felony, and 8) the existence of a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society, and set punishment at death. In Counts II and III, the shootings of Tia Green and Chinetta Hooks, respectively, the jury recommended prison sentences of forty-five (45) years and sixty-five (65) years respectively. In Count IV, the jury recommended a sentence of twenty-five (25) years imprisonment. The trial judge sentenced Appellant in accordance with the jury's determination and ordered all sentences to run concurrently. Appellant now appeals his convictions and sentences.1 T2 On January 15, 2004, at approximately 10:30 p.m., Tia Green picked up her sister, Chinetta Hooks, from work and took her home. Hooks, her husband and four children, all under the age of ten, lived in Apartment 1111 in the Falls Creek Apartments in Oklahoma City. Seventeen year old, Marcus Smith, Hooks' brother-in-law, had been watching the children while Hooks and her *98husband worked. When Green and Hooks arrived at the apartment, the children had made a pallet in the living room intending to sleep there all night. Hooks rejected the idea and sent the children to bed. She, Green and Smith then visited for a while. T3 Shortly after 11:00 p.m., there was a knock on the front door. Smith went to the front door and tried to look out of the peephole. However, the person on the other side had put their thumb over it,. The trio inside the apartment repeatedly asked who was at the door but received no response. Thinking it might be his brother, Smith slightly opened the door. Appellant, clad completely in black clothing, forced his way into the apartment with a gun in his hand. He shut the front door behind him and locked it. Appellant was Green's former boyfriend. She had only recently ended a turbulent relationship with him. When Appellant entered the apartment, he pointed the gun at Smith as Smith put his hands in the air and backed up. Green and Hooks remained seated on the sofa. Smith asked Appellant, \"what's going on\" and \"why are you doing this, man?\" Appellant offered no reply. Green also asked Appellant what he was doing. Appellant initially gave no response, but eventually looked at Green and said, \"you hurt me for the last time.\" Appellant then lowered the gun to his side. Green reached for her cell phone but Appellant told her, \"you bet not touch that phone.\" Green and Hooks then started sereaming for Appellant not to shoot. Appellant responded by raising his gun, pointing it at Smith, then lowering the gun. Green pleaded with Appellant to go outside with her and talk things over. Appellant's response was to raise the gun a third time to Smith's head and fire. {4 After the first shot, Green ran into the nearby bathroom. She locked the door and attempted to call the police. Unable to get her call to go through, she phoned another sister, told her Appellant had shot her, and directed her to call the police. Appellant followed Green to the bathroom, kicking at the door and shouting at her to open the door. 5 Meanwhile, intending to call the police, Hooks had run into the kitchen upon hearing the first gunshot. She felt a shot go through her leg before falling to the floor. She heard a total of nine gunshots. The children, upon hearing the gunshots, ran to the kitchen to find their mother on the floor in a pool of blood. When they began screaming that their mother was going to die, Hooks told them to go to the neighbor's apartment. Still holding the telephone, she dialed 911, said she had been shot and then lost consciousness. T6 Green was still hiding in the bathroom when she heard the children run down the hallway toward the kitchen. As Appellant was no longer kicking the door, Green left the bathroom and sat with her sister until police arrived. Oklahoma City Police Officer Matthew Reed responded to the 911 call and was met at the apartment complex gate by Hooks' children. Before being taken to the hospital, Green identified Appellant as the shooter. She had been shot twice-onee in the side and once in the back. The bullet which entered her side became lodged in her chest while the other bullet exited her body. T7 Hooks had been shot in the right arm, right leg, and the back of her head. Only the bullet to her arm became lodged in her body, the other two having exited. Marcus Smith was dead at the scene. He had been shot three times-on the top of his head, the left shoulder, and the back between the shoulder blades. The bullet to his left shoulder was the only one to exit his body. T8 After the shootings, Appellant fled the seene. He was eventually arrested four months later in San Antonio, Texas. Appellant voluntarily spoke with police and told them he threw the murder weapon onto the side of an interstate highway in Oklahoma. The weapon has never been recovered. Appellant also told police that Green had called him and told him to meet her at her sister's apartment so they could talk. He said he took a gun with him because he did not trust Green as she had tried to harm him in the past. Appellant said he was surprised to find Smith at the apartment as he was not expecting a man to be there. Appellant admitted shooting Green, Hooks and Smith but said he shot Smith in self-defense after *99Smith lunged at him. Further facts will be set forth as necessary. JURY SELECTION 1 9 In his first proposition of error, Appellant contends that orange ribbons commemorating \"National Victims Week\" worn in the courtroom during voir dire denied him a fair trial and due process. Appellant asserts the wearing of the ribbons constituted state action which severely prejudiced him and were \"clearly intended to brand [him] with an 'unmistakable mark of guilt!\" (Appellant's brief, pg. 22). 'I 10 The record reflects that after a lunch recess on the second day of voir dire defense counsel informed the court that another attorney in her office had seen people in the courthouse wearing orange ribbons. Defense counsel said she had noticed the ribbons for the first time that day and asked a woman wearing one where she got it. The woman told her the District Attorney's Vie-tim Witness Center was handing them out.2 Defense counsel described the ribbons as orange with the words \"one victim, one crime, one week\" written in gold. Defense counsel asked the court for an in-comera voir dire of the prospective jurors to determine if any of them had seen the ribbons and if they were prejudiced by them. The prosecutors objected, commenting that the writing on the ribbons was small and only visible up close and there had been no claim that any of the jurors in Appellant's case had even seen the ribbons. The court denied Appellant's request for an in-camera voir dire, but agreed to collectively inquire of the prospective jurors if they had seen and read the ribbons. The court reminded defense counsel that \"a lot of these things are going to be able to be resolved by you on your voir dire.\" 1 11 After a brief in-camera hearing on an unrelated juror matter, the prosecutor informed the court that the court's bailiff had said that the decedent's mother, accompanied by a viectim-witness advocate, had entered the courtroom wearing the orange ribbon while the court and counsel were occupied in chambers. This occurred in full view of the prospective jurors awaiting the resumption of voir dire. The women went to the bar of the courtroom looking for one of the prosecutors and one of the women was identified as the decedent's mother. When the bailiff informed the women she didn't think they should be in the courtroom at the time, one of them wrote a note and told the bailiff to tell the prosecutor they were going back to the witness center. 12 Defense counsel asked for a mistrial \"based on the ribbon, coupled with the vie-tim's mother and the jury realizing that that's who it was.\" Defense counsel argued that \"[njormally the jurors don't know who the victim's mother is until some point down the road, like after they have testified\" and therefore this was prejudicial to the defendant. The court denied the request for a mistrial finding no impropriety in the decedent's mother's presence. However, the court did question the prospective jurors regarding the ribbons. {13 When the trial court asked the prospective jurors if they had seen anyone wearing ribbons with some distinct writing on them, only four prospective jurors raised their hands. Two of the jurors said they had seen the ribbons but had not read the writing on them. One juror commented, \"there was a lady a few minutes ago,\" which the judge took to refer to the courtroom presence of either the decedent's mother or the victim witness advocate. The court informed the prospective jurors that it was National Vice-tim's Week and the ribbons were being worn in support. The court admonished the panel to ignore the ribbons. The court reminded the venire panel of the need to maintain the integrity of the trial and that both parties were entitled to a fair trial with unbiased jurors. The court admonished the prospective jurors that they must not form an opinion or otherwise commence deliberations until completion of the testimony and the giving of the legal instructions. The jurors collectively agreed to follow the admonishment. 1 14 The trial court then allowed the prosecutor to resume the questioning she had *100begun prior to the lunch recess. The court specifically commented that both sides would have an opportunity to address the issue further in voir dire The prosecutor inquired briefly of the jurors whether they would all agree that they should not be influenced at all by the ribbons. The jurors collectively agreed. When asked if anyone thought they would be influenced by the fact they saw the orange ribbons, none replied. The prosecutor then resumed the line of questioning she had started before lunch. Defense counsel did not raise the subject of the ribbons during subsequent voir dire. Of the four jurors who indicated they saw the ribbons, only one, R.W., actually served on Appellant's jury. Regarding the ribbons, RW. said he saw them, but did not read them. $15 Appellant claims the wearing of the ribbons was \"state-sponsored\" conduct because the District Attorney's Office had the ribbons made, distributed, and displayed throughout the courthouse. Based upon the record before us, we reject this argument. ' 16 The record indicates the ribbons were obtained from the Victim-Witness Center of the District Attorney's Office. There is nothing in the record pertaining as to how they were handed out or displayed in the courthouse. Even if Appellant's assertions are true, the prosecutors handling Appellant's trial were not wearing the ribbons and they attempted to prevent anyone wearing the ribbons from entering the courtroom. In fact, as soon as the prosecutor learned about the ribbons, she called the witness center to tell them not to send anyone to the courthouse wearing any kind of ribbons. When she could not reach anyone at that phone number, she phoned the District Attorney's secretary and directed her to go to the witness center and make sure no one came to the courthouse wearing the ribbons. At no time did the prosecutor attempt to justify the display of the ribbons in the courtroom or courthouse, rather she admitted to the court she did not believe the victim-witness advocate should have worn the ribbon into the courtroom. The prosecutor specifically stressed to the jury that they should not be influenced by the ribbons. {17 In Estelle v. Williams, 425 U.S. 501, 96 S.Ct. 1691, 48 LEd.2d 126 (1976) the United States Supreme Court found that compelling the defendant to stand trial in prison clothes was a government sponsored courtroom practice which denied the defendant his right to a fair trial. In Holbrook v. Flynn, 475 U.S. 560, 106 S.Ct. 1340, 89 L.Ed.2d 525 (1986) the presence of four uniformed state troopers in the row of spectators' seats immediately behind the defendant at trial was also found to be government sponsored conduct. In determining whether the government sponsored courtroom practices were so prejudicial as to deny a defendant his constitutional right to a fair trial, the Supreme Court used an \"inherent prejudice test\" stating that some practices are \"so inherently prejudicial\" that they must be justified by an \"essential state\" policy or interest. 475 U.S. at 568-569, 106 S.Ct. at 1346. In contrast, the wearing of buttons by the vie-tim's family members which contained pictures of the victims was found not to be state sponsored conduct. See Carey v. Musladin, 549 U.S. 70, 72-783, 127 S.Ct. 649, 652, 166 L.Ed.2d 482 (2006); Mitchell v. State, 1994 OK CR 70, ¶¶ 21-22, 884 P.2d 1186, 1196. {18 The present case falls between the examples set out above as the State had the ribbons made and was responsible for their distribution, yet the wearing of the ribbons in the courtroom by the viectim-witness advocate and decedent's mother seems to be purely private-actor conduct. The record gives every indication that the State did not promote the wearing of the ribbons in the courtroom and actively sought to prevent anyone else from wearing the ribbons in the courtroom. The inherent prejudice test used in Williams and Flynn has not been applied to private-actor or spectator conduct. Carey, 549 U.S. at 76, 127 S.Ct. at 658-54. Therefore, Appellant must show actual prejudice. Mitchell, 1994 OK CR 70, ¶¶ 21-22, 884 P.2d at 1196. 119 The prospective jurors were admonished by the trial court to disregard the ribbons and were told the ribbons were to play no part in the jury's consideration of the *101case.3 The written instructions given to the jury at the close of the evidence directed the jury to consider only the evidence introduced at trial. 20 Further, the ribbons were worn only briefly in the courtroom by two non-participants in the trial. As noted by the prosecutor, \"[the jurors know who the victims family members are from the beginning. [The prosecutors] sit and talk to them and [the defense attorneys] sit and talk to the Defendant's family. Of course they know who the family members are.\" As we stated in Mitchell, \"[slorting out the various courtroom participants would have been relatively easy.\" 1994 OK CR 70, 122, 884 P.2d at 1196. {21 Appellant contends that \"we do not know how many hands were raised\" when the trial court inquired of the prospective jurors about the ribbons. (Appellant's brief, pg. 22). However, the record clearly states four prospective jurors raised their hands and they are identified by name in the ree-ord. Defense counsel made no additional record regarding whether other hands were raised. Based upon the record before us, we find Appellant has failed to show he suffered any prejudice due to the display of the National Crime Victims Week ribbons. This proposition of error is denied. 122 In his second proposition of error, Appellant contends the trial court erred in failing to remove for cause prospective jurors J.M., JW., and K.C. as they were biased in favor of the death penalty. Appellant asserts the court's ruling and the court's failure to grant his request for additional peremptory challenges (having used his allotted nine challenges, including three to remove the above mentioned prospective jurors) forced him to keep three unacceptable jurors. T 23 Potential jurors in this case filled out a questionnaire prior to initial questioning by the trial court. After getting general background information from each venireperson, the judge questioned each person about his or her ability to consider all three punishment options. Having finished his portion of the voir dire, the trial judge allowed the prosecutor to conduct voir dire and then defense counsel. When the trial court did not exeuse J.M., J.W., or K.C. for cause, defense counsel objected. At the conclusion of voir dire, the for-cause challenges were renewed and denied again. Defense counsel used her first three peremptory challenges to remove J.M., J.W., and K.C. Counsel then requested three additional peremptory challenges, identifying three additional panel members she would have removed with the additional challenges,. The request was denied. Appellant has properly preserved this claim for appellate review. See Eizember v. State, 2007 OK CR 29, 1 86, 164 P.3d 208, 220 (to preserve for appellate review an objection to a denial of a challenge for cause, the defense must excuse the challenged juror with a peremptory challenge and make a record of which remaining jurors the defendant would have excused if he had not used that peremptory challenge to cure the trial court's alleged erroneous denial of the for cause challenge). 1 24 The standard of review for determining when a prospective juror may be excluded for cause because of his or views on capital punishment was set out in Eigember, wherein this Court stated: *102The proper standard for determining when a prospective juror may be excluded for cause because of his or her views on capital punishment is \"whether the juror's views would 'prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.'\" Witt, 469 U.S. [412], at 424, 105 S.Ct. [844], at 852 [88 L.Ed.2d 841 (1985) ]. See also Gray v. Mississippi, 481 U.S. 648, 658, 107 S.Ct. 2045, 2051, 95 L.Ed.2d 622 (1987). Inherent in this determination is that the potential juror has been fully informed of the law and his or her responsibilities under the law and oath of a juror. This standard does not require a juror's bias be proved with unmistakable clarity; neither must the juror express an intention to vote against the death penalty automatically. Witt, 469 U.S. at 425, 105 S.Ct. at 852. \"Deference must be paid to the trial judge who sees and hears the jurors\". Id., 469 U.S. at 425, 105 S.Ct. at 858. See also Uttecht v. Brown, 551 U.S. 1, 127 S.Ct. 2218, 2224, 167 L.Ed.2d 1014 (2007) (\"deference to the trial court is appropriate because it is in a position to assess the demeanor of the venire, and of the individuals who compose it, a factor of critical importance in assessing the attitude and qualifications of potential jurors\"). This Court has adhered to the principles set forth in Witt. See Glossip v. State, 2007 OK CR 12, 1131-33, 157 P.3d 148, 150-151; Williams v. State, 2001 OK CR 9, 110, 22 P.3d 702, 709 (and cases cited therein). We have said the Witt standard only requires that each juror be willing to consider each of the three statutory punishments: the death penalty, life imprisonment without the possibility of parole, and life imprisonment (with the possibility of parole). Glossip, 2007 OK CR 12 at 131, 157 P.8d at 150. See also Williams, 2001 OK CR 9 at 110, 22 P.3d at 709-710. Further, all doubts regarding juror impartiality must be resolved in favor of the accused. Williams, 2001 OK CR 9 at 110, 22 P.3d at 709-710. This Court will look to the entirety of the juror's voir dire examination to determine if the trial court properly exeused the juror for cause. Id. As the trial court personally observes the jurors and their responses, this Court will not disturb its decision absent an abuse of discretion. Id. 2007 OK CR 29, 141-42, 164 P.8d at 221-222 (footnote omitted). See also Frederick v. State, 2001 OK CR 34, 1 51, 37 P.3d 908, 926 [tlhe decision to disqualify a prospective juror for cause rests within the sound discretion of the trial court, whose decision will be overturned only where an abuse of discretion exists\"). 125 During initial questioning, prospective juror J.M. agreed he would consider all three penalty options and would not automatically impose the death penalty. During questioning by defense counsel, J.M. agreed that prior to his jury service, he had written and told people in discussion that the death penalty should be used more often. He explained that this belief came from watching \"non-fictional\" programs on television. When asked by defense counsel if he could assume that for him, the death penalty \"has a head start\", J.M. agreed. When asked if that was a \"big head start\", J.M. replied, \"Iwlell I would like to be objective. I wouldn't say a big head start, but yeah, it's probably got a step or two on the others.\" When asked whether those were \"big steps or baby steps\", J.M., said, \"kind of in between.\" 126 Defense counsel then asked if J.M.'s views were the equivalent of two other prospective jurors who had just been excused for cause, J.M. replied, \"it would be close to that, maybe not quite as, but close.\" When asked if Appellant should be worried about what J.M. was saying about the death penalty, J.M. replied that he didn't know, because they had not heard any testimony yet. J.M. said that onee they got to the point of deciding punishment, \"the death penalty is probably going to be the first thing I look at.\" When asked if it was going to be the primary thing he looked at, J.M. said, \"depending on the cireumstances I would say it would be the primary, not the only but the primary.\" J.M. further explained that it was not as if he would not look at all three punishments, but he would look at the death penalty first. He continued, \"(there could be extenuating circumstances, but as I said since we've actually *103not heard any testimony or anything, I couldn't make that decision until we went to, you know, before we found out whether there was guilty or not guilty.\" J.M. further explained, \"[like I said the death penalty would be the one I'd primarily look at, but without having seen all the cireumstances and the evidence and the what not, there is a seenar-io where you could look at the others more objectively.\" 27 In Frederick, 2001 OK CR 34, ¶¶ 51-52, 37 P.3d at 926, this Court unanimously rejected a similar challenge to a prospective juror who said she could consider all three punishment options, she would not automatically vote for a sentence of death, and she would vote for a life sentence if she thought it was appropriate. This prospective juror also said although she might \"lean toward\" the death penalty in a murder case, she would consider all the options. Id. This Court found the trial court did not abuse its discretion in declining to excuse the prospective juror for cause because \"[to withstand a challenge for cause concerning punishment issues, a venireperson need only be willing to consider all the penalties provided by law and not be irrevocably committed to any one punishment option before the trial has begun.\" Id., 2001 OK CR 84, 152, 37 P.3d at 926, quoting Carter v. State, 1994 OK CR 49, ¶ 20, 879 P.2d 1234, 1244. 128 Nothing in J.M.'s responses indicate that he would be unable to consider all three possible punishment options, or that his views would otherwise prevent or substantially impair the performance of his duties as a juror in accordance with the instructions and oath. The trial court, who personally observed J.M. and heard his responses firsthand, was satisfied with his assurances that he could follow the law. Appellant presents nothing to overcome this credibility determination. 129 Prospective Juror J.W. indicated he would accept and follow the law as included in the jury instructions, that he could be a fair and impartial juror and could consider all three punishment options, and that he would not automatically impose the death penalty if the defendant was convicted of first degree murder. The prosecutor told J.W. she wanted to talk about punishment because she was \"a little concerned about the answers\" he gave on the juror questionnaire. The prosecutor said they did not want someone who was \"hard line one way and hard line the other ... and I get the impression from your questionnaire that you're, at least it appears to be, you are hard lined in terms of the person should receive the death penalty if they are convicted of murder in the first degree, is that right?\" J.W., responded, \"Itlhat's my thoughts, yes.\" 130 Upon further questioning, J.W. indicated that He could consider all three punishments, and could give \"honest consideration to all three punishments. When the prosecutor emphasized that she did not mean merely \"paying lip service to a sentence of life or life without parole\" but honestly considering all three possible punishments, J.W. said that based on the instructions he could consider all punishment options. When asked if any of the punishments \"start out ahead,\" he replied, \"no.\" J.W. said he could \"absolutely\" consider all three punishment options and vote for the one he thought was the most appropriate under the law and evidence. J.W. agreed that the evidence might show that a verdict of not guilty was the most appropriate verdict or it might -show that a guilty verdict and a life sentence, a life without parole sentence or a death sentence was the most appropriate. J.W. said he was comfortable that he could give both sides a fair trial. 31 When questioned by defense counsel, J.W. said that after three days of discussion, he could easily come to a verdict imposing the death penalty. \"It would probably be more my primary punishment as opposed to life or life without parole.\" JW. said he would follow the judge's instructions on the three punishment options, but he \"would lean more toward death.\" J.W. agreed with defense counsel's characterization of his view as similar to \"I would look at the death penalty, the other I would look at quickly and discard.\" 1 32 When defense counsel moved to strike J.W. for cause, the trial court allowed the prosecutor additional questioning. The prosecutor stressed that it was okay for jurors *104\"to have a preference one way or the other regarding the applicability of the death penalty\", that \"[the key is can you be fair and can you give meaningful consideration to all of the appropriate punishments.\" J.W, indicated he could discuss the other punishments with the other jurors, he could listen to their opinions and give his own opinion, he would not be embarrassed if the person next to him convinced him that a life sentence was the most appropriate punishment, and he would and could vote for a life sentence if he thought it was the most appropriate punishment. J.W. agreed that whatever sentence he gave, it would have to be based on the law and the evidence he heard in court. 133 On defense follow-up questioning, J.W. again said he would \"lean toward\" the death penalty. When asked if his view was \"I know [life and life without parole] are there but I'm not going to thoughtfully think of those as potential punishments that I would endorse,\" J.W. said, \"I would think about it, possibly endorse it if the discussion in the group were valid.\" J.W. also agreed that in making the sentencing decision, he would like to know the defendant's life story and that \"the more information the better, absolutely. Even personal.\" 1 34 Reviewed in their entirety, J.W.'s responses do not demonstrate an irrevocable bias toward the death penalty. J.W.'s responses indicate he could consider all three possible punishments. Appellant directs us to selected portions of J.W.'s voir dire to support his claim of bias. However, any questions about J.W.'s ability to be a fair and impartial juror were for the trial court to resolve. Our review of the record supports the trial court's finding that J.W. did not have such a strong bias towards the death penalty that the performance of his duties as a juror would be prevented or substantially impaired. Accordingly, the trial court did not abuse its discretion in refusing to remove him for cause. $35 Potential Juror K.C. agreed that on her questionnaire she stated she could consider all three punishments and added that none of them started out ahead for her. She indicated that she was \"not just talking about lip service,\" but she could consider each possible punishment and impose the one warranted by the law and evidence. {36 During defense questioning the next day, K.C. stated that \"after thinking about it the last two or three days I just don't know how fair I could be.\" K.C. said she did not feel like the State starts out with a \"leg up,\" but due to friends and acquaintances in law enforcement, she might give the State's witnesses more credibility. When asked by defense counsel if she believed she could be a fair and impartial juror, K.C. replied, \"the more I think about it, no.\" 137 When questioned by the prosecutor, K.C. explained that she did not mean that the mere fact that she knew police officers would affect her ability to judge the testimony of any police officer who testifies The prosecutor pointed out that the defense had included more police officers on their witness list than had the State. K.C. said she still wasn't sure how fair she could be, that she might take the State's testimony \"a little bit higher\" than that of the defense. T38 When the prosecutor explained that the venire was not being asked to pre-judge witness credibility but rather to judge testimony after it heard it, K.C. was asked whether she could judge everybody's testimony fairly, using the court's instructions. K.C. responded, \"I would try, I think I could . I mean, yeah, okay.\" The prosecutor further explained that trials involved factual disputes, jurors were the ones who resolved those disputes and that all that can be asked of juror is to do their best to be fair to everyone who comes into the courtroom. K.C. responded, \"I would do my best to be fair, yes.\" When asked what her specific concerns were, K.C. said, \"nothing specific.\" K.C. later agreed that she would hold the State to its burden of proof and that neither the prosecutor nor the State's witnesses would \"start out ahead of anybody.\" 89 During a discussion by defense counsel concerning whether the jurors could fairly consider the defendant's testimony, in light of his prior felony convictions, K.C. indicated she could \"possibly\" lean towards the State's witnesses and against the defendant if he were to take the stand. During *105this exchange, when defense counsel asked the venire whether there was anyone who felt they simply could not be fair, K.C. did not raise her hand. On the contrary, K.C. responded affirmatively that she believed it was fair for defense counsel to expose those jurors who could not be fair and impartial. Later, when asked whether the death penalty was \"ahead of the others or does it rank equally?\" K.C. responded, \"they're all equal, depends on the case.\" € 40 Appellant asserts that although Prospective Juror K.C. was questioned primarily on guilt/innocence issues, she implicitly favored the death penalty because she exhibit, ed a strong bias against criminal defendants in general. Appellant argues that her inability to meaningfully consider the evidence, even if primarily applied during the guilt/innocence portion of the trial, would have clearly prejudiced him. T41 It would not be an understatement to say that to the majority of people called to jury service, the law and procedures involved in a criminal trial are foreign issues. Unlike the attorneys involved, the potential jurors are not predisposed to thinking about issues involved in determining the defendant's guilt or innocence and the appropriate punishment. Voir dire is the time to educate the prospective jurors on what will be asked of them under the law. Eizember, 2007 OK CR 29, 140, 164 P.3d at 221. Often times, these prospective jurors are asked for an immediate decision or response on issues which they have not considered or considered only generally. Thus, answers to a written Juror questionnaire must be read as a starting place for discussion and education and not as the basis for a final determination on the prospective juror's impartiality. That a prospective juror's responses may change during the course of voir dire is not automatic grounds for exeusal for cause. {42 K.C. illustrates the prospective juror who may be initially unsure as to what is expected of a juror but learns through voir dire how to consider and apply the law and evidence. Her initial concerns about her ability to be fair and impartial seemed to fade away as the process and the law was explained to her. By the end of her voir dirg, she indicated she could be fair and impartial to both parties and their witnesses. Any ambiguity or inconsistencies in her responses were subject to resolution by the trial court. Having the benefit of observing K.C.'s demeanor throughout voir dire, the court found her responses credible and insufficient to exeuse her for cause. Our review of the totality of K.C.'s voir dire supports the trial court's decision. While her voir dire seemed to concentrate on guilt/innocence issues, she did not exhibit a strong bias against criminal defendants in general so that she could not be a fair and impartial juror. 1483 Having thoroughly reviewed the voir dire examinations of prospective jurors J.M., J.W., and K.C., we find the trial court did not abuse its discretion in failing to remove these jurors for cause. Therefore, there is no need to address whether Appellant was entitled to additional peremptory challenges. Williams v. State, 2008 OK CR 19, 183, 188 P.3d 208, 218; Rojem v. State, 2006 OK CR 7, ¶ 37, 130 P.3d 287, 295. T44 As much as Appellant argues that Prospective Jurors J.M., J.W., and KC. should have been exeused for cause, he asserts in his third proposition of error that Prospective Jurors ML., LW., and PH. should not have been excused for cause. Appellant asserts these jurors gave in to extensive prosecutorial interrogation without an adequate determination of whether they could set aside generalized opposition to capital punishment sufficiently to follow the law and consider the death penalty, along with other punishment options. 145 Prospective Juror ML., a medical doctor, wrote on her juror questionnaire that she could not impose the death penalty. When asked by the prosecutor if there were any circumstances under which she believed she could return a verdiet of death, M.L. replied, \"I do not think so.\" The prosecutor then asked, \"[slo no matter what the law said or what the evidence was, and that's perfectly okay, you do not believe that you could ever return a verdict of death?\" ML. replied, \"[nlo.\" When asked if there was anything the prosecution could do to change her mind, M.L. replied, \"[iJt would be very diffi*106cult. I don't think so.\" Although M.L. indicated that it was a position she had held for a long time, when asked if it was something she could set aside and reach a verdict, she replied, \"I'd like to think that I could, but I don't know.\" ML. agreed with the prosecutor that it would be unfair to the State if she stayed on the jury knowing that she could not carry out that function. ML. repeated, \"I do not think that I can impose the death penalty.\" When asked by the prosecutor, \"under no cireumstances, under no facts?\" M.L. replied, \"[vlery unlikely.\" The State then moved to exeuse her for cause. 46 When questioned by defense counsel whether she was \"100 percent foreclosed\" on what she can or cannot do, M.L. replied, \"I would say 99 percent. I mean, there's a slim chance I could do it, but I don't think I could.\" When asked whether she could envision any circumstances in which she might impose the death penalty, M.L. stated, \"[olh! Possibly, but not very likely.\" Asked if she could follow the law, ML. said, \"I would try to do it but it would be very difficult for me to.\" Defense counsel objected to the State's motion to exeuse ML. for cause on the basis that she was not \"entirely foreclosed.\" The court found the prospective juror \"marginal almost to the side saying she can't do it\" but allowed the defense further voir dire because the judge had not heard a \"definite\" answer from the juror. 1 47 In response to the prosecutor's followup questioning concerning M.L.'s somewhat inconsistent responses about imposing the death penalty, ML. said \"I don't think I'm the right juror for this job. I do not think that I could impose the death penalty.\" ML. further stated, \"I do not believe that I will ever give a verdict of death, but if something was so heinous and potentially yes, but I don't think that you receive a fair shake from me.\" ML. agreed with the prosecutor that \"the odds are extremely slim, 1 percent to 99 percent\" that she could ever impose the death penalty no matter the law and the evidence. 148 Later that afternoon, the prosecutor returned to M.L. \"to make sure that nothing [had] changed\" for her. ML. said, \"[the more that I think about it I do not think that I can vote for the penalty of death.\" When the prosecutor commented, \"that leaves room for equivocation though\", ML. replied, \"I know I took an oath to follow the law here, but I also took an oath to do no harm. And I think to impose a penalty of death is doing harm to someone, I don't think I could [do] it.\" When asked about her previous statement that she would not vote for the death penalty 99 percent of the time, thus leaving a slim chance she could, M.L. replied, \"I'm not a person to say 100 percent anything, so I do believe there probably are situations, but I don't think we're going to encounter them here.\" ML. agreed that no matter what the law said and no matter what the cireum-stances were, she did not believe she could return a verdict of death. When asked if she was equivocating in any way, M.L. said she was \"positive.\" Asked again if there were any cireumstances under which she could envision returning a verdict of death, M.L. replied, \"[n}o.\" The prosecutor again asked that ML. be excused for cause. 1 49 Defense counsel approached the bench and told the court that the juror's voice was quivering and she was about to ery, therefore she did not think it would be productive to question her further. Counsel said she was leaving the decision on removing the juror to the court but renewed her objection to exeus-ing her for cause. The court found the prospective juror \"had moved from saying there were some circumstances under which she could impose the death sentence to an unequivocal no to imposing death.\" However, the court allowed defense counsel further questioning. {50 ML. agreed with defense counsel's characterization of her prior statement as stating that she could consider a set of circumstances where she could consider the death penalty but she didn't think it was going to be in this case. When defense counsel said, \"so it sounds like to me there is a point where you would consider the death penalty,\" M.L. replied, \"[nlo. I'm going-the more I think about it the more I think that I'm not able to consider the death penalty ... under any cireumstances.\" Over defense counsel's objection, the trial court exeused M.L. finding \"she was very firm in her belief *107now where she had a 1 percent and that 1 percent seems to have evaporated.\" T51 The trial court did not abuse its discretion in removing ML. for cause. While she seemed to vacillate at times in her responses, the trial court appropriately determined that she would not be able to consider all three punishment options. Appellant's characterization of voir dire is not supported by the record. Contrary to Appellant's comparison of the prosecutor's questioning as \"interrogation\", we find nothing in the record showing the prosecutor badgered or intimidated M.L. In fact, the prosecutor repeatedly stressed there was nothing wrong with the position M.L. held on capital punishment but that the lawyers simply needed to clarify her position. The trial court gave both sides ample opportunity to question ML. Even when defense counsel stated she didn't think further questioning would be of any use, the court allowed her additional questioning. Defense counsel did not complain that she was prevented from adequately questioning M.L. and she did not argue that the prosecutor's questions were too aggressive or somehow crossed the line. Upon review of the totality of M.L.'s voir dire, we find the questioning was sufficient to determine that M.L. could not consider all three punishment options and she was properly excused for cause. 152 Prospective Juror LW. told the court from the start that she did not believe in the death penalty. She said that if someone were trying to convince her that the death penalty should be imposed, \"I don't think I could do it.\" This was based on her religious views and her opinion that a person suffered more when they were in prison without parole. When specifically asked if she could consider all three punishments, L.W. replied, \"Inlo.\" The prosecution then asked that LW. be excused for cause. Defense counsel objected, asking for more questioning. The court eventually retired to chambers to conduct individual voir dire. T53 In an attempt to make it clear that there were no \"right or wrong answers\" and that attorneys were just trying to determine how the juror felt, the prosecutor again asked L.W. if she could impose the death penalty. L.W. said, \"I don't think I can\", and \"my family, we have talked about it, and like my husband said he could, but I said I can't\". LW. said she thought the death penalty was the \"easy way out,\" stating, \"I think they're just gone and they really haven't paid for what they did ... and I think a person suffers more if they have to stay in prison.\" She explained further, \"I could sit up here and say well maybe I'll consider it, you know, but I wouldn't be really telling the truth.\" [ 54 L.W.'s responses to defense counsel's subsequent questioning are best described as confusing. When asked by defense counsel if it made a difference to LW. that she would never be told that she had to assess the death penalty, L.W.'s somewhat rambling response came down to she didn't want someone in the jury room \"harassing\" her on what they thought she should do and she agreed that it could get \"difficult or very angry\" in deliberations if everyone else wanted the death penalty. I 55 In an attempt to refocus on the pertinent issue, the court again asked L.W. if she could consider all three punishments. She replied, \"I guess I could go through trial, I'll listen, you know, and I can consider everything. I'm just thinking. And then I'll have my opinion. But I wouldn't want nobody trying to-1I really-I don't.\" When asked by the court for a definitive answer, she replied, \"[yleah. Yes or no. Yes or no.\" In a further attempt to clear up the situation, the court asked again if she could consider all three punishment options, LW. replied, \"I guess I can say I can consider it. I'm just really thinking now. I guess a person should always have an open mind on anything.\" 156 Before leaving chambers, the court allowed both sides additional questions. When asked by defense counsel whether she could envision a set of cireumstances where she could assess the death penalty, L.W. replied, \"I have never thought of it the way some of the terms that ya'll-let me see. I'm kind of considering it thinking I have to change my, a different way of thinking the way I'm thinking. I would have to think that, like they took a life then they life should be taken, but I haven't always thought about *108that, you know, that way.\" Defense counsel then indicated she had no further questions. T 57 In a brief follow-up by the prosecutor and the court, LW. stated unequivocally that she could not consider the death penalty or vote for it under any set of cireumstances, adding \"Tl just say it like this, it's religion. And maybe I could do this if they ever take that death penalty out. T'll leave it at that. I couldn't do it. I couldn't do it, I'll just say it like that.\" The trial court then excused L.W. for cause over defense counsel's objection. T58 During an argument on the for-cause challenge, defense counsel argued that the juror had gone back and forth, that it would be hard for her, but she did say she was willing to consider all three punishments. The trial court responded that he \"didn't hear that part.\" The trial court commented, \"Laind we have gone all the way around the mulberry bush on her. She started out how she ended up and she's kind of waffled in between. I'm going to excuse her for cause. I just think that her-She doesn't leave a lot of ambiguity in her statement that she cannot do that and I don't know whether it's religious or moral but she just says that she cannot do that.\" 159 \"A juror's bias need not be proved with 'unmistakable clarity'; neither must the juror express an intention to vote against the death penalty 'automatically.'\" Williams v. State, 2001 OK CR 9, 110, 22 P.3d 702, 709-710. Determination of a juror's bias often cannot be reduced to a question and answer session. Id. \"Despite the lack of clarity in the written record, there are situations where the trial judge is left with the definite impression that a prospective juror would be unable to faithfully and impartially apply the law.\" Id. This is just such a case. 60 L.W. is an example of a prospective juror who entered voir dire with a particular belief Through questioning she learned there was another way of looking at the issues. However, after going through the voir dire process, she determined her initial belief was firm. Any ambiguity stemming from her unfocused responses during questioning by defense counsel was undermined by her focused and unequivocal statements at the beginning and end of her voir dire that she could not consider or impose the death penalty under any cireumstances. Both parties and the court thoroughly questioned L.W. Defense counsel was not denied the opportunity for additional questioning. The trial court did not abuse its discretion in excusing LW. for cause. T61 Prospective Juror P.H. was an 18 year old college student. He was very firm during his initial questioning that he could not impose the death penalty under any cireumstances. He said he had held these view since his teenage years; he \"went into high school being anti-death penalty.\" On his juror questionnaire, P.H. said he could consider the death penalty, however he informed the prosecutor that was merely \"lip service\" and \"I don't believe honestly, the more I think about it, that I could do that. I don't think I could.\" When asked if there were any set of cireumstances where he could impose the death sentence, he replied, \"[njo.\" When asked whether he could vote for the death penalty even if the law and evidence allowed it, he replied, \"[nJo.\" ( 62 Under questioning by defense counsel, P.H. agreed that he would do his best to follow the law and if instructed, he would set aside his personal view and follow the law. When told that if he remained on the jury he would be instructed to consider the three possible punishments and make a decision based on the law, P.H. replied that he \"would be deeply conflicted and troubled\" but he was \"literally capable of it.\" However, when asked if he could actually impose the death penalty if he thought the facts and circumstances warranted it, P.H. said, \"I don't honestly think that I could find myself, find it within myself to impose it.\" PH. said he could not envision a set of cireumstances or level of crime where he would consider imposing the death penalty. In an attempt to clear up any confusion, the court asked P.H. whether he was saying if the law says you have to consider the three punishments and if the facts and circumstances warranted you would have to consider the death penalty and if the facts warrant it, issue a verdict of *109imposing the death penalty?\" PH. replied, \"I don't believe that that I could give fair consideration to that, no. I would follow the instructions, but I don't believe I could honestly give it-.\" The court then advised P.H. that the law requires him to consider all three punishment options and if the evidence and law warrant it, the death penalty would be imposed. PH. said, \"Then no, I could not follow procedure in that case I don't think. I could not.\" T 63 Defense counsel objected to the execu-sal of P.H. for cause. The court said it heard the prospective juror \"waffling\" but when he was asked by the court if he could impose the death penalty, he said \"[nlo.\" The court offered defense counsel a chance to rehabilitate the juror, but counsel admitted that they had asked him a lot of questions and she didn't know if he was going to be \"any clearer about it.\" When asked again if she wanted to ask any more questions, defense counsel told the judge she could not think of any but she still objected to the juror being stricken. The judge overruled the objection and exeused the juror for cause. { 64 PH. was firm in his statements that he could not impose the death penalty. Any ambiguity in his statements was resolved with additional questioning which made it clear he was irrevocably committed to vote against the death penalty, regardless of what the evidence and law warranted. Further, both parties were allowed sufficient questioning to determine the juror's ability to be fair and impartial. Defense counsel in fact admitted she had no further questions for P.H. The record does not support Appellant's claim that defense counsel's inquiry was unfairly restricted or that the court did not have an adequate record upon which to determine the juror's qualifications. Further, contrary to Appellant's claim on appeal, there were no objections raised to the prosecutor's voir dire questioning on the basis that it was too aggressive, intimidating or otherwise improper. We find the record supports the court's exeusal of P.H. for cause. This proposition of error is denied. 165 In his fourth proposition of error, Appellant contends that Prospective Juror D.R. was improperly removed for cause for being a convicted felon. Appellant argues that the systematic exclusion of convict ed felons from juries violates Oklahoma law as the law allows restoration of one's civil rights upon the expiration of the time period set forth in the judgment and sentence. Appellant argues that systematically excluding anyone with a felony conviction from serving on a jury denied Appellant his right to a fair cross section of society because the number of black males who have been to the penitentiary is grossly disproportionate to the number of white males who have been in the penitentiary. T 66 During a lengthy voir dire, D.R. admitted that twenty years previously he had been charged with a felony and the case had been disposed of. On the basis of this response, and as he had denied having a felony conviction on his juror questionnaire, the prosecutor requested voir dire continue in chambers. 167 D.R. admitted in chambers that he was a convicted felon. He explained that he did not say so on his questionnaire because he was hoping he would not make it so far in the process, he did not want to tell anyone about his prior convictions, and he was trying to get out of jury duty. When asked by the prosecutor if he had done anything to have his civil rights restored after being convicted, D.R. said he had been trying but there were \"so many different other people that done stuff and been in jail under my name.\" When asked how many times he had been charged with a crime, D.R. replied, \"a few ... I think three\". When asked if he remembered what the charges were for, he replied, that one was for unauthorized use of a vehicle and another was for possession of paraphernalia, which was pending at the time and he was to report to court that day. D.R. thought the third charge had been for public drunk. When asked about a 1983 arrest for concealing stolen property and grand larceny, D.R. said, \"I got out of it.\" 1[ 68 Under questioning by defense counsel, he admitted he had two convictions, running concurrent. He said he was on probation and didn't report so he was sent to the penitentiary. When asked by defense counsel if he had done anything to restore his *110civil rights or expunge his case, he replied, \"Inljothing.\" Although defense counsel agreed that a convicted felon could not serve on a jury, an objection to the removal was raised based on constitutional grounds that Appellant would be denied a fair cross seetion of the population sitting on his jury, specifically, black males. Over defense counsel's objection, the court exeused D.R. for cause because he was a convicted felon. 169 We review Appellant's challenge under state law grounds for plain error only in light of his objection. See Wackerly v. State, 2000 OK CR 15, ¶ 9, 12 P.3d 1, 8. Under Oklahoma law, convicted felons are subject to a challenge for cause. Title 22 0.8.2001, § 658 provides that \"[gleneral causes of challenges are: 1. A conviction for felony.\" Additionally, 88 0.9$.2001, § 28(B)(6) provides: C. Persons who are not qualified to serve as jurors are: 5. Persons who have been convicted of any felony or who have served a term of imprisonment in any penitentiary, state or federal, for the commission of a felony; provided, any such citizen convicted, who has been fully restored to his or her civil rights, shall be eligible to serve as a juror; T 70 In Jackson v. State, 1998 OK CR 39, 964 P.2d 875 (per curiam ) this Court heard an argument similar to the one in the present case.4 In that case the prospective juror admitted to having a prior felony conviction and that the sentence had expired. Id., 1998 OK CR 39, ¶ 14, 964 P.2d at 884. The trial court excused the prospective juror based on his felony conviction. On appeal, the appellant argued that because the prospective juror had completed his sentence, his civil rights were restored and he was eligible to serve on the jury. Id., 1998 OK CR 39, ¶ 15, 964 P.2d at 884. This Court said the clear intent of 38 0.8. § 28(B)(6) was \"to exclude those who have either been convicted of any felony or have served a term of imprisonment in any penitentiary for the commission of a felony unless that person has been fully restored to his or her civil rights ...\" Id. The Court found it unnecessary to discuss the issue of whether a person's civil rights, including the right to serve on a jury, are restored upon the termination of a sentence as 22 0.8. § 658, provides that a person who has been convicted of a felony is subject to being excused for cause, with no mention of the status of his civil rights. 1998 OK CR 89, 964 P.2d at 884. As the decision to excuse a prospective juror for cause rests within the sound discretion of the trial judge, this Court found no abuse of the trial court's discretion. Id. 171 As Jackson makes clear, convicted felons are subject to being excused for cause in a criminal case regardless of whether that person has had his civil rights restored. Appellant's reliance on 21 0.8.2001, $ 65 which states that \"[a)l sentence of imprisonment under the Department of Corrections suspends all the civil rights of the person so sentenced, ... during the term of such imprisonment\" was rejected in Jackson. Appellant's reliance on the general provisions of Title 38 dealing with jury service in civil cases is also not persuasive. The fact that certain civil rights are restored upon termination of a felony sentence does not mean that all civil rights are restored under state law. See Mehdipour v. Wise, 2008 OK 3, ¶ 9, 65 P.3d 271, 272 (discussing the meaning of the term \"civil rights\" as it relates to convicted felons). As Appellant has failed to show that Jackson is not the prevailing law, we find the trial court did not abuse its discretion in removing D.R. for cause.5 172 As for Appellant's federal constitutional challenge, the United States Constitution requires that grand jurors and the venire of petit jurors be chosen from a fair cross-section of the community. Taylor v. Louisiana, 419 U.S. 522, 527, 95 S.Ct. 692, 696, 42 L.Ed.2d 690 (1975). However, defendants are not entitled to a jury of any partic*111ular composition, nor is there any requirement juries reflect the various distinctive groups in the population. State ex rel. Macy v. Bragg, 2000 OK CR 21, ¶ 8, 13 P.3d 503, 506. To establish a prima fucie case of a violation of the fair cross-section requirement, Appellant \"must show (1) that the group alleged to be excluded is a 'distinetive' group in the community; (2) that the representation of this group in venires from which juries are selected is not fair and reasonable in relation to the number of such persons in the community; and (3) that this underrepre-sentation is due to systematic exclusion of the group in the jury selection process.\" Hooker v. State, 1994 OK CR 75, ¶ 21, 887 P.2d 1351, 1358-59 (quoting Duren v. Missouri, 439 U.S. 357, 364, 99 S.Ct. 664, 668, 58 L.Ed.2d 579 (1979)). T73 At trial, defense counsel argued that \"it's well known and accepted that there's a disproportionate number of African-American men who have been to the penitentiary disproportionate to their numbers in the population, that denies Mr. Davis a sufficient cross section, member of his own race sitting on his jury.\" However, defense counsel offered no evidence to support the argument. Now on appeal, Appellant offers for the first time statisties from two internet based publications by Human Rights Watch, an organization dedicated to the abolition of capital punishment. This information was not evidence in the trial and is insufficient to show that the venire panel assembled in Appellant's trial was not drawn from a fair cross-section of the community. Therefore, this claim of error is denied. FIRST STAGE ISSUES 174 In his eighth proposition of error, Appellant challenges the sufficiency of the evidence supporting his convictions for first degree murder and shooting with intent to kill. We review sufficiency of the evidence claims in the light most favorable to the prosecution to determine whether any rational trier of fact could have found the essential elements of the crime beyond a reasonable doubt. Spuehler v. State, 1985 OK CR 132, ¶ 7, 709 P.2d 202, 208-04 (citing Jackson v. Virginia, 443 U.S. 307, 316, 99 S.Ct. 2781, 2787, 61 L.Ed.2d 560, 571 (1979)). This Court will accept all reasonable inferences and credibility choices that tend to support the verdict. Bland v. State, 2000 OK CR 11, ¶ 24, 4 P.3d 702, 713. 1 75 Appellant asserts the State's evidence was insufficient to prove that he shot Marcus Smith with malice aforethought and that he shot Tia Green and Chinetta Hooks with the intent to kill them. Appellant argues the evidence showed only that he was acting \"in a heat of passion at the time of the shooting.\" 176 \"A person commits murder in the first degree when that person unlawfully and with malice aforethought causes the death of another human being.\" 21 0.8.2001, § 701.7(A). \"Malice is that deliberate intention unlawfully to take away the life of a human being, which is manifested by external circumstances capable of proof.\" Id. \"A design to effect death [¢.e., premeditation] is inferred from the fact of killing, unless the circumstances raise a reasonable doubt whether such design existed.\" 21 0.8.2001, § 702. See also Bland, 2000 OK CR 11, 1 26, 4 P.3d at 7183. Premeditation sufficient to constitute murder may be formed in an instant or it may be formed instantaneously as the killing is being committed. Id. Malice aforethought may be proved by cireumstan-tial evidence. Id. 177 By contrast, a homicide is manslaughter in the first degree when \"perpetrated without a design to effect death, and in a heat of passion, but in a eruel and unusual manner, or by means of a dangerous weapon ...\" 21 0.8.2001, § 711(2). The elements of heat of passion are: 1) adequate provocation; 2) a passion or emotion such as fear, terror, anger, rage or resentment; 3) the homicide occurred while the passion still existed and before a reasonable opportunity for the passion to cool; and 4) a causal connection between the provocation, passion and homicide. Allen v. State, 1991 OK CR 35, ¶ 10, 821 P.2d 371, 374. The heat of passion must render the mind incapable of forming a design to effect death before the defense of manslaughter is established. Id. 178 The evidence in this case showed that Appellant and Tia Green had a *112turbulent relationship that involved multiple breakups, physical abuse, and other violence. Appellant had left numerous threatening messages for Green as late as December 2003. On December 30, 2003, Green was served with a lawsuit filed by Appellant over unpaid rent from an apartment the two had shared. Green was not bothered by the lawsuit as she had no intentions of paying Appellant any money. In his statement to police, Appellant discussed at length his feelings for Green and the many ways he believed she had \"wronged\" him, despite his love for her. Appellant's statements show he was obsessed both with Green's treatment of him and with making amends for these perceived wrongs. T79 Appellant claimed Green had called him and told him to meet her at Hooks apartment that evening. This was disputed by both Green and Hooks who testified they were not expecting Appellant at Hooks apartment that evening. Regardless of whether or not he was expected, Appellant arrived at the apartment armed. He later told police he had eight rounds in the clip of a .82 semi-automatic weapon plus another round chambered, making a total of nine rounds. Appellant also had another fully loaded clip in his pocket. He had obtained the gun the day before the shootings. A few hours before the shootings, he had gone to his uncle's house for help in removing a bullet which had jammed inside the gun. Appellant's uncle removed the jammed bullet. 80 Appellant told police his purpose in going to the apartment that night was \"to go over there and hopefully she was gonna do the right thing\" regarding the money Green allegedly owed him and which was the subject of the lawsuit. However, Green had told him as recently as the night before the shootings that she did not have the money to pay him. [ 81 When he arrived at Hooks' apartment, Appellant was dressed all in black, including a black hoodie pulled over his head. He covered the peephole in the door so those inside the apartment could not see out. He forced his way into the apartment uninvited, and shut and locked the door behind him. Appellant was the only person in the room with a weapon. Appellant aimed the gun at the decedent's head the first time then dropped the gun to his side. He would raise the gun up two more times before firing. He shot the decedent for doing nothing more than keeping his hands raised and asking, \"what's going on\" and \"why are you doing this, man?\" Before firing, Appellant told Green, \"you've hurt me for the last time.\" Despite pleas from Green and Hooks not to shoot, and that there were children in the apartment, Appellant raised the gun from his side and fired at all three victims. Each victim was struck multiple times. The decedent was struck in the head and twice in the back. Hooks was shot as she ran away from Appellant and at least once as she lay on the kitchen floor. Appellant told police he intended to hit Hooks because she was running away from him and then he \"went to the kitchen, and I shot one more time at her.\" Appellant chased the wounded Green to the bathroom where he kicked and pounded on the locked door. Appellant later admitted that sometime after the shootings, he called Green and said \"this wasn't over.\" Appellant. 82 Appellant asserts he was threatened by Smith and his aggressive behavior in lunging towards him. However, Appellant admitted to police that he shot the decedent as the decedent backed away from him. Further, Green and Hooks testified that the decedent did not act aggressively towards Appellant or lunge at him; he merely stood with his hands up and backed away from Investigating officers testified that the decedent's head wound was consistent not only with a person shot in the process of trying to tackle another, but also with a person ducking or kneeling down to avoid being shot. 183 Appellant argues that because he loved Tia Green he did not intend to kill her or her sister. The State's evidence suggests otherwise. Where there is conflict in the testimony, this Court will not disturb the verdict on appeal if there is competent evidence to support the jury's finding. Bland, 2000 OK CR 11, ¶ 29, 4 P.3d at 714. The credibility of witnesses and the weight and consideration to be given to their testimony are within the exclusive province of the *113trier of facts and the trier of facts may believe the evidence of a single witness on a question and disbelieve several others testifying to the contrary. Id. 84 Appellant's attempts to show he did not have the intent to kill fell short as the jury apparently gave greater weight to the State's evidence than Appellant's self-supporting statements. More than anything else, the jury's verdict is supported by the undisputed evidence that Appellant arrived at the apartment heavily armed and he not only shot each victim multiple times, but he continued to shoot as the victims either attempted to get away or lay on the ground. This conduct leads to the unmistakable conclusion that Appellant shot at the victims fully intending to kill each one. Having reviewed the evidence in the light most favorable to the State, we find sufficient evidence was presented to prove that Appellant acted with malice aforethought when he killed the decedent and that he shot Green and Hooks with the intent of killing them. See Marquez-Burrolg v. State, 2007 OK CR 14, 123, 157 P.3d 749, 758; Allen, 1991 OK CR 835, 112, 821 P.2d at 874. This proposition of error is denied. 4 85 In his ninth proposition of error, Appellant challenges the admission of photographs depicting the victims' injuries as well as certain crime seenes. Appellant argues the photographs were irrelevant, unfairly prejudicial and cumulative to other photographs and exhibits. €86 The admissibility of photographs is a matter within the trial court's discretion and absent an abuse of that discretion; this Court will not reverse the trial court's ruling. Warner v. State, 2006 OK CR 40, 1167, 144 P.3d 888, 887. Photographs are admissible if their content is relevant and their probative value is not substantially outweighed by their prejudicial effect. Id. The probative value of photographs of murder victims can be manifested in numerous ways, including showing the nature, extent and location of wounds, establishing the corpus de-licti, depicting the crime seene, and corroborating the medical examiner's testimony. Id. 187 State's Exhibits 66, 68, 76, 78-81, 88-85 are photographs of the crime seene, including views of the decedent's body from various points in the apartment. One photograph is a close up view of the decedent's body showing a shell casing discovered underneath his chin. State's Exhibits 181-184 are close up views of the decedent's gunshot wounds. These exhibits were specifically admitted without objection by the defense. We therefore review their admission only for plain error. Young v. State, 2000 OK CR 17, ¶ 47, 12 P.3d 20, 37. 1 88 The photographs were relevant in depicting the area of the apartment where the shootings occurred, the absence of any weapons in the apartment, and to rebut Appellant's claim that the shooting victims were smoking marijuana when he arrived at the apartment. The photographs showing the decedent's body face down on the floor and his various gunshot wounds were relevant to aid the jury in understanding testimony from police officers and the medical examiner concerning the position of the body when shot, and the nature and extent of the gunshot wounds. 189 Appellant argues the photographs were unduly prejudicial as it was uncontested that he shot the victims, that the decedent died from his wounds, and because the decedent's wounds were fully explained by the testimony and diagrams of the medical examiner. Despite these claims, the State is charged with establishing the corpus delicti of the crime. The State is entitled to corroborate and illustrate the testimony of its witnesses about what the crime scene looked like and the manner of death. Pavatt v. State, 2007 OK CR 19, 155, 159 P.3d 272, 290. Further, the State is not required to downplay the violence involved or its repercussions. Warner, 2006 OK CR 40, 1168, 144 P.3d at 887. 90 These photographs were relevant in establishing the corpus delicti and to disprove the defense of self-defense. While certain images in this group of photographs are cumulative to other photographs or exhibits, Appellant has failed to meet his burden of showing the repetition was needless or in*114flammatory. Id. We find no plain error in the admission of these photographs. 191 Appellant next challenges the admission of State's Exhibits 167-170, 173, 176, 177, and 179, photographs of the injuries suffered by Tia Green and Chinetta Hooks. Admission of these photographs was met with contemporaneous objections by the defense. T92 As these women were removed from the crime seene and taken to the hospital as soon as possible after emergency personnel arrived on the crime seene, the photographs of their wounds were taken in the hospital. As before, Appellant argues the photographs were unnecessary as the medical examiner's testimony and diagrams were sufficient to prove the women's wounds. However, the record reflects that the medical examiner did not address the gunshot wounds suffered by the women. The medical examiner's testimony was limited to her examination of the decedent's body during the autopsy. The medical examiner did not examine the surviving victims of the shootings. Rather, the photographs in question were introduced during the testimony of Green and Hooks and corroborated their descriptions of the injuries they suffered at the hands of Appellant. Each of the photographs depicts a different wound and helped the jury visualize the location and extent of the injuries Appellant has failed to meet his burden of showing any repetition was needless or inflammatory. { 93 In reviewing the prejudicial impact of the photographs this Court has said, \"where the probative value of photographs or slides is outweighed by their prejudicial impact on the jury that is, the evidence tends to elicit an emotional rather than rational judgment by the jury then they should not be admitted into evidence.\" Warner, 2006 OK CR 40, 1170, 144 P.3d at 887. Applying that standard to this case, we find the photographs were not introduced solely to elicit an emotional response. The photographs were probative and that probative value was not outweighed by any prejudicial impact. Appellant has failed to meet his burden of prejudice, and we find the trial court did not abuse its discretion in admitting the photographs. See Pavatt, 2007 OK CR 19, ¶¶ 54-55, 159 P.3d at 290. This proposition of error is denied. FIRST STAGE JURY INSTRUCTIONS 194 In his fifth proposition of error, Appellant challenges the trial court's refusal to give his requested instructions on his theory of defense-self-defense. A theory of defense instruction must embrace a defense recognized in law, which either exonerates guilt or reduces the charge to a lesser included offense. Ball v. State, 2007 OK CR 42, 129, 178 P.3d 81, 89. When prima facie evidence meeting the legal criteria for the defense is presented, an instruction should be given. Id. Prima facie evidence is evidence \"which in the judgment of the law, is sufficient to establish a given fact, or the group or chain of facts constituting the defendant's claim or defense, and which if not rebutted or contradicted, will remain sufficient to sustain a judgment in favor of the issue which it supports.\" Id., 2007 OK CR 42, 129, 178 P.3d at 90, n. 4. See also Bland v. State, 2000 OK CR 11, ¶ 56, 4 P.3d 702, 719-20. A theory of defense instruction is properly refused if there is insufficient evidence to support it. Ball, 2007 OK CR 42, ¶ 29, 178 P.3d at 89. T95 Self-defense is an affirmative defense which admits the elements of the charge, but offers a legal justification for conduct which would otherwise be criminal. 21 0.9$.2001, § 7388(2). See also McHam v. State, 2005 OK CR 28, ¶ 10, 126 P.3d 662, 667; Camron v. State, 1992 OK CR 17, ¶ 13, 829 P.2d 47, 56; West v. State, 1990 OK CR 61, 16, 798 P.2d 1083, 1085. \"Under Oklahoma law, '[slelf-defense is a defense although the danger to life or personal security may not have been real, if a reasonable person, in the cireumstances and from the viewpoint of the defendant, would reasonably have believed that he/she was in imminent danger of death or great bodily harm.\" Perryman v. State, 1999 OK CR 39, 19, 990 P.2d 900, 903 (quoting OUJI-CR (2d) 8-46). \"The bare belief that one is about to suffer death or great personal injury will not, in itself, justify taking the life of [one's] adversary. *115There must exist reasonable grounds for such belief at the time of the killing.\" Id., 1999 OK CR 39, ¶ 9, 990 P.2d at 904 (emphasis in original). The right of self-defense cannot be invoked by an aggressor or by one who voluntarily enters into a situation armed with a deadly weapon. Orr v. State, 1988 OK CR 265, 17, 764 P.2d 1862, 1864. See also Le v. State, 1997 OK CR 55, 1283, 947 P.2d 585, 547; Stiles v. State, 1992 OK CR 23, ¶ 26, 829 P.2d 984, 991; Ruth v. State, 1978 OK CR 79, ¶ 8, 581 P.2d 919, 922. 196 Arguably, the only evidence which could support Appellant's claim of self-defense was his statement that the decedent lunged at him and he thought the decedent might be trying to grab the gun. However, by Appellant's own statement, he was the aggressor in the situation, arriving at the apartment visibly armed. Taking Appellant's statement in the best light possible, he shot the unarmed decedent merely because he moved toward him and refused to back away. Based upon Appellant's statement, no rational jury would find Appellant had a reasonable belief he was in imminent danger of great bodily harm. T 97 Further, when compared with the rest of the evidence, Appellant's statement does not support his claimed self-defense. Eizember v. State, 2007 OK CR 29, ¶ 111, 164 P.3d 208, 236 (a defendant's statements concerning the homicide are sufficient to warrant a jury instruction only if those statements are supported by other evidence presented at trial). It was obvious to all in the apartment, that Appellant was the only one armed. Ms. Green and Ms. Hooks testified that Appellant pointed the gun at all three of them when he first entered the apartment, then pointed it directly at the decedent and proceeded to lower and raise it three times before shooting the decedent. T98 Further, this was not the first time Appellant had been the aggressor in situations involving Green. While the evidence showed Green had attacked Appellant on previous occasions, the evidence also showed that Green had filed for a temporary Victim Protection Order alleging Appellant repeatedly threatened and stalked her and that he had choked her and pulled a knife on her. Appellant's own statements showed he was obsessed with making amends for perceived wrongs committed by Green against him. This evidence, combined with Appellant arriving at the apartment heavily armed, shows he was prepared for a violent confrontation. 199 When the record reveals no evidence of self-defense, the trial court is not bound to instruct on that defense. Smallwood v. State, 1995 OK CR 60, 146, 907 P.2d 217, 230. As the evidence in this case did not support Appellant's statements concerning his claim of self-defense or otherwise support a claim of self-defense, the trial court did not abuse its discretion in refusing to give the requested jury instruction. This proposition of error is denied. 1100 In his sixth proposition of error, Appellant contends the trial court erred in refusing to give his requested instruction on the lesser included offense of manslaughter by resisting criminal attempt. Appellant argues the instruction was warranted based upon evidence that he fired the gun in resisting the attempt of the deceased to commit assault and battery. 1101 Whether any particular offense is a lesser included offense depends upon which lesser included offense test or approach is utilized and whether the trial evidence warrants the instruction. Shrum v. State, 1999 OK CR 41, ¶ 7, 991 P.2d 1032, 1035. \"This two part analysis first requires courts to make a 'legal determination about whether a crime constitutes [a lesser included offense} of the charged crime or whether it is legally possible for the charged crime to include [a lesser included offensel.'\" Id. To determine what constitutes a lesser included offense of any charged crime, this Court looks not only at the elements but also to the crimes the trial evidence tends to prove. Id. 1999 OK CR 41, 119-10, 991 P.2d at 1035.6 *116Prima facie evidence of the lesser included offense must be presented at trial in order to warrant giving the lesser included instruction. Ball, 2007 OK CR 42, ¶ 32, 173 P.3d at 90. Prima facie evidence of a lesser included offense is that evidence which would allow a jury rationally to find the accused guilty of the lesser offense and aequit him of the greater. Eizember, 2007 OK CR 29, ¶ 111, 164 P.3d at 236 citing Hogan v. Gibson, 197 F.3d 1297, 1305 (10th Cir.1999). See also Simpson v. State, 2010 OK CR 6, ¶ 17, 230 P.3d 888, 897 (a lesser offense instruction should not be given unless the evidence would support a conviction for the lesser offense). {102 Manslaughter by resisting criminal attempt is committed when a homicide is \"perpetrated unnecessarily either while resisting an attempt by the person killed to commit a crime, or after such attempt shall have failed.\" 21 0.S8.2001, § 711(8). The term \"unnecessarily\" as used in the statute is equivalent to \"unlawfully\" or \"without legal justification.\" See Committee Comments to OUJI-CR (2d) 4-102. \"An 'unnecessary' killing constituting first-degree manslaughter would thus be found under cireumstances where the defendant did not initiate the difficulty, yet honestly but unreasonably believed either that he is in danger of injury, or that slaying is the only way to prevent injury.\" Id. {103 Once again, the only evidence even arguably supporting Appellant's claim was his statement that the decedent lunged at him. Appellant said he was standing at the door to the apartment when the decedent \"came towards me and I showed them the gun.\" Appellant explained that the decedent then \"jumped back\" and asked what was going on. Appellant said he told the decedent to \"get back\" and pointed the gun at the decedent's chest. Appellant said the decedent kept asking what was going on? Appellant described the decedent as \"acting like he don't wanna back up, like he was trying to be superman or something.\" Appellant said the decedent then \"jumped towards me, I get to the door and close, so he thought he could grab it ... So when he did that, I pulled the trigger.\" Appellant said he \"knew it's over for me... so I just shot this dude.... They started running, I just kept on shooting.\" Appellant said he didn't know if the decedent was \"really trying to hurt me or was he just trying to stop me from doing something\" or he was trying to grab the gun. 1104 This statement does not support a finding that the unarmed decedent was attempting to commit an assault and battery *117upon Appellant. Instead, it shows the decedent was lawfully attempting to protect himself and the other unarmed people, including children, in the apartment. See 21 0.98.2001, § 648(3) (the use or attempt to use force upon or toward another person is not unlawful when committed by the person about to be injured provided the force or violence used is not more than sufficient to prevent such offense). See also Young, 2000 OK CR 17, % 60, 12 P.3d at 39 (defendant not entitled to instruction on resisting eriminal attempt where evidence showed intended victim chose to defend himself). {$105 A defendant's statements concerning the homicide are sufficient to warrant a jury instruction only if those statements are supported by other evidence presented at trial Eizember, 2007 OK CR 29, ¶ 111, 164 P.3d at 286. See also Cipriano, 2001 OK CR 25, 14, 32 P.3d at 873-874, citing Newsted v. Gibson, 158 F.3d 1085, 1092 (10th Cir.1998) (when the only evidence supporting the appellant's claim to an instruction on a lesser form of homicide was his own self-serving statements and those statements were contradictory and inconsistent with the other evidence presented at trial, the evidence is insufficient to warrant the jury instruction). Appellant's statement that the decedent moved toward him was not only inconsistent with other statements he made to police (Appellant also admitted at one point that he shot the decedent as the decedent backed away from him) but with the other evidence presented at trial Both Green and Hooks testified that the decedent did not act aggressively or move towards Appellant but merely stood with his hands up and backed away from Appellant while Appellant pointed the gun at the decedent and lowered it three times before firing. 106 Further, contrary to Appellant's argument, \"any conjecture\" as the trial court put it \"about what position [the decedent] was in when he got shot in the top of his head\" does not support the jury instruction. The medical examiner testified that the gunshot wound to the decedent's head was approximately three-quarters of an inch from the top of his head. She testified that the bullet was fired from long range, traveled downward from the decedent's head and was found at the base of the decedent's tongue. The wound to the top of the decedent's head is more consistent with him having been shot in a defensive position rather than jumping, lunging or moving in some other manner toward Appellant. 107 Appellant has failed to establish a prima facie case that he shot the decedent while resisting a crime or attempted crime. Therefore, the elements of manslaughter by resisting criminal attempt have not been met. Under the evidence presented in this case, a rational jury would not have found Appellant shot the decedent while resisting a crime or attempted crime perpetrated by the decedent, nor would a rational jury have acquitted Appellant of first degree murder in favor of a conviction for first degree manslaughter by resisting criminal attempt. Therefore, the trial court did not abuse its discretion in refusing to give an instruction on the lesser included offense of manslaughter by resisting criminal attempt. This proposition of error is denied. 1108 In his seventh proposition of error, Appellant argues the trial court erred in refusing to give his requested instruction on the lesser included offense of heat of passion manslaughter. Appellant contends that he shot the decedent out of fear for his life after the decedent lunged at him. Appellant admits that while his fear of imminent harm or bodily injury may have been unreasonable under the cireumstances, it is sufficient to mitigate the crime of murder to manslaughter as an \"imperfect self-defense.\" $109 \"A homicide may be reduced from murder to manslaughter where the killing was done because the slayer believed that he was in great danger, even if he was not warranted in such belief or where the slayer although acting in self-defense was not himself free from blame.\" McHam, 2005 OK CR 28, ¶ 14, 126 P.3d at 668, quoting Wood v. State, 1971 OK CR 232, ¶ 9, 486 P.2d 750, 752. See also Le, 1997 OK CR 55, 21, 947 P.2d at 546-547. Depending on the evidence, a jury might conclude that the defendant's self-defense claim is \"imperfect,\" and *118while not sufficient to negate culpability, at least sufficient to mitigate it. In such situations, instructions on heat-of-passion manslaughter may be warranted. Id. 1110 To warrant an instruction on first degree heat of passion manslaughter, there must be evidence that the defendant killed the deceased with adequate provocation, in a heat of passion, without the design to effect death. 21 0.8.2001, § TI11(2). See also Eizember, 2007 OK CR 29, ¶ 112, 164 P.3d at 286. The \"passion\" necessary to support a manslaughter instruction must be so great as to \"render the mind incapable of forming a design to effect death. ...\" Eizember, 2007 OK CR 29, 1112, 164 P.3d at 286. The elements of heat of passion are 1) adequate provocation; 2) a passion or emotion such as fear, terror, anger, rage or resentment; 3) homicide occurred while the passion still existed and before a reasonable opportunity for the passion to cool; and 4) a causal connection between the provocation, passion and homicide. Id. The question is whether, in addition to evidence of intent, there was evidence that Appellant killed the deceased with adequate provocation, in a heat of passion, without the design to effect death. Id. Adequate provocation is measured by an objective test of reasonableness. Bland, 2000 OK CR 11, ¶ 36, 4 P.3d at 715. 111 Appellant refers us to cases finding that heat of passion can result from fear and anger which precludes rational reasonable thought. However, in each case the victim either attacked the defendant without provocation or attacked the defendant with a dangerous weapon.7 These cases do not suggest this instruction is appropriate absent evidence of adequate provocation. 112 In his statement to police, Appellant said he was mad at Green when he went to her apartment. He repeatedly said he took the gun to the apartment because he did not trust Green based upon her previous conduct toward him. He said he didn't know if she was \"setting [him] up\" or \"playing games\" or really wanted to work things out. Appellant said he did not expect a man to be at the apartment. Only onee in his forty-nine page statement to police did he say he was seared. Appellant explained that he did not know what the decedent was doing, whether he was trying to grab for the gun, or \"he was really trying to hurt me, or was he just trying to stop me from doing something. I don't know.... But in the moment of that time, I got seared.\" {113 The unarmed decedent's movement toward the armed Appellant was not sufficient provocation to support heat of passion manslaughter. See Washington v. State, 1999 OK CR 22, ¶ 13, 989 P.2d 960, 968, n. 4 (adequate provocation requires personal vio-lenee by the deceased likely to cause pain, bloodshed or bodily harm).8 Even by Appellant's own statement, the decedent had not verbally threatened him. At most, the men were arguing about what was going on, and not engaged in a physical altercation. Any movement by the decedent towards Appellant could reasonably be seen as an attempt to defend and protect himself, Green, and Hooks. Appellant is not entitled to a heat of passion manslaughter instruction because the decedent attempted to defend himself and protect others. Id. See also Young, 2000 OK CR 17, ¶ 60, 12 P.3d at 39. Further, Appellant's single, general statement that he was scared during the commission of the offense is not enough to establish the requisite fear or terror neces*119sary to support heat of passion manslaughter. See Jones v. State, 2006 OK CR 17, ¶ 7, 134 P.3d 150, 154 (defendant's claim of \"[bJeing 'seared after being grabbed while committing First Degree Murder does not\" warrant instruction on First Degree Manslaughter). T115 After reviewing Appellant's statement to the police, by itself, and in context of the other evidence presented at trial, a pri-ma facie case of manslaughter was not established as no reasonable juror could find that Appellant acted in a heat of passion on adequate provocation that rendered him incapable of forming a design to effect death. The evidence in this case would not permit a jury rationally to find Appellant guilty of the lesser offense of heat of passion manslaughter and acquit him of first degree murder. Therefore, the trial court did not abuse its discretion in refusing the requested instructions. T116 Appellant also raises a federal constitutional claim to lesser included instructions under Beck v. Alabama, 447 U.S. 625, 683-45, 100 S.Ct. 28382, 65 L.Ed.2d 392 (1980), and Hogan v. Gibson, 197 F.3d 1297 (10th Cir.1999). Appellant argues that without the manslaughter instructions or any lesser included instructions, the jury's only options were convicting him or acquitting him of first degree murder and the trial court's failure to provide the jury with a third, non-capital option violated his Eighth and Fourteenth Amendment rights. T117 In Beck, the Supreme Court held that a death sentence cannot constitutionally be imposed unless the jury is permitted to consider a verdict of guilt as to a lesser-included non-capital offense, provided that the evidence would support such a verdict. Id. at 627, 100 S.Ct. 2882. Without such an instruction, the Court reasoned, defendants would be subject to a heightened risk of erroneous conviction if juries were presented only with the stark choice either to convict a defendant of a capital offense or set him free. Id. at 637, 100 S.Ct. at 2389. Accordingly, the denial of a proper lesser-included non-capital instruction, when warranted by the evidence, violates due process by \"diminish[ing] the reliability of the guilt determination.\" Id. at 688, 100 S.Ct. at 2890. 1118 The applicability of Beck to Oklahoma has been met with some inconsistency. In Le, 1997 OK CR 55, ¶ 22, 947 P.2d at 547, this Court stated that Beck is not applicable in Oklahoma as the Oklahoma death penalty scheme allows the jury to choose between acquittal, life, life without parole, or death. See also Williams, 2001 OK CR 9, 132, 22 P.3d at 714; Young, 2000 OK CR 17, 11 52-53, 12 P.3d at 88; Davis v. State, 1999 OK CR 16, 1 19, 980 P.2d 1111, 1117; Cummings v. State, 1998 OK CR 45, 142, 968 P.2d 821, 834. T 119 The Tenth Cireuit Court of Appeals adopted the same reasoning in United States v. McVeigh, 158 F.8d 1166, 1197 (10th Cir. 1998). However, a year later they found Beck did apply even where there is a later opportunity to sentence to life imprisonment rather than death, Boyd v. Ward, 179 F.3d 904, 916 (10th Cir.1999). In Hooks v. Ward, 184 F.3d 1206, 1227 (10th Cir.1999), the Tenth Circuit attempted to clear up the confusion by \"explicitly disapprov[ing] the language in McVeigh suggesting that Beck does not apply when a jury has sentencing discretion to issue a penalty less than death.\" 184 F.3d at 1227. The Tenth Cireuit went on to say \"a proper reading of Beck entitles a defendant in a capital case to a lesser included instruction when the evidence warrants it, notwithstanding the fact that the jury may retain discretion at sentencing to issue a penalty less than death.\" Id. Since then, the Tenth Cireuit has consistently held Beck applicable to Oklahoma. Phillips v. Workman, 604 F.3d 1202, 1210-1216 (10th Cir.2010); Taylor v. Workman, 554 F.8d 879, 8902-893 (10th Cir.2009); Wilson v. Sirmons, 536 F.3d 1064, 1103 (10th Cir.2008); Young v. Sir mons, 486 F.8d 655, 670 (10th Cir.2007); Ma-licoat v. Mullin, 426 F.3d 1241, 1252-1254 (10th Cir.2005); Darks v. Mullin, 327 F.3d 1001, 1008-1009 (10th Cir.2008); Mitchell v. Gibson, 262 F.3d 1086, 1050 (10th Cir.2001); Hogan, 197 F.Bd at 1804. Therefore, until the United States Supreme Court rules on the application of Beck to Oklahoma, we will follow the guidance provided by the Court of Appeals. *120120 Turning to the merits of Appellant's claim, a Beck claim has two components. Phillips, 604 F.3d at 1210. \"First, [a capital defendant] must establish that the crime on which the trial court refused to instruct was actually a lesser-included offense of the capital crime of which he was convicted\". Id., citing Hogan, 197 F.3d at 1306. \"Second, he 'must show that the evidence presented at trial would permit a rational jury to find him guilty of the lesser included offense and acquit him of first degree murder.\"\" Id., quoting Young, 486 F.8d at 670. 1121 As we have previously discussed, inter alia, first degree manslaughter is a lesser included offense of first degree murder. Therefore, Appellant has met the first step. Considering the evidence in this case, Appellant's statement about the homicide, considered in isolation, might support a conviction for manslaughter. However, we do not review a defendant's statement in isolation but rather in context with the other evidence presented at trial, Eizember, 2007 OK CR 29, §111, 164 P.3d at 236. If the statement is contrary to or inconsistent with other evidence presented at trial, it is insufficient to warrant a jury instruction on a lesser included offense. Id. Here, Appellant's statement was inconsistent on its face and with all of the other evidence presented at trial. \"Viewing the totality of the evidence presented at trial, any inference of provocation is mere speculation and therefore insuffi-clent to establish the adequate provocation needed to support heat of passion manslaughter.\" Darks, 327 F.3d at 1011. The evidence in this case would not permit a rational jury to acquit Appellant of first degree murder in favor of a finding of guilt for heat of passion manslaughter or manslaughter by resisting criminal attempt. {122 Beck requires an instruction only when supported by the evidence. Beck does not require the jury in a capital case be given a third, non-capital option \"where the evidence absolutely does not support that option\". Turrentine v. State, 1998 OK CR 33, ¶ 36, 965 P.2d 955, 970 (emphasis added). Where no lesser included offense exists, a lesser included offense instruction detracts from, rather than enhances, the rationality of the process. Beck does not require that result ... Beck does not require that the jury be tricked into believing that it has a choice of crimes for which to find the defendant guilty, if in reality there is no choice. Such a rule not only would undermine the public's confidence in the criminal justice system, but it also would do a serious disservice to the goal of rationality on which the Beck rule is based. Spaziano v. Florida, 468 U.S. 447, 455-56, 104 S.Ct. 3154, 3159-3160, 82 L.Ed.2d 340 (1984). $123 The evidence in this case did not establish a prima facie case of the elements of heat of passion manslaughter or manslaughter by resisting criminal attempt and was therefore insufficient to support instructions on those lesser included offenses. Therefore, Appellant was not denied his right to due process under Beck and its progeny when the trial court refused to instruct the jury on first degree manslaughter. SECOND STAGE ISSUES 1 124 In his thirteenth proposition of error, Appellant contends his death sentence should be vacated because the aggravating circumstances were not charged in an information or Indictment, were not subjected to adversarial testing at a preliminary hearing and therefore were not determined to probably exist by a neutral and detached magistrate. Thus, Appellant argues, the District Court never acquired jurisdiction over the aggravating cireumstances. {125 This very argument has been previously rejected by this Court in Davis v. State, 2004 OK CR 36, ¶¶ 44-46, 103 P.3d 70, 82-83; Thacker v. State, 2004 OK CR 32, 119-22, 100 P.3d 1052, 1055-57 and Primeaux v. State, 2004 OK CR 16, ¶¶ 14-16, 88 P.3d 893, 899-900. Appellant not only fails to acknowledge these rulings but also fails to offer any new arguments to undermine them. Accordingly, this proposition of error is denied. 1126 Appellant challenges the constitutionality of the \"great risk of death\" aggravating cirenmstance in his fourteenth proposition of error. See 21 0.$.2001, § 701.12(2). *121First, he argues that it does not narrow the class of offender because proof of the aggra-vator required the same intent alleged in the two counts of Shooting with Intent to Kill. [ 127 This Court has rejected similar arguments and upheld the constitutionality of this aggravator. See Jackson v. State, 2007 OK CR 24, ¶ 31, 163 P.3d 596, 605; Dodd v. State, 2004 OK CR 31, ¶ 108, 100 P.3d 1017, 1048; Hooper v. State, 1997 OK CR 64, ¶¶ 40-41, 947 P.2d 1090, 1106; Paxton v. State, 1998 OK CR 59, ¶¶ 6-8, 867 P.2d 1309, 1316. Appellant has not provided persuasive argument as to why we should reconsider this well-established precedent and we decline to do so at this time. $128 Appellant next challenges the sufficiency of the evidence supporting the aggravator. In order to determine whether the State has met its burden in proving an aggravating circumstance, this Court reviews the record in the light most favorable to the State to determine whether any rational trier of fact could have found the facts necessary to support the aggravating cireumstance beyond a reasonable doubt. Eizember, 2007 OK CR 29, ¶ 123, 164 P.3d at 289. 1129 The aggravating circumstance of creating a great risk of death to more than one person is proved by a defendant's acts which create a risk of death to another in close proximity, in terms of time, location, and intent to the killing. Id. The rationale behind the aggravator is that, by its very language, there must be a risk of death, that risk must be to more than one person, it must be great, and the defendant must know that risk exists. Id. It is not merely the death of more than one person that satisfies this aggravator, but the acts of a defendant that create a great risk of death to at least one other person who is near to the homicide. Id. 2007 OK CR 29, ¶ 125, 164 P.3d at 239. In fact the death of a person other than the homicide victim is not a prerequisite for a finding of this aggravator. Id. The gravamen of the circumstance is not the number of persons killed, but the callous creation of the risk to more than one person. Id. 130 In the present case, all three victims were within view of each other in the confines of the small apartment living room when Appellant opened fire. The record shows Green made it to an adjacent bathroom after being shot, and that Smith ducked to avoid being hit. The record also shows that Hooks ran to the adjacent kitchen and then was shot when she fell to the floor. Appellant's use of deadly force against three people at close range was sufficient to support the aggravating circumstance. See Stouffer v. State, 1987 OK CR 92, 172, 738 P.2d 1349, 18361. This assignment of error is denied. 1131 Appellant next challenges the aggravating circumstance that the murder was committed while Appellant was serving a sentence of imprisonment for a felony. See 21 0.8.2001, § 701.12(6). Appellant asserts the aggravator was designed to apply only to killings in a correctional facility or some other area of confinement and not to those like himself who were on parole at the time of the murder. [ 132 This Court has consistently rejected claims that this aggravator is limited to cases where the murder occurs in a prison facility. Matthews v. State, 2002 OK CR 16, ¶ 48, 45 P.3d 907, 922; Humphreys v. State, 1997 OK CR 59, ¶ 31, 947 P.2d 565, 575. This Court has found the aggravator constitutional as applied to those on pre-parole status, Matthews, 2002 OK CR 16, ¶ 48, 45 P.3d at 922; McCracken v. State, 1994 OK CR 68, 11 32-33, 887 P.2d 323, 331; those participating in a house arrest program rather than serving a sentence in prison, Humphreys, 1997 OK CR 59, 130, 947 P.2d at 576; and escapees, Duckett v. State, 1995 OK CR 61, ¶¶ 80-83, 919 P.2d 7, 25-26. 133 Here, Appellant was on parole for three separate convictions from the state of Texas when he murdered the decedent. His Oklahoma parole officer testified that even though Appellant was in the community on parole, he was considered to be serving a sentence of incarceration. That Appellant was serving a term of imprisonment under Texas law does not foreclose application of the aggravator as this Court has not limited the aggravator to those imprisoned on solely Oklahoma convictions. Patton v. State, 1998 OK CR 66, 1 94, 973 P.2d 270, 297. Although *122not incarcerated at the time he committed the murder, Appellant was still \"serving a sentence of imprisonment on conviction of a felony\" and this evidence sufficiently supported the existence of the aggravating circumstance. This proposition of error is denied. 1134 In his sixteenth proposition of error, Appellant contends the \"continuing threat\" aggravating cireumstance is unconstitutional based on Cudjo v. State, 1996 OK CR 43, 925 P.2d 895. \"The existence of a probability that the defendant would commit criminal acts of violence that would constitute a continuing threat to society\", better known as the \"continuing threat\" aggravating circumstance has been found constitutional by this Court. See Williams v. State, 2008 OK CR 19, ¶ 104, 188 P.3d 208, 228; Harris v. State, 2007 OK CR 28, ¶ 22, 164 P.3d 1103, 1112; McElmurry v. State, 2002 OK CR 40, ¶ 84, 60 P.3d 4, 24-25; Myers v. State, 2000 OK CR 25, ¶¶ 70-74, 17 P.3d 1021, 1036-37. 135 The Cudjo case did not address the constitutionality of the aggravator. In that case, this Court ruled the evidence insufficient to support the aggravator, finding that the State did not demonstrate the defendant would continue to present a threat to society after sentencing. Id. 1996 OK CR 48, 130, 925 P.2d at 902. In finding the evidence insufficient, the Court also looked to the defendant's criminal history, the callousness of the crime, threats against others, lack of remorse, and attempts to prevent calls to the police. Id. 1136 More recently in Warner, 2006 OK CR 40, 1 126, 144 P.3d at 879, this Court said that to support the aggravator of \"continuing threat\", \"the State must present evidence showing the defendant's behavior demonstrated a threat to society and a probability that threat would continue to exist in the future.\" Id. Further, \"[to prove this aggravating circumstance, ... the State may present any relevant evidence, in conformance with the rules of evidence, including evidence from the crime itself, evidence of other crimes, admissions by the defendant of unadjudicated offenses or any other relevant evidence.\" Id. \"A finding that the defendant would commit eriminal acts of violence that would constitute a continuing threat to society is appropriate when the evidence establishes the defendant participated in other unrelated criminal acts and the nature of the crime exhibited the calloused nature of the defendant.\" Id. 137 In support of the aggravator in the present case, the State presented evidence that on November 11, 1991, Appellant and three other youths severely beat a sixteen year old schoolmate for nothing more than the coat he was wearing. When Appellant was arrested for this crime a short time later, he was wearing the coat. The State also showed that on November 12, 1992, Appellant was arrested after crashing and rolling the stolen vehicle he was driving on an interstate highway. Appellant had a loaded .25 caliber semiautomatic handgun in his possession at the time and told police he kept the gun because he was a gang member and a rival gang was attempting to kill him. {138 Additionally, the State's evidence showed that on October 17, 1998, Appellant pushed his fourteen year old ex-girlfriend, Takisha Powdrill, against a wall, argued with her regarding her subsequent relationship then put a gun to her head. When Appellant left her, he told her, \"he was going to be back\" which she took to mean \"he was going to come back and kill me.\" Powdrill testified she knew what was going to happen when Appellant cornered her because he had been physically abusive before and she ended the relationship because of the abuse. The State's evidence also showed that on April 14, 1994, Appellant was arrested at a known drug house and found in possession of 12 rocks of crack cocaine and a 9 mm handgun with twenty-three rounds and a round loaded in the chamber. When police, who were in full uniform, initially approached Appellant, he fled the residence. On August 11, 2002, a domestic altercation occurred between Appellant and Tia Green where Appellant beat her while she was on the ground and defenseless. Additionally, Appellant was on parole for felony convictions from Texas at the time of the murder. {139 Appellant's criminal history shows a pattern of escalating violence. This evi*123dence, combined with the evidence of the shootings of Smith, Green and Hooks overwhelmingly supported the aggravator as establishing the existence of a probability that Appellant would commit criminal acts of violence that would constitute a continuing threat to society. This proposition of error is denied. 1140 In his seventeenth proposition of error, Appellant contends that Oklahoma's lethal injection is eruel and unusual punishment in violation of the Eighth Amendment to the United States Constitution and the corresponding provisions of the Oklahoma Constitution. Appellant argues that: 1) the protocol leaves discretion with the Warden for decisions surrounding the actual administration of the chemical (except for dosage and IV sites), thus insulating the process from any sort of accountability for a \"botched execution\"; 2) the identities of the executioners are kept secret; 3) there is no \"back up\" plan should a doctor be unavailable to assist with an execution; and 4) the IV is not inserted by a doctor. Appellant offers no authority for his claim, either factual or legal, save for a footnote reference to an article appearing in the New York Times newspaper on October 7, 2008. T 141 Appellant filed a motion in the trial court challenging Oklahoma's lethal injection protocol. However, the challenge was limited to the three chemicals used. It did not address the procedure surrounding the administration of those chemicals. Based upon Appellant's failure to present the issue now raised on appeal to the trial court first, and due to Appellant's failure to cite any supporting authority for his claim on appeal, we find Appellant has not provided this Court with a sufficient record and legal argument to allow us to appropriately address the issue. See Rule 3.5(C), Rules of the Oklahoma Court of Criminal Appeals, Title 22, Ch.18, App. (2011). See also Warner, 2006 OK CR 40, ¶ 148, 144 P.3d at 883; Stouffer v. State, 2006 OK CR 46, ¶ 209, 147 P.3d 245, 281. Further, this Court has previously found Oklahoma's execution protocol constitutional. Malicoat v. State, 2006 OK CR 25, 16, 187 P.3d 1234, 1237. This proposition is denied. SECOND STAGE JURY INSTRUCTIONS $143 In proposition of error eighteen, Appellant raises his sole challenge to the second stage jury instructions by objecting to Instruction No. 10 which stated in pertinent part; \"Mitigating cirenmstances are factors which in fairness, sympathy, and mercy, may extenuate or reduce the degree of moral culpability or blame. The determination of what cireamstances are mitigating is for you to resolve under the facts and cireumstances of this case.\" The defense objected to this instruction and provided the court with a modified version. The trial court overruled the objection. Now on appeal, Appellant argues that Instruction No. 10 prevented the jury from considering any mitigating evidence which did not tend to reduce his moral culpability or blame for the murder, but which nevertheless served as a legitimate reason why he should not be sentenced to death. 144 The instruction given to the jury in this case was verbatim OUJI-CR (2d) 4-78.9 The jury was also given OUJI-CR (2d) 4-79, which included a list of mitigating evidence and additional instructions which allowed the jury to consider other mitigating cireum-stances, if found to exist. This Court has previously analyzed these instructions and determined they are appropriate. See *124Williams, 2008 OK CR 19, 1102-103, 188 P.3d at 227-228. T 145 Appellant directs us to Harris, 2007 OK CR 28, 164 P.3d 1108, and argues this Court found OUJI-CR (2d) 4-78 was not clear enough to eliminate the possibility of misunderstanding. In Harris this Court said \"[wle do not find that the current uniform jury instruction [4-78] prohibits jurors from considering mitigating evidence\", and \"[the uniform jury instruction given in this case did not unconstitutionally limit the jury's ability to consider mitigating evidence\". Id., 2007 OK CR 28, 1125 and 28, 164 P.3d at 1113-1114. T 146 Despite the Court's recommendation of a clarifying amendment to the language of the instruction, the Court emphasized \"that the language of the current instruction itself is not legally inaccurate, inadequate, or unconstitutional. Cases in which the current OUJI-CR (2d) 4-78 has been used and applied are not subject to reversal on this basis.\" Id., 2007 OK CR 28, 1 26, 164 P.8d at 1114. The real concern for the Court in that case was the prosecution's second stage closing argument telling the jury not to consider the defendant's mitigating evidence and the prosecutor's \"consistent misuse of the language in the instruction.\" Id. 4 147 In the present case, the jury heard nine mitigation witnesses in a single day. These witnesses were all members of Appellant's family. They testified to his background and upbringing, alleged good qualities and characteristics and their love for him. They asked the jury to spare Appellant's life by imposing a sentence less than death. The testimony of these witnesses was summarized into ten specific mitigating factors for the jury's consideration as well as any other evidence the jury might consider mitigating. {148 The prosecution's closing argument does not present the same concerns as those in Harris In fact, the prosecutor told the jury to consider all of Appellant's evidence, but argued it was not sufficiently persuasive to support a sentence of less than death. Further, defense counsel specifically told the jury to consider and analyze the mitigating evidence, to weigh it against the State's aggravating circumstances and that \"fairness, sympathy and mercy are things that are proper for you to consider.\" T149 Reading the second stage instructions as a whole, the jury was properly instructed on the definition of mitigating evidence. There is not a reasonable likelihood Instruction No. 10 misled the jury into believing it could not consider Appellant's mitigating evidence. Therefore, we find the trial court did not abuse its discretion in giving Instruction No. 10. This proposition of error is denied. ISSUES RELEVANT TO BOTH STAGES OF TRIAL 1150 In his tenth proposition of error, Appellant asserts the trial court committed reversible error in admitting State's Exhibit 100, a recording of the 911 emergency call made by Hooks from the crime scene within minutes of being shot. The recording was admitted over defense objections to its relevance and prejudice. Appellant contends he was prejudiced in both stages of trial by the admission of the recording. 1 151 The recording begins with a series of screams, then goes silent for over a minute. Hooks later tells the operator that she, her sister, and her brother-in-law had been shot and an ambulance was needed. In the background, children can be heard erying and screaming. One of the children got on the phone and told the operator his mother was \"dying\" and that there is \"blood all over the kitchen floor\". When asked who shot his mother, the child replied that he does not know, that they were asleep and then heard someone start screaming. The sounds of the responding officers attempting to remove the children from the apartment finish out the call. Appellant argues that the recording did not convey anything to the jurors that had not been brought out by the testimony of Hooks and Green, and that the recording did not materially assist the State in its case except for the \"huge amount of prejudicial emotion that it generates.\" {152 We have previously upheld the admission of 911 tapes in cases where the party on the tape testifies at trial. See Williams, *1252008 OK CR 19, 171, 188 P.3d at 228; Stouf-fer, 2006 OK CR 46, TT 114-17, 147 P.8d at 269. The recording in this case was relevant as it corroborated both Hooks' and Green's versions of what happened in the apartment immediately after the shootings. This was particularly important in light of defense counsel's thorough eross-examination of the women and attempts to impeach their descriptions of the crime and surrounding circumstances. The recording showed Hooks demeanor after being shot and explained how she might have trouble remembering details from the night of the shooting, and it tended to rebut Appellant's claim that Hooks walked to the bathroom after being shot in order to dispose of some marijuana. The recording in this case did not constitute testimonial evidence and is just the type of 911 call evidence the United States Supreme Court approved in Davis v. Washington, 547 U.S. 813, 827-828, 126 S.Ct. 2266, 2277, 165 L.Ed.2d 224 (2006). €153 While the emotional impact of the recording is undeniable, it is not so prejudicial as to have \"swept all before it\" as Appellant claims. In light of the other evidence presented by the State, the recording did not confuse the issues, mislead the jury, result in a needless presentation of cumulative evidence, cause unfair and harmful surprise to the defense or in any other way unfairly prejudice the defense. See 12 00.85.2001, § 2402. 154 As for its impact on the sentencing stage of trial, Appellant argues the reincorporation of the first stage evidence into the second stage, \"undoubtedly tainted the sentence\" and the impact of all of the above described irrelevant evidence rendered the sentencing procedure too unreliable to meet the standards of the Eighth Amendment. As discussed above, the State presented extensive evidence during the sentencing stage of three aggravating circumstances and victim impact testimony from the decedent's family. In response, the defense presented extensive evidence in mitigation concerning Appellant's family and background. Nothing in this process renders Appellant's sentencing stage too unreliable to meet constitutional muster. Accordingly, we find the trial court did not abuse its discretion in admitting the 911 recording. This proposition of error is denied. 1155 In his eleventh proposition of error, Appellant argues the trial court erred in excluding evidence of the decedent's criminal record and prior bad acts. The excluded evidence were copies of police reports detailing the decedent's juvenile crimes including acts of animal eruelty, first and second degree burglary, and assault and battery. Appellant asserts that exclusion of the evidence prevented him from presenting evidence which supported his claim of self-defense as well as evidence which negated the aggravating circumstance of \"heinous, atrocious or cruel.\" 1156 \"Whether Appellant was denied the right to present a defense ultimately turns on whether the evidence at his disposal was admissible.\" Pavatt, 2007 OK CR 19, ¶ 45, 159 P.3d at 287. The admission of evidence is left to the sound discretion of the trial court and will not be disturbed absent an abuse of discretion. Williams, 2001 OK CR 9, ¶ 94, 22 P.3d at 724. 1157 In a homicide case where the defense is that of self-defense, acts of violence by the victim antecedent to the homicide may be introduced where the defendant was aware of the specific prior acts of violence and that awareness or knowledge helped form the basis for his purported fear of the victim resulting in the alleged act of self-defense against the victim, and tending to establish the victim as the aggressor. See Conover v. State, 1997 OK CR 6, YT 25-27, 933 P.2d 904, 912; Bechtel v. State, 1992 OK CR 55, 142, 840 P.2d 1, 13; Harris v. State, 1965 OK CR 29, 123, 400 P.2d 64, 70; Thompson v. State, 1961 OK CR 105, ¶ 4, 365 P.2d 834, 887; Murphy v. State 72 Okla.Crim. 1, 112 P.2d 488, 456 (1941); Edwards v. State, 58 Okla.Crim. 15, 48 P.2d 1087, 1097 (1985); Brock v. State, 55 Okla.Crim. 410, 32 P.2d 88, 89-90 (1984); Mulkey v. State, 5 Okla.Crim. 75, 118 P. 582, 538, 1911 OK CR 41; Sneed v. Territory, 16 Okl. 641, 86 P. 70, 72. 1158 Since this principle of law was first established, the Evidence Code has been enacted. Under 12 0.8.2001, § 2404(A)(2), *126evidence of a \"pertinent\" character trait of a victim is admissible. Onee the trial court has determined the particular character trait is \"pertinent\" or relevant, and an essential element of the charge or defense, proof may be made by specific instances of conduct. 12 ©.98.2001, § 2405. In a case where the defense is self-defense, this \"pertinency\" requirement limits admission of evidence to those traits of character that would have affected the defendant's perception of the threat with which he was confronted.10 Acts unknown to the defendant prior to the homicide cannot meet the \"pertinency\" requirement for admissibility purposes. 159 Reading the Evidence Code to conform to and in conjunction with the long standing rules of self-defense, § 2404(A)(2) did not do away with the principle that to be admissible in self-defense cases, acts of violence perpetrated against a third party must be known to the defendant, but sought to codify that rule in light of the established case law. This is evident by the insertion of the \"pertinency\" requirement only in subsection (A)(2) and not in other sections of the Evidence Code addressing character evidence. 4 160 In the present case, Appellant failed to present sufficient evidence to raise the defense of self-defense. See Propositions VI and VII. Even if he had sufficiently raised the defense of self-defense, Appellant failed to make a preliminary showing at trial that he was aware of the alleged instances of violence committed by the decedent which he now complains of on appeal. While Appellant said he recognized the decedent when he entered the apartment, and knew he was a \"gangster,\" he never said he fired at the decedent because he was aware of the decedent's previous criminal acts as a juvenile and feared for his life because of that knowledge. Appellant said he fired at the decedent because the decedent lunged at him. 1161 In his appellate brief, Appellant asserts \"a realistic-looking toy gun\" found at the scene \"could have made [him] feel more threatened.\" This claim does not support Appellant's argument for several reasons. First, Appellant made no mention of the toy gun in his statements to police. Second, the undisputed testimony from Hooks established that the toy gun was not on the living room floor when Appellant entered the apartment and most likely one of the children dropped it there when they ran out of the back bedroom immediately after the shootings. And third, the crime seene investigator testified, that based on her initial observations at the crime seene, the gun was very obviously a toy. This is confirmed by photographs of the item. 162 Because Appellant presented insufficient evidence to support the defense of self-defense and because he did not indicate he was aware of the decedent's prior criminal history or that such awareness or knowledge helped form the basis for his purported fear of the victim resulting in the alleged act of self-defense, the trial court did not abuse its discretion in excluding the evidence from the first stage of trial. 163 As for the exclusion of the evidence during the second stage of trial, Appellant claims it would have negated the alleged aggravator of \"heinous, atrocious or cruel.\" However, the record reflects the existence of that aggravating cireumstance was never alleged by the State. 164 At trial, defense counsel argued: 1) the State's victim impact evidence showed the decedent's good character and therefore opened the door to defense evidence regarding the decedent's criminal history; 2) the evidence was relevant in showing Appellant's state of mind when he fired the gun; and 3) the evidence reduced Appellant's moral culpability for the crime and presented an aceu-rate portrayal of the life that was extinguished, relying on Conover v. State, 1997 OK CR 6, 983 P.2d 904. {165 In rejecting these arguments, the trial court stated that it had reviewed the victim impact statements and any references to the decedent's character had been redact*127ed. Our review of the victim impact evidence supports this conclusion. Testimony from the decedent's mother, father and brother related each family member's sense of loss and grief, the impact the murder had on each of them and the fact that they loved the decedent. At trial, defense counsel claimed that the decedent's father's testimony that the decedent was a Christian and a member in good standing of his church was improper character evidence. Even if this was a reference to the decedent's character, it was not sufficient to open the door to evidence of the decedent's history of juvenile crime. \"[A] criminal trial is not to be based upon so-called 'character' evidence, and the same principle applies to sentencing proceedings.\" Malone v. State, 2002 OK CR 34, 1 8, 58 P.3d 208, 210. T166 Further, the evidence was properly excluded under Conover. In that case, this Court found trial court error in excluding evidence of the decedent's drug use as it kept the jury from having a complete picture of the crime. Id. 1997 OK CR 6, 1177-79, 983 P.2d at 912, 922-28. In the present case, the decedent's history of juvenile erime had nothing to do with his murder and inclusion of the evidence would not have added to the jury's picture of the crime. The trial court appropriately noted that in looking at the entire crime in this case, \"it had nothing to do with self-defense issues ... It has to do with a person that was a bystander. He just happened to be there at the wrong time.\" 1 167 To the extent the decedent's juvenile crimes were relevant to Appellant's state of mind when he fired the gun; the jury had already found Appellant intentionally and with premeditation killed the decedent. Any evidence concerning his state of mind was no longer relevant. See Rojem v. State, 2006 OK CR 7, 1 56, 130 P.3d 287, 298-99 (improper for issue of residual doubt to make its way into a capital sentencing proceeding). 1168 Further, we fail to see how this evidence could in any way be considered mitigating. Evidence of the decedent's criminal history which had no relation to the crime and of which the Appellant was not aware does not reduce the degree of Appellant's moral eulpability or blame, and are not cireumstances which in fairness, sympathy or merey may lead jurors to decide against imposing the death penalty. See OUJI-CR (2d) 4-78 (definition of mitigating ciream-stances). T169 Finally, Appellant relies on Chambers v. Mississippi, 410 U.S. 284, 98 S.Ct. 1088, 1049, 85 L.Ed.2d 297 (1973) and Green v. Georgia, 442 U.S. 95, 99 S.Ct. 2150, 60 L.Ed.2d 788 (1979) for the proposition that evidence bearing persuasive assurances of trustworthiness must be admitted regardless of the application of state evidentiary rules, when that evidence is critical to a capital defendant's case. 1 170 Chambers and Green both concerned evidence which was highly relevant to the defendant's defense. In Chambers, the United States Supreme Court found that a confession to the crime from a third person, made to three close acquaintances on separate occasions shortly after murder, and corroborated by other evidence in the case, where the confessions were unquestionably statements against interest, and where the person was present in the courtroom at defendant's trial for the same murder and was under oath and subject to eross-examination, could not be excluded from evidence by the mechanistic application of the hearsay rule \"to defeat the ends of justice\" by preventing the defendant from introducing the testimony of the persons to whom the confessions had been made. 410 U.S. at 802, 98 S.Ct. at 1049. T 171 In Green, the Supreme Court found that exclusion of testimony that a second defendant confided to a witness that he had killed the victim after ordering the defendant to run was relevant to a critical issue in the punishment phase of the defendant's murder trial, and thus exclusion of such testimony denied the defendant a fair trial on issue of punishment and constituted a violation of due process clause. 442 U.S. at 97, 99 S.Ct. at 2151-2152. The present case does not fall within the dictates of either Chambers or Green. 1172 In Holmes v. South Carolina, 547 U.S. 319, 126 S.Ct. 1727, 164 L.Ed.2d 503 (2006) it was stated: *128While the Constitution thus prohibits the exclusion of defense evidence under rules that serve no legitimate purpose or that are disproportionate to the ends that they are asserted to promote, well-established rules of evidence permit trial judges to exclude evidence if its probative value is outweighed by certain other factors such as unfair prejudice, confusion of the issues, or potential to mislead the jury ... Plainly referring to rules of this type, we have stated that the Constitution permits judges \"to exclude evidence that is 'repetitive ..., only marginally relevant' or poses an undue risk of 'harassment, prejudice, [or] confusion of the issues. 547 U.S. at 326-827, 126 S.Ct. at 1782-1788 {internal citations omitted). 173 Evidence of the decedent's history of juvenile crime, unrelated to his murder, was simply not relevant in either the first or second stage of this case and was properly excluded. There is no possible federal constitutional violation from the omission of the This assignment of error is de-evidence. nied. ALLEGATIONS OF PROSECUTORIAL MISCONDUCT 1174 In his twelfth proposition of error, Appellant alleges that several instance es of prosecutorial misconduct denied him a fair trial. It is well established that \"a erimi-nal conviction is not to be lightly overturned on the basis of a prosecutor's comments standing alone, for the statements or conduct must be viewed in context; only by so doing can it be determined whether the proseceutor's conduct affected the fairness of the trial.\" Ryder v. State, 2004 OK CR 2, 182, 83 P.3d 856, 875, quoting United States v. Young, 470 U.S. 1, 11, 105 S.Ct. 1088, 1044, 84 L.Ed.2d 1, 11 (1985). In order for the remarks of the prosecuting attorney to constitute reversible error they must be flagrant and of such a nature as to be prejudicial to the defendant. Id. From a practical standpoint, every slight excess by the prosecutor does not require that a verdict be overturned and that a new trial be ordered. Id. T175 Appellant first complains that during the first stage closing argument, the prosecutor misstated the law and attempted to shift the burden of proof by arguing that Appellant's intent to kill \"could be presumed\" as to all three victims. (Appellant's brief, pg. 70). In support, Appellant directs us to eleven specific transcript pages. 1176 A recurring theme of the prosecutor's closing argument was that Appellant's acts of pointing the loaded gun at the victims' head and body and pulling the trigger showed his intent to kill them. Defense counsel's initial objection to the argument on grounds that the prosecution could not argue that intent was to be presumed and that the argument shifted the burden of proof to the defense was overruled as it was closing argument. After a subsequent objection on the same grounds was overruled, defense counsel asked for and was given a continuing objection any time that argument was made by the prosecutor. Therefore, the claim of error has been properly preserved for appellate review. {177 Upon reviewing the prosecutor's arguments, we find no calls to the jury to presume Appellant intended to kill. Also absent are any attempts to shift the burden of proof to the defense to prove that Appellant did not intend to kill. Instead, we find accurate statements of the law that intent to kill can be proven by the evidence. See 21 ©.9$.2001, § 701.7(A) (\"[mlalice is that deliberate intention unlawfully to take away the life of a human being, which is manifested by external circumstances capable of proof\") (emphasis added); 21 0.8.2001, § 702 (\"[a] design to effect death [i.e., premeditation] is inferred from the fact of killing, unless the cireumstances raise a reasonable doubt whether such design existed\"). See also Young, 2000 OK CR 17, ¶ 61, 12 P.3d at 39; Phillips v. State, 1999 OK CR 38, 127, 989 P.2d 1017, 1029 (malice aforethought may be proved by cireumstantial evidence). Further, the prosecutor repeatedly referred the jury to the instructions and law stated therein concerning the burden of proof and the elements of the offenses. After reviewing the entirety of the prosecutor's argument in this area, we find no error. *1291178 Next, Appellant contends the prosecution argued facts not in evidence first by arguing that it was \"not real easy to chamber a round when you got a full magazine, it takes some effort.\" When the prosecutor attempted to explain how it would be done, defense counsel objected on the grounds the argument was outside the evidence and moved for a mistrial The trial court overruled the motion for a mistrial but sustained the objection and admonished the jury to disregard the statement and rely on their own memory and life experiences. This cured any error. See Romano v. State, 1995 OK CR 74, ¶ 61, 909 P.2d 92, 116. 1179 Later, the prosecutor argued that Appellant must have taken the safety off of the gun prior to entering the apartment. Appellant's objection was overruled. As the prosecutor stated, the argument was based on the evidence. The ballistics expert testified that most all semiautomatic and automatic weapons have safeties so someone is not shot accidentally. He further testified that the safety would have to manually disengage and explained to the jury the process for doing so. Nothing in the testimony by Green and Hooks indicates that once inside the apartment Appellant removed the safety as described by the expert. Further, as argued by the prosecutor, Appellant made no mention in his interview with police about removing the safety after he arrived at the apartment. The prosecutor's comments were proper inferences on the evidence. See Bland, 2000 OK CR 11, ¶ 97, 4 P.3d at 728. $180 Appellant also contends that during first stage closing arguments, the prosecutor denigrated defense counsel by referring to two different arguments made by defense counsel as \"red herrings.\" Neither comment drew an objection; therefore we review only for plain error. Bland, 2000 OK CR 11, ¶ 91, 4 P.3d at 727. {181 A review of the comments made in this case shows they were made in response to arguments raised by defense counsel during trial and were reasonable inferences on the evidence. Any aspersions the comments may have cast on defense counsel's integrity were not such as to deny Appellant a fair trial. As we stated in DeRosa v. State, 2004 OK CR 19, 170, 89 P.3d 1124, 1149, \"[appellant] was convicted and sentenced to death based upon the facts of his crime and the aggravating circumstances in the case, rather than any improper remarks by the district attorney.\" 1182 In second stage closing argument, the prosecutor referred to Appellant as \"toxic Nicholas Davis.\" No objection was raised to this comment. Reviewing only for plain error, we find none. Bland, 2000 OK CR 11, 191, 4 P.3d at 727. This comment was rebuttal to the recurring theme in the defense closing argument that the \"toxic love\" between Appellant and Green was responsible for the murder and absolved Appellant of any responsibility. In Warner, 2006 OK CR 40, ¶ 182, 144 P.3d at 839 we upheld comments which merely responded to defense statements made in closing argument. $183 The prosecutor also described Appellant as a \"cold-blooded killer.\" Defense counsel's objection was overruled. \"This Court has held that the term 'cold blooded killer' is not prohibited in a trial where the facts support the conclusion.\" Stouffer, 2006 OK CR 46, 1170, 147 P.3d at 276. The facts in the present clearly support the prosecutor's use of the term. $184 \"Allegations of prosecutorial misconduct do not warrant reversal of a conviction unless the cumulative effect was such [as] to deprive the defendant of a fair trial.\" Warner, 2006 OK CR 40, ¶ 197, 144 P.3d at 891. We have thoroughly reviewed each of Appellant's allegations of prosecutorial misconduct and while some comments may have tested the bounds of propriety, we find none of the comments deprived Appellant of a fair trial, or had any prejudicial impact on the judgment and sentence. Accordingly, this assignment of error is denied. ALLEGATION OF INEFFECTIVE ASSISTANCE OF COUNSEL 185 In his nineteenth proposition of error, Appellant contends that counsel's performance in preparing and presenting the case in mitigation was deficient and deprived him of his constitutionally guaranteed right *130to effective assistance of counsel. Appellant argues that had counsel presented expert testimony, in conjunction with lay witnesses, \"a more cohesive theory of defense\" would have been presented to the jury. Appellant contends that \"rather than hearing piecemeal snippets about [Appellant's] background, an expert could have 'connected the dots' between the incidents related by the lay witnesses.\" Appellant's argument is supported by non-record information contained in his separately filed Notice of Extra Record Evidence Supporting Proposition XIX of the Brief of Appellant and, Alternatively, Rule 3.11 Motion to Supplement Direct Appeal Record or For an Evidentiary Hearing. T 186 In his motion for evidentiary hearing, Appellant asserts that trial counsel was ineffective for failing to secure an expert to testify to the effect on him of the neglect and absence of his mother during his early childhood; the extreme trauma he experienced leaving his extended family on his grandmother's farm and moving to San Antonio, Texas; the impact of graphic violence he witnessed during his adolescent years and the loss he experienced as a brother and others close to him were violently killed. Appellant argues that a qualified expert witness could have testified as to how Appellant's childhood deprivation resulted in a heightened sense of danger and could have offered an opinion about the intent element of the shootings. Appellant contends this evidence would have presented a cohesive and more compelling mitigating case. Appellant argues that without expert testimony \"to tie together\" the mitigation evidence, the cumulative effect of the defense case in mitigation was a series of short requests for mercy from family members, some of whom he had never met. £187 Appellant also contends that trial counsel was ineffective for failing to present his brother, Michael Edmond, as a mitigation witness. Appellant asserts that Edmond could have testified to Appellant growing up in extreme poverty and neglect and explained how the absence of their mother contributed to Appellant's extreme distrust of women. [ 188 Rule 3.11(B)(8)(6), Rules of the Oklahoma Court of Criminal Appeals, Title 22, Ch. 18, App. (2009), allows an appellant to request an evidentiary hearing when it is alleged on appeal that trial counsel was ineffective for failing to \"utilize available evidence which could have been made available during the course of trial. ...\" Once an application has been properly submitted along with supporting affidavits, this Court reviews the application to see if it contains \"sufficient evidence to show this Court by clear and convincing evidence there is a strong possibility trial counsel was ineffective for failing to utilize or identify the complained-of evidence.\" Rule 8.11(B)(8)M)M). See also Warner, 2006 OK CR 40, 1207, 144 P.3d at 898. 189 In support of his arguments, Appellant offers a signed affidavit from Selonda M. Moseley, a licensed clinical social worker, who at the request of appellate counsel, reviewed Appellant's medical records, Department of Corrections records, and police reports as well as interviewed Appellant and several of his family members. (See Exhibit A) Based upon this information, Ms. Moseley prepared a Social History Report, dated August 27, 2008. (See Exhibit B) €190 The sixteen page report is divided into sections addressing Appellant's mother's family background, Appellant's early childhood, school years, adult years, medical/psychiatric, criminal history and summary/conclusions. What is initially striking about this report is that it presents a very different view of Appellant's early childhood years than was presented at trial. {191 At trial, nine witnesses testified in Appellant's mitigation case. These witnesses included two of Appellant's aunts, Sylvia Grayer and Mattie Irvin, and an uncle, Leon Wallace, Sr. These witnesses testified that they and their extended family lived on the family farm in Spencer, Oklahoma. These witnesses testified that Appellant and his two brothers were left on the farm by their mother to be raised by their grandmother. All three witnesses described Appellant's carly childhood years on the farm as happy, untroubled times, despite the fact his mother was rarely around and the few times she was present, she paid little if any attention to *131Appellant. Ms. Irvin testified she was close in age to Appellant and they had the same chores. The three witnesses testified that Appellant did not became involved in a life of crime until he was thirteen years old when his mother re-entered his life and took him and his brothers to San Antonio. All three witnesses attributed Appellant's descent into crime to bad parenting by his mother and stepfather after Appellant and his brothers left the family farm. {192 The other mitigation witnesses at trial were also family members, one of whom had not seen Appellant since he was very young, and two half-brothers who had never met Appellant. All of these witnesses asked the jury to spare Appellant's life. No expert testimony was offered in mitigation. 11983 In contrast, the Social History Report now offered by Appellant details a life of abuse and neglect suffered by Appellant while growing up on his grandmother's farm and that he had trouble in school beginning in kindergarten. The description of Appellant's life on the family farm was based entirely on an interview with Appellant. The Report states that Appellant said his grandmother and aunts lived in a part of the house that had electricity and plumbing while Appellant, his brothers and uncles lived in the part of the house without electricity or plumbing, and had to use candles for light. The Report states the girls in the family ate \"regular food\" while the boys ate left-over food their grandmother had contracted to take from several businesses to feed the livestock. The Report describes an instance where one of Appellant's aunts \"kicked him\" out of the house and he was left to sleep in the dog house with the dogs. The Report states the children were not permitted to have friends on the farm or participate in extracurricular school activities and only wore used, worn out clothing. Appellant said he grew up believing women always had it easier than men. 194 The Report also states that Appellant's troubles in school began as early as kindergarten which he attended in Midwest City, Oklahoma. Appellant could not read and was teased about his \"old fashioned wardrobe.\" Appellant routinely became aggressive with classmates and began fighting in school. When Appellant was ten years old, his family moved to San Antonio, Texas. Despite his inability to read, his parents did not put him in any special education classes. His parents believed he had an attention deficit disorder, difficulty reading, and was \"just lazy.\" I 195 In the Summary/Conelusions portion, the Report states that as a result of his upbringing, Appellant was unable to gain a positive view of himself or a healthy view of relationships, that Appellant developed a codependent relationship with his mother in whom he always saw himself as the victim, and his flawed thinking continued in his romantic relationships. The Report concluded that Appellant's family's lifestyle, and his mother's failure to protect him from the neglect he suffered in his grandmother's home, made it necessary for him to rely on himself and make decisions about the world based on his flawed perceptions. Ms. Moseley concluded that he suffered from \"undiagnosed depression\" and had many of the risk factors identified by Department of Justice studies for developing violent and delinquent behavior, including inadequate parenting, maltreatment and parental psychopathology. The Report stated that Appellant \"functioned well within a structured environment with proper supervision. During his periods of incarceration he was able to function within the system and adhere to rules and authority. In addition, he exhibited very little aggressive behavior while confined. He would be expected to continue to develop healthier coping skills in a confined setting.\" 196 Regarding counsel's failure to present testimony from Michael Edmond, Appellant offers a signed affidavit from trial counsel. (Exhibit C) Counsel states she planned to endorse Edmond as a witness and planned to call him to testify at trial. She states she requested an investigator with the Oklahoma County Public Defender's Office serve Edmond a subpoena to testify and that he was located in Texas. Counsel states she instructed the investigator to use the long arm statute to ensure Edmond would be in court. However, that statute was not used and Edmond was released on his promise to come to *132court. Edmond did not appear for court and the defense was unable to call him as a witness. 1197 Having thoroughly reviewed Appellant's request for an evidentiary hearing and supporting materials, this Court was left with a record where it appeared Appellant was trying to re-write his life story for mitigation purposes. Despite the request for an eviden-tiary hearing under Rule 3.11(B)@8)(b), we were unable to find that the facts as stated were sufficient to show by clear and convine-ing evidence that there was a strong possibility counsel was ineffective in failing to use the proffered evidence.11 Instead, we remanded for an evidentiary hearing pursuant to Rule 3.11(A) as the information before us was inadequate for us to fully address the issue of counsel's effectiveness. €198 An evidentiary hearing was held in the District Court of Oklahoma County and in accordance with this Court's request, the trial court's written findings of fact and conclusions of law along with transcripts of the hearing were filed in this Court. The District Court was directed to determine: 1) whether the evidence proffered in the application was available at the time of trial; 2) whether counsel conducted a reasonable investigation of the proffered evidence; 3) whether counsel made a strategic decision concerning use of the evidence; 4) whether false evidence concerning Appellant's life history has been presented either at trial or in these affidavits; 5) whether Ms. Moseley was qualified to provide the analysis and conclusions contained in her report; and 6) whether her report was based on anything other than speculation and lay opinion. See 59 O.S. Supp.2007, § 1250.1(20); 59 O.S. Supp.2007, § 1261.1. 199 The District Court stated in its findings of fact and conclusions of law, that it took testimony from five (5) witnesses: Mattie Irvin; Leon Wallace, Sr.; Selonda Moseley; Tom Chaney, mitigation investigator from the Oklahoma County Public Defender's Office assigned to Appellant's case; and Catherine Hammarsten, trial counsel. Briefly, the trial court made the following findings: 1) evidence proffered in the application concerning Appellant's harsh upbringing on his grandmother's farm was available at the time of trial; 2) counsel and her investigators conducted a reasonable investigation of all areas of Appellant's life, including the proffered evidence; 3) counsel made a strategic decision concerning the use of the proffered evidence; 4) false evidence was not presented at trial or on appeal concerning Appellant's life history; 5) Ms. Moseley was trained and qualified to provide the analysis and conclusions contained in her Social History Report; and 6) the conclusions in Ms. Moseley's report were based on her training and experience. €200 Armed with the information contained in the record of the evidentiary hearing, we can now address Appellant's claim of ineffective assistance of counsel. The standard of review for claims of ineffective assistance of counsel is that set forth in Strickland v. Washington, 466 U.S. 668, 687, 104 S.Ct. 2052, 2064, 80 L.Ed.2d 674 (1984). Ryder, 2004 OK CR 2, ¶ 85, 88 P.3d at 875-876. Strickland sets forth the two-part test which must be applied to determine whether a defendant has been denied effective assistance of counsel. First, the defendant must show that counsel's performance was deficient, and second, he must show the deficient performance prejudiced the defense. Unless the defendant makes both showings, \"it cannot be said that the conviction ... resulted from a breakdown in the adversary process that renders the result unreliable.\" Id., quoting Strickland, 466 U.S. at 687, 104 S.Ct. at 2064. 1201 To prevail on the first prong of the Strickland test, an appellant bears the burden of establishing that his trial *133counsel \"made errors so serious that counsel was not functioning as the 'counsel' guaranteed the defendant by the Sixth Amendment.\" Strickland, 466 U.S. at 687, 104 S.Ct. at 2064. Review of counsel's performance under this prong is \"highly deferential.\" Id. at 689, 104 S.Ct. 2052. \"[A] court must indulge a strong presumption that counsel's conduct falls within the wide range of reasonable professional assistance; that is, the defendant must overcome the presumption that, under the cireumstances, the challenged action might be considered sound trial strategy.\" Id. (internal quotations omitted). See also Ryder, 2004 OK CR 2, 185, 88 P.3d at 875 (\"Strickland applies the presumption that trial counsel was competent to provide the guiding hand that the accused needed\"). $202 Both the United States Supreme Court and this Court have declined to articulate specific guidelines for appropriate attorney conduct and instead have emphasized that \"[the proper measure of attorney performance remains simply reasonableness under prevailing professional norms.\" Wiggins v. Smith, 589 U.S. 510, 521, 128 S.Ct. 2527, 2585, 156 L.Ed.2d 471 (2008) citing Strickland, at 688, 104 S.Ct. 2052. See also Bobby v. Van Hook, - U.S. -, 180 S.Ct. 18, 16, 175 L.Ed.2d 255 (2009) (\"[that standard [Strickland] is necessarily a general one. No particular set of detailed rules for counsel's conduct can satisfactorily take account of the variety of cireumstances faced by defense counsel or the range of legitimate decisions regarding how best to represent a criminal defendant.\"); Ryder, 2004 OK CR 2, ¶ 85, 88 P.3d at 876 (\"[this Court has stated the issue is whether counsel exercised the skill, judgment and diligence of a reasonably competent defense attorney in light of his overall performance\"), citing Bryson v. State, 876 P.2d 240, 264 (Okl.Or.1994). 1208 At the evidentiary hearing, trial counsel was not asked and did not specifically state why she did not offer as a witness Ms. Moseley or another similarly qualified expert. Trial counsel did testify that she had used Ms. Moseley in prior cases to conduct a social history, which included basically interviewing everyone in the defendant's family and then testifying in court what she learned about the defendant's life. Counsel testified that in the present case, she, her investigators and interns in the Public Defender's Office interviewed Appellant and his family. 1204 Counsel testified that she was an experienced capital litigator having over ten years experience. She testified that when she was assigned Appellant's case (she was the third lead attorney assigned to the case) she familiarized herself with the file, met with Appellant and had certain investigations done. She stated that as with all capital cases defended by the Public Defender's Office, an investigator is specially assigned to find and develop mitigation evidence. 1 205 Tom Chaney testified that he was the mitigation investigator in Appellant's case. Mr. Chaney testified he had nine years experience as a mitigation investigator. He said that in Appellant's case, he interviewed six to ten of Appellant's family members, gathered school records and police reports on Appellant, and photographed the scene where Appellant's brother had been killed. 1206 Trial counsel also testified that between herself, investigators and interns in the Public Defender's Office numerous family members of Appellant had been interviewed and a clear theme of mitigation emerged several months prior to trial. This theme did not include presentation of a Social History Report which necessarily included a broad overview of Appellant's life. Based upon information gathered from the investigators and interviews, counsel chose to limit the mitigation evidence presented to the jury to show that Appellant became involved in a life of crime in his teenage years due to bad parenting and that he had other family members who loved and supported him. 1 207 This is not a case of counsel's failure to investigate for Appellant makes no claim that counsel failed to discover the information contained in the Social History Report. In fact, while the Social History Report was not prepared until after trial, the record indicates trial counsel was aware of much of the information contained in the report. Instead, Appellant's argument is that counsel was ineffective for failing to present expert testimony to tie all the mitigation evidence together. *134208 Appellant has failed to overcome the presumption that counsel's conduct might be considered sound trial strategy. Counsel was clearly aware of the information which would later be contained in the Social History Report. As discussed further in the portion of this opinion addressing the absence of Appellant's brother at trial, the record indicates counsel decided that under the cireum-stances, the best mitigation case was a limited one, focusing only on certain aspects of Appellant's life. This Court has held that \"[slo long as the choices are informed ones, counsel's decision to pursue one strategy over others is 'virtually unchallengeable\"\" Jones v. State, 2006 OK CR 5, 178, 128 P.3d 521, 545, quoting Strickland, 466 U.S. at 690-91, 104 S.Ct. at 2066. See also Snow v. State, 1994 OK CR 89, ¶ 17, 876 P.2d 291, 296 (\"[als there is no claim defense counsel was not aware of these witnesses, the decision not to call them must be considered reasonable trial tactics. Reasonable trial tactics, even those which ultimately are not successful, are not grounds for finding trial counsel ineffective.\") 1209 Further, by not offering a Social History Report, counsel kept from the jury much information which would not have been helpful to Appellant and might even have been counterproductive. Specifically, information that Appellant began \"gang-banging\" and selling drugs when he was 12 years old; during his school years he sold drugs, \"stole things and got into trouble\"; that and that although he was small in stature, Appellant gained respect by beating up big kids. 1210 If the Social History Report had been offered, the jury would also have heard that Appellant went through the San Marcus court system, was adjudicated an adult and sentenced to boot camp. However, upon his release, he resumed his criminal behavior and within one month, had new criminal charges filed against him. At the age of 17, Appellant was sentenced to 15 years in an adult facility in the Texas Department of Corrections. Appellant received numerous misconduct reports while incarcerated. Many of the incidents included physical aggression toward other inmates and staff. He was 28 years old when he was released from prison and moved to Oklahoma City. The jury might also have heard about Appellant's 1995 mental health evaluation and treatment while in the custody of the Texas Department of Corrections. Granted, by the time the defense presented its mitigation evidence, the jury had already heard that Appellant had prior felony convictions. The Social History Report contained additional details about Appellant's criminal past which could have been harmful to Appellant. We find not taking the risk that cross-examination could reveal such negative information which would harm Appellant's chances for a sentence less than death is within the realm of reasonable professional assistance. See Lott v. State, 2004 OK CR 27, 14 159-160, 164, 98 P.3d 318, 856-57 (counsel's failure to present a Social History Report which would not have been helpful to appellant and might even have been counterproductive was reasonable trial strategy well within the range of professional reasonable judgment).12 The Social History Report contained the \"double edge\" the Supreme Court has found sufficient to justify limited investigations. Id., 2004 OK CR 27, 1160 [98 P.8d 318] citing Burger v. Kemp, 483 U.S. 776, 107 S.Ct. 3114, 97 L.Ed.2d 638 (1987). While the Report contained some information pertinent to the jury's sentencing decision, other information could have bolstered the State's case for future dangerousness. 1211 Additionally, we find Appellant has failed to establish Strickland prejudice by the omission of the evidence. The mitigation evidence presented at trial showed that Appellant's mother physically and emotionally abandoned him during his early childhood, *135leaving him to be raised by his grandmother and aunts. The evidence showed that when she was around, Appellant's mother was emotionally abusive. Further, the mitigation evidence presented showed that things only got worse for Appellant onee his mother reentered his life and moved the family to San Antonio. An expert was not needed to present a cohesive mitigation case or \"connect the dots\" in this case as the jury could draw the same conclusions as those in the Social History Report that Appellant's criminal conduct was the result in part of his failed relationship with his mother. See Wong v. Belmontes, - U.S. -, 130 S.Ct. 383, 389, 175 L.Ed.2d 328 (2009) (counsel not ineffective for failing to present expert witness in mitigation as expert's evidence \"required only that the jury make logical connections of the kind a layperson is well equipped to make. The jury simply did not need expert testimony to understand the 'humanizing' evidence; it could use its common sense or own sense of mercy.\") The mere fact that more evidence in the form of the Social History Report could have been presented is not, in itself, sufficient to show counsel was deficient. Wilson v. Sirmons, 586 F.3d 1064, 1077-1078 (10th Cir.2008). 1 212 The mitigation case presented at trial was credible and well developed. Trial counsel chose to present evidence of Appellant's childhood through witnesses who personally interacted with Appellant and were able to relate first hand testimony, rather than relying on the hearsay in a Social History Report. We find Appellant has failed to carry his burden to show either deficient performance by counsel, or prejudice from the omission of this specific evidence. 1213 We next turn to defense counsel's failure to present Appellant's brother Michael Edmond as a mitigation witness. At the evidentiary hearing, Tom Chaney testified that as a mitigation investigator in the case, he was to secure Edmond's presence at trial to testify to the neglectful and abusive environment in which he and Appellant spent their early childhood. Mr. Chaney testified he traveled twice to San Antonio to meet with Edmond and talked with him on several occasions. Mr. Chaney testified he found Edmond to be \"cagey\" and not helpful. Edmond's versions of life on the family farm alternated between the hard, abusive upbringing portrayed by Appellant, and the good, decent upbringing portrayed by Appellant's relatives. Not only were the details he gave about life on the farm inconsistent, they were not corroborated by any family members other than Appellant. Mr. Chaney testified he suspected Edmond changed his story about life on the farm when he realized he was sought as a defense witness. Edmond became increasingly difficult to locate. He changed addresses and phone numbers frequently and did not often make contact with his family. Despite assistance of an additional investigator, future attempts to locate Edmond were unsuccessful. The process was begun for securing the presence of an out-of-state witness but Chaney was only able to serve Edmond's wife with the subpoena and she did not want to cooperate. It soon became clear to Chaney that Edmond did not want to be found. Unable to serve Edmond in San Antonio, Chaney returned to Oklahoma and had a material witness warrant issued by the district court. The warrant was placed onto. NCIC, so if Edmond was stopped by police anywhere in the country, he could be returned to Oklahoma. Chaney also indicated he called the sheriff in the San Antonio area and told him about the warrant and to be looking for Edmond. By the time of trial, Edmond had not been located. 11 214 Chaney also testified that he interviewed Appellant's mother, Patricia Edmond. He described her as \"very reluctant,\" \"hard to interview\" and holding back information. However, Chaney also testified that Ms. Edmond appeared for trial and was willing to testify for the defense. 1215 Both Chaney and trial counsel testified they learned primarily from Appellant that his childhood was troubled. Relying on Chaney's notes from his interviews with Appellant and Edmond, defense counsel stated that her initial theory of mitigation was to show life on the farm was difficult for both Appellant and Edmond. Trial counsel testified that although Edmond recanted many things he had told Chaney, she still wanted him as a witness to corroborate Appellant's *136story of his childhood. At that point, trial counsel had two potential theories of mitigation to present to the jury. One theory was that of the abusive and neglectful childhood on the farm and the other was that life turned bad for Appellant once he left the protective environment of the farm and moved to San Antonio. However, as she learned of Chaney's difficulty in locating Edmond, she began to think she might not be able to use him as a witness. 216 Defense counsel subsequently interviewed several of Appellant's family members in St. Louis. They described the family farm as a good place, where Appellant needed to be. After these interviews, a clear theme emerged that Appellant, Michael and another brother \"became lost\" and fell into criminal behavior after they moved to San Antonio. Counsel testified she decided that if Edmond could not be secured as a witness, she would proceed under the theory that Appellant's mother basically abandoned him, that he had structure and loving relatives on the farm and that things went bad when his mother and stepfather moved him to San Antonio. Counsel testified she considered this theory a more \"simple theory of how [Appellant] came to where he is\", that it was consistent with the evidence and would appeal to the jury. 217 Counsel testified that by the time of trial, Appellant's mother was willing to testify, but she had resisted initial attempts to interview her. When the defense team finally did interview her, they felt she was withholding information. Counsel testified that a strategic decision was made to claim that Appellant's mother was absent and unfit and she was not called as a witness. 218 Counsel testified that she could not remember what she did to determine if any other person was available to testify about the neglectful life on the farm once she learned Edmond would not be available to testify. Counsel testified that had Edmond been available to testify, that evidence would have been presented to the jury. 1219 Also testifying at the evidentiary hearing was Appellant's aunt, Mattie Irvin. She gave more detailed testimony on Appellant's early childhood years than was developed at trial. She testified the family farm was very isolated and the children had little interaction with other children. On cross-examination, she stated that when the children were hungry, despite the presence of a garden, chickens, pigs and cattle on the farm, they would sort through food taken out of restaurant dumpsters to eat. When asked why she had not mentioned this when she testified at trial, she said she was never asked. She said she would have been willing to provide the information had anyone asked her questions about it prior to trial. 1220 Ms. Irvin testified that on at least two occasions, she spoke with an investigator from the Public Defender's Office. She said that in response to their questioning, she told investigators everything she knew about Appellant's relationships with other family members, she described the farm and the chores the children were expected to do. She said none of the chores were abusive and that they had meat from farm animals and vegetables from the garden to eat. She said the family would go to local restaurants to get left over food to slop the hogs and the kids would \"ramble\" through it. She said the kids ate slop lots of times because they were hungry and it was \"good stuff.\" Ms. Irvin testified she never felt abused or neglected on the farm, that none of the children were physically abused, although they were whipped when they needed discipline. She testified that Appellant was not physically, emotionally, or sexually abused by his grandmother, and his grandmother took good care of all of the children on the farm. 221 Appellant's uncle, Leon Wallace, Sr., testified with detail about what life was like for the children living on the farm. He said that in the early years on the farm, there was no running water, gas, or electric heat and that they used a wood burning stove. Mr. Wallace testified that as a child, Appellant was often upset because his mother was not there more often to take care of him. Mr. Wallace said that when she was there, Appellant's mother called him lazy, stupid and worthless. He testified the chores the children were expected to do on the farm and their working outside jobs, left no time for play and little time for sleep. Mr. Wallace *137said the family would go to local restaurants and pick up garbage to feed the farm animals. He also said the boys would eat some of the food taken out of the dumpsters because they were hungry. He said he did not share that with members of the defense team because it was personal and because people would not understand it. On cross-examination, he admitted it was embarrassing to talk about eating out of dumpsters. 222 Based upon this record trial counsel used reasonable efforts to obtain the attendance of Michael Edmond at trial, but it was clear Edmond was actively avoiding service of process.13 Appellant offers no additional actions counsel could have taken to secure Edmond's presence at trial. Unable to secure Edmond's attendance, trial counsel made a strategic decision to present a theory of mitigation, based upon available evidence that highlighted the affect on Appellant of his departure from the family farm and move to San Antonio. Appellant argues that even if counsel's decision can be called strategic, it was developed after trial began and without any investigation into other family members who could corroborate his version of life on the farm. 1223 Counsel testified at the evidentiary hearing that if she had felt unprepared for trial, she would have asked for a continuance. Such a request was not made in this case. While counsel admitted she could not remember what she did to determine if any other person was available to testify about the neglectful life on the farm onee she learned Edmond would not be available to testify, the record shows she interviewed several family members and none of them offered a version of life on the farm similar to Appellant's. Now on appeal, Appellant has not offered any additional family members who would have corroborated his version. 1224 Even if Edmond had been served with a subpoena there is no guarantee he would have actually been present for trial or that his testimony would have corroborated Appellant's version of life on the farm. Appellant has not provided an affidavit or any sworn statement from Edmond describing what he would have testified to at trial. Defense counsel testified she never personally interviewed Edmond, so she could not definitively state what he would have testified to or if she would have actually put him on the witness stand. $225 Counsel does not have an obligation to introduce any and all evidence that might conceivably be considered mitigating in the hope that it might outweigh the aggravating evidence and save the defendant's life. Lott, 2004 OK CR 27, 1162, 98 P.3d at 356. Counsel's obligation is to use reasonable professional judgment in making decisions concerning the defendant's case. Id. Counsel's decision to go with the consistent corroborated version of Appellant's life offered by family instead of the version offered by Appellant and supported only by the sure to be impeached Edmond must be considered reasonable trial tactics. The record shows that counsel, an experienced capital litigator, made the decision after a thorough investigation. Regarding strategic decisions, Strickland provides: \"[SItrategie choices made after thorough investigation of law and facts relevant to plausible options are virtually unchallengeable; and strategie choices made after less than complete investigation are reasonable precisely to the extent that reasonable professional judgments support the limitations on investigation. In other words, counsel has a duty to make reasonable investigations or to make a reasonable decision that makes particular investigations unnecessary. Id., at 690-691, 104 S.Ct. 2052. 1 226 Investigations in this case presented counsel with two different versions of Appellant's early childhood. In one version, sur*138rounded by an extended family, he was raised on the family farm by a strict but loving grandmother who provided food, shelter and discipline and where Appellant was not abused or neglected. In the other version, the children on the farm were subjected to a hard life of hunger, abuse and deprivation. The first version was supported by numerous family members, while the second version was supported only by Appellant and an uncooperative brother. Counsel's decision to present the first version to the jury is actually supported by the evidentiary hearing testimony of Appellant's relatives who testified at trial. While both Ms. Irvin and Mr. Wallace testified that while the children sometimes ate the left-over food or the food from the dumpsters, this was not because they had not been fed by their grandmother. Further, their testimony supports a conclusion that Appellant is more likely to paint a bleak picture of his life on the farm because he was subject to discipline and missed his mother. Once counsel decided to focus her theory of mitigation on Appellant's good life while on the family farm and descent into crime after moving off the family farm, and as this was supported by sufficient credible evidence, it was reasonable for counsel not to present a potentially contradictory second theory of mitigation. $227 Even if Edmond had been located and presented as a witness, and even if he testified consistently with Appellant's version of their childhood on the farm, the speculative claim that the jury would have chosen any sentence other than death for this ruthless slaying falls short of any reasonable probability that the outcome of the trial would have been different. The evidence in aggravation was great and supported the finding of three aggravating cireumstances. We find Appellant has failed to carry his burden to show either deficient performance by counsel, or prejudice from the omission of this specific evidence. This proposition of error is denied. ACCUMULATION OF ERROR CLAIM 1228 In his twentieth proposition of error, Appellant asserts that cumulative error warrants a new trial or a modification of his sentence. A cumulative error argument has no merit when this Court fails to sustain any of the other errors raised by Appellant. Warner, 2006 OK CR 40, ¶ 223, 144 P.3d at 896. However, when there have been numerous irregularities during the course of a trial that tend to prejudice the rights of the defendant, reversal will be required if the cumulative effect of all the errors is to deny the defendant a fair trial Id. While certain errors did occur in this case, even considered together, they were not so egregious or numerous as to have denied Appellant a fair trial. Therefore, no new trial or modification of sentence is warranted and this assignment of error is denied. MANDATORY SENTENCE REVIEW 1229 In his twenty-first assignment of error, Appellant contends his sentence should be modified under our mandatory sentence review. He argues his death sentence was rendered arbitrarily in this case as a result of passion and prejudice caused by all of the foregoing errors and due to his inability to provide a vehicle for the jury to consider self defense or manslaughter and the large amount of evidence he was not allowed to present concerning the decedent's character. Appellant further argues his execution would violate the Eighth Amendment prohibition against cruel and unusual punishment. 1230 The allegations of error raised by Appellant have been thoroughly addressed in this opinion. While certain errors did occur in this case, when considered individually or cumulatively, they were not so egregious or numerous as to have denied Appellant a fair trial or to warrant modification of his sentence. 1 231 Pursuant to 21 0.$.2001, § 701.13(C), we must determine (1) whether the sentence of death was imposed under the influence of passion, prejudice or any other arbitrary factor, and (2) whether the evidence supports the jury's finding of the aggravating cireum-stances as enumerated in 21 0.98.2001, § 701.12. Turning to the second portion of this mandate, the jury found the existence of three (3) aggravating cireumstances: 1) the *139defendant knowingly created a great risk of death to more than one person; 2) the murder was committed by a person while serving a sentence of imprisonment on conviction of a felony; and 3) there exists a probability that Appellant will commit criminal acts of violence that would constitute a continuing threat to society. 21 ©.8.2001, § 701.12(2)(6)(7). We have previously considered the evidence offered in support of each aggravator and found sufficient evidence to support each aggravator found by the jury. See inter alia Propositions XIV, XV, XVL 12832 Appellant presented nine witnesses in mitigation. These included his father, two brothers, an uncle, a cousin and four aunts. These witnesses testified generally that Appellant had a family who loved him and would continue to have a relationship with him while incarcerated; that he was under the influence of emotional distress at the time of the shooting; he was taken away from a large, loving extended family at a critical stage of his life; after being torn from his large, loving extended family, he and his brothers lived in San Antonio, Texas, without necessary discipline and supervision; his uncle Tech. Sgt. Leon Wallace, twice attempted to provide Appellant with an appropriate role model and structure; Appellant was raised away from his natural father and half-siblings; his father was unaware of Appellant's legal situation until recently and he would have been involved in his son's life had he known; Appellant has a daughter whom he loves; Appellant's daughter has a half-brother who Appellant cares for and both children may one day want to know Appellant and be a part of his life; and while on parole, Appellant reported regularly to his parole office and was employed. This evidence was summarized and presented to the jury in Instruction No 11 along with any. other mitigating evidence the jury might find existed. 233 Upon our review of the record and careful weighing of the aggravating ciream-stances and the mitigating evidence, we find the sentence of death to be factually substantiated and appropriate. Under the record before this Court, we cannot say the jury was influenced by passion, prejudice, or any other arbitrary factor contrary to 21 0.8.2001, § 701.183(C), in finding that the aggravating cireumstances outweighed the mitigating evidence. Accordingly, finding no error warranting reversal or modification, this appeal is denied. DECISION 234 The JUDGMENT and SENTENCE for First Degree Murder is AFFIRMED, as are the JUDGMENTS and SENTENCES for two counts of Shooting with Intent to Kill and one count of Felonious Possession of Loaded Firearm. The case is REMANDED to the District Court for an Order Nunc Pro Tunc reflecting that the conviction in Count IV, of Felonious Possession of Loaded Firearm, in violation of 21 O0.8.2001, § 1288. Pursuant to Rule 8.15, Rules of the Oklo-homa Court of Criminal Appeals, Title 22, Ch.18, App. (2011), the MANDATE is ORDERED issued upon the delivery and filing of this decision. A. JOHNSON, P.J., C. JOHNSON and WINCHESTER, JJ.14: specially concur. LEWIS, V.P.J.: concur in result. . Appellant's Petition in Error was filed in this Court on March 4, 2008. His brief was filed September 8, 2008. The State's brief was filed on October 22, 2008. Appellant's reply brief was filed December 22, 2008. The case was submitted to the Court on January 12, 2009. Oral arguments were held on May 11, 2010. . Voir dire transcripts were separately numbered by the court reporter in four volumes, although the last two volumes are both marked Volume Three. . Appellant asserts the court told the jury to consider the ribbons when they retired for deliberations. In admonishing the jury not to be influenced by the ribbons, the trial court said in part: I guess what I'm saying to you is nobody needs to be influenced by that [seeing the ribbons] ... because we are trying to preserve the integrity of this trial, we're trying as everyone will tell you is that everybody is entitled to a fair trial and any kind of outside influences that tend to influence your opinion before you have heard any evidence just disrupts the integrity, ... And we have to depend on you, that you will not lose your focus and the focus of what we're asking you to do as jurors, and that's to be unbiased about these proceedings and not form an opinion or share with someone else an opinion that you have until the testimony is complete and you have gotten the rules of law by me and you've gone and you retire to deliberate. Then its free game. You can discuss it, you can bring in-but all within the bounds of the law and that's all were asking. (Tr. V.D.Vol.II, pgs. 411-412). This comment did not raise any objections from the defense or requests for follow-up. When read in context, the trial court clearly admonished the jury not to consider the ribbons. . The separate writings to Jackson indicate this issue was not the cause of the per curiam vote. . D.R. stated that he had served on a civil jury three to four years previously. This in itself does not show the trial court in this case abused its discretion in removing the prospective juror for cause. Without knowing more about Appellant's prior jury service, we only note that under the Criminal Procedure Code in Title 22, D.R.'s status as a convicted felon made him subject to a challenge for cause in a criminal trial. . While my colleagues tend to disagree, I find Shrum states that determining whether instructions on a lesser included offense should be given in any particular case is a two step process. However, I find that two step process is more appropriately set forth in Schmuck v. United States, 489 U.S. 705, 716-717, 109 S.Ct. 1443, 1451, 103 L.Ed.2d 734 (1989). In Schmuck, the *116United States Supreme Court upheld convictions for twelve counts of mail fraud. In so doing, the Court found that under Federal Rule of Criminal Procedure 31(c) a jury instruction on the then misdemeanor offense of tampering with an odometer was not warranted. The Court rejected the \"inherent relationship\" test for determining what constitutes a lesser included offense for purposes of jury instructions in favor of the \"elements test\". 489 U.S. at 716, 109 S.Ct. at 1450. Federal Rule 31(c) provides in relevant part: ''The defendant may be found guilty of an offense necessarily included in the offense charged.\" 489 U.S. at 715, 109 S.Ct. at 1450. As the language of Federal Rule 31(c) is similar to the language used in 22 0.5.2001, § 916 (\"[t}he jury may find the defendant guilty of any offense, the commission of which is necessarily included in that with which he is charged, or of an attempt to commit the offense\"), I find the elements test utilized in Schmuck should be adopted as the first step of the Shrum two step analysis. This is consistent with the history of § 916 and this Court's traditional approach of looking first to the statutory elements of the charged crime and any lesser degree of that charged crime to determine the existence of any lesser included offenses. See State v. Uriarite, 1991 OK CR 80, 18, 815 P.2d 193, 195; Martin v. State, 1983 OK CR 168, 1110-11, 674 P.2d 37, 40; Jennings v. State, 1982 OK CR 42, 18, 643 P.2d 643, 645; Porter v. State, 1980 OK CR 44, 15, 611 P.2d 278, 279-280; Wallace v. State, 1974 OK CR 224, 11 6-7, 529 P.2d 548, 549; Thoreson v. State, 69 Okla.Crim.App. 128, 100 P.2d 896, 901-02 (1940). This determination is not case specific and can only be made by looking at the statutory elements. Under this approach, the offenses that comprise lesser included offenses do not change from case to case. The only change is whether the evidence in each particular case is sufficient to warrant a jury instruction. Once the determination is made that the offense is a legally recognized lesser included offense of the charged offense, we move to the second step of the analysis and look at whether prima facie evidence of the lesser included offense has been presented. If sufficient evidence has been presented, a jury instruction is warranted. See Ball, 2007 OK CR 42, 1 32, 173 P.3d at 90; Eizember, 2007 OK CR 29, 1111, 164 P.3d at 236; Bland, 2000 OK CR 11, 156, 4 P.3d at 719-720. This two step process is also consistent with the manner of review adopted by 38 other states. . Hogan v. Gibson, 197 F.3d 1297, 1309 (10th Cir.1999) (victim attacked defendant with a knife); Hayes v. State, 1981 OK CR 96, 12, 633 P.2d 751, 752 (victim attacked defendant with knife); Farmer v. State, 1977 OK CR 215, 122, 565 P.2d 1068, 1070 (victim shot first); Williams v. State, 1973 OK CR 354, 18, 513 P.2d 335, 336-8 (victim attacked defendant with scissors and threatened to cut his heart out); Wood v. State, 1971 OK CR 232, 12-4, 486 P.2d 750, 751-752, (victim and defendant involved in a \"street brawl\"). . Under OUJI-CR (2d) 4-98, adequate provocation is defined in part as \"any improper conduct of the deceased toward the defendant(s) which naturally or reasonably would have the effect of arousing a sudden heat of passion within a reasonable person in the position of the defendant(s)\".... Personal violence or aggression by the deceased of a nature sufficiently violent to cause or threaten to cause pain, bloodshed, or bodily harm to the defendant may be adequate provocation. See OUJI-CR (2d) 4-98. (emphasis added). . Instruction No. 10, OUJI-CR (2d) 4-78 reads in its entirety: Mitigating circumstances are 1) circumstances that may extenuate or reduce the degree of moral culpability or blame, or 2) circumstances which in fairness, sympathy or mercy may lead you as jurors individually or collectively to decide against imposing the death penalty. The determination of what circumstances are mitigating is for you to resolve under the facts and circumstances of this case. While all twelve jurors must unanimously agree that the State has established beyond a reasonable doubt the existence of at least one aggravating circumstance prior to consideration of the death penalty, unanimous agreement of jurors concerning mitigating circumstances is not required. In addition, mitigating circumstances do not have to be proved beyond a reasonable doubt in order for you to consider them. . See Evidence Subcommittee Notes to § 2404, Guide to the Oklahoma Evidence Code, Whinery, \"[the limitation to pertinent traits of character, rather than character generally, in Rule 404(a)(1) and (2) is designed to sharpen the importance of relevancy to permit proof of character by evidence of specific acts ...\" (emphasis in original). . Without admitting the truth or accuracy of the information provided by Appellant, or that a meritorious claim of ineffective assistance was raised, the State also requested an evidentiary hearing \"out of abundance of caution and with a firm understanding of the reality of today's capital jurisprudence.\" (State's response, pg. 8). Despite the language of our order, the District Court held a hearing pursuant to Rule 3.11(B)(3)(b) and found counsel was not deficient, but presented a coherent and logical theory of mitigation in keeping with all professional standards of capital defense. . In Lott, 2004 OK CR 27, €155, 98 P.3d at 355, defense counsel presented evidence of the appellant's life history in a Risk Assessment Report. However, counsel did not present a Social History Report which also presented the appellant's life history and the circumstances surrounding the crimes. This Court found that both reports contained information unflattering to the appellant and \"[pJresenting detailed evidence concerning the behavioral impact\" of Appellant's life history of having no external or internal controls (except when incarcerated) combined with chronic substance abuse \"could reasonably be viewed as mitigating to one person and aggravating to another\" citing Murphy v. State, 2002 OK CR 24, 1 54, 47 P.3d at 886. . At the evidentiary hearing, trial counsel and investigator Chaney disagreed on whether the paperwork for securing the attendance of an out-of-state witness had been processed and a subpoena issued. Chaney testified that the paperwork had been completed and the subpoena issued. However, counsel testified that Chaney told her Edmond had promised Chaney he would appear therefore the paperwork was not processed. Regardless of whether the paperwork was properly completed and the subpoena issued, the record shows the defense used reasonable efforts to ensure the attendance of a recalcitrant witness.\n\n",
    "body_length": 183732,
    "citedas": [
      "268 P.3d 86",
      "2011 OK CR 29",
      "2011 Okla. Crim. App. LEXIS 35",
      "2011 WL 6282347"
    ],
    "attorneys": "Catherine Hammarsten, Cynthia Viol, Assistant Public Defenders, Oklahoma City, OK, counsel for appellant at trial., C. Wesley Lane II, District Attorney, Sandra Howell-Elliott, Suzanne Lister, Assistant District Attorneys, Oklahoma City, OK, counsel for the State at trial., Kim Chandler Baze, Assistant Public Defender, Oklahoma City, OK, counsel for appellant on appeal., W.A. Drew Edmondson, Attorney General of Oklahoma, Seth S. Branham, Assistant Attorney General, Oklahoma City, OK, counsel for the State on appeal.",
    "category": [],
    "judges": "Johnson, Lewis, Lumpkin, That, Winchester",
    "citation_count": 6
  }
}
