{
  "id": "YKFcR2YBTlTomsSBdPiA",
  "document": {
    "title": "People v. Cooper",
    "full_title": "THE PEOPLE AND v. KEVIN COOPER AND",
    "jurisdiction": "California Supreme Court",
    "date": "1991-05-06T00:00:00.000Z",
    "docket": "No. S004687, Crim. No. 24552",
    "body": "This case, arising out of the 1978 death penalty law, chronicles the nocturnal massacre of a mother, father, daughter, and houseguest in the sanctity of their home, and the attempted murder of the young son, the only person to survive. A jury convicted defendant Kevin Cooper of four counts of first degree murder (Pen. Code, § 187),\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e and one count of attempted murder with the intentional infliction of great bodily injury (§§ 664/187, 12022.7). It found true the special circumstance of multiple murder. (§ 190.2, subd. (a)(3).) Defendant had previously pleaded guilty to one count of escape from a state prison. (§ 4530, subd. (b).) After the penalty phase, the jury imposed the death penalty. The trial court denied the automatic motion to modify the verdict (§ 190.4, subd. (e)), and entered a judgment of death. This appeal is automatic. (§ 1239.) We affirm.\n\nI. Facts\n\nA. Guilt Phase\n\nThe jury convicted defendant of hacking to death Douglas (Doug) and Peggy Ryen, their 10-year-old daughter Jessica, and an 11-year-old houseguest, Christopher Hughes (Chris), inside the Ryen home near the California Institute for Men (CIM), a state prison in Chino. Eight-year-old Joshua Ryen (Josh), although severely injured, survived. Two days before this execution of the innocent, defendant had escaped from CIM.\n\n1. Prosecution Evidence\n\na. The Crime\n\nOn Saturday, June 4, 1983,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e the Ryens and Chris Hughes attended a barbecue at the home of George Blade in Los Serranos, a few miles from the Ryen home in Chino. Chris had received permission to spend the night with the Ryens. Between 9 and 9:30 p.m., they left the Blade residence to drive to the Ryen home. Except for Josh, they were never seen alive again.\n\nThe next morning, June 5, Chris's mother, Mary Hughes, became concerned when he did not come home. A number of telephone calls to the Ryen residence received only busy signals. Shortly after 9 a.m., Mary went to the Ryen home. On her return, she told her husband, William Hughes, that something appeared wrong because \"everything was quiet up there.\" After a second trip failed to reassure Mary, William went to the Ryen home to investigate.\n\nWilliam observed the Ryen truck at the home, but not the family station wagon. Although the Ryens normally did not lock the house when they were home, it was locked on this occasion. William walked around the house trying to look inside. When he reached the sliding glass doors leading to the master bedroom, he could see inside. William saw the bodies of his son and Doug and Peggy Ryen on the bedroom floor. Josh was lying between Peggy and Chris. Only Josh appeared alive.\n\nWilliam frantically tried to open the sliding door; in his emotional state, he pushed against the fixed portion of the doors, not the sliding door. He rushed to the kitchen door, kicked it in, and entered. As he approached the master bedroom, he found Jessica on the floor, also apparently dead. In the bedroom, William touched the body of his son. It was cold and stiff.\n\nWilliam asked Josh who had done it. Josh appeared stunned; he tried to talk but could only make unintelligible sounds.\n\nWilliam tried to use a telephone in the house but it did not work. He drove to a neighbor's house seeking help. The police arrived shortly. Doug, Peggy, Chris, and Jessica were dead, the first three in the master bedroom, Jessica in the hallway leading to that bedroom. Josh was alive but in shock, suffering from an obvious neck wound. He was flown by helicopter to Loma Linda University Hospital.\n\nThe victims died from numerous chopping and stabbing injuries. Doug Ryen had at least 37 separate wounds, Peggy 32, Jessica 46, and Chris 25. The chopping wounds were inflicted by a sharp, heavy object such as a hatchet or axe, the stabbing wounds by a weapon such as a knife. Jessica also had some chest wounds, probably inflicted after death by a pointed instrument such as an ice pick. Josh had fewer injuries, including wounds to the head possibly caused by a hatchet and a stab wound in the throat. Dr. Irving Root, who performed the autopsies, believed the injuries could have been inflicted quickly, within one minute for each of the victims. All of the victims had a moderate amount of food in the stomach, indicating that death probably occurred about one to three hours after they had eaten last.\n\nb. Evidence of Defendant's Guilt\n\nVarious items of circumstantial evidence connected defendant with the massacre.\n\nDefendant had been an inmate at CIM since April 29 under the name of David Trautman. On June 1, he was transferred to a minimum security portion of the prison. The next afternoon, June 2, he escaped on foot.\n\nUndisputed evidence, including fingerprints, showed that after his escape, defendant took refuge in a nearby house owned by Larry Lease and brothers Roger and Kermit Lang (hereafter the Lease house). He slept in the closet of the bedroom nearest the garage. The Lease house was the closest neighbor to the Ryen house, about 126 yards away. The window by the Lease house fireplace provided a view of the Ryen house.\n\nKathleen Bilbia, an employee of Lease, had been living in the Lease house in May, and she had used the bedroom defendant later slept in (hereafter the Bilbia bedroom). She moved out of the house during May. By May 27, most of her belongings had been removed. On May 30 and June 1, Bilbia vacuumed and cleaned portions of the house, including the bathroom she had used (hereafter the Bilbia bathroom).\n\nTelephone records showed that two telephone calls were made from the Lease house to the Los Angeles area telephone number of Yolanda Jackson -- one lasting one hundred ten minutes beginning on June 3 at 12:17 a.m., and one lasting four minutes beginning at 2:26 a.m. the same morning. Two calls were also made from that house to the Pittsburgh, Pennsylvania telephone number of Diane Williams -- one lasting three minutes beginning on June 3 at 11:46 a.m., and one lasting thirty-four minutes beginning on June 4 at 7:53 p.m. This final call was only an hour or so before the Ryens and Chris Hughes left the Blade house for their unsuspected rendezvous with death.\n\nYolanda Jackson testified that she visited defendant on May 30 at CIM. Sometime after midnight on June 3, she received a telephone call from defendant. She believed the call lasted about 30 to 45 minutes. Defendant said he had \"walked out\" of the prison. He asked her to help him in what Jackson believed was a \"joking manner.\" She refused. Defendant asked her where he should go. She said she did not know. At one point in the conversation, defendant said he was getting a cigarette. Shortly after the first conversation ended, defendant called her again. A brief second conversation ensued.\n\nThe parties stipulated that if Diane Williams were called as a witness, she would testify that in June she received two telephone calls from defendant at her Pittsburgh number. Defendant told her that he had been released from prison because of a new law that had been passed, and that he needed money. She said she could not get any. He said he would call back. Defendant called Williams again the next day, and asked if she had gotten any money. She replied that she had not. On June 6, Williams received a collect call from defendant in Tijuana, Mexico.\n\nOn June 4, around 10 or 11 a.m., Virginia Lang visited the Lease house briefly to get a sweater. She noticed nothing out of the ordinary.\n\nAfter the murders, a bloodstained khaki green button was found on the rug in the Bilbia bedroom. It was identical in appearance to buttons on field jackets inmates wore at CIM, including one defendant was seen wearing shortly before his escape. The blood on the button could have come from defendant or one of the victims.\n\nA bloodstained rope was found in the Bilbia bedroom closet. It was similar, but not identical, to a length of bloodstained rope found on the driveway of the Ryen residence.\n\nA criminalist from the San Bernardino County sheriff's crime laboratory sprayed various areas of the Lease house with luminol, a substance used to\n\ndetect the presence of blood not visible to the naked eye. A positive reaction consisting of an even \"glow\" ranging from about two feet to five feet above the floor was obtained on the shower walls in the Bilbia bathroom. Defendant left his footprint on the sill of this shower. There were also four positive reactions to the luminol on the rug in the hallway leading to the Bilbia bedroom that appeared to be foot impressions. Other positive reactions were obtained in the bedroom closet and bathroom sink. The reactions did not prove the presence of blood, but were \"an indication that it could be blood.\"\n\nInvestigators found matted hair in the bathroom sink trap that appeared to have been there a long time. Other hair was not matted. A microscopic examination of one of the latter revealed characteristics similar to Jessica's head hair. A hair removed from the bathroom shower had characteristics similar to Doug Ryen's head hair.\n\nDuring the afternoon of June 5, a local citizen discovered a hatchet in some weeds next to a fence on the side of a road that led from the Ryen home out of the area. The fencepost above the hatchet had a small indentation indicating that something sharp had struck it. The hatchet was covered by bloodstains; its head was covered by dried blood and human hairs. Some of the hairs were consistent with those of Doug and Jessica Ryen. Some of the blood on the hatchet head could have come from Josh. Dr. Root, who performed the autopsies, concluded that the hatchet could have inflicted the chopping wounds.\n\nWitnesses identified the hatchet as missing from the Lease house after the killing. It had been kept in a sheath by the Lease house fireplace. Bilbia recalled seeing it by the fireplace when she was cleaning the house. On June 7, the sheath for the missing hatchet was found on the floor in the Bilbia bedroom. It had not been there when Bilbia vacated the room.\n\nSome buck knives and one or more ice picks were also missing from the Lease house. These could have inflicted the remaining injuries. A strap fitting one of the missing buck knives was found on the floor by the Bilbia bedroom closet.\n\nInvestigators found three significant shoe print impressions -- a partial sole impression on a spa cover outside the Ryen master bedroom, a partial bloody shoe print on a sheet on the Ryen bedroom waterbed, and a nearly complete shoe print impression in the game room of the Lease house. All three appeared to come from tennis shoes.\n\nJames Taylor, an inmate at CIM who played on the same prison basketball team as defendant, issued equipment to other inmates. He testified that\n\nhe issued defendant a pair of P.F. Flyer tennis shoes. Three or four days before defendant was transferred to minimum security (i.e., before June 1) defendant exchanged these shoes for a pair of \"Dude\" Pro Ked tennis shoes. Taylor did not remember what size shoes were issued to defendant. The Stride Rite Corporation sells Pro Ked tennis shoes to the state for use in institutions such as CIM. All \"Dude\" tennis shoes contain the same sole pattern. The general merchandise manager for Stride Rite testified that this pattern is not found on any other shoe that the company manufactures nor, to his knowledge (which was extensive), on any other shoe. The shoes are not sold retail, but only to states and the federal government.\n\nWilliam Baird, the manager of the San Bernardino County sheriff's crime laboratory, compared the shoe print impressions from the Ryen and Lease houses to each other, to the type of shoes issued to defendant, and to other shoes. He concluded that the three shoe prints \"all possessed a similar tread pattern, which would indicate a similar type shoe was used in each case.\" They \"are consistent with one another, and . . . could have been caused by the same shoe.\" The pattern was similar to the \"Dude\" tennis shoes used at CIM, probably size 10, but possibly size 9 1/2. Baird searched area stores for shoes with similar sole patterns, but could find none. The defendant testified that his shoe size was between nine and ten. Baird believed that the shoes that made the three impressions were nearly new but not brand new.\n\nWith one exception, all of the blood samples obtained from the Ryen house could have come from one or more of the victims. The exception is a single drop of blood found on the hallway wall opposite the master bedroom door.\n\nDaniel Gregonis, a criminalist with the San Bernardino County sheriff's crime laboratory, examined this drop of blood by a scientific process called electrophoresis. Human blood contains various enzymes and serum proteins. The types of enzymes vary from person to person. Electrophoresis is a technique used to distinguish between enzyme types, so as to exclude or include a person as a possible donor of a blood sample.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e After electrophoretic testing, Gregonis concluded that the drop could not have come from any of the victims.\n\nBased upon results obtained for several enzymes, Gregonis also concluded that the drop was consistent with defendant's blood. Results for certain other enzymes were inconclusive. Because of various characteristics, the blood had to have come from a Black person such as defendant. One of the\n\nenzymes tested is commonly called \"EAP.\" Gregonis initially believed the EAP of the drop of blood was type B. When he later typed defendant's own blood, Gregonis also believed it was EAP type B. Gregonis subsequently learned that defendant's EAP type was RB, a rare type. Gregonis had never before seen an RB type. He reexamined the photograph of the original testing of the drop of blood, but it was inconclusive as to whether it was EAP type B or RB. Gregonis testified, however, that when he tested the drop of blood, it appeared to have the same EAP type as defendant's blood. Brian Wraxall, another expert, described the difference between types B and RB as \"fairly subtle.\"\n\nBefore Gregonis learned of his error regarding defendant's EAP type, he and Dr. Edward Blake, an expert employed by the defense, tested the drop further. Because of the limited amount of the remaining sample, they performed tests that they believed had the best chance of excluding defendant as a possible donor. They did not retest for EAP. The additional tests tended to include defendant as a possible donor. Only a minute amount of the blood remained after these tests. Later, after Gregonis learned of his error regarding defendant's EAP type, he tried to test the remaining sample for EAP. Dr. Blake was again present. This final test completely consumed the sample and was inconclusive.\n\nElectrophoretic testing also established the blood on the rope found in the Bilbia bedroom closet could have come from one of the victims but not defendant.\n\nThe station wagon that was missing from the Ryen house was found on a church parking lot in Long Beach. One witness testified he put a flyer on the car on Sunday morning, June 5, the morning after the killing of the Ryen family. Another saw the car on June 7. Later, the vehicle was reported to the police, who examined it for evidence.\n\nThe car contained various bloodstains, including one which could have come from one or more of the victims, but not defendant. Several hairs were recovered from the vehicle. Two criminalists microscopically compared the hairs with defendant's hair. One believed that one of the hairs probably came from a Black person, and that \"there was enough similarity between . . . the hairs from Mr. Cooper and the unknown hair that I felt the unknown hair was consistent with coming from Mr. Cooper.\" The second criminalist also found it was consistent with defendant's hair. Both believed it was most likely pubic hair. Unlike fingerprint comparison, an absolute match is not possible when comparing hairs.\n\nJames Taylor, the inmate who issued the Pro Ked tennis shoes to defendant at CIM, testified that he saw defendant smoke hand-rolled cigarettes\n\nusing rolling paper and \"Role-Rite\" tobacco issued free to inmates. This tobacco is not sold retail, but only to institutions in California such as CIM.\n\nLoose tobacco was found inside a white box in the Bilbia closet, and in the Ryen car. In addition, two cigarette butts -- one of a hand-rolled cigarette -- were found in the Ryen car. The tobacco in the white box was identified as Role-Rite. Criminalist Craig Ogino examined visually and microscopically the two samples of the loose tobacco and the tobacco from the hand rolled cigarette. Each sample was consistent with each other and with Role-Rite tobacco. Ogino also compared them with various other tobacco samples he obtained from a tobacco store. The other tobacco samples were all different.\n\nAubrey Evelyn, a manager with the company that manufactures Role-Rite tobacco, also testified that he had \"no doubt\" that the tobacco found in the Ryen car was Role-Rite.\n\nExamination of the saliva on the two cigarette butts from the Ryen car was inconclusive, but was consistent with the cigarettes having been smoked by a nonsecretor such as defendant. Some commercial cigarettes were apparently missing from the Lease house. A Viceroy cigarette butt was found in the Bilbia bedroom. Bilbia did not smoke.\n\nA six-pack of Olympia Gold beer with one can missing was found in the refrigerator of the Ryen house. One bloodstained can was hanging over the edge of a shelf. A nearly empty can of Olympia Gold beer similar in appearance to those in the Ryen refrigerator was found in a plowed horse training arena about midway between the Ryen and Lease houses.\n\nOn June 9, defendant met Owen and Angelica Handy in Ensenada, Mexico. Defendant, using the name Angel Jackson, asked for work. Handy offered defendant some food and a place to stay if he would help paint their boat, the Illa Tika. Defendant agreed. After working on the boat for two days, defendant and the Handys set sail for San Francisco. They made several stops, then eventually went to Pelican Bay near Santa Barbara, where they stayed for four or five days. The Coast Guard arrested defendant at that location after he dove off the Illa Tika, swam to a dinghy, and started to row for shore. While he was with the Handys, defendant possessed several items identified as coming from the Lease house.\n\nc. Joshua Ryen's Statements\n\nJoshua Ryen did not testify at trial. Pursuant to stipulation, two taped statements made by him were played to the jury -- a videotape of a\n\nDecember 9, 1984, interview in which he was questioned under oath by the prosecutor and defense counsel; and an audiotape of a December 1, 1983, interview with Dr. Lorna Forbes, his treating psychiatrist. Josh never identified anyone as the assailant.\n\nIn the videotaped statement, Josh said that the evening before the murders, just before the family left for the Blade barbecue, three \"Mexicans\" came to the Ryen home looking for work. Josh had never seen them before. The family then went to the barbecue in the truck and later returned. Josh and Chris Hughes slept in sleeping bags on the floor in Josh's bedroom. Josh's parents slept in their bedroom, and Jessica slept in hers.\n\nAt some point during the night, Josh woke up and fell asleep again. He was reawakened by a scream. Josh woke Chris up, and they walked down the hall, stopping at the laundry room. Josh saw Jessica in the hallway. He walked closer to his parents' room, and saw a \"shadow or something\" by the bathroom. It was dark. Josh could not see what the shadow was or what it was doing.\n\nJosh and Chris \"started getting a little scared.\" Josh started to look around. The next thing he remembered was \"[j]ust waking up\" surrounded by the bodies of his parents.\n\nIn the audiotaped interview with Dr. Forbes, Josh said he heard his mother scream. He walked into her bedroom, and saw someone by the bed \"turning his back against me.\" Josh \"just saw his back and his hair.\" After his mother stopped screaming, and Josh \"saw him,\" he went into the laundry room and hid behind the door. Chris went into the parents' room, and then \"was gone.\" Josh then went into the bedroom and \"he knocked me out.\" He thought the person was a man \"because women usually don't do that sort of thing.\"\n\nJosh remembered talking to a deputy sheriff named \"O.C\" (Hector O'Campo). He told O'Campo he thought three men had done it because \"I thought it was them. And, you know, like they stopped up that night.\" He did not actually see three people during the incident.\n\n2. Defense Evidence\n\nDefendant admitted escaping from CIM, hiding out at the Lease house, and sleeping in the Bilbia bedroom, but denied committing the murders. He said that after he talked with Diane Williams the second time, he left the Lease house on foot. He did some hitchhiking, stole a purse, and eventually\n\nmade his way to Mexico where he met the Handys. Defendant denied approaching the Ryen house.\n\nThe defense presented evidence of other events apparently not involving defendant that might have had something to do with the killings.\n\nThe defense also presented evidence of earlier statements of Josh indicating his original belief that the three Mexicans had committed the crimes. Josh never said he saw or otherwise felt the presence of more than one assailant at the time of the murders.\n\nDr. John Thornton, a professor of forensic science at the University of California, Berkeley, criticized various aspects of the crime scene investigation.\n\nB. Penalty Phase\n\nThe prosecution presented evidence that on October 8, 1982, a man stipulated to be defendant burglarized a home in Pennsylvania, assaulted a high school student who interrupted the burglary, kidnapped her, and raped her. During the incident, defendant attempted to steal one vehicle, and did steal the rape victim's vehicle. The jury was also allowed to consider as an aggravating factor defendant's prior conviction of two counts of burglary in Los Angeles.\n\nThe defense presented several friends and relatives of defendant who testified about his good qualities and their continuing love for him.\n\nII. Discussion\n\nA. Venue Issues\n\nDefendant moved to change venue from San Bernardino County. The court granted the motion, and transferred the case to San Diego County. Defendant contends the court prejudicially erred in transferring the case to San Diego, and in denying his later motion to change venue a second time.\n\n1. The Facts\n\nThe trial court granted the change of venue from San Bernardino County because of the nature and extent of the publicity, the nature and gravity of the crime, and the status within the community of the accused and the victims. The court found the size and population of the county to be neutral\n\nfactors, and expressly rejected a defense claim that political overtones were significant.\n\nThe Judicial Council suggested four counties as possible new sites for the trial -- Alameda, Sacramento, Los Angeles, and San Diego Counties. Defendant preferred Alameda or Sacramento County. He stated that \"downtown\" Los Angeles (not the rest of the county) was acceptable. He objected to San Diego. Because of the nature and extent of the publicity in Los Angeles County, the court chose not to transfer the case there absent stipulation by both parties. The district attorney refused to so stipulate.\n\nAfter a hearing, the court transferred the case to San Diego County. In a lengthy oral decision, the court found that although San Diego had received more publicity about the case than either Alameda or Sacramento County, and penetration of San Diego by the Los Angeles media was \"inescapable,\" the postpreliminary hearing publicity in San Diego was not \"particularly prejudicial.\" It found that trial in San Diego would be \"considerably more convenient and considerably less expensive\" than trial in the northern part of the state, and concluded that \"[c]onsidering all of these factors, the relative convenience, hardship, costs, time, money, publicity given, the Court finds it to be in the interests of justice that the case be transferred to San Diego County.\"\n\nPrior to trial, defendant moved for a second change of venue, this time out of San Diego County. The court denied the motion, finding that there had been a \"falling off of publicity\" in the 15 months since the crime, the publicity was generally not inflammatory, and it was not reasonably likely defendant could not get a fair trial in San Diego County.\n\nDuring jury selection, defendant renewed his change of venue motion based upon the jury voir dire up to that time. The court denied the motion, stating that it \"was frankly impressed with the caliber of the jurors overall. I think that you've got a pretty good jury, Mr. Negus [defense counsel], for the defense in this case. The prosecution hasn't got anything to go celebrate about.\"\n\nThe jury was thereafter selected. The defense exercised four of its twenty-six peremptory challenges in selecting the original twelve jurors, and it used three of its four challenges in selecting the alternates.\n\n2. Change of Venue to San Diego County\n\nAfter a court orders a change of venue, \"it shall advise the Administrative Director of the Courts of the pending transfer.\" (Cal. Rules of Court,\n\nrule 842.) The director shall, \"in order to expedite judicial business and equalize the work of the judges, suggest a court or courts that would not be unduly burdened by the trial of the case.\" (Ibid.) Thereafter, the court shall \"transfer the case to a proper court as it determines to be in the interest of justice.\" (Ibid.)\n\nFour counties were named as possible trial sites -- Sacramento, Alameda, Los Angeles, and San Diego Counties. Relying solely on a law review note (Note, Change of Venue in Criminal Cases: The Defendant's Right to Specify the County of Transfer (1973) 26 Stan.L.Rev. 131), defendant first contends he has the right to select which of the four will try the case. Rule 842 of the California Rules of Court, however, provides that the court, not a party, decides where to transfer the matter. Rule 842 was adopted pursuant to legislative mandate, and governs change of venue procedures in criminal actions. (§ 1038; see People v. Rich (1988) 45 Cal. 3d 1036, 1075-1076 [248 Cal. Rptr. 510, 755 P.2d 960]; McGown v. Superior Court (1977) 75 Cal. App. 3d 648, 653, fn. 6 [142 Cal. Rptr. 262].) It is consistent with the purpose behind a change of venue, which is to ensure the defendant a fair trial (Maine v. Superior Court (1968) 68 Cal. 2d 375, 378 [66 Cal. Rptr. 724, 438 P.2d 372]), not to encourage forum shopping. We therefore hold that the court, not the defendant, determines where the trial shall be transferred.\n\nThe defendant is entitled to a hearing prior to the transfer at which the court should consider such factual issues as the \"presence or absence of prejudicial publicity\" in a possible new county, and the \"relative hardship involved in trying the case in various locations.\" (McGown v. Superior Court, supra, 75 Cal. App. 3d at pp. 652, fn. 5, 653.) The decision of where to transfer the case lies within the discretion of the court, which must consider the \"interest of justice.\" (Id. at pp. 652-653.)\n\nIn this case, the McGown hearing was held, and the court carefully exercised its discretion. It rejected Los Angeles because of extensive publicity. Finding that San Diego could likely provide a fair trial, the court chose that county because of the relative hardship of moving the case to northern California. We perceive no abuse of discretion.\n\nDefendant relies largely on the amount of the publicity in San Diego County, claiming it had been penetrated by the Los Angeles media. Although \"pretrial publicity which is not sufficient to require a change of venue from [a county] may be sufficient to persuade [a court] that the cause should not be transferred to [that county]\" (McGown v. Superior Court, supra, 75 Cal. App. 3d at p. 653 [italics in original, fns. omitted]), the matter still lies within the discretion of the court. Defendant's own position at trial was inconsistent. He accepted \"downtown\" Los Angeles, but argued\n\nagainst San Diego because of its nearness to the Los Angeles media. The publicity did not deprive the court of discretion to transfer the matter to San Diego.\n\nDefendant also argues that San Diego was a possible site for a new prison, making trial there inappropriate. The court considered this factor, but found it not to be significant. Again, we perceive no abuse of discretion. Counties in which a prison may be built are not disqualified from trying crimes committed by prisoners.\n\nDefendant also argues that in a capital case, hardship should not be considered in choosing a new trial site. We disagree. Although a defendant's right to a fair trial in a capital case, as in any case, may not be infringed, considerations of relative hardship, and the conservation of judicial resources and public funds, are important factors in deciding between various possible venue sites. (People v. Hernandez (1988) 47 Cal. 3d 315, 336 [253 Cal. Rptr. 199, 763 P.2d 1289]; see also People v. Bean (1988) 46 Cal. 3d 919, 939-940 [251 Cal. Rptr. 467, 760 P.2d 996] [such factors are important in deciding whether to have a joint trial of multiple counts].) The court properly considered relative nearness as a factor weighing heavily in favor of trial in San Diego. San Diego was more convenient for witnesses, attorneys, and others, including interested citizens of San Bernardino County, the county of the crime.\n\n3. Denial of Second Change of Venue\n\nDefendant next contends that the court erred in denying his motion for a second change of venue. A change of venue must be granted when the defendant shows a reasonable likelihood that in the absence of such relief, a fair trial cannot be had. (People v. Williams (1989) 48 Cal. 3d 1112, 1125 [259 Cal. Rptr. 473, 774 P.2d 146].) In passing on an original motion to change venue, the court considers such factors as the nature and gravity of the offense, the size of the community, the status of the defendant, the popularity and prominence of the victim, and the nature and extent of the publicity. (People v. Bonin (1988) 46 Cal. 3d 659, 672 [250 Cal. Rptr. 687, 758 P.2d 1217]; People v. Harris (1981) 28 Cal. 3d 935, 948 [171 Cal. Rptr. 679, 623 P.2d 240].) The same factors apply to a second change of venue (People v. Gallego (1990) 52 Cal. 3d 115, 167 [276 Cal. Rptr. 679, 802 P.2d 169]) except that, as discussed below, the fact that venue has already been changed once affects the analysis.\n\nOn appeal after a judgment following the denial of a change of venue, the defendant must show both that the court erred in denying the change of venue motion, i.e., that at the time of the motion it was reasonably\n\nlikely that a fair trial could not be had in the current county, and that the error was prejudicial, i.e., that a fair trial was not in fact had. (People v. Douglas (1990) 50 Cal. 3d 468, 541-542 [268 Cal. Rptr. 126, 788 P.2d 640] [conc. opn. of Mosk, J.].) The trial court's essentially factual determinations such as the gravity of the crimes, the size of the community, the status of the defendant and victims, and the nature and extent of the pretrial publicity, will be sustained if supported by substantial evidence. We independently review the trial court's ultimate determination of the reasonable likelihood of an unfair trial. (People v. Bonin, supra, 46 Cal. 3d at pp. 676-677.)\n\nThe size of the community weighed heavily against a second change of venue. As noted in the appeal of Robert Alton Harris, another highly publicized capital case, San Diego County was third in the state in population and ninth in area. The City of San Diego, where the trial took place, is the second largest city in the state. (People v. Harris, supra, 28 Cal. 3d at p. 949.)\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e In Harris, we held that this \"tipped the balance\" against even a first change of venue because the \"'adversities of publicity are considerably offset if trial is conducted in a populous metropolitan area.'\" (Ibid., quoting People v. Manson (1976) 61 Cal. App. 3d 102, 189 [132 Cal. Rptr. 265].)\n\nThe gravity of the offense in this case is most serious, but this factor alone does not compel a change of venue. The status of the defendant and victims, an important factor in the initial change of venue, also weighs against the second change of venue. Neither the victims nor defendant were residents or otherwise closely associated with San Diego County. (People v. Gallego, supra, 52 Cal. 3d at p. 167.)\n\nDefendant relies primarily on the factor of publicity. The court's factual findings, however, are supported by substantial evidence. Although there was publicity, it lessened over time, and was not particularly inflammatory. It did not make it reasonably likely that the defendant could not receive a fair trial. In addition, evidence of posttransfer publicity proves little. Publicity would follow this case wherever it went. \"Even if venue had been changed, nothing could have prevented the public media from swinging its attention to that place. The magnetic pull of such notorious cases is compelling.\" (People v. Manson, supra, 61 Cal. App. 3d at p. 177.) The 15-month time period between crime and trial also supports the court's decision. \"'That time soothes and erases is a perfectly natural phenomenon, familiar to all.'\" (People v. Bonin, supra, 46 Cal. 3d at pp. 677-678, quoting Patton v. Yount (1984) 467 U.S. 1025, 1034 [81 L.Ed.2d 847, 856, 104 S.Ct. 2885].)\n\nDefendant finally contends the court erred in denying his renewed motion to change venue during jury selection, claiming the actual jury selection showed a reasonable likelihood he did not receive a fair trial. Out of over 100 prospective jurors, 8 were excused for cause because of pretrial publicity. Defendant argues that three of the actual jurors and twenty-two prospective jurors who were not excused for cause had been exposed to \"prejudicial information\" ranging from rape allegations against him to awareness \"of some sort of confrontation that had occurred when Mr. Cooper was on a boat.\" Even accepting defendant's computation, a second change of venue was not mandated.\n\nIt is speculation to suppose the results of jury selection would have been significantly different in any county. The media report local trials of notorious crimes in all counties. People read newspapers and watch television in all counties. (See People v. Manson, supra, 61 Cal. App. 3d at pp. 176-177.)\n\nIn addition, all of the jurors who were not excused, and especially the actual jurors, stated they could be fair. The jurors need not be totally ignorant of the facts and issues involved. \"'It is sufficient if the juror can lay aside his impression or opinion and render a verdict based on the evidence presented in court.'\" (People v. Harris, supra, 28 Cal. 3d at p. 950, quoting Irvin v. Dowd (1961) 366 U.S. 717, 723 [6 L.Ed.2d 751, 756, 81 S.Ct. 1639].) Although a juror's declaration of impartiality is not conclusive (People v. Williams, supra, 48 Cal. 3d at p. 1129), the trial judge, who was on the scene and best able to evaluate the jury, was \"impressed\" with the overall caliber of the jurors, and found the jury to be fair. This finding of fairness is not binding on this court, but it is entitled to great weight. (See People v. Jennings (1988) 46 Cal. 3d 963, 979 [251 Cal. Rptr. 278, 760 P.2d 475] [trial court's findings regarding voluntariness of a confession entitled to great weight].) We have no reason to doubt the actual jurors' assertions that they could be fair. (People v. Gallego, supra, 52 Cal. 3d at p. 168.)\n\nIt is also significant that defendant exercised only four of his twenty-six peremptory challenges. (People v. Daniels (1991) 52 Cal. 3d 815, 853-854 [277 Cal. Rptr. 122, 802 P.2d 906]; People v. Coleman (1989) 48 Cal. 3d 112, 136 [255 Cal. Rptr. 813, 768 P.2d 32].) Our independent review of the record convinces us that the trial court correctly denied a second change of venue.\n\nIn summary, the change of venue away from San Bernardino County sufficiently protected defendant's right to a fair trial. Trial was properly held in San Diego County.\n\nB. Jury Selection Issues\n\n1. Juror Fees\n\nDefendant contends that the trial court's refusal to order payment of juror fees in excess of the statutory $5 daily fee authorized by section 1143 \"upset the demographic balance of the venire and resulted in the denial of a jury selected from a representative cross-section of the community.\" We have repeatedly rejected the contention, and see no reason to reconsider the matter. (People v. Harris (1989) 47 Cal. 3d 1047, 1076-1078 [255 Cal. Rptr. 352, 767 P.2d 619]; People v. Milan (1973) 9 Cal. 3d 185, 195-196 [107 Cal. Rptr. 68, 507 P.2d 956]; see also People v. Thompson (1990) 50 Cal. 3d 134, 157-159 [266 Cal. Rptr. 309, 785 P.2d 857].) Contrary to defendant's argument, we have also held that \"persons with low incomes do not constitute a cognizable class.\" (People v. Johnson (1989) 47 Cal. 3d 1194, 1214 [255 Cal. Rptr. 569, 767 P.2d 1047].)\n\n2. Denial of Challenges for Cause\n\nDefendant argues the court erred in denying his challenge for cause as to six prospective jurors. Our review of the record discloses no error, but defendant has failed to show prejudice, even assuming the court erred as to all six. None was ever seated in the jury box. Defendant exercised but four of his twenty-six peremptory challenges, leaving twenty-two which could have been used to excuse the six had it been necessary. Under the circumstances, courts have found harmless the erroneous inclusion of a prospective juror. (Ross v. Oklahoma (1988) 487 U.S. 81, 87-89 [101 L.Ed.2d 80, 89-90, 108 S.Ct. 2273]; People v. Stankewitz (1990) 51 Cal. 3d 72, 103 [270 Cal. Rptr. 817, 793 P.2d 23]; People v. Gordon (1990) 50 Cal. 3d 1223, 1247-1248 [270 Cal. Rptr. 451, 792 P.2d 251]; People v. Bittaker (1989) 48 Cal. 3d 1046, 1087-1088 [259 Cal. Rptr. 630, 774 P.2d 659]; People v. Coleman (1988) 46 Cal. 3d 749, 768-771 [251 Cal. Rptr. 83, 759 P.2d 1260].)\n\nDefendant claims that because the case was tried in San Diego, the entire jury panel was so infected with prejudicial publicity that he was afraid to use additional challenges for fear the actual jury would only get worse. The record does not support the claim. We have already rejected the argument that publicity precluded trial in San Diego. The trial court found the panel to be fair. Since the 22 unexercised peremptory challenges far exceeded the number of prospective jurors defendant claims should have been excused, he has failed to show prejudice.\n\n3. Witherspoon/Witt Contention\n\nDefendant also contends the court erred in excusing for cause two prospective jurors because of their opposition to the death penalty.\n\nWe must consider this issue on the merits for, unlike the erroneous inclusion, the erroneous exclusion of a prospective juror because of that person's views on the death penalty is reversible per se. (Gray v. Mississippi (1987) 481 U.S. 648 [95 L.Ed.2d 622, 107 S.Ct. 2045]; see People v. Coleman, supra, 46 Cal. 3d at p. 768.)\n\nThe applicable standard is stated in Wainwright v. Witt (1985) 469 U.S. 412 [83 L.Ed.2d 841, 105 S.Ct. 844], which \"clarified\" the earlier decision of Witherspoon v. Illinois (1968) 391 U.S. 510 [20 L.Ed.2d 776, 88 S.Ct. 1770]. Under Witt, a prospective juror may be excused for cause if that juror's views on capital punishment would \"'prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.'\" (469 U.S. at p. 424 [83 L.Ed.2d at pp. 851-852].) We have adopted the Witt standard. (People v. Douglas, supra, 50 Cal. 3d at p. 523.)\n\nDefendant claims we should not apply Witt \"retroactively.\" We have already rejected the contention. (People v. Wright (1990) 52 Cal. 3d 367, 418, fn. 16 [276 Cal. Rptr. 731, 802 P.2d 221]; People v. Gallego, supra, 52 Cal. 3d at p. 192.) The United States Supreme Court has itself applied Witt to previously tried cases. (In addition to Witt itself, see Darden v. Wainwright (1986) 477 U.S. 168, 175 [91 L.Ed.2d 144, 153-154, 106 S.Ct. 2464].)\n\nOn appeal, if the prospective juror's responses are equivocal, i.e., capable of multiple inferences, or conflicting, the trial court's determination of that juror's state of mind is binding. (People v. Mason (1991) 52 Cal. 3d 909, 953-954 [277 Cal. Rptr. 166, 802 P.2d 950] [conflicting responses]; People v. Coleman, supra, 46 Cal. 3d at pp. 766-767 [same]; People v. Ghent (1987) 43 Cal. 3d 739, 768 [239 Cal. Rptr. 82, 739 P.2d 1250] [equivocal responses].) If there is no inconsistency, the only question being whether the juror's responses in fact demonstrated an opposition to (or bias in favor of) the death penalty, we will not set aside the court's determination if it is supported by substantial evidence and hence is not clearly erroneous. (People v. Gordon, supra, 50 Cal. 3d at p. 1262.)\n\nThe record supports the court's rulings. One of the prospective jurors stated, \"If I am being asked whether a man should or should not die, I cannot do it, I will not do it.\" The other stated he would never vote for the death penalty. Defendant points to other, equivocal, statements, and claims the court did not sufficiently determine whether the jurors could set aside their own views and obey the court's instructions. The court, however, resolved the question as to the juror's true state of mind contrary to defendant, which resolution is binding on this court. (See also People v. Guzman (1988) 45 Cal. 3d 915, 956 [248 Cal. Rptr. 467, 755 P.2d 917] [use of words\n\nlike \"I believe\" or \"I think\" to qualify answers does not undermine a finding of substantial impairment].) We find no error.\n\nC. Pretrial Issues\n\n1. \" Hitch \" Contention\n\nRelying on People v. Hitch (1974) 12 Cal. 3d 641 [117 Cal. Rptr. 9, 527 P.2d 361], defendant challenged the investigation of this crime on a host of grounds, essentially contending that law enforcement authorities failed to preserve evidence in violation of his right to due process. He requested that the charges be dismissed or, in the alternative, the imposition of lesser sanctions such as prohibiting the death penalty, suppressing evidence, or giving jury instructions adverse to the prosecution regarding the allegedly lost evidence. A lengthy pretrial evidentiary hearing was held. At the end, the court, although critical of aspects of the investigation, found that all law enforcement authorities acted in good faith, and that there was no destruction of material evidence within the meaning of Hitch. The court refused to impose any sanctions, but invited the parties to \"present your best shots at the time of trial to the jury on credibility . . . .\"\n\nDefendant contends the court erred. He claims the authorities mishandled the investigation of the original crime scene, mishandled many specific items of evidence, and failed to collect certain items found at other locations assertedly relevant to the case. He further claims the mistakes deprived him of potentially exculpatory evidence.\n\nThe applicable law is no longer found in Hitch, supra, 12 Cal. 3d 641, but in two subsequent United States Supreme Court decisions. In California v. Trombetta (1984) 467 U.S. 479, 488-489 [81 L.Ed.2d 413, 422, 104 S.Ct. 2528], the high court held: \"Whatever duty the Constitution imposes on the States to preserve evidence, that duty must be limited to evidence that might be expected to play a significant role in the suspect's defense. To meet this standard of constitutional materiality [citation], evidence must both possess an exculpatory value that was apparent before the evidence was destroyed, and be of such a nature that the defendant would be unable to obtain comparable evidence by other reasonably available means.\" (Fn. omitted.)\n\nMore recently, in Arizona v. Youngblood (1988) 488 U.S. 51, 58 [102 L.Ed.2d 281, 289, 109 S.Ct. 333], the court held that \"unless a criminal defendant can show bad faith on the part of the police, failure to preserve potentially useful evidence does not constitute a denial of due process of law.\"\n\nDefendant argues that as a matter of state law we should not follow California v. Trombetta, supra, 467 U.S. 479. We have rejected the contention. (People v. Johnson, supra, 47 Cal. 3d at pp. 1233-1234.) Defendant does not specifically argue that we should not follow Arizona v. Youngblood, supra, 488 U.S. 51. The reasons that caused us to adopt Trombetta in Johnson apply also to Youngblood. (See People v. Medina (1990) 51 Cal. 3d 870, 894 [274 Cal. Rptr. 849, 799 P.2d 1282] [in which we implicitly followed Youngblood ].)\n\nDefendant's due process contentions fail under both Trombetta and Youngblood. Although a perfect investigation might have uncovered additional evidence, the large amount that was discovered all pointed directly at defendant. Additional evidence would have been \"much more likely\" to inculpate defendant than to exculpate him. (California v. Trombetta, supra, 467 U.S. at p. 489 [81 L.Ed.2d at p. 422].) Nothing in the record suggests that any additional evidence would have been exculpatory, or that any exculpatory value was apparent at the time any evidence was lost. (People v. Daniels, supra, 52 Cal. 3d at p. 855.)\n\nDefendant has also failed to show bad faith. The court below expressly found the investigators acted in good faith, a finding not challenged on appeal and fully supported by the record. This was a major and complex crime investigation. Although in hindsight one might criticize the investigation in a number of respects, the large number of persons involved all acted in good faith.\n\nDefendant contends that, at a minimum, the court should have given a favorable jury instruction under People v. Zamora (1980) 28 Cal. 3d 88 [167 Cal. Rptr. 573, 615 P.2d 1361]. In Arizona v. Youngblood, supra, 488 U.S. at page 54 [102 L.Ed.2d at page 287], for example, the trial court instructed the jury \"that if they found the State had destroyed or lost evidence, they might 'infer that the true fact is against the State's interest.'\" Nothing in Youngblood suggested the instruction was required. Although an adverse instruction may be a proper response to a due process violation (see Zamora, supra, 28 Cal. 3d at p. 96), there was no such violation in this case. The trial court was not required to impose any sanction, including jury instructions. (People v. Douglas, supra, 50 Cal. 3d at p. 513; People v. Martinez (1989) 207 Cal. App. 3d 1204, 1218 [255 Cal. Rptr. 691]; see also People v. Medina, supra, 51 Cal. 3d at pp. 893-894 [finding no sua sponte duty to give an adverse instruction].)\n\nThe trial court's refusal to sanction the prosecution did not leave defendant helpless. As the court stated, he was entitled to take his \"best shot\" before the jury, and present evidence regarding deficiencies in the\n\ninvestigation to try to discredit the case against him. \"This was adequate to insure a fair hearing and was itself a sufficient sanction.\" (Scott v. Meese (1985) 174 Cal. App. 3d 249, 258 [219 Cal. Rptr. 857].) The \" Hitch \" motions were properly denied.\n\n2. Serological Evidence\n\nDefendant contends the court erred in admitting (1) the results of electrophoretic analysis of the bloodstain evidence; and (2) the testing of saliva from the two cigarette butts found in the Ryen car for secretor or nonsecretor status. He contends the evidence was inadmissible under the Kelly/Frye rule. (People v. Kelly (1976) 17 Cal. 3d 24, 30 [130 Cal. Rptr. 144, 549 P.2d 1240]; Frye v. United States (D.C. Cir. 1923) 293 Fed. 1013, 1014 [54 App.D.C. 46, 34 A.L.R. 145]; see generally People v. Morris, ante, 152, at p. 206 [279 Cal. Rptr. 720, 807 P.2d 949].) At a pretrial evidentiary hearing, the prosecution presented five witnesses in support of the evidence. The defense presented none. The court admitted all the contested evidence.\n\nThe Attorney General first contends that defendant has waived some of his current contentions by failing to specifically object below. (Evid. Code, § 353, subd. (a); People v. Green (1980) 27 Cal. 3d 1, 22 \u0026 fn. 8 [164 Cal. Rptr. 1, 609 P.2d 468].) However, the evidentiary hearing was held in response to defendant's Kelly/Frye objection to all of the serological evidence. The hearing and court's ruling covered all of the matters currently in dispute. We believe defendant sufficiently objected on the grounds raised on appeal. Hence, we address the merits.\n\nDefendant challenges the general admissibility of electrophoretic testing of dried bloodstains. We recently considered and rejected this contention. (People v. Morris, supra, ante, at pp. 206-208; see also the cases cited therein.) Nothing in the instant record causes us to reconsider the matter.\n\nDefendant also challenges the admissibility of two specific tests, one involving electrophoresis, one not. He first challenges the electrophoretic testing of the drop of blood for a serum protein called transferrin. Electrophoresis is used to test for various enzymes and serum proteins, of which transferrin is only one. There was evidence that the method had only recently been used to test for transferrin. Based upon this testimony, defendant contends that testing for transferrin is of too recent vintage to have achieved general acceptance in the scientific community. All of the experts, however, who testified on the matter said that testing for transferrin was a valid application of established electrophoretic methods. In the absence of contrary evidence, there is no reason to reject a particular application of a method such as electrophoresis that has been accepted as reliable. (See\n\nPeople v. Smith (1989) 215 Cal. App. 3d 19, 27, fn. 4 [263 Cal. Rptr. 678] [once electrophoresis is admissible, criticism of any specific methodology goes to the weight of the evidence, not its admissibility].)\n\nDefendant next challenges the testing of the two cigarette butts. Some persons secrete their ABO blood-group substance into other body fluids such as saliva. Others do not. Defendant is a nonsecretor. Gregonis performed what is called the \"absorption-inhibition\" test to try to determine whether saliva found on the butts was from a secretor. A positive result would have meant the saliva was from a secretor, and thus not from defendant. The result was negative.\n\nThe defense never challenged the validity of the absorption-inhibition test when the result is positive. A positive result proves the donor is a secretor. Defendant argues, however, that the opposite is not true, that is, that a negative result does not prove the donor was a nonsecretor. The testimony at the hearing supports this argument. The witnesses testified that a negative result means either that the donor was a nonsecretor or was a secretor but for some reason the secretion could not be detected. An additional test, not performed in this case, would be necessary to establish that the donor was a nonsecretor.\n\nAlthough defendant's argument is factually supported, it proves nothing. No one, including Gregonis, claimed more for the test than the evidence warrants. The jury learned that the test's negative result meant that the defendant could not be excluded as a possible donor. It was not told the test affirmatively established that the donor was a nonsecretor. Gregonis testified before the jury that the negative result was an \"indication\" that the person was a nonsecretor, meaning that it was \"more consistent\" with that conclusion. He also testified, however, that the test was not conclusive, and the donor \"could also have been a secretor\" but the secretion was not detected. The evidence was not particularly probative, but it was certainly relevant for the jury to learn that the cigarettes were tested, and defendant was not excluded. We find no violation of the Kelly/Frye rule.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nDefendant also contends that Gregonis was unqualified to do the testing and to testify as an expert. The trial court, however, found him qualified. \"The trial court is given considerable latitude in determining the qualifications of an expert and its ruling will not be disturbed on appeal unless a manifest abuse of discretion is shown.\" (People v. Kelly, supra, 17 Cal. 3d at p. 39.) Gregonis had been a criminalist in San Bernardino County\n\nfor over four years with a bachelor of science degree in criminalistics. He had considerable training and practical experience in serology in general and electrophoresis in particular, and had qualified as an expert many times in the past. The court did not abuse its discretion.\n\nIn a related vein, defendant also criticizes the precise manner in which Gregonis performed the tests. These arguments misperceive the nature of the Kelly/Frye rule. \"[T]he Kelly/Frye rule tests the fundamental validity of a new scientific methodology, not the degree of professionalism with which it is applied. [Citation.] Careless testing affects the weight of the evidence and not its admissibility, and must be attacked on cross-examination or by other expert testimony.\" (People v. Farmer (1989) 47 Cal. 3d 888, 913 [254 Cal. Rptr. 508, 765 P.2d 940].) \"Once the court acts within its discretion and finds the witness qualified, as it did in this case, the weight to be given the testimony is for the jury to decide.\" (People v. Smith, supra, 215 Cal. App. 3d at p. 27.) Defendant was allowed to cross-examine Gregonis fully about his qualifications and the manner in which he did the testing, and to present whatever additional evidence he desired. (Id. at p. 28.) There was no error.\n\n3. Defense Testing of Evidence\n\nDuring the preliminary hearing, it was discovered that a series of tiny drops of blood collected from the Ryen house had not been analyzed scientifically. The defense filed a written motion for the release of this series for independent testing. The district attorney objected because the blood drops were so small that serological testing would entirely consume them. He requested that testing be done jointly by the prosecution and defense or, alternatively, that the People test the samples in the presence of the defense expert.\n\nThe defense agreed the samples were so small that they could be subjected to only one or two tests before they would be entirely consumed, but insisted on the right to analyze -- and thus consume -- some of the samples unilaterally without revealing the results to the prosecution until after the defense had presented its evidence at trial. Defense counsel argued that anything less would violate the right against self-incrimination because \"If a trained criminalist were to know which test was done, they would be able to know what I was looking for. If they were able to know what I was looking for, they would be able to figure out certain aspects of defense strategy.\"\n\nThe court denied the defense motion \"to release absolutely,\" and asked the parties to try to agree on a method in which \"both sides may participate in the testing and analysis.\" At the next hearing, the district attorney was\n\nwilling to allow the defense expert to \"choose all the tests for all the samples,\" provided only that the prosecution expert also be present at the testing. The defense wanted to be given half of the samples, and be allowed to consume them in testing, without informing the prosecution of the results. The court ordered that testing of all samples be done in the presence of both prosecution and defense experts. The evidence was eventually tested, apparently in conjunction with the defense expert. Nothing of significance was discovered.\n\nDefendant contends the court erred in not allowing independent testing of the blood samples \"in a manner consistent with the privilege against self-incrimination and the right to effective assistance of counsel.\" He relies primarily on cases involving the right to the effective assistance of counsel, the right to employ experts, and the privilege against being required to provide discovery to the prosecution. None is apposite. In this case, the blood samples were so small they could not effectively be divided to give the defense a portion. Under these facts, the defendant has no right to obtain the evidence collected by the prosecution, to destroy that evidence in independent testing, and then to withhold from the prosecution the results of the testing.\n\nIn People v. Meredith (1981) 29 Cal. 3d 682 [175 Cal. Rptr. 612, 631 P.2d 46], a murder and robbery suspect told his attorney that he had taken the victim's wallet and disposed of it in a trash can. At counsel's request, a defense investigator removed the wallet from the trash can. Counsel examined the wallet and turned it over to the police. The defendant contended that evidence of where the investigator found the wallet came within the attorney-client privilege, and was thus inadmissible at a trial against him. (Id. at p. 686.) We rejected the contention for reasons instructive in this case: \"When defense counsel alters or removes physical evidence, he necessarily deprives the prosecution of the opportunity to observe that evidence in its original condition . . . . [T]o bar admission of testimony concerning the original condition and location of the evidence in such a case permits the defense in effect to 'destroy' critical information; it is as if . . . the wallet in this case bore a tag bearing the words 'located in the trash can by Scott's residence,' and the defense, by taking the wallet, destroyed this tag. To extend the attorney-client privilege to a case in which the defense removed evidence might encourage defense counsel to race the police to seize critical evidence.\" (Id. at p. 694.)\n\nJust as there was no defense right in Meredith, supra, 29 Cal. 3d 682, to destroy evidence it found before the prosecution found it, so too there is no defense right to destroy evidence found by the prosecution.\n\nDefendant argues that if he were compelled to inform the prosecution what tests he wanted to perform, he would be forced to implicitly divulge defense strategy. The defense was not, however, compelled to do anything. The prosecution and court allowed the defense to participate in the testing on condition that the prosecution learn the results. The defense could choose to accept the condition or not participate in the testing. Forcing such a choice does not violate the Constitution or any other provision of law. (See People v. Collins (1986) 42 Cal. 3d 378, 387 [228 Cal. Rptr. 899, 722 P.2d 173] [forcing a defendant to make a difficult judgment whether to testify or to assert the right against self-incrimination is constitutional].)\n\nD. Guilt Phase Issues\n\n1. Restriction on Defense Presentation of Evidence\n\nDefendant contends the court erroneously restricted his right to cross-examine witnesses and to present evidence regarding the investigation of this crime. Although the court generally allowed the defense wide latitude to challenge the competence of the investigation, it sustained a few prosecution objections on the basis of relevancy and Evidence Code section 352.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nIn general, the trial court is vested with wide discretion in determining relevance and in weighing the prejudicial effect of proffered evidence against its probative value. Its rulings will not be overturned on appeal in the absence of an abuse of that discretion. (People v. Green, supra, 27 Cal. 3d at p. 19; People v. Pierce (1979) 24 Cal. 3d 199, 211 [155 Cal. Rptr. 657, 595 P.2d 91].) This discretion is not, however, unlimited, especially when its exercise hampers the ability of the defense to present evidence. While the trial judge has broad discretion to control the ultimate scope of cross-examination, wide latitude should be given to cross-examination designed to test the credibility of a prosecution witness in a criminal case. (People v. Belmontes (1988) 45 Cal. 3d 744, 780 [248 Cal. Rptr. 126, 755 P.2d 310].)\n\nThe United States Supreme Court has \"'recognized that the exposure of a witness' motivation in testifying is a proper and important function of the constitutionally protected right of cross-examination.' Davis [ v. Alaska (1974) 415 U.S. 308, 316-317 (39 L.Ed.2d 347, 353-354, 94 S.Ct. 1105)] (citing Greene v. McElroy, 360 U.S. 474, 496 (1959)). It does not follow, of\n\ncourse, that the Confrontation Clause of the Sixth Amendment prevents a trial judge from imposing any limits on defense counsel's inquiry into the potential bias of a prosecution witness. On the contrary, trial judges retain wide latitude insofar as the Confrontation Clause is concerned to impose reasonable limits on such cross-examination based on concerns about, among other things, harassment, prejudice, confusion of the issues, the witness' safety, or interrogation that is repetitive or only marginally relevant. And as we observed earlier this Term, 'the Confrontation Clause guarantees an opportunity for effective cross-examination, not cross-examination that is effective in whatever way, and to whatever extent, the defense might wish.' Delaware v. Fensterer, 474 U.S. 15, 20 (1985) (per curiam) (italics in original).\" (Delaware v. Van Arsdall (1986) 475 U.S. 673, 678-679 [89 L.Ed.2d 674, 683, 106 S.Ct. 1431]; see also People v. Harris, supra, 47 Cal. 3d at p. 1091.)\n\nThe Van Arsdall court concluded that \"a criminal defendant states a violation of the Confrontation Clause by showing that he was prohibited from engaging in otherwise appropriate cross-examination designed to show a prototypical form of bias on the part of the witness, and thereby 'to expose to the jury the facts from which jurors . . . could appropriately draw inferences relating to the reliability of the witness.' (Davis v. Alaska, supra, at 318.\" (Delaware v. Van Arsdall, supra, 475 U.S. at p. 680 [89 L.Ed.2d at p. 684].) \"There is no Sixth Amendment violation at all unless the prohibited cross-examination might reasonably have produced 'a significantly different impression of [the witness's] credibility . . . .'\" (People v. Belmontes, supra, 45 Cal. 3d at p. 780, quoting Van Arsdall, supra, 475 U.S. at p. 680 [89 L.Ed.2d at p. 684].)\n\nApplying these standards, we find no error. Defendant first argues the court erred in not admitting into evidence certain sheriff's policy manuals regarding the collection and preservation of evidence, and a treatise on crime scene investigation. He argues the evidence was necessary to show that the investigators failed to follow accepted procedures. After a hearing, the court ruled that although the defense could present evidence regarding any failings in the investigation, \"The probative value of getting into details of the policy manuals and time consideration and the confusion [of] issues and all of that causes me at this time to sustain the objection.\"\n\nThis ruling came within the court's discretion. Defendant was allowed to litigate thoroughly the competence of the investigation. His cross-examination of prosecution witnesses was vigorous and exhaustive. He presented an expert witness, Dr. Thornton, who criticized many aspects of the crime investigation. The trial court could reasonably find that admitting manuals and treatises would be cumulative, confusing, and unduly time consuming,\n\nespecially since such admission would undoubtedly compel additional evidence regarding their meaning and authoritative status.\n\nDefendant next argues the court erroneously restricted cross-examination regarding the reasons for certain actions and inactions during the investigation. He admits the court allowed him to show fully what was and was not done, and to present all facts supporting his argument that the investigation was incompetent. The court found that evidence regarding the investigator's thought processes would \"lead to a considerable confusion of issues, [and] distraction of the jurors,\" and would \"lead to a lot of time in this case.\" Again, we find no abuse of discretion.\n\nWe have reviewed the remaining rulings of which defendant now complains, and similarly find no abuse of discretion. In light of the mass of evidence the defense was allowed to present regarding the competence of the investigation, the prohibited evidence would not reasonably have produced a significantly different impression of the witnesses' credibility. (People v. Belmontes, supra, 45 Cal. 3d at p. 780.) There was no error.\n\n2. Newsperson's Shield Law Ruling\n\nEarly in the trial, defendant served a subpoena duces tecum on the editor of the Ontario Daily Report, an Ontario newspaper. The court granted the editor's motion to quash the subpoena finding that the information sought was protected by California's newsperson's shield law. (Cal. Const., art. I, § 2, subd. (b); Evid. Code, § 1070.)\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Defendant contends the court erred.\n\na. The Facts\n\nThe subpoena sought production of \"A letter, on San Bernardino County Sheriff Department stationery, purporting to be from a san [ sic ] Bernardino Sheriff Homicide Detective, to the Editor of the Daily Report, describing the mishandling of the Ryen murder investigation, and the envelope the letter came in.\" In a declaration responding to the motion to quash the subpoena defense counsel stated that he had received a telephone call from a reporter with the Ontario Daily Report informing him that the reporter had received an unsigned letter to the editor written on sheriff's department stationery. The reporter read the letter to defense counsel. Defense counsel did not take notes as the letter was read, but believed that in essence, the writer identified himself as a homicide detective with the San Bernardino County Sheriff's Department. The writer criticized the personal participation in the investigation of the sheriff and the performance of the department's \"Career Criminal Division.\" The writer hoped he would not be punished for speaking out, and expressed \"relief that somehow Homicide had solved the crime, despite the Sheriff and the Career Criminal Division.\"\n\nOver defense objection, the hearing on the motion to quash was held in chambers. A sergeant within the sheriff's department and a defense investigator testified that they had asked everyone involved in the investigation or currently in the homicide department if he had knowledge of the letter. Everyone denied any knowledge. The court then granted the motion to quash, finding the letter \"lacking in any probative and relevant values\" in this case. The court stressed that the defense had already \"examined each and every one of these officers . . . that had anything remotely to do with the Ryen investigation, under oath, in court, in detail [on] more than one occasion . . . .\"\n\nThe court prohibited the parties and court personnel, but not the press, \"from disclosing to media or other people the nature of this motion\" unless the Ontario Daily Record wrote an article about the hearing. Defense counsel objected to the order, arguing that he needed to publicize the letter to obtain further information regarding it. The court stood by the order, finding that the potential benefit from publicizing the letter was slight or nonexistent, and was outweighed by the potential harm.\n\nb. Discussion\n\nWe have recently examined the newsperson's shield law in a criminal context. (Delaney v. Superior Court, supra, 50 Cal. 3d 785.) The law protects a newsperson from being adjudged in contempt of court for refusing to disclose either unpublished information or the source of information,\n\nwhether published or unpublished. (Id. at pp. 796-797.) The law, however, \"must yield to a criminal defendant's constitutional right to a fair trial when the newsperson's refusal to disclose information would unduly infringe on that right.\" (Id. at p. 793.) In order to compel disclosure of information covered by the shield law, the defendant must make a threshold showing of a reasonable possibility that the information will materially assist his defense. The showing need not be detailed or specific, but it must rest on more than mere speculation. (Id. at pp. 808-809.) If the threshold showing is made, the court then balances various factors in determining whether to compel disclosure of the information. (Id. at pp. 809-813.)\n\nThe ruling in this case predated Delaney, supra, 50 Cal. 3d 785. Although the court's finding that the letter was not \"relevant\" was similar to the Delaney standard, we need not decide whether the court correctly anticipated that decision. Even if we assume, arguendo, that disclosure of the letter would be warranted under Delaney, the failure to order such disclosure was harmless.\n\nThe discovery related merely to an anonymous letter to the editor on a subject about which the defense had full discovery. Even the author of the letter was satisfied that the police had correctly solved the crime. The defense investigator questioned everyone who might have written the letter (assuming it was genuine), and learned nothing. More significantly, the defense had full opportunity to examine under oath all relevant witnesses. The competency of the investigation, which was only tangentially relevant to the issue of guilt, was exhaustively explored. The denial of the discovery, even if error, could not have prejudiced defendant under any standard.\n\nDefendant also contends the court erred in prohibiting the parties from disclosing the nature of the hearing. In Delaney, supra, 50 Cal. 3d at page 813, we recognized the propriety of an in camera hearing in a proper case \"to protect against unnecessary disclosure of confidential or sensitive information.\" It is similarly appropriate to prohibit the parties from making such a disclosure. The court has discretion to issue protective orders to avoid undue prejudice to the parties. (Sheppard v. Maxwell (1966) 384 U.S. 333, 361-363 [16 L.Ed.2d 600, 610-620, 86 S.Ct. 1507]; Hamilton v. Municipal Court (1969) 270 Cal. App. 2d 797, 800-801 [76 Cal. Rptr. 168, 33 A.L.R.3d 1029].) Given the hearsay and inflammatory nature of the anonymous letter, the narrow protective order of this case was well within the court's discretion.\n\nDefendant wanted to publicize the letter in the hope of learning who wrote it. Given the investigation regarding authorship that had already occurred, this hope was elusive at best. In addition, for the reasons\n\ndiscussed above, discovery of the letter's origin could not have significantly assisted the defense. The protective order did not violate defendant's rights.\n\n3. Photographs of Victims While Alive\n\nDefendant objected to admission of photographs depicting the Ryens and Chris Hughes while still alive. The district attorney argued that the photographs were relevant on three grounds, one of which was to show the \"relative physical size of the individuals involved.\" The court admitted one photograph of the Ryens and one of Chris, but ordered that they not include the family dogs. Defendant contends the ruling was error.\n\nAlthough we have held that photographs of victims while alive should not be admitted if they have \"no bearing on any contested issue in the case\" (People v. Ramos (1982) 30 Cal. 3d 553, 578 [180 Cal. Rptr. 266, 639 P.2d 908]), the court has discretion to admit such photographs if relevant. (People v. Thompson (1988) 45 Cal. 3d 86, 114-115 [246 Cal. Rptr. 245, 753 P.2d 37].) An issue at trial was whether one person alone could have killed all four victims, or whether three persons were involved as Joshua Ryen had once thought. A photograph of the victims was relevant on this point. The court properly exercised its discretion by minimizing any prejudice but otherwise admitting the two photographs.\n\nDefendant contends the photographs actually admitted were larger than the court had contemplated in its ruling. There was no objection on this ground, so the issue cannot be raised on appeal. (People v. Green, supra, 27 Cal. 3d at p. 22.)\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nDefendant also contends admission of the photographs violated Booth v. Maryland (1987) 482 U.S. 496 [96 L.Ed.2d 440, 107 S.Ct. 2529]. Booth held that because the defendant's punishment must be tailored to his personal responsibility and moral guilt, evidence about the victims' personal qualities not directly related to the circumstances of the crime, and \"about which the defendant was unaware\" (id. at p. 505 [96 L.Ed.2d at p. 450]), should not be admitted in capital sentencing proceedings. (See also South Carolina v. Gathers (1989) 490 U.S. 805, 811 [104 L.Ed.2d 876, 883, 109 S.Ct. 2207].) We need not decide whether the photographs would have been admissible at the penalty phase even if not admissible at the guilt phase for, as noted, they were properly admitted at the guilt phase. Nothing in Booth or Gathers prohibits evidence that is relevant to the determination of guilt.\n\n4. Alleged Misconduct During Cross-examination of Defendant\n\nDefendant testified in detail about his imprisonment at Chino, his escape, and the subsequent events until his arrest. Cross-examination was, as might be expected, vigorous. Defendant contends the cross-examination was \"riddled with improprieties\" and constituted a \"relentless campaign of character assassination.\" We disagree.\n\nAlthough a defendant cannot be compelled to be a witness against himself, if he takes the stand and makes a general denial of the crime with which he is charged, the permissible scope of cross-examination is \"very wide.\" (People v. Lanphear (1980) 26 Cal. 3d 814, 833-834 [163 Cal. Rptr. 601, 608 P.2d 689].) When a defendant voluntarily testifies, the district attorney may fully amplify his testimony by inquiring into the facts and circumstances surrounding his assertions, or by introducing evidence through cross-examination which explains or refutes his statements or the inferences which may necessarily be drawn from them. (People v. Harris, supra, 28 Cal. 3d at p. 953.) A defendant cannot, by testifying to a state of things contrary to and inconsistent with the evidence of the prosecution, thus indirectly denying the testimony against him, but without testifying expressly with relation to the same facts, limit the cross-examination to the precise facts concerning which he testifies. (People v. Gates (1987) 43 Cal. 3d 1168, 1185 [240 Cal. Rptr. 666, 743 P.2d 301].)\n\nDefendant first contends the district attorney improperly asked him to explain certain items of evidence against him. The trial court, however, sustained defense objections to the questions. Defendant did not request that the jury be admonished. Since an admonition could have cured any harm, the matter has been waived on appeal. (People v. Carrera (1989) 49 Cal. 3d 291, 319 [261 Cal. Rptr. 348, 777 P.2d 121]; People v. Green, supra, 27 Cal. 3d at p. 34.)\n\nThe district attorney also asked defendant about his use of aliases. Defendant failed to object to many of the questions, thus waiving the matter on appeal. (People v. Green, supra, 27 Cal. 3d at p. 34; People v. Baines (1981) 30 Cal. 3d 143, 149 [177 Cal. Rptr. 861, 635 P.2d 455].) In any event, the questions were proper. Three of the aliases were directly involved in this case: defendant's alias in prison at the time of his escape, an alias he used when he called Yolanda Jackson from Tijuana, and the alias he used with the Handys. Other questions, including defendant's use of an alias under penalty of perjury, were relevant to his credibility, a proper subject for cross-examination. (See People v. Harris, supra, 47 Cal. 3d at pp. 1080-1082 [admitting evidence of specific conduct relevant to a witness's credibility].)\n\nDefendant next complains of \"irrelevant details about escape plans, and improper insinuations regarding organized assistance.\" Although defendant pleaded guilty to the escape, his escape plans were relevant to the crime. The obvious motive for the murders was defendant's need for a vehicle and for time to drive out of the area. Questions regarding defendant's plans during the escape were proper to explore this motive and the question of premeditation. Defendant admitted he planned to go to a \"[f]riend's\" house upon his escape. Further questions were relevant to determine whether the friend lived near where the Ryen station wagon was abandoned.\n\nWhen defendant admitted that a \"few\" friends would possibly help him, the district attorney asked without objection whether they were part of an organization. Defendant said they were not. Any challenge to this question has been waived absent an objection. In addition, this was an isolated inquiry that elicited a negative response. There appears no reasonable probability that a more favorable verdict would have been returned had the question not been asked. (People v. Watson (1956) 46 Cal. 2d 818, 836 [299 P.2d 243].)\n\nDefendant finally complains of \"improper insinuations regarding threats.\" He did not object to most of the questions, thus waiving the matter. Defendant did object to a question whether he had \"threaten[ed] to kill\" Jackson. Jackson had testified that in one of her conversations with defendant following his escape, she asked him \"not to come and hurt [her] because [she] wouldn't help him.\" Defendant admitted she said this. The question complained of, which elicited a negative response, came within the \"very wide\" scope of permissible cross-examination. The same is true of questions whether defendant had threatened Diane Williams in his postescape conversation with her. There was no misconduct.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\n5. Prosecution \"Use\" of Defense Expert\n\nCriminalist Gregonis testified without objection that Dr. Blake, the defense expert, was present during some of the testing of the drop of blood that could not have come from any of the victims, and that the testing was \"kind of a joint effort.\" Over defense objection, he also testified that in retesting the blood he followed Dr. Blake's suggestions; Dr. Blake did not suggest that the EAP type be retested.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e On redirect examination, he\n\ndiscussed other evidence samples he sent to Dr. Blake for analysis. Defendant objected only that the testimony was beyond the scope of cross-examination, which was overruled. Dr. Blake testified for the defense about the analysis of the drop of blood. On cross-examination, he stated without objection that he had worked with Gregonis in the past, and the two had generally obtained the same results.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nDefendant contends the prosecution improperly \"utilized\" the defense expert as a witness against the defense, thereby interfering with his right to the effective assistance of counsel. As to those questions to which there was no objection on this ground, the matter has been waived on appeal. (People v. Clark (1990) 50 Cal. 3d 583, 623-624 [268 Cal. Rptr. 399, 789 P.2d 127]; People v. Bittaker, supra, 48 Cal. 3d at pp. 1098, 1104.)\n\nDefendant claims his attorney was incompetent in failing to object. (See generally People v. Ledesma (1987) 43 Cal. 3d 171, 215-218 [233 Cal. Rptr. 404, 729 P.2d 839].) As we have noted before, \"a mere failure to object to evidence or argument seldom establishes counsel's incompetence.\" (People v. Ghent, supra, 43 Cal. 3d at p. 772.) Defendant received an extraordinarily vigorous and able defense. His attorney cannot be said to be incompetent for not anticipating all of appellate counsel's later legal theories. In addition, the contentions lack merit.\n\nSince the defense made an issue of the manner in which the blood was tested, the prosecution was entitled to question Gregonis about all the circumstances surrounding the testing, including the involvement of the defense expert. The defense may choose either to have or not have an expert participate in the analysis of evidence, but if it chooses the former, no authority prohibits evidence of such participation. The jury was entitled to learn of all the circumstances involved in the testing, not merely the truncated version defendant desires.\n\nThe authorities defendant cites are not on point. Defendant was certainly entitled to the assistance of expert advice, which he received. (See Corenevsky v. Superior Court (1984) 36 Cal. 3d 307, 319-320 [204 Cal. Rptr. 165, 682 P.2d 360].) The district attorney did not seek to call defense counsel, or even Dr. Blake, as a witness (cf. People v. Rodriguez (1981) 115 Cal. App. 3d 1018 [171 Cal. Rptr. 798]), nor did he seek to elicit evidence of confidential communications between defendant and his attorney. (See People v. Tamborrino (1989) 215 Cal. App. 3d 575, 581-582 [263 Cal. Rptr. 731].) He did not comment on the defense failure to call a witness when it had a privilege\n\nto bar disclosure of that witness's testimony. (See People v. Bittaker, supra, 48 Cal. 3d at p. 1104.) Rather, the prosecution merely asked relevant questions of its own witness regarding the testing of evidence, and cross-examined an expert called by the defense.\n\nDr. Blake was not exempt from cross-examination eliciting testimony favorable to the prosecution merely because he was called by the defense. (People v. Mattson (1990) 50 Cal. 3d 826, 877-878 [268 Cal. Rptr. 802, 789 P.2d 983] [cross-examination of defense experts regarding the defendant's future dangerousness]; People v. Coleman, supra, 48 Cal. 3d at pp. 151-152 [cross-examination of defense psychiatrist regarding statements the defendant made to him].) There was no error.\n\n6. Waiver of Defendant's Presence\n\nAt defense request, the jury viewed the Ryen and Lease houses. Defendant personally waived his right to be present during the viewing. Defense counsel joined in the waiver. Defendant now contends he could not waive his presence. We recently rejected the contention. (People v. Lang (1989) 49 Cal. 3d 991, 1025-1026 [264 Cal. Rptr. 386, 782 P.2d 627]; see also Snyder v. Massachusetts (1934) 291 U.S. 97, 117-119 [78 L.Ed. 674, 684-685, 54 S.Ct. 330, 90 A.L.R. 575] [finding no federal constitutional right to be present at a jury view even absent a waiver].) Defendant also contends the waiver must be in writing under section 977, subdivision (b). That section, however, requires the defendant's presence only when it bears a reasonably substantial relation to the fullness of his opportunity to defend against the charge. (People v. Holloway (1990) 50 Cal. 3d 1098, 1116 [269 Cal. Rptr. 530, 790 P.2d 1327]; see also People v. Medina, supra, 51 Cal. 3d at pp. 902-903.) Presence at a jury view is not such a situation. (People v. Lang, supra, 49 Cal. 3d at pp. 1025-1026; Snyder v. Massachusetts, supra, 291 U.S. at pp. 105-106 [78 L.Ed. at pp. 677-678].)\n\nDefendant also waived his and his attorney's presence when the court responded to jury questions and when testimony was reread at the jury's request. Defense counsel was kept informed of the jury requests and participated fully in deciding how to respond to them. Defendant also contends this waiver was invalid. We have repeatedly rejected similar contentions. (People v. Medina, supra, 51 Cal. 3d at pp. 902-903, and cases cited therein.) There was no error.\n\n7. Instruction on Lesser Included Offenses\n\nNear the end of the guilt phase, the court said it was considering instructing the jury on second degree murder as well as first degree murder. When\n\nthe matter next was heard, defense counsel objected to instructions on second degree murder, stating, \"It's first degree or it is nothing.\" He informed the court that \"Mr. Cooper and I both agreed that we don't want a second degree instruction. Correct?\" Defendant responded, \"That's true.\" Defense counsel explained they did not want the jury to \"compromis[e],\" and they \"want them to go on the testimony. It is first degree or it is nothing.\" When the court suggested that the jury might find second degree murder, defense counsel responded that there was no evidence to support such a finding. The court agreed, and asked for the district attorney's views. The latter suggested that there may be a sua sponte duty to instruct on both degrees, and wanted time to \"check with the attorney general.\" The matter was then put over.\n\nWhen the parties discussed the question for the last time, defense counsel reiterated that \"it's pretty clear that we're against it,\" and that the defense just wanted \"guilty or not guilty of first degree.\" The district attorney requested a waiver from defendant personally. This colloquy followed: \"Mr. Negus [defense counsel]: From Mr. Cooper? We did it all but I'll do it again.\n\n\"Mr. Cooper, in this particular case the Court believes there's evidence which will support a second degree finding. I disagree, but that is the Court's -- the Court want's [ sic ] to give the instruction.\n\n\"The Court: I am not sure that I expressed that kind of an opinion, but I think that almost -- I would feel duty bound to give it nevertheless because it is always considered to be such an integral part of murder one.\n\n\" Mr. Negus: Well, there may or may not be evidence which would justify a second degree murder finding, I believe that there is not.\n\n\"We have discussed between ourselves that the only role that I could see a second degree verdict playing in this particular case is to give a jury a compromise verdict.\n\n\"I also informed you that as far as the eligibility for the penalty phase in this particular case is concerned, according to the present law as it is interpreted by -- at least by most of the courts, it says in the statute that a verdict of second degree is the same as a first degree if you find two second degrees, then we're into the penalty phase. In order not to encourage a compromise verdict, I believe that it is in your best interest to only give the jury two choices: First degree or nothing. Do you agree to do that?\n\n\"Mr. Cooper: Yes.\n\n\"The Court: Do you join in the waiver?\n\n\"Mr. Negus: I certainly do.\n\n\"The Court: All right, I accept it.\"\n\nThe court ultimately instructed the jury only on first degree murder and attempted murder.\n\nDespite defendant's repeated and vigorous objections at trial, he now contends the court prejudicially erred in not instructing on second degree murder. The Attorney General argues there was no error and any error was invited. We agree that any error was invited.\n\nThe trial court has a sua sponte duty to instruct on lesser included offenses when the evidence raises a question as to whether all of the elements of the charged offense were present and there is evidence that would justify a conviction of such a lesser offense. (People v. Bunyard (1988) 45 Cal. 3d 1189, 1232 [249 Cal. Rptr. 71, 756 P.2d 795].) Second degree murder is a lesser included offense of first degree murder. (People v. Wickersham (1982) 32 Cal. 3d 307, 326 [185 Cal. Rptr. 436, 650 P.2d 311].) Therefore, if there was evidence justifying a second degree murder conviction, the court had a duty to instruct on that offense.\n\nWe need not decide this question because even if there was error, defendant is barred from asserting it under the invited error doctrine. (People v. Bunyard, supra, 45 Cal. 3d at pp. 1234-1236.) The record is clear that the court would have given the instructions but for defendant's repeated objections. Even the district attorney was concerned that the instructions should be given. Defense counsel had a deliberate tactical purpose for his objection. (People v. Avalos (1984) 37 Cal. 3d 216, 229 [207 Cal. Rptr. 549, 689 P.2d 121].) He wanted to guard against a compromise verdict. Thus, \"the record clearly reflects that the failure to instruct on second degree murder resulted from a deliberate choice by defense counsel as well as defendant personally to utilize an all-or-nothing tactical strategy.\" (People v. Bunyard, supra, 45 Cal. 3d at p. 1235.) Defendant may not now complain that the court did exactly what he insisted upon. (Ibid.)\n\nDefendant contends he was inadequately informed of his legal situation prior to his personal waiver. We need not consider the claim, for we have never required a personal waiver before applying the invited error doctrine. For example, in the lengthy discussion of the doctrine in People v. Wickersham, supra, 32 Cal. 3d at pages 330-335, we repeatedly referred to the action of \"counsel\" as the critical factor. (See also People v. Graham (1969)\n\n71 Cal. 2d 303, 319 [78 Cal. Rptr. 217, 455 P.2d 153] [stating that the issue was whether \"the attorney's conduct\" constituted invited error].) That the court took defendant's personal waiver out of an abundance of caution does not vitiate counsel's invitation of any error.\n\nDefendant also contends that the record demonstrates his attorney misunderstood the law. He correctly points out that at least one first degree murder verdict is a prerequisite to any special circumstance finding, including multiple murder (§ 190.2, subd. (a); People v. Williams (1988) 44 Cal. 3d 883, 923-924 [245 Cal. Rptr. 336, 751 P.2d 395]), and claims his attorney wrongly believed that four second degree murder verdicts alone would subject him to the death penalty. He argues that counsel therefore acted \"out of ignorance or mistake,\" thus precluding application of the invited error doctrine. (People v. Wickersham, supra, 32 Cal. 3d at p. 330.)\n\nDefendant bases his factual claim on two items in the appellate record: certain statements made during jury selection, and the statements quoted above during the taking of defendant's personal waiver. To be properly understood, counsel's statements must be placed into context. Although a first degree murder conviction is a prerequisite to any special circumstance, the special circumstance of multiple murder itself requires only that there be a conviction \"of more than one offense of murder in the first or second degree.\" (§ 190.2, subd. (a)(3); People v. Bunyard, supra, 45 Cal. 3d at p. 1236, fn. 35.) Thus, one first degree murder conviction plus a murder conviction of either degree would result in a penalty phase.\n\nDuring jury selection, the trial court repeatedly indicated the erroneous belief that two first degree murder convictions were needed to force a penalty phase. Eventually, outside the presence of the jury, defense counsel corrected the court in the colloquy defendant now cites:\n\n\"Mr. Negus: One point that is not very important, but I -- just pedanticism drives me to bring it up. It is not required, at least according to the Attorney General's interpretation of the statute, that somebody be convicted of first degree murder in order to receive the death penalty under special circumstances.\n\n\"The Court: I stand corrected.\n\n\"Mr. Negus: That is disputed but the Attorney General claims that --\n\n\"The Court: Doesn't apply to this case.\n\n\"Mr. Negus: -- two second degree murders does it.\n\n\"Mr. Kochis: I can tell the Court that if Mr. Cooper is convicted, at least of the two counts of second degree murder, our position is going to be that we have a penalty phase.\n\n\"The Court: Oh, I have read about something.\n\n\"Mr. Kochis: That is the way the code reads, I believe.\n\n\"Mr. Negus: The code is a tad ambiguous, but that's certainly the way the Attorney General interprets it.\n\n\"Mr. Negus: I don't think it is of great moment.\n\n\"The Court: It doesn't appear to be in this case.\n\n\"Mr. Negus: But pedanticisum [ sic ] --\n\n\"The Court: I appreciate it. Let's take the recess.\"\n\nIt is not conclusively proven from this record that counsel based his tactical decision to oppose second degree murder instructions on the mistaken belief that no first degree murder conviction at all is required for a penalty phase. He may instead have merely stated a legal position that he disputed.\n\nIn the jury selection colloquy, counsel, out of \"pedanticism,\" corrected the court's mistaken belief that two first degree verdicts were required. He stated the statute was \"ambiguous,\" but referred three times to some unspecified Attorney General \"interpretation\" that he said was \"disputed.\" (In this appeal, the Attorney General has consistently agreed that one first degree verdict is a prerequisite to a special circumstance finding.) Although the district attorney stated his belief that two second degree verdicts alone would mandate a penalty phase, defense counsel never expressed agreement. Instead, he said the interpretation was \"disputed.\" It is not uncommon for defense counsel to dispute legal positions of the prosecution. This colloquy does not prove counsel misunderstood the law.\n\nThe same is true of counsel's statements when obtaining defendant's personal waiver. Counsel referred to the statute as \"interpreted\" by the courts. Analytically, counsel was correct that for purposes of the multiple murder special circumstance, a second degree murder verdict is the same as first degree. Although some of the language suggests rather strongly a misunderstanding of the law, the record is not conclusive. We note that defense counsel was experienced in death penalty trials. Prior to trial, he\n\nfiled a demurrer in which he correctly quoted the statute that \"The penalty for a defendant found guilty of murder in the first degree shall be death or confinement. . . .\" (§ 190.2, subd. (a).) At least as of that time, counsel apparently understood the law.\n\nNevertheless, the record suggests that counsel may have misunderstood the law at trial. However, as we explain, the invited error doctrine applies even if we assume, arguendo, that this was the case.\n\nDefendant contends the record must affirmatively show \"that counsel acted for tactical reasons and not out of ignorance or mistake.\" (People v. Wickersham, supra, 32 Cal. 3d at p. 330; see also People v. Avalos, supra, 37 Cal. 3d at p. 229, fn. 6 [\"Of course, if counsel had done all of these acts in ignorance of the law, there would not be invited error here\"].) The question becomes what kind of \"ignorance\" and what kind of \"mistake\" preclude a finding of invited error. To answer this question, we must examine the invited error cases to determine the reasons for the rule.\n\nIn People v. Graham, supra, 71 Cal. 2d 303, the \"seminal case concerning invited error\" (People v. Wickersham, supra, 32 Cal. 3d at p. 330), no tactical choice at all was stated for acquiescing in the error. Graham, citing with approval the finding of invited error in People v. Phillips (1966) 64 Cal. 2d 574 [51 Cal. Rptr. 225, 414 P.2d 353], stated the rule to be \"that the court's responsibility could be negated only in that special situation in which the defense counsel deliberately and expressly, as a matter of trial tactics, objected to the rendition of an instruction.\" (71 Cal. 2d at p. 318; see Wickersham, supra, 32 Cal. 3d at p. 331.)\n\nIn People v. Wickersham, supra, 32 Cal. 3d 307, the record similarly was devoid of any expressed tactical choice. (Id. at pp. 322-323.) We quoted with approval from People v. Keelin (1955) 136 Cal. App. 2d 860, 874 [289 P.2d 520, 56 A.L.R.2d 355], that invited error will be found \"only if counsel expresses a deliberate tactical purpose in suggesting, resisting, or acceding to an instruction . . . .\" (Wickersham, supra, 32 Cal. 3d at p. 332.) We also stated that \"If defense counsel intentionally caused the trial court to err, the appellant cannot be heard to complain on appeal.\" (Id. at p. 330.)\n\nThe rule that the record must show counsel did not act out of \"ignorance or mistake\" was developed so that an appellate court finding invited error could be confidant that counsel in fact acted intentionally. As we discussed in Wickersham, supra, 32 Cal. 3d 307: \"The present case graphically reveals the inherent difficulty of such an undertaking [deciding whether counsel's action or lack of it is founded on strategy, ignorance, mistake or trust]. Counsel may have believed that it was in his client's interest to give the jury\n\nthree choices -- first degree murder, involuntary manslaughter, or a not guilty verdict. Alternatively, counsel may not have been aware of the possible theory for a second degree murder conviction. Finally, counsel may have believed that the trial court would give the correct instructions and either failed to notice the omission or accepted the court's action as a decision that instructions on second degree murder were not required by the evidence. From the record before this court, it is impossible to tell which of these scenarios is correct.\" (Id. at p. 334.)\n\nBy contrast, the record in this case is sufficient to resolve these questions with confidence. We know counsel believed it was in his client's interest not to have the second degree murder instructions. We know counsel was aware the court would give the instructions if he did not object. We know counsel was aware his actions would, and did, cause the court not to give instructions it otherwise would have given. The difficulties in Wickersham (supra, 32 Cal. 3d at p. 334) do not exist in this case. \"The issue centers on whether counsel deliberately caused the court to fail to fully instruct . . . .\" (Id. at p. 335.) This record shows that counsel did.\n\nWe therefore hold that the record must show only that counsel made a conscious, deliberate tactical choice between having the instruction and not having it. If counsel was ignorant of the choice, or mistakenly believed the court was not giving it to counsel, invited error will not be found. If, however, the record shows this conscious choice, it need not additionally show counsel correctly understood all the legal implications of the tactical choice. Error is invited if counsel made a conscious tactical choice. A claim that the tactical choice was uninformed or otherwise incompetent must, like any such claim, be treated as one of ineffective assistance of counsel.\n\nUnder this test, any error was invited even if, arguendo, counsel did mistakenly believe that no first degree murder conviction was necessary to have a penalty phase. The record clearly shows counsel made a deliberate choice for an express tactical reason we have recognized as valid. (People v. Bunyard, supra, 45 Cal. 3d at p. 1235.) As suggested above, this does not leave defendant without a remedy if counsel acted incompetently. As in any other situation, defendant can always claim he received ineffective assistance of counsel.\n\nDefendant has made no such claim, but it would necessarily fail. To prevail, defendant would have to prove that counsel's representation fell below an objective standard of reasonableness under prevailing professional norms, and that there is a reasonable probability that, but for counsel's unprofessional errors, the result would have been different. A reasonable probability is a probability sufficient to undermine confidence in\n\nthe outcome. (Strickland v. Washington (1984) 466 U.S. 668, 687-688, 693-694 [80 L.Ed.2d 674, 693, 104 S.Ct. 2052]; People v. Ledesma, supra, 43 Cal. 3d at pp. 216-218.) Even if defendant could prove as a factual matter that counsel misunderstood the law when he invited any error, defendant could not show prejudice.\n\nWe first doubt that counsel would have made a different tactical decision had he correctly understood the law. The record makes clear that counsel, who was best able to evaluate the situation, believed it was hopeless to seek second degree murder verdicts. This belief was quite reasonable in light of the evidence. If the jury found that defendant was the killer, it necessarily would find he took the murder weapons, the hatchet and knife, with him from the Lease house. This showed planning prior to the killing. He had an obvious motive both for stealing the Ryen car -- to get transportation away from the area -- and for killing the family -- to facilitate the theft and gain time to perfect his escape. To have argued for second degree murder verdicts might merely have undercut the credibility of the defense -- which was that the investigation had been so badly botched the prosecution simply had the wrong person.\n\nIn addition, the evidence suggests that the two children were killed after the parents. Even if somehow the jury could have found second degree murder as to the parents (perhaps as the compromise that counsel feared), it surely would have found the murders of the children to have been in the first degree. This would have subjected defendant to the death penalty. Any tactic of asking the jury to convict of four second degree murders (the only verdict of guilty that could have avoided a penalty phase) \"pales in comparison\" with the tactic actually selected by defense counsel. (People v. Bunyard, supra, 45 Cal. 3d at p. 1235.)\n\nBut we need not rest our decision on an evaluation of what counsel might or might not have done. Even if we assume counsel would have requested second degree murder instructions, for the reasons discussed above it is not reasonably probable the jury would have returned any second degree murder conviction, and certainly not four of them.\n\nDefendant also contends the court was required to instruct on attempted second degree murder of Josh Ryen. Although the actual verdict form stated the attempted murder was of the first degree, \"the crime of attempted murder is not in fact divided into degrees,\" at least at the time of this crime. (People v. Macias (1982) 137 Cal. App. 3d 465, 472 [187 Cal. Rptr. 100]; see People v. Douglas (1990) 220 Cal. App. 3d 544, 548-550 [269 Cal. Rptr. 579] [regarding the law today].) The issue is thus essentially moot. In any event, the tactical reasons for defendant's objection to second degree instructions\n\napply to the attempted murder count as well as the murder counts. It would have been ludicrous to instruct on second degree attempted murder but not second degree murder.\n\n8. Instruction on Suppression of Evidence\n\nOver defense objection, the court gave the standard instruction regarding efforts to suppress evidence: \"If you find that the defendant attempted to suppress evidence against himself in any manner, such as by destroying evidence, such attempts may be considered by you as a circumstance tending to show a consciousness of guilt. However, such evidence is not sufficient in itself to prove guilt and its weight and its significance, if any, are matters for your determination.\" (See CALJIC No. 2.06.)\n\nThe instruction was based on defendant's admission that, one evening after dark, he threw his prison clothes and the prison issue tennis shoes overboard from the Handys' boat. The shoes especially were important evidence because of the footprints found at the murder scene.\n\nDefendant contends the instruction was improper absent a requirement that he was aware the items he destroyed constituted evidence. The instruction, however, clearly implied such awareness by referring to an attempt to \"suppress\" evidence as a circumstance \"tending to show a consciousness of guilt.\" The instruction sufficiently guided the jury's consideration of this evidence. (People v. Hannon (1977) 19 Cal. 3d 588, 597-598 [138 Cal. Rptr. 885, 564 P.2d 1203].)\n\nDefendant also suggests there was insufficient evidence to support the instruction. On the contrary, the evidence that defendant was issued the tennis shoes in prison, that shoe prints matching those shoes were found at the murder scene, and that defendant disposed of the shoes after dark by throwing them into the ocean, is \"some evidence\" in the record which, if believed by the jury, sufficiently supported the inference of a consciousness of guilt on the part of the defendant. (People v. Pensinger (1991) 52 Cal. 3d 1210, 1246 [278 Cal. Rptr. 640, 805 P.2d 899]; People v. Hannon, supra, 19 Cal. 3d at p. 597.) The court properly gave the instruction.\n\n9. Alleged Jury Misconduct\n\nDefendant contends the jury committed prejudicial misconduct. We disagree.\n\na. The Facts\n\nDuring deliberations, the foreperson of the jury sent the court a note stating that, two days before, Juror LaPage had \"inadvertently mentioned\n\nsomething concerning Mr. Cooper that was not mentioned in court during the trial.\" The foreperson stopped the discussion, and reminded the jurors that they should discuss only facts received in evidence and that they were to disregard the remarks about defendant. Later the same day, at the request of Juror Doxey, he polled the jurors; all said LaPage's comment would not affect their decisionmaking process. However, Juror Doxey was concerned \"with the technical (legal) aspect of the incident.\" The jury did not deliberate the day after these events. The next day, at Juror Doxey's request, the foreperson sent the note to the court asking for instructions.\n\nThe court instructed the jury to stop deliberating, and questioned LaPage about what had happened. She said the jury was reviewing an exhibit that contained language \"which indicated headaches and hallucinations by Mr. Cooper.\" Someone questioned whether the jury could consider that exhibit. LaPage stated to the others that she \"knew personally that there was supposed to have been a mental problem with Mr. Cooper. . . .\" Doxey said that she did not think the jury should consider such personal knowledge. The foreperson polled the jury, and all agreed the information would not interfere with their judgment.\n\nThe exhibit LaPage referred to was the reporter's transcript of a hearing from the 1983 prosecution of defendant that resulted in his prison commitment. The jury already knew of this prosecution. The transcript contained a statement that the defendant had complained of \"headaches\" and \"hallucinations that interfere with his ability to participate.\" The speaker was \"just making a record pursuant to 1368.\" This exhibit was \"inadvertently\" admitted into evidence at the defense's request.\n\nDefendant moved for a mistrial. The court denied the motion, but admonished the jury that the transcript was \"received into evidence inadvertently and through mistake,\" that it was withdrawn, and that the jury was not to consider it. It then questioned each juror individually regarding possible prejudice. LaPage said she remembered \"vaguely\" about some mental problem or something involving a hospital in Pennsylvania. Doxey said she thought LaPage said defendant was a \"former mental patient,\" and possibly used the word \"escaped.\" All the jurors said they could set such matters aside, and decide the case solely on the evidence.\n\nThe court denied defendant's renewed motion for a mistrial. It then readmonished the entire jury to disregard the stricken evidence and \"any comments made pertaining to it,\" and to consider only the evidence received in court.\n\nb. Discussion\n\nDefendant first contends the jury committed misconduct in reading and considering the transcript. If he is correct, such misconduct raises a presumption of prejudice that may be rebutted by proof that no prejudice actually resulted. (People v. Holloway, supra, 50 Cal. 3d at p. 1108; People v. Honeycutt (1977) 20 Cal. 3d 150, 156 [141 Cal. Rptr. 698, 570 P.2d 1050].) There was, however, no misconduct. The exhibit had been admitted into evidence, albeit inadvertently. The jury was thus justified in reading it. Indeed, the jury was concerned whether it should be considering the statements regarding defendant's mental state, and brought the matter to the court's attention. As the trial court found, the jury did nothing improper.\n\nDefendant cites cases suggesting that even the innocent consideration of materials the jury is inadvertently given constitutes misconduct giving rise to the presumption of prejudice. This suggestion finds its genesis in People v. Kitt (1978) 83 Cal. App. 3d 834, 849-850 [148 Cal. Rptr. 447], in which the jury viewed four photographs not admitted into evidence that were \"inadvertently\" sent to the jury room. The appellate court, without analysis, stated that \"Even though the jury's observation of these photographs was not intentional, the fact that the photographs were actually observed by jurors falls under the category of juror misconduct.\" (Id. at p. 850.) Later cases have cited this language to find a presumption of prejudice in similar situations. (People v. Hogan (1982) 31 Cal. 3d 815, 846 [183 Cal. Rptr. 817, 647 P.2d 93] [a tape recording containing inadmissible portions that had been deleted was accidentally given to the jury during deliberations]; People v. Hill (1980) 110 Cal. App. 3d 937, 942 [168 Cal. Rptr. 272] [the jury considered an exhibit admitted into evidence but which inadvertently contained inadmissible information]; People v. Boyd (1979) 95 Cal. App. 3d 577, 584 [157 Cal. Rptr. 293] [the jury inadvertently viewed a police report face sheet while reading a transcript it was given].)\n\nThe cases establishing the presumption of prejudice involve actual misconduct, or, as phrased in People v. Boyd, supra, 95 Cal. App. 3d at page 585, \"true jury misconduct.\" (E.g., People v. Honeycutt, supra, 20 Cal. 3d at pp. 156-157 and cases cited therein; People v. Pierce, supra, 24 Cal. 3d at pp. 206-207 [foreperson discussed the case with a police officer friend].) The rationale for the presumption is venerable. \"A juror is not allowed to say: 'I acknowledge to grave misconduct. I received evidence without the presence of the court, but those matters had no influence upon my mind when casting my vote in the jury-room.' The law, in its wisdom, does not allow a juror to purge himself in that way.\" (People v. Stokes (1894) 103 Cal. 193, 196-197 [37 P. 207], quoted in People v. Holloway, supra, 50 Cal. 3d at p. 1109.) When a person violates his oath as a juror, doubt is cast on that\n\nperson's ability to otherwise perform his duties. (See People v. Pierce, supra, 24 Cal. 3d at p. 207.) The presumption of prejudice is appropriate in those situations.\n\nWhen, as in this case, a jury innocently considers evidence it was inadvertently given, there is no misconduct. The situation is the same as any in which the court erroneously admits evidence. The fact that the evidence was inadvertently admitted and then withdrawn does not elevate the error to one of misconduct. There has been merely \"an error of law . . . such as . . . an incorrect evidentiary ruling.\" (People v. Pierce, supra, 24 Cal. 3d at p. 207.) Such error is reversible only if it is reasonably probable that a result more favorable to the defendant would have been reached in the absence of the error. (Id. at pp. 206-207; People v. Watson, supra, 46 Cal. 2d at p. 836.) We disapprove of contrary language in Hogan, supra, 31 Cal. 3d 815; Hill, supra, 110 Cal. App. 3d 937; Boyd, supra, 95 Cal. App. 3d 577; and Kitt, supra, 83 Cal. App. 3d 834.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nThe Attorney General argues that since defendant requested that the exhibit be admitted, the error was invited. The record suggests, however, that defense counsel's action was caused by confusion as to which items the clerk had marked for identification. We will therefore consider the merits.\n\nThe result of the exhibit's inadvertent admission was relatively minor -- merely the jury learning that defendant once complained of headaches and said he had hallucinations. On the other hand, the evidence of guilt was extremely strong. Many items of circumstantial evidence pointed to defendant's guilt. Some alone were quite compelling; others less so. In combination, the evidence established defendant's guilt overwhelmingly.\n\nFirst, there was the fact of defendant's escape and hiding out at the house nearest the crime scene at precisely the time of the crime. Defendant left the house the very night of the murders. The Ryen house could be seen from\n\nthe Lease house. Since defendant's telephonic appeals for help had proved vain, he desperately needed a means to get out of the area, a means the Ryen station wagon could provide. The hatchet that was one of the murder weapons came from within the Lease house, near the window through which the Ryen house was visible. The sheath for this hatchet was found on the floor of the very room defendant slept in. Items that could have been the remaining murder weapons were missing from the Lease house.\n\nIn addition to these circumstances, there was the strong shoe print comparison evidence, the cigarette and tobacco comparison evidence, the match between defendant's blood type and the drop of blood in the Ryen house that was not from a victim, the bloodstained prison issue button on the Lease house floor, the bloodstained rope (not defendant's blood, consistent with a victim's blood) found in the closet of the bedroom defendant used, the blood in the Lease house shower and elsewhere, the hair comparisons, and the other evidence summarized earlier in this opinion.\n\nIt is utterly unreasonable to suppose that by coincidence, some hypothetical real killer chose this night and this locale to kill; that he entered the Lease house just after defendant left to retrieve the murder weapons, leaving the hatchet sheath in the bedroom defendant used; that he returned to the Lease house to shower; that he drove the Ryen station wagon in the same direction defendant used on his way to Mexico; and that he happened to wear prison issue tennis shoes like those of defendant, happened to have defendant's blood type, happened to have hair like defendant's, happened to roll cigarettes with the same distinctive prison issue tobacco, and so forth. Defendant sought to discredit or minimize each of these items of evidence, but the sheer volume and consistency of the evidence is overwhelming. Error in admitting the exhibit would have been harmless even if it had not been withdrawn.\n\nDefendant argues that the jury deliberated for 27 hours over 7 court days, thus showing it considered the issue of guilt to be close. The Attorney General claims the time of deliberations was somewhat less, but does not deny it was lengthy. We have sometimes inferred from unduly lengthy deliberations that the question of guilt was close. (E.g., In re Martin (1987) 44 Cal. 3d 1, 51 [241 Cal. Rptr. 263, 744 P.2d 374].) The inference is much weaker, however, in a case of this size and complexity. The trial lasted over three months. Dozens of witnesses testified, some about complex scientific testing. Well over 700 exhibits were admitted into evidence. This was a capital case. It is not surprising that the deliberations were protracted. Even accepting defendant's time estimate, the length of the deliberations demonstrates nothing more than that the jury was conscientious in its performance of high civic duty.\n\nIn addition, the exhibit was withdrawn, and the jury admonished to disregard it, thus further reducing the danger of prejudice. In People v. Holloway, supra, 50 Cal. 3d at pages 1111-1112, we reversed a conviction for jury misconduct in part because the misconduct was not discovered until after the verdict. \"Our conclusion might have been different had the misconduct been revealed in time for the court to have taken corrective steps to cure it through admonition or by other prophylactic measures.\" (Ibid.) Here, the court did take such measures. (See also People v. Harper (1986) 186 Cal. App. 3d 1420, 1427 [231 Cal. Rptr. 414]; People v. Craig (1978) 86 Cal. App. 3d 905, 919 [150 Cal. Rptr. 676].) \"The trial court was satisfied no injustice would result, and we are as well.\" (People v. Craig, supra, 86 Cal. App. 3d at p. 919.)\n\nDefendant contends the court should have told the jury to \"accept it as being conclusively proved that the defendant has no mental instability . . .\" The court suggested the instruction, but did not give it when the district attorney objected. Since there was no evidence before the jury either way on defendant's mental condition, the truth of the proposed statement was dubious. Under the circumstances, we find the actual instruction sufficient to protect defendant's interests.\n\nFinally, the court questioned each juror individually to assure itself that each would and could follow the admonition and decide the case solely on the evidence. Defendant contends this violates Evidence Code section 1150, subdivision (a), which, \"Upon an inquiry as to the validity of a verdict,\" prohibits evidence to show the effect of a \"statement, conduct, condition, or event upon a juror either in influencing him to assent to or dissent from the verdict or concerning the mental processes by which it was determined.\" By its very language, this section applies only to postverdict inquiries into how error or misconduct had affected the juror in reaching the verdict. (See People v. Haskett (1990) 52 Cal. 3d 210, 240-241, fn. 11 [276 Cal. Rptr. 80, 801 P.2d 323].) The section does not prohibit individual questioning of jurors to assure the court there will be no future harm, to obviate any such harm, or to strengthen the effectiveness of an admonition.\n\nDefendant also argues that LaPage committed misconduct in her remark about her supposed personal knowledge regarding his mental condition. The remark was apparently triggered by the exhibit inadvertently admitted into evidence. Even if we consider it to be misconduct, the presumption of prejudice was thoroughly rebutted for the reasons discussed above. There is no substantial likelihood that any juror was impermissibly influenced to the defendant's detriment. (People v. Marshall, supra, 50 Cal. 3d at p. 952.) The trial court, which carefully inquired into the matter, denied defendant's motion for a mistrial. \"Whether a particular\n\nincident is incurably prejudicial is by its nature a speculative matter, and the trial court is vested with considerable discretion in ruling on mistrial motions.\" (People v. Haskett (1982) 30 Cal. 3d 841, 854 [180 Cal. Rptr. 640, 640 P.2d 776].) There was no abuse of discretion here.\n\n10. Accumulated Error\n\nDefendant argues that the accumulation of error was prejudicial. There was, however, little error to accumulate. Defendant has merely shown that his \"'trial was not perfect -- few are'\" (Darden v. Wainwright, supra, 477 U.S. at p. 183 [91 L.Ed.2d at p. 158]), especially few of the length and complexity of this trial. There was no prejudicial error either individually or collectively.\n\n11. Guilty Plea to Escape\n\nBefore trial, defendant pleaded guilty to the escape charge. He now contends he was not adequately advised of his right of confrontation prior to the plea. \"[T]he record must contain on its face direct evidence that the accused was aware, or made aware, of his right to confrontation, to a jury trial, and against self-incrimination, as well as the nature of the charge and the consequences of his plea.\" (In re Tahl (1969) 1 Cal. 3d 122, 132 [81 Cal. Rptr. 577, 460 P.2d 449] [italics in original].) No specific formula is required, as long as the record shows by direct evidence that the accused was fully aware of his rights. (People v. Lucky (1988) 45 Cal. 3d 259, 285 [247 Cal. Rptr. 1, 753 P.2d 1052]; People v. English (1981) 116 Cal. App. 3d 361, 370 [172 Cal. Rptr. 122].)\n\nThe record of this case, though not reflecting \"optimum legalistic constitutional terminology\" (People v. English, supra, 116 Cal. App. 3d at p. 370), was sufficient under the circumstances. As part of the plea proceeding, defense counsel stated on the record, in front of the defendant, that he had discussed with defendant his \"confrontation rights.\" Defendant stated he understood and waived his rights. We find no error.\n\nE. Special Circumstance Issue\n\nDefendant contends the court erroneously failed to instruct the jury it had to find he intended to kill as part of the multiple-murder special circumstance. The contention fails for two reasons.\n\nFirst, the jury was instructed that to find first degree murder, it had to find express malice and a willful, deliberate and premeditated killing. There were no aiding and abetting or felony-murder instructions. Express malice\n\nrequires an intent to kill. Thus, the court did instruct the jury it had to find an intent to kill.\n\nSecond, an intent to kill is no longer an element of the special circumstance of multiple murder if the defendant is the actual killer. (People v. Anderson (1987) 43 Cal. 3d 1104, 1149-1150 [240 Cal. Rptr. 585, 742 P.2d 1306], overruling the contrary rule of Carlos v. Superior Court (1983) 35 Cal. 3d 131 [197 Cal. Rptr. 79, 672 P.2d 862] and People v. Turner (1984) 37 Cal. 3d 302 [208 Cal. Rptr. 196, 690 P.2d 669].) Anderson applies to this pre- Carlos crime. (People v. Poggi (1988) 45 Cal. 3d 306, 326-327 [246 Cal. Rptr. 886, 753 P.2d 1082].) The record establishes that if, as the jury found, defendant is guilty, he was the actual killer.\n\nF. Penalty Phase Issues\n\n1. Evidence of Nonviolent Criminal Conduct\n\nThe prosecution proved that in one course of conduct, defendant burglarized a home in Pennsylvania, assaulted, kidnapped and raped a young girl who interrupted the burglary, attempted to steal one vehicle, and did steal the rape victim's vehicle. At the prosecution's request, and over defense objection, the court instructed the jury on the elements of each of these crimes. Defendant contends the court erred in admitting evidence of, and instructing the jury on, the burglary and vehicle theft crimes.\n\nAlthough evidence of any prior felony conviction is admissible as a factor in aggravation (§ 190.3, factor (c)), evidence of \"criminal activity\" of which the defendant was not previously convicted is admissible only if it \"involved the use or attempted use of force or violence or the express or implied threat to use force or violence.\" (§ 190.3, factor (b); People v. Boyd (1985) 38 Cal. 3d 762, 776-777 [215 Cal. Rptr. 1, 700 P.2d 782].) This rule reflects the judgment \"that nonviolent felonies are entitled to some weight, but only if evidenced by a conviction -- otherwise the time and trouble of proving the crime will outweigh its probative value.\" (Boyd, supra, at p. 774.)\n\nDefendant contends the burglary and theft offenses were nonviolent conduct excluded under Boyd, supra, 38 Cal. 3d 762. We disagree. Section 190.3, factor (b), refers to \"criminal activity,\" not specific crimes. The various crimes that defendant committed were part of the series of events which commenced with the burglary, continued with the violent crimes against the victim who interrupted the burglary, and ended with the theft of the victim's vehicle. This was a continuous course of \"criminal activity\"\n\nwhich clearly involved force or violence, or at least the \"threat\" of force or violence.\n\nContrary to defendant's argument, continuous criminal activity is not segmented into portions, with those portions not themselves involving violence excised. When criminal activity involving violence is proven, proof of nonviolent crimes committed during the same course of conduct will entail relatively little additional \"time and trouble.\" (People v. Boyd, supra, 38 Cal. 3d at p. 774.) Indeed, deleting references to nonviolent crimes from the presentation of evidence of the violent crimes would itself entail time and trouble. We thus hold that all crimes committed during a continuous course of criminal activity which includes force or violence may be considered in aggravation even if some portions thereof, in isolation, may be nonviolent. The jury properly was allowed to consider all the crimes committed during this violent episode of criminal activity.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nWe agree with defendant that the court erred in instructing the jury on the elements of the nonviolent crimes. Upon request by either party, the court should instruct on the elements of alleged other crimes (People v. Phillips (1985) 41 Cal. 3d 29, 72-73, fn. 25 [222 Cal. Rptr. 127, 711 P.2d 423]), but only those that in and of themselves involve violence within the meaning of section 190.3, factor (b). The error was, however, harmless. As noted, the jury properly heard all the evidence of the other criminal activity. Instruction on the elements of the nonviolent crimes added little, if anything, to the impact of the evidence and the instructions on the far more serious violent crimes.\n\n2. Invalid Stipulation\n\nThe defense entered into a number of stipulations at the penalty phase, including that defendant committed the Pennsylvania offenses. As a result of these stipulations, the prosecution agreed not to present evidence that defendant had escaped from a nearby mental institution a short time before the crimes. The evidence would otherwise have been relevant to show identity. Before the stipulations were given to the jury, defense counsel stated on the record that he had discussed the matter with defendant. Defendant personally agreed that it was \"satisfactory to enter into these stipulations.\"\n\nDefendant now contends that his personal waiver was insufficient because he was not fully advised of his constitutional rights. However, no personal waiver of any kind is required before counsel may enter into\n\nstipulations of fact at the penalty phase. (People v. Ramirez (1990) 50 Cal. 3d 1158, 1183-1184 [270 Cal. Rptr. 286, 791 P.2d 965]; People v. Lang, supra, 49 Cal. 3d at p. 1038.) That the court sought and obtained defendant's personal approval of the stipulations out of caution does not change this rule.\n\n3. Insufficient Statutory Notice\n\nThe prosecution has a statutory duty to provide the defense with advance notice of the evidence it proposes to introduce in aggravation of the offense. (§ 190.3; People v. Carrera, supra, 49 Cal. 3d at p. 334.) In compliance with this duty, the prosecution filed a notice of intent to present various items of evidence, including defendant's \"rape,\" \"robbery\" and \"assault with a deadly weapon\" upon the Pennsylvania victim \"as described on pages 64 through 69 of the discovery as permitted by Penal Code Section 190.3(b).\"\n\nDefendant contends this was insufficient notice that the prosecution intended to prove the Pennsylvania burglary and theft offenses. Although defendant later objected to instruction on these offenses, he did not object to the evidence itself on this basis. The issue is thus not cognizable on appeal. (People v. Carrera, supra, 49 Cal. 3d at p. 334.) In addition, there was at least \"substantial compliance\" with section 190.3. (People v. Walker (1988) 47 Cal. 3d 605, 637 [253 Cal. Rptr. 863, 765 P.2d 70].) The crimes were all committed as part of the same course of conduct. The actual notice referred to the discovery previously supplied to the defense. Defendant never contended this discovery did not include facts of the burglary and theft offenses.\n\nFinally, defendant has not shown prejudice. \"In the absence of any indication that the delay in notice had in some fashion affected the manner in which defense counsel handled the prior proceedings, the appropriate remedy for a violation would ordinarily be to grant a continuance as needed to allow defendant to develop a response.\" (People v. Carrera, supra, 49 Cal. 3d at p. 334.) Defendant never requested such a continuance, nor did he otherwise suggest any prejudice. At trial, he did not question either the nature of the crimes committed in Pennsylvania, or that he committed them.\n\nDefendant also contends there was insufficient notice the district attorney intended to rely on the absence of mitigating factors as an aggravating factor. He admits no evidence was presented along these lines. Section 190.3 specifically refers to \"evidence.\" The section is thus not implicated in this contention. Defendant's related contentions regarding the jury instructions and prosecution argument will be discussed post.\n\n4. Alleged Misconduct in Prosecution Argument\n\nDefendant contends the district attorney committed misconduct in his argument to the jury. Since defendant did not object, the contention is not cognizable on appeal. (People v. Bell (1989) 49 Cal. 3d 502, 547 [262 Cal. Rptr. 1, 778 P.2d 129].) It also lacks merit.\n\nFirst, defendant contends the district attorney \"improperly utilized\" evidence of prior criminality \"to rebut the defense strategy of reliance on a lingering doubt of guilt\" when he argued that the assault upon the Pennsylvania victim was \"the same type of action, the same use of available weapons that we then see later on in 1983 in the commission of the Ryen attack.\" In context, however, the district attorney merely argued the facts of the crimes were aggravating circumstances, which they certainly were. The argument was proper.\n\nDefendant next claims the district attorney improperly \"implied\" that the absence of mitigating factors was itself an aggravating factor when he argued that defendant was \"not a product of a bad background,\" but had \"loving parents.\" It is proper, however, to argue that a defendant is \" less deserving of leniency \" because of the absence of a mitigating factor. (People v. Rodriguez (1986) 42 Cal. 3d 730, 789 [230 Cal. Rptr. 667, 726 P.2d 113] [italics in original].) The argument complained of did no more.\n\nDefendant finally contends the district attorney improperly urged the jury to consider his demeanor at trial as an aggravating factor. We rejected a similar contention in People v. Jackson (1989) 49 Cal. 3d 1170, 1205-1206 [264 Cal. Rptr. 852, 783 P.2d 211].\n\n5. Instructional Issues\n\na. Deleting Inapplicable Mitigating Factors\n\nOver objection, the court listed the statutory aggravating and mitigating factors for the jury to consider \"if applicable.\" Some of the factors were prefaced with the \"whether or not\" language of section 190.3, e.g., \"Whether or not the victim was a participant in the defendant's homicidal conduct or consented to the homicidal act.\" Defendant contends that inapplicable mitigating factors should have been deleted, and that use of the statutory language \"Whether or not\" was erroneous. We have repeatedly rejected the contentions. (People v. Malone (1988) 47 Cal. 3d 1, 47 [252 Cal. Rptr. 525, 762 P.2d 1249]; People v. Ruiz (1988) 44 Cal. 3d 589, 619-620 [244 Cal. Rptr. 200, 749 P.2d 854].)\n\nb. Impact of Verdict on Defendant's Family\n\nThe court refused a defense request to give an instruction that the jury could consider as a mitigating circumstance \"The effect of a death verdict on Mr. Cooper's family.\" Defendant claims error. We disagree. Although defendant may have a constitutional right to present evidence of the effect of a death verdict on his family,\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e the court allowed him to present all the evidence he wanted at the penalty phase. The instructions did not preclude the jury from considering any of the evidence it heard. The court gave the \"catch-all\" instruction suggested in People v. Easley (1983) 34 Cal. 3d 858, 878, footnote 10 [196 Cal. Rptr. 309, 671 P.2d 813], and expressly instructed that the jury \"may consider pity, sympathy, or mercy for the defendant.\" These instructions were sufficient. The court did not have to give the additional requested pinpoint instruction. (See People v. Daniels, supra, 52 Cal. 3d at pp. 870-871; People v. Gordon, supra, 50 Cal. 3d at pp. 1276-1277.)\n\nc. Weighing Aggravating and Mitigating Factors\n\nThe court instructed the jury, \"If you conclude that the aggravating circumstances outweigh the mitigating circumstances, you shall impose a sentence of death. However, if you determine that the mitigating circumstances outweigh the aggravating circumstances, or if you determine that they are evenly balanced so that neither set of circumstances outweigh the other, you shall impose a sentence of confinement in state prison for life without the possibility of parole.\"\n\nWe have explained many times, beginning with People v. Brown (1985) 40 Cal. 3d 512, 541-544 [220 Cal. Rptr. 637, 709 P.2d 440], reversed on other grounds sub nom. California v. Brown (1987) 479 U.S. 538 [93 L.Ed.2d 934, 107 S.Ct. 837], that this instruction, and particularly use of\n\nthe word \"shall,\" is potentially misleading in two respects. First, the jury might erroneously infer that it could perform the balancing or weighing process in a mechanical fashion by comparing the number of factors in aggravation with those in mitigation, or by an arbitrary assignment of weights to the factors. Second, the jury might fail to understand that a juror is not required to vote for the death penalty unless, as a result of the weighing process, the juror personally determines that death is the appropriate penalty under all the circumstances. To determine whether the jury may have been misled to defendant's prejudice in either respect, we examine the entire record. (People v. Hayes (1990) 52 Cal. 3d 577, 642 [276 Cal. Rptr. 874, 802 P.2d 376]; People v. Lang, supra, 49 Cal. 3d at pp. 1033-1034.)\n\nAs in Hayes, supra, 52 Cal. 3d at page 642, the court here gave an additional instruction that virtually eliminated any risk that the jury would be misled as to its sentencing discretion or as to the process of penalty determination. It instructed, \"These various factors in aggravation and mitigation may be assigned different weights by you. Thus, it is not the number of factors, necessarily, but also the weight you assign to them which should control. For instance, you could find that one specific factor on one side weighs so heavily in your consideration that it outweighs all of the determined factors on the other side.\"\n\nThis instruction significantly reduced the risk of juror misapprehension. First, it expressly told the jury that penalty was not to be determined by a mechanical process of counting, but rather that the jurors were to assign a weight to each factor, and that a single factor could outweigh all other factors. Second, \"'when jurors are informed that they have discretion to assign whatever value they deem appropriate to the factors listed, they necessarily understand they have discretion to determine the appropriate penalty.'\" (People v. Hayes, supra, 52 Cal. 3d at p. 642, quoting People v. Boyde (1988) 46 Cal. 3d 212, 253 [250 Cal. Rptr. 83, 758 P.2d 25], affd. sub nom. Boyde v. California (1990) 494 U.S. 370 [108 L.Ed.2d 316, 110 S.Ct. 1190].)\n\nNothing in the penalty phase arguments of counsel could have misled the jury to defendant's prejudice. The district attorney correctly explained to the jury that the penalty decision came down to a \"balancing\" of \"guidelines for deciding whether or not a verdict of life or death is appropriate.\" There was no Brown error.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nd. \" Lingering Doubt\" Instruction\n\nThe court instructed the jury to consider in its penalty decision \"Whether or not you have any lingering doubt as to Mr. Cooper's guilt.\" Defendant requested a somewhat different instruction: \"The death penalty should not be imposed if you find that although the evidence suffices to sustain the verdict, it does not foreclose all doubt as to Mr. Cooper's guilt.\" He now contends the court erred in refusing to give his instruction.\n\nHe first claims that the phrase \"Whether or not\" is improper. This language is found in section 190.3, and, as noted above, its use is appropriate. Defendant also contends the court was required to prohibit the jury from imposing the death penalty if the evidence does not \"foreclose all doubt\" as to guilt. The court is not, however, required to instruct on a higher standard of proof of guilt at the penalty phase of a capital trial. (Franklin v. Lynaugh (1988) 487 U.S. 164, 172-175 [101 L.Ed.2d 155, 164-167, 108 S.Ct. 2320]; People v. Kaurish (1990) 52 Cal. 3d 648, 706 [276 Cal. Rptr. 788, 802 P.2d 278].) As in Kaurish, the court permitted the jury to consider any lingering doubt. No further instruction was necessary.\n\ne. Reasonable Doubt as to Penalty\n\nDefendant contends the court was required to instruct that to return a death verdict the jury had to find beyond a reasonable doubt that the aggravating factors outweighed the mitigating factors. We have repeatedly rejected the contention. (E.g., People v. Gordon, supra, 50 Cal. 3d at pp. 1273-1274.)\n\nf. Applicability of Guilt Phase Instructions\n\nThe court instructed the jury to apply all relevant guilt phase instructions to the penalty phase \"except as hereinafter provide[d].\" It also instructed that \"in deciding the appropriate penalty you may consider pity, sympathy, or mercy for the defendant.\" Defendant contends the court should have specifically informed the jury which of the guilt phase instructions applied to the penalty phase. We have rejected the contention. (People v. Brown (1988) 46 Cal. 3d 432, 460 [250 Cal. Rptr. 604, 758 P.2d 1135].)\n\n6. Response to Jury Question\n\nDuring deliberations, the jury sent the court a note stating, \"A question, informative in nature, has been raised pertaining to the sentencing procedure if the jury cannot unanimously agree on a penalty verdict.\" A conference telephone call was held among the court and both counsel regarding\n\nthe appropriate response. Defense counsel waived defendant's personal presence after discussing it with him.\n\nThe district attorney requested the court to inform the jury that if it did not reach a verdict, the penalty phase would be retried before another jury. The court and defense counsel believed that such an instruction would be coercive. Instead, the court responded to the jury: \"As I previously instructed it is the duty of each of you to consider the evidence for the purpose of arriving at a verdict if you can do so in accordance with that evidence and the instructions given to you. You are not to be concerned with procedures.\" Defense counsel \"prefer[red]\" the court to \"tell them that if they cannot reach a verdict to inform the Judge, otherwise they are not to be concerned with procedure.\"\n\nDefendant now contends the court should have told the jury that \"if they were unable to reach a unanimous agreement the penalty issue would be retried by another jury, but that they should not concern themselves with such a possibility and should not allow it to influence their vote.\" The first part is precisely what defense counsel successfully objected to at trial. The objection precludes defendant from now contending the instruction should have been given. (People v. Medina, supra, 51 Cal. 3d at p. 902.) Defendant argues the instruction to which he objected did not include the second part of his current suggested language. This is correct, but defense counsel did not suggest the elaboration he now urges. He may not raise the issue on appeal. (Ibid., and cases cited therein.)\n\nThe contention also lacks merit. The court is not required to \"educate the jury on the legal consequences of a possible deadlock.\" (People v. Bell, supra, 49 Cal. 3d at pp. 552-553, and cases cited therein.)\n\nDefendant also contends the court erred in holding the hearing on the appropriate response outside his personal presence. The contention lacks merit. Defense counsel properly waived defendant's presence after consultation with him. (People v. Medina, supra, 51 Cal. 3d at pp. 902-903, and cases cited therein.)\n\n7. Accumulated Guilt and Penalty Phase Error\n\nDefendant contends the combination of guilt phase error and penalty phase error requires reversal of the penalty verdict. There was, however, little error to accumulate. After reviewing the record, we find no reasonable possibility the error affected the penalty verdict. (People v. Brown, supra, 46 Cal. 3d at pp. 448-449.)\n\n8. Automatic Motion to Modify Death Verdict\n\nSection 190.4, subdivision (e), provides for an automatic motion to modify a death verdict. In ruling on the motion, \"the trial judge's function is not to make an independent and de novo penalty determination, but rather to independently reweigh the evidence of aggravating and mitigating circumstances and then to determine whether, in the judge's independent judgment, the weight of the evidence supports the jury verdict.\" (People v. Lang, supra, 49 Cal. 3d at p. 1045 [italics in original].) The trial court in this case understood its function precisely, and stated detailed reasons on the record for denying the motion. Defendant contends the court erred in several respects.\n\nHe first contends the court erroneously considered the absence of mitigating factors as an aggravating factor. Although the absence of a mitigating factor is not itself an aggravating factor, the court may properly consider in aggravation the \"objective circumstances of the killing.\" (People v. Coleman, supra, 48 Cal. 3d at p. 159.) In context, we view the statements complained of as proper comment on the circumstances of the crime, including the absence of any provocation, duress, or other extenuating facts. (People v. Karis (1988) 46 Cal. 3d 612, 652 [250 Cal. Rptr. 659, 758 P.2d 1189].)\n\nEven if the court considered the mere absence of mitigating factors to be aggravating, the error was not prejudicial. The court found the \"circumstances of the crimes alone and the nature of the wounds are so aggravating that . . . the death penalty is mandated.\" The record certainly supports the finding. The court also found that \"to do anything other than to deny this motion . . . would be an arbitrary and a capricious act. . . .\" Reviewing the court's full statement, we are satisfied that any misunderstanding \"had no impact on the court's decision to deny the motion.\" (People v. Karis, supra, 46 Cal. 3d at p. 652.)\n\nDefendant next contends no evidence supports the court's statement that he \"went about his terrible business in a silent, cool, calculated and deadly manner.\" On the contrary, evidence that defendant transported the murder weapons from the Lease house to the Ryen house; the statements of Josh Ryen, the surviving victim; the evidence defendant treated himself to a beer after the killings; and the physical evidence amply support the court's finding.\n\nDefendant next contends the court and parties erroneously believed the court should not consider new evidence at the hearing on the modification motion. He ignores the context in which the issue arose.\n\nRelatives of the victims were present in court when the modification motion was heard, and desired to speak to the court. When the defense objected, the court agreed to not listen to these relatives until after its ruling on the modification motion. The court was correct. (People v. Frank (1990) 51 Cal. 3d 718, 742 [274 Cal. Rptr. 372, 798 P.2d 1215]; People v. Jennings, supra, 46 Cal. 3d at p. 994.) In ruling on the motion to modify, the court considers only evidence presented to the jury, not additional evidence presented by either party. (People v. Marshall, supra, 50 Cal. 3d at p. 942.)\n\nDefendant finally contends the court at least should have considered other, unspecified, evidence in deciding whether to strike the special circumstance finding. He relies on our holding in People v. Williams (1981) 30 Cal. 3d 470, 490 [179 Cal. Rptr. 443, 637 P.2d 1029], that the court had authority under section 1385 to dismiss a special circumstance finding \"in order to modify a sentence of life imprisonment without the possibility of parole.\" We question whether a court has the power to dismiss a special circumstance after the jury has returned a verdict of death. We expressly reserved the question in Williams, supra, at page 490, footnote 11. It is at least arguable that section 190.4 subdivision (e), provides the sole remedy after a death verdict.\n\nWe need not resolve the question, however, for the trial court believed it had such authority, but refused to exercise it. It is inconceivable that, having refused to modify the death verdict, the court would have turned around and dismissed the special circumstance finding altogether. The only special circumstance in this case was multiple murder, a particularly objective matter. No one ever questioned that there were four bodies in the Ryen house. To strike the finding of multiple murder would have been capricious in the extreme. There was no error.\n\n9. Constitutionality of the 1978 Death Penalty Law\n\nFinally, defendant reiterates various challenges to the constitutionality of the 1978 death penalty law. We have repeatedly rejected such challenges, and we continue to do so. (E.g., People v. Douglas, supra, 50 Cal. 3d at p. 541; People v. Rodriguez, supra, 42 Cal. 3d at pp. 777-779; see also Boyde v. California, supra, 494 U.S. 370 [108 L.Ed.2d 316].)\n\nIII. Conclusion\n\nThe judgment is affirmed in its entirety.\n\nDisposition\n\nThe judgment is affirmed in its entirety.\n\nBROUSSARD, J.\n\nI respectfully dissent.\n\nIt is settled under California law that, in view of the fundamental importance of proper jury instructions to a criminal defendant's right to a fair trial, a trial court in a criminal proceeding has the responsibility to instruct the jury on the general principles of law relevant to the case, including the giving of instructions on lesser included offenses. (See, e.g., People v. Sedeno (1974) 10 Cal. 3d 703, 715-716 [112 Cal. Rptr. 1, 518 P.2d 913].) Although the trial court in this case did not instruct the jury on the elements of the lesser included offense of second degree murder, the majority conclude that because the court omitted the instruction at the request of defendant's trial counsel, defendant is barred from objecting to the absence of such an instruction under the \"invited error\" doctrine.\n\nPast California decisions uniformly establish, however, that the invited error doctrine does not apply when defense counsel has \"invited\" the error as a result of his or her ignorance or mistaken view of the law (see, e.g., People v. Graham (1969) 71 Cal. 2d 303, 319 [78 Cal. Rptr. 217, 455 P.2d 153]), and defendant contends that the record in this case demonstrates that his trial counsel's actions were the product of just such ignorance or mistake of law. The majority reject the contention on the grounds (1) that the record is ambiguous on whether defense counsel acted under a mistaken view of the applicable principles of law (see maj. opn., ante, pp. 828-830), and (2) that, in any event, because the record indicates \"that counsel made a conscious, deliberate tactical choice between having the instruction and not having it,\" the invited error doctrine would apply even if the record unambiguously demonstrated that counsel's tactical decision was based on his ignorance or mistaken view of the law (see maj. opn., ante, p. 831).\n\nAs I explain, the majority's conclusion is untenable on either ground. First, the record in this case clearly demonstrates that defense counsel's tactical decision to request the omission of a second degree murder instruction was based, at least in substantial part, on a mistaken view of the terms of the applicable death penalty law; to my mind, the majority's contrary reading of the record strains credulity beyond the breaking point. Second, the majority purport to be following past decisions in concluding that the invited error doctrine applies whenever defense counsel acts for a tactical purpose even if the record explicitly discloses that counsel's tactical decision was based on a misunderstanding of a fundamental principle of law. A careful review of the governing decisions, however, establishes that in reality the opinion's conclusion in this regard flies in the face of the settled case law. The opinion provides no principled basis for departure from this controlling precedent.\n\nI\n\nBefore addressing the two specific points on which the majority opinion relies, it may be helpful to place the issue in perspective by reviewing the basic rationale that underlies the general rule that in a criminal case the trial court has the independent responsibility to instruct the jury on the general principles of law relevant to the issues raised by the evidence, including instructions on lesser included offenses.\n\nIn People v. St. Martin (1970) 1 Cal. 3d 524, 533 [83 Cal. Rptr. 166, 463 P.2d 390], this court explained that while, as a matter of litigation strategy, both the prosecution and the defense might conclude in a particular case that it is in their respective interests to present the jury with the all-or-nothing choice of either convicting defendant of a greater charged offense or of acquitting him altogether, the state has an overriding interest in assuring that the defendant is convicted of the appropriate offense. To serve that end, it is essential that the jury be properly instructed not only on the greater offense but also on all lesser included offenses that the evidence could properly support. As the St. Martin court observed: \"The state has no interest in a defendant obtaining an acquittal where he is innocent of the primary offense charged but guilty of a necessarily included offense. Nor has the state any legitimate interest in obtaining a conviction of the offense charged where the jury entertains a reasonable doubt of guilt of the charged offense but returns a verdict of guilty of that offense solely because the jury is unwilling to acquit where it is satisfied that the defendant has been guilty of wrongful conduct constituting a necessarily included offense. Likewise, a defendant has no legitimate interest in compelling the jury to adopt an all or nothing approach to the issue of guilt. Our courts are not gambling halls but forums for the discovery of truth.\" (St. Martin, supra, 1 Cal. 3d 524, 533, italics added.) For this reason, it is well established that a trial court's \"obligation to instruct on lesser included offenses exists even when as a matter of trial tactics a defendant not only fails to request the instruction but expressly objects to its being given.\" (People v. Sedeno, supra, 10 Cal. 3d 703, 716.)\n\nAlthough a trial court's duty properly to instruct the jury on lesser included offenses thus continues to operate regardless of defense counsel's desires or requests, the cases have recognized that in some limited circumstances, a defendant may be precluded from objecting on appeal to an instructional error of the trial court that has been \"invited\" by the defendant's trial counsel. In People v. Graham, supra, 71 Cal. 2d 303 -- which, as the majority opinion recognizes, has generally been viewed as the \"seminal case concerning invited error\" (see maj. opn., ante, p. 830 [quoting People v. Wickersham (1982) 32 Cal. 3d 307, 330 (185 Cal. Rptr. 436, 650 P.2d\n\n311)]) -- our court explained, however, why the invited error doctrine is not properly invoked when the error, though \"invited\" by defense counsel, results from defense counsel's \"neglect or mistake.\"\n\nAs the Graham court observed: \"Witkin has stated that, when the trial court has the duty to instruct, sua sponte, on the rules of law necessarily involved in a case, erroneous instructions are reviewable 'though invited by the defendant's own neglect or mistake.' [Citation.] As the court forcefully stated in People v. Keelin (1955) 136 Cal. App. 2d 860, 874 [289 P.2d 520, 56 A.L.R.2d 355]: 'Nevertheless, error is nonetheless error and is no less operative on deliberations of the jury because the erroneous instruction may have been requested by counsel for the defense. After all, it is the life and liberty of the defendant in a case such as this that is at hazard in the trial and there is a continuing duty upon the part of the trial court to see to it that the jury are properly instructed upon all matters pertinent to their decision of the cause.' Accordingly, if defense counsel suggests or accedes to the erroneous instruction because of neglect or mistake we do not find 'invited error'; only if counsel expresses a deliberate tactical purpose in suggesting, resisting or acceding to an instruction do we deem it to nullify the trial court's obligation to instruct in the cause.\" (Graham, supra, 71 Cal. 2d at p. 319, italics added.)\n\nSubsequent cases have uniformly confirmed that the invited error doctrine may properly be invoked to bar a defendant from challenging an instructional error on appeal only when it is clear \"that counsel acted for tactical reasons and not out of ignorance or mistake.\" (People v. Wickersham (1982) 32 Cal. 3d 307, 330 [289 P.2d 520, 56 A.L.R.2d 355]; see, e.g., People v. Bunyard (1988) 45 Cal. 3d 1189, 1234 [185 Cal. Rptr. 436, 650 P.2d 311].)\n\nAs noted, the majority, in rejecting defendant's claim that the invited error doctrine cannot properly be invoked here, rely on two grounds: (1) that the record is ambiguous on whether defendant's trial counsel was in fact operating under a mistaken view of the law when he invited the error in question, and (2) that, in any event, because the record indicates that defense counsel's decision to forego the instruction was a tactical decision, the invited error doctrine would apply even if the record unambiguously demonstrated that counsel's tactical decision was based on his ignorance or mistaken view of the law. In my view, neither of the majority's conclusions can withstand analysis.\n\nII\n\nI turn first to the question whether the record demonstrates that defense counsel was operating under a mistaken view of the law in requesting the trial court not to instruct the jury on second degree murder.\n\nAs the majority opinion indicates, the record discloses that at trial defense counsel explicitly requested the trial court not to instruct the jury on second degree murder and explained that there was a tactical reason for his request. Defendant maintains, however, that the record also shows that defense counsel's tactical request was based, at least in substantial part, on counsel's mistaken understanding of the terms of the applicable death penalty law. As all the parties now recognize, the relevant special-circumstance provision -- Penal Code, section 190.2, subdivision (a)(3) -- requires a defendant to be convicted of at least one count of first degree murder, as well as one or more additional counts of first or second degree murder, before the special circumstance may be found true. Defendant contends that the record shows that when his trial counsel requested the court not to give a second degree murder instruction defense counsel was under the misimpression that two second degree murder convictions alone would render defendant eligible for the death penalty. Indeed, defendant maintains that the record shows that not only defense counsel, but the prosecutor as well, was laboring under the same misunderstanding of the applicable special-circumstance provision.\n\nIn my view, a fair reading of the record unquestionably confirms defendant's position. As the majority opinion recognizes, the question of the proper interpretation of the pertinent special-circumstance provision first came up at trial in a discussion between the court and counsel that took place during jury voir dire. Prior to that discussion, the trial court, in remarks to a number of potential jurors, had indicated in passing that at least two first degree murders had to be found in order for the case to go to a penalty phase. Thereafter, outside the presence of the potential jurors, defense counsel undertook to correct the judge with respect to the application of the special circumstance provision. The following colloquy ensued:\n\n\"[Defense counsel]: One point that is not very important, but I -- just pedanticism drives me to bring it up. It is not required, at least according to the Attorney General's interpretation of the statute, that somebody be convicted of first degree murder in order to receive the death penalty under special circumstances.\n\n\"[The Court]: I stand corrected.\n\n\"[Defense counsel]: That is disputed but the Attorney General claims that --\n\n\"[The Court]: Doesn't apply to this case.\n\n\"[Defense counsel]: -- two second degree murders does it.\n\n\"[Prosecutor]: I can tell the court that if Mr. Cooper is convicted, at least of the two counts of second degree murder, our position is going to be that we have a penalty phase.\n\n\"[The Court]: Oh, I have read about something.\n\n\"[Prosecutor]: That is the way the code reads, I believe.\n\n\"[Defense counsel]: The code is a tad ambiguous, but that's certainly the way the Attorney General interprets it.\n\n\"[Defense counsel]: I don't think it is of great moment.\n\n\"[The Court]: It doesn't appear to be in this case.\n\n\"[Defense counsel]: But pedanticisum [ sic ] --\n\n\"[The Court]: I appreciate it. Let's take the recess.\" (Italics added.)\n\nAs this passage makes clear, the prosecutor unquestionably was of the view that two second degree murder convictions alone would subject the defendant to the penalty phase, and defense counsel, while suggesting that there was some dispute over the matter, indicated that he understood that this was the Attorney General's interpretation of the applicable provision. The trial court did not express any disagreement with that interpretation.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe issue came up again during a discussion between the court, counsel and defendant with regard to defense counsel's request that the court not instruct the jury on second degree murder. After the trial court had\n\nexpressed the opinion that it \"would feel duty bound to give [a second degree murder instruction] because it is always considered to be such an integral part of murder one\" and the prosecutor had requested a personal waiver from the defendant if the trial court was not going to give the instruction, the record reflects that the following colloquy occurred as defense counsel elicited the requested waiver from defendant:\n\n\"[Defense counsel]: We have discussed between ourselves that the only role that I could see a second degree verdict playing in this particular case is to give a jury a compromise verdict. [para.] I also informed you that as far as the eligibility for the penalty phase in this particular case is concerned, according to the present law as it is interpreted by -- at least by most of the courts, it says in the statute that a verdict of second degree is the same as a first degree if you find two second degrees, then we're into the penalty phase. In order not to encourage a compromise verdict, I believe that it is in your best interest to only give the jury two choices: First degree or nothing. Do you agree to do that?\n\n\"[Defendant]: Yes.\n\n\"[The Court]: Do you join in the waiver?\n\n\"[Defense counsel]: I certainly do.\n\n\"[The Court]: All right, I accept it.\" (Italics added.)\n\nThe majority opinion asserts that while these two passages suggest that defense counsel may have been laboring under a misunderstanding of the law, \"the record is not conclusive.\" (See maj. opn., ante, p. 829.) In my view, the record, viewed as a whole, is neither ambiguous nor inconclusive. An objective and commonsense reading of defense counsel's remarks summarizing the advice he had given defendant regarding the second degree murder instruction clearly indicates that defense counsel's tactical decision to forego a second degree murder instruction was based on his mistaken view that under the applicable special-circumstance provision \"a verdict of second degree is the same as first degree,\" and that if the jury \"find[s] two second degrees, then we're into the penalty phase.\" Although the majority opinion points to the fact that defense counsel was very experienced in death penalty trials, the prosecutor was also experienced and yet the colloquy during voir dire makes it absolutely clear that the prosecutor was operating under the same misunderstanding of the relevant special circumstance as defense counsel. Plainly stated, on this record it simply blinks reality for the majority to maintain that the record does not clearly establish that defense counsel misunderstood the applicable legal principles.\n\nParticularly when a life hangs in the balance, it is distressing to find the majority opinion adopting such a strained reading of the record.\n\nIII\n\nAfter suggesting that the record is inconclusive on whether defense counsel's tactical decision to forego a second degree murder instruction rested on a misunderstanding of law, the majority go on to conclude that the resolution of that question is, in any event, not determinative of the invited error issue, because so long as the record shows \"that counsel made a conscious, deliberate tactical choice between having the instruction and not having it\" (see maj. opn., ante, p. 831), as counsel did here, the invited error doctrine applies even if the record also shows that counsel's tactical choice was based on counsel's ignorance or mistake of law. In reaching this conclusion, the majority opinion purports to be faithfully applying this court's past invited error precedents. In my view, a review of the decisions refutes the opinion's claim.\n\nAs discussed above, in People v. Graham, supra, 71 Cal. 2d 303 -- the seminal invited error decision -- the court summarized its conclusion in the following terms: \"Accordingly, if defense counsel suggests or accedes to the erroneous instruction because of neglect or mistake we do not find 'invited error'; only if counsel expresses a deliberate tactical purpose in suggesting, resisting or acceding to an instruction do we deem it to nullify the trial court's obligation to instruct in the cause.\" (Id. at p. 319.) As this passage reveals, the Graham decision, in indicating that the invited error doctrine applies when defense counsel \"expresses a deliberate tactical purpose in suggesting, resisting or acceding to an instruction,\" explicitly contrasted the \"tactical purpose\" scenario to one in which counsel invites the instructional error \"because of neglect or mistake . . . .\" Although the Graham decision may not have explicitly so stated, it is clear from the Graham court's reasoning that when the court referred to a situation in which counsel acts for a \"deliberate tactical purpose,\" it had in mind a tactical decision that, at least on its face, rests on an accurate, informed understanding of the law, and not a tactical decision that the record explicitly reveals is founded on a mistaken view of the law. Under the Graham court's reasoning, when the record before the trial court clearly demonstrates that counsel's action, though tactical, rests on counsel's ignorance or mistake of law, the error has been invited \"because of neglect or mistake\" and would not properly constitute invited error.\n\nWhile this understanding of the Graham decision may have only been implicit in the Graham opinion itself, subsequent decisions of our court have made the point quite explicit. In People v. Avalos (1984) 37 Cal. 3d 216, 228-229\n\n[207 Cal. Rptr. 549, 689 P.2d 121], for example, after finding that the invited error doctrine was applicable in that case because defense counsel had a deliberate tactical purpose for agreeing to a particular instruction, we went on to state that \" [o]f course, if counsel had done all of these acts in ignorance of the law, there would not be invited error here.\" (37 Cal. 3d at p. 229, fn. 6, italics added.) Thus, Avalos clearly indicates the court's understanding that a deliberate, tactical decision which the record reveals was based on defense counsel's ignorance or mistake of law would not bring the invited error doctrine into play.\n\nOur decision in People v. Bunyard, supra, 45 Cal. 3d 1189, reiterates this understanding. In Bunyard, the defendant, who had been convicted of the first degree murder of a pregnant woman and her fetus, contended on appeal that the trial court had erred in failing to give a second degree murder instruction with regard to the killing of the fetus. In response to the Attorney General's assertion that the claim was barred by the invited error doctrine, defendant argued that the record did not disclose whether his trial counsel's request \" was tactically based on an accurate understanding of applicable law, or on the ignorant or mistaken impression that no instruction on second degree murder on an implied-malice theory as to the fetus was appropriate under the facts adduced at trial.\" (Id. at pp. 1234-1235, italics added.) Defendant argued that it was reasonable to conclude that \"the defense's request that the jury not be instructed on second degree murder with respect to the fetus was based not on informed tactical considerations, but on ignorance and the mistaken view that no theory of second degree murder was factually applicable to the death of the fetus,\" and contended that under such circumstances the invited error doctrine should not be applied. (Id. at p. 1235, italics added.)\n\nAlthough the Bunyard court rejected the defendant's argument, our decision in Bunyard did not suggest that a defense counsel's tactical decision to forego an instruction would constitute invited error even if the record clearly revealed that the decision was based on counsel's ignorance or mistaken view of the law. Instead, we concluded that, contrary to the defendant's factual assertion, the trial record in that case actually reflected a \" well-reasoned, deliberate and informed tactical strategy selected by defense counsel\" (Bunyard, supra, 45 Cal. 3d 1189, 1235, italics added) and, for that reason, the invited error doctrine did apply. In relying on the fact that the record revealed a \"well-reasoned, . . . informed tactical strategy,\" Bunyard, like Avalos, confirms the heretofore settled understanding that the invited error doctrine does not apply if the record establishes that an\n\ninstructional error has been invited because of defense counsel's mistake or neglect.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe majority opinion turns its back on all of these precedents in holding \"that the record must show only that counsel made a conscious, deliberate tactical choice between having the instruction and not having it\" (see maj. opn., ante, p. 831), even if the record also reveals that the \"conscious, deliberate tactical choice\" was based on counsel's misunderstanding of the law.\n\nFurthermore, in addition to flying in the face of stare decisis, the opinion provides no principled explanation for the distinction that it suggests should be drawn between the different effects of defense counsel's ignorance or mistake of law. The opinion reaffirms the principle that \"[i]f counsel was ignorant of the choice [between having the instruction and not having it], or mistakenly believed the court was not giving it to him, invited error will not be found\" (see maj. opn., ante, p. 831), but holds that invited error will be found when counsel's ignorance or mistake affects his or her tactical decisions on behalf of the defendant. As the Graham decision teaches, the reason that the invited error doctrine has not been applied to situations in which defense counsel has acted out of ignorance or mistake is because of the crucial importance of proper jury instructions to a fair trial and because \"'[a]fter all, it is the life and liberty of the defendant [rather than defense counsel] . . . that is at hazard.'\" (People v. Graham, supra, 71 Cal. 2d at p. 319.) The detrimental effect on the defendant is as great when, as here, the jury is deprived of a proper instruction because counsel's ignorance of the law leads him or her to make a misinformed tactical decision, as when the jury is denied the instruction because of counsel's ignorance of the potential availability of the instruction. In either case, as a result of counsel's misunderstanding of the applicable legal principles, the defendant is denied a trial by a properly instructed jury.\n\nAs we have seen, because of the overriding importance of having the jury correctly instructed on the controlling principles of law, California law places an independent responsibility on the trial court to instruct the jury correctly even in the absence of a request for a proper instruction by defense counsel or an objection to an incorrect instruction proposed by the prosecution\n\nor the court. In other areas of trial practice -- for example, the failure to object to inadmissible evidence -- when a trial court sees that defense counsel has made a tactical decision based on an incorrect understanding of the law, the law does not require the court to intervene to correct counsel's mistake. But the giving of jury instructions is different; when a defense counsel's comments on the record demonstrate that the tactical decision to object to a proper instruction is based on counsel's misunderstanding of the law, the law requires the trial court to step in, so that the jury is not incorrectly instructed on the fundamental principles of law applicable in the case because of defense counsel's mistake of law. The existing invited error doctrine recognizes the importance of the court's intervention in such a setting, and I see no justification for repudiating this well-established rule.\n\nAccordingly, I dissent from the majority opinion's invocation of the invited error doctrine.\n\nIV\n\nThere is one other aspect of the majority opinion that is sufficiently troubling to be worthy of mention. In my view the opinion is in error in disapproving a line of California decisions, beginning with People v. Kitt (1978) 83 Cal. App. 3d 834, 848-850 [148 Cal. Rptr. 447], which holds that the traditional \"presumption of prejudice\" analysis applies to cases in which the jury is inadvertently or unintentionally exposed to material that has not been introduced into evidence, as well as to cases in which a juror intentionally engages in misconduct. (See maj. opn., ante, at pp. 835-836.) The majority suggest that the \"presumption of prejudice\" analysis may properly be applied only to cases involving \"true jury misconduct\" and not to cases in which a jury has been inadvertently exposed to such material without any misconduct on a juror's part.\n\nI find the majority's discussion of this point troubling for a number of reasons. To begin with, there is no reason for the majority to reach out and \"take on\" the Kitt, supra, 83 Cal. App. 3d 834, line of decisions in this case, for here there clearly was \"true jury misconduct\" as the majority opinion uses that term. As the majority's own discussion of the relevant facts demonstrates (see maj. opn., ante, pp. 833-834), the key fact that triggered the incident in question in this case was the statement during jury deliberations by one of the jurors -- Juror LaPage -- that she \" knew personally that there was supposed to have been a mental problem with Mr. Cooper\" (italics added), and not the rather innocuous reference in an exhibit indicating that defendant may have suffered \"headaches and hallucinations\" sometime in the past. Indeed, with regard to LaPage's conduct, one of the other jurors indicated, in response to the judge's questioning, that she thought LaPage\n\nhad said that defendant was a \"former mental patient\" and that she may possibly have used the word \"escaped.\" It was these statements by Juror LaPage -- introducing facts of which she allegedly had personal knowledge but that had not been admitted into evidence -- that precipitated the jury's inquiry to the judge and that posed the most significant threat of potential prejudice to defendant.\n\nThe majority themselves appear to recognize that the statements by Juror LaPage during jury deliberations about facts outside the record of which she assertedly had personal knowledge constituted \"true juror misconduct\" which must properly be judged under the \"presumption of prejudice\" standard. (See maj. opn., ante, p. 838.) The majority go on to find that the presumption was clearly rebutted in this case, since the matter was brought to the court's attention during the deliberations and the court carefully admonished the jury to consider only evidence that had been admitted in court.\n\nI agree with the majority's conclusion that the presumption of prejudice was rebutted here. In light of that conclusion, however, there appears to be no reason for the majority to undertake a separate, and much more extensive, analysis with regard to the jury's consideration of the inadvertantly admitted exhibit which contained a brief reference to \"headaches and hallucinations\" experienced by defendant some years earlier. If the trial court's comments and admonitions were sufficient to eliminate any potential prejudice from Juror LaPage's statements, those comments and admonitions were clearly also sufficient to eliminate any potential problem that the inadvertantly admitted exhibit might have posed. Under these circumstances, there simply is no reason for the majority to reach out to disapprove the line of Court of Appeal decisions emanating from the Kitt decision, supra, 83 Cal. App. 3d 834.\n\nFurthermore, on the merits, I believe the majority are in error in suggesting that the \"presumption of prejudice\" standard applies only to cases involving \"true jury misconduct.\" Although there may be no \" juror misconduct\" when, as in the Kitt case, supra, 83 Cal. App. 3d 834, a juror is inadvertently exposed to material that has not been admitted into evidence at trial, numerous cases have nonetheless applied the traditional \"presumption of prejudice\" analysis in such a setting, recognizing that a defendant can be as prejudiced by a juror's unintentional exposure to such material as by the intentional seeking out of such material by a juror. As the United States Supreme Court explained in Remmer v. United States (1954) 347 U.S. 227, 229 [98 L.Ed.2d 654, 656, 74 S.Ct. 450], a case in which the juror had committed no misconduct but had immediately reported a contact made by a third person: \"In a criminal case, any private communication, contact, or\n\ntampering, directly or indirectly, with a juror during a trial about the matter pending before the jury is, for obvious reasons, deemed presumptively prejudicial . . . . The presumption is not conclusive, but the burden rests heavily upon the Government to establish . . . that such contact with the juror was harmless to the defendant.\" (See generally 3 Wright \u0026 Miller, Federal Practice and Procedure (1982) § 554, pp. 248-264 and cases cited.)\n\nIndeed, in proposing to reject this well-established rule, the majority opinion appears inconsistent with two very recent decisions of this court -- People v. Holloway (1990) 50 Cal. 3d 1098, 1109-1110 [269 Cal. Rptr. 530, 790 P.2d 1327], and People v. Marshall (1990) 50 Cal. 3d 907, 950-951 [269 Cal. Rptr. 269, 790 P.2d 676] -- in which we explicitly adopted the \"presumption of prejudice\" standard set forth in the American Bar Association Standards for Criminal Justice. Standard 8-3.7 of those standards explicitly provides: \"On motion of the defendant, a verdict of guilty in any criminal case shall be set aside and a new trial granted whenever, on the basis of competent evidence, the court finds a substantial likelihood that the vote of one or more jurors was influenced by exposure to prejudicial matter relating to the defendant or to the case itself that was not part of the trial record on which the case was submitted to the jury.\" (2 ABA Standards for Criminal Justice, std. 8-3.7 (2d ed. 1980) p. 8.57, italics added.) Nothing in the standard suggests that it only applies when a juror has intentionally and improperly gained access to such material; the standard recognizes that a defendant may be equally prejudiced by \"unintentional\" exposure to such materials.\n\nAlthough the majority do not specifically discuss the numerous cases which have applied the \"presumption of prejudice\" standard to situations in which no juror has been guilty of \"true misconduct,\" the majority appear to suggest that a distinction should be drawn between \" outside influences on the jury through no fault of its own\" (see maj. opn., ante, p. 836, fn. 12, majority's italics) and improper influences from sources that are \"internal\" to the judicial process. But the appropriate distinction is not between the \"outside\" or \"internal\" source of the \"influence,\" but rather, as standard 8-3.7 of the American Bar Association Standards for Criminal Justice indicates, whether the matter to which the jury has been exposed has been or has not been admitted into evidence at the trial. Although the majority assert that \"[w]hen . . . a jury innocently considers evidence it was inadvertently given . . . [t]he situation is the same as any in which the court erroneously admits evidence\" (see maj. opn., ante, p. 836), that simply is not so with regard to material that has not been admitted into evidence at the trial. When evidence is admitted at trial, the opposing party and counsel will be aware that the jury may consider the evidence and will have the opportunity to point out any deficiencies in the evidence or to introduce other evidence to rebut the admitted evidence; even if an appellate court\n\nlater determines that the trial court erred in admitting the evidence, the opposing party will at least have had the opportunity to attempt to rebut the evidence at trial. When, however, as in Kitt, supra, 83 Cal. App. 3d 834, and in most of the cases which have followed Kitt (see, e.g., People v. Hogan (1982) 31 Cal. 3d 815, 846 [183 Cal. Rptr. 817, 647 P.2d 93]; People v. Boyd (1979) 95 Cal. App. 3d 577, 584-586 [157 Cal. Rptr. 293]), the jury is inadvertently given material that has not been admitted into evidence, all of the procedural checks of the trial process are absent. In that context, it is appropriate to apply the \"presumption of prejudice\" standard even though no juror may have been guilty of \"true misconduct.\" Thus, I think the majority is in error in broadly disapproving the Kitt decision and all of its progeny.\n\nFinally, there is an additional reason why the majority's disapproval of the entire Kitt, supra, 83 Cal. App. 3d 834, line of cases is gratuitous and inappropriate. Unlike Kitt and most of the cases which have followed Kitt, in the present case the exhibit containing the reference to defendant's \"headaches and hallucinations\" had in fact been admitted into evidence at the trial, albeit inadvertently. Although one prior Court of Appeal decision has extended Kitt's analysis to such a situation (see People v. Hill (1980) 110 Cal. App. 3d 937, 942 [168 Cal. Rptr. 272]), I agree with the majority's conclusion that, in such a setting, the presumption of prejudice should not apply. This is so, however, not because there has been no \"true juror misconduct,\" but simply because inasmuch as the evidence was admitted at trial, albeit inadvertently, defendant and his counsel at least had the opportunity to respond to the evidence.\n\nIn sum, since it is clear that the trial court's timely admonition to the jury obviated any possible prejudice from the entire incident, it is difficult to understand why the majority has chosen to go out of its way to disapprove a well-established line of cases.\n\n\u003cspan class=\"fn\"\u003e1. All further statutory references are to the Penal Code unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. All further dates refer to the year 1983 unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. For a more detailed discussion of electrophoresis, see People v. Reilly (1987) 196 Cal. App. 3d 1127, 1136-1138 [242 Cal. Rptr. 496].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. By the time of trial, San Diego County was running neck and neck with the number two county in population, Orange County, and has since passed it. (State of Cal. Statistical Abstract (1987) p. 15.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Because of this conclusion, we need not consider the Attorney General's argument that we should modify the Kelly/Frye rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Evidence Code section 352 states: \"The court in its discretion may exclude evidence if its probative value is substantially outweighed by the probability that its admission will (a) necessitate undue consumption of time or (b) create substantial danger of undue prejudice, of confusing the issues, or of misleading the jury.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Article I, section 2, subdivision (b), states in pertinent part: \"A publisher, editor, reporter, or other person connected with or employed upon a newspaper, magazine, or other periodical publication, or by a press association or wire service, or any person who has been so connected or employed, shall not be adjudged in contempt by a judicial, legislative, or administrative body, or any other body having the power to issue subpoenas, for refusing to disclose the source of any information procured while so connected or employed for publication in a newspaper, magazine or other periodical publication, or for refusing to disclose any unpublished information obtained or prepared in gathering, receiving or processing of information for communication to the public. \". . . \"As used in this subdivision, 'unpublished information' includes information not disseminated to the public by the person from whom disclosure is sought, whether or not related information has been disseminated and includes, but is not limited to, all notes, outtakes, photographs, tapes or other data of whatever sort not itself disseminated to the public through a medium of communication, whether or not published information based upon or related to such material has been disseminated.\" Evidence Code section 1070 contains substantially similar language. (See Delaney v. Superior Court (1990) 50 Cal. 3d 785, 796 [268 Cal. Rptr. 753, 789 P.2d 934].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Defendant also claims the court rejected the district attorney's argument regarding the relative size of the victims. After the district attorney stated his third argument, the court said that \"that point\" was not very persuasive. Use of the singular word \"point\" indicates the court found the third argument unpersuasive, not all three.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Defendant also claims the court encouraged misconduct. Nothing in the record supports the claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Gregonis originally erred in determining defendant's EAP type. During the retesting, Gregonis, unlike Dr. Blake, was unaware of this error, and thus unaware of the value of a second EAP testing of the drop of blood.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In a later hearing in chambers, defendant argued generally that some questions were beyond the scope of direct examination, but he never objected to these specific questions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. This case does not involve improper outside influences on the jury through no fault of its own. We therefore do not decide whether there is a presumption of prejudice in that situation. (Cf. Remmer v. United States (1954) 347 U.S. 227 [98 L.Ed. 654, 656, 74 S.Ct. 450].) The dissent suggests this holding is inconsistent with People v. Holloway, supra, 50 Cal. 3d at pages 1109-1110, and People v. Marshall (1990) 50 Cal. 3d 907, 950-951 [269 Cal. Rptr. 269, 790 P.2d 676], which cite the American Bar Association Standards for Criminal Justice. (Dis. opn., post, at p. 861.) The standard discussed in this dissent and those cases, however, does not state that there is a presumption of prejudice, and we did not cite it for that proposition. (2 ABA Standards for Criminal Justice, std. 8-3.7 (2d ed. 1980) p. 8.57.) For example, in People v. Marshall, supra, 50 Cal. 3d at page 949, we state that \"prejudice is presumed\" if the defendant has shown \"misconduct on the part of a juror.\" Only thereafter, in discussing what standard to apply in determining whether the presumption has been rebutted, do we cite the American Bar Association standard. (Id. at pp. 950-951; see also People v. Holloway, supra, 50 Cal. 3d at p. 1109.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. In light of this holding, we need not consider whether a residential burglary inherently involves an \"implied threat to use force or violence.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The jury must be allowed to consider \"any relevant mitigating evidence,\" including any aspect of a defendant's character or record and any of the circumstances of the offense that the defendant proffers as a basis for a sentence less than death. (Skipper v. South Carolina (1986) 476 U.S. 1, 4 [90 L.Ed.2d 1, 7, 106 S.Ct. 1669]; Eddings v. Oklahoma (1982) 455 U.S. 104, 110, 114 [71 L.Ed.2d 1, 8, 11, 102 S.Ct. 869]; Lockett v. Ohio (1978) 438 U.S. 586, 604 [57 L.Ed.2d 973, 989-990, 98 S.Ct. 2954] (plur. opn. by Burger, C. J.); see People v. Whitt (1990) 51 Cal. 3d 620, 647 [274 Cal. Rptr. 252, 798 P.2d 849].) We need not now decide whether evidence of the impact on the defendant's family comes within this \"broad\" range of constitutionally pertinent mitigation. (People v. Whitt, supra, 51 Cal. 3d at p. 647; cf. South Carolina v. Gathers, supra, 490 U.S. at p. 810 [104 L.Ed.2d at pp. 882-883]; Enmund v. Florida (1982) 458 U.S. 782, 801 [73 L.Ed.2d 1140, 1154, 102 S.Ct. 3368] [for purposes of imposing the death penalty, the defendant's punishment \"must be tailored to his personal responsibility and moral guilt\"; italics added]; People v. Johnson, supra, 47 Cal. 3d at p. 1249 [\"The focus in a penalty phase trial of a capital case is on the character and record of the individual offender.\"].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Because we find no error under our traditional Brown analysis, we decline the People's request that we reconsider Brown in light of two recent United States Supreme Court decisions, Blystone v. Pennsylvania (1990) 494 U.S. 299 [108 L.Ed.2d 255, 110 S.Ct. 1078] and Boyde v. California, supra, 494 U.S. 370 [108 L.Ed.2d 316]. (See People v. Gonzalez (1990) 51 Cal. 3d 1179, 1231, fn. 30 [275 Cal. Rptr. 729, 800 P.2d 1159].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Although the record does not explicitly reveal the source of the prosecutor's and defense counsel's misunderstanding, it appears likely that both counsel focused solely on the terms of Penal Code section 190.2, subdivision (a)(3), which provides, as a special circumstance, that: \"(3) The defendant has in this proceeding been convicted of more than one offense of murder in the first or second degree.\" Both counsel apparently overlooked the fact that the earlier portion of Penal Code section 190.2, subdivision (a) specifically provides: \"(a) The penalty for a defendant found guilty of murder in the first degree shall be death or confinement in state prison for a term of life without the possibility of parole in any case in which one or more of the following special circumstances has been charged and specially found under section 190.4, to be true: [para.] . . . [para.] (3) The defendant has in this proceeding been convicted of more than one offense of murder in the first or second degree.\" Read in its entirety, it is clear that the special circumstance provided by Penal Code section 190.2, subdivision (a)(3), applies only to a defendant who (1) has been found guilty of at least one count of first degree murder and (2) \"has in this proceeding been convicted of more than one offense of murder in the first or second degree.\" The majority acknowledge that this is the correct intepretation of the provision and do not suggest that there is any ambiguity in the statutory language.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. If the record does not affirmatively disclose that defense counsel has made a tactical decision on the basis of a misunderstanding of the applicable law, the trial court could properly assume that defense counsel was aware of the relevant legal principles and had made the tactical decision on the basis of a correct understanding of the law. It is only when the record explicitly demonstrates that defense counsel's tactical decision rested on a misunderstanding of the pertinent legal principles that a tactical decision cannot properly bring into play the invited error doctrine.\u003c/span\u003e\n\n",
    "body_length": 187336,
    "citedas": [
      "281 Cal. Rptr. 90",
      "809 P.2d 865",
      "53 Cal. 3d 771"
    ],
    "attorneys": "Mark E. Cutler, under appointment by the Supreme Court, for Defendant and Appellant. John K. Van de Kamp and Daniel E. Lungren, Attorneys General, Steve White, Chief Assistant Attorney General, Harley D. Mayfield, Assistant Attorney General, John W. Carney and Frederick R. Millar, Jr., Deputy Attorneys General, for Plaintiff and Respondent. Ira Reiner, District Attorney (Los Angeles), Harry B. Sondheim and Brentford J. Ferreira, Deputy District Attorneys, as Amici Curiae on behalf of Plaintiff and Respondent.",
    "category": [
      "36",
      "78"
    ],
    "judges": "Opinion by Arabian, J., with Lucas, C. J., Panelli, Kennard and Baxter, JJ., concurring. Separate dissenting opinion by Broussard, J., with Mosk, J., concurring.",
    "citation_count": 26
  }
}
