{
  "id": "iov0QGYBTlTomsSBRN0b",
  "document": {
    "title": "IN RE EQUITY FUNDING CORP. OF AMERICA SECS. LITIG.",
    "full_title": "In re EQUITY FUNDING CORPORATION OF AMERICA SECURITIES LITIGATION",
    "jurisdiction": "C.D. California",
    "date": "1976-01-23T00:00:00.000Z",
    "docket": "142",
    "body": "LUCAS, District Judge.\n\nOpinion on Motions Directed to Complaint\n\nThe occasion for this opinion is resolution of many defendants' motions directed to the sufficiency of the pleadings in this litigation. The litigation arises out of an alleged securities fraud perpetrated through Equity Funding Corporation of America (hereinafter \"EFCA\") and its subsidiaries. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" After more than eight years of public trading in EFCA securities, the S.E.C. suspended trading in the company's securities on March 27, 1973. On April 2, 1973, reports describing the alleged fraud at EFCA were published in the press, and numerous investor suits were filed throughout the country. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\" Most of the actions were transferred to the Central District of California for coordinated or consolidated pretrial proceedings before this Court, pursuant to the transfer and pretrial provisions of 28 U.S.C. § 1407. In Re Equity Funding Corporation of America Securities Litigation, 375 F. Supp. 1378 (J.P.M.L., 1974).\n\nAfter transfer of the actions, this Court held a first preliminary pretrial conference to organize the conduct of discovery and other pretrial matters. Subsequently, the Court issued its General Management Order No. 1, which established the structure of these pretrial proceedings, set up certain discovery schedules, and required the plaintiffs to file a Unified and Consolidated Complaint. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\" The Court required that this pleading be served on all the defendants or their counsel authorized to accept service.\n\nThe organized representatives of plaintiffs' counsel thereupon filed the First Amended Unified and Consolidated Complaint (hereinafter the \"Complaint\"), the pleading to which the present motions are directed. The Complaint invokes subject matter jurisdiction of this Court pursuant to § 22 of the Securities Act of 1933, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" § 27 of the Securities Exchange Act of 1934 \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\" and various other jurisdictional statutes. The Complaint also purports to state claims for relief under state and common laws, and the doctrine of pendent jurisdiction is invoked with regard to these claims. Paragraph 5 of the Complaint catalogues the federal securities laws and other theories under which claims are asserted. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\"\n\nIn paragraphs 10-48, the Complaint sets out the alleged fraudulent activities related to EFCA and the acts of each defendant for which liability is claimed. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\" The scheme described by the Complaint was carried out by certain officers and directors of EFCA, designated in the Complaint as \"primary defendants.\" The conduct of these defendants caused the records and financial statements of EFCA to show continued false and inflated rates of growth in the stated assets, incomes, and earnings of the company and its subsidiaries. This was done to influence the price of EFCA securities traded on the national securities exchanges, to induce purchase of those securities by others, and to influence stockholders in other companies acquired by EFCA to exchange their stock in those companies for EFCA securities. From 1964 through April 2, 1973, the price of EFCA securities was inflated on account of the fraudulent activities at EFCA.\n\nThe misstatements about EFCA's growth and financial condition were achieved, and EFCA's true financial condition concealed through a number of fraudulent devices. These included false entries in the books, records, and financial reports of EFCA and its subsidiaries, use of foreign corporations to create fictitious and inflated assets for EFCA, and a method by which bogus life insurance policies were created for the files of Equity Funding Life Insurance Company (hereinafter \"EFLIC\"), a subsidiary of EFCA, then reinsured by unknowing companies or carried as assets by EFLIC. Loans were made to customers of EFCA and secured by mutual funds purchased by these same customers. These \"premium funded loans\" were listed as assets by EFCA, although by 1972, the amount of fictitious loans entered in the \"premium funded loan\" account reached a rate of $2,000,000 per month. Many filings were made with public agencies, all of which included false statements or misleading omissions necessary to conceal the scheme and inflate the value of EFCA securities. Other aspects of the scheme are also alleged in the Complaint.\n\nThe fraud at EFCA was continued for eight years with the aid, complicity, and neglect of many persons or business entities outside the EFCA structure that knew or should have known about the fraud. These persons or entities are named as \"aider and abettor\" defendants in the Complaint. They include the accountants for EFCA and its subsidiaries, underwriters for EFCA debenture issues, a firm that did actuarial work for EFLIC from 1966 on, a group of defendants that sold EFCA securities between March 6, 1973 and March 27, 1973, the national stock exchanges on which EFCA securities were traded, certain national banks that extended credit to EFCA, a non-subsidiary insurance company with which EFCA and EFLIC did business, the states of Illinois and California, in which EFLIC was incorporated or did business, and a number of other defendants. According to the Complaint, there were certain \"significant transactions\" involved in the fraudulent scheme -- a 1970 merger of Liberty Savings and Loan Association (hereinafter \"Liberty\") with EFCA, EFCA's 1971 merger with Bankers National Life Insurance Company (hereinafter \"BNL\"), and a 1969 EFCA acquisition of Ankony Angus, Inc. and Ankony Hyland Angus, Inc. (hereinafter collectively \"Ankony\"). The specific allegations with respect to these transactions and the conduct of each defendant will be described more fully below.\n\nThe Complaint sets out the plaintiffs' claims in fourteen separate counts. Counts I through IV and XII are identical to the extent they purport to state claims against all the primary defendants and most of the aiders and abettors. Each of these counts incorporates the allegations described above, then states, \"[the] conduct of each defendant constitutes violations of the federal securities laws.\" Common law negligence claims against the \"aiders and abettors\" and common law fraud and breach of fiduciary duty claims against the primary defendants are asserted. Each count says the primary defendants' conduct was intended to deceive the plaintiffs and to induce plaintiffs' trust in the market place. Plaintiffs say they relied on the integrity of the market place in their purchases of EFCA securities. The first four counts and Count XII differ only with regard to whom the plaintiffs are in each count.\n\nCount I plaintiffs are described as \"all open market purchasers of EFCA securities.\" \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\" No period limitations are placed on this group except insofar as EFCA securities were traded on the open market between 1964 and 1973. No distinction is made among purchasers of different types of securities. Attached to the Complaint is a list of the named plaintiffs who purportedly fall within the open market purchaser category. Some of these plaintiffs assert claims only for themselves, others bring their claims as representatives of a class of all open-market purchasers.\n\nCount II is brought on behalf of \"all original issue purchasers of EFCA9 1/2% debentures, due 1990, with common stock purchase warrants, as offered in a prospectus dated December 6, 1970, or the warrants alone.\" As with Count I plaintiffs, the names of the individual and class representative plaintiffs that fall within this category are listed in an exhibit to the Complaint. The Complaint does not allege any particular date of purchase by any particular plaintiff, except as the date falls within the broad time period covered by the definition of \"original issue purchaser.\"\n\nCount III plaintiffs are \"original issue purchasers of EFCA5 1/2% Subordinated Debentures, Due 1991, issued December 1971.\" The name of each individual and class representative plaintiff is given, but no specific dates of purchase are alleged.\n\nCount IV plaintiffs are those who exchanged their Liberty Savings \u0026 Loan stock for EFCA common stock pursuant to a merger agreement between EFCA and Liberty, approved by Liberty stockholders on September 14, 1970. The names of these individual and class representative \"Liberty exchange of stock purchasers\" are again provided by exhibit.\n\nCount XII is brought by eight named individuals who acquired EFCA securities in June, 1969 under an agreement with EFCA and pursuant to a plan of reorganization that pertained to the Ankony companies. These plaintiff's stock in the Ankony companies was conveyed to EFCA in exchange for EFCA securities and cash, pursuant to the agreement and plan of reorganization.\n\nCount V of the Complaint is similar to Counts I through IV and XII, except another defendant, Fidelity Corporation (hereinafter \"Fidelity\" is added to the count, and it is brought only on behalf of those plaintiffs who exchanged their stock in BNL for EFCA securities, pursuant to a May 26, 1971 merger agreement, amended August 23, 1971. The merger agreement provided for the acquisition of BNL by EFCA. Again, the named representatives of the class of BNL exchange of stock purchasers are listed in an exhibit to the Complaint. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\"\n\nCount VI of the Complaint is brought on behalf of the same plaintiffs and class as Count V, the BNL exchange of stock purchasers, against four national banks not named in the first five counts or Count XII. Defendant First National City Bank of New York (hereinafter \"FNCB\") acted as agent for the other defendant banks and as lender and loan manager in connection with a loan to EFCA by the banks. This $50,000,000 loan was collateralized in part, by the BNL stock acquired by EFCA in the BNL-EFCA merger. FNCB now holds the stock and asserts a lien thereon. FNCB knew EFCA could not enter into any transactions that involved, among other things, the pledge of BNL shares as collateral for loans or the hypothecation of BNL securities, unless the New York Superintendent of Insurance was notified and did not object to the transaction. These conditions were not met prior to the loan. The claims in this count are made against the four lending banks. The claims are based on the \"federal securities laws and the insurance laws of the States of New York and New Jersey, and the due process clause of the 14th amendment of the United States Constitution.\" The plaintiffs, who are asking for, among other things, rescission of the BNL-EFCA merger, seek a declaration that the lien imposed on the BNL stock is void and of no effect on account of the alleged breaches of these laws by the defendant banks in connection with the loan transaction.\n\nCounts VII and VIII pertain to trading of EFCA securities within a relatively short period of time just preceding the suspension of trading by the S.E.C. On or about March 6 or 7, 1973, Ronald Secrist, a former officer of EFCA, EFLIC, and BNL, met with Raymond Dirks, an insurance analyst and Senior Vice-President of the Dirks Brothers Division of Delafield Childs, Inc., a member firm of the New York Stock Exchange, and told Dirks about many of the fraudulent practices at EFCA. Between March 6, 1973, and March 27, 1973, Dirks investigated and confirmed this information with other officers and directors of EFCA and EFLIC, then \"privately advised, directly or indirectly, certain selected persons, including all of the Selling Defendants, of the information he had received about the fraud involving EFCA and EFLIC.\" Among the persons so informed are the Count VII and VIII trading defendants. Between March 6 and 27, 1973, these defendants sold EFCA securities on the New York Stock Exchange or other national exchanges, for themselves or on behalf of their clients, without disclosing the information they had received from Dirks. These sellers knew disclosure of the information withheld would \"drastically adversely affect the market value of EFCA common stock and other EFCA securities.\" These defendants benefitted from their trading without disclosure, because the sales were made at a higher price than would have been possible had the material information about EFCA been disclosed to the public prior to sale. Plaintiffs would not have purchased their EFCA securities if they had known of the information available to the trading defendants. The Count VII and Count VIII claims are based on § 17(a) of the 1933 Act, § 10(b) of the 1934 Act and Rule 10b-5 thereunder. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\"\n\nCount VII differs from Count VIII only in the plaintiffs described by the count. Count VII is brought only on behalf of those who purchased their EFCA securities between March 6 and 27, 1973, and Count VIII is brought on behalf of all those who held their securities through March 27, 1973, regardless of the purchase date, or those who sold their securities between March 6 and 27, 1973, without knowledge of the fraudulent scheme. An exhibit to the Complaint lists the individual and class-representative plaintiffs for each count, but gives no information concerning the type of security purchased or date of purchase or sale.\n\nCount IX plaintiffs, described as \"all holders of 5 1/2% debentures,\" make claims in this count against the same banks named as defendants in Count VI. Count IX is based on the loan transaction set out in Count VI. The claims against FNCB are based on its dual role as indenture trustee for the EFCA5 1/2% debenture issue and as loan manager on the loan to EFCA. The other banks are named defendants as partners and joint venturers in the loan to EFCA. Count IX says these defendants \"violated the federal securities laws, including the Trust Indenture Act and the banking and securities laws of the State of New York,\" and asserts defendants' conduct constitutes a common law breach of fiduciary duty to Count IX plaintiffs. The relief sought against the banks by these plaintiffs is a declaration that the sums owed by EFCA to the banks are junior and subordinate obligations to the sums owed these plaintiffs by EFCA.\n\nCount X is brought by holders of EFCA9 1/2% debentures against Chemical Bank, the indenture trustee for that debenture issue. This claim is based on Chemical Bank's alleged breaches of the federal securities laws, including the Trust Indenture Act. This wrongful conduct includes sales of EFCA securities by Chemical Bank after it obtained confidential inside information about the EFCA fraud some time after March 6, 1973. The Complaint asserts these sales were made without disclosure of that information to the debenture holders or the investing public.\n\nCount XI was originally included in the Complaint as an interpleader count. It involved certain aborted sales of EFCA securities on March 26, 1973. Prior to submission of defendants' motions directed to the sufficiency of the Complaint, the Court dismissed this count, without prejudice, pursuant to Fed.R.Civ.Pro. 41(a)(2).\n\nCounts XIII and XIV of the Complaint are both set out as claims by single plaintiffs against certain of the defendants who traded EFCA securities in the March 6 to 27, 1973 period. These claims are based on block transactions involving EFCA securities. These sales took place in March, 1973. Count XIII's sole plaintiff, Lawton Corporation, asserts that on March 21, 1973, March 23, 1973, and March 26, 1973, it purchased substantial blocks of EFCA common stock from certain defendants or their agents. The defendant sellers of this stock had received the Dirks information about the fraud at EFCA, knew about the fraud at EFCA, and failed to disclose that information to Lawton when the March 21, 23, and 26 sales were made. Claims for damages or rescission are made by Lawton under various provisions of the federal securities laws and under theories of fraud and deceit.\n\nCount XIV's plaintiff, Salomon Brothers, a registered broker-dealer in securities, makes claims against certain of the trading defendants based on three transactions involving large blocks of EFCA bonds and common stock. Salomon claims it purchased approximately 3,000 bonds, principal amount $1,000, on March 16, 1973. This purchase was for Salomon's own account, and the Complaint says the defendant sellers of these bonds knew of and failed to disclose the EFCA fraud at the time of the sale. Salomon was contacted by other institutional investment companies on March 26, 1973, concerning the possibility of purchases by Salomon of EFCA common stock. In this transaction, Salomon acted as a middleman or principal purchaser in the transfer of hundreds of thousands of shares of EFCA common stock from the defendant sellers to either itself, other brokers, or open-market purchasers of the stock. In the third transaction described by Count XIV, Salomon acted as the selling agent for defendant Savings \u0026 Profit Sharing Pension Fund of Sears Roebuck and Co. Employees, and as purchasing agent for certain of its own customers. This was a sale of a large block of EFCA common stock by the Sears Fund on March 26, 1973. The Sears Fund and the defendants involved in the second transaction knew about the EFCA fraud and did not disclose this information at the time of the transactions described in Count XIV. Salomon asserts it had no knowledge of the fraud or the rumors about the fraud at the time the transactions for which liability is claimed took place. Salomon asks for damages, rescission, and declaratory relief based on various provisions of the federal securities laws.\n\nAs an appendix to the Complaint, the plaintiffs have provided a list of sixteen \"actions not integrated with unified and consolidated actions,\" with a brief description of the nature of those non-integrated actions. They include actions presenting individual factual or legal issues that do not fit the pattern cut by the Complaint. Since the filing of the Complaint, a number of other actions have been transferred to this Court by the Judicial Panel or filed in the Central District of California and transferred to this Court pursuant to Local Rules. This opinion is not addressed to the non-integrated or \"tag-along\" actions, except insofar as any ruling with regard to the Complaint will be followed if similar issues are raised by the \"tag-along\" or non-integrated complaints. The Court now turns to the motions directed to the sufficiency of the Complaint and other issues properly raised at this stage of the proceedings.\n\nPropriety of the First Amended Unified and Consolidated Complaint\n\nMany defendants in this litigation object to the filing of the First Amended Unified and Consolidated Complaint. Although this objection appears tied to the objections to jurisdiction, venue, and the substantive claims made, there is also offered the distinct argument that consolidation of the many actions arising out of the EFCA fraud into one amended complaint is not within the power of this Court.\n\nFed.R.Civ.Pro. 42(a) provides:\n\n\"When actions involving a common question of law or fact are pending before the court, it may order a joint hearing or trial of any or all the matters in issue in the actions; it may order all the actions consolidated; and it may make such orders concerning proceedings therein as may tend to avoid unnecessary costs or delay.\"\n\nSimilarly, 28 U.S.C. § 1407(a) provides in part:\n\n\"When civil actions involving one or more common questions of fact are pending in different districts, such actions may be transferred to any district for coordinated or consolidated pretrial proceedings. . . .\"\n\nIn accordance with these provisions, the Court ordered the filing of the First Amended Unified and Consolidated Complaint in this litigation. The actions from which the Complaint was fashioned involve common questions of law and fact concerning the nature, scope, and legal consequences of the fraud at EFCA. This core issue is central to all the proceedings before this Court in M.D.L. Docket No. 142. Consolidation of all pretrial proceedings in this litigation is, therefore, permitted by Fed.R.Civ.Pro. 42(a) in conjunction with § 1407(a).\n\nCertain defendants claim, however, that an order of consolidation cannot include an order requiring the consolidation of pleadings as accomplished by the Complaint. In support of this contention, defendants rely on Johnson v. Manhattan Railway, 289 U.S. 479, 53 S. Ct. 721, 77 L. Ed. 1331 (1933); Garber v. Randell, 477 F.2d 711 (2 Cir. 1973); MacAlister v. Guterma, 263 F.2d 65 (2 Cir. 1958); and National Nut Co. of California v. Susu Nut Co., 61 F. Supp. 86 (N.D.Ill.1945). The courts in each of these cases recognized the discretionary power of the district court to fashion consolidated pretrial procedures to further the administration of justice. Johnson v. Manhattan Railway, supra, 289 U.S. at 496, 53 S. Ct. at 727-28, 77 L. Ed. at 1344; Garber v. Randell, supra, at 714; MacAlister v. Guterma, supra, at 68-69; and National Nut v. Susu Nut, supra, at 86. In Garber, for example, the court stated:\n\n\"We have recognized that consolidation of stockholders' suits during pretrial stages pursuant to Rule 42 F.R.Civ.P. may benefit both the court and the parties by expediting pretrial proceedings, avoiding duplication and harassment of parties and witnesses, and minimizing expenditure of time and money by all persons concerned. [citing MacAlister ].\" at 714.\n\nAlthough the effect of such pretrial consolidation is not and cannot be to \"merge the suits into a single cause, or change the rights of the parties, or make those who are parties in one suit parties in another,\" Johnson v. Manhattan Railway, supra, 289 U.S. at 496-97, 53 S. Ct. at 727-28, 77 L. Ed. at 1344-45. See also, Garber v. Randell, supra, at 715; In Re Massachusetts Helicopter Airlines, Inc., 469 F.2d 439, 441-42 (1 Cir. 1972); and MacAlister v. Guterma, supra, at 69, the consolidation of pleadings for pretrial purposes is within the discretionary power of the district court, particularly in the context of complex pretrial proceedings pursuant to 28 U.S.C. § 1407(a). Katz v. Realty Equities Corporation, 521 F.2d 1354 (2 Cir. 1975).\n\nFed.R.Civ.Pro. 42(a) limits the court's power to order consolidation of pleadings to instances where such an order \"may tend to avoid unnecessary costs or delay.\" It is beyond question the consolidated complaint serves this purpose in this litigation. With regard to the present motions, for example, the court has been able to receive memoranda and hear argument directed to one coherent pleading. Likewise, argument and consideration of class action issues has been made considerably easier by the consolidated complaint, because the court has not had to go through varying and conflicting class allegations that may have been stated in each separate complaint. The burdens of discovery management are lessened by the existence of this consolidated pleading as a reference point. More mundane clerical and administrative details, matters of significant consequence in litigation of this size, have also been made much less burdensome to counsel and the court by the use of the consolidated complaint. Had the court not required the consolidation of pleadings in this litigation, the result could only have been considerable confusion and delay of all pretrial matters caused by an unmanageable hodge-podge of more than one hundred separate actions, each of which would inevitably present its own peculiar problems not related to a just resolution of merits of the claims and defenses present in this litigation. This Court is of the opinion that without resort to the device of the consolidated complaint remand of actions for trial as provided for by § 1407(a) and resolution of any of the actions for which trial will be had in this district could not take place for a number of years. Simply stated, completed pretrial of the actions included in M.D.L. Docket No. 142 would have been impractical without the consolidated complaint.\n\nThe cases also limit the power of the court to order consolidated pleadings where such consolidation causes serious prejudice to the right of a party to litigate its claims or defenses. Katz v. Realty Equities Corp., supra, at 1360-62; Garber v. Randell, supra, at 717. Defendants attacking the propriety of the Complaint in this litigation have not shown that any such prejudice has accrued by reason of the consolidation of pleadings in this litigation. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\" The filing of the Complaint in this litigation was proper and in accordance with the provisions of Fed.R.Civ.Pro. 42(a) and 28 U.S.C. § 1407. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\"\n\nThe Complaint as an Amendment\n\nBy leave of this Court, the Complaint added new claims and joined new parties to this litigation that had not previously been included in any of the underlying complaints. It also disposed of certain claims that had been made in those complaints. The Court does not find anything in the nature or timing of the amendments accomplished by the Complaint that would require this Court to rule them inappropriate under Fed.R.Civ.Pro. 15(a) and 21. The claims in both the underlying and consolidated complaints arise out of the alleged fraud at EFCA and the purchase of EFCA securities by the plaintiffs, allegedly induced by the conduct of the defendants named in the Complaint, including those defendants added to this litigation for the first time by the Complaint. Each defendant has been and will be afforded full opportunity to present its defenses in this litigation. The addition of new claims and parties affected by the Complaint is proper pursuant to Fed.R.Civ.Pro. 15(a) and 21. Foman v. Davis, 371 U.S. 178, 83 S. Ct. 227, 9 L. Ed. 2d 222 (1962); Holiday Publishing Co. v. Gregg, 330 F. Supp. 1326 (S.D.N.Y. 1971).\n\nCertain defendants argue this Court has no power to allow amendments to the transferred pleadings, because 28 U.S.C. § 1407 allows transfer only of \"pending\" actions, and defendants would read this to bar addition of claims or parties to those actions after transfer. Fed.R.Civ.Pro. 15 and 21 apply to pretrial procedure, and thus allow amendment of complaints transferred pursuant to 28 U.S.C. § 1407. Only pending actions can be transferred pursuant to § 1407, but this does not mean the transferred actions are no longer subject to the same procedures as any other action at the pretrial stages. The \"pending\" clause of § 1407 describes a limitation on the power to transfer actions under the statute. It does not affect the power of the transferee court to fashion pretrial procedures in accordance with the Federal Rules of Civil Procedure once transfer is complete.\n\nPersonal Jurisdiction\n\nCertain named partners of the accounting firm of Wolfson, Weiner, Ratoff, \u0026 Lapin object to this Court's exercise of personal jurisdiction over them in these proceedings. These defendants were not named or served in any of the actions now included in M.D.L. Docket No. 142, prior to the filing of the First Amended Unified and Consolidated Complaint. They have filed affidavits that state they reside and do business only outside the state of California, although they do not dispute the allegations in the Complaint that they were partners in Wolfson at some time during the period encompassed by the allegations against Wolfson in the Complaint. These defendants argue they are not amenable to suit in this district because they do not have the \"minimum contacts\" necessary under the Due Process Clause of the 5th Amendment.\n\nThis court finds the alleged partnership interest of these defendants in the Wolfson firm is sufficient to support jurisdiction over these defendants. This is true even under the 14th Amendment \"minimum contacts\" analysis of International Shoe v. State of Washington, 326 U.S. 310, 66 S. Ct. 154, 90 L. Ed. 95 (1945), which has been construed as a stricter test than is required under the 5th Amendment Due Process Clause, Oxford First Corp. v. PNC Liquidating Corp., 372 F. Supp. 191 (E.D.Pa.1974). The Wolfson firm plainly did a great deal of work in this district, including its audits and service for EFCA. A partnership interest in a firm that does substantial business in a particular jurisdiction over a long period of time evidences a continuing business relationship with the jurisdiction that satisfies the \"minimum contacts\" test, particularly where, as here, the claims made against the defendant arise out of the partnership's business in the forum state. These defendants' motions to dismiss for lack of personal jurisdiction are, therefore, denied.\n\nThe Boston Company, Inc. and Boston Safe Deposit \u0026 Trust Co. challenge the in personam jurisdiction on different grounds. By affidavit from executives of each company, these defendants assert they did not commit any acts that would make them liable under either the Securities Act of 1933 or the Securities Exchange Act of 1934. They also say they do not transact business in any of the jurisdictions in which they have been named or served with complaints in any of the underlying actions transferred to this court and are not inhabitants of or \"found\" in such districts. Thus, these defendants argue, personal jurisdiction does not lie in this court or in any of the transferor districts in which actions were originally brought against them. If the factual assertions made by these defendants are true, this court would be without jurisdiction over these defendants. On the other hand, considering the pleadings and the affidavits and exhibits on file in this litigation in the light most favorable to the plaintiffs, as this court must, where the jurisdictional facts are \"so inextricably intertwined with the facts necessary to prove ultimate liability that it would be unfair to dismiss for lack of personal jurisdiction at this preliminary stage,\" Oxford First Corp. v. PNC Liquidating Corp., supra, at p. 193, n . 2, this court concludes The Boston Company, Inc. and Boston Safe Deposit \u0026 Trust Co. have sufficient contact with the transferor forums to require denial of their motions for dismissal for lack of personal jurisdiction. The motions of these defendants to dismiss on this ground are, therefore, denied.\n\nFinally, Fidelity Corporation, not a defendant at the time of transfer in any of the actions transferred here by the order of the Judicial Panel, has moved to dismiss the claims made against it in the Complaint for lack of personal jurisdiction. Aside from its participation as a plaintiff in these proceedings, the record shows this defendant would not be amenable to suit in this district. Fidelity's appearance in these proceedings, however, constitutes a waiver of objections it may have had to this Court's exercise of jurisdiction over it as a defendant party to the claims made against it in Count V of the Complaint. Fidelity's motion to dismiss the claims made against it for lack of personal jurisdiction are, therefore, denied.\n\nVenue\n\nCertain defendants raise what they term as objections to venue in the Central District of California. Assuming this Court would find venue improper as to any claims or parties in this litigation, dismissal of those claims is not warranted at this time. A statutory alternative to dismissal of claims filed in a district where venue is improper is an order pursuant to 28 U.S.C. § 1406(a) that transfers the action to a district where \"the action could have been brought.\" This Court does not begrudge any defendant its right to such a transfer in these proceedings where it can be demonstrated venue does not lie in the Central District of California. On the other hand, as a practical matter, were such claims to be transferred at the present time in accordance with § 1406(a), the final outcome presumably would be application to the Judicial Panel for transfer to this court for pretrial proceedings pursuant to 28 U.S.C. § 1407 and grant of that application, followed by eventual remand of such claims, if appropriate, when the time comes for trial. Rather than engage in this futile and wasteful exercise, the court will retain such claims for pretrial purposes until such time as the pretrial proceedings in this litigation have reached the stage where remand or transfer of such actions becomes appropriate. Defendants have interposed their objections to venue and they will, therefore, be able to raise those objections again when venue considerations become meaningful as a practical matter.\n\nDefendants argue, however, that Van Dusen v. Barrack, 376 U.S. 612, 84 S. Ct. 805, 11 L. Ed. 2d 945 (1964), requires resolution of the venue issues at this time in order to allow application of the substantive law of various transferor forums to the issues raised by defendants on these motions and throughout the litigation. This court is confident that able counsel for the parties in this litigation are capable of directing this court to those splits in authority among the Circuits that are material in this litigation, and where applicable, the Van Dusen rule will be followed. This result can be accomplished without going through the burdensome and unnecessary § 1406(a) transfer followed by another § 1407 retransfer to this district.\n\nThe national banks named in Counts VI and IX of the Complaint point out the special venue provisions of the National Banking Act, 12 U.S.C. § 94, provide that \"actions and proceedings\" against any bank \"may be had\" where the national bank \"may be established.\" For the purpose of the present motions, this court will assume the bank defendants are correct in stating that venue with regard to the claims stated against them in the Complaint lies only in those districts where they have been established. These defendants concede, however, § 94 of the National Banking Act does not preclude § 1407 transfer of actions against them without reference to the venue requirements of § 94, In re Great Western Ranches Litigation, 369 F. Supp. 1406 (J.P.M.L.1974). They ask for dismissal of claims stated against them by plaintiffs who did not bring original actions in those districts where venue would be proper under § 94. Even under § 94, however, an alternative to dismissal of claims brought in an improper district is transfer of the action to the correct forum. Again, this court finds such a transfer would be appropriate in these circumstances on those claims for which venue might be improper under § 94. For the reasons discussed with regard to the other defendants above, this court will postpone transfer of these claims until the pretrial work of this court, pursuant to § 1407, is complete.\n\nDefendants' motions also attack many of the substantive claims made by the Complaint. This opinion will take up the arguments of each defendant below, but there are a few issues that recur in most of the motions, and are applicable to all. The court will attempt to make some preliminary judgments about these issues.\n\nAider and Abettor Liability\n\nThe nature of the liability, if any, that accrues to each defendant in this litigation for the acts of other defendants connected with the EFCA fraud is an issue central to the motion of almost every defendant. The plaintiffs would have this court hold the \"aider and abettor\" defendants liable for all the wrongful conduct of all the primary defendants, regardless of how or when the particular \"aider and abettor\" defendant became aware of or involved in the fraud. Thus, for example, Count I of the Complaint asserts a federal securities law claim on behalf of all who ever purchased an EFCA security on the open market against all the defendants, except the national banks and Fidelity. This count makes no distinction between those who engineered the scheme from the beginning and those who somehow became involved in the fraud at a later date. The applicable law, however, makes such a distinction.\n\nPlaintiffs' concept of aiding and abetting liability in this litigation requires proof of three elements -- (1) wrongful conduct by a primary actor; (2) assistance to or participation in that wrongful conduct by the aider and abettor; and (3) the aider and abettor's knowledge of the wrong, or a breach of some duty of care by the aider and abettor that prevents discovery of the wrong. Once these elements are established, argue the plaintiffs, the aider and abettor's liability is \"equal to that of the perpetrators themselves.\" Kerbs v. Fall River Industries, Inc., 502 F.2d 731, 740 (10 Cir. 1974). This list of elements needed to establish aider and abettor liability in securities fraud actions is incorrect, however, because it is incomplete. In addition to harm done by the principals, assistance or participation by the aider and abettor, and knowledge or breach of duty by the aider and abettor, the plaintiffs must also show some causal connection between the conduct of the aider and abettor and the harm done plaintiffs by the principals before liability can attach to the conduct of the aider and abettor.\n\nApart from the omission of the causation requirement, the court does not disagree with the general elements plaintiffs contend will establish aider and abettor liability under certain of the federal securities laws. Where a person or business entity knowingly gives aid and assistance to a securities fraud perpetrated by another, the regulatory or deterrent purposes of the securities laws will best be served by allowing persons injured by the wrongs to get relief from those aiders and abettors, as well as the principal wrongdoers. Hochfelder v. Ernst \u0026 Ernst, 503 F.2d 1100 (7 Cir. 1974), cert. granted, 421 U.S. 909, 95 S. Ct. 1557, 43 L. Ed. 2d 773 (1975); \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\" Hochfelder v. Midwest Stock Exchange, 503 F.2d 364 (7 Cir. 1974), cert. den., 419 U.S. 875, 95 S. Ct. 137, 42 L. Ed. 2d 114 (1975); Kerbs v. Fall River Industries, supra; Strong v. France, 474 F.2d 747 (9 Cir. 1973); See, Ruder, Multiple Defendants in Securities Fraud Cases; Aiding and Abetting, Conspiracy, in Pari Delicto, Indemnification, and Contribution, 120 Pa.L.Rev. 597 (1972). Furthermore, the kind of assistance required to establish liability under this theory can, in some instances, take the form of inaction or failure to disclose or investigate an on-going fraud. See, Hochfelder v. Ernst \u0026 Ernst, 503 F.2d at 1104; Hochfelder v. Midwest Stock Exchange, 503 F.2d at 374; Kerbs v. Fall River Industries, supra, at 739-740. Those with a special duty to a class of investors do not escape liability merely because they did not find out about a securities fraud they would have discovered and should have disclosed in the proper exercise of the duties imposed on them by law. Hochfelder v. Ernst \u0026 Ernst, supra; Hochfelder v. Midwest Stock Exchange, supra. Accordingly, this court will sustain plaintiffs' claims against defendants that assisted another's wrongful conduct that harmed the plaintiffs, where the aider and abettor defendant knew or would have known, but for the breach of some legal duty owed the plaintiffs, of the wrongfulness of the principal's conduct.\n\nThe general rule formulated here does not, however, support the broadest of plaintiffs' aiding and abetting claims. Plaintiffs would hold defendants that may have knowingly or negligently assisted certain wrongful acts of other principal defendants liable for all the wrongful conduct of the principal defendants. If this contention were accepted, a defendant not involved with the scheme until 1971, for example, would be held liable for the conduct of the principal defendants that took place as far back as 1965. The plaintiffs have presented no argument or authority in support of this result. Without resort to conspiracy theories, none of which are present in this case, plaintiffs' contention does not make sense. As stated above, there must be some causal connection between the culpable conduct of the aider and abettor and the harm to the particular plaintiff. In actions based on § 10(b) of the 1934 Act or Rule 10b-5 thereunder, moreover, there must be a causal connection between the conduct of the defendant and the purchase or sale of a security by the plaintiff. Blue Chip Stamps v. Manor Drug Stores, 421 U.S. 723, 95 S. Ct. 1917, 44 L. Ed. 2d 539 (1975). In the circumstances described by the Complaint, it will be impossible for plaintiffs to prove any causal connection between the federal securities law harm done a purchaser of EFCA securities and the assistance a defendant may have given the fraud at a date subsequent to that purchase. Thus, no defendant will be held liable for the conduct of any primary defendant that occurred prior to the time at which it is proved the secondary defendant became an aider and abettor as that term is defined above.\n\nThere are other limitations on the plaintiffs' aider and abettor claims. Most of the statutes on which plaintiffs base these claims specifically limit the categories of persons that can be held liable under those statutes. § 11 of the 1933 Act, for example, imposes potential liability only on signators to the registration statement, directors or partners of the issuer or those so named, accountants or other professionals that certify or prepare work appearing in the statement, and underwriters. § 12 of the 1933 Act limits liability to those who are sellers of the security purchased by the plaintiff, although the term \"seller\" as used in § 12(2) may include others than the person who actually passes title. In re Caesars Palace Securities Litigation, 360 F. Supp. 366 (S.D.N.Y.1973). The only statutes relied on by plaintiffs that do not include similar limitations are § 17 of the 1933 Act and §§ 10(b) and 14 of the 1934 Act. This court is of the opinion that where a statute specifically limits those who may be held liable for the conduct described by the statute, the courts cannot extend liability, under a theory of aiding and abetting, to those who do not fall within the categories of potential defendants described by the statute. To impose such liability would circumvent the express intent of Congress in enacting these statutes that proscribe narrowly defined conduct and allow relief from precisely defined parties.\n\nFailure to Plead Fraud with Particularity\n\nDefendants' motions also contend the Complaint does not plead fraud with the particularity required by Fed.R.Civ.Pro. 9(b), or is so vague as to require amendment in order to allow defendants a reasonable opportunity to frame a responsive pleading. For the most part, these objections are not well-taken. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" The Complaint is necessarily general in some respects since it encompasses events, transactions, and conduct that span an eight-year period. On the other hand, the Complaint describes the conduct of most of the defendants with particularity sufficient to satisfy the requirements of Fed.R.Civ.Pro. 9(b). The course of conduct that is the underlying fraud is set out with a description of the allegedly fraudulent mechanisms employed by its perpetrators. It could hardly be necessary for plaintiffs to enumerate the date of each false entry on the books at EFCA, for example, in order to meet the requirements of Rule 9(b). Such a requirement would defeat the purpose of the \"short, plain and concise\" requirements of Rule 8. Nor is it necessary for the complaint, once it has adequately identified a particular defendant with a category of defendants allegedly responsible for some continuing course of conduct, to plead more than the group conduct of the defendants. Except as indicated in the notes to this opinion, the Complaint adequately pleads the specific conduct of each defendant to satisfy the requirements of Fed.R.Civ.Pro. 9(b).\n\nThe court turns now to the specific objections raised by each defendant or group of defendants by their motions. In these sections of the opinion, the court will describe the claims made against the defendant or defendants and discuss and rule on the motions of each as those motions raise issues not previously discussed or as they raise particular nuances of the issues covered above.\n\nEquity Funding Corporation of America\n\nThe Complaint names EFCA as a \"primary defendant\" and asserts claims against it in Counts I through V and XII. EFCA is currently undergoing reorganization pursuant to Chapter X of the Bankruptcy Act. The district court judge presiding over the reorganization of EFCA has enjoined and stayed, until final decree of the Reorganization Court, the commencement or continuation of \"any action at law or suit or proceeding in equity . . .\" by various categories of persons and entities that include all the plaintiffs in this litigation, pursuant to 11 U.S.C. § 516(4). Plaintiffs do not dispute that Judge Pregerson's order is within his power as the district judge presiding over EFCA's reorganization. The order would, at the very least, require these plaintiffs to wait until the final decree is entered in those proceedings before they amend or consolidate their claims against EFCA as they attempt to do in the Complaint. This alone would be sufficient ground to dismiss EFCA from the Complaint, although such dismissal would be without prejudice to future amendment of the pleadings in this litigation to include claims against EFCA that are not resolved by the Reorganization Court, if the plaintiffs showed such amendment was timely and not so prejudicial as to be precluded.\n\nEFCA also argues, however, that pursuant to 11 U.S.C. § 11, read in conjunction with 11 U.S.C. §§ 502, 506(1), 596, all the claims made by plaintiffs in this litigation are \"unliquidated contingent claims\" within the ambit of § 506(1), and thus are within the exclusive jurisdiction of the Reorganization Court. The plaintiffs have not attempted to refute this argument or conclusion, but ask that the claims against EFCA not be dismissed at this time because such dismissal might be prejudicial. Any claims plaintiffs in this litigation might have against EFCA based on the activities of EFCA or the purchases of EFCA stock by plaintiffs are within the exclusive jurisdiction of the Reorganization Court, and are dismissed because this court lacks jurisdiction over the subject matter of such claims.\n\nMarvin A. Lichtig, William Mercado\n\nThese defendants are named as \"primary defendants\" in the Complaint. Lichtig was an \"EFCA Executive Vice President, Director,\" and Mercado was an \"EFCA Vice President.\" No specific acts are attributed to either of these defendants by the Complaint, except insofar as they fall within the category of \"primary defendants\" to which the course of fraudulent conduct at EFCA is ascribed. These defendants are named in Counts I through V and XII. They move to dismiss the common law fraud claims asserted against them in these counts on the grounds that the counts fail to allege their conduct was the proximate cause of any loss suffered by the plaintiffs, fail to allege reliance by the plaintiffs on any false statement or misleading omissions made by these defendants, and fail to state the \"actual or approximate extent of any loss or damage.\" Their arguments are based on California substantive law.\n\nUnder California law, in order to recover for fraud, plaintiffs must show that they relied to their detriment on the material misrepresentation(s) of the defendants. Vasquez v. Superior Court of San Joaquin County, 4 Cal.3d 800, 94 Cal.Rptr. 796, 484 P.2d 964 (1971); Ach v. Finkelstein, 264 Cal.App.2d 667, 70 Cal.Rptr. 472 (1968). The plaintiffs have alleged the reliance element necessary to sustain a fraud claim under California law against these defendants. In Paragraph 22(d)(1) of the Complaint, for example, it is alleged these defendants and others disseminated EFCA and EFLIC financial statements \"for the purpose and with the effect of influencing and manipulating the price of Equity Funding securities and for the purpose and with the effect of influencing open market purchasers of EFCA securities to purchase such securities.\" In Paragraphs 22(d)(2) and (3) the \"purpose and effect\" allegation is repeated as it pertains to the debenture purchasing plaintiffs and the Ankony, Liberty, and BNL exchange of stock purchasers. This allegation of \"purpose and effect,\" coupled with the clear materiality of the misrepresentations alleged, satisfies the reliance and causation requirements imposed on pleadings that assert fraud claims in California.\n\nIt is also true actual damage caused by defendants' conduct must be pleaded in order to sustain a claim for fraud under California law. See Vasquez v. Superior Court, supra; Ach v. Finklestein, supra. The plaintiffs have stated in their pleading that the EFCA shares they purchased were worthless. This is an adequate pleading of damages caused by the defendants' conduct to sustain a claim for fraud against these defendants under California law. The motions of Marvin Lichtig, joined by William Mercado and others, are, therefore, denied in their entirety. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\"\n\nThe Trading Defendants\n\nThe \"trading defendants\" consist of a group of individual and institutional investors and their investment representatives that sold EFCA securities between March 6 and March 27, 1973, after finding out about the fraud at EFCA through Raymond Dirks sometime between those dates. These defendants are all named in Counts I through V, and VII and VIII and some are named in Counts XIII and XIV. Plaintiffs now state these claims are based on § 17(a) of the 1933 Act, § 10(b) of the 1934 Act and Rule 10b-5 thereunder, and the common law. As previously stated, no defendant can be held liable as an aider and abettor for acts of EFCA officers and directors or others that took place prior to the time at which the Complaint alleges culpable conduct by the aider and abettor itself. It is, therefore, readily apparent these defendants cannot be held liable under the federal securities laws for any harm suffered by reason of transactions that occurred prior to March 6, 1973, the earliest possible date these defendants became aware of the fraud. Furthermore, these defendants can only be held liable to those plaintiffs who purchased or sold their securities subsequent to the time within the March trading period at which the particular defendant breached some duty of disclosure or inquiry owed the plaintiffs.\n\nApplying these principles to the present Complaint, the claims against the trading defendants in Counts IV and V must be, and are, dismissed for failure to state a claim. These counts pertain to the BNL and Liberty exchange of stock transactions completed long before March 6, 1973. Likewise Count II and III claims against these defendants are dismissed because they are based on purchases of debentures made prior to March 6, 1973. The Count I claims against these defendants are dismissed on the same basis. To the extent that Count I plaintiffs might include whose who purchased or sold EFCA securities within the March trading period, they are merely repeating claims they make in Counts VII and VIII.\n\nCertain aspects of the Count VII and VIII claims present more difficult problems than the first five counts. Count VIII makes claims against the March 6-27 sellers on behalf of those plaintiffs and the class of persons they represent who retained their securities through the March trading period, although they do not allege purchase within the March period. These plaintiffs contend they were induced to retain their securities by the failure of these defendants to disclose what they knew about EFCA. These claims are analogous to those of plaintiffs in Blue Chip Stamps v. Manor Drug Stores, supra, who alleged misrepresentations and omissions made in a prospectus induced them to refrain from purchase. As such, these claims are barred from recognition under § 10(b), Rule 10b-5, and § 17(a). It is true most of these plaintiffs purchased securities, but purchase is not the basis for their claims against these defendants, and, therefore, the Count VIII claims of these plaintiffs are dismissed.\n\nIn Blue Chip Stamps, the Supreme Court specifically rejected these types of claims under § 10(b) and Rule 10b-5. Saying \" Birnbaum was rightly decided,\" 421 U.S. at 731, 95 S. Ct. at 1923, 44 L. Ed. 2d at 547. The Court held, \". . . the plaintiff class for purposes of § 10(b) and Rule 10b-5 private damage action is limited to purchasers and sellers of securities.\" 421 U.S. at 730, 95 S. Ct. at 1923, 44 L. Ed. 2d at 547. Later in the opinion, the Court stated:\n\n\"Three principal classes of potential plaintiffs are presently barred by the Birnbaum rule. . . . Second are actual shareholders in the issuer who allege that they decided not to sell their shares because of an unduly rosy representation or a failure to disclose unfavorable material. . . .\" 421 U.S. at 737-38, 95 S. Ct. at 1926, 44 L. Ed. 2d at 550.\n\nThe Count VIII plaintiffs basing their claims against the trading defendants on retention of EFCA securities fall precisely within this group of potential plaintiffs barred by Blue Chip Stamps.\n\nCount VIII also asserts claims against trading defendants on behalf of those who sold their EFCA securities during the March trading period without knowledge of the fraud at EFCA. Because the Complaint alleges these sales took place subsequent to March 6, 1973, these plaintiffs are within the class of plaintiffs who might state claims against the trading defendants under the purchaser-seller rule articulated in Blue Chip Stamps. These plaintiffs, however, have not alleged any causal connection between the loss, if any, they suffered on their March sales and the unlawful conduct of the trading defendants. The Count VIII claims made by plaintiffs who sold their EFCA securities within the March trading period without knowledge of the EFCA fraud, are, therefore, dismissed for failure to state a claim.\n\nCount VII is brought on behalf of those who purchased EFCA securities on the open market between March 6 and 27, 1973. Each trading defendant argues it cannot be held liable to any plaintiff who bases its Count VII claims on purchases that took place prior to actual sale of EFCA securities by the defendant without disclosure of the information it possessed about EFCA. These defendants argue that under such cases as S.E.C. v. Texas Gulf Sulphur Co., 401 F.2d 833 (2 Cir. 1968) and Shapiro v. Merrill Lynch, 495 F.2d 228 (2 Cir. 1974), the only possible conduct for which they can be held liable is a combination of sale and nondisclosure of inside information. Aside from plaintiffs' aiding and abetting theory of recovery, this is the law, and these defendants will not be held liable to prior purchasers within the March trading period simply because they sold shares of EFCA securities without disclosure of the Dirks information at a later date. On the other hand, the Complaint adequately asserts sales without disclosure by these defendants beginning on March 6, 1973. The Complaint, therefore, states claims against these defendants on behalf of those who purchased their EFCA securities after that date.\n\nThe Complaint also states these defendants aided and abetted violations of the federal securities laws by their course of conduct from March 6 through March 27, 1973, regardless of the date they actually sold EFCA securities. If it is proven, as the Complaint would allow, that a trading defendant possessed of the Dirks information as of March 6, 1973, failed to disclose that information, although the defendant knew others were selling EFCA securities without disclosing that information the other sellers also possessed, these defendants could be held liable as aiders and abettors of those sales. Informed of the fraud by Dirks, these defendants were under an obligation not only to refrain from selling their EFCA securities, but also to refrain from giving assistance to federal securities law breaches by Dirks or others with that information. Although the extent of this duty may not sustain the claims of prior purchasers once the factual basis for these claims is developed through discovery and trial, the Complaint pleads sufficient relation of all the trading defendants to Dirks and the other trading defendants to support these aiding and abetting claims. The plaintiffs have pleaded knowledge as of March 6, 1973, and some sales without disclosure as of that date, all of which have as their nexus the dissemination and unfair use of the Dirks information. Thus, Count VII claims against any one of the defendants named therein will not be dismissed at this time simply because a plaintiff purchased his securities during the March trading period but prior to any sale by the particular defendant.\n\nThe trading defendants also argue they cannot be liable to those plaintiffs who do not plead or show they actually purchased their securities from these defendants. They concede, however, the case law is to the contrary. Shapiro v. Merrill Lynch, supra; Sargent v. Genesco, 492 F.2d 750 (5 Cir. 1974); Texas Continental Life Ins. v. Bankers Bond Co., 307 F.2d 242 (6 Cir. 1962). This court adopts the rationale of those decisions, and of the Shapiro court in particular:\n\n\"We hold that defendants owed a duty -- for the breach of which they may be held liable in this private action for damages -- not only to the purchasers of the actual shares sold by defendants (in the unlikely event they can be identified) but to all persons who during the same period purchased Douglas stock in the open market without knowledge of the material inside information which was in the possession of defendants.\" at page 237.\n\nIn the present litigation, some of the actual purchasers of defendants' securities may be identifiable, and plaintiffs Lawton and Salomon Brothers both allege they were the actual purchasers of certain blocks of EFCA securities sold by particular defendants. Even if these transactions turn out to be the only sales by these defendants, however, they can also be liable for breach of the duty they owed \"to all persons who during the same period purchased [EFCA securities] on the open market without knowledge of the material information which was in the possession of defendants.\" Identification of purchasers might well go to limit the remedies or damages available against these defendants, but the present motions do not require this court to make any determination about the issues at the present time. Shapiro v. Merrill Lynch, supra, at 241. Given the purpose of the federal securities laws as expressed in the opinions of various courts, that is, \"to insure the integrity and efficiency of the securities markets,\" Shapiro, at 237; and See Chris-Craft Industries v. Piper Aircraft Corp., 480 F.2d 341 (2 Cir. 1973), cert. den. 414 U.S. 910, 924, 94 S. Ct. 231, 234, 38 L. Ed. 2d 148, 158, 94 S. Ct. 232 (1973), where massive trading without disclosure of material inside information on the national securities markets is alleged, the privity arguments made by the defendants must be rejected.\n\nThe discussion above applies only to those claims made in Counts VII and VIII that are based on § 10(b) and Rule 10b-5. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\" The trading defendants have also directed their motions to other provisions of the federal securities laws that plaintiffs now admit do not apply. These aspects of the trading defendants' motions are granted in their entirety. This court likewise dismisses all common law or state law claims asserted against these defendants in Counts I through V and VIII on the ground that the federal claims stated in those counts are too insubstantial to warrant the exercise of federal jurisdiction over the pendent claims. United Mine Workers of Am. v. Gibbs, 383 U.S. 715, 726, 86 S. Ct. 1130, 1139, 16 L. Ed. 2d 218, 228 (1966). This court is also unable to ascertain from the pleading the legal basis for the common law claims made in Count VII, and those claims are dismissed for failure to state a claim. In summary, all claims asserted against the trading defendants in Counts I through V and Count VIII are dismissed for failure to state a claim. All Count VII claims asserted against these defendants are dismissed except those based on § 10(b) and Rule 10b-5. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\"\n\nNew York Securities Co., Inc., and Bache \u0026 Co., Inc., The Underwriters\n\nThe Complaint describes defendants New York Securities, Co., Inc., and Bache \u0026 Co., Inc. as underwriters for two EFCA debenture issues. New York Securities acted as underwriter for an EFCA offering of 9 1/2% debentures due 1990, with detachable warrants to purchase 555,000 shares of EFCA common stock at $25.25 per share, the warrants exercisable until December 1, 1975. These debentures, face amount $22,000,000, were offered pursuant to a registration statement and prospectus, dated December 9, 1970, and listed on the New York Stock Exchange subsequent to that date. A number of material misrepresentations about the operations of EFCA and its sales, assets and income prior to December, 1969 appeared in the prospectus. The prospectus also concealed the bogus insurance policies that were the backbone of EFCA's growth.\n\nNew York Securities and Bache were underwriters for an EFCA offering of 5 1/2% debentures convertible to EFCA common stock at $36.75 per share. These debentures, face amount $38,500,000, were issued pursuant to a prospectus effective December 7, 1971. This prospectus contained false statements concerning EFCA's financial condition, its earnings for the five years prior to December 31, 1970, and its income, sales and assets, as well as similar misstatements about EFLIC operations prior to December 31, 1971. This prospectus concealed EFCA's bogus life insurance growth program.\n\nNew York Securities and Bache are named as defendants in Counts I through V and XII of the Complaint, and plaintiffs state they make claims against these defendants based on § 11, § 12(2) and § 17 of the 1933 Act, and § 10(b) and § 18 of the 1934 Act. There are no allegations that these underwriters knew about the EFCA fraud at the time the debentures were offered, or at any time prior to April 2, 1973. The negligence of these defendants is alleged only in the general averments appearing in the counts in which they are named. These underwriters' motions are directed at Counts I, IV, V, and XII of the Complaint only. They concede Count II and III of the Complaint, brought on behalf of those who purchased the debentures pursuant to the original issue, have adequately pleaded claims against them. These motions will be granted, because, aside from the claims made in Counts II and III, the Complaint fails to state a claim against these defendants.\n\nThe Count IV and XII claims against the underwriters are dismissed because they are based on the Liberty and Ankony transactions completed prior to any alleged culpable conduct by these underwriters. These claims fall squarely within those kind of claims not allowed under the principles of aiding and abetting established above, and there is no other basis for liability of the underwriters to the Liberty or Ankony plaintiffs. Count V claims against Bache, and Count I claims against both underwriters based on purchases of EFCA securities that occurred prior to publication of the prospectus for the debenture issue underwritten by the particular defendant are dismissed on the same grounds.\n\nDismissal of the other Count I claims against the underwriters and of the Count V claims against New York Securities is required for different reasons. These claims are based on plaintiffs' aider and abettor theory. Plaintiffs contend that because the underwriters foresaw the prospecti published in connection with the debenture issues would \"affect the securities marketplace generally, at least during the time the prospectus was effective,\" these defendants owed a duty of reasonable investigation to all subsequent purchasers of EFCA securities. The plaintiffs find this duty in § 11 of the 1933 Act, which requires underwriters of original securities issues to make inquiry of the issuer's financial condition before publication of a prospectus. The duty imposed by that section, however, is not owed to all investors, but only those who buy the class of securities underwritten. Under the principles of aiding and abetting stated above, this § 11 duty cannot form the basis for claims by plaintiffs not owed a duty of inquiry under that section. This bars claims against the underwriters by all but the Count II and III plaintiffs.\n\nIn Hochfelder v. Ernst \u0026 Ernst, supra, the plaintiffs sought to recover from the principal accounting firm for a brokerage company engaged in a long term securities fraud. The complaint in that case alleged the accounting firm was liable under Rule 10b-5 as an aider and abettor to the scheme because the firm had negligently failed to discover the fraud in the course of its audits of the brokerage company. The accounting firm was not alleged to have known about the fraud. On the accountant's motion for summary judgment, the appellate court sustained the claims of the plaintiffs, securities purchasers defrauded by the primary defendant. The court found the accountant defendant owed a duty of inquiry and disclosure to the plaintiffs because § 17(a) of the 1934 Act and Rule 17a-5 thereunder impose special duties on an accountant for a member of a national securities exchange in connection with the filing of annual certified financial reports. This duty, specifically imposed to protect all investors, was held sufficient to allow those investors to maintain suit against the accountant for a breach of the duty that assisted a securities fraud perpetrated by a member of a national securities exchange.\n\nAt the same time, the Hochfelder v. Ernst \u0026 Ernst court rejected plaintiffs' contention that the accountant's contractual relationship with the broker formed a basis for the plaintiffs' claims of aiding and abetting against the accountants. The court concluded the common law duty of inquiry arising out of this relationship was not imposed for the benefit of third parties such as the plaintiffs, and thus was no basis for aiding and abetting claims by those parties under the five part rule formulated in the opinion. Similarly, the duty of reasonable investigation imposed on the underwriter defendants by § 11 of the 1933 Act does not inure to the benefit of plaintiffs other than those who make claims against the underwriters in Counts II and III. Plaintiffs have not pointed to any other statutory or common law basis for the imposition of such a duty of inquiry on the underwriters, the breach of which would be actionable by the Count I or V plaintiffs. Count I plaintiffs who were original issue purchasers of the debentures can pursue their claims against the underwriters by means of Counts II and III. All federal claims asserted in the Complaint against the underwriters, except those stated in Counts II and III, are, therefore, dismissed for failure to state a claim. Because the federal claims asserted against the underwriters in Counts I, IV, V, and XII do not form a basis for recovery, the pendent claims asserted therein against these defendants are also dismissed.\n\nThe Wolfson Firms; Seidman \u0026 Seidman, Principal Accountants\n\nFrom 1964 through February, 1972, defendants Wolfson, Weiner \u0026 Co. and Wolfson, Weiner, Ratoff, \u0026 Lapin (co-partnerships referred to collectively herein as \"Wolfson\") were retained by EFCA as its independent accountant and performed various accounting services for EFCA. These services included audit and certification of financial statements contained in each of the following: EFCA's annual statements, 1964-1971 the proxy statements related to the Liberty and BNL acquisitions, EFCA financial statements furnished the Ankony plaintiffs in connection with that transactions, the registration statements and prospecti related to the 5 1/2% and 9 1/2% debenture issues, and the registration statement and prospectus published in connection with a September 11, 1972 secondary offering of EFCA common stock. Each of these financial statements contained a number of false and misleading statements that inflated the stated assets and income of EFCA, left out known liabilities, and failed to disclose the bogus insurance program at EFCA. Wolfson failed to discover the false and misleading nature of these financial statements because it did not exercise reasonable care and adhere to generally accepted auditing standards and accounting principles in connection with the audits and preparation of the statements. Wolfson knew the accounting procedures used at EFCA were wholly inadequate.\n\nThere are also allegations concerning Solomon Block, an employee of Wolfson prior to and as of February, 1972, the auditor in charge of the Wolfson audit of EFCA, and Julian Weiner, partner in charge of the EFCA account and audit for Wolfson at all times prior to 1972. Block was incompetent to act as the chief auditor in charge of the EFCA audits, because among other things, he came to establish a relationship of financial dependence on some of the officers and directors of EFCA, thereby creating a conflict of interest between that relationship and his role as an independent auditor of the company. Weiner knew about this conflict and also \"established a position of dependence and personal reliance\" on some of EFCA's officers and directors. This, says the Complaint, conflicted with his role as an auditor of the company. Similarly, the Wolfson firm itself became dependent on EFCA for more than one-half its gross fees, and the Complaint says this evinces further conflict between Wolfson's role as an independent auditor and its actual relationship with EFCA. This conflict made independent audit of EFCA by Wolfson impossible, states the Complaint. The Complaint specifically alleges all the reports and financial statements audited by Wolfson for EFCA were disseminated for the purpose and with the effect of influencing plaintiffs to make their purchases of EFCA securities.\n\nAccording to Paragraph 26 of the Complaint, defendant Seidman \u0026 Seidman was the \"successor\" to Wolfson by reason of a February 1, 1972 \"merger,\" at which time Seidman \"assumed all the liabilities of Wolfson arising from Wolfson's accounting practice as of that date.\" At the same time, Seidman took on Block as an employee and Weiner as a partner and kept them on the EFCA account as auditor in charge and partner in charge, respectively, through April 1, 1973. Stanley Goldblum, president of EFCA, made retention of Block and Weiner a condition of Seidman's continued employment as an independent auditor of EFCA. The Complaint alleges that by acceptance of this condition, Seidman \"compromised beyond repair\" its position as an independent accountant for EFCA. The incompetence of Block was known or should have been known by Seidman, says the Complaint.\n\nThe only published work done for EFCA by Seidman was a \"consolidated balance sheet of EFCA and its subsidiaries as of December 31, 1971, and the related consolidated statements of earnings and changes in financial position for the year ended December 31, 1971.\" Because Seidman undertook to perform the audit related to this certification less than 60 days before the time the statement was required to be filed in a 10-K report to the S.E.C., the Complaint states this certification amounted to a mere rubber stamp of the work done by Wolfson and fraudulently represented Seidman had performed the duties of an independent auditor of EFCA. Like all the other EFCA financial statements, the statement certified by Seidman contained incorrect, false, and misleading statements that inflated the stated assets of EFCA, understated its liabilities, and failed to mention the bogus insurance program. Seidman was aware of the inadequacy of the accounting procedures at EFCA and would have discovered the misrepresentations and omissions if it had exercised reasonable care and adhered to standard accounting practices. Paragraph 26(f) of the Complaint says the EFCA financial statement certified by Seidman was disseminated for the purpose and with the effect of influencing the price of EFCA securities and inducing the purchase or retention of those securities by plaintiffs.\n\nParagraph 26(h) of the Complaint alleges Seidman conducted an audit and prepared a statement for EFCA and its subsidiaries for the year ending December 31, 1972. Block and Weiner were in charge of the audit. The galley proofs of statements prepared by Seidman as a result of this audit overstated EFCA's net worth by $250 million, EFCA's investment in EFLIC by $35 million, and EFLIC's assets by $23 million, but the audit and the statements so prepared were never released to the public.\n\nSeidman, Wolfson, Solomon Block, Julian Weiner, and certain partners of the two accounting firms are named in Counts I through V and XII of the Complaint. Plaintiffs assert these claims are based on § 11, § 12(2), and § 17 of the 1933 Act, and § 10(b), § 13(a), § 14(a), and § 18 of the 1934 Act, and S.E.C. Rules thereunder. Seidman \u0026 Seidman and Robert Spencer, named as a representative of the partners of Seidman \u0026 Seidman have filed a motion to dismiss directed to plaintiffs' claims under certain of these statutes and rules, and to strike part of Paragraph 26(f) and all of Paragraph 26(h). The Wolfson firms have joined in that motion, as have Solomon Block and some of the partners of Wolfson, including Julian Weiner. Some of the named Wolfson partners have also joined in parts of the motions of the trading defendants. Solomon Block also joins in the motion of Marvin Lichtig, discussed above.\n\nSeidman moves to dismiss claims made against it under § 11 and § 12(2) of the 1933 Act and § 14(a) of the 1934 Act on the grounds that the Complaint fails to allege any connection between the financial statements prepared for EFCA and the registration statements, communications, prospecti, and proxy statements that give rise to liability under those sections. It is true the Complaint does not allege any audit or certification by Seidman of any EFCA financial statements, filings, or publications of the kind that might form a basis for private recovery under these statutes. On the other hand, it is not disputed the Complaint alleges audit and certification of false and misleading EFCA financial statements by Wolfson that support claims against Wolfson under these three sections. Although Seidman asserts it did not assume the liabilities of Wolfson in February, 1972, the Complaint pleads the contrary, and until further discovery allows resolution of this issue, the court is bound by the allegations in the Complaint. If the Wolfson liabilities under § 11, § 12(2), and § 14(a) were assumed by Seidman, the plaintiffs could recover from Seidman under those provisions of the federal securities laws. Aside from the assumption of those liabilities by Seidman, however, the court can discern no other pleaded basis for the § 11, § 12(2) and § 14(a) claims against Seidman.\n\nThe logic of this limitation on the claims against Seidman does not apply to the claims made under these sections against the Wolfson firm or its partners and employees. The Complaint adequately pleads their participation in conduct that would allow recovery by many of the plaintiffs under § 11, § 12(2), and § 14(a). Their mere joinders in the motions of Seidman give little clue to whatever problems may lurk in the background with regard to those claims, and since they raise no such problems, the court will not explore them. The Complaint's allegations that Wolfson audited and certified the false and misleading financial statements that were published in connection with the Liberty, BNL, Ankony, debenture, and secondary offering transactions and securities sales, and thereby influenced the purchasers or exchangers of EFCA securities to make their purchase or exchange, are sufficient. The motions of the Seidman and Wolfson firms, their partners, and Block, are denied insofar as they are directed to plaintiffs' claims brought under § 11 and § 12(2) of the 1933 Act and § 14(a) of the 1934 Act.\n\nThe plaintiffs' claims against these accounting defendants based on § 13(a) of the 1934 Act and S.E.C. Rules thereunder are dismissed in their entirety. Plaintiffs have not offered any authority or reasoning that would support a private right of action under this section or the S.E.C. Rules pertaining to the statute. Nor have they pleaded any basis for recovery under the statute or rules, even if the court were to infer such a right of action.\n\n§ 13(a) of the 1934 Act requires issuers of securities traded on the national securities exchanges to file with the S.E.C. such information and reports as are required by the rules of the Commission. S.E.C. Rule 13a-11 requires the filing of \"current\" reports at the end of \"any month during which any of the events specified\" in the form pertaining to those reports takes place, and Rule 13a-13 requires the filing of \"quarterly reports\" by issuers. The S.E.C. has promulgated no rules under § 13(a) that specifically prohibit the filing of false or misleading statements in such reports, although the rules do set out certain kinds of information that must be included in the filings. Neither do they explicitly confer a right of action on any private party for failure to file these reports or for misleading or false statements contained therein. The texts of both the statute and the rules indicate to this court that § 13(a) and the rules of the S.E.C. thereunder serve as methods by which the Commission can monitor corporate changes that might effect the securities market during the fiscal year. Of course, the ultimate purpose of this monitoring is investor protection, and there can be inferred from the filing requirements that issuers are under a duty to file accurate and complete reports. The sense of the statute and the rules, however, is that they are administrative devices not intended to provide private rights to investors, except as might be narrowly provided for in § 18 of the 1934 Act. The cases indicate that neither the statute nor rules provide for private rights of action exclusive of § 18. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\" In re Penn Central Securities Litigation, 494 F.2d 528, 539-541 (3 Cir. 1974). In any event, the rule and statute impose duties only on issuers and not accountants, and the plaintiffs have not alleged any breach of a duty specifically imposed on the issuer by the statute or rules. The plaintiffs' claims against the accountants based on § 13(a) and S.E.C. rules thereunder are dismissed for failure to state a claim.\n\n§ 18 of the 1934 Act makes liable persons who \"make or cause to be made,\" false or misleading statements in \"any application, report, or document filed pursuant to this chapter or any rule or regulation thereunder . . .\" Such misstatements are actionable by:\n\n\". . . any person (not knowing that such statement was false or misleading) who, in reliance upon such statement, shall have purchased or sold a security at a price which was affected by such statement, for damage caused by such reliance, unless the person sued shall prove that he acted in good faith and had no knowledge that such statement was false or misleading.\"\n\nSeidman attacks plaintiffs' claims under this section on two grounds. The first, previously discussed in connection with the § 11, § 12(2), and § 14(a) claims against Seidman, is that the Complaint alleges no misstatements by Seidman that appeared in any reports, filings, or statements filed pursuant to the chapter or rules covered by § 18. Seidman's liability under this section can only be sustained because Seidman assumed the liabilities of Wolfson. Again, Wolfson is alleged to have prepared and certified false and misleading statements for EFCA in connection with filings required under the statutes and rules to which § 18 applies, and thus fall within the class of persons who can be held liable under § 18. Seidman also argues the plaintiffs have not alleged reliance upon any statement for which liability is imposed under § 18, and, therefore have not stated a claim under that section. Hoover v. Allen, 241 F. Supp. 213 (S.D.N.Y.1965). Unlike the plaintiffs in Hoover, however, the plaintiffs here were purchasers of the EFCA securities and the Complaint alleges they were influenced to enter into those transactions by the false and misleading statements made in the relevant registration, proxy, and financial statements of EFCA that were prepared, audited, and certified by the accountants here. Even under the rationale of Hoover, then, and certainly under the terms of the statute, the plaintiffs have stated § 18 claims against these accountants. This branch of accountants' motions, therefore, is denied.\n\nThe accountants' motions to strike are denied. They ask the reference to plaintiffs who \"retained\" their securities in reliance on defendants' misrepresentations be stricken in accordance with the purchaser-seller rule. Insofar as this allegation pertains to claims made under statutes or rules that are subject to this or similar limitations -- § 11, § 12(2), § 17 of the 1933 Act, § 10(b), § 18 of the 1934 Act -- this allegation cannot, of course support such claims. It is not clear, however, that claims based on false or misleading proxy statements are subject to such a limitation. See § 14(a) of the 1934 Act and Rule 14a-9 thereunder. Such claims are made by the plaintiffs, and the reference to \"retained\" securities in Paragraphs 25(f) and 26(f) of the Complaint shall stand on this basis. Furthermore, the allegations concerning the 1972 unpublished audit and EFCA financial statements support § 10(b) and Rule 10b-5 aiding and abetting claims against the Seidman defendants, including Weiner and Block, under the rationale of Hochfelder v. Ernst \u0026 Ernst, supra. See also, Fischer v. Kletz, 266 F. Supp. 180 (S.D.N.Y.1967). Thus the allegations of Paragraph 26(h) will remain in the Complaint, the defendants' motions to strike are denied.\n\nThe \"Froggatt\" Defendants and Coopers \u0026 Lybrand\n\nAside from the Seidman and Wolfson accountant defendants, certain other accounting firms and their partners are named in the Complaint for work they did touching on the activities at EFCA or its subsidiaries between 1964 and 1973. The first group of these defendants is composed of Joseph Froggatt \u0026 Co., Inc., Joseph Froggatt \u0026 Co., a copartnership, Coopers \u0026 Lybrand, and a class of the individual partners of the Froggatt partnership, represented by Philip Defliese. These defendants are named in Counts I through V and XII of the Complaint, and the plaintiffs assert they have made claims against these defendants under § 11, § 12(2) and § 17 of the 1933 Act, and § 10(b), § 14(a), and § 18 of the 1934 Act, and S.E.C. Rules promulgated thereunder.\n\nThe substance of the claims against these defendants appears in Paragraph 28 of the Complaint. There it is alleged the Froggatt partnership audited and certified the financial balance sheets of BNL as of December 31, 1971, the related statement of operations and adjusted statement of BNL operations for the five years ended December 31, 1971, and the BNL statement of capital surplus for the three years ended December 31, 1971. The Complaint states these financial statements were contained in the registration statements and prospectus dated September 11, 1972 that were related to the secondary offering of EFCA securities on that date. The Froggatt partnership allegedly failed to exercise reasonable care and adherence to generally accepted auditing principles in preparation of these statements. Otherwise, says the Complaint, it would have known the assets and receipts of BNL as represented by these statements were incorrect, false, and misleading in that they were \"substantially inflated\" by the inclusion of amounts of fictitious and overvalued assets and receipts. The Complaint also alleges the statements incorrectly said BNL had paid $2.9 million to the Pennsylvania Life Company as consideration, \"when in fact that money was paid as a bribe to induce Pennsylvania Life Company not to disclose the EFCA and EFLIC fraud to the public or regulatory agencies.\" The BNL statements allegedly audited and certified by the Froggatt partnership were disseminated \"with the purpose and effect of influencing purchasers of EFCA securities to purchase or retain such securities.\" The only alleged basis for the liability of Coopers \u0026 Lybrand is that it \"merged\" with and \"assumed the liabilities of Froggatt arising from Froggatt's accounting practice.\"\n\nCoopers \u0026 Lybrand, the two Froggatt defendants, and Defliese move for the dismissal of all counts pursuant to Fed.R.Civ.Pro. 9 and 11. In addition, Coopers \u0026 Lybrand, Froggatt, Inc., and Defliese move for dismissal of all counts pursuant to Fed.R.Civ.Pro. 12(b)(6), and the Froggatt partnership moves for dismissal of Counts II through V and XII of the Complaint pursuant to this rule. In the alternative, these defendants ask the court to consider affidavits accompanying their joint motions and grant summary judgment in their favor on all counts. They also request the plaintiffs be required to post bond pursuant to Fed.R.Civ.Pro. 11. For the reasons given below, the claims against defendants Defliese and Joseph Froggatt \u0026 Co., Inc. are dismissed in their entirety, and Counts II through V and XII of the Complaint are dismissed insofar as those counts assert claims against Coopers \u0026 Lybrand and the Froggatt partnership.\n\nJoseph Froggatt \u0026 Co., Inc., is dismissed from the Complaint because the Complaint makes no statement that would serve as a foundation for the claims made against this defendant. Plaintiffs' opposition to the present motions does not dispute this conclusion. The motion of Joseph Froggatt \u0026 Co., Inc. for dismissal pursuant to Rule 12(b)(6) is, therefore, granted.\n\nThe claims made against Philip Defliese are also dismissed in their entirety. Accompanying Defliese's motion is an affidavit of this defendant that denies he was ever a partner in Froggatt. Plaintiffs agree Defliese was named by mistake and there is no factual basis for the claims made against him. Accordingly, defendant Defliese's motion to dismiss is granted.\n\nThe Count II through V and Count XII claims against Coopers \u0026 Lybrand and the Froggatt partnership must be dismissed for failure to state a claim on which relief can be granted. All five counts assert claims based on transactions that occurred prior to the alleged misconduct of Froggatt or Coopers. The only theory offered as a ground for recovery from these defendants by the plaintiffs making claims in those counts is the previously rejected aider and abettor theory of liability for prior acts of principals based on the aider and abettor's subsequent wrongful acts or omissions. As with all such claims made by plaintiffs in this litigation, the Count II through V and Count XII claims against Coopers \u0026 Lybrand and the Froggatt partnership are dismissed in their entirety.\n\nThe Froggatt partnership does not contend the Count I claims against it must be dismissed under Fed.R.Civ.Pro. 12(b)(6). The memorandum filed in support of this defendant's motion, however, asserts that any Count I plaintiff purchasing its EFCA securities prior to the September 11, 1972 dissemination of the erroneous Froggatt report is without standing to make any claim against the Froggatt partnership. The Complaint and the response to this motion indicate the only conduct by Froggatt that might form a basis for its liability is the certification of the BNL reports that appeared in the September 11, 1972 prospectus. Thus, the Court is unable to sustain claims against the Froggatt partnership for any harm done to plaintiffs before September 11, 1972. This conclusion is based on the principles of causation and aiding and abetting already adopted by this court. Count I claims against the Froggatt partnership are, therefore, dismissed insofar as they are brought on behalf of any plaintiff basing its claim on purchases of EFCA securities that occurred prior to September 11, 1972. Count I claims by subsequent purchasers may continue.\n\nThe primary ground for dismissal of the Complaint argued for by Coopers \u0026 Lybrand is not that just stated as a basis for dismissal of Count II through V and XII claims against Froggatt and Coopers. Rather, Coopers argues it was never involved in the fraud at all and never assumed the liabilities of the Froggatt partnership. Coopers has submitted affidavits by a number of general partners in that firm that deny Coopers assumed the liabilities of the Froggatt partnership. These affidavits, disputed by plaintiffs and unsupported by any documentary exhibits, are an inappropriate means of resolving the issue of Coopers' liability for Froggatt's conduct. Plaintiffs have not had an adequate opportunity to engage in discovery of information in possession of the defendants that might be necessary to contest Coopers' assertions. Coopers' motion to dismiss under Rule 12(b)(6) or Rule 56, therefore, is premature. Even if the plaintiffs prove Coopers assumed the liabilities of Froggatt, however, Coopers still can only be held liable to the same Count I plaintiffs as Froggatt. The Count I claims against Coopers, therefore, are dismissed in part and sustained in part on the same basis as the Count I claims against the Froggatt partnership.\n\nAll the defendants discussed under this heading also move for dismissal of the Complaint for failure to plead fraud with particularity as required by Rule 9(b) and Rule 11, and for sanctions pursuant to Rule 11. Because the Complaint pleads no basis for the fraud claims against Joseph Froggatt \u0026 Co., Inc., Rule 9(b) provides an alternative basis for dismissal of the claims against that defendant. Furthermore, since the plaintiffs admit there is no factual basis for the claims against either Froggatt \u0026 Co., Inc., or Philip Defliese, Rule 11 dismissal of those claims is likewise granted. The court has reviewed the affidavits and exhibits attached to the motions of these two defendants, however, and concludes that no showing has been made that the naming of these defendants in the Complaint constitutes any purposeful harassment by plaintiffs' counsel or amounts to a wilful attempt to avoid the requirements of that Rule. Furthermore, plaintiffs' counsel have agreed to dismissal of these defendants now that the true facts have been made available by the defendants. In these circumstances, Rule 11 does not permit the imposition of sanctions on counsel or the parties, and these defendants' motions for such sanctions are denied.\n\nWith regard to the motions of Coopers and the Froggatt partnership under Rule 9(b), the Complaint adequately sets out the basis for the fraud claims against each of these defendants, except as already set out above. See pp. 14-15, supra. The court also notes the only basis for the Rule 11 motions of the Froggatt partnership and Coopers is that they deny they did what the Complaint charges them with doing. Mere affidavits unsupported by documentation are not enough for this court to dismiss the claims made here as a sham, particularly where Froggatt does not deny certifying statements that appeared in the prospectus related to the secondary offering by EFCA, a company that turned out to be virtually worthless. The Rule 9 and Rule 11 motions of Coopers and the Froggatt partnership are, therefore, denied. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\"\n\nPeat, Marwick, Mitchell \u0026 Co.\n\nParagraph 29 of the Complaint alleges defendant Peat, Marwick, \u0026 Co., also referred to by the Complaint as Peat, Marwick, Mitchell, \u0026 Co. (hereinafter \"PMM\"), is a national accounting firm that audited and certified financial statements of Liberty Savings and Loan Association for the year ending December 31, 1970, and previous years. Liberty was acquired by EFCA in September, 1970. The Complaint alleges the 1970 Liberty statements certified by PMM were disseminated interstate for the purpose and with the effect of influencing purchase or retention of EFCA securities. Paragraph 29 goes on to allege PMM \"was the auditor, or carrying out accounting services for Phoenix Mutual Life Insurance Company\" (hereinafter \"Phoenix\"), a company reinsuring EFLIC life insurance policies. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\" According to the Complaint, a 1970 investigation of EFLIC by PMM for Phoenix led to PMM's discovery or belief that the EFLIC policies reinsured by Phoenix \"were or may have been bogus.\" Neither Phoenix nor PMM disclosed this information to the public, EFCA or Liberty investors, or any regulatory agency. PMM is named as an aider and abettor in Count I through V and XII of the Complaint.\n\nThe issue here is whether, if PMM discovered the bogus EFLIC policies in connection with its investigation for a client in 1970, PMM was under any obligation to disclose that information, either in the Liberty financial statements it certified or elsewhere, and if so, whether a breach of that duty allows recovery from PMM by the injured purchasers of EFCA securities under any provision of the federal securities laws or S.E.C. rules pertaining thereto. The Court is extremely reluctant to dismiss, at this stage of the proceedings, any defendant alleged to have actually known about major aspects of the fraud at EFCA or EFLIC, because this case presents unique issues with regard to regulation of the national securities markets by means of private investor suits. The EFCA securities litigation is not a product of the \"ingenuity\" of dissatisfied investors and their counsel, see Wessel v. Buhler, 437 F.2d 279, 283 (9 Cir. 1971), but seeks redress for a blatant failure of the entire market system to function in a fair, efficient, and nonfraudulent manner as envisioned by the statutory scheme set up by Congress in the 1930's and enforced primarily by investor and S.E.C. suits since that time. If PMM knew about the EFLIC bogus policy scheme but still allowed EFCA to use financial statements certified by PMM as a means of inflating the price of EFCA securities, it contributed substantially to the breakdown of this regulatory system. By such conduct, it knowingly allowed innocent investors, who relied on the prestige and reputation of all the defendants here for protection of their financial interests, to suffer harm of the precise kind the 1933 Securities Act and the 1934 Securities Exchange Act were meant to prevent. In these circumstances, the court will not dismiss plaintiffs' claims against PMM, at least until it has had a better opportunity to review the factual background of PMM's activities, developed by discovery, on a motion for summary judgment. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\"\n\nNevertheless, certain aspects of PMM's motions are well taken. Count XII plaintiffs have failed to state a claim against PMM because they base their claims on transactions that occurred prior to the alleged culpable conduct of PMM. Similarly, Count I plaintiffs that purchased their securities prior to PMM's alleged discovery of the bogus policies have failed to state a claim against this defendant. The mistaken identity of PMM's client has already been discussed. See n. 20, supra. PMM's motions for dismissal, a more definite statement, and for sanctions, therefore, are denied, except that Count XII claims against this defendant, and Count I claims based on purchases by plaintiffs prior to PMM's discovery of the bogus policies are dismissed, and the plaintiffs will be required to set out the claims against PMM in more detail concerning PMM's 1970 investigation of EFLIC, including identification of the client for whom that investigation was undertaken, the date of discovery or the investigation, if known, and the specific securities laws under which these claims are made.\n\nMilliman \u0026 Robertson, Inc., Actuary\n\nThis defendant is named as an aider and abettor to the alleged fraud in Count I through V and XII of the Complaint. Elsewhere, the Complaint describes Milliman \u0026 Robertson, Inc. (hereinafter \"Milliman\"), as an actuarial firm that rendered opinions in support of EFLIC's reported calculations of policy reserves, premiums, and accrued costs of recapture of reinsured EFLIC policies from 1966 through 1972. These opinions were disseminated with and incorporated into the prospecti of EFCA, proxy materials sent to the BNL and Liberty shareholders in connection with EFCA's acquisition of those two companies, and other unspecified financial documents filed with the S.E.C. According to the Complaint Milliman knew, or, in the exercise of due care, would have known, about the fraud at EFLIC. Milliman also knew its prepared opinions about EFLIC operations would be disseminated to and have an effect on the investing public. The plaintiffs contend they have stated claims against Milliman under § 11, § 12(2), and § 17 of the 1933 Act, and under § 10(b) and § 18 of the 1934 Act.\n\nMilliman provides little independent analysis of the claims made against it in the Complaint, but joins in the motions of the trading defendants and Seidman \u0026 Seidman. The court finds the Complaint states a claim against Milliman in all Counts in which it is named, and under each of the securities law sections on which plaintiffs rely, except no Count I plaintiff purchasing its EFCA securities prior to the time at which Milliman became engaged by EFLIC has stated a claim against this defendant, and § 12(2) claims against this defendant are dismissed because Milliman is not a \"seller\" of securities within the meaning of that section.\n\n§ 11 claims are made out against Milliman because the description of the actuary provided by the Complaint falls within the class of entities \"whose profession gives authority to a statement made by him.\" See § 11(a)(4), and the opinions prepared by Milliman appeared in EFCA registration statements, with Milliman's consent. This liability is limited to those who purchased EFCA securities so registered during the period subject to the statute. § 12(2) claims have not been stated against Milliman because it was not a \"seller\" of securities, and aiding and abetting principles articulated earlier in this opinion do not apply to that section. § 17 liability of this firm is alleged only as described in footnote 16 above. The Complaint clearly alleges false and misleading statements by Milliman or those Milliman knowingly assisted, \"in connection with the sale or purchase of a security,\" and otherwise alleges the elements necessary to sustain claims under § 10(b) and Rule 10b-5. The § 18 claims against Milliman are adequately stated, at least with respect to the proxy materials published in connection with the BNL and Liberty transactions. To the extent plaintiffs base their § 18 claims on the other unspecified filings with the S.E.C., the Complaint fails to state those claims with adequate particularity. The motion of Milliman, therefore, is denied, except that the Count I claims brought on behalf of persons who purchased their EFCA securities prior to 1966 cannot be maintained, the § 12(2) claims are dismissed in their entirety, and the § 18 claims based on any filings not identified in the Complaint are dismissed.\n\nNew York Stock Exchange, Inc. and American Stock Exchange, Inc.\n\nThese two national securities exchanges are named as aiders and abettors to the EFCA fraud in Counts I through V and XII of the Complaint. Plaintiffs base these claims on § 6 and § 10(b) of the 1934 Act. The substance of these claims appears in Paragraph 35 of the Complaint wherein it is alleged these defendants breached a duty they owed to investigate, regulate, and inspect the practices of those who list and trade securities through the facilities of their exchanges. By their failure to exercise reasonable care in the performance of these duties, the Complaint says the exchanges allowed the EFCA fraud to continue undetected. Paragraph 35 asserts these exchanges hold themselves out to the investing public as having minimum requirements for the companies listed on the exchanges, but EFCA securities were listed although the company did not meet those requirements.\n\nThe American Stock Exchange, Inc., has moved for dismissal of the claims against it for failure to plead fraud with Rule 9(b) particularity and for failure to state a claim under either § 6 or § 10(b). The New York Stock Exchange, Inc., has joined in the motion of the trading defendants only, insofar as that motion is directed at the failure of the Complaint to plead fraud with Rule 9(b) particularity, to comply with Rules 8 and 11, and to accurately reflect the claims made in the underlying complaints. Although the contentions of the New York Stock Exchange have been discussed earlier in the opinion with regard to principles of general application to the Complaint, the court believes the American Stock Exchange motion raises separate issues relevant to the claims made against both of the national stock exchanges, and the stance of both of these defendants in this litigation will be discussed here.\n\n§ 6(b) of the 1934 Act requires securities exchanges to adopt rules that \"include provision for the expulsion, suspension, or disciplining of a member for conduct or proceeding inconsistent with just and equitable principles of trade . . .\" § 6(a) of the 1934 Act requires the exchange to agree, as a prerequisite to registration as an exchange, \"to enforce so far as is within its powers compliance by its members\" with the 1934 Act and \"any rule or regulation made or to be made thereunder.\" The exchanges are liable to investors under § 6(b) for failure to enforce certain of their rules adopted pursuant to that section. Colonial Realty Corp. v. Bache \u0026 Co., 358 F.2d 178 (2 Cir. 1966), cert. den. 385 U.S. 817, 87 S. Ct. 40, 17 L. Ed. 2d 56 (1967); Baird v. Franklin, 141 F.2d 238 (2 Cir. 1944), cert. den. 323 U.S. 737, 65 S. Ct. 38, 89 L. Ed. 591 (1945); Marbury Management, Inc. v. Alfred Kohn, Wood Walker \u0026 Co., 373 F. Supp. 140 (S.D.N.Y.1974); Pettit v. American Stock Exchange, 217 F. Supp. 21 (S.D.N.Y.1963).\n\nThe plaintiffs, however, do not contend the stock exchanges failed to enforce any of their § 6(b) rules with regard to EFCA. Rather, the claims against the stock exchanges are based on § 6(c) of the 1934 Act, which allows the exchanges to adopt and enforce any other rule \"not inconsistent with\" the Act, rules and regulations thereunder, or state law. The parties have cited no cases that rule directly one way or another on whether a private damage action may be maintained against a stock exchange for failure of the exchange to enforce voluntary rules adopted pursuant to § 6(c). Both defendant exchanges have established procedures and requirements for the listing and delisting of securities on their exchanges. The failure of the exchanges to make sure EFCA met those requirements before and during the time its securities were listed with the exchanges is the apparent basis for the plaintiffs' claims against both of these defendants under both § 6 and § 10(b). These claims are dismissed, because even were the court to hold a private remedy is available against the exchanges for failure to enforce their rules relating to the listing of securities, the Complaint does not adequately allege either exchange breached its duty to enforce those rules.\n\nA reading of the requirements and procedures related to the listing of securities on either exchange, See CCH American Stock Exchange Guide Para. 10,001, et seq. and CCH New York Stock Exchange Guide, Para. 2495, et seq. does not reveal any rule, requirement, or procedure, formal or informal, that requires either exchange to make an independent investigation or inspection of a company with listed securities or a company making application to list securities on the exchange. The exchange rules require applying companies to file reports, financial statements, prospecti, and proxy statements, among other things, with the exchanges when the company applies for a listing. The rules also require companies to file reports and statements with the exchanges as required by the S.E.C. and other rules once they are listed. Companies must also follow the registration requirements of § 12 of the 1934 Act in order to get their securities listed. The American Exchange does have a procedure by which all financial statements provided are referred to \"consulting accountants\" for review as to form, content, and accounting procedures, but this procedure does not require any independent audit or inquiry of the company by the exchange accountants. The Complaint does not allege the exchanges did not enforce their rules related to the filing of statements, reports, or other items with regard to EFCA prior to or after listing. Such filings were made, but contained false statements. The Complaint, therefore, fails to allege either exchange breached its duty to enforce any rule with regard to the listing of EFCA securities on the exchange.\n\nPlaintiffs also argue that because they have alleged EFCA was in fact without assets, earnings, or value as required by the exchanges' listing standards, the listing of EFCA securities amounted to a failure to enforce those standards and is actionable under § 6(c) of the 1934 Act. Like the listing procedures, however, these standards place no duty on the exchanges to do more than rely on the filings made by the company itself. If the exchanges had discovered the true financial condition of EFCA, they would have been obligated to disclose that information and delist the corporation, either pursuant to their own rules, or possibly § 10(b) or Rule 10b-5. The basis for plaintiffs' claims here, however, is that the exchanges did not discover the true financial condition of EFCA. The Complaint does not assert the exchanges knew about the fraud nor does the Complaint show the exchanges breached a duty of inquiry or disclosure they owed the plaintiffs or anyone else. Thus, all claims against the exchanges are dismissed for failure to state a claim. Hochfelder v. Midwest Stock Exchange, 503 F.2d 364 (7 Cir. 1974), cert. den. 419 U.S. 875, 95 S. Ct. 137, 42 L. Ed. 2d 114 (1975).\n\nThe State Defendants\n\nThe Complaint asserts claims against California and Illinois and against state administrative officers and agencies charged with the responsibility, under state laws, of regulating, investigating, and inspecting insurance companies that do business there (referred to collectively herein as the \"state defendants\"). EFLIC did business in the two states from 1968 (Illinois) and 1969 (California) through March, 1973. The state defendants did not discover or know about the EFCA and EFLIC scheme during this period, allegedly because they breached a duty of reasonable inquiry they owed the public under state laws and regulations unspecified by the Complaint. These defendants are named as aiders and abettors in Counts I through V and XII of the Complaint, and plaintiffs now say these claims are based on § 17 of the 1933 Act and § 10(b) of the 1934 Act. All these defendants move for dismissal of all claims made against them in the Complaint. These motions are granted in their entirety.\n\nMost of the claims made in the Complaint against these defendants fail as a matter of statutory interpretation. The § 17(a) claims must be dismissed in accordance with the principles stated in footnote 16 of this opinion, as to each of these defendants. Furthermore, the states themselves and their agencies do not fall within the class of \"persons\" who may be liable under § 10(b) of the 1934 Act. \"Person,\" for purposes of determining who may be liable under § 10(b), is defined in § 3(a)(9) of the 1934 Act as:\n\n\". . . an individual, a corporation, a partnership, an association, a joint-stock company, a business trust, or an unincorporated organization.\"\n\nThis is in contrast to § 2(2) of the 1933 Act that includes \"a government or political subdivision thereof\" within its definition of \"person.\" The definition of \"person\" provided by § 3(a)(9) simply does not encompass states or their agencies. It could hardly be argued \"aider and abettor\" liability can be imposed under § 10(b) on entities not within the scope of principal liability under the statute, because not \"persons\" under § 3(a)(9).\n\nAnother reason for dismissal of the claims against the states and their agencies, and the foremost reason for dismissal of the claims against the state officials is the states' sovereign immunity as expressed in the Eleventh Amendment to the United States Constitution. See Edelman v. Jordan, 415 U.S. 651, 94 S. Ct. 1347, 39 L. Ed. 2d 662 (1974); Employees v. Department of Public Health and Welfare, 411 U.S. 279, 93 S. Ct. 1614, 36 L. Ed. 2d 251 (1973). Federal damage claims against the states, state agencies, and state officials named in their official capacities are barred by that doctrine in this case, and plaintiffs' reliance on Parden v. Terminal R. Co., 377 U.S. 184, 84 S. Ct. 1207, 12 L. Ed. 2d 233 (1964), is misplaced. According to the constitutional interpretations provided by the Supreme Court in Edelman and Employees, in order to be susceptible to a damage suit in federal court, the state must waive its Eleventh Amendment immunity or consent to the suit, either by its unequivocal conduct or by its words. That waiver or consent must also be made meaningful by explicit congressional authorization of damage suits against a \"class of defendants which literally includes States.\" Edelman v. Jordan, supra, 415 U.S. at 672, 94 S. Ct. at 1360, 39 L. Ed. 2d at 678. In Parden v. Terminal R. Co., supra, the state had operated an interstate railroad business and was held liable under a pre-existing federal statute the Court found authorized damage suits against all common carriers by railroad in interstate commerce. Parden is clearly distinguishable from the § 10(b) claims in the present case, because Congress literally excluded states from the class of \"persons\" who can be sued under § 10(b). \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" Furthermore, neither § 17 of the 1933 Act nor § 10(b) of the 1934 Act explicitly allow private damage suits against anyone. See Blue Chip Stamps v. Manor Drug Stores, supra. Suits by one private party against another under these provisions have been allowed by the courts \"in order to effectuate a statutory purpose,\" and, as such, are not the type of suits authorized by the statute considered or the decision made in Parden. See Edelman v. Jordan, supra, 415 U.S. at 673-74, 94 S. Ct. at 1361, 39 L. Ed. 2d at 678-79. The claims made against the state defendants must be dismissed, therefore, because Congress has not authorized such suits by enactment of § 17 of the 1933 Act or § 10(b) of the 1934 Act.\n\nEven if Congress authorized damage suits against states under § 10(b) of the 1934 Act or § 17(a) of the 1933 Act, Cf. United Housing Foundation v. Forman, 421 U.S. 837, 866, n. 6, 95 S. Ct. 2051, 2067-68, 44 L. Ed. 2d 621, 639-40 (1975) (Justices Brennan, Douglas and White, dissenting), the states here did not, by their conduct, waive their Eleventh Amendment immunity or consent to the suit. Mere regulation or investigation of private and corporate commercial conduct by a state government, even where publication of information about corporations that issue securities in part of the regulatory scheme, does not constitute a waiver of the state's sovereign immunity. The states here did not issue, underwrite, sell, or otherwise promote the sale of EFCA securities in any way. Nor do the statutory provisions that set up insurance regulation systems in either state explicitly provide for damage suits against the states. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\" Compare, United Housing Foundation v. Forman, supra, 421 U.S. at 966, n. 6, 95 S. Ct. at 2067-68, 44 L. Ed. 2d at 639-40. In the area of insurance industry regulation, delegated in large part to the states by Congress, See 15 U.S.C. § 1011, et seq., mere regulatory activity by a state does not express or imply consent to suit or waiver of immunity under the 1933 or 1934 Acts.\n\nFor all the reasons stated above, the claims made against the state defendants are dismissed in their entirety. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\"\n\nPennsylvania Life Company Subsidiaries, Officers and Agents\n\nThe Complaint names Pennsylvania Life Company (hereinafter \"PLC\"), certain of its subsidiaries -- Pennsylvania Life Insurance Company (\"PLIC\"), and Penn General Agencies, Inc., \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\" (\"PGA\") -- and five individual officers and directors of PLC and the subsidiaries as aider and abettor defendants in Counts I through V and XII of the Complaint. These defendants will be referred to collectively as the \"Penn Life defendants.\" Paragraph 44 of the Complaint alleges EFLIC and PLIC co-insured EFLIC policies in 1968 and asserts the Penn Life defendants thereafter discovered EFLIC had given this insurance to its employees and agents without payment of first year premiums. The insurance developed an abnormally high lapse rate. The Penn Life defendants also discovered EFLIC had induced purchase of EFLIC policies and cancellation of PLIC policies by PLIC policy-holders. According to the Complaint, the Penn Life defendants \"threatened to disclose the conduct of EFLIC which they had discovered unless PLIC was compensated for non-disclosure of same.\" Bankers National Life, by that time a subsidiary of EFCA, then repurchased EFLIC insurance sold to PLIC for 230% of the scheduled annual premiums, although BNL and the Penn Life defendants knew the insurance was of little or no value.\n\nBy separate agreement, PGA agreed with another EFCA subsidiary, Equity Casualty, to purchase Equity Casualty's net income for a period of nine years. PGA gave its promissory note for $2.5 million, dated December 30, 1971, with annual installments to begin in 1973 in payment thereon. This note was given in exchange for the income purchase agreement. The note and the purchase agreement provided for an equation by which payment on the note would be substantially the same as the income of Equity Casualty should that income have been less than the maximum installment due on the note. The Penn Life defendants allegedly knew the maximum payments by PGA on the note would not exceed $2,500 per year. The Complaint asserts EFCA's consolidated financial statements for 1971 represented the promissory note as income for that year. The Complaint goes on to state the Penn Life defendants knew the 1971 PGA note would be reported as income for 1971 by EFCA at face value, asserts the defendants knew these \"earnings\" would affect the market value of EFCA securities and characterizes the earnings of EFCA represented by these transactions as \"fictitious and unjustified.\"\n\nThe plaintiffs contend they have stated claims against all the Penn Life defendants under § 17 of the 1933 Act and § 10(b) of the 1934 Act. Plaintiffs' theory of the Penn Life defendants' liability has two aspects. First, say the plaintiffs, these defendants are liable as aiders and abettors to the EFCA fraud because they knew about the fraud and not only remained silent, but demanded and took part in commercial transactions with EFCA and its subsidiaries -- the resale of the valueless policies to BNL -- to avoid harm done them by the fraud and reap profit at the expense of EFCA investors. Second, plaintiffs argue, the exchange of the PGA note for the income of Equity Casualty and the subsequent reporting of the note by EFCA as income establish an independent basis for recovery from the Penn Life defendants as direct participants in the fraud at EFCA.\n\nThe corporate Penn Life defendants have filed a joint motion to dismiss all the claims made against them in the Complaint, and the individual officers and directors have filed a separate motion for dismissal. A number of grounds are offered in support of these motions, \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\" the most important of which are (1) that Counts II through V and Count XII claims against these defendants must be dismissed because they purport to state claims on behalf of plaintiffs who made their purchases of EFCA securities prior to the time at which these defendants are alleged to have engaged in any unlawful activities; and (2) that the Complaint fails to state any claim against these defendants under § 10(b) or Rule 10b-5 because these defendants are not alleged to have breached any duty they owed to plaintiffs under the statute or Rule. For the reasons that follow, the court will dismiss the Counts II through V and XII claims made against the Penn Life defendants, but will sustain the Count I claims made against them insofar as those claims are brought on behalf of those who purchased their EFCA securities subsequent to December 30, 1971.\n\nThe dismissal of all but the Count I claims against these defendants is based on the principles described at pages 17 through 20 of this opinion and certain considerations of convenience. As argued by defendants, there are no allegations in the Complaint that these defendants engaged in any conduct actionable under the federal securities laws prior to the dates of the transactions on which those Counts are based. Although neither the Complaint nor the opposition to the defendants' motions makes clear the date of the Penn Life defendants' discovery of any wrongdoing at EFCA, it is apparent from the pleadings the plaintiffs do not rely on that discovery, standing alone, as the basis for imposing Rule 10b-5 liability on these defendants. Rather, it is the combination of that discovery with subsequent transactions undertaken to facilitate concealment of aspects of the EFCA securities fraud for the benefit of both EFCA and the Penn Life defendants on which these claims rest. None of these transactions are alleged to have taken place prior to December 30, 1971. The only ground on which plaintiffs assert liability of these defendants to plaintiffs who made their purchases before the 1971 transactions is the rejected theory of aider and abettor liability that would hold such defendants liable for acts of the principals that occurred before the aider and abettor became involved in any wrongdoing. This Court has denied that theory of recovery, and it need not be discussed at length here. The Court does note, however, that some Count III plaintiffs arguably purchased their debentures after the December 30, 1971, date. To the extent the Count III plaintiffs have stated a claim against the Penn Life defendants based on purchases subsequent to December 30, 1971, those claims are merely redundant of the same claims stated by the same plaintiffs in Count I of the Complaint, and will be dismissed on that ground. The Count I claims made against the Penn Life defendants for purchases made prior to the December 30, 1971, date are, of course, dismissed for failure to state a claim on the same grounds as the Counts II through V and Count XII claims.\n\nThe Count I claims made against the Penn Life defendants by those who made their purchases after December 30, 1971, will be allowed to remain in the Complaint. Defendants argue these claims must be dismissed because no false or misleading statements by the Penn Life defendants in connection with the purchase or sale of any EFCA security have been alleged, and defendants owed no duty of disclosure to plaintiffs, the breach of which would be actionable under Rule 10b-5, even if the defendants knew about the EFLIC free insurance program and the questionable accounting of the 1971 PGA promissory note. See White v. Abrams, 495 F.2d 724 (9 Cir. 1974); Wessel v. Buhler, 437 F.2d 279 (9 Cir. 1971). If this argument is meant to state that mere inaction or failure to disclose information about a Rule 10b-5 violation is not a ground for liability absent some special relationship between the aider and abettor and either the plaintiff or the principal defendant, this Court agrees with that statement. On the other hand, the allegations attacked do more than assert mere failure to disclose certain questionable aspects of EFCA and EFLIC operations. The Complaint states that the insurance policy repurchases, the PGA-Equity Casualty promissory note transaction, and the later reporting of that transaction were undertaken by EFCA with the knowing compliance and participation of the Penn Life defendants in order to prevent disclosure of what are allegedly important aspects of the EFCA fraud. At the present stage of this litigation this Court finds these allegations sufficient to survive the motion to dismiss made by the Penn Life defendants.\n\nFidelity Corporation\n\nFidelity Corporation is named as a defendant in Count V of the Complaint. The thrust of the BNL plaintiffs' claims against Fidelity is that as a controlling shareholder of BNL, Fidelity initiated and induced the EFCA acquisition of BNL in order to avoid certain liabilities arising out of the transactions by which Fidelity gained control of BNL. In these circumstances, argue the BNL plaintiffs, Fidelity owed them a duty to investigate EFCA in connection with the acquisition. If Fidelity had fulfilled its obligations to the other BNL shareholders, says the Complaint, it would have discovered the EFCA fraud, and the BNL-EFCA exchange would not have taken place. Plaintiffs contend they have stated claims against Fidelity under § 17(a) of the 1933 Act, and § 10(b), § 14(a), and § 18 of the 1934 Act.\n\nBy its motion to dismiss for failure to state a claim, Fidelity argues it did not know about the fraud and owed no duty to other BNL shareholders to investigate EFCA in connection with the acquisition, absent some circumstances that would have put it on notice of the fraud. Fidelity relies on Northway, Inc. v. TSC Industries, Inc., 512 F.2d 324 (7 Cir. 1975), rev'd, 426 U.S. 438, 96 S. Ct. 2126, 48 L. Ed. 2d 757 (1976), and Insuranshares v. Northern Fiscal Corp., 35 F. Supp. 22 (E.D.Pa.1940). Both cases are distinguishable from the claims made against Fidelity in the present Complaint. Unlike the defendants in Northway and Insuranshares, Fidelity is alleged not only to have sold its controlling interest in BNL, but also to have taken an active part in initiating and inducing the exchange of the other BNL stock for worthless EFCA securities. In Northway, the defendants had sold their control to a corporation that subsequently induced the liquidation and sale of the plaintiff corporation by means of false and misleading proxy and other statements. In Insuranshares the defendants had sold their control to defendants who subsequently looted the plaintiffs' corporation. Both cases held defendants who sold their control to a corporation owed a duty to the other shareholders to investigate the buyer of the control interest, but found the duty had been satisfied. Both opinions indicate an unwillingness to hold sellers of control liable for subsequent unlawful acts by the purchasers of control where the original control seller had no reason to anticipate that future unlawful conduct at the time of the original sale. In the present case, where the Complaint alleges Fidelity not only sold its controlling interest in BNL, but also assisted EFCA in its exchange of worthless EFCA shares for valuable BNL stock held by plaintiffs, Fidelity's liability to other shareholders of BNL could rest on two different theories under § 10(b) and Rule 10b-5. Fidelity can be liable as an aider and abettor of EFCA's fraud on the BNL stockholders because its controlling interest imposes a special duty of inquiry when recommending the exchange transaction, the breach of which is actionable by the BNL plaintiffs under the rationale of Hochfelder v. Ernst \u0026 Ernst, supra, or Fidelity can be liable as a principal for its active part in the BNL-EFCA exchange under the applicable duty standard expressed in White v. Abrams, 495 F.2d 724 (9 Cir. 1974). The Complaint states a claim against Fidelity on behalf of the other BNL plaintiffs under either theory, although a more critical analysis of Fidelity's role in the BNL-EFCA exchange could well absolve Fidelity of any liability once the factual circumstances are developed at the summary judgment stage of these proceedings. Fidelity's motion does not address the issue of Fidelity's liability under § 17(a), § 14(a), § 18, or common and state law. The court expresses no opinion on the issue of such liability. Fidelity's motion to dismiss for failure to state a claim is, therefore denied.\n\nThe National Banks\n\nFirst National City Bank, along with Wells Fargo Bank, National Bank of North America, and Franklin National Bank (the \"colending banks\"), are named as defendants in Counts VI and IX of the Complaint. Both counts arise out of a credit arrangement, under which the banks loaned EFCA $50 million. EFCA put up the securities of EFLIC, BNL, and Northern Insurance Company as collateral for the loan. At the time FNCB acted as lender and loan manager in this transaction, it was the Indenture Trustee on the 5 1/2% convertible subordinated debentures issued by EFCA in December, 1971. The Complaint asserts FNCB breached its fiduciary duty to the debenture holders by allowing the imposition of a secured lien on the securities owned by EFCA to take preference over the debentures. The Complaint further states the colending banks are liable to the plaintiffs because those banks induced FNCB to breach its fiduciary obligations and because FNCB was their agent, co-venturer, and co-partner in the loan transaction. According to the Complaint, all these defendants knew or should have known the Insurance Commissioners of New Jersey and New York had forbidden the pledge or hypothecation of the BNL stock by EFCA, as accomplished by defendants.\n\nCount VI of the Complaint purports to state a claim against these banks on behalf of plaintiffs who exchanged their BNL stock for EFCA securities in 1971. They ask this Court to declare the lien imposed on the BNL stock void and of no effect. This claim must be dismissed because the court lacks subject matter jurisdiction over the claims made. The district court overseeing the EFCA reorganization has ruled it will exercise summary jurisdiction over the claims made to the BNL stock. In re Equity Funding Corporation of America, 396 F. Supp. 1266, 1277 (C.D.Cal., 1975). The exercise of summary jurisdiction by the bankruptcy court and the concomitant stay it has issued against all claims made against BNL, are proper. This court concludes, therefore, it is without subject matter jurisdiction to hear the claims for equitable relief made in Count VI of the Complaint, and those claims are dismissed.\n\nThe Count IX plaintiffs are holders of the 5 1/2% debentures. They ask this Court to declare the sums owned by EFCA to the banks junior and subordinate to the sums owed the debenture holders. Again, this court is without power to grant the relief requested because all such claims are now properly before the bankruptcy court. The plaintiffs concede this point, but in their opposition to the present motions they assert they have stated federal claims for damages against the banks under § 17 of the 1933 Act, § 10(b) of the 1934 Act, and § 315 of the Trust Indenture Act of 1939, as amended, 15 U.S.C. § 77000. The basis for these claims is the allowance by the banks of the preferred lien on the EFCA-owned securities in disregard of the rulings of the state insurance commissioners. This will result in less than full recovery by the 5 1/2% debenture holders in the EFCA reorganization proceedings, say the plaintiffs, and thus they have federal and state damage claims against each of the banks for the amount so lost. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\" For the reasons given below, the court finds the Count IX plaintiffs have stated a federal claim against FNCB that gives this court jurisdiction to hear that and the pendent claims stated against FNCB. Count IX states no federal claim against the colending banks, however, as discussed below.\n\nUntil recently, the federal courts have not considered the question of whether a private right of action exists on behalf of an injured debenture holder against an Indenture Trustee under the Trust Indenture Act. In Caplin v. Marine Midland Grace Co., 406 U.S. 416, 92 S. Ct. 1678, 32 L. Ed. 2d 195 (1972), the Supreme Court left the issue open. In an opinion published subsequent to oral argument on the motions directed to the pleadings in this litigation, a New York federal district court specifically held a federal private right of action does exist under § 315 of the Trust Indenture Act. Morris v. Cantor, 390 F. Supp. 817 (S.D.N.Y.1975). On facts similar to those set out in this Complaint, Morris held the mere extension of credit by the Indenture Trustee to the issuer of debentures does not create a federal private right of action on behalf of the debenture holders, but the court went on to find that \"knowing, intentional action in flagrant disregard of the interest of the bondholders. . .\" in the extension of such credit can form the basis for a claim by debenture holders under § 315(d) of the Trustee Indenture Act. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\" Given the allegation in the Complaint that FNCB knowingly allowed the unlawful pledge or hypothecation of BNL stock as collateral in the loan transaction and the Complaint's assertion that this conduct caused harm to the debenture holders, this court finds the Complaint states a claim against FNCB under § 315(d) of the Trust Indenture Act. Morris v. Cantor, at 824. This claim provides a basis for federal jurisdiction pursuant to 15 U.S.C. § 77vvv. Ibid., at 822. FNCB's motion to dismiss the Count IX claims made against it for lack of subject matter jurisdiction is, therefore, denied, although the Count IX plaintiffs will be limited to recovery of damages, should they prevail. Since the federal claims made against FNCB are substantial, and the state and common law claims are based on the same transactions as the federal claims, this Court will exercise jurisdiction over the pendent claims asserted against FNCB in Count IX.\n\nThe motions of the colending banks to dismiss for lack of subject matter jurisdiction, however, will be granted in their entirety. The Complaint does not state a claim against these banks under the Trust Indenture Act or any other federal law, and the plaintiffs have asserted no other basis for exercise of federal jurisdiction over the claims against these banks. It does not appear to this court that the Trust Indenture Act imposes any duties on third parties such as the colending banks, and the plaintiffs have neither shown nor argued any such duty exists. Thus, 15 U.S.C. § 77vvv does not provide this court with jurisdiction over the claims made against the colending banks. The only other claimed basis for subject matter jurisdiction over these claims is the doctrine of pendent jurisdiction, which this court declines to exercise in the present circumstances. The Count IX claims made against the colending banks are, therefore, dismissed.\n\nDov Amir\n\nThis defendant is one of a number of \"EFCA fiduciaries\" named as officers and directors of EFCA in Counts I through V and XII of the Complaint. The only alleged basis for liability of these defendants, including Amir, is that they failed to exercise reasonable care in the \"conduct and supervision of the business affairs of EFCA and its subsidiaries.\" There are no specific allegations that these officers and directors knew about the fraud, or that they breached any duty of inquiry they owed to the plaintiffs. Thus, the Complaint fails to state a claim against defendant Amir under either the aiding and abetting principles stated above and set out in Hochfelder v. Ernst \u0026 Ernst, supra, or under any other theory of liability under the federal securities law. The federal claims made against Dov Amir, should be, and are, therefore, dismissed in their entirety for failure to state a claim, and with the federal claims, the pendent claims asserted must also fall for lack of jurisdiction.\n\nThe court has previously issued tentative rulings on the motions discussed in this opinion. This opinion and the rulings expressed herein are intended to and do supersede those tentative rulings. The defendants' motions discussed herein are hereby granted in part and denied in part in accordance with this opinion.\n\nIT IS SO ORDERED.\n\n\u003cspan class=\"fn\"\u003e1. On April 5, 1973, in the Central District of California, EFCA filed a petition under Chapter X of the Bankruptcy Act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Many of these were hastily drawn and filed in April, 1973 on the basis of newspaper accounts of the alleged fraud. At the time of the original transfer of the actions to this court by the Judicial Panel on Multidistrict Litigation, there were approximately 69 actions pending in a total of six districts around the country. Since the original transfer order, the number of actions filed has risen to more than one-hundred, and the number of districts from which transfers have been made has also increased. The majority of the actions were originally filed in either the Southern District of New York or the Central District of California.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. This pleading device was used to organize and clarify the proceedings in both the Central District of California and the Southern District of New York prior to the transfer order of the Judicial Panel. The consolidated pleadings in these two districts were superseded by the Panel order.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. 15 U.S.C. § 77v(a). This chapter is referred to hereinafter as the \"1933 Act,\" and its provisions are designated by their chapter number.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. 15 U.S.C. § 78aa. This chapter is referred to hereinafter as the \"1934 Act,\" and its provisions are designated by their chapter number.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. These will be described in more detail below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Hereinafter, the well-pleaded allegations of the Complaint are taken as true for purposes of the motions brought pursuant to Fed.R.Civ.Pro.12(b)(6). Walker Proc. Equip. v. Food Mach. and Chem. Corp., 382 U.S. 172, 174-75, 86 S. Ct. 347, 349, 15 L. Ed. 2d 247, 249-50 (1965).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Elsewhere in the Complaint this term is defined as \"any purchaser who purchased their EFCA security on the open market.\" Many of the named plaintiffs defined as \"purchasers of EFCA securities\" do not give any specific date of purchase, and do not specifically state they \"purchased \"securities. Certain defendants assert this renders the Complaint inadequate to state claims under the provisions of the 1933 Act and the 1934 Act that require a purchase of securities to afford standing. A \"purchaser\" is \"one who purchases,\" and the specific date of purchase can be a matter for discovery. Thus, these contentions are without merit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Fidelity is one of these named plaintiffs. See footnote 11, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Aside from the list of \"federal securities laws\" that appears in Paragraph 5 of the Complaint, none of the counts set out the statutory basis for these federal claims by reference to specific provisions of the 1933 Act or the 1934 Act. Defendants contend this requires either a more definite statement of the particular provisions or dismissal of the claims because of vague pleading. In their opposition to the present motions, plaintiffs have stated the provisions of the 1933 Act and 1934 Act on which they rely to make claims against each defendant. This court is of the opinion that plaintiffs are required to give, in the Complaint, the specific provisions on which they base their claims against each defendant. A more definite statement will be required of plaintiffs, therefore, that sets out these provisions. For the purpose of convenience in ruling on the present motions, however, the court will assume the \"federal securities laws\" allegations of the Complaint refer only to those provisions described in plaintiffs' opposition. Claims based on other statutory provisions are dismissed for failure to state a claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. In any event the remedy for such prejudice is severance of the discrete claims from the consolidated claims. Katz v. Realty Equities, supra; Garber v. Randell, supra. Plaintiffs have avoided such prejudice to a great degree by severing, prior to the time the Complaint was filed, most of the actions that would have been prejudiced by integration. The one exception brought to the attention of the court thus far is the Count V claim against Fidelity Corporation by the other BNL purchasers. Fidelity has filed a motion that asks for severance of the claims made against it from the Complaint. This motion will be the subject of a separate severance order, because the inclusion of those claims in the same Complaint with Fidelity's claims against other defendants prejudices Fidelity's rights to prosecute its own claims and litigate its defenses to the BNL claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. At the conclusion of these pretrial proceedings this court will fashion pretrial conference orders pursuant to Fed.R.Civ.Pro. 16 that will preserve for trial and judgment, if proper, the separate identity of the actions consolidated here for pretrial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. This case has now been argued and submitted to the United States Supreme Court. See 44 U.S.L.W. 3343 (December 9, 1975).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. For an exception, see footnote 10, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. John Pennish, a primary defendant, named as an EFCA executive Vice President, also moves for dismissal of the claims made against him in Counts I through V and XII of the Complaint. He has filed an affidavit disclaiming knowledge of the scheme and asserting that he stopped working for EFCA sometime in 1970 and signed only one 1969 EFCA registration statement. These are factual matters inappropriate for consideration prior to discovery in this litigation. The motion of this defendant is, therefore, denied, without prejudice to renewal later on.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The plaintiffs also assert claims under § 17(a) of the 1933 Act. The existence of a right to a private damage action under § 17(a), and the scope of such a right if it exists, is the subject of much judicial controversy. See e.g., Globus v. Law Research Service, Inc., 418 F.2d 1276, 1283-84 (2 Cir. 1969); cert. den. 397 U.S. 913, 90 S. Ct. 913, 25 L. Ed. 2d 93; S.E.C. v. Texas Gulf Sulphur, 401 F.2d 833, 867-69 (2 Cir. 1968, Friendly, J., concurring); Dorfman v. First Boston Corp., 336 F. Supp. 1089, 1093-96 (E.D.Pa.1972); Dyer v. Eastern Trust \u0026 Banking Company, 336 F. Supp. 890, 903-905 (N.D. Me.1971). The plaintiffs argue a right of action exists under § 17(a) that is similar, if not identical for securities purchasers, to the judicially inferred right of action pursuant to § 10(b). The significance of such a § 17(a) right may lie in questions of venue, jurisdiction, remedies available, persons liable, and in the provision of § 17(a) that covers \"the offer . . . of securities.\" Cf. Blue Chip Stamps v. Manor Drug Stores, supra. In any event, the weight of authority, with which this court concurs, suggests a § 17(a) right of action, if it exists for private plaintiffs, is subject to the provisions of § 11 and § 12(2) of the 1933 Act, and does not provide a private right of action for acts proscribed only by § 10(b), as interpreted by the courts. All § 17(a) claims made in this litigation, including those made against the trading defendants, will be subject to these principles as set out in Dorfman v. First Boston Corp., supra. The § 17(a) claims against the trading defendants, are, therefore, dismissed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Based on factual assertions that they did not sell EFCA securities as alleged or on some other ground that would require resolution of issues of fact, a few trading defendants have moved to dismiss all claims stated against them. These motions are premature and will be denied at this time in order to allow completion of discovery prior to a ruling on these issues. Defendants Bank of America and United California Bank will be dismissed, however, since plaintiffs agree there is no factual basis for the claims made against these defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. It is not clear to this court whether or not § 13 reports are within the scope of § 18. § 18 refers to requirements of \"this chapter.\" § 13 may not be of \"this chapter\" as defined by 15 U.S.C. § 78a, et seq. This point has not been briefed to the court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Defendant Arthur Young \u0026 Co. has made a similar motion based on Rules 9 and 11. This motion is denied on the same grounds as the motions of Coopers and the Froggatt partnership. The court has scheduled an early hearing on summary judgment motions for each of these defendants, with provision for adequate discovery on issues relevant to the claims against these defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Phoenix is not, in fact, the client for whom PMM's investigation of EFLIC was undertaken. The client is now said to be Ranger National Life Insurance Co. The claims asserted against Phoenix in the Complaint are, therefore, dismissed in their entirety.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The court has set an early hearing date for PMM's motion for summary judgment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. This particular distinction does not apply to the § 17(a) claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The motion papers of the state defendants make various arguments regarding the import of state statutes authorizing certain types of claims to be maintained against the states through particular procedures. Plaintiffs merely contest the relevance of Calif.Govt.Code § 911.2's requirement that claims against the State of California or its employees be filed with the State Board of Control within 100 days of accrual. By their silence, plaintiffs apparently concede the general tort claims acts of neither state constitute a waiver of sovereign immunity objections to the maintenance of the claims asserted in this forum.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. A factual dispute exists with regard to the timeliness of the claims made against the state defendants. The court does not reach this factual issue in deciding the present motions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Penn General Agencies, Inc. moves to dismiss in part based on what appears to be confusion in the pleadings as to the correct name of this entity, or the correct name of the proper defendant alleged by the Complaint to have taken part in the Equity Casualty promissory note transaction. Although not a ground for dismissal at this time, the plaintiffs will be required to give a more definite statement as to the proper name of this defendant.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The individual officers and directors have moved to dismiss the common law negligence claims asserted against them. Defendant's mere lack of reasonable care, in contrast to knowing participation in the EFCA scheme, is not and cannot be the purported ground for the claims against the Penn Life defendants. The negligence claims against these defendants are, therefore, dismissed in their entirety for failure to state a claim. Other grounds for the motions by either the individual or corporate Penn Life defendants include failure to plead fraud with particularity as required by Rule 9(b), the impropriety of joining these defendants in the Consolidated Complaint, and the need for a more definite statement in the Complaint in order to plead claims against them. The general discussion provided above on these issues, See pp. 9ff., supra, are fully applicable and dispositive of these arguments by the Penn Life defendants.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The plaintiffs contend § 10(b) claims have been stated against these defendants, but the claims against the banks do not arise out of any purchase or sale of securities by plaintiffs. No § 10(b) claims have been stated against the Banks, therefore. Blue Chip Stamps v. Manor Drug supra. Nor does the 14th Amendment provide a basis for relief against these banks, as originally alleged.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Neither Morris nor the parties explored the relationship between § 315(d) and the exceptions of § 315(a), and the court does not address that issue.\u003c/span\u003e\n\n",
    "body_length": 144704,
    "citedas": [
      "416 F. Supp. 161"
    ],
    "attorneys": "Harold A. Abeles, Beverly Hills, California, for Julian S. H. Weiner. , Wyman, Bautzer, Rothman \u0026 Kuchel, Beverly Hills, California, for Daniel J. Disipio, Burton Borman, Stanley Beyer, Joe D. Bain, and G. Phillip Streatfield. , A. Tod Hindin, Hindin, McKay, Levine \u0026 Glick, Beverly Hills, California, for Dov Amir. , John A. Sturgeon, Sheppard, Mullin, Richter \u0026 Hampton, Los Angeles, California, for Wells Fargo Bank. , Gibson, Dunn \u0026 Crutcher, Los Angeles, California, for United California Bank, Peat, Marwick, Mitchell \u0026 Co., Pennsylvania Lifeco., Pennsylvania Life Insurance Co., and Penn General Agencies, Inc. , Nelson, Liker \u0026 Merrifield, Los Angeles, California, for Wolfson, Weiner \u0026 Co., and Wolfson, Weiner, Ratoff \u0026 Lapin. , Stephens, Jones, La Fever \u0026 Smith, Los Angeles, California, for Arthur Young \u0026 Co. , Arthur C. DeGoede, Deputy Atty. Gen. for State of California and State of California Insurance Commissioner. , Nathan Markowitz, Los Angeles, California, for Solomon Block. , Howard P. Miller, Elihu M. Berle, Buchalter, Nemer, Fields \u0026 Savitch, Los Angeles, California, for Equity Funding Corp. of America. , William H. Levit, Jr., Hughes, Hubbard \u0026 Reed, Los Angeles, California, for Coopers \u0026 Lybrand, Philip L. Defliese, Joseph Froggatt \u0026 Co., and Joseph Froggatt \u0026 Co., Inc. , Simon \u0026 Sheridan, Los Angeles, California, for Marlene Goldblum. , Alfred I. Rothman, Albert F. Smith, Loeb \u0026 Loeb, Los Angeles, California, for Haskins \u0026 Sells and Lorin H. Wilson. , James L. Nolan, Adams, Duque \u0026 Hazeltine, Los Angeles, California, for Robert T. Jackson and Phoenix Mut. Life Ins. Co. , Richard A. DeSantis, Los Angeles, California, for Marvin A. Lichtig and Esther Lichtig. , Dryden, Harrington \u0026 Swartz, Los Angeles, California, for John S. Pennish. , Kadison, Pfaelzer, Woodard, Quinn \u0026 Rossi, Los Angeles, California, for Director of Insurance, Dept. of Insurance, State of Illinois. , Fischmann \u0026 Wallerstein, Los Angeles, California, for Phillip J. Wolfson. , Donnelly, Clark, Chase \u0026 Johnson, Los Angeles, California, for American Stock Exchange. , David K. Robinson, Leonard M. Marangi, Hahn \u0026 Hahn, Pasadena, California, for Milliman \u0026 Robertson, Inc. , Burton Y. Weitzenfeld, John F. McClure, Arnstein, Gluck, Weitzenfeld \u0026 Minow, Chicago, Illinois, for The Savings and Profit Sharing Fund of Sears Employees (and Trustees). , William Scott, Atty. Gen. of Illinois, Robert J. O'Rourke, Chicago, Illinois, for State of Illinois. , Leonard Joseph, Dewey, Ballantine, Bushby, Palmer \u0026 Wood, George D. Reycraft, Peter M. Brown, Cadwalader, Wickersham \u0026 Taft, Donald I. Strauber, Chadbourne, Parke, Whiteside \u0026 Wolff, White \u0026 Case, Jerome Londin, Carro, Spandock, Londin, Rodman \u0026 Fass, Samuel E. Gates, Debevoise, Plimpton, Lyons \u0026 Gates, Peter Fleming Jr., curtis, Mallet-Prevost, Colt \u0026 Mosle, Robert A. Meister, Milgrim Thomajan \u0026 Jacobs, P.C., New York, New York, for certain \"trading\" defendants. , Robert E. Kushner, Cole \u0026 Deitz, New York, New York, for National Bank of North America. , John J. Loflin, Lord, Day \u0026 Lord, New York, New York, for American Stock Exchange, Inc. , Jeffrey M. Epstein, Kaye, Scholer, Fierman, Hays \u0026 Handler, New York, New York, for Franklin Nat. Bank. , Bud G. Holman, Kelley, Drye \u0026 Warren, New York, New York, for Delafield Childs, Inc. , Sherman \u0026 Sterling, New York, New York, for First Nat. City Bank. , Milbank, Tweed, Hadley \u0026 McCloy, New York, New York, for New York Stock Exchange, Inc. , Marvin Schwartz, Sullivan \u0026 Cromwell, New York, New York, for L. Jay Tenebaum, Bache \u0026 Co., Inc., Goldman, Sachs \u0026 Co., and New York Securites Co., Inc. , Allen W. Williams, Jr., Foley \u0026 Lardner, Milwaukee, Wisconsin, for Estate of Lynford Lardner, Jr. , Raoul Y. Roth, Sherman Oaks, California, for William Mercado. , Edwin S. Kahn, Alan E. Boles, Holland \u0026 Hart, Denver, Colorado, for Dean J. Boosalis, and Frank M. Zaveral, Jr. , Shoob \u0026 Zalut, Phoenix, Arizona, for Bernard D. Duskin. , John S. Martin, Martin, Obermaier \u0026 Morvillo, New York, New York, for Frank Flaum, Thomas F. Egan, George Mandel, Melvin Bund, Samuel B. Ratoff, Benjamin H. Lapin, Arthur M. Hartzband, and Saul Bruh. , Tom Watson Brown, Huie, Brown \u0026 Ide, Atlanta, Georgia, for Leonard Bagen, J. Rodgers, Robert Gorin, and Pete Fishman. , Marshall B. Grossman, Schwartz, Alschuler \u0026 Grossman, Jack Corinblit, Corinblit \u0026 Shapero, Los Angeles, California, Herbert M. Wachtell, Wachtell, Lipton, Rosen \u0026 Katz, New York, New York, Wayne M. Thomas, Harold E. Kohn, Philadelphia, Pennsylvania, Stanley A. Furman, Feinerman, Furman \u0026 Klein, Beverly Hills, California, Allen D. Black, Fine, Kaplan \u0026 Black, Philadelphia, Pennsylvania, David B. Gold, San Francisco, California, John E. Martindale, Arter \u0026 Hadden, Cleveland, Ohio, Edmond H. Kerr, Cleary, Gottlieb, Steen \u0026 Hamilton, New York City, James F. Pascal, Everett G. Allen, Jr., Hirschler, Fleischer, Weinberg, Cox \u0026 Allen, Richmond, Virginia, James J. Wilson, Diamond, Tilem, Colden \u0026 Emery, Los Angeles, California, for Plaintiffs. Lucas, District Judge.",
    "category": [
      "242",
      "252"
    ],
    "judges": "LUCAS, District Judge.",
    "citation_count": 0
  }
}
