{
  "id": "pIJBPmYBTlTomsSByoKc",
  "document": {
    "title": "O'Dell v. Netherland",
    "full_title": "JOSEPH ROGER O'DELL, III -APPELLEE, v. J. D. NETHERLAND, WARDEN, MECKLENBURG CORRECTIONAL CENTER; RONALD J. ANGELONE, DIRECTOR, VIRGINIA DEPARTMENT OF CORRECTIONS; JAMES S. GILMORE, III, ATTORNEY GENERAL OF THE COMMONWEALTH OF VIRGINIA; COMMONWEALTH OF VIRGINIA -APPELLANTS. JOSEPH ROGER O'DELL, III -APPELLANT, V. J. D. NETHERLAND, WARDEN, MECKLENBURG CORRECTIONAL CENTER; RONALD J. ANGELONE, DIRECTOR, VIRGINIA DEPARTMENT OF CORRECTIONS; JAMES S. GILMORE, III, ATTORNEY GENERAL OF THE COMMONWEALTH OF VIRGINIA; COMMONWEALTH OF VIRGINIA -APPELLEES.",
    "jurisdiction": "Fourth Circuit",
    "date": "1996-09-10T00:00:00.000Z",
    "docket": "No. 94-4013, No. 94-4014",
    "body": "LUTTIG, Circuit Judge:\n\nThe United States District Court for the Eastern District of Virginia vacated the death sentence of Joseph Roger O'Dell III on federal habeas, holding that Simmons v. South Carolina, 512 U.S. 154, 114 S. Ct. 2187, 129 L. Ed. 2d 133 (1994), was not a \"new rule\" under Teague v. Lane, 489 U.S. 288, 103 L. Ed. 2d 334, 109 S. Ct. 1060 (1989), and that O'Dell \"was deprived of due process and subjected to cruel and unusual punishment under the Fifth, Eighth and Fourteenth Amendments to the United States Constitution, because the trial court failed to allow petitioner to rebut the prosecutor's argument as to petitioner's future dangerousness with evidence that he would be ineligible for parole under state law,\" J.A. at 355. The district court also denied numerous other claims of O'Dell's, including his claim that new evidence demonstrates that he is actually innocent.\n\nHeeding the instruction of three Members of the Supreme Court that this case \"should . . . receive careful consideration,\" O'Dell v. Thompson, 502 U.S. 995, 999, 116 L. Ed. 2d 639, 112 S. Ct. 618 (1991) (Blackmun, J., joined by Stevens and O'Connor, JJ.), both the federal district court and now the full en banc court have painstakingly canvassed the record, carefully considering every claim that has been advanced by petitioner. Having done so, we are convinced that O'Dell's claims are without merit and his claim of actual innocence not even colorable. We are likewise convinced that the federal district court erred in concluding that Simmons did not announce a new rule. In California v. Ramos, 463 U.S. 992, 77 L. Ed. 2d 1171, 103 S. Ct. 3446 (1983), every Member of the Supreme Court apparently approved, as constitutionally permissible, the very practice later held unconstitutional in Simmons. The only even arguably contrary authority was a plurality opinion and a single footnote which three Members of the Court believed represented an \"abandonment\" of the due process holding that O'Dell now contends compelled the result in Simmons. In our judgment, Simmons was the paradigmatic \"new rule.\" Accordingly, we affirm the district court's denial of O'Dell's secondary claims and reverse the district court's judgment granting the writ of habeas corpus.\n\nI.\n\nOver ten years ago, on Tuesday, February 5, 1985, 44-year-old Helen Schartner left the County Line Lounge in Virginia Beach around 11:30 p.m. O'Dell left the same nightclub sometime between 11:30 p.m. and 11:45 p.m. The next day, Schartner's car was found in the parking lot of the County Line Lounge, and, around 3:00 p.m., her body was found in a muddy field across the highway from the club. Tire tracks consistent with the tires on O'Dell's car were found near the body. Schartner had been killed by manual strangulation, with a force sufficient to break bones in her neck and leave finger imprints. She also had eight separate wounds on her head consistent with blows from the barrel of a handgun. About 10 days earlier, a handgun with a barrel that could cause wounds like those found on Schartner's head had been seen in O'Dell's car. Seminal fluid was found in Schartner's vagina and anus. Enzyme tests on that fluid revealed that it was consistent with a mixture of O'Dell's and Schartner's bodily fluids. Spermatozoa also found in Schartner's genital swabs and genital scrapings were consistent with O'Dell's.\n\nSchartner's head wounds had bled extensively. Not more than two and a half hours after Schartner left the County Line Lounge, O'Dell entered a convenience store with blood on his face, hands, hair, and clothes. Around 7:00 a.m., O'Dell called his former girlfriend, Connie Craig, and told her he had vomited blood all over his clothes and that he wanted to talk to her before he left for Florida. He then slept all day at Craig's house.\n\nThe next day, Thursday, Craig read the local newspaper account of Schartner's murder, describing how she had last been seen at the County Line Lounge. Remembering that O'Dell customarily visited the County Line Lounge on Tuesday nights, Craig went to her garage and found the paper bag that O'Dell had told her he had left, containing several articles of bloody and muddy clothing. She brought the bloody clothes into the house and called the police.\n\nO'Dell was arrested, and, despite the contrary story he had just told Craig, told the police that the blood on his clothes came from a nose bleed caused by being struck while attempting to stop a fight at another club on the night of February 5. Electrophoretic tests on the dried blood established that the blood on O'Dell's jacket and shirt had the same enzyme markers as Schartner's, a characteristic shared by only three out of a thousand people. O'Dell's blood did not have the same markers. Likewise, dried blood found in O'Dell's car proved consistent with Schartner's but not with O'Dell's. And, hairs found in O'Dell's car were also consistent with Schartner's, but not O'Dell's.\n\nDuring his incarceration, O'Dell confessed to Steven Watson, a fellow inmate, that he had strangled Schartner after she refused to have sexual intercourse with him.\n\nO'Dell was indicted for capital murder, abduction, rape, and sodomy. On his own motion, and after a court-appointed psychiatrist determined him competent, O'Dell quite ably defended himself pro se, with court-appointed attorney Paul Ray serving as standby counsel. O'Dell was tried, and, on September 10, 1986, the jury convicted him on all counts. The next day, the jury fixed his sentence for murder at death. The jury's recommendation of death was based on its finding that both of Virginia's statutory aggravating factors -- future dangerousness and vileness -- had been proven. J.A. at 2506. The trial Judge adopted the jury's recommendation and sentenced O'Dell to death by electrocution for murder and to 40 years for rape and 40 years for sodomy. O'Dell appealed his sentence to the Supreme Court of Virginia, which affirmed the judgment of the Circuit Court. O'Dell v. Commonwealth, 234 Va. 672, 364 S.E.2d 491 (Va. 1988). The Virginia Supreme Court subsequently granted O'Dell's petition for rehearing in order to consider and reject a claim it had previously held to be procedurally barred, after which it again affirmed the conviction. O'Dell v. Commonwealth, Record No. 861219, slip op. (Va. April 1, 1988). The United States Supreme Court denied certiorari on October 3, 1988. O'Dell v. Virginia, 488 U.S. 871, 102 L. Ed. 2d 154, 109 S. Ct. 186 (1988).\n\nO'Dell filed a petition for a writ of habeas corpus in the Circuit Court of Virginia Beach on June 1, 1989, and an amended petition on July 3, 1990, both of which were denied. J.A. at 278-79. O'Dell attempted to appeal the denial to the Virginia Supreme Court, but he erroneously filed an \"Assignments of Error\" with the Supreme Court instead of a \"Petition for Appeal,\" as required by Virginia law. O'Dell attempted to correct the error, but by then the time to file had expired and so the Virginia Supreme Court dismissed his perfected Petition for Appeal as untimely. The United States Supreme Court again denied certiorari on December 2, 1991, with three Justices issuing a statement respecting the denial of certiorari . See O'Dell, 502 U.S. at 995 (Blackmun, J., joined by Stevens and O'Connor, JJ.).\n\nO'Dell then filed this federal habeas petition on July 23, 1992. The district court, Judge James R. Spencer, held a full evidentiary hearing on O'Dell's claim that new DNA evidence established that he was actually innocent. The court rejected that claim, along with numerous others, but vacated O'Dell's death sentence because he had not been allowed to rebut the prosecution's future dangerousness arguments with a showing that he would be ineligible for parole. In so doing, the court held that this rule, announced in Simmons, was not a new rule under Teague. The Commonwealth of Virginia appeals this latter holding, and O'Dell cross-appeals the denial of his numerous other claims.\n\nII.\n\nO'Dell, born in 1941, began his criminal career at age 13 with a juvenile conviction for breaking and entering, followed by five convictions over the next three years for auto theft. By 1958, O'Dell had turned violent. In that year, he was convicted of assault three times and of threatening bodily harm once. The following year, he was convicted of attempted escape from prison. After being released from the penitentiary, he returned five months later when his probation was revoked. He was then convicted of five armed robberies and five unauthorized uses of motor vehicles and sentenced to 24 years in prison. While imprisoned, O'Dell was convicted of second degree murder. In July of 1974, O'Dell was again paroled, whereupon he went to Florida and was promptly convicted of kidnapping and robbery, committed just seven months after his release from prison. The victim in that case testified that O'Dell had struck her several times on the head with his gun, choked her, and held a cocked gun to her head in an attempt to force her to submit to sexual advances. The Florida court sentenced him to 99 years in prison, but, inexplicably, O'Dell was paroled yet again in December of 1983. Fourteen months later, Helen Schartner was murdered.\n\nUnder Virginia law, \"any person convicted of three separate felony offenses of (i) murder, (ii) rape or (iii) robbery by the presenting of firearms or other deadly weapon . . . shall not be eligible for parole.\" Va. Code ยง 53.1-151(B1). O'Dell certainly appears to have had the requisite number of violent felony convictions to be ineligible for parole under Virginia law. Therefore, he requested that he be allowed to respond to the prosecution's arguments of future dangerousness by arguing that he was parole ineligible. J.A. at 2308, 2378-79, 2385-86. As required by Virginia law, however, the trial Judge neither allowed O'Dell to argue his parole ineligibility nor provided the jury with any information regarding O'Dell's ineligibility. J.A. at 2386. See Poyner v. Commonwealth, 229 Va. 401, 329 S.E.2d 815, 828 (Va. 1985) (\"The jury had no right to know what might happen to defendant, in terms of parole eligibility, after sentencing. During the penalty phase it was the jury's duty to assess the penalty, irrespective of considerations of parole.\"), cert. denied, 474 U.S. 865, 106 S. Ct. 189, 88 L. Ed. 2d 158 (1985). Eight years later, the Supreme Court, in Simmons, held that due process requires that a criminal defendant be allowed to argue his parole ineligibility to rebut prosecution arguments of future dangerousness. O'Dell seeks the benefit of the rule of Simmons, and the Commonwealth argues that Simmons announced a new rule under Teague.\n\nA.\n\nThe question of whether a rule is \"new\" for purposes of Teague arises in two different circumstances: first, where, like here, a particular case is decided after petitioner's conviction becomes final, and petitioner seeks the benefit of the rule of that case; and second, where petitioner seeks the extension of longstanding precedent. Cf. Stringer v. Black, 503 U.S. 222, 227-28, 117 L. Ed. 2d 367, 112 S. Ct. 1130 (1992). In both instances, the Teague inquiry is a threshold matter. Graham v. Collins, 506 U.S. 461, 466, 122 L. Ed. 2d 260, 113 S. Ct. 892 (1993); Saffle v. Parks, 494 U.S. 484, 487, 108 L. Ed. 2d 415, 110 S. Ct. 1257 (1990). As the Court held in Caspari v. Bohlen, 510 U.S. 383, 114 S. Ct. 948, 953, 127 L. Ed. 2d 236 (1994), \"if the State . . . argues that the defendant seeks the benefit of a new rule of constitutional law, the court must apply Teague before considering the merits of the claim.\" Therefore, before turning to the merits of O'Dell's claim or attempting to define the precise contours of Simmons, our first inquiry must be whether Simmons announced a new rule under Teague. See also Sawyer v. Smith, 497 U.S. 227, 233-34, 111 L. Ed. 2d 193, 110 S. Ct. 2822 (1990); Wright v. West, 505 U.S. 277, 310, 120 L. Ed. 2d 225, 112 S. Ct. 2482 (Souter, J., Concurring in the judgment). But see Wright, 505 U.S. at 309 (Kennedy, J., Concurring in the judgment). As explained in Caspari,\n\na federal court should apply Teague by proceeding in three steps. First, the court must ascertain the date on which the defendant's conviction and sentence became final for Teague purposes. Second, the court must survey the legal landscape as it then existed, and determine whether a state court considering the defendant's claim at the time his conviction became final would have felt compelled by existing precedent to conclude that the rule he seeks was required by the Constitution. Finally, even if the court determines that the defendant seeks the benefit of a new rule, the court must decide whether that rule falls within one of the two narrow exceptions to the nonretroactivity principle.\n\n114 S. Ct. at 953 (internal quotation marks and citations omitted).\n\nO'Dell's conviction became final on October 3, 1988, when the United States Supreme Court denied his petition for certiorari on direct appeal. See O'Dell v. Virginia, 488 U.S. 871, 102 L. Ed. 2d 154, 109 S. Ct. 186 (1988). Therefore, we must \"survey the legal landscape\" in October of 1988 to determine whether the result of Simmons (and the accompanying rule necessary to produce that result) was dictated by precedent existing at the time O'Dell's conviction became final. Teague, 489 U.S. at 301 (\"[A] case announces a new rule if the result was not dictated by precedent existing at the time the defendant's conviction became final.\" (first emphasis added)). As the Supreme Court has stated repeatedly, a rule sought by a habeas petitioner is \"new,\" and thus consideration of the underlying claim barred, unless reasonable jurists considering the petitioner's claim at the time his conviction became final \"'would have felt compelled by existing precedent' to rule in his favor.\" Graham, 506 U.S. at 467 (emphasis added) (quoting Saffle, 494 U.S. at 488).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e The inquiry is not merely whether the \"claim\" was \"predicated\" on preexisting precedent or whether the \"challenge\" was \"dictated\" by such precedent; it is in sufficient that prior decisions \"inform, or even control or govern, the analysis of\" a petitioner's claim. Saffle, 494 U.S. at 491. See also Sawyer, 497 U.S. at 236 (quoting Saffle); Butler v. McKellar, 494 U.S. 407, 415, 108 L. Ed. 2d 347, 110 S. Ct. 1212 (1990) (noting that a decision within the \"logical compass\" of an earlier decision may nonetheless announce new rule). Rather, the result of the case must have been compelled by then-existing precedent, as even the Dissenting Justices in the continuing debate over the contours of the \"new rule\" doctrine agree.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nWe have suggested otherwise in several recent cases, see, e.g., Turner v. Williams, 35 F.3d 872 (4th Cir. 1994), cert. denied, 115 S. Ct. 1359, 131 L. Ed. 2d 216 (1985), and Ostrander v. Green, 46 F.3d 347 (4th Cir. 1995). Both Turner and Ostrander applied broad formulations, asking whether prior caselaw \"dictated petitioner's challenge\" or whether petitioner's challenge was \"predicated on\" prior caselaw. Applying the first locution of whether prior precedent \"dictates the challenge,\" alone would result in an inestimable number of cases in which federal courts would be obliged to undertake full merits review of reasonable, and in many instances unassailable, state court judgments. For in many cases that are not currently reviewable on federal habeas, the state court's judgment (against the petitioner) will have been dictated by existing precedent. Any cases not subject to review under the \"dictates the challenge\" locution would undoubtedly be subject to review under the alternative formulation that the \"new rule\" doctrine does not bar consideration of any claim \"predicated on\" prior caselaw. This formulation renders reviewable on habeas essentially every claim, for virtually every habeas petitioner necessarily \"predicates\" his claims on prior caselaw.\n\nThese consequences of the formulations of the \"new rule\" inquiry embraced in Turner and Ostrander underscore the error of those two decisions. The very purpose of Teague was to halt federal habeas review even of state court interpretations of federal law that ultimately prove incorrect, provided they are reasonable. Yet under the reasoning of those two cases, federal courts would be reviewing and deciding on the merits countless state court judgments that are not only reasonable but, indisputably correct.\n\nThus, both locutions discussed in Turner and Ostrander would frustrate the principles of finality, comity toward state judicial tribunals, see Teague, 489 U.S. at 310 (explaining that \"'state courts are understandably frustrated'\" when federal habeas courts reverse their reasonable rulings on federal law) (quoting Engle v. Isaac, 456 U.S. 107, 128 n.33, 71 L. Ed. 2d 783, 102 S. Ct. 1558 (1982)), and respect for state prosecutorial authorities, see Teague, 489 U.S. at 310 (stating that federal review should not require states \"to marshal resources in order to keep in prison defendants whose trials and appeals conformed to then-existing constitutional standards\"), that prompted adoption of Teague 's \"new rule\" doctrine in the first place.\n\nTherefore, Turner and Ostrander are today overruled to the extent they suggest that the bar of Teague is inapplicable if a petitioner's challenge is merely \"predicated on\" prior caselaw or if prior caselaw merely \"dictates petitioner's challenge.\" As the Supreme Court has consistently held, extant caselaw must compel not only the challenge, but the actual relief that petitioner seeks.\n\nThe result of the case in question (here, Simmons) must also have been compelled because of the rule that the petitioner seeks. In making this determination, of course, the \"rule\" must be identified at the appropriately specific level of generality. The appropriate level of generality for identifying the rule is that level represented by the narrowest principle of law that was actually applied in order to decide the case in question. Thus, for example, as we held in Townes v. Murray, 68 F.3d 840 (4th Cir. 1995), cert. denied, 116 S. Ct. 831, 133 L. Ed. 2d 830 (1996), the most specific principle of law applied in Simmons, and therefore the \"rule\" of Simmons, is \"that 'where the State puts the defendant's future dangerousness in issue, and the only available alternative sentence to death is life imprisonment without possibility of parole, due process entitles the defendant to inform the capital sentencing jury -- by either argument or instruction-- that he is parole ineligible.'\" Id. at 850 (quoting Simmons, 114 S. Ct. at 2201 (O'Connor, J., Concurring in the judgment)). To frame the rule more broadly -- for example, as that of \"due process\" or \"the right to be heard\" or generally as \"the right to rebut the State's arguments\" or \"the need for reliability in capital sentencing\" -- would vitiate Teague. As the Chief Justice explained for the Court recently in Gray v. Netherland, 116 S. Ct. 2074, 135 L. Ed. 2d 457, 1996 WL 335339 (1996), for example,\n\nThe Dissent argues that petitioner seeks the benefit of [Gardner 's] well-established rule, that \"a capital defendant must be afforded a meaningful opportunity to explain or deny the evidence introduced against him at sentencing.\" . . . But . . . the new-rule doctrine \"would be meaningless if applied at this level of generality.\"\n\nId. at * 12 (quoting Sawyer, 497 U.S. at 236); see also Sawyer, 497 U.S. at 236 (\"In petitioner's view, Caldwell [v. Mississippi, 472 U.S. 320, 86 L. Ed. 2d 231, 105 S. Ct. 2633 (1985),] was dictated by the principle of reliability in capital sentencing. But the test would be meaningless if applied at this level of generality.\" (emphasis added)) (citing Anderson v. Creighton, 483 U.S. 635, 639, 97 L. Ed. 2d 523, 107 S. Ct. 3034 (1987), with the following parenthetical: \"If the test of 'clearly established law' were to be applied at this level of generality, . . . plaintiffs would be able to convert the rule of qualified immunity that our cases plainly establish into a rule of virtually unqualified liability simply by alleging violation of extremely abstract rights.\"). Gilmore v. Taylor, 508 U.S. 333, 344, 124 L. Ed. 2d 306, 113 S. Ct. 2112 (1993); Wright, 505 U.S. at 311-12 (Souter, J., Concurring in the judgment).\n\nAs the Supreme Court's repeated analogy to the qualified immunity analysis confirms, the new rule analysis fundamentally asks the same question as does the qualified immunity analysis -- whether a contrary Conclusion would have been objectively unreasonable. Cf. Hogan v. Carter, 85 F.3d 1113, 1996 WL 292031 at * 4 n.3 (4th Cir.) (en banc); 28 U.S.C. ยง 2254(d)(1) (as amended April 24, 1996). The varying formulations for the new rule test that have, from time to time, been employed by the Court\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e are but myriad faces of the same basic inquiry: whether it would have been objectively unreasonable, under the law existing at that time, for a Judge to reach a contrary result to that subsequently reached. As the Court explained in Butler, 494 U.S. at 414, \"the 'new rule' principle . . . validates reasonable, good-faith interpretations of existing precedents made by state courts even though they are shown to be contrary to later decisions.\" See also Graham, 506 U.S. at 467 (quoting Butler, 494 U.S. at 414). The question is \"whether a state court considering [petitioner's] claim at the time his conviction became final would have felt compelled by existing precedent to conclude that the rule [petitioner] seeks was required by the Constitution.\" Saffle, 494 U.S. at 488 (emphasis added); see also Graham, 506 U.S. at 467. Whenever the \"outcome\" of a case was \"susceptible to debate among reasonable minds,\" Butler, 494 U.S. at 415, or among \"reasonable jurists,\" Sawyer, 497 U.S. at 234, then that case announced a new rule. See also Butler, 494 U.S. at 417-18 (Brennan, J., joined by Marshall, Blackmun, and Stevens, JJ., Dissenting) (\"[A] state prisoner can secure habeas relief only by showing that the state court's rejection of the constitutional challenge was so clearly invalid under then-prevailing legal standards that the decision could not be defended by any reasonable jurist.\" (second emphasis added)); Graham, 506 U.S. at 467, 476; Stringer, 503 U.S. at 238 (Souter, J., Dissenting).\n\nB.\n\nAs noted, the narrowest principle of law that was applied in order to decide Simmons was that applied by Justice O'Connor in her separate concurrence: \"where the State puts the defendant's future dangerousness in issue, and the only available alternative sentence to death is life imprisonment without possibility of parole, due process entitles the defendant to inform the capital sentencing jury -- by either argument or instruction -- that he is parole ineligible.\" 114 S. Ct. at 2201 (O'Connor, J., joined by Rehnquist, C.J., and Kennedy, J., Concurring in the judgment). Therefore, unless it would have been objectively unreasonable for a state court in 1988 (when O'Dell's conviction became final) to conclude that the Constitution did not require that the jury be informed of parole ineligibility, Simmons must be held to have announced a new rule.\n\n\"Surveying the legal landscape\" in 1988, Graham, 506 U.S. at 468, a reasonable jurist would have been faced with the following caselaw. First, that jurist would have been confronted with the cases upon which Simmons principally relied, Gardner v. Florida, 430 U.S. 349, 51 L. Ed. 2d 393, 97 S. Ct. 1197 (1977), and Skipper v. South Carolina, 476 U.S. 1, 90 L. Ed. 2d 1, 106 S. Ct. 1669 (1986). In Gardner, the Court vacated a death sentence because the sentencing court had relied in part on a secret presentence report that the defendant never had an opportunity to see or to rebut. The three-Justice plurality concluded that \"petitioner was denied due process of law when the death sentence was imposed, at least in part, on the basis of information which he had no opportunity to deny or explain.\" 430 U.S. at 362 (Stevens, J., joined by Stewart and Powell, JJ.). Under Marks v. United States, 430 U.S. 188, 193, 51 L. Ed. 2d 260, 97 S. Ct. 990 (1977), however, the holding of Gardner is the \"position taken by those Members who concurred in the judgment[ ] on the narrowest grounds\"; therefore, the holding of Gardner is found in Justice White's opinion, in which he concurred in the judgment on the narrow and fact-specific ground that reliance upon secret information in sentencing a man to death violates the Eighth Amendment -- although not necessarily due process. Gardner, 430 U.S. at 364 (White, J., Concurring in the judgment).\n\nIn 1988, a reasonable jurist would also have considered Skipper, where the Court vacated a death sentence because, in violation of the Eighth Amendment rule of Lockett v. Ohio, 438 U.S. 586, 57 L. Ed. 2d 973, 98 S. Ct. 2954 (1978), and Eddings v. Oklahoma, 455 U.S. 104, 71 L. Ed. 2d 1, 102 S. Ct. 869 (1982), the jury had been prevented from hearing the defendant's evidence of previous good behavior in jail. Skipper, 476 U.S. at 4. Specifically, the Court held that \"evidence that the defendant would not pose a danger if spared (but incarcerated) must be considered potentially mitigating,\" and that \"under Eddings, such evidence may not be excluded from the sentencer's consideration.\" Id. at 5.\n\nThe sole question upon which certiorari was granted in Skipper was whether, under the Eighth Amendment, the lower court's decision was \"inconsistent with the Court's decisions in Lockett and Eddings.\" Id. at 4. And the Court noted that this Eighth Amendment issue was \"the only question before [it].\" Id. One footnote in Skipper, however, read as follows:\n\nThe relevance of evidence of probable future conduct in prison as a factor in aggravation or mitigation of an offense is underscored in this particular case by the prosecutor's closing argument, which urged the jury to return a sentence of death in part because petitioner could not be trusted to behave if he were simply returned to prison. Where the prosecution specifically relies on a prediction of future dangerousness in asking for the death penalty, it is not only the rule of Lockett and Eddings that requires that the defendant be afforded an opportunity to introduce evidence on this point; it is also the elemental due process requirement that a defendant not be sentenced to death \"on the basis of information which he had no opportunity to deny or explain.\" Gardner v. Florida, 430 U.S. 349, 362, 51 L. Ed. 2d 393, 97 S. Ct. 1197 (1977).\n\n476 U.S. at 5 n.1. In addition to this footnote, which provides the strongest suggestion that the due process rule announced in Simmons was not new, three Justices also joined a separate opinion concluding that, although Skipper's death sentence did not violate the Eighth Amendment under Lockett and Eddings, it did violate due process under Gardner. Id. at 9 (Powell, J., joined by Burger, C.J., and Rehnquist, J., Concurring in the judgment).\n\nWere Gardner and Skipper the totality of the \"legal landscape\" in 1988, the claim that Simmons was not a new rule might, at least at first blush, have considerable force.\n\nOf critical significance, however, in addition to Gardner and Skipper, a reasonable jurist in 1988 would also have confronted California v. Ramos, 463 U.S. 992, 77 L. Ed. 2d 1171, 103 S. Ct. 3446 (1983), in which the Court not only held that a defendant was not constitutionally entitled to apprise the jury of the Governor's power to commute a death sentence (when the trial court had already instructed the jury of the Governor's power to commute a life sentence without parole), but also expressly noted with approval the practices in many states of forbidding any reference to the possibility of pardon, commutation, or parole.\n\nIn Ramos, the Court upheld the constitutionality of a death sentence under the Eighth and Fourteenth Amendments,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e where the jury had been instructed, as required by state statute, that the Governor possessed the power to commute a sentence of life imprisonment without possibility of parole. Justice O'Connor, writing for the Court, repeatedly emphasized that, with only a few exceptions, \"the Court has deferred to the State's choice of substantive factors relevant to the penalty determination.\" Id. at 1001. The Court invoked Gregg v. Georgia, 428 U.S. 153, 49 L. Ed. 2d 859, 96 S. Ct. 2909 (1976), to make the point, noting that \"the joint opinion [in Gregg ] did not undertake to dictate to the State the particular substantive factors that should be deemed relevant to the capital sentencing decision,\" Ramos, 463 U.S. at 999 (emphasis in original), and then quoting Gregg 's observation that the guidance that should be given the jury in making its sentencing determination is that \"'that the State, representing organized society, deems particularly relevant to the sentencing decision,'\" id . at 1000 (quoting Gregg, 428 U.S. at 192) (emphasis added by Ramos Court).\n\nImportantly, the Court in Ramos also squarely rejected an argument by petitioner that was virtually indistinguishable in principle from that made by petitioner in Simmons. Ramos argued that an instruction as to the Governor's power to commute a death sentence was required under \"basic principles of fairness,\" because, otherwise, the court's instruction that the Governor could commute a life sentence, \"created the misleading impression that the jury can prevent the defendant's return to society only by imposing the death sentence,\" id. at 1010-11, just as Simmons argued that an instruction to the jury as to his parole ineligibility was required to eliminate the mistaken impression that only by imposing death could the jury prevent his return into society. As the Court explained petitioner's argument in Simmons :\n\nPetitioner argued that, in view of the public's misunderstanding about the meaning of \"life imprisonment\" in South Carolina, there was a reasonable likelihood that the jurors would vote for death simply because they believed, mistakenly, that petitioner eventually would be released on parole.\n\n114 S. Ct. at 2191. Notwithstanding, the Court dismissed Ramos' argument on the ground, inter alia, that the entire instruction \"satisfies the Jurek [v. Texas, 428 U.S. 262, 49 L. Ed. 2d 929, 96 S. Ct. 2950 (1976),] requirement that 'what is essential is that the jury have before it all possible relevant information about the individual defendant whose fate it must determine.'\" Ramos, 463 U.S. at 1012 n.29 (quoting Jurek, 428 U.S. at 276) (emphasis added). Justice Marshall in Dissent in Ramos even criticized the majority's rejection of this instruction on precisely the same grounds that the Simmons Court ultimately employed in requiring an instruction as to parole ineligibility:\n\nThe Briggs Instruction may well mislead the jury into believing that it can eliminate any possibility of commutation by imposing the death sentence. It indicates that the Governor can commute a life sentence without possibility of parole, but not that the Governor can also commute a death sentence. The instruction thus erroneously suggests to the jury that a death sentence will assure the defendant's permanent removal from society whereas the alternative sentence will not.\n\nPresented with this choice, a jury may impose the death sentence to prevent the Governor from exercising his power to commute a life sentence without possibility of parole.\n\nRamos, 463 U.S. at 1016 (Marshall, J., Dissenting) (citations and footnote omitted, emphasis added)). Compare Simmons, 114 S. Ct. at 2193 (\"In this case, the jury reasonably may have believed that petitioner could be released on parole if he were not executed. To the extent this misunderstanding pervaded the jury's deliberations, it had the effect of creating a false choice between sentencing petitioner to death and sentencing him to a limited period of incarceration.\").\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nAlthough the Ramos Court noted that it considered it desirable for the jury to have this information concerning the Governor's power to commute a death sentence, and as much other information as possible during sentencing, 463 U.S. at 1009 n.23, it nevertheless found that the trial court's refusal to inform the jury of the Governor's power to commute the death sentence (while at the same time informing it of his power to commute life imprisonment) was in no way unconstitutional, see id. at 1013 (\"[The State's] failure to inform the jury also of the Governor's power to commute a death sentence does not render it constitutionally infirm.\").\n\nNo doubt, a reasonable jurist in 1988, considering whether the Constitution necessarily required the rule of Simmons, would also have focused immediately upon the broad principles of deference to state decisions regarding the substantive factors that juries may consider during sentencing, which underlay the Court's decision to uphold California's choice to inform the jury of the Governor's power to commute a life sentence but not his power to commute a death sentence. In punctuation of this principle, the Court concluded its entire opinion as follows:\n\nIn sum, the Briggs Instruction does not violate any of the substantive limitations this Court's precedents have imposed on the capital sentencing process. It does not preclude individualized sentencing determinations or consideration of mitigating factors, nor does it impermissibly inject an element too speculative for the jury's deliberation. Finally, its failure to inform the jury also of the Governor's power to commute a death sentence does not render it constitutionally infirm. Therefore, we defer to the State's identification of the Governor's power to commute a life sentence as a substantive factor to be presented for the sentencing jury's consideration.\n\nOur Conclusion is not intended to override the contrary judgment of state legislatures that capital sentencing juries in their States should not be permitted to consider the Governor's power to commute a sentence. . . . We sit as Judges, not as legislators, and the wisdom of the decision to permit juror consideration of possible commutation is best left to the States.\n\nId. at 1013-14 (footnote omitted) (emphasis added).\n\nEven more so, that jurist would have fixed immediately upon footnote 30 within this concluding passage. As Justice O'Connor, the author of Ramos and the necessary fifth vote in Simmons, observed in Simmons itself, see 114 S. Ct. at 2200 (O'Connor, J., Concurring in the judgment) (emphasis added), Ramos \"noted with approval \" that,\n\nmany state courts have held it improper for the jury to consider or to be informed -- through argument or instruction -- of the possibility of commutation, pardon, or parole.\n\nRamos, 463 U.S. at 1013 n.30 (emphasis added). In that footnote passage in Ramos, the Court even cited \"with approval\" a Georgia statute \"prohibiting argument as to the possibility of pardon, parole, or clemency,\" and numerous state cases holding, for example, that \"'any consideration of the possibility of parole as such simply is irrelevant,'\" and that \"consideration of parole [is] outside [the] proper scope of jury's duty as fixed by statute.\" Id .\n\nIn fact, not only the majority, but the full Court, recognized and approved, as constitutionally permissible, the practice of \"nearly every jurisdiction which has considered the question\" of not \"permitting [juries] to consider commutation and parole.\" Id. at 1025 (Marshall, J., Dissenting, joined by Brennan and Blackmun, JJ.) (emphasis added); see also id. at 1029 (Stevens, J., Dissenting). The dispute between the majority and the Dissenters was whether the States could ever allow the jury to consider matters such as commutation, pardons or parole. The majority concluded that the decision to allow jury consideration of these matters should be left to the discretion of the States, but the Dissenters went even further, arguing that States should never be allowed to permit instruction or argument to the jury concerning commutation, pardon, or parole:\n\nThe [Briggs] Instruction invites juries to impose the death sentence to eliminate the possibility of eventual release through commutation and parole. Yet that possibility bears no relation to the defendant's character or the nature of the crime, or to any generally accepted justification for the death penalty. . . . In my view, the Constitution forbids the jury to consider any factor which bears no relation to the defendant's character or the nature of his crime, or which is unrelated to any penological objective that can justify imposition of the death penalty. Our cases establish that a capital sentencing proceeding should focus on the nature of the criminal act and the character of the offender . . . . Considerations such as the extent of premeditation, the nature of the crime, and any prior criminal activity have been considered relevant to the determination of the appropriate sentence. . . . The mere possibility of a commutation \"is wholly and utterly foreign to\" the defendant's guilt and \"not even remotely related to\" his blameworthiness. That possibility bears absolutely no relation to the nature of the offense or the character of the individual. . . . The possibility of commutation has no relationship to the state purposes that this Court has said can justify the death penalty.\n\nId. at 1021-23 (Marshall, J., Dissenting) (emphasis added, footnotes and citations omitted).\n\nLooking to the actual practice in the several states as support for his argument, Justice Marshall continued:\n\nThe propriety of allowing a sentencing jury to consider the power of a Governor to commute a sentence or of a parole board to grant parole has been considered in 28 jurisdictions in addition to California. Of those jurisdictions, 25 have concluded, as did the California Supreme Court in this case, that the jury should not consider the possibility of pardon, parole, or commutation.\n\nId. at 1026 (emphasis added, footnotes omitted). And, as support for the proposition that \"in those States which formerly permitted jury consideration of parole and commutation the trend has been to renounce the prior decisions,\" Justice Marshall cited the very same Georgia statute cited by the majority in footnote 30 as \"forbidding any jury argument concerning commutation or parole .\" Id. at 1027 \u0026 n.16 (referencing Ga. Code Ann. ยง 27-2206 (1972), the precursor to Ga. Code Ann. 17-8-76) (emphasis added)). Even more strikingly, Justice Marshall cited Clanton v. Commonwealth, 223 Va. 41, 286 S.E.2d 172 (Va. 1982), which affirmed a trial court's refusal to answer the jury's question as to whether the capital defendant would be eligible for parole and which reaffirmed Hinton v. Commonwealth, 219 Va. 492, 247 S.E.2d 704 (Va. 1978), and Stamper v. Commonwealth, 220 Va. 260, 257 S.E.2d 808 (Va. 1979), cert. denied, 445 U.S. 972, 64 L. Ed. 2d 249, 100 S. Ct. 1666 (1980), both of which were expressly relied upon by the trial court below to deny O'Dell's request that he be allowed to argue parole ineligibility to the jury, J.A. at 2378-79, 2382-85. See Ramos, 463 U.S. at 1026 n.13 (Marshall, J., Dissenting); see also id. (citing Summers v. State, 86 Nev. 210, 467 P.2d 98, 100 (Nev. 1970) (\"reaffirming Serrano v. State, 84 Nev. 676, 447 P.2d 497 (Nev. 1968), which instructed [the] jury to assume that life without parole means exactly that \") (parenthetical from Ramos, emphasis added)).\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nIn hindsight, and particularly in the wake of Simmons, it might be suggested that the Court in Ramos was expressing approval only of those state laws forbidding reference to the affirmative possibility of parole, and not of those prohibiting reference to the legal im possibility of parole, although to our knowledge that has never been suggested, and petitioner does not do so here. We believe, however, that, even with the Court's observation that \"States are free to provide greater protections in their criminal Justice system than the Federal Constitution requires,\" 463 U.S. at 1013-14, such a suggestion would border on the disingenuous, considering that the very state sentencing law that the Court was reviewing in Ramos, like numerous other states' laws then in effect and of which the Court was aware,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e provided for \"life without possibility of parole\" as the only alternative to death, 463 U.S. at 994-95, and the Court nonetheless chose the broad, categorical language that it did, without even a hint that it intended such a distinction. Indeed, Justice O'Connor's concurrence in the Simmons judgment, \"despite [the Court's] general deference to state decisions regarding what the jury should be told about sentencing,\" 114 S. Ct. at 2201 (emphasis added) -- an explicit reference to her opinion for the Court in Ramos and to the Discussion at pages 1013-14 and n.30 in particular, see id. at 2200 -- all but confirms that the Court intended no such distinction in Ramos. And, of course, the reasoning of the Ramos Dissent -- that the jury should be forbidden from considering anything beyond the particular defendant's character and his crime -- which Justice Blackmun, the author of the plurality in Simmons, expressly joined, would not even admit such a distinction.\n\nThe question, in any event, is not whether in fact the Court in this passage was limiting its approval to those state laws prohibiting reference to the possibility that the defendant might become parole eligible. The only question is whether it would have been objectively unreasonable for jurists not to read the passage as so limited. It would be the height of pedanticism to suggest that it would have been objectively unreasonable for the 1988 jurist to have understood the passage as extending to all state laws prohibiting comment on parole, including those prohibiting comment as to parole ineligibility. Both the majority's and the Dissent's language unquestionably swept broadly, suggesting no distinction whatsoever. And Ramos ' holding that the State of California was not constitutionally required to inform the jury that the Governor could also commute a death sentence, in the face of petitioner's argument that not to do so left the jury with the belief that it could prevent his return to society only by sentencing him to death, would have been analytically indefensible had the Court there drawn such a distinction. Even in Simmons, which ultimately constitutionalized this very distinction, not a single Justice so much as suggested that the distinction had actually been drawn in Ramos, ten years earlier. Under these circumstances, to suggest now that the distinction was made then, and that the several states were objectively unreasonable in not divining it at the time, would be not only demoralizing to the state and lower courts, but also destructive of the principles of comity and finality that inspired the \"new rule\" doctrine to begin with.\n\nFinally, although the Supreme Court itself seemed to consider Caldwell v. Mississippi, 472 U.S. 320, 86 L. Ed. 2d 231, 105 S. Ct. 2633 (1985), wholly irrelevant to the question decided in Simmons,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e the reasonable jurist in 1988 would have at least perused that case as well. In Caldwell, the prosecutor had argued to the jury that it would not be finally responsible for the imposition of a death penalty because its decision would automatically be reviewed by the state's Supreme Court. The Mississippi Supreme Court rejected Caldwell's claim that such an argument violated the Eighth Amendment, concluding that, \"'[b]y [Ramos '] reasoning, states may decide whether it is error to mention to jurors the matter of appellate review.'\" Id. at 326 (quoting Caldwell v. State, 443 So. 2d 806, 813 (Miss. 1983)). The Supreme Court reversed, with a plurality of the Court characterizing as \"too broad a view of Ramos \" Mississippi's reading of that case as \"[holding] that States are free to expose capital sentencing juries to any information and argument concerning postsentencing procedures.\" 472 U.S. at 335. Rather, the plurality explained, the Court upheld the instruction in Ramos because it was accurate and relevant to a legitimate penological objective. Id. And on this basis, the Caldwell plurality distinguished the prosecutor's argument there before it:\n\nIn contrast [to the instruction in Ramos ], the argument at issue here cannot be said to be either accurate or relevant to a valid penological interest. The argument was inaccurate, both because it was misleading as to the nature of the appellate court's review and because it depicted the jury's role in a way fundamentally at odds with the role that a capital sentencer must perform. Similarly, the prosecutor's argument is not linked to any arguably valid sentencing consideration.\n\nId. at 336.\n\nSignificantly, Justice O'Connor joined the judgment and the opinion of the Court, except that part in which Justice Marshall, in what consequently was only a plurality, discussed Ramos and the appropriateness of states allowing their juries to consider matters such as postsentencing appellate review. Id. at 341 (O'Connor, J., Concurring in part and Concurring in the judgment). While Justice O'Connor agreed with the plurality that the prosecutor's argument was inaccurate and misleading, and therefore violative of the Eighth Amendment, she disagreed with the plurality's Conclusion regarding the complete irrelevancy to the sentencing decision of information concerning appellate review. Justice Marshall had observed for the plurality, adopting the same position that he had articulated in Dissent in Ramos, that the availability of appellate review \"is simply a factor that in itself is wholly irrelevant to the determination of the appropriate sentence.\" Id. at 336. But Justice O'Connor's opinion, which, as the Court held in Romano, 114 S. Ct. at 2010, \"is controlling\" under Marks, defended her majority position in Ramos and reaffirmed that the Constitution does not prohibit a jury from receiving accurate information as to state postsentencing law:\n\nThe Court correctly observes that Ramos does not imply that \"States are free to expose capital sentencing juries to any information and argument concerning postsentencing procedures\" no matter how inaccurate. Certainly, a misleading picture of the jury's role is not sanctioned by Ramos. But neither does Ramos suggest that the Federal Constitution prohibits the giving of accurate instructions regarding postsentencing procedures.\n\nCaldwell, 472 U.S. at 342 (O'Connor, J., Concurring in part and Concurring in the judgment) (citations omitted; emphasis added).\n\nAnd critically as it bears on whether Simmons was required in the face of Ramos, Justice O'Connor specifically addressed herself to the \"inaccuracy and unreliability\" that results not from affirmatively providing false information, but merely from the failure to disabuse jurors of every misconception they might have about the state's postsentencing processes -- the very kind of \"inaccuracy and unreliability\" that the Court eventually held required the rule in Simmons :\n\nJurors may harbor misconceptions about the power of state appellate courts or, for that matter, this Court to override a jury's sentence of death. Should a State conclude that the reliability of its sentencing procedure is enhanced by accurately instructing the jurors on the sentencing procedure, including the existence and limited nature of appellate review, I see nothing in Ramos to foreclose a policy choice in favor of jury education.\n\nCaldwell, 472 U.S. at 342. Compare Simmons, 114 S. Ct. at 2191, 2193. Of course, saying that the states may choose, as a matter of policy, to attempt to eliminate any pre-existing juror misconceptions about postsentencing procedures is necessarily to say that they are not constitutionally required to do so.\n\nIn sum, Caldwell would have appeared to the reasonable jurist as simply another chapter in the continuing debate on the Court over the extent to which states should be allowed discretion over whether to inform their juries of state postsentencing laws and procedures -- a chapter in which the Court, per Justice O'Connor, reconfirmed the broad discretion retained by the states over whether to apprise juries of state postsentencing laws. In Ramos, for five Members of the Court, and again in Caldwell for four, but effectively five,\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Justice O'Connor concluded that the states should be afforded the widest possible discretion; and in Ramos, and again in Caldwell, Justice Marshall argued for four Members of the Court that they should be allowed none at all. But both sides of the Court agreed, in both Ramos and Caldwell, that should the states choose to provide information as to postsentencing laws and procedures, they cannot affirmatively mislead the jury as to those laws and procedures.\n\nC.\n\nA reasonable jurist in 1988, thus, would have found himself in something of a quandary. Footnote one of Skipper, in combination with the plurality opinion in Gardner, at least suggested that due process might compel the rule in Simmons. However, the holding, reasoning, and express language of Ramos, and in particular the text at and of footnote 30, seemed to render it all but a certainty that the rule of Simmons was not only not compelled, but forbidden -- a Conclusion only reinforced by the Ramos Dissenters and by Caldwell. As even the Simmons plurality recognized, the \"States that do not provide capital-sentencing juries with any information regarding parole ineligibility seem to rely . . . on the proposition that Ramos held that such determinations are purely matters of state law.\" Simmons, 114 S. Ct. at 2195-96 \u0026 n.8 (citing the decision of the Virginia Supreme Court on O'Dell's direct appeal).\n\n1.\n\nSince the reasonable state or federal lower court jurist was not at liberty to ignore either Gardner/Skipper or Ramos/Caldwell, and since the Supreme Court apparently viewed these cases as all compatible -- it having not overruled Gardner in Ramos or Caldwell, nor Ramos and Caldwell in Skipper -- that jurist would have been obliged to reconcile these cases by finding some \"meaningful[ ] distinction\" between them, see Wright, 505 U.S. at 304 (O'Connor, J., Concurring in the judgment). Upon examining the cases, an entirely reasonable distinction would have suggested itself-- a distinction of Gardner and Skipper, on the one hand, from Ramos and Caldwell on the other, much like the distinction the Court drew in Saffle between the rule of Lockett and Eddings (the key precedents underlying Skipper), and the rule that Parks was there urging. In Saffle, the Court concluded that Lockett and Eddings \"place clear limits on the ability of the State to define the factual bases upon which the capital sentencing decision must be made.\" Saffle, 494 U.S. at 490 (emphasis added) (citing Skipper, with the following parenthetical: \"exclusion of evidence regarding defendant's postoffense conduct \" (emphasis added)). The Court then contrasted that rule with petitioner's proposed rule that states could not constitutionally prohibit juries from sentencing based upon sympathy and empathy:\n\nParks asks us to create a rule relating, not to what mitigating evidence the jury must be permitted to consider in making its sentencing decision, but to how it must consider the mitigating evidence. There is a simple and logical difference between rules that govern what factors the jury must be permitted to consider in making its sentencing decision and rules that govern how the State may guide the jury in considering and weighing those factors in reaching a decision. We thus cannot say that the large majority of federal and state courts that have rejected challenges to antisympathy instructions similar to that given at Parks' trial have been unreasonable in concluding that the instructions do not violate the rule of Lockett and Eddings.\n\nId.\n\nAs Saffle distinguished between Lockett 's and Eddings ' rule as to what mitigating evidence the jury may consider, from Park's proposed rule as to how the jury may consider that evidence, so also a jurist in 1988 could reasonably have distinguished Gardner 's and Skipper 's rule as to the defendant's right to rebut prosecution claims with factual evidence, from Ramos ' rule (and Simmons ' rule) as to the defendant's right to rebut prosecution claims with arguments from state law.\n\nThat is, a reasonable jurist could have concluded that the due process principle of Gardner and Skipper was that a trial court could not deny a capital defendant the opportunity to rebut arguments made by the State with relevant factual evidence about himself, his character, and his particular offense. Thus, the Court required the secret presentence report in Gardner, which provided \"factual information\" upon which the Judge relied in sentencing Gardner to death, Gardner, 430 U.S. at 353 (plurality); id. at 364 (White, J., Concurring in the judgment) (\"secret information relevant to the 'character and record of the individual offender'\"), be made known to the defendant so that he could attempt to rebut it with contrary \"factual information.\" See also id. at 360 (plurality) (\"Our belief that debate between adversaries is often essential to the truth-seeking function of trials requires us . . . to recognize the importance of giving counsel an opportunity to comment on facts which may influence the sentencing decision in capital cases.\" (emphasis added)). And, thus, the prosecution's argument in Skipper that the defendant would pose a future danger and would \"likely rape other prisoners,\" Skipper, 476 U.S. at 3, necessitated that the defendant be allowed to rebut this argument with evidence of his \"past conduct,\" id. at 5, namely good behavior while previously incarcerated. As the Court emphasized at the outset of its opinion in Skipper,\n\nthere is no disputing that this Court's decision in Eddings requires that in capital cases \"'the sentencer .. . not be precluded from considering, as a mitigating factor, any aspect of a defendant's character or record and any of the circumstances of the offense that defendant proffers as a basis for a sentence less than death.'\" Equally clear is the corollary rule that the sentencer may not refuse to consider or be precluded from considering \"any relevant mitigating evidence.\"\n\nId. at 4 (citations omitted, emphasis added).\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nIn contrast, that 1988 jurist could have and, indeed, would have most reasonably understood Ramos, as apparently almost every jurist in fact did, as setting forth the principle that whether to instruct juries on state law -- like the governor's power to commute a sentence or the parole board's power to parole a prisoner -- is a decision left to the \"wisdom of . . . the States\" by the Constitution. Ramos, 463 U.S. at 1014; see also id. at 1013 \u0026 n.30. The Court itself seems to have understood Ramos this way when it held in 1990 in Sawyer that its decision in Caldwell was a new rule under Teague. As the Court said there, although the Mississippi Supreme Court's 1983 holding \"without Dissent . . . that Ramos stood for the proposition that 'states may decide whether it is error to mention to jurors the matter of appellate review,'\" may in retrospect have proven to be incorrect to the limited extent that it failed to recognize that a state may not provide inaccurate or misleading information even about postsentencing procedures, it was nonetheless a reasonable Conclusion at the time. 497 U.S. at 237 (quoting Caldwell v. State, 443 So. 2d 806 (Miss. 1983)). And, of course, nothing in Caldwell called into question (indeed, as noted, that case only confirmed) Ramos ' deference to the states on whether to instruct juries as to state postsentencing laws, provided that any information the states choose affirmatively to provide is accurate. As Justice O'Connor explained:\n\nThe Court today, relying in part on my opinion in Caldwell v. Mississippi, rejects petitioner's claim that the introduction of evidence of a prior death sentence impermissibly undermined the jury's sense of responsibility. I write separately to explain why in my view petitioner's Caldwell claim fails. The inaccuracy of the prosecutor's argument in Caldwell was essential to my Conclusion that the argument was unconstitutional. An accurate description of the jury's role -- even one that lessened the jury's sense of responsibility -- would have been constitutional. [ Caldwell, 472 U.S. at 342] (\"a misleading picture of the jury's role is not sanctioned by [California v. Ramos ], but neither does Ramos suggest that the federal Constitution prohibits the giving of accurate instructions regarding post-sentencing procedures\").\n\nRomano, 114 S. Ct. at 2013 (O'Connor, J., Concurring).\n\n2.\n\nIndeed, this very distinction between facts and legal power to subsequently modify sentences was suggested by Justice O'Connor in Simmons itself:\n\nUnlike in Skipper, where the defendant sought to introduce factual evidence tending to disprove the State's showing of future dangerousness, petitioner [here] sought to rely on the operation of South Carolina's sentencing law in arguing that he would not pose a threat to the community if he were sentenced to life imprisonment.\n\nSimmons, 114 S. Ct. at 2200 (O'Connor, J., Concurring in the judgment) (emphasis added). Even Jonathan Dale Simmons himself drew this distinction in arguing for the rule of Simmons. See Petitioner's Br., Simmons v. South Carolina, No. 92-9059 (1994), at*fn* 35 (\"Skipper concerned the exclusion of evidence, rather than the withholding of accurate legal information from the jury.\").\n\nAnd, at the very least, this was a reasonable distinction in 1988, considering also that relevant factual information, like secret sentencing reports or prior good behavior, cannot change with time, but a state's legal standards and post-conviction procedures, like eligibility for commutation or parole, can always change long after the sentencing jury renders its verdict. Cf. Ramos, 463 U.S. at 1020 (Marshall, J., Dissenting) (\"To invite the jury to indulge in such speculation is to ask it to foretell numerous imponderables: the policies that may be adopted by unnamed future Governors and parole officials, . . . as well as any other factors that might be deemed relevant to the commutation and parole decisions. Yet these are questions that 'no human mind can answer . . . because they rest on future events which are unpredictable.'\" (emphases added)). But see Simmons, 114 S. Ct. at 2195. Moreover, this was a distinction that followed directly from the Court's holding in Jurek, which was reaffirmed in Ramos, that, under the Eighth Amendment, \"what is essential is that the jury have before it all possible relevant information about the individual defendant whose fate it must determine.\" Jurek, 428 U.S. at 276 (emphasis added); see also Ramos, 463 U.S. at 1006, 1012 n.29. And it was factual evidence about the Eighth Amendment factors relevant to the individual defendant which Gardner and Skipper had held defendants had a due process right to introduce in rebuttal of prosecution arguments concerning these factors. Not until Simmons itself had the Court ever held that there was a due process right to rebut prosecution arguments with evidence unrelated to the defendant's character and crime. Cf. Sawyer, 497 U.S. at 236 (\"It is beyond question that no case prior to Caldwell invalidated a prosecutorial argument as impermissible under the Eighth Amendment.\").\n\nThat the Supreme Court in Simmons ultimately resolved any tension between the Gardner/Skipper right to rebut state arguments with factual evidence, and Ramos ' pronouncement that the states are owed deference as to whether to instruct their juries on the implications of state laws governing the powers of commutation and parole, and that it resolved that tension by permitting argument based upon state law in the narrow circumstance of capital cases where future dangerousness is argued and the defendant is parole ineligible, is, of course, not determinative of the new rule inquiry. The question is not whether the distinction between arguments from factual evidence concerning the defendant's character and offense and arguments from state law itself was necessarily correct, or whether it was ultimately accepted by the Court as dispositive; rather, the only question is whether it would have been objectively unreasonable for a jurist in 1988 -- forced to grapple with and reconcile Gardner, Skipper, Ramos, and Caldwell -- to have drawn this distinction, and therefore to have concluded that the rule in Simmons was not compelled. See Wright, 505 U.S. at 304 (O'Connor, J., Concurring in the judgment) (\"To determine what counts as a new rule, Teague requires courts to ask whether the rule a habeas petitioner seeks can be meaningfully distinguished from that established by binding precedent at the time his state court conviction became final.\"). The answer to this latter question is most assuredly \"no.\" In no sense would this have been an \"illogical or even a grudging application,\" Butler, 494 U.S. at 415, of these cases, as evidenced by the fact that Justice O'Connor recognized the very same distinction in her opinion in Simmons.\n\nEven the Simmons plurality seems to have acknowledged as much. After noting that \"the few states that do not provide capital-sentencing juries with any information regarding parole ineligibility seem to rely . . . on the proposition that California v. Ramos held that such determinations are purely matters of state law,\" Simmons, 114 S. Ct. at 2195-96, the plurality implicitly validated the reasonableness of this reliance, conceding that \"it is true that Ramos stands for the broad proposition that [the Court] generally will defer to a State's determination as to what a jury should and should not be told about sentencing,\" a proposition with which the full Court agreed, id.; see also id. at 2200 (O'Connor, J., Concurring in the judgment) (\"The decision whether or not to inform the jury of the possibility of early release is generally left to the States.\"). In other words, the Court itself seemed to understand that it had chosen to recognize in Simmons yet another exception to what was (and is still today) indisputably its general rule of deference to the states on whether to inform their juries of state law governing such matters as commutation and parole. See, e.g., Simmons, 114 S. Ct. at 2201 (O'Connor, J., Concurring in the judgment) (\"Despite our general deference to state decisions regarding what the jury should be told about sentencing, I agree that due process requires . . . .\"); see also Johnson v. Scott, 68 F.3d 106, 111 n.11 (5th Cir. 1995), cert. denied, 116 S. Ct. 1358, 134 L. Ed. 2d 525 (1996).\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nIn holding that Simmons announced a new rule, we recognize that Justice Blackmun stated in his opinion in Simmons that \"the trial court's refusal to apprise the jury of information crucial to its sentencing determination . . . cannot be reconciled with our well-established precedents interpreting the Due Process Clause,\" and that \"the principle announced in Gardner [and] reaffirmed in Skipper. . . compels \" this Conclusion. Simmons, 114 S. Ct. at 2194 (Blackmun, J.) (emphasis added). However, not only is this dicta, it is merely that of a plurality of the Court. Notably, Justice O'Connor's concurrence in the judgment, joined by the Chief Justice and Justice Kennedy, and necessary for the Simmons majority, avoids any suggestion that the Court's decision was \"compelled\" by prior caselaw. In any event, the Court itself has admonished that categorical language about the degree to which a decision on the merits is controlled by prior decisions does not determine whether that decision was compelled for new rule purposes. See, e.g., Butler, 494 U.S. at 415. As the Court stated in Butler :\n\nThe fact that a court says that its decision is within the \"logical compass\" of an earlier decision, or indeed that it is \"controlled\" by a prior decision, is not conclusive for purposes of deciding whether the current decision is a \"new rule\" under Teague. Courts frequently view their decisions as being \"controlled\" or \"governed\" by prior opinions even when aware of reasonable contrary Conclusions reached by other courts.\n\nId. We do not ascribe any particular significance to the fact that Justice Blackmun used the word \"compels\" in Simmons, instead of \"controlled\" or \"within the logical compass of,\" as used by the Court in Butler. The point of the Butler passage, as we understand it, is that the hortatory dicta used in opinions to underscore their faithfulness to precedent should not be considered binding upon the separate question of whether they announced a new rule under Teague. Cf. Penry, 492 U.S. at 353 (Scalia, J., Dissenting) (\"In a system based on precedent and stare decisis, it is the tradition to find each decision 'inherent' in earlier cases . . . .\").\n\nD.\n\nOur Conclusion that the determination in 1988 that the Constitution did not require O'Dell be allowed to argue parole ineligibility was a \"reasonable, good-faith interpretation[ ] of existing precedents,\" Butler, 494 U.S. at 414, is \"confirmed by the experience of the lower courts.\" Caspari, 114 S. Ct. at 955.\n\nAs Justice Kennedy noted for the Court in Sawyer, \"state courts are coequal parts of our national judicial system and give serious attention to their responsibilities for enforcing the commands of the Constitution.\" 497 U.S. at 241. Because \"constitutional error is not the exclusive province of the federal courts, . . . in the Teague analysis the reasonable views of state courts are entitled to consideration along with those of federal courts.\" Caspari, 114 S. Ct. at 956. In 1988, the Virginia Supreme Court, which, \"as a state court, is the primary beneficiary of the Teague doctrine,\" Stringer, 503 U.S. at 237, had repeatedly held that \"it [is] the jury's duty to assess the penalty, irrespective of considerations of parole.\" Poyner, 329 S.E.2d at 828; see also Stamper, 257 S.E.2d at 821 (expressly relied upon by the trial court in denying O'Dell's request, J.A. at 2378-79); Williams v. Commonwealth, 234 Va. 168, 360 S.E.2d 361, 368 (Va. 1987) (\"A reduced sentence is not the responsibility of the judiciary but of the executive department, and argument as to what that department might do encroaches upon the separation of their functions.\"), cert. denied, 484 U.S. 1020, 98 L. Ed. 2d 681, 108 S. Ct. 733 (1988); Turner v. Commonwealth, 234 Va. 543, 364 S.E.2d 483, 487-88 (Va.), cert. denied, 486 U.S. 1017, 100 L. Ed. 2d 218, 108 S. Ct. 1756 (1988) (rejecting petitioner's argument that, under Skipper and Ramos, he should be entitled to present evidence on parole eligibility). Of course, the Virginia Supreme Court's decision on direct appeal in this case -- an \"especially valuable\" opinion because it \"concerns the legal implications of precisely the same set of facts [and so] is the closest one can get to a 'case on point,'\" Wright, 505 U.S. at 305 (O'Connor, J., Concurring in the judgment) -- concluded as well, relying on the long line of Virginia precedent, that the defendant should not be able to argue parole eligibility. O'Dell, 364 S.E.2d at 507. And, from 1988 until Simmons, the Virginia Supreme Court continued to rely on Ramos in denying parole-ineligible defendants the right to argue their parole ineligibility to capital sentencing juries. As the Court elaborated in Mueller v. Commonwealth, 244 Va. 386, 422 S.E.2d 380, 394 (Va. 1992) (emphasis added), cert. denied, 507 U.S. 1043, 123 L. Ed. 2d 498, 113 S. Ct. 1880 (1993),\n\nMueller argues that the trial court violated his due process rights by refusing to instruct the jury that, pursuant to Code ยง 53.1-151(B1), he would not be eligible for parole . . . . We hold that the trial court did not err in its rulings here. This Court has held uniformly and repeatedly that information regarding parole eligibility is not relevant for the jury's consideration. Further, the United States Supreme Court has expressly left the determination of this question to the individual states as a matter of state law. California v. Ramos, 463 U.S. 992, 1013-14, 77 L. Ed. 2d 1171, 103 S. Ct. 3446 (1983).\n\nAlthough likewise not necessarily dispositive, the federal appellate courts' views in 1988 are also \"relevant,\" Stringer, 503 U.S. at 237, to determining whether Gardner and Skipper compelled the result in Simmons. The federal circuits were uniform in concluding not only that Gardner and Skipper did not compel that result, but that Ramos compelled precisely the opposite -- deference to the States' choices about whether to inform juries about parole. In Turner v. Bass, 753 F.2d 342, 354 (4th Cir. 1985) (Widener, Hall, Phillips, JJ.) (emphasis added), rev'd on other grounds sub nom. Turner v. Murray, 476 U.S. 28, 90 L. Ed. 2d 27, 106 S. Ct. 1683 (1986), our circuit, for example, considered this issue and agreed with the Supreme Court of Virginia:\n\nIn arriving at its decision [in Ramos ], the Court noted: \"our Conclusion is not intended to override the contrary judgment of state legislatures that capital sentencing juries in their state should not be permitted to consider the governor's power to commute a sentence.30\" In footnote 30 the Court stated that \"many state courts have held it improper for the jury to consider or to be informed -- through argument or instruction -- of the possibility of commutation, pardon, or parole.\" [ Ramos, 463 U.S. at 1013 \u0026 n.30.] While not exactly on point, we think Ramos indicates that the Court would decide that while it is constitutionally permissible to instruct the jury on the subject of parole, such an instruction is not constitutionally required. We so hold .\n\nIn doing so, our circuit relied upon a decision of the Fifth Circuit, O'Bryan v. Estelle, 714 F.2d 365, 389 (5th Cir. 1983), cert. denied, 465 U.S. 1013, 104 S. Ct. 1015, 79 L. Ed. 2d 245 (1984), which had understood Ramos as we had:\n\nWe cannot say that an instruction on parole is constitutionally mandated in a capital case. See California v. Ramos, [463 U.S. 992, 77 L. Ed. 2d 1171, 103 S. Ct. 3446] (1983) (instruction informing jurors in capital case that governor has power to commute \"life sentence without possibility of parole\" but not informing them of equivalent power to commute death sentence not unconstitutional).\n\nWe do not find persuasive O'Dell's argument that Turner v. Bass and O'Bryan should be disregarded because they were decided before Skipper. The Skipper footnote addressing due process was merely a reaffirmation of the Gardner plurality, and it did not in any way draw into question Ramos. The reasonableness of the Bass and O'Bryan Conclusion (now, under Simmons, held to be wrong) is confirmed by the fact that both circuits, like Virginia's Supreme Court, continued with their holdings regarding instructions on parole long after Skipper. See Peterson v. Murray, 904 F.2d 882, 886-87 (4th Cir.) (Hall, Sprouse, Wilkinson, JJ.) (\"We believe that Ramos left to the states the decision concerning what, if anything, a jury should be told about commutation, pardon, and parole.\" (citing Turner v. Bass)), cert. denied, 498 U.S. 992, 111 S. Ct. 537, 112 L. Ed. 2d 547 (1990); Knox v. Collins, 928 F.2d 657, 660 (5th Cir. 1991) (rejecting petitioner's claim \"that the Constitution mandates instruction on parole in capital cases\" and holding that \"the decision whether to require such an instruction rests entirely with the state legislature\"); cf. United States v. Chandler, 996 F.2d 1073, 1086 (11th Cir. 1993) (holding that \"the range of possible sentences [including \"the possibility of life without parole\"] that [petitioner] might receive in the event the jury did not recommend death does not fall within the definition [of \"mitigating factors as 'any aspect of a defendant's character or record and any of the circumstances of the offense.' Lockett v. Ohio . . . ; Skipper v. South Carolina,\" and so] the district court was not required to inform the jury of the possible sentences [petitioner] might face\"), cert. denied, 129 L. Ed. 2d 848, 114 S. Ct. 2724 (1994).\n\nNor do we believe it could even be contended that the decisions of the Fourth Circuit, the Fifth Circuit, and of the Virginia Supreme Court, that Ramos left the desirability of instructions on parole eligibility or ineligibility to the authority of the states, were in any way \"objectively unreasonable.\" See Stringer, 503 U.S. at 237.\n\nAs Butler recognized in holding that Arizona v. Roberson, 486 U.S. 675, 100 L. Ed. 2d 704, 108 S. Ct. 2093 (1988), announced a new rule, \"that the outcome in Roberson was susceptible to debate among reasonable minds is evidenced further by the differing positions taken by the Judges of the Courts of Appeals for the Fourth and Seventh Circuits.\" 494 U.S. at 415.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Even more so was \"the outcome in [Simmons ] . . . susceptible to debate among reasonable minds,\" as \"evidenced\" by the unanimous disagreement with that outcome by the Fourth and Fifth Circuits, and by the Virginia Supreme Court.\n\nE.\n\nWe therefore conclude that the rule in Simmons -- that due process requires that a capital defendant be allowed to rebut prosecution arguments of future dangerousness with his ineligibility for parole -- was not compelled by existing precedent, and that the state and federal Judges who held otherwise in 1988 were not objectively unreasonable in so holding.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e If, as the Court held in Sawyer, Caldwell 's limited exception that states cannot affirmatively provide inaccurate information to juries concerning their role in the sentencing process was not, because of Ramos ' seemingly categorical deference to the states on such matters, compelled, then a fortiori Simmons ' more sweeping exception that states must affirmatively correct, or at least allow the correction of, pre-existing juror misconceptions concerning state postsentencing laws and procedures, was, for the same reason, not compelled either.\n\nIt was, at the very least, not unreasonable for jurists to have concluded that the broad deference afforded the states with respect to informing juries of state law regarding commutation and parole had not been withdrawn from them by a mere plurality and a single majority footnote, the latter of which treated the due process holding so dismissively that three Justices criticized the Court as having \"unnecessarily abandoned\" this grounds for decision, Skipper, 476 U.S. at 11 (Powell, J., Concurring in the judgment, joined by Burger, C.J., and Rehnquist, J.). Tellingly, this footnote, which O'Dell now maintains compelled the result in Simmons, was not even mentioned in O'Dell's own 151-page federal habeas petition filed in 1992 on his behalf by two major, nationally-recognized law firms, Hunton \u0026 Williams, and Paul, Weiss, Rifkind, Wharton \u0026 Garrison.\n\nAs Justice O'Connor reminded in Johnson v. Texas :\n\nWhen determining whether a rule is new, we do not ask whether it fairly can be discerned from our precedents; we do not even ask if most reasonable jurists would have discerned it from our precedents. We ask only whether the result was dictated by past cases, or whether it is \"susceptible to debate among reasonable minds.\"\n\n509 U.S. at 378 (O'Connor, J., Dissenting, joined by Blackmun, Stevens, and Souter, JJ.). Considering that every Member of the Supreme Court of the United States -- the five Members of the Ramos majority and the four Dissenters -- had seemed to expressly approve, as constitutionally permissible, the practice of the several states of forbidding any argument or instruction to the jury concerning commutation, pardon, or parole, and considering that that same Court rejected a claim virtually identical to that which prevailed in Simmons, if Simmons did not announce a new rule, then we are at a loss to understand how Teague has any real meaning at all.\n\nAccordingly, we hold that Simmons announced a new rule under Teague, and, therefore, that O'Dell cannot avail himself of the rule of Simmons, unless it falls within \"one of the two narrow exceptions to the nonretroactivity principle.\" Caspari, 114 S. Ct. at 953.\n\nF.\n\nThe first exception applies to those rules that place \"'certain kinds of primary, private individual conduct beyond the power of the criminal law-making authority to proscribe,'\" Teague, 489 U.S. at 307 (quoting Mackey v. United States, 401 U.S. 667, 692, 28 L. Ed. 2d 404, 91 S. Ct. 1160 (1971) (opinion of Harlan, J.)), or \"address[ ] a 'substantive categorical guarantee accorded by the Constitution,' such as a rule 'prohibiting a certain category of punishment for a class of defendants because of their status or offense.'\" Saffle, 494 U.S. at 494 (quoting Penry, 492 U.S. at 329, 330). This exception \"is clearly inapplicable here,\" Gilmore, 508 U.S. 333, 345, 124 L. Ed. 2d 306, 113 S. Ct. 2112, because the rule announced in Simmons \"neither decriminalizes a class of conduct nor prohibits the imposition of capital punishment on a particular class of persons [because of their status or offense].\" Saffle, 494 U.S. at 495.\n\nThe second exception applies to \"'watershed rules of criminal procedure' implicating the fundamental fairness and accuracy of the criminal procedure.\" Id. (quoting Teague, 489 U.S. at 311). This exception \"is clearly meant to apply only to a small core of rules requiring observance of those procedures that . . . are implicit in the concept of ordered liberty.\" Graham, 506 U.S. at 478 (internal quotations omitted). \"A rule that qualifies under this exception must not only improve accuracy, but also '\"alter our understanding of the bedrock procedural elements \"' essential to the fairness of a proceeding.\" Sawyer, 497 U.S. at 242 (quoting Teague, 489 U.S. at 311 (quoting Mackey, 401 U.S. at 693)). And, \"because we operate from the premise that such procedures would be so central to an accurate determination of innocence or guilt, . . . it is unlikely that many such components of basic due process have yet to emerge.\" Teague, 489 U.S. at 313. We do not believe that the rule announced in Simmons is on par with the rule announced in Gideon v. Wainwright, 372 U.S. 335, 9 L. Ed. 2d 799, 83 S. Ct. 792 (1963), a rule the Court has \"usually cited . . . to illustrate the type of rule coming within the exception,\" Saffle, 494 U.S. at 495; see also Gray, 116 S. Ct. 2074, 135 L. Ed. 2d 457, 1996 WL 335339 at*fn* 13, and we conclude that it does not come within the second exception to Teague.\n\nWe therefore hold that Simmons announced a new rule of which O'Dell cannot avail himself.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nIII.\n\nBefore the federal district court on habeas, O'Dell raised innumerable constitutional claims. J.A. at 281-84. Nine of those claims were raised for the first time at the state habeas proceeding,\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e although, as the state habeas court expressly found, see J.A. at 285, these claims had been ripe for presentation on direct appeal. Virginia law bars the consideration on habeas of trial errors that could be, but were not, raised on direct appeal. Slayton v. Parrigan, 215 Va. 27, 205 S.E.2d 680 (1974), cert. denied, 419 U.S. 1108, 95 S. Ct. 780, 42 L. Ed. 2d 804 (1975). Therefore, the federal district court properly held that these claims were procedurally barred from review on federal habeas under Wainwright v. Sykes, 433 U.S. 72, 53 L. Ed. 2d 594, 97 S. Ct. 2497 (1977), absent cause and prejudice.\n\nA.\n\nThe Commonwealth also argues that ten additional claims of O'Dell's before the federal habeas court are procedurally barred because the Virginia Supreme Court dismissed as untimely their appeal from the state habeas proceeding.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e After the state habeas court dismissed O'Dell's petition, he filed an \"Assignments of Error\" with the Virginia Supreme Court. Virginia law, however, requires that a \"Petition for Appeal\" be filed instead, in order to appeal from a denial of the writ of habeas corpus. By the time O'Dell attempted to correct his error, the three months to file such a petition had passed, and so the Virginia Supreme Court dismissed his Petition for Appeal as untimely under Va. S. Ct. Rule 5:17(a)(1).\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e J.A. at 216. That dismissal is sufficient to bar federal habeas review of those claims,\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e so long as the dismissal rested upon \"adequate and independent state grounds.\" Wainright, 433 U.S. at 81; see also Murdock v. Memphis, 87 U.S. (20 Wall.) 590, 636, 22 L. Ed. 429 (1875).\n\n1.\n\nThe federal habeas court, relying on James v. Kentucky, 466 U.S. 341, 80 L. Ed. 2d 346, 104 S. Ct. 1830 (1984), and Ford v. Georgia, 498 U.S. 411, 112 L. Ed. 2d 935, 111 S. Ct. 850 (1991), held that, because the distinction between assignments of error and petitions for appeal was not \"firmly established and regularly followed\" in capital cases, the Virginia Supreme Court's determination that these claims were procedurally barred as untimely was not a state ground \"adequate\" to bar federal habeas review. J.A. at 292 (quoting James, 466 U.S. at 348-49). In so holding, the district court did not conclude, and O'Dell has never maintained, that this distinction has not been \"regularly followed\";\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e rather, the district court determined that the distinction failed the first requirement of James, that it be \"firmly established.\" As a general matter, whenever a procedural rule is derived from state statutes and supreme court rules, as this one is, the rule is necessarily \"firmly established.\"\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The district court in this case, however, concluded that the many Virginia \"rules are ambiguous on the procedure for appeals from the denial of state habeas decisions,\" J.A. at 291, and therefore that the distinction between petitions for appeal and assignments of error was not \"firmly established.\"\n\nOn the face of those rules, however, we can discern no ambiguity whatsoever. Va. S. Ct. Rule 5:17(a)(1) (emphasis added) requires that a \"petition for appeal\" be filed with the clerk \"in every case in which the appellate jurisdiction of [the Virginia Supreme Court] is invoked . . . .\" Here, the Virginia Supreme Court's appellate jurisdiction was invoked, and O'Dell did not file a petition for appeal.\n\nThe Virginia Supreme Court had appellate jurisdiction over this appeal under Va. Code ยง 17-116.05:1(B) (emphasis added), which provides that,\n\nin accordance with other applicable provisions of law, appeals lie directly to the Supreme Court from a conviction in which a sentence of death is imposed, from a final decision, judgment or order of a circuit court involving a petition for a writ of habeas corpus, . . . and from [other proceedings not relevant here].\n\nContrary to the district court's Conclusion, J.A. at 290, this provision does not at all \"indicate[ ] that the same procedural rules that apply to appeals of convictions in death penalty cases also apply to appeals from decisions of circuit courts involving habeas corpus petitions.\" Rather, the section is a jurisdictional provision; the title of the section even reads, as it pertains to the above-quoted subsection, \"Cases over which Court of Appeals does not have jurisdiction.\"\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The provision does not in any way purport to control the form of the appeal for the several categories of cases that are to be appealed directly to the Virginia Supreme Court rather than to the intermediate Court of Appeals. In fact, it expressly provides that those appeals lie \"in accordance with other applicable provisions of law.\" It would be odd, then, to read this section as altering the general rule that \"in every case in which the appellate jurisdiction of [the Supreme] Court is invoked, a petition for appeal must be filed.\" Va. S. Ct. Rule 5:17(a) (emphasis added).\n\nVirginia does require the filing of assignments of error rather than a petition for appeal in its \"Special Rule Applicable to Cases in Which Sentence of Death Has Been Imposed\":\n\n(a) Upon receipt of a record pursuant to ยง 17-110.1 B, the clerk of this Court shall notify in writing counsel . . . . The case shall thereupon stand matured as if an appeal had been awarded to review the conviction and the sentence of death . . . .\n\n(b) Within 10 days after the Filing Date, counsel for the appellant shall file with the clerk . . . assignments of error upon which he intends to rely for reversal of the conviction or review of the sentence of death.\n\nVa. S. Ct. Rule 5:22 (emphasis added). It is plain, however, that this provision relates only to the direct review of death penalty sentences. That Rule 5:22 is confined to capital cases on direct review is confirmed on a number of grounds. First, the very title of the rule is \"Special Rule Applicable to Cases in Which Sentence of Death Has Been Imposed.\" A sentence of death is imposed at the end of the sentencing phase of the trial; in no manner is the sentence imposed by a subsequent denial of the writ of habeas corpus. This distinction is unmistakable in light of section 17-116.05:1, supra, which provides for direct review by the Supreme Court of both \"convictions in which a sentence of death is imposed \"and \"final decisions, judgments or orders of a circuit court involving a petition for a writ of habeas corpus.\" If the two were identical, the provision of direct Supreme Court jurisdiction for each would be redundant. Additionally, the assignments of error referenced in Rule 5:22 are those \"upon which [counsel] intends to rely for reversal of the conviction or review of the sentence of death.\" Neither remedy is available upon appeal from a denial of a writ of habeas corpus ; the denial of the writ can be either affirmed or reversed, but the underlying conviction and sentence are not being reviewed (they are only reviewable on direct appeal). Cf. Coleman v. Thompson, 501 U.S. 722, 730, 115 L. Ed. 2d 640, 111 S. Ct. 2546 (1991) (\"When a federal district court reviews a state prisoner's habeas corpus petition pursuant to 28 U.S.C. ยง 2254, it must decide whether the petitioner is 'in custody in violation of the Constitution or laws or treaties of the United States.' The court does not review a judgment, but the lawfulness of the petitioner's custody simpliciter.\" (emphasis added)).\n\nMoreover, Rule 5:22 on its own terms is triggered by receipt of a record pursuant to Va. Code ยง 17-110.1(B), a section unquestionably addressing direct review of death sentences:\n\nยง 17-110.1. Review of death sentence. --\n\nA. A sentence of death, upon the judgment thereon becoming final in the circuit court, shall be reviewed on the record by the Supreme Court.\n\nB. The proceeding in the circuit court shall be transcribed as expeditiously as possible, and the transcript filed forthwith . . . and transmitted . . . to the Supreme Court.\n\nC. In addition to consideration of any errors in the trial enumerated by appeal, the court shall consider and determine:\n\n1. Whether the sentence of death was imposed under the influence of passion, prejudice or any other arbitrary factor; and\n\n2. Whether the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant.\n\nD. In addition to the review and correction of errors in the trial of the case, with respect to review of the sentence of death, the court may:\n\n1. Affirm the sentence of death ;\n\n2. Commute the sentence of death to imprisonment for life; or\n\n3. Remand to the trial court for a new sentencing proceeding.\n\nF. Sentence review shall be in addition to appeals, if taken, and review and appeal may be consolidated.\n\nThat this section addresses only direct review is self-evident. See Payne v. Commonwealth, 233 Va. 460, 357 S.E.2d 500, 508 (Va.) (\"In death penalty cases, . . . a defendant is afforded a direct, full review as a matter of right. Code ยง 17-110.1.\" (emphasis added)), cert. denied, 484 U.S. 933, 108 S. Ct. 308, 98 L. Ed. 2d 267 (1987). As part A provides, the section is operative only \"upon the judgment [of a sentence of death] becoming final in the circuit court.\" A sentence of death does not become final when a subsequent court denies a writ of habeas corpus ; it becomes final upon the entry of the judgment by the trial court. Likewise, the proportionality review and independent examination of the sentence for arbitrariness provided for in part C occur on direct review, not habeas. And the remedies provided in part D -- \"affirming the sentence of death,\" \"commuting the sentence of death,\" and \"remanding to the trial court \" -- are not available at all to a court reviewing a denial of habeas ; they are possible only on direct review.\n\nFinally, part F makes absolutely clear that the entire section is addressed only to direct review of the death sentence itself (as even the title of the section sets forth), not even to the underlying conviction for capital murder. That underlying conviction may be, but, under this section need not necessarily be (\"if taken\"), consolidated with the direct review of the death sentence. Indeed, under Rule 5:22, that consolidation is automatic: \"The case shall thereupon stand matured as if an appeal had been awarded to review the conviction and the sentence of death . . . .\"\n\nThus, the Virginia statutory scheme is not at all ambiguous. As a general rule, a petition for appeal must be filed in every case for which review is sought by the Virginia Supreme Court. For direct review of death sentences and their accompanying capital convictions, Rule 5:22 (itself, denominated a \"special rule\") creates an exception, providing that assignments of error should instead be filed. But nowhere in that exception, or in section 17-110.1(B) to which it refers, is there any possible reference to appeals from a denial of a writ of habeas corpus. The only relevant reference to denials of writs of habeas corpus is in section 17-116.05:1, which provides merely that jurisdiction shall lie in the Supreme Court. And that section makes no reference to the form those appeals should take; so the general rule requiring a petition of appeal necessarily obtains.\n\nWe recognize that Justice Blackmun, joined by Justices Stevens and O'Connor, questioned whether the Virginia Supreme Court's dismissal of these claims as untimely constituted a state ground \"adequate\" to bar federal habeas review. See O'Dell, 502 U.S. at 997-98 (Blackmun, J.). Justice Blackmun commented that the ground \"may\" not be \"adequate\" under James and Ford because of the \"ambiguity of the Virginia statute.\" We believe, however, that upon closer inspection, there is no ambiguity at all.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e Therefore, we hold that the Virginia Supreme Court's dismissal of O'Dell's appeal from the denial of the writ of habeas corpus as untimely was a state ground \"adequate\" to bar federal habeas review.\n\n2.\n\nAlthough the district court did not agree, J.A. at 288, Justice Blackmun also commented that the Virginia Supreme Court's rejection \"may\" not have been \"independent,\" in that it \"fairly appears to rest primarily on federal law, or to be interwoven with the federal law,\" Michigan v. Long, 463 U.S. 1032, 1040, 77 L. Ed. 2d 1201, 103 S. Ct. 3469 (1983), because, as in Ake v. Oklahoma, 470 U.S. 68, 75, 84 L. Ed. 2d 53, 105 S. Ct. 1087 (1985), \"the State has made application of the procedural bar depend on an antecedent ruling on federal law.\" Justice Blackmun observed,\n\nthe Virginia Supreme Court's rejection may not be based on an independent state ground because Tharp v. Commonwealth, 211 Va. 1, 175 S.E.2d 277 (Va. 1970), requires the Virginia Supreme Court to consider whether a constitutional right was abridged before denying an extension of time for filing a petition for appeal.\n\nO'Dell, 502 U.S. at 998.\n\nJustice Blackmun then noted that this case \"may be distinguishable,\" id. at 620 n.5, from Coleman, which rejected a nearly identical claim, because here the Virginia Supreme Court was considering an untimely petition for appeal rather than the untimely notice of appeal at issue in Coleman. See also J.A. at 292 n.7 (federal district court distinguishing Coleman on same ground). But this possible distinction is refuted by the express language of Coleman . As Justice O'Connor wrote for the Court,\n\nAke was a direct review case. We have never applied its rule regarding independent state grounds in federal habeas. But even if Ake applies here, it does Coleman no good because the Virginia Supreme Court relied on an independent state procedural rule.\n\nWe are not convinced that Tharp stands for the rule that Coleman believes it does. Coleman reads that case as establishing a practice in the Virginia Supreme Court of examining the merits of all underlying constitutional claims before denying a petition for appeal or writ of error as time barred. A more natural reading is that the Virginia Supreme Court will only grant an extension of time if the denial itself would abridge a constitutional right. That is, the Virginia Supreme Court will extend its time requirement only in those cases in which the petitioner has a constitutional right to have the appeal heard.\n\nColeman, 501 U.S. at 741-42 (first and second emphases added).\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nWe agree that the rule of Ake concerning the state procedural rules and underlying federal claims does not apply in the habeas context, and, regardless, because we read Tharp the same way that the Court in Coleman did, we hold that the Virginia Supreme Court's application of Va. S. Ct. Rule 5:17(a)(1) was also an independent state ground sufficient to bar federal habeas review.\n\n3.\n\nBecause the Virginia Supreme Court's application of Rule 5:17(a)(1) was an \"adequate and independent state ground,\" federal habeas review of O'Dell's defaulted claims, which are meritless in any event,\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e is barred absent cause and prejudice. That the default was only procedural, does nothing to insulate the claims from this bar. As Justice O'Connor explained for the Court in Coleman,\n\nwe [have repeatedly] emphasized the important interests served by state procedural rules at every stage of the judicial process and the harm to the States that results when federal courts ignore these rules: \" . . . 'Each State's complement of procedural rules . . . channels, to the extent possible, the resolution of various types of questions to the stage of judicial process at which they can be resolved most fairly and efficiently.'\"\n\n501 U.S. at 749 (quoting Murray v. Carrier, 477 U.S. 478, 490-91, 91 L. Ed. 2d 397, 106 S. Ct. 2639 (1986) (quoting Reed v. Ross, 468 U.S. 1, 10, 82 L. Ed. 2d 1, 104 S. Ct. 2901 (1984))). Nor does the fact that O'Dell's failure to timely file the required petition for appeal was almost certainly unintentional insulate him from the consequences of that failure:\n\nBy filing late [petitioner] defaulted his entire state collateral appeal. This no doubt an inadvertent error, and Virginia concedes that [petitioner] did not \"understandingly and knowingly\" forgo the privilege of state collateral appeal. . . . [Nonetheless] federal habeas review of the claims is barred [absent cause and prejudice].\n\n501 U.S. at 749-50.\n\nB.\n\nHaving concluded that O'Dell procedurally defaulted nineteen of his claims (the nine under Slayton and the ten under Rule 5:17(a)(1)), we now address whether the federal habeas court could nevertheless consider those claims on the merits. As the Court held in Coleman,\n\nin all cases in which a state prisoner has defaulted his federal claims in state court pursuant to an independent and adequate state procedural rule, federal habeas review of the claims is barred unless the prisoner can demonstrate cause for the default and actual prejudice as a result of the alleged violation of federal law, or demonstrate that failure to consider the claims will result in a fundamental miscarriage of Justice.\n\n501 U.S. at 750.\n\nOn appeal, O'Dell does not even attempt to demonstrate cause and prejudice; instead, he argues that failure to consider his defaulted claims will result in a \"fundamental miscarriage of Justice\" because he has presented new evidence of \"actual innocence.\" O'Dell's claim \"of 'actual innocence' is not itself a constitutional claim, but instead a gateway through which a habeas petitioner must pass to have his otherwise barred constitutional claim considered on the merits.\" Herrera v. Collins, 506 U.S. 390, 404, 122 L. Ed. 2d 203, 113 S. Ct. 853 (1993).\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nLast Term, the Supreme Court held that the proper test for whether a habeas petitioner has established that his case is \"extraordinary\" enough to fall into that \"narrow class of cases,\" which \"implicate a fundamental miscarriage of Justice,\" McCleskey v. Zant, 499 U.S. 467, 494, 113 L. Ed. 2d 517, 111 S. Ct. 1454 (1991), is whether that petitioner has shown that \"a constitutional violation has probably resulted in the conviction of one who is actually innocent.\" Schlup v. Delo, 513 U.S. 298, 130 L. Ed. 2d 808, 115 S. Ct. 851, 867 (1995) (quoting Murray v. Carrier, 477 U.S. 478, 496, 91 L. Ed. 2d 397, 106 S. Ct. 2639 (1986)) (emphasis added).\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e Thus, in order to have his procedurally defaulted claim reviewed nonetheless on federal habeas, O'Dell must show that \"it is more likely than not that no reasonable juror would have convicted him in light of the new evidence.\"\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Id.\n\nThe new evidence that O'Dell proffers as support for his claim of actual innocence is a recently conducted DNA test of blood found on O'Dell's clothing. In his statement accompanying the denial of certiorari on direct review of the state habeas denial, Justice Blackmun expressed the view that \"there are serious questions as to whether O'Dell committed the crime\" in light of this DNA evidence. O'Dell, 502 U.S. at 998 (Blackmun, J.). Because of these concerns detailed in Justice Blackmun's statement respecting denial of certiorari, J.A. at 300, the federal district court conducted a full evidentiary hearing on the DNA evidence. At that hearing, O'Dell presented the results of DNA tests performed on his blood-soaked clothing some five years after the crime, in an effort to refute the evidence at his original trial that the blood stains were consistent with Helen Schartner's blood but not with his own.\n\n1.\n\nAt O'Dell's original trial, the Commonwealth's expert Jacqueline Emrich testified at length about the numerous tests she performed upon the various relevant blood stains.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e In addition to testing for standard ABO blood type, Emrich tested for the following ten enzymes: EsD, PGM, PepA, GLO, EAP, AK, ADA, GC, Tf, and Hp. J.A. at 1851. Ms. Emrich tested blood stains on O'Dell's blue jacket, and found them consistent with Helen Schartner's blood and inconsistent with O'Dell's. J.A. at 1857. She likewise tested three separate stains on O'Dell's checkered shirt, and found them all consistent with Schartner's blood but not O'Dell's. J.A. at 1859-60. And she tested two stains on O'Dell's tan jacket, finding them both consistent with Schartner's blood but not O'Dell's. J.A. at 1861. Additionally, Ms. Emrich tested O'Dell's jeans; most of Helen Schartner's torn clothing; a sardine can; a red cloth; and the right front seat back, the right seat back, the seat cover, the left seat back, and the right rear floormat of O'Dell's car -- all of which revealed blood stains consistent with Helen Schartner's blood but not with O'Dell's. J.A. at 1862-75.\n\nHelen Schartner had type O blood; O'Dell has type A. J.A. at 1850, 1852. Five of the their enzyme markers were the same, and five were different. J.A. at 1853-55. Although not all ten enzymes types were identifiable from every single stain, each stain mentioned above proved to be type O blood and matched Helen Schartner's blood (in a way inconsistent with O'Dell's) for every single identifiable enzyme. In addition, Ms. Emrich also found one other blood stain in O'Dell's car that was different from both Schartner's and O'Dell's blood. J.A. at 1871.\n\n2.\n\nFive years after the trial, O'Dell requested permission to have DNA testing performed on the evidence that was introduced at trial, testing which was not commonly available when he was tried in 1986. The Commonwealth consented, and O'Dell proposed that the evidence be sent to LifeCodes laboratory. The Commonwealth again consented. J.A. at 2895. LifeCodes was only able to test the shirt and the blue jacket, because the blood samples on the remaining items had deteriorated too much in the five years to be of use. See Petitioner's Reply Memorandum in Support of Motion to Supplement Oral Argument at 3 \u0026 Ex. A. The LifeCodes Report concluded that the blood stain on the shirt \"can be excluded as having a common origin\" with either Helen Schartner's or O'Dell's blood, but that the blood on the blue jacket \"matched the DNA-PRINT pattern from the blood of Helen Schartner.\" J.A. at 2990 (emphasis added).\n\nBefore the state habeas court, and again before the federal habeas court, O'Dell presented expert testimony embracing the first LifeCodes Conclusion and attacking the second. Specifically, his experts testified that, based upon their own evaluation of the LifeCodes data, the variations between the blood on the blue jacket and Schartner's blood exceeded LifeCodes' own match criterion of 1.8%, and so the jacket should be considered \"inconclusive\" rather than a \"match.\" J.A. at 2602, 2860, 2871.\n\nThe Commonwealth's experts agreed that the DNA tests proved that the blood on O'Dell's shirt came from neither Schartner nor O'Dell, but they testified that the LifeCodes data demonstrate that the blood on the blue jacket matched Helen Schartner's blood, for two reasons. First, as O'Dell's experts were forced to largely concede, J.A. at 2869-71, the DNA patterns on the blue jacket fell well within the state laboratory's and the FBI's match criterion of 2.5%. J.A. at 2728, 2731, 2802, 2808, 2812-13, 2838. And second, as O'Dell's experts again had to concede, J.A. at 2871-72, \"band shifting\" and \"partial degradation,\" had occurred in the samples and could account for the differentials, J.A. at 2804, 2821, 2839-40, 2990 -- which is why LifeCodes performed further tests and ultimately concluded the blue jacket was a \"match,\" J.A. at 2732-33, 2738-39, 2840, 2891, 2990.\n\nO'Dell's experts, in turn, had two responses. First, under the standards of the National Research Council -- described by the Commonwealth's expert as a committee issuing \"recommendations,\" not \"accepted by the scientific community generally,\" and currently under revision because \"over 300 distinguished scientists\" petitioned for their modification due to inaccuracies, J.A. at 2827-30 -- \"each laboratory should determine their own match criteria.\" J.A. at 2832, 2857. But see J.A. at 2738, 2853. Therefore, O'Dell's experts argued, it was improper for the Commonwealth's experts to substitute the state laboratory's and the FBI's match criteria for LifeCodes' (although it was apparently proper for them to substitute their Conclusion for LifeCodes'). Second, according to O'Dell's experts and that same NRC Report, use of a monomorphic probe-- upon which LifeCodes relied to correct the conceded band shifting, J.A. at 2839-40 -- is ineffective to correct band shifting. J.A. at 2840-43, 2872. Of course, O'Dell's primary expert, Dr. Spence, a medical geneticist, performed approximately 98% of his work in a clinical environment where, if band shifting occurred, he could simply take another sample from his living patients. J.A. at 2880-87, 2598, 2604-05. The Commonwealth's expert countered, \"in the forensic field . . . we only have so much of the sample. It is not like in the clinical laboratory environment where you have a lot of blood where you can go back and repeat a sample. . . . [Therefore] we don't ignore [band shifting and partialling; we try to correct them].\" J.A. at 2846-47, 2742-43.\n\n3.\n\nThe federal habeas court's factual findings regarding this testimony are not particularly helpful,\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e but the court did expressly credit O'Dell's experts concerning the impropriety of substituting the state crime lab's and the FBI's match criterion for LifeCodes'. J.A. at 308. The district court further commented that use of monomorphic probes to correct for band shifting is \"controversial\" Id. (citing People v. Keene, 156 Misc. 2d 108, 591 N.Y.S.2d 733 (N.Y. Sup. Ct. 1992)). Together, these two findings suggest that it agreed that the stains on the jacket were \"inconclusive.\"\n\nNevertheless, the district court was forced to conclude, J.A. at 308, under the legal standard then in force, that O'Dell's new evidence failed to establish actual innocence, because it did not demonstrate \"by clear and convincing evidence that but for constitutional error, no reasonable juror would have found the petitioner\" guilty of murder. This standard, established by the Court in Sawyer v. Whitley, 505 U.S. 333, 336, 120 L. Ed. 2d 269, 112 S. Ct. 2514 (1992), for claims of actual innocence of the death penalty, was adopted by this circuit for claims of actual innocence of the underlying crime as well. Spencer, 18 F.3d at 236. Of course, the Court subsequently rejected application of the Sawyer standard to actual innocence claims at the guilt phase of trials, instead adopting the more lenient test of Murray v. Carrier, 477 U.S. at 496: whether petitioner has shown that \"'a constitutional violation has probably resulted in the conviction of one who is actually innocent,'\" that is, whether \"it is more likely than not that no reasonable juror would have convicted him in light of the new evidence.\" Schlup, 115 S. Ct. at 867 (quoting Carrier).\n\nBecause the federal district court applied Sawyer instead of Carrier, and because the court did in a footnote dictum find that O'Dell would have met a less demanding standard of \"a 'fair probability' that, in light of all probative evidence available at the time of his federal evidentiary hearing, 'the trier of the facts would have entertained a reasonable doubt of his guilt,'\" J.A. at 308 n.18, O'Dell argues that, at the very least, we must remand the case to the district court to determine whether O'Dell's evidence meets the newly applicable standard. Under the particular facts of this case, however, and given that the district court has already made the kinds of findings that are peculiarly within its province, we disagree.\n\nThe \"fair probability\" standard relied upon by the district court in its obiter dictum, drawn from Justice Powell's plurality opinion in Kuhlmann v. Wilson, 477 U.S. 436, 454 n.17, 91 L. Ed. 2d 364, 106 S. Ct. 2616 (1986), is \"similar\" to the Carrier standard, Schlup, 115 S. Ct. at 863, and has been treated as functionally the same, id. at 864-65. Under Schlup, though, it is the Carrier formulation that is now controlling: Has O'Dell established that \"it is more likely than not that no reasonable juror would have convicted him in the light of the new evidence?\" Id. at 867.\n\nThis question is a mixed question of fact and law;\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e indeed, the Dissent in Schlup characterized it as\n\na classic mixing of apples and oranges. \"More likely than not\" is a quintessential charge to the finder of fact, while \"no reasonable juror would have convicted him in the light of the new evidence\" is an equally quintessential Conclusion of law . . . .\n\nId. at 873 (Rehnquist, C.J., Dissenting). Because this \"hybrid . . . is bound to be a source of confusion,\" id., we pause to attempt to fathom it fully.\n\nThe district court, in making this determination, must look at two elements: first, all of the evidence that the jury heard at trial, and second, the newly proffered evidence. See Schlup, 115 S. Ct. at 867. If it were to look at only the former, and to ask only whether no reasonable juror could have convicted, then it would be doing nothing more than evaluating the sufficiency of the evidence under Jackson v. Virginia, 443 U.S. 307, 61 L. Ed. 2d 560, 99 S. Ct. 2781 (1979), a question of law reviewable de novo. But the Carrier inquiry is different from that under Jackson in two respects. First, it is asking not whether no reasonable juror could convict -- a question of \"power\" -- but whether no reasonable juror would convict -- a question of \"likely behavior.\" Schlup, 115 S. Ct. at 868. Thus, the Carrier standard \"requires the district court to make a probabilistic determination about what reasonable, properly instructed jurors would do.\" Id. Second, Carrier adds to the calculus the quantum of new evidence that the petitioner presents, evidence whose credibility must be determined and evidence which may call into question the credibility of prior evidence presented at trial. Id. at 868-69.\n\nAscertaining the credibility of evidence is \"quintessentially\" a task for the fact-finder, and so the district court's factual findings regarding the credibility of testimony it has actually heard are findings subject to review only under a clearly erroneous standard. But the federal district court is in no better position than an appellate court to then add that new evidence to the evidence that was presented at trial or to speculate as to the likelihood that no reasonable juror would convict based on the sum of all the evidence. Both courts, reviewing a cold trial record, must determine whatever inferences and deductions logically and reasonably can be made from all of the evidence and then, to the best of their ability, guess as to the likelihood that no reasonable juror would make those inferences necessary for conviction. This is in some sense an application of \"law\" to facts. In any event, we believe that such determinations are, for lack of a better word, \"mixed\" questions of law and fact, and so are reviewable de novo.\n\nIn Schlup the Court remanded to the Court of Appeals with instructions to remand to the district court, but it did so there only because that was \"the most expeditious procedure\" in light of the \"fact-intensive nature of the inquiry, together with the District Court's ability to take testimony from the few key witnesses if it deems that course advisable.\" 115 S. Ct. at 869. In Schlup, \"both the Court of Appeals and the District Court [had] evaluated the record under an improper standard,\" id., and the district court had heard no testimony whatsoever, id. at 854. Here, in contrast, the district court has conducted a full evidentiary hearing, made adequate factual findings, and we are now able to apply the correct legal standard on appeal.\n\nBecause the district court made sufficient factual findings as to the credibility of the witnesses that it heard, and because the remaining portion of the Carrier inquiry is simply an application of law to the combination of those facts and the trial record facts, we turn ourselves to the question of whether O'Dell has established that it is more likely than not that no reasonable juror would convict him.\n\n4.\n\nWe do not believe that O'Dell has come even close to meeting either the Kuhlmann standard or the \"similar\" Carrier standard. A reasonable juror examining all of the evidence would have confronted the following.\n\nFirst, the mountain of circumstantial evidence. On the night of the murder, both O'Dell and Schartner were at the County Line Lounge. O'Dell left the club within fifteen minutes of when Schartner left.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Not more than two and a half hours later, O'Dell appeared at a convenience store with blood on his face, hands, hair, and clothes. The next morning, O'Dell informed his former girlfriend that he was going to Florida, and, several hours later, Schartner's bloody body was found in a field across the street from the County Line Lounge.\n\nO'Dell's first explanation for being covered in blood, which he gave his former girlfriend that next morning and which he now admits was a lie, was that he had vomited blood all over himself. His second explanation, which he told the police when he was arrested, was that the blood was from a nose bleed caused by being struck when he attempted to stop a fight at another club that same night.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nHelen Schartner's head had been beaten brutally with a \"linear cylindrical object.\" J.A. at 1414. O'Dell had been seen about a week earlier with a pellet gun in his car, J.A. at 1531-36, and medical testimony established that Schartner's wounds were consistent with the weight and shape of that type of pellet gun, J.A. at 1413-17. Moreover, tire tracks found at the crime scene had the \"identical\" design elements as the tires on O'Dell's car, J.A. at 1258, 1266. After examining patterns for some two thousand different tires and four or five thousand different design units, the Commonwealth's expert could not find a single tire, other than O'Dell's, that matched the tire tracks found at the scene. J.A. at 1258-59, 1263.\n\nAdditionally, the direct physical evidence linking O'Dell to the murder is overwhelming. On the right front seatcover of O'Dell's car, investigators found a head hair consistent with Helen Schartner's but not with O'Dell's hair. J.A. at 1912-13. On the \"left seat driver's seat back cover\" of O'Dell's car, investigators found two hairs consistent with Schartner's head hairs and inconsistent with O'Dell's, three hairs consistent with O'Dell's head hairs and inconsistent with Schartner's, and two hairs consistent with neither's. J.A. at 1913-14. And, on the right front floor mat of O'Dell's car, investigators found one hair, consistent with Helen Schartner's pubic hair, and not with O'Dell's. J.A. at 1914-15.\n\nInvestigators also found, in Schartner's vagina and anus and on O'Dell's shirt, seminal fluid that was consistent with a mixture of O'Dell's and Schartner's bodily fluids. J.A. at 1889-96. O'Dell on this appeal argues strenuously that the alleged \"mixture\" of bodily fluids found in Schartner's anus shows that he could not have raped her, because Schartner could not secrete vaginal fluids from her anus. Not only is O'Dell not free to challenge this now on federal habeas (because he has proffered no new evidence relating to the seminal fluids and the Virginia Supreme Court expressly found that the vaginal and anal fluids were consistent with O'Dell's, O'Dell, 364 S.E.2d at 495), he is wrong in any event. As the Commonwealth's expert Ms. Emrich explained at trial, and as O'Dell's appellate counsel apparently misunderstands, the fluid found in Schartner is the predictable result of mixing fluids from two secretors, like Schartner and O'Dell. J.A. at 1881-84.\n\nSecretors are persons whose bodily fluids carry with them characteristics of their blood type; both Schartner and O'Dell were secretors. Schartner's blood type was O, and her PGM type and PepA type (the two enzymes that are evident in bodily fluids) were 2-1 and 1, respectively. O'Dell's blood type is A, his PGM type 1, and his PepA type 1. Because both Schartner and O'Dell had the same PepA type (1), the presence of that enzyme is not particularly revealing. The other two types, however, are quite revealing.\n\nAs Emrich explained, both blood types and enzyme types function in essentially the same way. Blood type A indicates the presence of the A antigen, type B indicates the presence of B, AB indicates the presence of both, and O indicates the presence of neither. If you mix A with B, the mixture is AB; if you mix either A or B with AB, the mixture is still AB; and if you mix A or B or AB with O, the mixture is A, or B, or AB (depending on which you added to O). Likewise, there are three common types of PGM, 1, 2, and 2-1. Type 2-1, like blood type AB, is simply a combination of types 1 and 2. Thus, if you mix 1 with 2, the combination is 2-1, as is the combination of either 1 or 2 with 2-1. J.A. at 1881-88.\n\nIn Schartner's vagina, Emrich found seminal fluid indicating blood type A, PepA 1, and PGM 2-1. J.A. at 1889-90. The blood type (A) is consistent with a mixture of O'Dell's (A) and Schartner's (O) bodily fluids, the PepA type is consistent with both of their fluids, and the PGM type (2-1) is consistent with a mixture of O'Dell's (1) and Schartner's (2-1) bodily fluids. J.A. at 1890. That same mixture was found in Schartner's anus, J.A. at 1891-92, and on three stains on O'Dell's shirt, J.A. at 1895-96.\n\nEven more incriminating were the spermatozoa found in Schartner's genital swabs and in her genital scrapings. Those spermatozoa were blood type A, PepA 1, and PGM 1, consistent with O'Dell's blood and enzyme types and not with Schartner's. J.A. at 1893-94. Thus, the spermatozoa, which could only have come from a man, matched perfectly the sperm cells of Joseph O'Dell, and the seminal fluid, which presumably came from the same man who produced the spermatozoa, was entirely consistent with a mixture of O'Dell's and Schartner's bodily fluids.\n\nAnd herein lies the obvious failing in O'Dell's argument. O'Dell maintains that, because seminal fluid type A, PepA 1, PGM 2-1, was found in Schartner's anus, and because the anus does not secrete vaginal fluids (and, presumably, he for some reason also asserts, by silent implication and without evidence, that there are no other bodily secretions in the anus), the man who raped Schartner must have had type A, PepA 1, PGM 2-1 semen, not type A, PepA 1, PGM 1 like O'Dell's. But, as the expert testimony explained, seminal fluid is capable of mixing with other fluids to pick up their markers; the spermatozoa, on the other hand, were the man's alone, and they were type A, PepA 1, PGM 1. Unless we are to indulge the fanciful possibility that the sperm and the seminal fluid found in Schartner came from different men, the only reasonable implication from this is that the rapist's sperm and seminal fluid (prior to mixing with Schartner's fluids) were both originally type A, PepA 1, PGM 1-- exactly like O'Dell's.\n\nIn addition, a reasonable juror would also consider the testimony of Steven Watson, to whom O'Dell confessed to murdering Helen Schartner. Watson testified that O'Dell told him in jail that he had met Schartner at the County Line Lounge, bought her a few drinks, took her riding in his green Camaro, tried to \"get a little\" from her, and, when she refused to \"give it up,\" strangled her and dumped her body. J.A. at 1674, 1685. Watson also testified that O'Dell had told him that \"he was going to walk on the charge\" because \"they didn't have no evidence\" and \"no one had actually seen him kill her.\" J.A. at 1675, 1686. Watson further testified that he had never seen anything about the murder on television or in the newspaper, J.A. at 1675, 1686, and that he had neither been offered nor received anything in return for his testimony, J.A. at 1675-76, 1680-82.\n\nThe jury heard at great length about Watson's prior convictions, and O'Dell cross-examined him and other witnesses repeatedly attempting to uncover any deal between Watson and the authorities. J.A. at 1680-81, 1689-96, 2023-24, 2050. In addition, the jury heard about the recent charges against Watson's wife that had been dropped and against Watson that had been plea bargained to three years probation, J.A. at 1689-92, and it heard testimony from a state trooper that Watson \"wanted a deal,\" meaning \"he didn't want to go to prison,\" J.A. at 2050. Nonetheless, the Virginia Supreme Court expressly found that \"O'Dell was unable to prove a plea agreement existed between Watson and the Commonwealth.\" O'Dell, 364 S.E.2d at 498 n.4.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nAnd, finally, there was all of the blood evidence introduced at trial. The Commonwealth's expert, Ms. Emrich, testified at length regarding the great quantities of blood found on O'Dell's clothing and car, all of which was consistent with Schartner's blood and inconsistent with O'Dell's. See supra at 60-61. Helen Schartner's combination of blood and enzyme type occurs in .3% (three out of a thousand) of the population; O'Dell's occurs in .08% (eight out of ten thousand). J.A. at 1921. The DNA evidence that O'Dell introduced at the federal habeas hearing was in no way inconsistent with that testimony, J.A. at 2815, as even O'Dell's expert was forced to concede, J.A. at 2636, 2878.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e DNA testing is simply more discriminating than electrophoretic testing; the latter limits a blood sample to a range of people (in this case, .3% of the population), whereas the former can limit it to just one individual. J.A. at 2815, 2878.\n\nPlus, a reasonable juror would have been confronted with O'Dell's new DNA evidence. That juror would have seen the LifeCodes Report, the Commonwealth's experts, and O'Dell's expert all agreeing that one of the stains on his shirt was from neither O'Dell nor Schartner. Of course, this evidence would have contradicted O'Dell's \"alibi,\" that the blood on his clothing came from his own nose when he was struck stopping a bar fight.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e And the juror would have reviewed the LifeCodes DNA report conclusively stating that the blood on O'Dell's jacket was Helen Schartner's. To be sure, that juror would also have been confronted with the conflicting testimonies of the Commonwealth's and O'Dell's experts concerning the inferences to be drawn from the data upon which LifeCodes relied, and, because the federal district court found that the blood on the jacket was \"inconclusive,\" we assume that the testimony of O'Dell's expert was at least credible. But nonetheless, a reasonable juror would have been presented with all the evidence: the LifeCodes report (stating conclusively that DNA proved the blood was Schartner's), the Commonwealth's expert's testimony (stating that the data, even unadjusted for band shifting, fell within the Virginia crime lab's and the FBI's criteria for a positive DNA match), and O'Dell's expert (agreeing that band shifting had occurred but arguing that the blood evidence was \"inconclusive\" because it fell slightly outside LifeCodes' unadjusted match criterion of 1.8%).\n\nAnd, finally, a reasonable juror could have considered that O'Dell had been previously convicted in Florida of a crime virtually identical to this one, and that he had been paroled, after serving eight years on a 99-year sentence, only fourteen months before Schartner was murdered. There, the victim testified that O'Dell had abducted her, robbed her, struck her several times on the head with his gun, and choked her, all in an effort to force her to submit to his sexual advances. See O'Dell, 364 S.E.2d at 510; J.A. at 2345-47. This testimony could very well have been admitted at trial as indicative of O'Dell's modus operandi, see Spencer v. Commonwealth, 240 Va. 78, 393 S.E.2d 609, 616-17 (Va.), cert. denied, 498 U.S. 908, 112 L. Ed. 2d 235, 111 S. Ct. 281 (1990); cf. Fed. R. Evid. 404(b); Weinstein's Evidence P404[16] at 404-100 to 404-102, and, regardless of its admissibility, should properly be considered in assessing O'Dell's claim of \"actual innocence,\" Schlup, 115 S. Ct. at 867.\n\nWhen viewing all of this evidence -- being together at the County Line Lounge, leaving within fifteen minutes of each other, being covered with blood, planning to go suddenly to Florida, having inconsistent alibis, plus the wounds matching his gun, the tracks matching his tires, the hairs, the semen, the spermatozoa, the blood enzymes, the blood DNA on the jacket, the confession, and the nearly identical earlier crime -- we do not believe it can even remotely be claimed that O'Dell has established that it is more likely than not that no reasonable juror would have convicted him. The only thing that O'Dell has demonstrated is that one of the many blood stains on his clothing did not come from either himself or Helen Schartner; that he also had someone else's blood on his shirt by no means shows that he did not murder Helen Schartner, particularly in light of the vast other evidence that he did. We therefore hold that O'Dell has not passed through the \"narrow\" gateway of actual innocence, and so are barred from reviewing his procedurally defaulted claims on federal habeas.\n\nIV.\n\nO'Dell also challenges the federal district court's decision to grant him a full evidentiary hearing on only the DNA evidence, without allowing him to present other \"new\" evidence disputing the expert testimony at trial concerning the effect of intermingling bodily fluids, other unspecified circumstantial evidence linking him to the crime, and the testimony of cellmate Stephen Watson that O'Dell had confessed. We conclude that the district court was entirely within its discretion in so limiting the hearing.\n\nO'Dell had the full opportunity to develop these factual bases in state court. In Keeney v. Tamayo-Reyes, 504 U.S. 1, 11, 118 L. Ed. 2d 318, 112 S. Ct. 1715 (1992), the Supreme Court held that a federal habeas petitioner\n\nis entitled to an evidentiary hearing if he can show cause for his failure to develop the facts in state-court proceedings and actual prejudice resulting from that failure.\n\nThe Court also \"adopted the narrow exception to the cause-andprejudice requirement,\" holding that\n\n[a] habeas petitioner's failure to develop a claim in state court proceedings will be excused and a hearing mandated if he can show that a fundamental miscarriage of Justice would result from failure to hold a federal evidentiary hearing.\n\nId. at 11-12. Except in regards to Watson's testimony, O'Dell makes no claim of cause or prejudice. Instead, he argues that it would be \"a fundamental miscarriage of Justice\" not to hold an evidentiary hearing on these other claims. Petitioner's Br. at 53. For analogous reasons to those explained above, we do not believe O'Dell has come even close to demonstrating a fundamental miscarriage of Justice from the district court's decision not to grant him an unrestricted evidentiary hearing.\n\nO'Dell also claims that he has demonstrated cause and prejudice for his failure to develop the factual record in state court concerning Watson's testimony. O'Dell has continually maintained that Watson gave false testimony about O'Dell's confession in exchange for a plea agreement with the authorities, and he now proffers an affidavit of a private investigator who interviewed Watson some five years after the trial and claims to have uncovered some incriminating statements. O'Dell argues that Watson's alleged perjury and the prosecution's failure to correct that perjury (by disclosing that plea agreement as required by Brady v. Maryland, 373 U.S. 83, 10 L. Ed. 2d 215, 83 S. Ct. 1194 (1963)), along with the trial court's limitation of his cross examination of Watson, constituted cause for his failing to adequately develop the factual record before the state court.\n\nWe disagree. Although the alleged perjury and prosecution coverup is external to O'Dell, the only \"new\" evidence he has is the affidavit from his investigator's interview of Watson. O'Dell has proffered no reason why his investigator was not able to interview Watson before trial. Moreover, the state court allowed O'Dell considerable leeway in cross-examining Watson about any plea bargains or deals, and Watson repeatedly denied any such agreements. J.A. at 1680-81, 1689-96, 2023-24.\n\nAnd, regardless, O'Dell could not possibly show any prejudice. First, his \"new evidence\" was of dubious value. The private investigator, who has never had his story subjected to cross-examination, claimed that Watson stated that he really did not know \"how the girl was killed\" (contradicting his trial testimony that O'Dell said he had strangled her), that O'Dell \"could have been just bragging,\" and that \"to [his] knowledge, there was no deals, they didn't go through; . . . [He] did not know of any deals at all.[He's] not saying there wasn't, but [he himself] did not know of any.\" J.A. at 238-39 (emphasis omitted). None of these statements prove, or even suggest, the presence of a plea bargain, nor do they prove O'Dell's innocence, as the district court expressly found before concluding \"the new evidence does not merit a hearing.\" J.A. at 345.\n\nSecond, even if it were of value, the evidence was almost certainly cumulative. The jury heard, at length, that Watson's family had a reputation for untruthfulness, that Watson was a seven-time convicted felon, that Watson and his wife had recently been facing criminal charges, that Watson had wanted \"to make a deal\" to avoid prison time, and that recent charges against Watson's wife had been dropped and Watson had received only three years probation on multiple breaking and entering charges. We do not think that O'Dell's investigator's claims would have substantially increased the reasons that the jury had to doubt Watson's credibility and to scrutinize his story carefully.\n\nGiven the overwhelming other evidence of guilt detailed above, we are certain that nothing said by this investigator concerning Watson would have given any juror reasonable doubt as to whether O'Dell in fact murdered Helen Schartner on the night of February 5, 1985.\n\n\"Federal Courts are not forums in which to relitigate state trials.\" Barefoot v. Estelle, 463 U.S. 880, 887, 77 L. Ed. 2d 1090, 103 S. Ct. 3383 (1983). Here, the Virginia Supreme Court expressly found that,\n\nat trial, the court permitted O'Dell to fully develop all pretrial contacts and negotiations Watson had with the Commonwealth. O'Dell was unable to prove a plea agreement existed between Watson and the Commonwealth.\"\n\nO'Dell, 364 S.E.2d at 498 n.4. Under 28 U.S.C. ยง 2254(d), this factual finding is entitled to a presumption of correctness, and O'Dell has given us no \"convincing evidence that the factual determination by the State court was erroneous.\"\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nConclusion\n\nThe judgment of the district court granting the petitioner's writ of habeas corpus is reversed, and the case is remanded with instructions to reinstate the death sentence. Likewise, the portion of the district court opinion finding that petitioner had not procedurally defaulted the claims that he failed to properly appeal from the state habeas court is reversed. The remainder of the district court opinion, finding that petitioner has not demonstrated actual innocence, is affirmed under the legal standard of Schlup.\n\nREVERSED IN PART AND AFFIRMED IN PART\n\nDisposition\n\nREVERSED IN PART AND AFFIRMED IN PART\n\nERVIN, Circuit Judge, Concurring in part and Dissenting in part:\n\nI agree with the majority that the district court was correct in holding that O'Dell's challenges to his conviction are without merit, and I concur in those portions of the majority opinion affirming the district court's judgment denying O'Dell relief from his conviction.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nHowever, I must respectfully Dissent from that part of the majority opinion holding that the district court erred in vacating O'Dell's death sentence on the basis of the Supreme Court's recent decision in Simmons v. South Carolina, 512 U.S. 154, 114 S. Ct. 2187, 129 L. Ed. 2d 133 (1994). For the reasons that follow, I am persuaded that Simmons did not announce a \"new rule\" under Teague v. Lane, 489 U.S. 288, 103 L. Ed. 2d 334, 109 S. Ct. 1060 (1989), and that the district court was also right in granting O'Dell relief from his sentence. I would, therefore, affirm the district court's judgment in its entirety, and I must Dissent from the majority's failure to uphold that portion of the district court's decision.\n\nI.\n\nA.\n\nIn Simmons v. South Carolina, 512 U.S. 154, 114 S. Ct. 2187, 129 L. Ed. 2d 133 (1994), the Supreme Court reversed a defendant's capital sentence after determining that his constitutional rights had been violated when the trial court refused to allow defense counsel to inform the jury that the defendant was statutorily ineligible for parole. During sentencing deliberations, the parole issue occurred to the jury, which asked the Judge: \"Does the imposition of a life sentence carry with it the possibility of parole?\" Id. at 2192. The trial Judge responded that parole eligibility \"is not a proper issue for your consideration.\" Id.\n\nBefore the United States Supreme Court, Simmons claimed that the trial court's refusal to inform the jury that he would be ineligible for parole had violated his rights under the Due Process Clause of the United States Constitution.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Seven Justices agreed.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Writing for a plurality that included Justices Stevens, Ginsburg, and Breyer, Justice Blackmun stated: \"We hold that where the defendant's future dangerousness is at issue, and state law prohibits the defendant's release on parole, due process requires that the sentencing jury be informed that the defendant is parole ineligible.\" Id. at 2190 (plurality opinion). Justice Blackmun's opinion appears to require that a court inform the jury sua sponte that the defendant will remain imprisoned for life, regardless of whether the defendant requests such an instruction.\n\nWe read the precise holding of Simmons, however, more narrowly. Justice O'Connor based her opinion Concurring in the judgment, in which the Chief Justice and Justice Kennedy joined, on the \"hallmark of due process\" that a defendant is entitled to \"meet the State's case against him.\" Id. at 2200 (O'Connor, J., Concurring in the judgment). As Justice O'Connor's opinion encapsulates the \"position taken by those Members [of the Court] who concurred in the judgments on the narrowest ground,\" Marks v. United States, 430 U.S. 188, 193, 51 L. Ed. 2d 260, 97 S. Ct. 990 (1977), we use her statement of the Simmons \"rule\" as the benchmark for our analysis below: \"Where the State puts the defendant's future dangerousness in issue, and the only available alternative sentence to death is life imprisonment without possibility of parole, due process entitles the defendant to inform the capital sentencing jury--by either argument or instruction--that he is parole ineligible.\" Id. at 2201 (O'Connor, J., Concurring).\n\nB.\n\nThe Commonwealth concedes that the facts of this case are indistinguishable from those in Simmons. As in Simmons, the trial court denied the defendant's request for an instruction on parole ineligibility, and, like Simmons, O'Dell was prohibited from rebutting the prosecution's argument that he would be dangerous in the future with evidence that he would be incarcerated for the remainder of his life.\n\nThe Commonwealth attempts to distance itself from Simmons by arguing that the case announced a \"new rule\" of constitutional criminal procedure inapplicable on collateral review to O'Dell's already final conviction under the non retroactivity doctrine of Teague v. Lane, 489 U.S. 288, 103 L. Ed. 2d 334, 109 S. Ct. 1060 (1989) (plurality opinion). Review of the district court's application of Teague is conducted de novo. See Spaziano v. Singletary, 36 F.3d 1028, 1041 (11th Cir. 1994), cert. denied, U.S. , 115 S. Ct. 911, 130 L. Ed. 2d 793 (1995).\n\nAs a general proposition, \"'a case announces a new rule if the result was not dictated by precedent existing at the time the defendant's conviction became final.'\" Turner v. Williams, 35 F.3d 872, 879 (4th Cir. 1994) (quoting Teague, 489 U.S. at 301 (plurality opinion)), cert. denied, 194 U.S. 279, 24 S. Ct. 719, 48 L. Ed. 979 (1995). In Caspari v. Bohlen, 510 U.S. 383, 114 S. Ct. 948, 127 L. Ed. 2d 236 (1994), the Court set forth the following three-pronged approach for determining what constitutes a new rule:\n\nFirst, the court must ascertain the date on which the defendant's conviction and sentence became final for Teague purposes. Second, the court must \"surve[y] the legal landscape as it then existed,\" and \"determine whether a state court considering [the defendant's] claim at the time his conviction became final would have felt compelled by existing precedent to conclude that the rule [he] seeks was required by the Constitution.\" Finally, even if the court determines that the defendant seeks the benefit of a new rule, the court must decide whether that rule falls within one of the two narrow exceptions to the nonretroactivity principle.\n\nId. at 953 (citations omitted) (quoting Graham v. Collins, 506 U.S. 461, , 113 S. Ct. 892, 898, 122 L. Ed. 2d 260 (1993), and Saffle v. Parks, 494 U.S. 484, 488, 108 L. Ed. 2d 415, 110 S. Ct. 1257 (1990)). Proceeding through the Caspari analysis, we note first that O'Dell's conviction became final on October 3, 1988. O'Dell v. Virginia, 488 U.S. 871, 102 L. Ed. 2d 154, 109 S. Ct. 186 (1988). Our task, then, is to determine whether an objectively reasonable jurist in October 1988 would have felt compelled to conclude that the rule applied in Simmons was \"required by the Constitution.\" Turner v. Williams, 35 F.3d at 880.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe two major cases on which the Simmons Court principally relied had been decided in 1977 and 1986. See Gardner v. Florida, 430 U.S. 349, 51 L. Ed. 2d 393, 97 S. Ct. 1197 (1977), and Skipper v. South Carolina, 476 U.S. 1, 90 L. Ed. 2d 1, 106 S. Ct. 1669 (1986).\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIn Gardner, the Supreme Court ruled that the Due Process Clause does not permit the execution of a person \"on the basis of information which he had no opportunity to deny or explain,\" in that case a presentence report kept from the defendant. 430 U.S. at 362. In Skipper, the Court elaborated on the principle it had announced in Gardner and held that a defendant's rights under the Eighth and Fourteenth Amendments were violated by the trial court's refusal to admit evidence of the defendant's good behavior in the penalty phase of his capital trial. 476 U.S. at 5 n.1, 8-9. According to the Skipper Court, \"where the prosecution specifically relies on a prediction of future dangerousness in asking for the death penalty,\" elemental due process principles require the admission of the defendant's relevant evidence in rebuttal. Id. at 5 n.1; see also id. at 9 (Powell, J., Concurring in the judgment) (\"Because petitioner was not allowed to rebut evidence and argument used against him,\" the defendant was denied due process.).\n\nEach of the defendants in Gardner, Skipper, and Simmons were barred from presenting to the jury evidence of critical importance to the fact-finding process. The similarity between the situation that confronted Skipper and Simmons is especially striking. Surely a Constitution that entitles a defendant to rebut the prosecution's argument of future dangerousness with evidence of his good behavior in prison likewise entitles him to inform the jury that he will remain incarcerated for life. Cf. id. at 5 n.1. Thus, it would have been an illogical application of Skipper \"to [have] decided that it did not extend to the facts of\" Simmons. See Butler v. McKellar, 494 U.S. 407, 415, 108 L. Ed. 2d 347, 110 S. Ct. 1212 (1990).\n\nIn Turner v. Williams, we noted the \"critical distinction between the extension of an existing rule on collateral review and the mere application of an existing normative rule . . . to a new set of facts.\" 35 F.3d at 884. Similarly, we noted in Correll v. Thompson, 63 F.3d 1279 (4th Cir. 1995), that Teague was not an obstacle where \"the question presented to us merely requires the application of [prior] decisions to a new set of facts--not an extension of precedent to create a new rule.\" Id. at 1285 n.5. The normative formulation from which Simmons sprang was enunciated in Gardner and, even more clearly, in Skipper. It need not previously have been applied in a factually identical situation in order to avoid classification as a \"new rule.\" See Stringer v. Black, 503 U.S. 222, 227-29, 117 L. Ed. 2d 367, 112 S. Ct. 1130 (1992). For \"when we apply an extant normative rule to a new set of facts (leaving intact the extant rule) generally we do not announce a new constitutional rule of criminal procedure for purposes of Teague.\" Id. at 885; see also id. (\"'If a proffered factual distinction between the case under consideration and pre-existing precedent does not change the force with which the precedent's underlying principle applies, the distinction is not meaningful and any deviation from precedent is not reasonable.'\") (quoting Wright v. West, 505 U.S. 277, 304, 120 L. Ed. 2d 225, 112 S. Ct. 2482 (1992) (O'Connor, J., Concurring in the judgment)).\n\nThe Simmons plurality reached the Conclusion that its decision was \"compelled \" by Gardner and Skipper, cases handed down years before O'Dell's conviction became final. Simmons, 114 S. Ct. at 2194 (plurality opinion).\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The Supreme Court has recognized, however, that a court's indication that a case is \"directly controlled\" by earlier authority is not dispositive of the new rule issue. See Butler, 494 U.S. at 414. Although such language is not conclusive, see id. at 415, it is a factor in assessing whether an objectively reasonable jurist would have predicted a particular decision.\n\nSimilarly, that a judgment garners support from a substantial majority of the Court's Justices provides an indication that a decision reasonably was expected. In the case before me, seven Justices accepted Simmons' argument that his due process rights had been violated because he was not allowed to present evidence rebutting the state's future dangerousness argument. I also note that a substantial majority of states had rejected the practice disapproved of in Simmons. At the time of that decision, \"only two states other than South Carolina [had] a life-without-parole sentencing alternative to capital punishment for some or all convicted murderers but refused to inform sentencing juries of this fact.\" Simmons, 114 S. Ct. at 2196 n.8.\n\nIn arguing that Simmons announced a new rule, the Commonwealth and the majority rely heavily on California v. Ramos, 463 U.S. 992, 77 L. Ed. 2d 1171, 103 S. Ct. 3446 (1983). In that case, the Court upheld as consistent with due process a California sentencing provision that permitted the trial court to advise the jury of the Governor's power to commute a life sentence, but not requiring it to inform the jury of his power to commute a death sentence. According to the Ramos Court, the instruction \"did not violate any of the substantive limitations this Court's precedents have imposed on the capital sentencing process.\" Id. at 1013. As Justice Blackmun noted in Simmons, however, Ramos is not inconsistent with the Gardner/Skipper rule applied inSimmons.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Id. at 2196. The Ramos Court explicitly upheld the California statute because it did \"not preclude the defendant from offering any evidence or argument regarding the Governor's power to commute a life sentence.\" 463 U.S. at 1004. Moreover, Ramos \"emphasized that informing the jury of the Governor's power to commute a sentence of life without possibility of parole was merely an accurate statement of a potential sentencing alternative.\" Ramos, 463 at 1009. In contrast, the Simmons problem occurs where a defendant is prohibited from presenting information necessary to correct a critical misapprehension created by the prosecution,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e and Gardner and Skipper demonstrate that a capital defendant must be afforded the opportunity to rebut evidence offered by the prosecution regarding his future dangerousness.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nI recognize that some courts, including this one, had interpreted the language in Ramos broadly and reached what at first glance appears to be a result contrary to Simmons. Most of those decisions, however, actually did not involve a true Simmons situation: a capital defendant seeking to rebut the prosecution's contention of future dangerousness with evidence of his statutory ineligibility for parole. Both Turner v. Bass, 753 F.2d 342 (4th Cir. 1985), rev'd on other grounds sub nom. Turner v. Murray, 476 U.S. 28, 90 L. Ed. 2d 27, 106 S. Ct. 1683 (1986), and Peterson v. Murray, 904 F.2d 882 (4th Cir. 1990), on which the Commonwealth relies extensively, involved factually distinct circumstances.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e As I have construed it above, Simmons applies only in this relatively narrow situation. Were the Simmons \"rule\" to be read broadly, it might indeed run afoul of Ramos and necessarily be considered \"new.\" As even the Commonwealth recognized at oral argument, however, \"they did not have to overrule Ramos to write the Simmons opinion.\"\n\nMoreover, \"the mere existence of [prior] conflicting authority does not necessarily mean a rule is new.\" Wright, 505 U.S. at 304 (O'Connor, J., Concurring in the judgment). As we discussed extensively in Turner v. Williams, 35 F.3d at 883-84, the Supreme Court held in Penry v. Lynaugh, 492 U.S. 302, 106 L. Ed. 2d 256, 109 S. Ct. 2934 (1989), that the petitioner's constitutional claim was not precluded by Teague, despite the Fifth Circuit's Conclusion that its previous decisions rejecting similar claims barred consideration of Penry's. See Turner v. Williams, 35 F.3d at 884. Penry \"did not seek a new rule because he simply sought the application (not the extension) of a preexisting rule of law in a new factual setting.\" Id.\n\nSimilarly, Simmons applied the rule announced in Gardner and reaffirmed in Skipper to a different, but related, factual situation: the particular evidence the defendant sought to introduce to rebut the prosecution's evidence of future dangerousness was his statutory ineligibility for parole. As Justice Blackmun explained, and the Commonwealth conceded by admitting that Ramos remained good law after Simmons, Ramos and its progeny are not inconsistent with Simmons. See Simmons, 114 S. Ct. at 2196 (plurality opinion). At bottom, Simmons examines whether a person who is subjected to the death penalty on future dangerousness grounds is entitled to rebut that argument with highly relevant evidence, not the presentation of a parole eligibility scheme to a jury. Cf. Hunt v. Nuth, 57 F.3d 1327, 1334 (4th Cir. 1995) (citing Simmons as standing for the proposition that \"the crucial significance of parole ineligibility in a capital sentencing is its relationship to future dangerousness and the ultimate objective of incapacitating the offender from inflicting future harm on society\" (emphasis added)). Ramos, on the other hand, involved the application of a more general rule concerning a state's discretion to offer or withhold the details of its commutation and early release systems. Because Ramos does not conflict with the more specific principle employed in Simmons, see supra, the Simmons Court could apply Skipper and Gardner without announcing a new rule of constitutional criminal procedure, at least as to convictions that became final after those cases were decided.\n\nApplying Teague \"leaves something to be desired, for 'it is admittedly often difficult to determine when a case announces a new rule . . . .'\" Turner v. Williams, 35 F.3d at 879 (quoting Teague, 489 U.S. at 301 (plurality opinion)). In this case, however, the Commonwealth is forced to argue that Simmons announced a new rule because it was not dictated by one line of authority (Ramos and its progeny), when another line of more relevant cases compelled its result. Because the legal landscape of 1988 mandated the decision reached by the Supreme Court in Simmons, I believe that O'Dell does not seek the application of a \"new rule\" of constitutional criminal procedure.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nC.\n\nHaving determined that Simmons applies, I turn now to the Commonwealth's argument that any Simmons error was harmless. On habeas review, a constitutional violation must have had a \"substantial and injurious effect or influence in determining the jury's verdict.\" Brecht v. Abrahamson, 507 U.S. 619, , 113 S. Ct. 1710, 1712, 123 L. Ed. 2d 353 (1993). Contrary to our earlier decision in Smith v. Dixon, 14 F.3d 956, 980 (4th Cir. 1994) (en banc), cert. denied, U.S. , 115 S. Ct. 129, 130 L. Ed. 2d 72 (1995), the Supreme Court recently held a petitioner does not carry this burden. O'Neal v. McAninch, 513 U.S. 432, , 115 S. Ct. 992, 994, 130 L. Ed. 2d 947 ((1995). Moreover, the Court explained that in a close case, where \"the conscientious Judge [is] in grave doubt about the likely effect of an error on the jury's verdict,\" the habeas petitioner \"must win.\" Id.\n\nThe Commonwealth makes three specific arguments as to why the Simmons error suffered by O'Dell was harmless. First, it contends that the district court failed to find that O'Dell was ineligible for parole. The Virginia Supreme Court found that O'Dell had been convicted of three felonies within the meaning of Virginia Code ยง 53.1-151(B1), making him ineligible for parole under state law. The fact that the federal district court failed to make a specific finding to that effect is immaterial. Furthermore, in light of the Commonwealth's concession that O'Dell's situation falls within Simmons, this argument is trivial.\n\nSecond, the Commonwealth argues that O'Dell actually informed the jury that he would remain imprisoned for the remainder of his life. As support for this proposition, it cites a rambling answer by O'Dell to a question about his age:\n\nI am forty-five -- will be 45 on September 20. It's just like having a life sentence to go back to prison. I got sixteen years. I do fifteen on a life sentence. Okay. If I went back to prison without this conviction, I am doing a life sentence. I am doing a life sentence. I am never going to get out. It don't make no difference. I am never going to get out.\n\nJoint Appendix at 2433. Simmons does hold that a jury's information about parole eligibility need not come by way of a court's instruction; it can come from defense counsel instead. See Simmons, 114 S. Ct. at 2200-01 (O'Connor, J., Concurring in the judgment). More, however, is required for effective conveyance of the material than was allowed O'Dell in this case. The trial Judge found as much when he denied the Commonwealth's motion to strike O'Dell's testimony on the grounds that it informed the jury about his parole ineligibility. Joint Appendix at 2433. O'Dell's remarks did not effectively convey the evidence most critical to rebutting future dangerousness--that he was ineligible for parole under state law.\n\nThe Commonwealth's third argument rests on its assertion that O'Dell's jury sentenced him to death on the basis of two aggravating factors, vileness as well as future dangerousness. Under Zant v. Stephens, 462 U.S. 862, 77 L. Ed. 2d 235, 103 S. Ct. 2733 (1983), where one valid aggravating factor is sufficient to support a death sentence, that sentence need not be set aside simply because the jury also found an invalid aggravating factor. Id. at 884; accord Smith v. Procunier, 769 F.2d 170, 173 (4th Cir. 1985), aff'd sub nom. Smith v. Murray, 477 U.S. 527, 91 L. Ed. 2d 434, 106 S. Ct. 2661 (1986). While the trial transcript indicates a finding by the jury that O'Dell's crime was \"outrageously wanton, vile or inhuman,\" see Joint Appendix at 2506, the Virginia Supreme Court determined that \"the jury did not base its verdict on the vileness predicate.\" O'Dell, 364 S.E.2d at 507; see also Joint Appendix at 337. On that basis, the state court declined to consider O'Dell's argument that the trial court's instruction on the vileness predicate was improper, affirming his death sentence on the basis of the finding of \"future dangerousness\" alone. O'Dell, 364 S.E.2d at 510. Rejecting the Virginia court's finding at this time would effectively deprive O'Dell of his right to direct appeal. Moreover, as the Commonwealth admitted at oral argument, \"[it] didn't move to correct\" the allegedly erroneous finding, presumably because any error worked to its benefit. Recalling that \"it is not the province of a federal habeas court to reexamine state-court determinations on state-law questions,\" Estelle v. McGuire, 502 U.S. 62, 67-68, 116 L. Ed. 2d 385, 112 S. Ct. 475 (1991), I accept the finding that O'Dell was convicted based on the future dangerousness factor only. Given the centrality of parole ineligibility to that issue, the Commonwealth has not met its burden to prove that the Simmons violation suffered by O'Dell had no \"substantial and injurious effect or influence in determining the jury's verdict.\" O'Neal, 115 S. Ct. at 994. Therefore, the decision of the district court to vacate the sentence of death imposed on O'Dell was legally correct and should be affirmed.\n\nII.\n\nFor these reasons, I am convinced that the district court's decision was correct and should be affirmed in its entirety. To the extent that the majority opinion fails to do this, I am compelled to Dissent therefrom.\n\nI am authorized to state that Judges Hall, Murnaghan, Hamilton, Michael and Motz join in this Concurring and Dissenting opinion.\n\n\u003cspan class=\"fn\"\u003e1. See also Penry v. Lynaugh, 492 U.S. 302, 313, 106 L. Ed. 2d 256, 109 S. Ct. 2934 (1989) (\"We must determine, as a threshold matter, whether granting [Penry] the relief he seeks would create a 'new rule.'\" (emphasis added) (quoting Teague, 489 U.S. at 301)); Graham, 506 U.S. at 472 (\"We cannot say that reasonable jurists considering petitioner's claim in 1984 would have felt that these cases 'dictated' vacatur of petitioner's death sentence.\" (emphasis added) (quoting Teague, 489 U.S. at 301)); id. at 476 (\"This distinction leads us to conclude that neither Penry nor any of its predecessors 'dictates' the relief Graham seeks within the meaning required by Teague.\" (emphasis added)); id. at 477 (\"We cannot say that all reasonable jurists would have deemed themselves compelled to accept Graham's claim in 1984.\" (emphasis added)); Stringer, 503 U.S. at 228 (Teague inquiry asks \"whether granting the relief sought [by the petitioner] would create a new rule because the prior decision is applied in a novel setting, thereby extending the precedent.\" (emphasis added)); id. at 227 (\"[A] case decided after a petitioner's conviction and sentence became final may not be the predicate for federal habeas corpus relief unless the decision was dictated by precedent . . . .\" (emphasis added)); Johnson v. Texas, 509 U.S. 350, 365, 125 L. Ed. 2d 290, 113 S. Ct. 2658 (1993) (\"In rejecting the contention that Penry dictated a ruling in the defendant's favor [in Graham ], we stated that . . . .\" (emphasis added)); id . (\"We also did not accept the view that the Lockett and Eddings line of cases, upon which Penry rested, compelled a holding for the defendant in Graham. . . .\" (emphasis added)); id. at 366 (\"We concluded that, even with the benefit of the subsequent Penry decision, reasonable jurists at the time of Graham's sentencing 'would [not] have deemed themselves compelled to accept Graham's claim.'\" (emphasis added) (quoting Graham, 506 U.S. at 477)); id. (\"Thus, we held that a ruling in favor of Graham would have required the impermissible application of a new rule under Teague.\" (emphasis added)); Caspari, 114 S. Ct. at 953 (\"The nonretroactivity principle prevents a federal court from granting habeas corpus relief to a state prisoner based on a rule announced after his conviction and sentence became final.\" (emphasis added)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Justice Souter, for example, who authored the Dissent in Graham, could not have been clearer as to this requirement of the \"new rule\" doctrine when he wrote in Wright that, \"to survive Teague, [a rule] must be 'old' enough to have predated the finality of the prisoner's conviction, and specific enough to dictate the rule on which the conviction may be held to be unlawful.\" 505 U.S. at 311 (Souter, J., Concurring in the judgment) (emphasis added); see also id. at 313 (\"In light of authority extant when [petitioner's] conviction became final, its unlawfulness must be apparent.\" (emphasis added)). Justice Brennan has also acknowledged that this is the standard governing federal habeas review. As he stated in Butler, the Court in Teague \"declared that a federal court entertaining a state prisoner's habeas petition generally may not reach the merits of the legal claim unless the court determines, as a threshold matter, that a favorable ruling on the claim would flow from the application of [preexisting] legal standards.\" 494 U.S. at 417 (Brennan, J., Dissenting) (emphasis added); see also id. at 417-18 (\"Put another way, a state prisoner can secure habeas relief only by showing that the state court's rejection of the constitutional challenge was so clearly invalid under then-prevailing legal standards that the decision could not be defended by any reasonable jurist.\" (emphasis added)); West, 505 U.S. at 291 (\"[A] federal habeas court 'must defer to the state court's decision rejecting the claim unless that decision is patently unreasonable.'\" (emphasis added) (quoting Butler, 494 U.S. at 422 (Brennan, J., Dissenting))).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. See, e.g., Teague, 489 U.S. at 301 (\"In general, . . . a case announces a new rule when it breaks new ground or imposes a new obligation on the States or the Federal Government.\"); Penry, 492 U.S. at 314, 329 (quoting Teague); Butler 494 U.S. at 412 (citing Penry); Saffle, 494 U.S. at 488 (quoting Teague); Graham, 506 U.S. at 467 (quoting Teague); see also Teague, 489 U.S. at 301 (\"To put it differently, a case announces a new rule if the result was not dictated by precedent existing at the time the defendant's conviction became final.\"); Penry, 492 U.S. at 314 (quoting Teague); Butler, 494 U.S. at 412 (quoting Penry (quoting Teague)); Saffle, 494 U.S. at 488 (quoting Teague); Sawyer, 497 U.S. at 234 (quoting Teague); Graham, 506 U.S. at 467 (quoting Teague); Gilmore, 508 U.S. at 340 (quoting Butler (quoting Penry (quoting Teague))); Caspari, 114 S. Ct. at 953 (quoting Teague).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. To be sure, the Court's decision in Ramos rested primarily on the Eighth Amendment. But the Court specifically considered, inter alia, whether the Briggs Instruction ran afoul of the due process concerns of reliability in sentencing that were identified in Gardner, concluding that Gardner \"provided no support for respondent.\" 463 U.S. at 1004. Indeed, it concluded its opinion by reiterating its earlier determinations that the instruction \"[did] not violate any of the substantive limitations this Court's precedents have imposed on the capital sentencing process,\" id. at 1013, including those identified in Gardner, see id. at 1000-01. Regardless, it was apparent in 1988, as it is still today, that the Eighth Amendment's principles inform the Due Process capital sentencing inquiry. Therefore, a reasonable jurist could hardly be faulted either for resorting to both lines of the Court's cases, as the Court itself has repeatedly done, or for relying only on the line directly implicated in the case before him.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Indeed, one federal district court rejected a pre-Simmons claim very much like that in Simmons on precisely this ground: While Ramos did not address the precise issue raised here, it is instructive. . . . The Briggs Instruction [reviewed in Ramos ] informed the jury that a sentence of life imprisonment without parole may be commuted by the governor to a sentence that includes the possibility of parole. The jury in Ramos was not told that the governor could similarly commute a sentence of death to a lesser punishment. The California Supreme Court reversed the death sentence, in part because this combination of instructions allowed the jury to believe mistakenly that the \"only way to keep the defendant off the streets is to condemn him to death.\" The instructions given . . . [here] could also produce this misapprehension in jurors: telling the jury that the alternative to death is imprisonment might lead it to believe that public safety would be assured only through the imposition of the death penalty. Despite this concern, the Supreme Court upheld the constitutionality of the Briggs Instruction in Ramos, finding that it did not preclude individualized sentencing determination or introduce a speculative element in jury deliberation. . . . In light of Ramos, [petitioner's] appeal to the general principle that imposition of capital punishment must be based on reason, rather than emotion and caprice, is an insufficient basis on which to grant relief. All constitutional rules can be stated in very general terms, but general principles do not compel specific rules. Albanese v. McGinnis, 823 F. Supp. 521, 565-66 (N.D. Ill. 1993) (citations and footnote omitted), aff'd, 19 F.3d 21 (7th Cir. 1994), cert. denied, 115 S. Ct. 1114, 130 L. Ed. 2d 1078 (1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Justice Marshall was relying primarily, although not exclusively, on the Eighth Amendment for his Conclusion that the Constitution forbids any reference to the possibility of parole. It was, however, at the very least reasonable for state jurists to have concluded that the Due Process Clause did not require what Justice Marshall believed the Eighth Amendment forbade, particularly given the majority's position that such matters are properly committed to the discretion of the individual states.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. See, e.g., Ala. Code ยง 13A-5-46(e); Ark. Code Ann. 5-4-603(b); Cal. Pen. Code ยง 190.3; Conn. Gen. Stat. ยง 53a-46a(f); Del. Code Ann. tit. 11, ยง 4209(a); La. Code Crim. Proc. Ann. art. 905.6; Mo. Ann. Stat. ยง 565.030.4; N.H. Rev. Stat. Ann. ยง 630:5 (IV); Pa. Stat. Ann. tit. 61, ยง 331.21; Va. Code ยง 53.1-151(B1); Wash. Rev. Code Ann. ยง 10.95.030(1). The Court had been aware of similar laws for at least a decade. See Schick v. Reed, 419 U.S. 256, 267 \u0026 n.7, 42 L. Ed. 2d 430, 95 S. Ct. 379 (1974) (noting that \"'no-parole' condition attached to the commutation of [petitioner's] death sentence is similar to sanctions imposed by legislatures such as mandatory minimum sentences or statutes otherwise precluding parole\" and citing 21 U.S.C. ยง 848(c); Mass. Gen. Laws Ann., c. 265, ยง 2 (1970); and Nev. Rev. Stat., Tit. 16, c. 200.030, ยง 6, c. 200.363, ยง 1(a) (1973)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The Court did not so much as cite Caldwell in Simmons, foreclosing any argument (which O'Dell does not make, in any event) that Caldwell somehow compelled the result in Simmons. Presumably, Simmons did not neglect Caldwell merely because that case was decided under the Eighth Amendment, considering the Court's liberal reliance upon Eighth Amendment cases elsewhere in the Simmons opinions and its routine cross-pollenization between its Eighth Amendment and its Due Process lines of cases in the capital sentencing context. Almost certainly, the Court avoided relying on Caldwell because it considered that case as limited to the affirmative provision of inaccurate information as to the proper role of the jury, as the Court had expressly held in 1986. Darden v. Wainwright, 477 U.S. 168, 183 n.15, 91 L. Ed. 2d 144, 106 S. Ct. 2464 (1986); see infra note 9; see also Sawyer, 497 U.S. at 233 (describing Caldwell as having held that \"the Eighth Amendment prohibits the imposition of a death sentence by a sentencer that has been led to the false belief that the responsibility for determining the appropriateness of the defendant's capital sentence rests elsewhere\"); Dugger v. Adams, 489 U.S. 401, 407, 103 L. Ed. 2d 435, 109 S. Ct. 1211 (1989) (\"If the challenged instructions accurately described the role of the jury under state law, there is no basis for a Caldwell claim. To establish a Caldwell violation, a defendant necessarily must show that the remarks to the jury improperly described the role assigned to the jury by local law.\"). As the Chief Justice concluded for the Court in Romano v. Oklahoma, 512 U.S. 1, 114 S. Ct. 2004, 2010, 129 L. Ed. 2d 1 (1994): The infirmity identified in Caldwell is simply absent in this case: Here the jury was not affirmatively misled regarding its role in the sentencing process. The evidence at issue was neither false at the time it was admitted, nor did it even pertain to the jury's role in the sentencing process.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Justice Powell took no part in the consideration of Caldwell, so it might appear that only the three Caldwell Dissenters agreed with Justice O'Connor. However, Justice Powell joined Justice O'Connor's majority opinion in Ramos, and, as he said for the majority in Darden v. Wainwright, decided only one year after Caldwell, \"Caldwell is relevant only to certain types of comment -- those that mislead the jury as to its role in the sentencing process in a way that allows the jury to feel less responsible than it should for the sentencing decision.\" 477 U.S. at 183 n.15.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. At this juncture in Skipper, the Court was discussing the requirements of the Eighth Amendment, not those of the Due Process Clause. However, the most natural implication would be that the rebuttal evidence that the defendant must be allowed to introduce under the Due Process Clause would be the same as that which the Court held he must be allowed to introduce under the Eighth Amendment-- evidence concerning his character and offense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. As the Fifth Circuit explained in Johnson, Simmons. . . announced a new rule because it held that in some situations the states are no longer free to decide whether an instruction on parole should be given. This is inconsistent with the Court's earlier ruling in California v. Ramos. In Ramos, the Court held, inter alia, that whether or not an instruction on post-sentencing contingencies was appropriate remained properly in the hands of the states. 68 F.3d at 111 n.11 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See also Caspari, 114 S. Ct. at 956 (\"Two Federal Courts of Appeals and several state courts had reached conflicting holdings on the issue. Because that conflict concerned a 'development in the law over which reasonable jurists [could] disagree,' Sawyer v. Smith, 497 U.S. 227, 234, 111 L. Ed. 2d 193, 110 S. Ct. 2822 (1990), [ruling in petitioner's favor on habeas would announce a new rule].\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The district court's Conclusion in footnote that the precedent in 1988 also dictated the result that the Eighth Amendment required that the jury be informed of future dangerousness, J.A. at 335, is inexplicable, considering that such a rule would be new even today. See Simmons, 114 S. Ct. at 2193 n.4 (plurality); id. at 2199 (Ginsburg, J., Concurring); id. at 2200 (O'Connor, J., Concurring); cf. id . at 2198-99 (Souter, J., Concurring). For the same reasons that we hold that the precedent in 1988 did not compel the Conclusion that due process required Simmons, we hold that the same precedent did not compel a Conclusion that the Eighth Amendment required Simmons.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Because we hold that Simmons announced a new rule, we do not address whether the failure to give the Simmons instruction in this case was harmless error under Brecht v. Abrahamson, 507 U.S. 619, 123 L. Ed. 2d 353, 113 S. Ct. 1710, 1722 (1993) (\"Habeas petitioners may obtain plenary review of their constitutional claims, but they are not entitled to habeas relief based on trial error unless they can establish that it resulted in'actual prejudice,'\" i.e., whether \"the error 'had substantial and injurious effect or influence in determining the jury's verdict.'\" (quoting Kotteakos v. United States, 328 U.S. 750, 776, 90 L. Ed. 1557, 66 S. Ct. 1239 (1946))). Nevertheless, there are strong indications that even if it had been error, it would have been harmless under Brecht given the heinousness of the crime, O'Dell's lengthy and frightening criminal record, and O'Dell's own testimony from the stand that he would spend the rest of his life behind bars, J.A. at 2433. Moreover, the court's failure to inform the jury of parole ineligibility calls into question only the jury's finding of future dangerousness, leaving the vileness finding untouched, which may be sufficient to sustain the death penalty under Zant v. Stephens, 462 U.S. 862, 884, 77 L. Ed. 2d 235, 103 S. Ct. 2733 (1983) (\"[A] death penalty supported by at least one valid aggravating circumstance need not be set aside . . . simply because another aggravating circumstance is 'invalid' in the sense that it is insufficient by itself to support the death penalty.\"). Although the Virginia Supreme Court did state that \"the jury did not base its verdict on the vileness predicate,\" O'Dell, 364 S.E.2d at 507, it appears to have clearly erred in saying this, as O'Dell himself appears to recognize. See Petitioner's Br. at 42-43. The jury verdict expressly stated that, in addition to finding that O'Dell posed a future danger, having unanimously found that [O'Dell's] conduct in committing the offense was outrageously wanton, vile or inhuman and it involved aggravated battery to the victim beyond the minimum necessary to accomplish the act of murder, and having considered the evidence in mitigation of the offense, unanimously fix his punishment at death. J.A. at 2506.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. These claims were denominated Id, IIh, IV, V, VI, X, XI, XVIII, and XXII in the federal district court. J.A. at 286.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. These claims were denominated Ia, Ibi, Ibii, Ibiv, Ic, Ie, Ig, XVII, XX, and XXIII in the federal district court. J.A. at 285. Additionally, claims Id, V, VI, X, XI, XVIII, and XXII were also dismissed by the Virginia Supreme Court as untimely on appeal from the state habeas proceeding, but, because they were procedurally barred in any event under Slayton, see supra, we do not consider them further.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. On March 6, 1991, the deputy chief clerk of the Virginia Supreme Court and an assistant state attorney general informed O'Dell that he should have filed a petition for appeal rather than assignments of error. J.A. at 287 n.3. O'Dell claims that the state assistant attorney general then told him over the telephone that he had \"no objection\" to O'Dell trying to \"supplement\" his filing, and that the Commonwealth would not oppose that supplementation. Id. Regardless of whether such a phone conversation actually took place, the Commonwealth did in fact oppose the motion to amend when it was filed on March 8, and the Virginia Supreme Court denied that motion, as was its prerogative.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. That the full text of the Virginia Supreme Court opinion was but one sentence -- \"Finding that the appeal was not perfected in the manner provided by law, the Court rejects the petition for appeal in the above-styled case. Rule 5:17(a)(1),\" J.A. at 216 -- is of course of no moment. \"[A] state court that wishes to rely on a procedural bar rule in a one-line pro forma order easily can write that 'relief is denied for reasons of procedural default.'\" Harris v. Reed, 489 U.S. 255, 265 n.12, 103 L. Ed. 2d 308, 109 S. Ct. 1038 (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The Commonwealth argues, and O'Dell presents no evidence to the contrary, that \"Virginia clearly and consistently requires the filing of a petition for appeal on any appeal from a judgment of the habeas corpus proceeding, regardless of whether the habeas case involves the death penalty.\" Respondent's Reply Br. at 32. See, e.g., Yeatts v. Murray, 249 Va. 285, 455 S.E.2d 18, 20 (Va. 1995) (\"awarding Yeatts an appeal limited to [certain issues]\" following circuit court's denial of petitioner's writ of habeas corpus); id. at 21-22 (refusing to consider a claim raised in appellant's brief because it failed to comply with Rule 5:17(c) governing petitions for appeal); Epperly v. Booker, 235 Va. 35, 366 S.E.2d 62, 63 (Va. 1988) (\"The defendant filed a petition for a writ of habeas corpus in the court below, the court denied the petition, and we granted the petitioner an appeal.\" (emphasis added)); Peterson v. Bass, 2 Va. App. 314, 343 S.E.2d 475, 480 (Va. App. 1986) (Barrow, J., Dissenting) (\"Peterson has taken all steps necessary to entitle him to have his petition for appeal considered on its merits by the Supreme Court. He filed a timely notice of appeal to the Supreme Court and subsequently filed a timely petition for appeal [from his habeas petition attacking his capital conviction].\"); compare Rogers v. Commonwealth, 242 Va. 307, 410 S.E.2d 621, 622-23 (Va. 1991) (considering, on direct capital appeal, defendant's assignments of error).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Although unambiguous statutes or court rules are always \"firmly established,\" new procedural rules created after the time they had to be obeyed, see Ford, 498 U.S. at 424-25, and procedural distinctions regularly ignored by state courts, see James, 466 U.S. at 346-47, are by definition not.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Prior to 1985, when this statute was amended to provide that appeals \"involving\" habeas corpus \"lie directly\" to the Supreme Court, such appeals were in the exclusive jurisdiction of the Court of Appeals. Titcomb v. Wyant, 323 S.E.2d 800 (Va. 1984). Even after Titcomb, however, the Supreme Court retained jurisdiction for habeas appeals in capital cases, because \"it would be inconsistent with the legislative design . . . to conclude that [the Court of Appeals] lacked jurisdiction to hear direct appeals [in capital cases], but that it possessed . . . jurisdiction [over habeas challenges to capital convictions].\" Peterson, 343 S.E.2d at 478. That the 1985 amendment was simply an alteration in jurisdiction over all habeas appeals has been recognized by the Virginia Courts: It is clear from the 1985 amendment to Code ยง 17-116.05:1(B) that effective July 1, 1985, the General Assembly terminated the jurisdiction of [Virginia's intermediate appellate courts] to hear and determine appeals from a final decision, judgment or order of a circuit court involving a petition for a writ of habeas corpus. . . . The clear legislative intent expressed in the 1985 amendment [was] that habeas corpus cases on appeal from the circuit court go directly to the Supreme Court. White v. Garraghty, 2 Va. App. 117, 341 S.E.2d 402, 405-06 (Va. App. 1986); see also Peterson, 343 S.E.2d at 477 n.4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Because these procedural rules are expressly set out in unambiguous state statutes and supreme court rules, and because in Virginia they have been regularly followed, see supra note 19, they are qualitatively different from the rule at issue in James. In James, the distinction between jury \"instructions\" and \"admonitions\" was \"not always clear or closely hewn to,\" as evidenced by the fact that the Kentucky Supreme Court had \"recognized that the content of admonitions and instructions can overlap,\" had \"acknowledged that 'sometimes matters more appropriately the subject of admonition are included with or as a part of the instructions,'\" and had used the terms interchangeably for a number of years (as had the trial courts). 466 U.S. at 346-47. Likewise, because Virginia's rules existed long before the commencement of O'Dell's state habeas proceeding, they are nothing like the procedural rule that Georgia had applied retroactively in Ford to a proceeding that had been completed long before the creation of the rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The Court in Coleman did comment that the Virginia Supreme Court had there not applied Tharp because that case concerns only petitions for appeal, as contrasted to the \"purely ministerial\" notice of appeal at issue in Coleman -- but it did so only as an alternative holding, following the aforementioned analysis of Tharp and the qualifying phrase, \"even if we accept Coleman's reading of Tharp.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. The district court, because it found that Rule 5:17(a)(1) was not an adequate and independent state ground under James, proceeded to rule against O'Dell on the merits of these claims. Principally, the claims were that O'Dell was not competent to waive his right to counsel, that, at a minimum, his competency was never appropriately determined, and that even if he was competent, his waiver of the right to counsel was not voluntary, knowing, and intelligent. Although it should not have reached the claims, on the merits, the district court correctly rejected them. First, the standard for competency to waive the right to counsel is whether the defendant has \"sufficient present ability to consult with his lawyer with a reasonable degree of rational understanding.\" Godinez v. Moran, 509 U.S. 389, 396, 125 L. Ed. 2d 321, 113 S. Ct. 2680 (1993). After examining O'Dell, Dr. Kreider, the court-appointed psychiatrist, questioned the reliability of an earlier diagnosis of schizophrenia, J.A. at 2666, and concluded that O'Dell was competent \"to make a voluntary and intelligent decision to waive his right to counsel and prepare his own defense,\" J.A. at 312, an assessment with which both O'Dell's attorney and the trial court agreed. J.A. at 2511, 2709, 2712. Moreover, because Dr. Kreider was familiar with the standard for finding a defendant competent to stand trial, J.A. at 313, 2642-45, 2682-83, and because that standard is identical to the standard for waiving the right to counsel, Godinez, 509 U.S. at 397, Dr. Kreider's determination was more than adequate, as both the state and federal habeas courts found, J.A. at 2760, 2776-77, 313-14. Second, O'Dell claims that his competency was never appropriately determined because Dr. Kreider is a \"therapeutic psychiatrist\" and not a \"forensic psychiatrist.\" Although O'Dell cites Ake for the proposition that \"when the mental state of a defendant is at issue, due process requires that a defendant be provided with a qualified expert psychiatrist to assist with his defense,\" Petitioner's Br. at 61, he misreads Ake to establish a general due process right to psychiatric assistance where none exists. In Ake, the Court held only that, when a defendant demonstrates to the trial Judge that his sanity at the time of the offense is to be a significant factor at trial, the State must, at a minimum, assure the defendant access to a competent psychiatrist who will conduct an appropriate examination and assist in . . . the defense. 470 U.S. at 83 (emphasis added). Ake thus says nothing about determining \"competency\" to stand trial or waive counsel; it deals only with a defendant's \"sanity\" at \"the time of the offense,\" as the state habeas court properly held, J.A. at 2776. And in Godinez, the Court noted that a court is not required to make a competency determination in every case in which a defendant seeks to plead guilty or to waive his right to counsel. As in any criminal case, a competency determination is necessary only when a court has reason to doubt the defendant's competence. Godinez, 509 U.S. at 401 n.13. Regardless, Dr. Kreider was more than qualified to make the competency determination; he has an M.D. from the University of Chicago School of Medicine, has completed a psychiatric residency at the Philadelphia Naval Hospital, and has served as a psychiatrist in the Navy and in private practice from 1965 to the present. J.A. at 2640-42. Both the state and federal habeas courts found Dr. Kreider fully qualified to make the competency determination. Finally, O'Dell claims that his conviction must be vacated because he did not waive his right to counsel voluntarily, knowingly, and intelligently. O'Dell claims that the district court's refusal to replace defense counsel, with whom O'Dell had a confrontational and distrustful relationship, left O'Dell \"no choice\" but to dismiss counsel and proceed pro se. But \"the determination of whether or not the motion for substitution of counsel should be granted is within the discretion of the trial court.\" United States v. Gallop, 838 F.2d 105, 108 (4th Cir.), cert. denied, 487 U.S. 1211, 101 L. Ed. 2d 895, 108 S. Ct. 2858 (1988). The trial Judge was in a far better position than a federal habeas court to assess the relationship between O'Dell and his attorney. As the trial court stated on the record, from everything I've seen, since Mr. Ray was appointed in this case, he's done everything in his power to get those material things that should be heard before the Court for a hearing, and I've absolutely no evidence whatsoever that this man hasn't done an outstanding job for you at this point or that there is any credibility whatsoever in the allegations which you have made with respect to him. None whatsoever. J.A. at 319; see also J.A. at 3008. Although his opinion on Ray varied, at times, O'Dell also shared this assessment of Ray's competency. J.A. at 435, 2513, 3008; Tr. 9/8/86 Vol. 53, 201-02. In any event, the trial court found that O'Dell was receiving adequate counsel and accordingly refused to substitute counsel. And, \"once the trial court has appropriately determined that a substitution of counsel is not warranted, the court can insist that the defendant choose between continuing representation by his existing counsel and appearing pro se.\" Gallop, 838 F.2d at 109. It also appears that O'Dell's waiver was knowingly and intelligently made. The trial court repeatedly warned O'Dell of the dangers of proceeding pro se, O'Dell was repeatedly asked if he understood what he was doing, and the court even allowed him to change his mind several times. J.A. at 318-19, 3007-08, 3011-12, 3016, 3021-22, 3332-33, 3340. If there was any problem in the attorney-client relationship, it was likely caused by O'Dell. As the federal habeas court concluded, \"O'Dell's distrust of Ray was not based on objective facts; it was based on pure speculation.\" J.A. at 320. And, an independent and thorough examination of the record reveals that O'Dell, who was \"very intelligent,\" had a college equivalency education, and \"exhibited tremendous [courtroom] skills,\" J.A. at 3011, 2406, 3333, defended himself far more ably than many practicing attorneys could have done.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Although O'Dell asserts that this new evidence is enough to meet the \"extraordinarily high\" threshold of a freestanding constitutional claim of actual innocence, Herrera, 506 U.S. at 417, he devotes only one sentence of his voluminous briefing to this issue. See Petitioner's Br. at 52. Assuming arguendo that such a claim is even possible, but see Herrera, 506 U.S. at 416-17, we agree with the district court that O'Dell did not come even close to making such a \"truly persuasive demonstration.\" J.A. at 297.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The Commonwealth argues that a claim of actual innocence cannot succeed unless the petitioner demonstrates that \"but for a constitutional violation\" his actual innocence would have been established. Respondent's Reply Br. at 19. Because none of the procedurally barred constitutional claims prevented the jury from hearing the DNA evidence or any of the other evidence O'Dell claims proves his innocence, the Commonwealth maintains that they cannot be reviewed regardless of the new evidence. Prior to Schlup, our circuit did require petitioners to link their exculpatory evidence to a specific constitutional error that prevented the jury from adequately considering the evidence. See Spencer v. Murray, 18 F.3d 229, 236 (4th Cir. 1994). Spencer, however, rested on Sawyer, which was rejected by Schlup for claims of actual innocence of the crime itself. Schlup makes no mention of a \"but for\" requirement, but it does note in dictum that an actual innocence claim that \"accompanies\" an \"assertion of constitutional error at trial,\" is reviewable. Schlup, 115 S. Ct. at 861. Although the plurality in Schlup did not use the term \"but for,\" neither did the Court expressly abandon it. And, the Court continued to rely on Carrier and McCleskey, both of which require that a constitutional violation \"probably\" \"result\" in (Carrier) or \"cause\" (McCleskey) the conviction of one actually innocent. See id . at 867. Because we conclude that, regardless, O'Dell has not presented sufficient evidence to demonstrate actual innocence, we need not reach whether a \"but for\" requirement remains after Schlup.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Even if petitioner makes this showing, it may still be within the court's discretion to decline to review his procedurally defaulted claims. As Justice O'Connor observed in Schlup, \"the Court did not, and need not, decide whether the fundamental miscarriage of Justice exception is a discretionary remedy.\" 115 S. Ct. at 870 (O'Connor, J., Concurring). And, of course, under Marks, Justice O'Connor's reservation of this issue causes it to necessarily \"be an accurate description of what the Court . . . holds, since the narrower ground taken by one of the Justices comprising a five-Justice majority becomes the law.\" Schlup, 115 S. Ct. at 875 n.1 (Scalia, J., Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. O'Dell now attacks Emrich as a \"neophyte,\" claiming that her testimony should be discounted. However, it is not clear on the record that O'Dell challenged her qualifications at trial, J.A. at 1827, and regardless, the Virginia Supreme Court expressly found that \"the trial court did not err in admitting in evidence the results of the electrophoretic tests,\" O'Dell, 364 S.E.2d at 504. The state habeas court heard testimony that Ms. Emrich's \"work has always been outstanding,\" J.A. at 2752, and found that \"the Supreme Court of Virginia has already ruled that the serological evidence produced at trial was competent and properly admitted into evidence and considered by the jury. It is not the function of the writ of habeas corpus to undertake to serve as an appellate court over the decision reached by the Supreme Court,\" J.A. at 2777-78 (emphasis added). Likewise, we, too, on federal habeas, are bound by the Virginia Supreme Court's finding.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The federal habeas court concluded, \"based on the evidence at the evidentiary hearing, the blood on the jacket and the blood on the checkered shirt can be excluded as having a common origin. Again, based on the evidence, the DNA comparison of the blood on the checkered shirt and the victim's blood yielded a result that is'inconclusive.'\" J.A. at 307-08. This Conclusion is unhelpful and, indeed, is somewhat odd, in that it restates an issue that nobody disputes, states another that is contrary to the evidence, and ignores the hotly contested issue in the testimony. Every expert agreed that the stain on the shirt could be \"excluded\" from coming from Schartner, yet the district court characterizes the comparison as \"inconclusive.\" However, the real issue in dispute-- whether the stain on the jacket was a \"match\" or \"inconclusive\" -- was ignored in the district court's Conclusions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Justice O'Connor, a necessary member of the majority in Schlup, made clear that the Court did not \"disturb the traditional discretion of district courts in this area, nor did it speak to the standard of appellate review for such judgments.\" 115 S. Ct. at 870 (O'Connor, Concurring). Because the district court abused its discretion by applying the wrong legal standard, the Court did not address whether any less deferential standard of review need apply. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. In his briefing, O'Dell persists on disputing the time he left the club, relying on trial testimony that he was there over a half hour after Schartner left. See Petitioner's Br. at 47. But the Virginia Supreme Court expressly found that O'Dell left within fifteen minutes of when Schartner left, O'Dell, 364 S.E.2d at 495, and, under section 2254(d) and Sumner v. Mata, 449 U.S. 539, 66 L. Ed. 2d 722, 101 S. Ct. 764 (1981), we must accept that factual finding, supported by substantial evidence, as true.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. O'Dell maintains that this second story is true and that trial testimony supported it. For this proposition, see Petitioner's Br. at 7, O'Dell cites his own federal writ of habeas corpus, J.A. at 35. His writ in turn cites trial testimony, not that O'Dell was bloodied breaking up a fight, but merely that a fight had occurred at the Brass Rail bar that night and that when the supervisor went outside he did not see anyone other than O'Dell, who was covered in blood. O'Dell then claimed that the persons who had been fighting had left. O'Dell concedes that this is contrary to the story he told Connie Craig, J.A. at 2432, but maintains that he lied to Craig only to prevent her from telling his parole officer he had been fighting at the bars, as she had done on a previous occasion. Of course, Craig testified that O'Dell went to the County Line Lounge on \"practically\" every Tuesday, J.A. at 1098, and that he had told her he had been at the County Line Lounge on the very night in question, J.A. at 1093-94, 1098.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. O'Dell claims to have new evidence now substantiating his claim that Watson had cut a deal, but that evidence does little to prove that claim. See Discussion infra at 74-75.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Dr. Guerrieri, an expert for the Commonwealth, explained at the state habeas hearing yet another way how the DNA exclusion of the shirt could still be consistent with the enzyme match on that same shirt: One possibility would be that there are two different sources of genetic material in that particular stain; that is to say in the DNA testing, as well as the serology testing, a large portion of the stain is often consumed in the analysis. So if you sample one region -- if Miss Emerich [sic] sampled one region in a particular location, and the commercial testing lab sampled adjacent to that, it's conceivable they could have been two different blood sources. J.A. at 2751-52.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Although his brief before this court argues that, during the alleged fight at the Brass Rail, he \"became covered with the blood of the two other individuals,\" Petitioner's Br. at 7, the only support it cites for that proposition is his own federal petition for habeas corpus. That petition, in turn, states simply that \"during the course of this fight, O'Dell's clothes became covered with blood.\" J.A. at 35. Regardless, the Virginia Supreme Court expressly found \"O'Dell told the police the blood came from a nose bleed caused by being struck while attempting to stop a fight at another club,\" O'Dell, 364 S.E.2d at 495 n.2 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Because we reject O'Dell's claims on the grounds that we do, we need not consider his claims under the Antiterrorism and Effective Death Penalty Act of 1996. Under that newly-enacted statute, O'Dell's claims, of course, would have even less merit, given the considerably more demanding standards therein imposed on habeas petitioners.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Like the majority, I also decline to address the question of the applicability of the Antiterrorism and Effective Death Penalty Act of 1966 to this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Simmons also raised a claim under the Eighth Amendment, the merits of which the Court's plurality opinion declined to address. Simmons, 114 S. Ct. at 2193 n.4. Justice Souter, in a Concurring opinion joined by Justice Stevens, expressed a belief that the judgment reached by the court also was compelled by the Eighth Amendment. Id. at 2198-99 (Souter, J., Concurring).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Justice Scalia wrote a Dissent in which Justice Thomas joined. Id. at 2201 (Scalia, J., Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. We have found no authority from other federal appellate courts that addresses squarely the issue before us. In Stewart v. Lane, 60 F.3d 296 (7th Cir. 1995), the Seventh Circuit held that Simmons was unavailable to a habeas petitioner whose convictions had become final on May 20 and May 28, 1985, because the case fell within those \"'gradual developments in the law over which reasonable jurists may disagree.'\" Stewart, 60 F.3d at 302 (quoting Sawyer, 497 U.S. at 236). However, the Stewart panel expressly limited its holding to convictions that became final prior to the Supreme Court's decision in Skipper v. South Carolina, 476 U.S. 1, 90 L. Ed. 2d 1, 106 S. Ct. 1669 (1986): After reviewing the state of the law in May, 1985, we conclude that the rule sought by Stewart and recognized by the Simmons Court, was not dictated by existing precedent. Simmons relies primarily on Skipper v. South Carolina and Gardner v. Florida. Stewart cannot benefit from the rule of Skipper, however, because the Supreme Court rendered its decision in that case eleven months after Stewart's convictions became final. Stewart, 60 F.3d at 300-301 (citations omitted). Given the centrality of Skipper to the claim before us, see infra, the decision whether Stewart's Simmons claim was Teague -barred was a closer one. Certainly, it does not dictate a decision in the factually distinct situation before us. Two other circuits have declined to express an opinion on whether Simmons announced a new rule. See Ingram v. Zant, 26 F.3d 1047, 1054 n.5 (11th Cir. 1994) (distinguishing the facts before it from those in Simmons), cert. denied, U.S. , 115 S. Ct. 1137, 130 L. Ed. 2d 1097 (1995); cf. Allridge v. Scott, 41 F.3d 213, 222 n.11 (5th Cir. 1994) (observing that the extension of Simmons sought by the petitioner would constitute a new rule under Teague), cert. denied, U.S. , 115 S. Ct. 1959, 131 L. Ed. 2d 851 (1995).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The Simmons Court also cited Crane v. Kentucky, 476 U.S. 683, 690, 90 L. Ed. 2d 636, 106 S. Ct. 2142 (1986) (noting that due process entitles a defendant to \"a meaningful opportunity to present a complete defense\"), and Ake v. Oklahoma, 470 U.S. 68, 83-87, 84 L. Ed. 2d 53, 105 S. Ct. 1087 (1985) (holding that due process entitles an indigent defendant to the assistance of a psychiatrist for the development of his defense). Simmons, 114 S. Ct. at 2194 (plurality opinion).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Nothing in Justice O'Connor's opinion Concurring in the judgment contradicts the plurality's Conclusion that \"it is clear that the State denied petitioner due process.\" Simmons, 114 S. Ct. at 2193 (plurality opinion) (emphasis added). The Commonwealth would have me read the plurality and Concurring opinions to disagree over the plurality's Conclusion that Simmons was compelled by existing precedent. I see the divergence differently. Unlike the Justices Concurring in the judgment, the plurality would recognize a constitutional violation even where the defendant did not seek to rebut evidence that he would pose a danger in the future. Compare id. at 2190 (plurality opinion) (\"due process requires that the sentencing jury be informed that the defendant is parole ineligible\") with id. at 2201 (O'Conner, J., Concurring in the judgment) (\"due process entitles the defendant to inform the capital sentencing jury--by either argument or instruction--that he is parole ineligible\"). Because the issue is not before me, I do not address whether the plurality's position would constitute a new rule under Teague. Because this case falls within the most narrow reading of Simmons, that provided by Justice O'Connor's concurrence, O'Dell neither seeks nor requires the application of a broader mandate.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. According to Justice Blackmun: It is true that Ramos stands for the broad proposition that we generally will defer to a State's determination as to what a jury should and should not be told about sentencing. . . . States reasonably may conclude that truthful information regarding the availability of commutation, pardon, and the like, should be kept from the jury in order to provide \"greater protection in [the States'] criminal Justice system than the Federal Constitution requires.\" Concomitantly, nothing in the Constitution prohibits the prosecution from arguing any truthful information relating to parole or other forms of early release. But if the State rests its case for imposing the death penalty at least in part on the premise that the defendant will be dangerous in the future, the fact the alternative sentence to death is life without parole will necessarily undercut the State's argument regarding the threat the defendant poses to society. Because truthful information of parole ineligibility allows the defendant to \"deny or explain\" the showing of future dangerousness, due process plainly requires that he be allowed to bring it to the jury's attention by way of argument by defense counsel or an instruction from the court. Simmons, 114 S. Ct. at 2196 (plurality opinion) (citation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In recognizing the analytical distinctions between these lines of authority, it should be remembered that Ramos falls chronologically between Skipper and Gardner. The Ramos Court found no need to overrule or limit Gardner. Likewise, the Skipper Court did not find it necessary to distance itself from Ramos to hold that a capital defendant is entitled to rebut evidence of future dangerousness.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Assessing how a reasonable jurist might have analyzed any perceived conflict between Ramos and Skipper, it is much easier to distinguish the commutation power at issue in Ramos than the evidence of a capital defendant's good behavior at issue in Skipper . Compared with parole, commutation is a relatively minor power that is rarely invoked and less central to the question of future dangerousness. Most importantly, the impact of an instruction on the possibility of commutation in a capital jury's sentencing deliberation is unclear.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In Turner v. Bass, we determined that, \"while it is constitutionally permissible to instruct the jury on the subject of parole, such an instruction is not constitutionally required.\" 753 F.2d at 354. However, the facts in Turner v. Bass are distinguishable from those in Simmons and this case. Turner clearly was eligible for parole, as he sought an instruction that \"the parole board is permitted to grant parole only after finding that the prisoner's release will serve his interests and the interests of society.\" Turner v. Bass, 753 F.2d at 353. Importantly, Skipper --with its clear mandate that a defendant is entitled to rebut the prosecution's claim of future dangerousness--had yet to be decided. In Peterson, the petitioner would have been ineligible for parole only for a period of twenty years. 904 F.2d at 882. Also, the Peterson panel rested its holding on the right to present mitigating evidence under the Eighth Amendment doctrine of Lockett v. Ohio, 438 U.S. 586, 57 L. Ed. 2d 973, 98 S. Ct. 2954 (1978), not that entitling a defendant to rebut damaging evidence presented by the prosecution under the Fourteenth Amendment jurisprudence of Gardner and Skipper. Peterson, 904 F.2d at 887 (\"'States are free to structure and shape consideration of mitigating evidence.'\" (quoting Boyde v. California, 494 U.S. 370, 377, 108 L. Ed. 2d 316, 110 S. Ct. 1190 (1990)). In fact, the Peterson panel failed to distinguish Gardner and Skipper in any way, presumably because the cases were inapplicable to the claim before it. I note as well that Peterson had not been decided at the time O'Dell's conviction became final, and therefore could not have influenced a reasonable jurist in any event. Finally, the Peterson panel considered itself bound by our earlier decision in Turner, see infra note 8, which was decided without benefit of the intervening decision in Skipper. Peterson, 904 F.2d at 887 (\"Our holding in Turner controls here.\"). The other Court of Appeals case on which the Commonwealth relies, O'Bryan v. Estelle, 714 F.2d 365 (5th Cir. 1983), is similarly distinguishable. There is no indication that the defendant in O'Bryan was ineligible for parole. He challenged the trial court's \"refusal to instruct the jury about the law governing the Board of Pardons and Paroles in relation to inmates sentenced to life imprisonment,\" in order to correct the \"widely held misconception that a life sentence will result in a defendant's only serving nine or ten years in prison.\" Id. at 388. Again, there is no sign that the petitioner sought to remedy a misimpression created by the prosecution's argument that he would be dangerous in the future. It is, in fact, consistent with Ramos that the Fifth Circuit would reject a petitioner's general complaint that a jury might misunderstand the meaning of a life sentence as not being cognizable under the Constitution. The state law cases on which the Commonwealth relies are similarly distinguishable. See, e.g., Jenkins v. Commonwealth, 244 Va. 445, 423 S.E.2d 360, 369-70 (Va. 1992) (defendant eligible for parole after thirty years), cert. denied, 507 U.S. 1036, 113 S. Ct. 1862, 123 L. Ed. 2d 483 (1993); Poyner v. Commonwealth, 229 Va. 401, 329 S.E.2d 815, 828 (Va.) (decided prior to Skipper, and no indication of parole ineligibility), cert. denied, 474 U.S. 865, 106 S. Ct. 189, 88 L. Ed. 2d 158 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Because of my Conclusion that O'Dell's Simmons claim is not Teague -barred, I do not address his argument that Simmons fits within the Teague exception for \"'watershed rules of criminal procedure' implicating the fundamental fairness and accuracy of the criminal proceeding.\" See Turner v. Williams, 35 F.3d at 878 n.5 (quoting Saffle v. Parks, 494 U.S. 484, 495, 108 L. Ed. 2d 415, 110 S. Ct. 1257 (1990)). However, it seems to me that a strong argument could be made that when a state undertakes to impose a death sentence solely on the ground that a capital defendant poses a further danger, \"fundamental fairness and the accuracy of the criminal proceeding\" demand that he not be precluded from showing that he was, by virtue of the law of that state, parole ineligible.\u003c/span\u003e\n\n",
    "body_length": 202117,
    "citedas": [
      "95 F.3d 1214"
    ],
    "attorneys": "ARGUED: Eugene Paul Murphy, Assistant Attorney General, OFFICE OF THE ATTORNEY GENERAL, Richmond, Virginia, for Appellants. Robert S. Smith, PAUL, WEISS, RIFKIND, WHARTON \u0026 GARRISON, New York, New York, for Appellee. ON BRIEF: James S. Gilmore, III, Attorney General of Virginia, Linwood T. Wells, Jr., Assistant Attorney General, OFFICE OF THE ATTORNEY GENERAL, Richmond, Virginia, for Appellants. Jeffrey M. Eilender, PAUL, WEISS, RIFKIND, WHARTON \u0026 GARRISON, New York, New York; Patricia M. Schwarzschild, HUNTON \u0026 WILLIAMS, Richmond, Virginia; Michele J. Brace, Donald Lee, VIRGINIA CAPITAL REPRESENTATION RESOURCE CENTER, Richmond, Virginia, for Appellee.",
    "category": [
      "36",
      "75"
    ],
    "judges": "Before Wilkinson, Chief Judge, and Russell, Widener, Hall, Murnaghan, Ervin, Wilkins, Niemeyer, Hamilton, Luttig, Williams, Michael, and Motz, Circuit Judges. Judge Luttig wrote the opinion, in which Chief Judge Wilkinson and Judges Russell, Widener, Wilkins, Niemeyer, and Williams joined. Judge Ervin wrote an opinion Concurring in part and Dissenting in part, in which Judges Hall, Murnaghan, Hamilton, Michael, and Motz joined.",
    "citation_count": 136
  }
}
