{
  "id": "G5A-QmYBTlTomsSBsVjF",
  "document": {
    "title": "MCNEILAB",
    "full_title": "McNEILAB, INC., Plaintiff v. NORTH RIVER INSURANCE CO., et al., Defendants",
    "jurisdiction": "D. New Jersey",
    "date": "1986-09-17T00:00:00.000Z",
    "docket": "82-3934",
    "body": "BARRY, District Judge\n\nPlaintiff in this action, McNeilab, Inc., is and has been since 1959 a wholly-owned subsidiary of Johnson \u0026 Johnson, \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" a multi-national, multi-billion dollar corporation involved primarily in the health care business. Since 1955, plaintiff has been engaged in the manufacture and sale of acetaminophen, an internal analgesic for temporary relief of pain and fever, which it has marketed under the trade name \"Tylenol\".\n\nThe nation was stunned when, between September 29 and October 1, 1982, seven persons in the Chicago area died after ingesting Extra Strength Tylenol capsules laced with cyanide. Acting swiftly and efficiently to protect the public, to dissipate fear, and to clear the shelves of Tylenol so that it could quickly remarket a product in which the public would have confidence, Johnson \u0026 Johnson, between September 30 and October 7, 1982 and without consultation at any time with its insurers, undertook and funded a host of actions. Tylenol capsules and certain other McNeilab products were withdrawn from the market in the United States and seven foreign countries; the withdrawn Tylenol capsules were tested; the source of the tampering was investigated; non-tamper resistant packaged products were destroyed; tamper resistant packaging was developed; consumer studies and surveys were performed; an enormous number of reassurance messages were placed in print and on television and teleconferences were conducted; and a consumer research and exchange campaign as well as a campaign which enabled consumers to redeem coupons for tablet products issued during the crisis were launched. These actions were so successful that Tylenol not only regained but in short order exceeded its former share of the market. Without exception, those who have studied what took place during this period of time have concluded that, whatever the motive, no further deaths occurred \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\" and Johnson \u0026 Johnson with its brilliant marketing strategy scored a major business coup.\n\nThis action began as a two-count complaint in which plaintiff, a named insured under the policy issued to Johnson \u0026 Johnson, sued nine of its insurers to recover costs related to the recall. Those costs have at various times been estimated from $40,000,000 to $150,000,000 and it now appears that the appropriate figure is approximately $100,000,000, a figure which plaintiff proclaims, rather proudly, \"spared\" the insurers from having to assume the defense of additional liability actions with potential recoveries in untold millions of dollars. I note, albeit parenthetically at this juncture, that Johnson \u0026 Johnson spent this $100,000,000 to mitigate damages on a liability it has claimed from day one does not exist. Stated somewhat differently, not believing it was liable, Johnson \u0026 Johnson could not have believed it was mitigating damages.\n\nThe first count of the complaint, the count before me now, seeks a determination that Johnson \u0026 Johnson's excess and umbrella liability insurers - defendants North River Insurance Company, Transit Casualty Company, Employers Insurance of Wausau, Aetna Casualty and Surety Company, American Centennial Insurance Company, Granite State Insurance Company, First State Insurance Company, and Northbrook Excess \u0026 Surplus Insurance Company (hereinafter \"defendants\") - are required to reimburse plaintiff for those recall-related costs to the extent of their respective layers of excess insurance coverage. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\" Defendants North River, Transit Casualty, Employers of Wausau and First State, denying coverage, have moved for summary judgment, in which motion the remaining defendants have joined.\n\nPlaintiff, arguing that coverage exists, has cross- moved for summary judgment as to liability \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" relying essentially on two theories. First, it argues that the language of the excess liability insurance policy at issue here, as construed by the courts, clearly and unambiguously covers recall and recall-related expenses even though neither recall nor anything akin to it is mentioned in the coverage provision of the policy. Second, it argues that if there be ambiguity in the policy, it must be resolved in favor of the insured without resort to extrinsic evidence.\n\nThis aversion to extrinsic evidence may perhaps be explained by the fact that at no time until counsel became involved following the recall was there any thought, belief, or intent on the part of Johnson \u0026 Johnson or of any party that recall and expenses related thereto, which were neither sought nor paid for, were covered. Rather, in the years preceding the recall, Johnson \u0026 Johnson's Corporate Insurance Department, in Annual Reports to the Board of Directors, unequivocally stated that it maintained no recall coverage whatsoever. Johnson \u0026 Johnson, which at one time carried recall coverage, knew such coverage could be purchased, elected not to purchase it because the cost was prohibitive, and now claims that it enjoys recall coverage anyway. These and all other material facts are undisputed and it is similarly undisputed that the issue as to whether recall and recall-related expenses are within the scope of the policy is ripe for summary resolution on the cross motions of the parties.\n\nThere are, no doubt, a host of reasons - legal, commercial, and moral - for the massive recall campaign and its various permutations. The question before the court, however, is whether Johnson \u0026 Johnson can quite literally \"pass the buck\" to its insurers and require them to compensate it, through plaintiff, for the actions which it took. To that question, which itself is proof positive of the adage \"nothing ventured, nothing gained,\" the answer must be \"No\".\n\nI. THE INSURANCE CONTRACT\n\nIn 1977, Johnson \u0026 Johnson signed on behalf of itself and its subsidiaries an excess insurance policy with representatives of defendant North River Insurance Company, policy number JU 1081. The terms of the policy with North River are identical to those of the other defendant excess and umbrella insurers, each of which subscribed to an additional layer of coverage. The policies were renewed annually, and the North River policy applicable here was executed on May 13, 1982. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\"\n\nThe parties contend that the policy language clearly supports their respective positions. The relevant policy language provides as follows:\n\nCOVERAGE OR CONDITIONS UMBRELLA LIABILITY\n\n* * * *\n\n1. COVERAGE\n\nThe Company [North River] hereby agrees, subject to the limitations, terms and conditions hereinafter mentioned, to indemnify the insured [Johnson \u0026 Johnson and its subsidiaries] for all Sums which the insured shall be obliged to pay by reason of the liability\n\n(a) imposed upon the insured by law, or\n\n(b) assumed under contract or agreement by the Named Insured and/or any officer, director, stockholder, partner or employee of the Named Insured, while acting in his capacity as such. for damages on account of -\n\n(i) Personal Injuries\n\n(ii) Property Damage\n\n(iii) Advertising Liability\n\ncaused by or arising out of each occurrence happening anywhere in the world.\n\n* * * *\n\nTHIS POLICY IS SUBJECT TO THE FOLLOWING DEFINITIONS:\n\n* * * *\n\n5. OCCURRENCE\n\nThe term \"Occurrence\" where ever used herein shall mean an accident or happening or event or a continuous or repeated exposure to conditions which unexpectedly and unintentionally results in personal injury, property damage or advertising liability during the policy period. All such exposure to substantially the same general conditions existing at or emanating from one premises location shall be deemed one occurrence.\n\n* * * *\n\nTHIS POLICY IS SUBJECT TO THE FOLLOWING EXCLUSIONS:\n\nThis Policy shall not apply: -\n\n* * * *\n\n(c) to claims made against the Insured:\n\n* * * *\n\n(iv) for the withdrawal, inspection, repair, replacement, or loss of use of the Insured's products or work completed by or for the Insured or of any property of which such products or work form a part, if such products, work or property are withdrawn from the market or from use because of any known or suspected defect or deficiency therein.\n\nA. THE COVERAGE PROVISION\n\n1. The Impact of Precedent\n\nPlaintiff states that the coverage provision of the policy clearly covers first-party recall expenses or \"first-party mitigation expenses\", as plaintiff prefers to call them, presumably because that is the description used in the cases on which it relies. Defendants contend that the coverage provision only contemplates certain third party claims against the insured. Clearly the coverage provision by its terms does not include recall and recall-related expenses whether those expenses are denominated as \"recall\", \"withdrawal\", or \"mitigation\". Indeed, Exclusion (c)(iv) (the so-called \"sistership\" provision, discussed below), which specifically excludes coverage for third-party \"withdrawal claims\", is the only point in the policy at which any such language is used explicitly.\n\nPlaintiff contends, nonetheless, that certain cases construing similar coverage language have held liability insurers responsible for their insured's mitigation expenses, and suggests that those results apply to bind the parties here. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\" I note in passing that there has been little discussion by the parties in this case as to whether expenses for the recall itself much less the variety of expenses extraneous to recall and/or mitigation may be considered \"mitigation\" expenses within the meaning of the cases cited by plaintiff. It is, indeed, open to considerable doubt that the courts which developed the doctrine on which plaintiff relies even contemplated the question of whether \"mitigation\" expenses included product recall expenses. There is utterly no doubt, however, that those courts never contemplated such expenses in the context of a potential mass disaster. Indeed, the facts of the case plaintiff describes as \"the leading case,\" Leebov v. United States Fidelity and Guar. Co., 401 Pa. 477, 165 A.2d 82 (1960), are light years away from the facts before me, presenting nothing more complicated than the claim of a small building contractor who was excavating along a hillside when land began to slide and the porch of a house collapsed. Leebov shored up the land so that further slides and further property damage would not occur.\n\nPlaintiff relies primarily upon Leebov for its construction of the coverage clause. The policy in Leebov read, \"[The defendant insurance company agrees] to pay on behalf of the Insured all sums which the Insured shall become obligated to pay by reason of the liability imposed upon him by the loss of use thereof, caused by accident and arising out of the hazards hereinafter defined.\" 401 Pa. at 478-79 (brackets in original, italics added for emphasis). The court in Leebov distinguished the policy it was construing from that discussed in Desrochers v. New York Cas. Co., 99 N.H. 129, 106 A.2d 196 (1954), which stated that the insurer undertook, \"to pay on behalf of the insured all sums which the insured shall become obligated legally to pay as damages. . . because of injury to or destruction of property, including the loss of use thereof.\" 106 A.2d at 198 (ellipsis in original, underlining added for emphasis). \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\"\n\nPlaintiff urges that, following the distinction made in Leebov between \"by reason of liability . . . for damages\", the policy language at issue here, and \"as damages\", the language of the Desrochers ' policy, courts always allow mitigation expenses in the former case but not necessarily in the latter. Defendants, on the other hand, contend that this is distinctio absque differentia - a distinction without a difference. H. Fielding, Tom Jones, bk. VI, Ch. 13 (1747). \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\" This question has never been directly discussed in the courts of New Jersey. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\" Were there authoritative New Jersey cases construing the language at issue here, it would, of course, be game, set, and match with reference to this case.\n\nLeebov states, without revealing its reasoning or relying on any authority, that the phrase, \"as damages\", is a limited one, while the statement \"by reason of liability\" is not limited, eliminating insurer responsibility for mitigation expenses under the former phraseology and including such expenses under the latter phraseology. 165 A.2d at 84. The court thereafter justifies its decision on grounds entirely indifferent to any distinction between \"limited\" and \"not limited\" coverage clauses - that the insurer would have been liable for further actual damage barring mitigation, that there was evidence that the insured had asked for \"complete coverage\", and that there was evidence that the insurer had previously paid a similar claim to the insured. Thus, it would appear that the difference between \"as damages\" and \"by reason of liability for damages\" was not essential or even important to the Leebov court's holding. Indeed, it appears that if, indeed, there is a distinction, the distinction was a mere makeweight to other circumstances which enabled the court to find coverage.\n\nLeebov, \"the leading case,\" certainly has not been frequently relied upon. Since it appeared twenty-six years ago, only thirteen published cases have cited it and only one slip opinion citing Leebov was available in the computer-aided legal research databases. Of these fourteen cases, none was decided by a New Jersey court, and only two discuss the distinction made in Leebov between \"by reason of liability for damages\" and \"as damages\". Slay Warehousing Co. v. Reliance Ins. Co., 471 F.2d 1364 (8th Cir. 1973); Aronson Associates, Inc. v. Pennsylvania National Mut. Cas. Ins. Co., 14 Pa. D \u0026 C.3d 1 (Com. Pl. 1977), aff'd mem. 272 Pa. Super. 606, 422 A.2d 689 (1979).\n\nIn fact, it appears that the plurality of subsequent citations to Leebov stand for the proposition that extrinsic evidence is admissible to aid in ascertaining the parties' intent in the interpretation of a contract generally or an insurance policy in particular, \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\" a determination which plaintiff seeks to avoid. Several cases cite Leebov generally for the proposition that, in certain circumstances, mitigation expenses may be recoverable against an insurer, but do not refer to specific coverage language. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\" Other cases distinguish Leebov's mitigation expenses holding on various grounds. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\" Yet other cases cite Leebov for various propositions having nothing to do with the coverage provision. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\"\n\nSlay Warehousing Co. v. Reliance Ins. Co., 471 F.2d 1364, relied upon Leebov in its discussion of a different mitigation reimbursement situation. The policy in question in Slay Warehousing contained \"by reason of liability\" language. In reference to this language, the Slay Warehousing court, at 1366, stated, \"The Supreme Court of Pennsylvania has construed similar language within a liability insurance policy to require reimbursement of [mitigation] expenses . . .,\" and went on to quote verbatim the articulation of the distinction in Leebov without further discussion of the merits of that distinction. It is obvious, however, that the court in Slay Warehousing did not rest on the use of \"by reason of liability\" language in finding mitigation expenses reimbursable by the insurer.\n\nThe Slay Warehousing court pointed to another court which had found the insurer liable for mitigation expenses based upon an exclusion, not a coverage, clause ( Harper v. Pelican Trucking Co., 176 So.2d 767 (La. App. 1965)) and went on to state: \"Obviously, each case must be examined in light of the specific agreement and the law of the particular jurisdiction.\" 471 F.2d at 1367. Further discussion in Slay Warehousing reveals that the decision requiring reimbursement of mitigation expenses was based not at all upon the use of the phrase \"by reason of liability\" in the coverage clause, but upon the court's reading of the cooperation clause involved in that case. There is no such cooperation clause here.\n\nSlay Warehousing has been cited even less frequently than Leebov and not one of those citations discusses any distinction between the phraseology \"as damages\" and \"by reason of liability.\" \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" On the other hand, Aronson Associates, Inc. v. Pennsylvania National Mut. Cas. Ins. Co., 14 Pa. D. \u0026 C. 3d.1, discussed the distinction and, deciding that it was unimportant, found Leebov controlling and awarded mitigation reimbursement expenses against the insurer where there was an \"as damages\" coverage clause. The Aronson court stated, 14 Pa. D. \u0026 C. 3d at 6-7, \"Justice Musmanno appeared to distinguish a New Hampshire case, which went in favor of the insurer, where the policy language was similar to the within policy. However, a full reading of the decision in Leebov, 401 Pa. 477, 165 A.2d 82, reveals that what the court held was that preventive measures can be recovered where they are required to protect against a third person being harmed.\" (emphasis added) The court thereafter made clear that the logic behind Leebov would apply irrespective of the language employed. It would thus appear that Aronson, an opinion by a lower court in the state in which Leebov was decided and, therefore, presumably more closely acquainted with the interpretation of Pennsylvania Supreme Court rulings than the Slay Warehousing court, directly contradicts the off-hand assertion in Slay Warehousing that the Leebov court construed the \"by reason of liability\" phrase to require reimbursement of mitigation expenses.\n\nAronson's refusal to recognize a distinction between the two coverage phrases is eminently more reasonable than Slay Warehousing's recognition of that distinction and is strengthened by three factors. First, the court in Aronson was obviously aware of Slay Warehousing, as it cited it, 14 Pa. D \u0026 C. 3d at 7, apparently for the general proposition that mitigation expenses are recoverable by the insured. Second, Aronson was affirmed by the Pennsylvania Superior Court, which adopted the opinion below. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\" Third, a Pennsylvania Court of Common Pleas case, Lehigh Electric \u0026 Engineering Co. v. Selected Risks Ins. Co., 30 Pa. D \u0026 C 3d 120, relied on Aronson's interpretation of Leebov with reference to a policy which also used the \"as damages\" phraseology. Without explicitly discussing the distinction between the \"as damages\" and the \"by reason of liability for damages\" language, the Lehigh Electric court stated, \"The language contained in the instant policy is strikingly similar to that . . . in Aronson Associates, Inc. . . .,\" and found Aronson Associates both persuasive and controlling.\n\nIn spite of its heavy reliance on the argument that the \"by reason of liability\" coverage language in the present policy should be construed to include and require reimbursement of mitigation expenses by the insurer to the insured, plaintiff has offered only Leebov and Slay Warehousing and there appear to be no other cases so construing similar coverage language. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\" Cases cited by plaintiff, other than those two, tend to show that, as far as reimbursement for mitigation expenses is concerned, the use of \"as damages\" or \"by reason of liability\" simply makes no difference. Goodyear Rubber \u0026 Supply, Inc. v. Great American Ins. Co., 545 F.2d 95 (9th Cir. 1976)(\"as damages\" used in underlying policy, \"by reason of liability\" used in umbrella policy, insurers required to reimburse based on definition of \"property damage\"); American Economy Ins. Co. v. Commons, 26 Or.App. 153, 552 P.2d 612, 613 (1976)(in property damage policy, not liability policy, phraseology used both \"by reason of\" and \"as damages because of bodily injury or property damage\"; court rested liability for mitigation damages on the latter phrase).\n\nThus, the argument that case law requires this court to construe a coverage clause using the phrase \"by reason of liability\" as mandating the coverage of recall and recall-related expenses, an argument which plaintiff believes to be the jewel in its crown, is wholly unavailing. Only Leebov appears to have attached independent significance to the phrase \"by reason of liability\" as mandating first-party mitigation coverage in a liability insurance policy and the distinction made there is entirely unconvincing. Moreover, an analysis of Leebov, especially in light of its interpretation by the lower courts of Pennsylvania, makes clear that that conclusion was merely obiter dictum. Finally, the cases and learned commentary that have referred to Leebov have criticized that aspect of the court's decision. Under the standard set forth in Mazzilli v. Accident \u0026 Cas. Ins. Co., 35 N.J. 1, 170 A.2d 800, discussed supra at note 6, plaintiff's argument fails.\n\n2. Significance of the Phrase \"by reason of \"\n\nAs there is no construction of the relevant terms of the coverage provision binding on me, or, indeed, persuasive to me, I turn to an analysis of whether the language of the coverage provision in the policy at issue here provides for the reimbursement of recall and recall-related expenses. LeFelt v. Nasarow, 71 N.J. Super. 538, 177 A.2d 315.\n\nThe majority of those cases which discuss the meaning of the phrase \"by reason of\" indicate that its meaning, in a legal context, while somewhat wider than the categories of coverage which follow that phrase in a particular policy - in this case, liability for damages imposed upon plaintiff by law and liability assumed by plaintiff under a contract or agreement - cannot widen liability significantly beyond the scope and nature of those categories.\n\nCoverage \"by reason of\" liability simply does not cover all damages related in some way to liability; rather, there must be a causal connection between the object of the prepositional phrase \"by reason of\" and the damage claimed. General Acc. Fire \u0026 Life Assur. Corp. v. Continental Cas. Co., 287 F.2d 464, 467 (9th Cir. 1961) (insured entitled to recover with \"by reason of\" phraseology only when the accident was directly caused by the object of the phrase; recovery \"by reason of\" something requires causation); Chrysler Motors Co. v. Royal Indem. Co., 76 Cal.App.2d 785, 174 P.2d 318 (1946) (injuries caused by insured's employee's negligence resulting in a flash electric fire were not injuries \"by reason of\" work let or sublet, but were due to insured's direct negligence and, thus, not covered; object of prepositional phrase \"by reason of\" must be direct cause of injury in order for insured to recover); Retherford v. Kama, 52 Hawaii 91, 470 P.2d 517 (1970) (\"by reason of\" narrower than \"with respect to\", the former requiring a causative connection while the latter does not); Michigan Stamping Co. v. Michigan Employers' Cas. Co., 235 Mich. 4, 209 N.W. 104 (1926) (liability \"by reason of work . . . let to independent contractors\" does not equal \"in performance of work of independent contractors\" and requires a causal connection; the language clearly implies coverage only for third party injuries and not injuries to workers).\n\nThe causal connection implied by the phrase \"by reason of\" is normally that of proximate causation. Currier v. McKee, 99 Me. 364, 59 A. 442 (1904) (to show injury \"by reason of . . . intoxication\" it was not necessary to show that the furnishing of the liquor was the proximate cause of the injury, but that the intoxication - the object of the prepositional phrase - was the proximate cause of the injury); Houston \u0026 T.C.R. Co. v. Anglin, 45 Tex. Civ. App. 41, 99 S.W. 897 (1907), writ of error denied 99 S.W. 897, 45 Tex. Civ. App. 41 (1907) (\"by reason of\" being the equivalent of \"as the direct and proximate result of\"). But see Dolph v. Maryland Cas. Co., 303 Mo. 534, 261 S.W. 330 (1924), with which compare the subsequent case Avery v. American Automobile Ins. Co., 350 Mo. 395, 166 S.W. 2d 471 (1942). The court in Alabama Great So. R. Co. v. Louisville \u0026 Nashville R. Co., 127 F. Supp. 363 (N.D. Ala. 1955) aff'd in relevant part, reversed on other grounds, 224 F.2d 1 (5th Cir. 1955), discussed this question at length. While it agreed that in general \"by reason of\" was the equivalent of \"proximately caused by\", citing a large number of cases, 127 F. Supp. at 369 nn.3-4, the court concluded that the wording of each agreement must be construed from context and found in that case that the ordinarily causal quality of the phrase \"by reason of\" was vitiated by the addition of the phrase \"in whatever manner the same may be caused,\" and that \"by reason of\" in that specific instance meant only that the object of the preposition need have some part in, although not necessarily be a proximate cause of, the ultimate loss. In the present instance, of course, there is no such modifying language.\n\nIt is clear that the use of the phrase \"by reason of liability\" in the present case does not include recall and recall-related expenses as covered items but, to the contrary, excludes them. As explained above, \"by reason of\" requires at least some causal connection between the allegedly covered expense and liability and in most cases would appear to require proximate causation. The recall in the present case was not caused by liability for the seven deaths; it was at best merely related to the seven deaths in that they served as notice to plaintiff that the Tylenol remaining on the shelves was potentially harmful. The recall was thus prompted, if for any related reason, by the possibility of future liability for possible future poisonings and not, as the policy requires, by liability \" imposed by law\" - which can refer only to previously completed torts - or \"assumed under contract\" - which refers to settlements and is not applicable here. See Dreis \u0026 Krump Mfg. Co. v. Phoenix Ins. Co., 548 F.2d 681 (7th Cir. 1977). Indeed, given the deposition testimony of James E. Burke, Chief Executive Officer of Johnson \u0026 Johnson, that the Tylenol recall was motivated by both moral and business considerations, it came as no surprise when any possibility of the required causal connection between the recall and legal liability was disclaimed by counsel at the December 24, 1985 oral argument before Judge Lacey.\n\nTHE COURT: Well, what catastrophe were you stopping here?\n\n[COUNSEL FOR PLAINTIFF]: Stopping the death of the additional unknown numbers of people.\n\nTHE COURT: And that's why you did it?\n\n[COUNSEL]: That is a principal motivating factor for why we did it. That is -\n\nTHE COURT: But that doesn't emerge from the submissions, that this was the principal, - are you saying it was the principal factor?\n\n[COUNSEL]: I think it was the principal factor.\n\n(emphasis added) Transcript at 31.\n\nContrary to plaintiff's assertion that intent in the withdrawal of Tylenol was unimportant, I find that intent, as it relates to the cause for the recall, is crucial. As plaintiff concedes that its withdrawal of Tylenol from the market was caused not by its liability but by its desire to prevent further deaths, to alleviate fear and, less altruistically, to restore Tylenol to its preeminent position, the present coverage language cannot include recall and recall-related expenses. It is not, therefore, necessary to inquire into the much harder case that would have been posed had plaintiff's recall been motivated by a desire to avoid liability in future potential suits although, for reasons stated more fully below, even such a motivation would not have been within the coverage of the policy.\n\n3. Scope of Coverage\n\nPlaintiff asserts next that even if there is no specific language in the coverage provision affording coverage for recall and recall-related expenses, the general language of the policy so provides. Defendants, resting in large part upon the reasoning expressed in Weedo v. Stone-E-Brick, Inc., 81 N.J. 233, 405 A.2d 788 (1979), assert that the policy in question covers only third party claims. As it applies in the present case, Weedo emphasizes the traditional principle of insurance law that ambiguities will not be forced into an insurance policy nor will the words of an insurance policy be artfully construed to include a type of coverage outside the scope and nature of the policy in question. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\"\n\nThe parties agree that the policy is a liability policy, and frame their arguments in terms of liability only on account of personal injury. Defendants assert, and I agree, that an entirely different type of insurance coverage, recall insurance, was available. It is sufficient to note at this juncture that at one time Johnson \u0026 Johnson purchased such coverage from defendant Aetna and let this coverage expire, that Johnson \u0026 Johnson's domestic insurance broker attempted to interest Johnson \u0026 Johnson in the purchase of such insurance, and that in internal memoranda Johnson \u0026 Johnson reported itself as self-insured as to recall because, although such coverage was available, the cost was prohibitive. Weedo, 81 N.J. at 247, makes quite clear that a contrived construction cannot be used which \"affords indemnity in an area of insurance completely distinct from that to which the policy applies in the first instance. To use an extreme example, no amount of semantical ingenuity can be brought to bear on a fire insurance policy so as to afford coverage for an intersection collision.\" The construction urged by plaintiff, while not quite so extreme, would certainly provide coverage for \"an area of insurance completely distinct from\" the intent and purpose of liability insurance coverage, not to mention first party coverage on what is nothing other than a third party policy.\n\nBlack's Law Dictionary, at 824 (5th ed. 1979), defines \"liability insurance\" as\n\n[A] contract by which one party promises on consideration to compensate or reimburse [the] other if he shall suffer loss from specified cause or to guaranty or indemnify or secure him against loss from that cause. Fidelity General Ins. Co. v. Nelsen Steel \u0026 Wire Co., 132 Ill. App. 2d 635, 270 N.E.2d 616, 620 [1971]. That type of insurance protection which indemnifies one from liability to third persons as contrasted with insurance coverage from losses sustained by the insured.\n\n(emphasis added). \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\" Thus, liability insurance, and the traditional interpretation thereof, applies only to damages claimed of the insured by third parties (and attorney's fees incurred in defense thereof) and not to first party losses of the insured itself. See, e.g., Alcorn Bank \u0026 Trust Co. v. United States Fid. \u0026 Guar. Co., 705 F.2d 128, in which the court stated:\n\nThis distinction between first party losses and third party damage claims is generally recognized . . . Coverage on liability policy does not extend to damages for injuries to the insured personally since \"liability insurance . . ., as concerns the assured, is third party coverage\" . . ..\n\nThe district court concluded that the insurance contract 'only encompasses losses sustained by third parties for which the bank is ultimately liable.' We agree. This liability insurance policy does not extend first party protection to [the] bank. That type protection may be purchased . . . but it was not part of the comprehensive general liability insurance policy . . . .\n\n(citations omitted). See also Twin City Fire Ins. Co. v. Wilkerson, 247 F. Supp. 766, (construing \"liability insurance\" for removal purposes in accord with 28 U.S.C. § 1332(c) and defining such insurance as \"an indemnity agreement which protects the insured against his liability to others\"); \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\" Maxon v. Security Ins. Co., 214 Cal. App.2d 603, 29 Cal. Rptr. 586 (1963) (\"the policy in question did not purport to insure the [insured] for an accident happening to him but to a third person\"); Lou-Con, Inc. v. Gulf Building Services, Inc., 287 So.2d 192, (death, damage, and destruction policy being construed was for first party liability and was therefore not a liability policy which \"is written for the benefit of third parties who suffer injury or damage because of the actions of the insured.\"). See also Southern California Edison Co. v. Harbor Ins. Co., 83 Cal. App. 3d 747, 148 Cal. Rptr. 106, 112 (1978) (difference between liability insurance and builder's risk insurance is third-party nature of the former); Rafeiro v. American Employers Ins. Co., 5 Cal. App. 3d 799, 85 Cal. Rptr. 701, 708 (1970) (similar).\n\nNumerous cases have dealt with the issue of whether liability insurance covers replacement or repair by a building contractor due to defective construction. The almost unanimous conclusion is that mere replacement or repair is not covered, but damage caused by the defective construction to persons and to property not built by the contractor is covered. The cases deny coverage to the insured, even for third party claims, where the damage to the third party is consequential and there is no direct tangible damage. Many of these cases address themselves specifically to exclusionary clauses typical of building contractors' liability insurance. See, e.g., Weedo v. Stone-E- Brick, Inc., 81 N.J. at 237-38 n.2 (1979). Other cases, however, have specifically reached the general coverage provisions and denied coverage on those grounds. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\"\n\nIt is clear, as defendants contend, that \"liability insurance,\" as it is traditionally understood, does not cover first party expenses. In construing a contract, a court must look to the ordinary and popular sense of the terms and give them a reasonable and natural construction. 13 Appleman § 7386 at 138-167 (1976 \u0026 1986 Supp.); 2 Couch 15:16-18 at 166-94 (1984 \u0026 1985 Supp.). Thus, unless there be persuasive authority for finding otherwise, which there is not, it would appear that coverage for recall and recall-related expenses is outside the scope of coverage of liability insurance and, therefore, not cognizable in the instant policy under the reasoning of Weedo.21\n\nEven if recall and recall-related expenses could be within the scope of coverage of liability policies generally, there is grave doubt that such expenses would be covered under the instant policy. The premium paid is apparent from the face of the policy, and it is clear that the amount of the premium can be used in establishing the extent of coverage when the extent of coverage is in doubt. This proposition was succinctly stated in a New Jersey case and has been followed in other jurisdictions. Prather v. American Motorists Ins. Co., 2 N.J. 496, 67 A.2d 135 (1949). See Pan American World Airways, Inc. v. Aetna Cas. \u0026 Sur. Co., 505 F.2d 989, 1001 \u0026 n.10 (2d Cir. 1974); Close-Smith v. Conley, 230 F. Supp. 411 (D. Or. 1964); 13 Appleman § 7389 at 192-96 (1976 \u0026 1986 Supp.); 2 Couch § 15:52 at 291 (1984 \u0026 1985 Supp.); 11 Couch § 44.261 at 405-06 \u0026 n.11 (1982 \u0026 1985 Supp.) (\"There is no coverage with respect to a type of claim which falls directly within a particular coverage clause which was not purchased by the insured.\"). Here, there is no dispute that the premium amount was substantially less than it would have been had recall and recall-related expenses been included. We again return to one rock hard fact: Johnson \u0026 Johnson knew it could purchase recall insurance and elected not to do so.\n\nIt is, of course, possible in construing a policy for a court to consider that alternative language explicitly placing the asserted coverage clearly outside the policy could have been used, such as the language of the Insurance Services Office (\"ISO\") policy to which plaintiff points which clearly excepts first party recall claims. Nevertheless, it is quite clear under New Jersey law that that fact is merely an aid to construction, and not conclusive. Mazzilli v. Accident \u0026 Cas. Ins. Co., 35 N.J. 1, 7, 170 A.2d 800, 803 (1961); Ellmex Const. Co. v. Republic Ins. Co., 202 N.J. Super. 195, 204, 494 A.2d 339, 344 (App. Div. 1985); Aetna Ins. Co. v. Weiss, 174 N.J. Super 292, 416 A.2d 426 (App. Div. 1980); American Legion Tri-County Mem. Hosp. v. St. Paul Fire \u0026 Marine Ins. Co., 106 N.J. Super. 393, 397, 256 A.2d 57, 59 (App. Div. 1969); American Policyholders Ins. Co. v. Portale, 88 N.J. Super. 429, 439-40, 212 A.2d 668, 674 (App. Div. 1965); Kook v. American Sur. Co., 88 N.J. Super. 43, 51-52, 210 A.2d 633, 638 (App. Div. 1965).\n\nMoreover, if an alternative type of coverage is available and known to the insured, as here first-party recall insurance was both available and known, such coverage will not be imputed to the policy in question. \"We cannot rewrite the policy or create a better contract than that which the insured purchased.\" Boonton Handbag Co. v. Home Ins. Co., 125 N.J. Super. 287, 310 A.2d 510. See Transamerica Ins. Co. v. Keown, 451 F. Supp. 397, 400 (D.N.J. 1978); Last v. West American Ins. Co., 139 N.J. Super. 456, 354 A.2d 364 (App. Div. 1976); American Mercury Ins. Co. v. Bifulco, 74 N.J. Super. 191, 181 A.2d 20; American Nurses Ass'n v. Passaic Gen'l Hosp., 184 N.J. Super. 170, 181, 445 A.2d 448, 454 (L. Div. 1981), rev'd on other grounds 192 N.J. Super. 486, 471 A.2d 66 (App. Div. 1984), aff'd in part, rev'd in part on other grounds, 98 N.J. 83, 484 A.2d 670 (1984); Deodato v. Hartford Ins. Co., 143 N.J. Super. 396, 401, 363 A.2d 361, 365 (L. Div. 1976), aff'd mem. 154 N.J. Super. 263, 381 A.2d 354 (App. Div. 1977); 13 Appleman § 7402 at 270-301 (1976 \u0026 1986 Supp.); 2 Couch § 15:10 at 146-54 (1984 \u0026 1985 Supp.).\n\nB. OTHER POLICY PROVISIONS\n\nThe parties make several arguments in terms of policy provisions other than the basic coverage provision, in particular the sistership provision, a provision designed to exclude coverage for recall which in the present policy specifically excludes only third-party recall claims, and the definition of \"occurrence.\". It is obvious that these provisions, as well as the rest of the policy in question, were written entirely with the view that only third-party claims were covered. It simply makes no sense to suggest, as plaintiff suggests, that the parties explicitly agreed to exclude third-party recall claims on a primarily third-party policy, yet implicitly agreed to include first-party claims when first-party coverage was at best a residual and remediary category of coverage of the policy. Stated somewhat differently, there must be first-party coverage before one can even argue that a type of first-party coverage was not excluded.\n\nCertainly, the policy behind the sistership provision - to avoid ambiguity and qualify the breadth of coverage - would be violated if recovery were allowed here. The Insurance Services Office (\"ISO\") issued the following statement in 1966, a statement which remains the position of the insurance industry today:\n\nIf the named insured's product causes injury or damage and identical products are withdrawn from the market or from use because of a known or suspected defect (one airplane crashes and others are withdrawn from use), the cost of withdrawing or replacing products or completed work may be either a direct expense to the insured or liability to others. Such cost, whether damages or expenses, are not intended to be covered. Sistership liability or products recall insurance is the subject of a special form of coverage.\n\nMoreover, even if first-party recall expenses were recoverable on the present policy, because the sistership provision specifically excludes third-party claims for recall plaintiff may well have had a duty to its insurer to carry out the recall in a manner such that as much of the recall expense as possible fell within the exclusion. For the development of and reasoning behind the sistership provision, see 7A Appleman § 4508.01 at 355 \u0026 n.24, § 4508.02 at 371-72 \u0026 n.26-29, 38-81 \u0026 n.45 (1970 \u0026 1986 Supp.); 12 Couch § 4A:62 at 100-01 (1981 \u0026 1985 Supp.).\n\nWith reference to the definition of \"occurrence,\" defendants claim that the recall was an event which was neither unexpected nor unintended by plaintiff and is, therefore, not covered. Plaintiff claims that the failure of defendants to modify the words \"unexpectedly and unintentionally\" with the phrase \"from the point of view of the insured,\" means that \"unexpectedly and unintentionally\" refers to the point of view of potential victims, and therefore recall would still be covered. In essence, the reasoning behind similar clauses in earlier insurance policies had been to exclude from coverage intentional acts by the insured as well as to narrow the definition of coverage to events somewhat approximating accidents as opposed to planned events. See Annot., Construction and Application of Provision of Liability Insurance Policy Expressly Excluding Injuries Intended or Expected by Insured, 31 A.L.R.4th 957 (1984 \u0026 1985 Supp.) (hereinafter referred to as \" Provision of Liability Insurance Policy \"); Annot., Liability Insurance: Specific Exclusion of Liability for Injury Intentionally Caused by Insured, 2 A.L.R.3d 1238 (1965 \u0026 1985 Supp.). Over the years, many courts, looking for ways to compensate innocent victims of intentional torts, construed the term \"expected\" without qualification to refer to the point of view of the victim and not the tortfeasor. See 7A Appleman § 4492.02 at 27 (1970 \u0026 1986 Supp.); Provision of Liability Insurance Policy, supra. Until the new \"occurrence\" policies, all such efforts construed the definition of \"accident\" in \"accident\" policies, which policies included only the exclusion of \"expected\" events in this particular context. The majority of the new \"occurrence\" policies, which exclude both \"intended\" and \"expected\" events under the standard American ISO language, have included the modification \"from the point of view of the insured\" and, therefore, there has been little construction of \"occurrence\" policies that does not include such a modification.\n\nThe only case directly on point, Ashland Oil, Inc. v. Miller Oil Purchasing Co., 678 F.2d 1293 (5th Cir. 1982), held rather cursorily that based upon the construction of \"expected\" in \"accident\" policies as referring to the point of view of the victim, \"unexpectedly and unintentionally\" as unmodified also referred to the point of view of the victim. This holding has not been followed, and I have some difficulty with it. If the term \"unexpectedly\" were used alone, there would be no question that under New Jersey law \"from the point of view of the victim\" would be implied. See Pennsylvania Nat'l Mut. Cas. Ins. Co. v. Estate of Miller, 185 N.J. Super. 183, 447 A.2d 1344 (App. Div. 1982). While some courts have held that \"intended\" and \"expected\" mean the same thing, other courts have held differently in other contexts, and I would agree with them in this context. As to this disagreement, see Provision of Liability Policy, supra at 981-83. In discussing the meaning of \"intended\", the cases do not deal with whose standpoint is to be inferred. See Provision of Liability Policy, supra. However, in context, \"intended\" cannot mean from the point of view of the victim, as it makes no sense. If someone acted intentionally and caused himself harm, there would be no way for an insured to be implicated, for there would be no one for the victim to sue but himself. Therefore, \"intended\" must imply \"from the point of view of the insured\", which in the present case would exclude coverage for the recall as that was an act intended by the insured.\n\nThe fact that no policy provision afforded coverage is confirmed by the manner in which the policy was viewed by the parties. Not one employee or agent of Johnson \u0026 Johnson who testified, save Hubert Seiffert, its Assistant Treasurer, stated that he believed, expected, or intended at any time that recall expenses would be covered under the policy and plaintiff describes Mr. Seiffert's assumption to the contrary as \"uninformed.\" Somewhat confusingly, in another submission plaintiff describes the understanding of Frederick B. Molineux, Johnson \u0026 Johnson's highly experienced Director of Corporate Insurance, (and, presumably, would describe the understanding of everyone else) that there was no recall coverage as \"erroneous\" but then only because of the \"plain language of the policy.\" This language, I note, was so \"plain\" that it and the coverage it purports to afford were not discovered for years.\n\nPrior to the recall, Annual Reports to the Board of Directors unequivocally stated that Johnson \u0026 Johnson maintained no recall insurance whatsoever. Indeed, it appears that insurance for recall expenses was never even discussed with H. S. Weavers, North River's principal reinsurers. Coincidentially, one month before the recall, Johnson \u0026 Johnson's domestic insurance broker, Johnson \u0026 Higgins, offered Johnson \u0026 Johnson a form of cover known as product integrity/impairment insurance. Johnson \u0026 Higgins' representatives testified that no such offer would have been made had it been thought that any Johnson \u0026 Johnson policy would indemnify Johnson \u0026 Johnson were it to incur recall expenses.\n\nThe reason why there was no insurance for recall and recall-related expenses is clear - it was simply too expensive. As Judge Lacey found in the Affiliated FM aspect of this litigation, findings which plaintiff does not here dispute and which, in any event, it is estopped from disputing:\n\nIn performing his duties as a risk manager, Mr. Molineux had identified the risk of a product recall and the potential catastrophic financial impact it could have on plaintiff or one of its family of companies. In 1979 he advised the plaintiff's executive committee that losses involving the recall or withdrawal of any of plaintiff's products from the marketplace were insurable but at a prohibitive cost - Findings of Fact No. 44.\n\n. . . Mr. Molineux knew that the risk existed of someone in the public tampering with a packaged product of plaintiff's once it had been unconditionally sold and delivered to third parties, and he made a conscious decision not to insure the interruption of plaintiff's operation flowing from a recall. Findings of Fact No. 45.\n\nHe similarly made a conscious decision not to insure product recall expenses. This decision was fully consistent with the philosophy of the Corporate Insurance Department of Johnson \u0026 Johnson whereby the transfer of risk to an insurer was the last step in the risk management process. See Findings of Fact No. 20.\n\nFollowing the Tylenol poisonings and while renegotiating the policy, Mr. Molineux supposedly represented to H. S. Weavers that, aside from the seven death cases, no further claims would be presented in connection therewith, a representation defendants suggest was made for the purpose of obtaining a premium reduction. While plaintiff denies that Mr. Molineux promised that there would be no further claims, it is undisputed that a premium reduction was, in fact obtained; that no mention was made of product recall insurance; and that Johnson \u0026 Johnson's attorneys had not yet begun to examine the liability policy seeking a basis for recall coverage.\n\nIndeed, no claim has yet been presented; rather this lawsuit was filed. As Judge Lacey found in the Affiliated FM case:\n\nPlaintiff's conduct in presenting its insurance claim at issue here suggests it knew after the loss occurred that it had no explicit coverage to cover the losses involved herein. Under normal circumstances, plaintiff's Corporate Insurance Department would have submitted any potential claims to the insurance carrier involved. In this particular case the department never submitted a claim to Affiliated, but rather a lawsuit was started. Findings of Fact No. 69.\n\nC. INTERPRETATION OF AMBIGUITIES\n\nThe importance of the manner in which the parties viewed the policy is borne out in those cases dealing with ambiguities in the insurance contract. Weedo v. Stone-E-Brick, 81 N.J. at 247, defined an ambiguity as follows: \"We conceive a genuine ambiguity to arise where the phrasing of the policy is so confusing that the average policy holder cannot make out the boundaries of coverage.\" There can be no ambiguity here as there are not two possible interpretations and the policy at issue would not be at all confusing to the average policy holder. It is the interpretation that the ordinary public purchasing similar insurance policies would apply that the courts must ascertain. Entron, Inc. v. Affiliated FM Ins. Co., 749 F.2d 127; DiOrio v. New Jersey Mfrs. Ins. Co., 79 N.J. 257, 398 A.2d 1274 (1979); Linden Motor Freight Co. v. Travelers Ins. Co., 40 N.J. 511, 193 A.2d 217; Petronzio v. Brayda, 138 N.J. Super. 70, 350 A.2d 256 (App. Div. 1975) (\"We recognize that the doctrine of reasonable expectations of the average policyholder has been employed in order to expand coverage in favor of the assured rather than to limit it in favor of the carrier. Nevertheless there is no reason apparent to us why this test of construction should be disregarded because the result thereof would benefit the carrier instead of the assured.\"); Tomaiuoli v. United States Fid. \u0026 Guar. Co., 75 N.J. Super. 192, 182 A.2d 582. It is relevant, although as an argument ex nihilo it is not conclusive, that defendants have sold numerous similar policies and not a single claim for recall expenses has been made on them.\n\nAny confusion read into the policy is read only by plaintiff both from the absence of language negating terms foreign to the policy and imputing into that policy, which is entirely third-party in context and effect, a first-party coverage which was not intended. Courts will not strain the language of the policy to find an ambiguity where there is none in order to grant coverage that does not exist. Weedo v. Stone- E-Brick, Inc., 81 N.J. at 247; 13 Appleman § 7402 at 270-301 (1976 \u0026 1986 Supp.). I note that in Commercial Union Ins. Co. v. Pittsburgh Corning Corp., 789 F.2d 214 (3d Cir. 1986), the Court of Appeals chastised the insured for attempting to create an ambiguity long after the fact of contracting. The present case is that much the worse in that plaintiff, having failed to convince this court that the explicit wording of the policy affords it the coverage it claims, seeks not only to force an ambiguity into the contract after the fact, but seeks to interpret the purported ambiguity contrary to its own admitted intent.\n\nBut even were the policy ambiguous, defendants would prevail. Plaintiff argues that if an ambiguity be found, the rule of contra proferentem should be strictly applied and that extrinsic evidence, which here goes one way and one way only and which plaintiff seeks to avoid like the plague, should not be allowed to demonstrate the actual intent of the parties. Plaintiff reads New Jersey law to be that the strict rules of insurance construction should apply even when the insured is a large corporation which had the aid of counsel in choosing and bargaining over the policy. Plaintiff is wrong.\n\nWeedo states that as to policies which are ambiguous, \"the 'doctrine of ambiguity' works to effectuate the consumer's expectation that the policy purchased extended greater coverage in the particular underwriting area.\" 81 N.J. at 247. \"The construction placed on a policy by the parties thereto should ordinarily be adopted by the courts as controlling, if the policy is susceptible of such construction.\" 6B Appleman § 4254 at 27- 28 \u0026 n.27 (1979 \u0026 1986 Supp.)\n\nAll rules as to the interpretation of ambiguities must be subordinated to the common intent of the parties which governs. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" If the intent of the parties is unclear from the contract, extrinsic evidence can be brought in to elucidate their intent. 11 Couch § 44:261 at Supp. 19-20 (1982 \u0026 1985 Supp.) This aspect of the Leebov decision and its general acceptance have been discussed above. But plaintiff reminds me that the Court of Appeals for the Third Circuit, in applying Pennsylvania law, disagrees. ACandS, Inc. v. The Aetna Casualty \u0026 Surety Co., 764 F.2d 968 (3d Cir. 1985); Daburlos v. Commercial Ins. Co., 521 F.2d 18, 26 (3d Cir. 1975). See Vale Chemical Co. v. Hartford Acc. \u0026 Indem. Co., 340 Pa. Super. 510, 490 A.2d 896 (1985), appeal granted 508 Pa. 603, 499 A.2d 576 (1985); Hionis v. Northern Mut. Ins. Co., 230 Pa. Super. 511, 327 A.2d 363 (1974). It should be noted, however, that AC \u0026 S was based on Vale, and this aspect of Vale was based on out-of-state precedent, failed to refer to the previous Pennsylvania cases allowing admission of extrinsic evidence (i.e., Leebov and its progeny), and is currently pending appeal. Daburlos is based upon Hionis, a case explicitly disapproved on other grounds as too pro-insured by the Pennsylvania Supreme Court in Standard Venetian Blind v. American Empire Ins. Co., 503 Pa. 300, 469 A.2d 563 (1983). No case subsequent to Daburlos has cited it for the proposition that extrinsic evidence is not to be admitted in insurance cases. See, e.g., St. Paul Fire \u0026 Marine Ins. Co. v. United States Fire Ins. Co., 655 F.2d 521, 524 (3d Cir. 1581); Compagnie de Bauxites de Guinee v. Insurance Co., 551 F. Supp. 1239, 1242 (E.D. Pa. 1982), aff'd 721 F.2d 109 (3d Cir. 1983). Moreover, Hionis was not decided on the basis that extrinsic evidence should not be entertained to explain an ambiguity but, rather, on the basis that the insurer had not bothered to introduce such evidence while the insured had done so. This is made clear by the only Pennsylvania case to cite Daburlos on the question of extrinsic evidence. Klischer v. Nationwide Life Ins., 281 Pa. Super. 292, 422 A.2d 175, 177 \u0026 n.2 (1980) (\"Because the insurer offered no evidence to contradict or detract from the version offered by the insured, we affirmed the order of the lower court directing a verdict for the insured.\").\n\nStating, \"The courts have disregarded the insured's own opinion that he was not covered,\" plaintiff also relies incorrectly upon City of Newark v. Hartford Acc. \u0026 Indem. Co., 134 N.J. Super. 537, 342 A.2d 513 (App. Div. 1975). In City of Newark, the court held that an inter-office memorandum of the insured which indicated that the insured did not carry a specific coverage was not conclusive as to intent. Clearly, the insured's intent was important. In the present case, there is no evidence at all that any employee of plaintiff believed that it was insured for recall and there is a multitude of uncontradicted evidence that plaintiff's employees and officers believed that there was no coverage for recall at the time of the policy was executed or at anytime thereafter until counsel entered the picture following the recall.\n\nIn Mahon v. American Cas. Co., 65 N.J. Super. 148, the Appellate Division remanded a jury decision in favor of an insured on the ground that the court had submitted the case to the jury without guiding the jury in construing an ambiguity in the policy. The parties had not submitted extrinsic evidence as to their interpretations of the ambiguous phrase, and the appellate court expressed dismay that the trial court had allowed the jury to decide the meaning of that phrase with no evidence having been adduced and without any direction by the court as to the possible proper constructions of the phrase. The court made clear that where ambiguous contract language was susceptible of resolution by disputed parole evidence admitted in aid of interpretation, such evidence should be considered by the jury. In stating this proposition, it relied upon Michaels v. Brookchester, Inc., 26 N.J. 379, 140 A. 2d 199 (1958), a common law contract case in which parole evidence was admitted to aid in interpreting an ambiguous provision of a contract.\n\nBased upon the citation in Mahon to general contract construction principles, the strong emphasis in New Jersey insurance cases on ascertaining the intent of the parties, and the emphasis in Weedo on the insured's expectations, it is quite clear that New Jersey courts would admit extrinsic evidence to aid in the interpretation of insurance policies.\n\nCases urged on me by plaintiff for the contrary proposition are miscited, are relied upon for much more than they stand for, or are out-of-state cases that conflict with New Jersey law. Notably, plaintiff's reliance upon AC \u0026 S, Inc. v. Aetna Cas. \u0026 Sur. Co. and Daburlos v. Commercial Ins. Co. is misplaced in light of even Leebov and its progeny. See Bakery \u0026 Confectionary Workers Int'l Union v. Great Atlantic \u0026 Pacific Tea Co., 357 F. Supp. 1322; In re Spectrum Arena, Inc., 340 F. Supp. 786; Celley v. Mutual Ben. Health \u0026 Acc. Assn., 229 Pa. Super. 475, 324 A.2d 430, (Hoffman, J. concurring); GRC Coal Co. v. Commonwealth, 63 Pa. Commw. 10, 437 A.2d 512; Cooke v. Metlab Co., 49 Pa. D. \u0026 C. 2d 704. See also Plowman, supra note 16; Reed, supra note 16. Thus, were this policy ambiguous, I would accept the unequivocal evidence that the parties did not envision recall and recall-related expenses as within its coverage, thereby rejecting plaintiff's characterization of its actual intent as \"irrelevant.\"\n\nIt has been held that in disputes as to policies between a large corporation and a large insurance company, both of which were advised by competent counsel at the time of the agreement, ordinary rules of contract construction apply. Eastern Associated Coal Corp. v. Aetna Cas. \u0026 Sur. Co., 632 F.2d 1068, 1075 (3d Cir. 1980) (construing Pennsylvania law), cert. denied, 451 U.S. 986, 68 L. Ed. 2d 843, 101 S. Ct. 2320 (1981); Nationwide Mut. Ins. Co. v. United States Fid. \u0026 Guar. Co., 529 F. Supp. 194, 197 (E.D. Pa. 1981); Eastcoast Equip. Co. v. Maryland Cas. Co., 207 Pa. Super 383, 218 A.2d 91 (Com. Pl. 1965), aff'd mem. 207 Pa. Super. 383, 218 A.2d 91 (1966); 13 Appleman § 7402 at 301 \u0026 n.32.35 (1976 \u0026 1986 Supp.).\n\nThe Court of Appeals for the Third Circuit has recently held to the contrary in a case decided under Pennsylvania law. ACandS, Inc. v. Aetna Cas. \u0026 Sur. Co., 764 F.2d 968, a holding plaintiff presses on me. This aspect of AC\u0026S, Inc., based upon Standard Venetian Blind v. American Empire Ins. Co., 503 Pa. 300, 469 A.2d 563, states, \"The Supreme Court of Pennsylvania has applied the rule of strict construction in cases in which the insured was a commercial entity.\" However, in Standard Venetian Blind the court decided in favor of the insurer, and stated only in dictum, \"Although on this record we reject Hionis [v. Northern Mut. Ins. Co., 230 Pa. Super. 511, 327 A.2d 363], we note that in light of the manifest inequality of bargaining power between an insurance company and a purchaser of insurance, a court may on occasion be justified in deviating from the plain language of a contract of insurance.\" 469 A.2d at 567. Strict construction, at least in Pennsylvania, would thus be explicitly prefaced on unequal bargaining power. It bears mention that more recently than AC \u0026 S, the Third Circuit made the following observation in another case in which Pennsylvania law was applied: \"While it is true that many of the provisions in the policy before us were from standard INA forms, CBG is a large company with the ability to negotiate with INA. Therefore, the first rationale for the . . . rule, that an insurance policy is often a contract of adhesion, does not necessarily apply . . . .\" Compagnie des Bauxites de Guinea v. Insurance Company of North America, 794 F.2d 871, 875 (3d Cir. 1986).\n\nAlthough there are no New Jersey cases directly on point, it would seem that the New Jersey courts would decide that insurance policies of large, skilled corporations - and here, I venture to suggest, Johnson \u0026 Johnson is larger than its insurers - would be treated as ordinary contracts. See Fenwick Machinery, Inc. v. A. Tomae \u0026 Sons, Inc., 79 N.J. 590, 401 A.2d 1087 (1979) (insurance brokers, charged with superior knowledge, \"cannot take advantage of whatever deficiencies might be uncovered in the policy language when viewed from the perspective of an unschooled and unwary policyholder.\"). Such a position would dovetail with the New Jersey policy that insurance policies are generally strictly construed because they are contracts of adhesion, i.e., they are products of unequal bargaining power. Mazzilli v. Accident \u0026 Cas. Ins. Co., 35 N.J. 1, 170 A.2d 800; Griggs v. Bertram, 163 N.J. Super. 87, 394 A.2d 174 (L. Div. 1978), aff'd 175 N.J. Super. 501, 420 A.2d 364 (App. Div. 1980), aff'd in part, rev'd in part on other grounds 88 N.J. 347, 443 A.2d 163 (1982). \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\"\n\nIn the present case, there is no question but that the parties were of equal bargaining power and that all that preceded and all that followed the execution of the policy at issue here is reminiscent of the entry into and the living under a treaty between two great nations. Plaintiff's protestations about the size and competitiveness of the liability insurance market and the \"adhesion contract\" prepared without its input, in a phrase, fall flat. This latter protest, I note, cannot have been other than tongue in cheek for the evidence belies any suggestion other than that the policy itself was negotiated, as were almost all of the fifteen addenda to the policy, most of which added or subtracted specific form coverages over the years. If the policy reflected few if any changes from the \"London form\", none were requested, not because Johnson \u0026 Johnson lacked the opportunity or the capacity to make such requests, but because the language accomplished what was intended. I also note that while denying negotiation, plaintiff describes Mr. Molineux, Johnson \u0026 Johnson's Director of Corporate Insurance and an attorney, as its \"principal negotiator\".\n\nJohnson \u0026 Johnson, which ranks fifty-ninth in the Fortune 500, generates annual insurance premiums of approximately $20,000,000 and maintains a Corporate Insurance Department consisting of an expert insurance staff with a legal staff at its disposal. Judge Lacey found in the Affiliated FM aspect of this litigation not only that Johnson \u0026 Johnson was a \"favored customer\" (Findings of Fact Nos. 40, 41), but that \"the significance of plaintiff's having its own expert insurance staff to represent it in determining its insurance program, in implementing that program, and thereafter in its negotiations with [Affiliated] cannot be overstressed. This was not the usual insured-insurer relationship.\" Findings of Fact No. 21; see also No. 41.\n\nConcededly a sophisticated insured, Johnson \u0026 Johnson cannot seek refuge in the doctrine of contra proferentem by pretending it is the corporate equivalent of \"Mike\" Leebov. Cessante ratione legis, cessat et ipsa lex -- \"where the reason stops, there stops the rule.\" United States v. Criden, 633 F.2d 346, 357 \u0026 n.6 (3d Cir. 1980); United States v. Schreiber, 599 F.2d 534, 537 \u0026 n.2 (3d Cir. 1979); K. Llewellyn, The Bramble Bush 157-58 (1960).\n\nThus, even if there were some ambiguity in the instant policy, which there is not, I would be compelled to find in favor of defendants.\n\nII. QUASI-CONTRACT AND AGENCY\n\nThere can, therefore, be no basis of recovery in the present case for expenses, however denominated, based on contractual principles, as it is clear that such expenses are outside the provisions of the policy. Certain commentators have suggested, however, that based on a theory akin to unjust enrichment, recovery for such expenses might be had outside the explicit provisions of the policy assuming, of course, that there be coverage for the potential damage averted. See Levmore, supra note 16; Allocation of Costs, supra note 16. For instance, a theory of implied agency suggests itself, the insured acting as agent for the insurer in mitigating damages at the scene of rapidly occurring damage with immediate decisions required and with the insured best able to judge which measures to take, a scenario unlike the scenario here. There is, of course, no express agency by virtue of any provision in the policy which explicitly required the insured to mitigate or which stated that such actions will be considered as taken at the request of the insurer. See Harper v. Pelican Trucking Co., 176 So.2d 767.\n\nA noted commentator on insurance law has observed that the relationship between insurer and insured is analogous to that of debtor and creditor and not to that of a trustee and a cestui que trust, which latter fiduciary relationship would be more similar to one of agency. 2A Couch § 23:11 at 784 (1984 \u0026 1985 Supp.). \"Ordinarily, an insurance company stands in no fiduciary relationship to a legally competent applicant for . . . [an] insurance contract.\" Id. at 787. In fact, an insurance agent is not allowed to issue insurance for himself without his principal's consent for the reason that one simultaneously an agent and an insured would be serving conflicting interests. 4 Couch § 26A:193 at 369-70 (1984 \u0026 1985 Supp.) When, as in this case, \"liability is based upon a theory of unjust enrichment, the case properly falls within the principles of restitution and not agency principles.\" H. Reuschlein \u0026 W. Gregory, The Law of Agency \u0026 Partnership 82 n.46 (1979).\n\nTwo commentators have suggested that recovery on claims for mitigation expenses based on general liability policies might be based upon grounds of quasi-contract. Levmore, supra note 16, at 117-20; Allocation of Costs, supra note 16, at 1316. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\" Levmore would allow recovery for mitigation in Leebov-type situations based on his theories of wealth-dependency and lack of market encouragement problems. However, the wealth-dependency theory applies primarily in a world of unequal bargaining power, a situation which, as discussed above, is not the situation here. As discussed below, Levmore too easily dismisses market encouragement problems, i.e., the distortion of free market bargaining caused when restitution is invariably awarded.\n\nAllocation of Costs, supra note 16, takes a quantum leap in analogizing from the long line of cases allowing mitigation expense coverage in maritime insurance, where there is an explicit sue and labor clause authorizing such expenses, to require such expenses to be paid under a general liability policy with no such explicit provision. Allocation of Costs would allow recovery based upon an unjust enrichment theory grounded on a constructive contract -- a contract the parties would have made had they foreseen the future event when they negotiated the contract. See generally A Theory of Hypothetical Contract, supra note 24. It argues that a reasonable insurer, faced with an accident in which it would have to pay the entire eventual damage costs, would agree to reimburse the insured for mitigation expenses. In essence, Allocation of Costs urges that to conclude otherwise would place the insured in an unfair position in that it would be forced to mitigate based upon external exigencies and would, therefore, be in a poor bargaining position at that time to urge coverage for mitigation expenses.\n\nSuch reasoning is faulty on two grounds. First, it presupposes that the insured has other reasons for mitigating, thus vitiating the force of any public policy argument requiring recovery in such cases in order to encourage mitigation, an argument discussed below. Second, the time frame is ex post in that coverable damage has already occurred and is increasing. The insurer would be in a poor bargaining position to do other than accede to the insured's requests to cover mitigation expenses.\n\nBut the parties should be viewed at the time of the making of the contract. At that time, an insurer and insured who foresaw the possibility of an accident requiring mitigative efforts could well have decided on one of two alternatives -- liability insurance with mitigation expense recovery for a higher premium or liability insurance without such added coverage at a lower premium. Based on the variety of possible ex ante scenarios, it is impossible to predict on a hypothetical contract basis what decision as to coverage the parties in this case would have made although clearly the amount of the premium would have been considered, a consideration of critical importance to plaintiff.\n\nMoreover, it might well be argued that even if recovery on a restitutionary theory were colorable in the present case, several of the traditional defenses to such recovery would apply. For instance, plaintiff does not appear to meet the strict test of exigency required for recovery of expenses undertaken in an emergency situation. See Restatement of Restitution 2d, Tentative Draft No. 1, § 3 Comment b, (April 5, 1983). Moreover, under plaintiff's theory that its recall saved defendants possible future damage obligations, that recall was, as towards defendants, the act of an officious intermeddler or volunteer. \"A person who receives a benefit through conduct officious as to him does not owe restitution to the person so acting. A person acts officiously when he intervenes in the affairs of another without adequate justification, such as to that which may be afforded by a request or a mistake.\" Restatement of Restitution 2d, Tentative Draft No. 1 § 2 (April 5, 1983). See Restatement of Restitution §§ 2, 112 (1937). The rationale underlying this principle is that the common law supports the right to decide on and undertake one's own obligations and prevents one from thrusting an obligation upon another. Restatement of Restitution 2d, Tentative Draft No. 1, § 2 Comments a \u0026 d (April 5, 1983).\n\nIt is, indeed, a narrow line that must be walked in order to recover under a restitutionary theory. The actor must be motivated in part by an interest in reward, or his actions will be altruistic, gratuitous, and uncompensible. Plaintiff's recall was not at all motivated by an interest in a reward from its insurers. On the other hand, in most cases there can be no recovery if the actor's deeds are undertaken in self-interest (as opposed to interest in a reward recovery) for the actor has suffered no loss, i.e., he would have done the same thing even had the beneficiary possessed no interest in the object of the actor's efforts. This self-interest is evident here.\n\nAllocation of Costs argues that an insured cannot be an officious intermeddler in the business of the insurer when he acts to mitigate damages to himself. This contention, too, can be disputed on two grounds. First, according to a noted expert in the field of restitution, courts have consistently denied attempts of all persons but lawyers who, simultaneously serving their own interests, seek to recover on a restitutionary theory from another whose interest was also served by their endeavors. Dawson, The Self-Serving Intermeddler, 87 Har. L. Rev. 1409, 1444-50, 1457-58 (1974). See Restatement of Restitution 2d, Tentative Draft No. 1, § 21 Comment c (April 5, 1983). This conclusion is in line with the civil law precept denying recovery on negotiorum gestio when the benefactor's acts also benefit himself. Second, at least one recent case has held that an insured was an intermeddler vis-a-vis the insurer when he acted to mitigate damages for which the insurer might ultimately have been liable. See J. L. Simmons Co. v. Lumbermens Mut. Ins. Co., 84 Ill. App. 2d 98, 228 N.E.2d 227. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\"\n\nThus, under quasi-contract and agency and the various permutations of those theories, plaintiff cannot prevail.\n\nIII. LEEBOV AND ITS PROGENY - REDUX\n\nAll else having failed, plaintiff turns again to a handful of out-of-state liability insurance cases which allow coverage for mitigation expenses, cases both poorly decided and only indirectly pertinent. Those cases all anticipate that the hypothetical damage ultimately prevented would have been covered. Goodyear Rubber \u0026 Supply, Inc. v. Great American Ins. Co., 545 F.2d 95; Slay Warehousing Co. v. Reliance Ins. Co., 471 F.2d 1364; Bankers Trust Co. v. Hartford Acc. \u0026 Indem. Co., 518 F. Supp. 371 (S.D.N.Y. 1981), vacated 621 F. Supp. 685 (S.D.N.Y. 1981); Leebov v. United States Fidelity \u0026 Guar. Co., 401 Pa. 477, 165 A.2d 82. Various other factors, as well, distinguish those cases from this.\n\nA. COVERAGE FOR HYPOTHETICAL INJURY\n\nThere is some question as to whether defendants will be liable to plaintiff or Johnson \u0026 Johnson if damages are assessed against the latter in the seven Chicago death cases, let alone whether defendants would have been liable had there been further deaths. In the first place, at least one of the defendants, Northbrook Excess \u0026 Surplus Ins. Co., asserts that coverage for the seven deaths is excluded under the completed products exclusion, c(i). \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\" In the second place, Johnson \u0026 Johnson has been and is now vigorously contesting its liability in the pending death cases. It is ludicrous to argue, under the very cases upon which plaintiff relies, that there is coverage for recall and recall-related expenses when plaintiff and its parent deny any responsibility for the deaths. Indeed, they have said from day one and to this day that Tylenol was not tampered with while in their possession and control and utterly nothing has surfaced to suggest that that conclusion was untrue. Leebov, it bears mention, was a case in which liability was absolute.\n\nMoreover, I strongly disagree with plaintiff's assumption that there would have been coverage had additional deaths occurred absent the recall. Plaintiff itself admits, both in its complaint and in its briefs, that it would have been negligent or grossly negligent were any subsequent deaths caused by its retention of Tylenol on the market. It is a well settled proposition of law that an actor who has negligently imperiled the life of another has a duty to aid that person and save him or her if at all possible. See Butler v. Acme Markets, 89 N.J. 270, 445 A.2d 1141 (1982), aff'g 177 N.J. Super. 279, 426 A.2d 521 (App. Div. 1981); Restatement of Torts § 321 (1934); Restatement Second of Torts § 321 (1965 \u0026 1986 Supp.); W. Prosser \u0026 W. Keaton, The Law of Torts 377 \u0026 n.43 (5th Ed. 1984) (\"It also is recognized that if the defendant's own negligence has been responsible for the plaintiff's situation, a relation has arisen which imposes a duty to make a reasonable effort to give assistance, and avoid any further harm.\"). In relation to a contractual obligation in an insurance case, \"A person who becomes aware of a situation potentially capable of producing damages and who is able to prevent them and minimize loss is under a duty to do so.\" 7A Appleman § 4492.02 at 37 (1979 \u0026 1986 Supp.). See Industrial Sugars, Inc. v. Standard Acc. Ins. Co., 338 F.2d 673 (7th Cir. 1964) (\"We think an insured who is able to prevent damages entirely should be under a duty to do so.\").\n\nWith reference to a fire insurance policy, the Supreme Court stated, \"Generally speaking, insurances against fire are made in the confidence that the assured will use all the precautions to avoid the calamity insured against, which would be suggested by his interest. The extent of this interest must always influence the underwriter in taking or rejecting the risk, and in estimating the premium.\" Columbian Ins. Co. v. Lawrence, 27 U.S. (2 Pet.) 25, 49, 7 L. Ed. 335 (1829). Such reasoning is equally convincing with reference to liability policies. See 15A Couch § 56:9 at 15 (1983 \u0026 1985 Supp.) (\"The duty [to mitigate] extends to preventing further bodily injury or property damage and to correct the fault but it does not require that the insured repair damage that has already occurred.\") (emphasis added).\n\nThus, although an insured has a duty to mitigate damage once some damage has occurred of which it has knowledge, the insured has no duty to lessen damage that occurred before it was informed and able to mitigate. Therefore, in cases where an insured takes steps to minimize the harm already incurred, the insured is lessening an already vested damage recovery right and is, therefore, entitled to reimbursement for its reasonable expenses from its insurer. Chemical Applications Co. v. Home Indem. Co., 425 F. Supp. 777 (D. Mass. 1977). In this context, I note that Couch interprets Leebov as a case not of recovery for mitigation expenses, but one in which the harm (i.e., the landslide) had already occurred and the insured's expenses decreased his previously vested damage recovery right. 11 Couch § 44:263 at 410 \u0026 n.1 (1982 \u0026 1985 Supp.). See also Comment Note, \"Duty to Mitigate Damages,\" 81 ALR 282 (1932 \u0026 1985 Supp.).\n\nFailure so to act may entail not only civil, but criminal liability. N.J.S.A. 2C:2-1.b(2) (liability for omissions when duty to perform imposed by law); Model Penal Code § 2.01(3)(b) (similar; note 30 adds, \"The 'duty imposed by law' may be a statutory duty, a contractual duty, or a duty arising from tort law.\"); 4 W. Blackstone, Commentaries on the Laws of England 25-26 (1769); W. LaFave \u0026 A. Scott, Criminal Law 186 (1972) (questioning criminal liability for failure to act after innocent acts, inapplicable here as plaintiff has admitted it would be negligent); R. Perkins \u0026 R. Boyce, Criminal Law 666 (3d Ed. 1982). See State v. Reitze, 86 N.J.L. 407, 92 A. 576 (Sup. Ct. 1914) (\"Where death is the result of an occurrence unanticipated by the defendant, but which arose from his negligence or inattention, his criminal responsibility depends on whether or not the injury which caused the death was the regular, natural and likely consequence of defendant's conduct. If it was, then the defendant is subject to indictment.\" In Reitze, the indictment of an innkeeper, charged with manslaughter when a patron died after becoming intoxicated, was dismissed, as the innkeeper could not have foreseen the possibility of the freakish accident. Here, of course, plaintiff and its parent admit that they foresaw further poisoning incidents if they failed to act.\n\nPublic policy strongly condemns, and thus disallows, any insurance against a criminal act or omission. Ruvolo v. American Cas. Co., 39 N.J. 490, 189 A.2d 204 (1963). Most states also disallow insurance for intentional, reckless, and grossly negligent acts or omissions on similar public policy grounds, regardless of whether there is a specific exclusion or not. See Annot., Liability Insurance as Covering Accident, Damage, or Injury due to Wanton or Wilful Misconduct or Gross Negligence, 20 ALR 3d 320 (1968 \u0026 1985 Supp.); 6B Appleman § 4252 at 4-7, § 4255 at 45-46 \u0026 n.53 (1979 \u0026 1986 Supp.); 11 Couch § 44:275 at 426-29 (1982 \u0026 1985 Supp.). For instance, in Industrial Sugars, Inc. v. Standard Acc. Ins. Co., 338 F.2d 673, the court, on public policy grounds, denied coverage to an insured sugar manufacturer for damages that ensued when it failed to notify or recall from one of its customers sugar contaminated with chlorine after it was notified by other customers of the contamination. The court stated, \"To allow [the insured], with the knowledge that it had of contamination in the batch of sugar from which the [customer's] shipment was taken, to take a chance that the contamination would not be discovered and then impose the loss upon the insurer would be to countenance insurance against one's deliberate misconduct.\" 338 F.2d at 675-76. Had plaintiff failed to recall its possibly damaged Tylenol, it would have stood in a position very similar to that of the plaintiff in Industrial Sugars, Inc. See General Ins. Co. v. Town Pump, Inc., 214 Mont. 27, 692 P.2d 427 (1984), where negligent failure to investigate and therefore to mitigate a gasoline leakage was considered covered. The court there stated, \"There have been no allegations that [the insured] acted wilfully in disregarding the indications of gasoline leakage.\" Had the widely publicized poisoning incidents here been disregarded with no effort made to prevent possible further fatalities, it most certainly would have been wilful conduct. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\"\n\nThe leading recent case on this point in New Jersey, Ambassador Ins. Co. v. Montes, 76 N.J. 477, 388 A.2d 603 (1978), held that construction of a liability insurance policy to allow the insured to obviate, on public policy grounds, its obligation to pay for harm caused because of its intentional act would unduly deny a well merited recovery to the injured party.\n\nWere a person able to insure himself against the economic consequences of his intentional wrongdoing, the deterrence attributable to financial responsibility would be missing. Further, as a matter of moral principle no person should be permitted to allege his own turpitude as a ground for recovery. Accordingly, we have accepted the general principle that an insurer may not contract to indemnify an insured against the civil consequences of his own wilful criminal act.\n\nHowever, this principle is not to be applied under all circumstances. Certainly it should not come into play when the wrongdoer is not benefited and an innocent third party receives the protection afforded by the insurance.\n\n76 N.J. at 483. Importantly, Ambassador Ins. specifically granted to the insurer the right to proceed as a subrogee against the insured to recover the amount paid out to the victim. It is clear, therefore, that even under that case, plaintiff cannot recover against its insurers for recall and recall-related expenses where it would have been itself ultimately liable for the damages for future deaths. Thus, plaintiff's premise that by its recall it saved defendants potential recoveries against them fails, and the cases which support that premise are unavailing for even if defendants would have had to pay damages to hypothetical victims, such sums would have had to have been reimbursed by plaintiff.\n\nB. OTHER DISTINCTIONS\n\nThere are various other factors that distinguish the present case from that of Leebov and its related cases. First, those cases were all based upon liability for a swift, single, and continuing occurrence of property damage, while the present case is bottomed on liability for personal injury in a potential mass disaster. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\" Second, the mitigation efforts that were considered covered in those cases were specifically designed to limit damage to a particular third party who had already been injured and not to more general damage prevention. Thus, the closer parallel in the present case might be whether the insurer was obligated to pay for hospital expenses the insured incurred in treating a victim of a poisoning incident. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\" Third, in each case, there was a genuine emergency requiring instantaneous action, which precluded setting up any significant plan with the insurer. In the present case, also, of course, an emergency situation, plaintiff had sufficient time during the week-long recall period and thereafter to consult with defendants, or at least to notify them, as to what actions it would take, yet failed to do so until the commencement of this lawsuit. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\" This failure, plaintiff explains, occurred because the recall took place prior to anyone thinking about insurance much less discussing the question of coverage, an explanation that is hardly surprising given the fact that no one believed there was coverage. Fourth, in each case, in spite of its emergent nature, there was a representative of the insurer on the scene who, at least implicitly, acceded to the emergency measures of the insured. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\"\n\nAt argument on these motions, Judge Lacey observed: \". . . without Leebov you don't have anything.\" (Tr., Dec. 24, 1985 at 79). Once again, Leebov and cases related to it have not taken plaintiff where it wishes to be.\n\nIV. PUBLIC POLICY\n\nEven if the parallels with Leebov and its related cases were stronger, I would disagree with the policy implications of those decisions, at least as far as plaintiff would have them applied in the present case. What the Leebov court did was to state that, in a liability policy which it found to be ambiguous as to coverage for mitigation expenses, such expenses were covered. The public policy invoked was the encouragement of mitigation. If mitigation expenses are considered covered in such cases, so the argument goes, insureds would be encouraged to mitigate while if the courts disallow such expenses under general liability policies, insureds would be encouraged to permit damages to mount, knowing that direct damages would be covered. This argument, while superficially appealing, must be rejected.\n\nIn the first place, to apply this doctrine properly, coverage for mitigation expenses would have to be mandatory in all liability policies. If mitigation coverage were not mandatory, insurers could develop (as they have) specific mitigation insurance, in addition to liability insurance, for which former coverage they would charge substantial premiums. Ordinary liability policies, available at the lower premium rate paid in the present case, would therefore not encompass any mitigation coverage. Thus, any time an insured under an ordinary liability policy found to be insufficiently clear recovered mitigation expenses, it will have received a windfall in that it attained coverage that was available but that it did not bargain for, while other insureds will have paid substantially higher premiums for the same coverage. Such a windfall would not, and could not, be a form of encouragement to undertake mitigation efforts but, to the contrary, a reward for having made such efforts. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\"\n\nEventually, then, a sharply divided market with two types of liability policies (one including coverage for mitigation expenses and one specifically excluding such coverage) and no potentially ambiguous policies would evolve. An unscrupulous insured would in that circumstance have a greater incentive to purchase the non-mitigation insurance (as it would be lower in price) and quietly let damages mount in order to be reimbursed. With mandatory coverage for mitigation expenses there would then be no element of windfall in a recovery of such expenses, as all policies would have premiums set so high as to cover both ordinary liability and mitigation recoveries, and the unscrupulous insured (concern over whom is the main factor behind allowing mitigation expenses) would not be tempted to buy lower priced insurance in hopes of receiving a higher priced recovery. Making such coverage mandatory would, of course, compromise the important public policies of freedom of contractual choice in the marketplace and the reduction of premium costs to the consumer. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\"\n\nIn the second place, as discussed above, there are important alternative reasons that encourage mitigation in cases such as the present one, if here \"mitigation\" it even be, without strained judicial construction and the necessity of judicial intervention to create additional grounds for mitigation. See, Allocation of Costs, supra note 16, at 1324-26. It is sound judicial practice not to develop, on public policy grounds, additional bases for legal liability when preexisting reasons suffice to encourage the desired activity. Here, plaintiff has made no secret of the fact that the primary reason for the recall was moral and that that reason alone was sufficient for the actions that were taken. Plaintiff, moreover, indicates that it believes that others in similar positions would similarly do what it did out of a moral duty - a feeling that \"mitigation\" was the right thing to do. This proposition vitiates any public policy ground for allowing coverage of expenses, however denominated, as an encouragement to mitigation. \"It is virtually a precept that the merit of emergency salvage efforts is, and should be, its own reward.\" Restatement of Restitution 2d, Tentative Draft No. 1, § 3 Comment a (April 5, 1983), describing the common law's aversion to awarding restitution for benefits altruistically conferred.\n\nMoreover, here, in addition to the strong moral reasons for undertaking the recall, there were strong business reasons as well. Plaintiff stood to lose a large portion of its share of the analgesic market if it did not act promptly to dispel worries about the safety of its product, and did not promptly remarket that product in tamper resistant packaging. Additionally, mitigation of covered damages is an implicit contractual obligation of all insurance contracts, as discussed above, and failure to mitigate after knowledge of ongoing damage will reduce insurance coverage and implicate direct liability for negligence on the part of the insured. See Ambassador Ins. Co. v. Montes, 76 N.J. 477, 388 A.2d 603.\n\nYet another independent ground for mitigation by the insured in the real world, as discussed above, are the policies of underinsurance, caps on liability, and large deductibles. Finally, here, criminal liability might well have attached had further deaths occurred after plaintiff had knowledge of the connection between its product and the poisoning deaths. In light of these manifold additional reasons for an insured to mitigate damages, it would be contrary to the public policy against unnecessarily increasing uncertainty in the marketplace (in this case the likelihood of recovery against insurers for mitigation expenses) and, thereby, increasing the price of liability insurance, in order to give a windfall recovery to plaintiff.\n\nThe so-called discovery problem, an additional reason advanced by some for the recovery of mitigation expenses, must similarly be rejected. The advocates of this concept argue that, even given other reasons for mitigation, an unscrupulous insured would have no reason to mitigate at its own expense if it felt it would not be caught allowing damages to mount and, therefore, the additional encouragement of allowing mitigation expenses on an ordinary liability policy would be necessary. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\"\n\nIn addition to being circular, the discovery argument is weak in that it fails to allow for the ease of discovery of the failure to mitigate in today's complex and interrelated world where, as here, large numbers of people might well be involved in such a decision and failure to mitigate when it was possible would surely become public knowledge. In addition, the fear of the possibility of the disclosure of a failure to mitigate, even if remote, would act as a powerful additional stimulus to mitigation. Moreover, I am not so quick to impugn the character of individual and commercial insureds by imputing to them the qualities the discovery argument would require me to believe they possessed. Aside from the fact that plaintiff admits that even it, a part of a huge corporate enterprise, was motivated by ethical concerns more than greed in its recall of Tylenol, plaintiff urges, and I accept, that such an upright response would typify most American insureds.\n\nFinally, the argument for mitigation expenses is unsound at its very core as, even under plaintiff's construction, the standard liability policy language and the problems with proximate causation discussed above would require some damage before subsequent mitigation expenses could be reimbursable if there were no mandatory mitigation coverage. Therefore, by allowing mitigation expenses at all, unscrupulous insureds are in effect encouraged not to mitigate at the initial signs of trouble, but to await some damage -- which might well run out of control -- before they mitigate. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\"\n\nFar from indicating that coverage for mitigation expenses as a result of the construction of inexplicit liability policies encourages mitigation, the above observations demonstrate that at most such an interpretation rewards mitigators who need no additional encouragement after the fact, and that at worst such a policy discourages mitigation and encourages carelessness.\n\nOn public policy grounds, as well, plaintiff's claim must fail.\n\nCONCLUSION\n\nOn all grounds, therefore, plaintiff's claim fails. Defendants' motions for summary judgment are granted and plaintiff's cross-motion is denied.\n\n\u003cspan class=\"fn\"\u003e1. Johnson \u0026 Johnson has its principal place of business in New Jersey and if joined would destroy diversity jurisdiction, the sole basis of jurisdiction alleged by the parties. None of the parties has moved to determine whether Johnson \u0026 Johnson is an indispensable party within the meaning of Fed.R.Civ.P. 19, although this case has proceeded in this court since 1982 and Johnson \u0026 Johnson has been intimately involved in the proceedings. Thus, following Provident Bank v. Patterson, 390 U.S. 102, 19 L. Ed. 2d 936, 88 S. Ct. 733 (1968), rev'g 365 F.2d 802 (3d Cir. 1966), rev'g 218 F. Supp. 802 (E.D.Pa. 1963), on remand 411 F.2d 88 (3d Cir. 1969), the parties and Johnson \u0026 Johnson are foreclosed from asserting the nonjoinder of Johnson \u0026 Johnson and \"in equity and good conscience the action should proceed among the [present] parties . . . . Fed. R.Civ.P.19(b). See National Wildlife Federation v. Gorsuch, 744 F.2d 963, 969 (3d Cir.1984); Sheldon v. West Bend Equipment Corp., 718 F.2d 603, 606-07 (3d Cir. 1983). In any event, it is quite apparent that the skilled counsel before me concluded that federal court is where they want to be.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. It appears that during the course of the recall, three additional potentially lethal doses of cyanide were found in Extra-Strength Tylenol bottles in the Chicago area although the complaint notes only two such doses.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The second count, which named as a defendant only Affiliated FM Insurance Co., plaintiff's business interruption insurer, sought similar relief and was terminated on September 23, 1985 with a judgment in favor of Affiliated after a \"minitrial\" on the merits pursuant to Fed.R.Civ.P. 42(b) before the Hon. Frederick B. Lacey. That judgment was affirmed by the Court of Appeals for the Third Circuit on June 12, 1986. McNeilab, Inc. v. North River Ins. Co., 800 F.2d 1135 (3d Cir. June 12, 1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Argument on the cross-motions was heard by Judge Lacey on December 24, 1985, decision was reserved, and the case was assigned to me upon his retiring from the bench the following month. I note that early in the history of this case, plaintiff moved for summary judgment on the same grounds as are now raised to me. Judge Lacey denied plaintiff's motion, indicating that further discovery was necessary. Discovery over the ensuing three years has resulted in much that is helpful to defendants on the issue of intent and little or nothing helpful to plaintiff, which continues to rely on the policy construction arguments it advanced in its earlier summary judgment motion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Under the doctrine of Erie Railroad Co. v. Tompkins, 304 U.S. 64, 82 L. Ed. 1188, 58 S. Ct. 817 (1938) as developed in Klaxon Co. v. Stentor Elec. Mfg. Co., 313 U.S. 487, 85 L. Ed. 1477, 61 S. Ct. 1020 (1941), New Jersey rules govern choice of law questions in this court. Piper Aircraft Co. v. Reyno, 454 U.S. 235, 70 L. Ed. 2d 419, 102 S. Ct. 252 (1981); American Contract Bridge League v. Nationwide Mut. Fire Ins. Co., 752 F.2d 71 (3d Cir. 1985). The parties agree that New Jersey law applies to the construction of the North River policy, apparently because North River is a New Jersey corporation as is Johnson \u0026 Johnson. Independently of their agreement, under New Jersey choice of law rules, New Jersey law governs the interpretation of the insurance policy when, as here, the parties have framed their arguments in terms of New Jersey law and the original parties to the policy were New Jersey corporations. See Lac D'Amiante Du Quebec, Ltee. v. American Home Assur. Co., 613 F. Supp. 1549 (D.N.J. 1985). These contacts with New Jersey are sufficient to overcome any initial presumption that the law of the place of contracting, the lex loci contractus, in this case London, applies. Nelson v. Insurance Co. of North America, 264 F. Supp. 501 (D.N.J. 1967); State Farm Mut. Auto. Ins. Co. v. Simmons' Estate, 84 N.J. 28, 417 A.2d 488 (1980); Nationwide Mut. Ins. Co. v. Perlman, 187 N.J. Super. 499, 455 A.2d 527 (App. Div. 1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Plaintiff cites Allstate Ins. Co. v. Campbell, 95 N.J. Super. 142, 230 A.2d 179 (Ch. Div. 1967) for the proposition that insurance policies are to be construed in accordance with the previous legal interpretations of relevant phrases and clauses. See 13 J. Appleman \u0026 J.A. Appleman, Insurance Law and Practice § 7404 at 334-40 (1976 \u0026 1986 Supp.) (hereinafter all volumes in this series will be referred to as \"Appleman\"); 1 G. Couch, Couch on Insurance 2d (Rev. ed.) § 13.2 at 817 (1984 \u0026 1985 Supp.) (hereinafter all volumes in this series will be referred to as \"Couch\"). Allstate, however, cites this proposition broadly and without authority and has, in turn, been cited only once, and that in dissent, for this proposition. Kotzian v. Barr, 81 N.J. 360, 369, 408 A.2d 131, 136 (1979) (Pashman, J., dissenting). Moreover, in Kotzian, Justice Pashman was referring to the effect of a court rule, not a judicial decision, on the meaning of certain language in the construction of an insurance policy. New Jersey cases that have stated a similar position with greater precision stem from Mazzilli v. Acc. \u0026 Cas. Ins. Co., 35 N.J. 1, 7, 170 A.2d 800, 803 (1961), which states, \"In evaluating the insurer's claim as to the meaning of the language under study, courts necessarily consider . . . whether judicial decisions appear in the reports attributing a more comprehensive significance to it than that contended for by the insurer\", relying upon Mahon v. American Cas. Co., 65 N.J. Super. 148, 167 A.2d 191 (App. Div. 1961), cert. denied 34 N.J. 472, 169 A.2d 746 (1961). This proposition has been frequently cited. Fidelity \u0026 Cas. Co. v. Carll \u0026 Ramagosa, Inc., 243 F. Supp. 481, 485 (D.N.J. 1965), appeal dismissed 365 F.2d 303 (3d Cir. 1966); Ohio Cas. Ins. Co. v. Flanagin, 44 N.J. 504, 513-14, 210 A.2d 221, 226 (1965); Bryan Const. Co. v. Employers Surplus Lines Ins. Co., 116 N.J. Super. 88, 98-99, 281 A.2d 97, 102-03 (App. Div. 1971) (Conford, J., concurring in part and dissenting in part), aff'g 110 N.J. Super. 181, 264 A.2d 752 (Ch. Div. 1970), aff'd in part, rev'd in part 60 N.J. 375, 290 A.2d 138 (1972) (agreeing with views expressed in dissent and concurrence of Conford, J. below); Jackson Township v. Hartford Acc. \u0026 Indem. Co., 186 N.J Super. 156, 161, 451 A.2d 990, 992 (L. Div. 1982); Conklin v. Heymann, 124 N.J. Super. 227, 305 A.2d 820, 823 (L. Div. 1973); National Sur. Co. v. Allstate Ins. Co., 115 N.J. Super. 528, 533, 280 A.2d 248, 251 (L. Div. 1971); LeFelt v. Nasarow, 71 N.J. Super. 538, 546, 177 A.2d 315, 320 (L. Div. 1962), aff'd mem. 76 N.J. Super. 576, 185 A.2d 217 (App. Div. 1962), cert. denied 39 N.J. 86, 187 A.2d 600 (1963). Several of these citations merely refer to Mazzilli for its broader holding that insurance policies are generally construed in favor of the insured. Ohio Cas. Ins. Co. v. Flanagin, 44 N.J. at 513-14, Fidelity \u0026 Cas. Co. v. Carll \u0026 Ramagosa, Inc., 243 F. Supp. at 485; Conklin v. Heymann, 124 N.J. Super. at 233. In other cases, the judicial gloss on the policy language was one that was well established: \"The pollution exclusion clause has been the subject of significant judicial holdings and comments in other jurisdictions.\" Jackson Township v. Hartford Acc. \u0026 Indem. Co., 186 N.J. Super. at 162, cites five cases in sister states. \"Although few in number, there are such cases in other jurisdictions and there are additional decisions close to the point, including dicta in New Jersey cases, which make the point clear that, on the facts of this case, the clause will be given its plain meaning and exclude coverage.\" [emphasis in original] National Sur. Co. v. Allstate Ins. Co., 115 N.J. Super. at 537, citing as directly applicable two cases on the term, \"transported\", and three on the phrase, \"in charge of\", and numerous other uses of such language in parallel, although not identical, situations in cases and legal literature. Mazzilli v. Accident \u0026 Cas. Ins. Co., 35 N.J. at 9-10, found no cases directly on point, but cited numerous cases, including five in the insurance area, for a broad interpretation of the term in controversy, \"household\". The court in LeFelt v. Nasarow, 71 N.J. Super. at 551-52, on the other hand, based its interpretation of the policy on a single on-point out-of-state decision, but did so on the grounds of the persuasiveness of its reasoning rather than the establishment of a judicial interpretation of particular wording. While Mahon v. American Cas. Co., 65 N.J. Super. 148, 167 A.2d 191, does not specifically enunciate a rule that previous judicial decisions as to the meaning of policy language are to be incorporated into the policy, the Mazzilli court understood it so to hold, an interpretation supported by the adaptation of the Mazzilli cite to Mahon in Judge Conford's concurrence and dissent in Bryan Const. Co. v. Employers Surplus Lines Ins. Co., 116 N.J. Super. at 98-99, significant in that Judge Conford authored the opinion in Mahon. In Mahon, supra 65 N.J. Super. at 157-59, the court cited numerous precedents going back seventy years in the interpretation of a particular limitation of coverage clause. Thus, it would appear that, under New Jersey law, in order for a judicial gloss on a particular word or phrase in an insurance policy to be considered a part of the policy, it must be widely accepted. It would seem that several cases directly on point or numerous cases in parallel instances, or some combination of both, with especial emphasis on decisions within the jurisdiction, would have had to have held similarly for the doctrine to apply. See 1-L Logging Co. v. Manufacturers \u0026 Wholesalers Ind. Exch., 202 Ore. 277, 275 P.2d 226 (1954); 13 Appleman § 7404 at 336-38.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The wording of the Desrochers policy is echoed in Johnson \u0026 Johnson's underlying products liability policy with its subsidiary captive insurance company, Middlesex Assurance Co., Ltd., which reads, \"The Company will pay on behalf of the insured all sums which the insured shall become legally obligated to pay as damages because of A. personal injury or B. property damage arising out of a Products Hazard to which this insurance applies, caused by an occurrence . . . .\" The standard form Insurance Services Office (ISO) language is similar, \"We will pay those sums that the insured becomes legally obligated to pay as damages because of 'personal injury' or 'advertising injury' to which this insurance applies.\" [emphasis added]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In other words, this is \"a difference that makes no difference.\" Attributed to William James, Oswalt v. Scripto, Inc., 616 F.2d 191, 200 n.12 (5th Cir. 1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Under the doctrine of Erie v. Tompkins, 304 U.S. 64, 82 L. Ed. 1188, 58 S. Ct. 817, as developed in Commissioner v. Estate of Bosch, 387 U.S. 456, 18 L. Ed. 2d 886, 87 S. Ct. 1776 (1967), this court must therefore decide this and other questions of novel impression in this state by predicting how the highest court of New Jersey would rule if confronted with this issue. In its determination, this court must be guided by relevant state precedent, analogous decisions, considered dicta, scholarly works, and other reliable data. Herber v. Johns-Manville Corp., 785 F.2d 79, 81 (3d Cir. 1986); Mazzanti v. Merck \u0026 Co., 770 F.2d 34, 36 (3d Cir. 1985); McGowan v. University of Scranton, 759 F.2d 287, 291 (3d Cir. 1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See Bakery \u0026 Confectionary Workers Int'l Union v. Great Atlantic \u0026 Pacific Tea Co., 357 F. Supp. 1322, 1326 (W.D. Pa. 1973), aff'd mem., 491 F.2d 748 (3d Cir. 1974); In re Spectrum Arena, Inc., 340 F. Supp. 786, 792 (E.D.Pa. 1971); Celley v. Mutual Benefit Health \u0026 Acc. Assn, 229 Pa Super. 475, 486, 324 A.2d 430, 436 (1974) (Hoffman, J., concurring); GRC Coal Co. v. Commonwealth, 63 Pa. Commw. 10, 15, 437 A.2d 512, 515 (1981); Cooke v. Metlab Co., 49 Pa. D. \u0026 C. 2d 704, 710 (Com. Pl. 1968).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Economy-Wallace Joint Venture v. Commercial Union Ins. Co., No. 83 C 6172 slip opinion (N.D.Ill. March 6, 1984); Lehigh Electric \u0026 Engineering Co. v. Selected Risks Ins. Co., 30 Pa.D.\u0026C.3d 120 (Com. Pl. 1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Southern California Edison Co. v. Harbor Ins. Co., 83 Cal.App.3d 747, 757, 148 Cal.Rptr. 106, 112 (1978) (when a primary benefit is conferred to the insurer mitigation expenses may be assessed against the insurer); J.L. Simmons Co. v. Lumbermens Mut. Ins. Co., 84 Ill.App.2d 98, 228 N.E.2d 227, 232 (1967)(a judgment must be had against the insured before mitigation expenses can be owed by the insurer).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Riehl v. Travelers Ins. Co., 772 F.2d 19, 24 n. 8 (3d Cir. 1985)(unnecessary to reach the question of whether under Pennsylvania law a general liability insurer must pay the insured's mitigation expenses); Bowman Steel Corp. v. Lumbermens Mut. Cas. Co., 364 F.2d 246, 251 (3d Cir. 1966)(relying on Leebov, apparently in error as in Leebov the insurer was consulted and present at the mitigating events, to state that an insured can take steps to mitigate damages without consulting the insurer; policy language in question had, in fact, used \"as damages\" terminology); Moffat v. Metropolitan Cas. Ins. Co., 238 F. Supp. 165, 171 (M.D. Pa. 1964)(definition of \"accident\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. Verlo v. Equitable Life Assur. Soc., 562 F.2d 1034, 1036 (8th Cir. 1977)(the meaning of a word is to be determined by its context); Myre v. Connecticut Gen. Life Ins. Co., 501 F.2d 609, 612 n. 7 (8th Cir. 1974)(Webster, J., dissenting) (as in Verlo); Slay Warehousing Co. v. Reliance Ins. Co., 489 F.2d 214 (8th Cir. 1974)(further proceedings on the issue of interest computation in the same case); Winkler v. Great American Ins. Co., 447 F. Supp. 135, 142 (E.D.N.Y. 1978)(discussing generally and denying reimbursement for mitigation expenses); General Ins. Co. v. Town Pump, Inc., 214 Mont. 27, 692 P.2d 427, 431 (Mont. 1984)(interpreting Slay Warehousing as resting on the cooperation clause); Annot., Recoverability, under Property Insurance or Insurance against Liability for Property Damage, of Insured's Expenses to Prevent or Mitigate Damages, 33 A.L.R.3d 1262, 1985 Supp. at 154 (1970 \u0026 1985 Supp.) (hereinafter referred to as \" Recoverability under Property Insurance \") (citing Slay Warehousing generally for its allowance of reimbursement for mitigation expenses).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. I note, however, that under Pennsylvania law a per curiam memorandum affirmance of a trial court opinion is of no precedential value. Reed v. Pennsylvania Nat. Mut. Cas. Ins. Co., 342 Pa.Super. 517, 521-22 \u0026 n. 2, 493 A.2d 710, 712 \u0026 n.2 (1985).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. The relatively few citations to Leebov in scholarly works reflect and reinforce the discussion in the cases as to the lack of distinction between coverage phrases. Again, Leebov is cited for the proposition that extrinsic evidence is admissible to show the intent of the parties. Plowman, Evidence, 23 U.Pitt.L.Rev. 539, 544 \u0026 n.24 (1961) (hereinafter referred to as \"Plowman\"); Reed, The Pushy Ox: Character Evidence in Pennsylvania Civil Actions, 58 Temp.L.Q. 623, 633 \u0026 n.72 (1985) (hereinafter referred to as \"Reed\"). Several articles discuss Leebov in reference to the general concept of the reimbursement of mitigation expenses, without explicitly discussing the distinction between \"as damages\" and \"by reason of liability\". Recoverability Under Property Insurance, supra at 1266 \u0026 nn. 16 \u0026 19, 1273 \u0026 n.2, 1274-75; Levmore, Explaining Restitution, 71 Va.L.Rev. 65, 118-20 (1985) (hereinafter referred to as \"Levmore\"); Note, Allocation of the Costs of Preventing an Insured Loss, 71 Colum.L.Rev. 1309, 1309-10, 1316, 1321, 1323 (1971) (hereinafter referred to as \" Allocation of Costs \"); Young, Equivocation in the Making of Agreements, 64 Colum.L.Rev. 619, 631 n.53 (1964). There are, as well, a few miscellaneous citations. Holahan, Commercial Transactions, 25 U.Pitt.L.Rev. 211, 214 \u0026 n.12 (1963)(discussing what constitutes an \"accident\"); Thornburgh \u0026 Craig, Remedies, 23 U.Pitt.L.Rev. 547, 62 \u0026 n.50 (1961)(referring to the measure of damages). Only one of the citations to Leebov discusses the distinction in coverage provision terminology. Holahan, Contracts, Sales, and Insurance, 23 U.Pitt.L.Rev. 363, 372-73 (1961). That contemporary account observed, in reference to the Leebov court's distinguishing of Desrochers ' denial of reimbursement for mitigation expenses where the policy used the \"as damages\" language: \"The distinction does not seem persuasive.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See, e.g., Entron, Inc. v. Affiliated FM Ins. Co., 749 F.2d 127, 129-30 (2d Cir. 1984) (interpreting New Jersey law); Fidelity \u0026 Cas. Co. v. Carll \u0026 Ramagosa, Inc., 243 F. Supp. 481; Linden Motor Freight Co. v. Travelers Ins. Co., 40 N.J. 511, 525, 193 A.2d 217, 224 (1963); Kampf v. Franklin Life Ins. Co., 33 N.J. 36, 43-44, 161 A.2d 717, 721 (1960); Kopp v. Newark Ins. Co., 204 N.J. Super. 415, 420, 499 A.2d 235, 237 (App. Div. 1985) (\"Our function in construing a contract of insurance, as with any other contract, is . . . to find a reasonable meaning in keeping with the express general purposes thereof.\"); Middle Dep't Inspection Agency v. Home Ins. Co., 154 N.J. Super. 49, 54, 380 A.2d 1165, 1167 (App. Div. 1977), cert. denied 76 N.J. 234, 386 A.2d 858 (1978); Boonton Handbag Co. v. Home Ins. Co., 125 N.J. Super. 287, 290, 310 A.2d 510 (App. Div. 1973); Tomaiuoli v. United States Fid. \u0026 Guar. Co., 75 N.J. Super. 192, 201-02, 207, 182 A.2d 582, 587-88, 591 (App. Div. 1962) (\"Liberality in the construction of an agreement against the drafter when ambiguity appears, or when strict construction would contravene public policy, is a salutary principle. But it should not be used as excuse to read into a private agreement that which is not there, and that which people dealing fairly with one another could not have intended. So employed, it debases the law.\"); American Mercury Ins. Co. v. Bifulco, 74 N.J. Super. 191, 181 A.2d 20 (App. Div. 1962), aff'd mem., 38 N.J. 530, 186 A.2d 112 (1962); Bryan Construction Co. v. Employers Surplus Lines Ins. Co., 110 N.J. Super. 181, 264 A.2d 752; 6B Appleman § 4255 at 42 \u0026 n.44.10 (1979 \u0026 1986 Supp.); 7A Appleman § 4508 at 335 \u0026 n.6 (1979 and 1986 Supp.) (\"It is scarcely just to extend one type of coverage to fit a completely different situation from that contemplated.\")\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See Donnelly v. Transportation Ins. Co., 589 F.2d 761 (4th Cir. 1978) (liability insurance as generally involving two obligations, neither of which is implicated in the present case: duty to defend insured and duty to pay a judgment against insured); Board of Education v. Lumbermens Mut. Cas. Co., 293 F. Supp. 541 (D.N.J. 1968) (The purpose of liability ins5urance is to protect the insured from liability within the limits of the policy coverage.), aff'd 419 F.2d 837 (3d Cir. 1969); 1 Couch § 1:72 at 215 n.20 (1984 \u0026 1985 Supp.). For a brief history of liability insurance policies, see 7A Appleman § 4491 at 3-4 (1979 \u0026 1986 Supp.). For a description of the effect of products liability on liability insurance, see 7A Appleman § 4508 at 334- 44 (1979 \u0026 1986 Supp.) Corpus Juris Secundum defines liability insurance as follows: \"Liability insurance is that form of insurance by which insured is indemnified against loss or liability on account of bodily injuries sustained by others or, in a broader sense, against loss or liability on account of injuries to property.\" 44 C.J.S., Insurance § 21 at 481 (1945 \u0026 1985 Supp.). It is clear that this language, while perhaps awkward, implicitly restricts coverage to liability for property damage on third party claims. The phrase \"in a broader sense, against loss or liability on account of injuries to property,\" does not imply that the broader form of liability insurance covers all injuries to property but, to the contrary, that the broader form of liability insurance covers only third-party claims for property damage and bodily injury, while the narrower form allows coverage only for third-party claims for bodily injury. See, e.g., Alcorn Bank \u0026 Trust Co. v. United States Fid. \u0026 Guar. Co., 705 F.2d 128 (5th Cir. 1983); Twin City Fire Ins. Co. v. Wilkerson, 247 F. Supp. 766, 767 (E.D. Tenn. 1965); Mercantile Life Ins. Co. v. Johnson, 41 Ala. App. 307, 132 So.2d 248 (1961), cert. denied, 272 Ala. 707, 132 So.2d 251 (1961); Lou-Con, Inc. v. Gulf Building Services, Inc., 287 So.2d 192 (La. App. 1973), cert. denied 290 So.2d 899 (La. 1974) and 290 So. 2d 901 (La. 1974). Additionally, this construction is borne out by C.J.S.'s discussion of accident insurance. \"In a sense liability insurance is a variety of accident insurance, but it is distinguishable from accident insurance in that accident policies, strictly speaking, cover accidents happening to the person of insured, while liability policies cover accidents to others than insured, provided insured stands in such relation to the person accidentally injured or killed as to be legally liable for the result of the accident.\" (footnotes omitted, emphasis added) 44 C.J.S., Insurance § 3 at 474-75 (1945 \u0026 1985 Supp.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. While, to a certain extent, some of the numerous progeny of Twin City Fire Ins. Co. v. Wilkerson, 247 F. Supp. 766, expand on the Twin City definition of \"liability insurance,\" all have retained the third party claim aspect of the definition in their interpretation of 28 U.S.C. § 1332(c). See, e.g., Ford Motor Co. v. Insurance Co. of North America, 669 F.2d 421 (6th Cir. 1982); Aetna Cas. \u0026 Sur. Ins. Co. v. Greene, 606 F.2d 123 (6th Cir. 1979); Bodine's Inc. v. Federal Ins. Co., 601 F. Supp. 47 (N.D. Ill, 1984); Spooner v. Paul Revere Life Ins., 578 F. Supp. 369 (E.D. Mich. 1984); Kosmyna v. Bankers Life \u0026 Cas. Co., 550 F. Supp. 142 (E.D. Mich. 1982); Tyson v. Connecticut Gen. Life Ins. Co., 495 F. Supp. 240 (E.D. Mich. 1980); Vines v. United States Fid. \u0026 Guar. Co., 267 F. Supp. 436 (E.D. Tenn. 1967).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. LaMarche v. Shelby Mut. Ins. Co., 390 So.2d 325 (Fla. 1980); Centex Homes Corp. v. Prestressed Systems, Inc., 444 So.2d 66 (Fla. App. 1984); Qualls v. Country Mut. Ins. Co., 123 Ill. App. 3d 831, 462 N.E.2d 1288, 78 Ill. Dec. 934 (1984), cert. denied, 77 Shep. N.E. Ann. Supp. 945 (Ill.).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Recoverability under Property Insurance, supra note 14, states at 1272, \"As to recoverability, under a policy of liability insurance, of expenses incurred by the insured to mitigate damages for property loss for which the insured (and his insurer) would be liable, the cases are sharply divided, both in their results and rationales. Most of the cases dealing with this issue have turned on a construction of policy language which establishes as a condition precedent to recovery against the insurer that the insured be 'legally obligated' to pay damages [a condition equivalent to \"liability imposed by law\" in the present case] to an injured third party.\" (emphasis added). The cases discussed in the Annotation in fact fall within a narrow and highly specialized subset of liability policies. Two important distinctions between the cases cited in the Annotation and the present case are that the former restricts itself (1) to property losses and (2) to cases in which the insurer would be liable. The importance of these distinctions is discussed below. The Annotation and its supplement cite four cases in favor of allowing recovery of mitigation expenses. Three, however, rest on reasoning entirely inapplicable to the present case. The insurance in Teeples v. Tolson, 207 F. Supp. 212 (D. Or. 1962) was an \"all risks\" policy, not a liability policy, and thus covered both first- and third-party claims. It should be noted that among the reasons given in Leebov v. United States Fidelity \u0026 Guar. Co., 401 Pa. 477, 165 A.2d at 86, for allowing recovery for mitigation expenses is the reason that the insured was led by the insurer's agent to believe, and in fact did believe, that his insurance policy was a policy for \"complete coverage,\" in other words, an \"all risks\" policy. Harper v. Pelican Trucking Co., 176 So.2d 767 (La. App. 1965), an inland marine policy case, and Slay Warehousing v. Reliance Ins. Co., 471 F.2d 1364, an automobile insurance policy and a cargo insurance policy case, rest primarily upon similar \"cooperation\" clauses not present in the policy in question here (provisions explicitly requiring the insured to mitigate, which the courts read as inferring that the insurer undertook to reimburse such expenses) and are not general liability policies at all, but are, in fact, highly specialized forms of property liability insurance. Leebov, the remaining case, is discussed thoroughly elsewhere in this opinion. On the other hand, the cases cited in 33 A.L.R.3d 1262 as against coverage for mitigation expenses concern general liability policies and express opinions that might well be applicable in the present case. See Prime Drilling Co. v. Standard Acc. Ins. Co., 304 F.2d 221 (10th Cir. 1962) (denying mitigation expenses where insured had independent legal duty to mitigate and where insured acted without relying on policy coverage); Farr v. Traders \u0026 Gen. Ins. Co., 235 Ark. 185, 357 S.W.2d 544 (1962) (denying mitigation expenses as potential liability of insurer was too speculative); J.L. Simmons Co. v. Lumbermens Mut. Ins. Co., 84 Ill. App. 2d 98, 228 N.E.2d 227 (1967) (denying mitigation expenses, inter alia, because of the speculative nature of the hypothetical third-party recovery and because the insured failed to secure the consent of the insurer when it could have done so). Thus, it is clear that the division of opinion referred to in 33 A.L.R.3d 1262, as it is narrow in scope, does not detract from the principle referred to above that general liability insurance insures only against third-party claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See, e.g., Kopp v. Newark Ins. Co., 204 N.J. Super. 415, 499 A.2d 235 (\"Our function in construing a policy of insurance, as with any other contract, is to search broadly for the probable common intent of the parties . . . .\"); American Home Assoc. Co. v. Hartford Ins. Co., 190 N.J. Super. 477, 464 A.2d 1128 (App. Div. 1983); Flynn v. Hartford Fire Ins. Co., 146 N.J. Super. 484, 370 A.2d 61 (App. Div. 1977); Tooker v. Hartford Acc. \u0026 Indem. Co., 128 N.J. Super. 217, 319 A.2d 743 (App. Div. 1974); Travelers Ins. Co. v. Tymkow, 87 N.J. Super 107, 208 A.2d 176 (Ch. Div. 1965), modified on other grounds 91 N.J. Super. 184, 219 A.2d 625 (App. Div. 1966); Insurance Co. v. Palmieri, 81 N.J. Super. 170, 195 A.2d 205 (App. Div. 1963), cert. denied 41 N.J. 389, 197 A.2d 15 (1964); American Mercury Ins. Co. v. Bifulco, 74 N.J. Super. 191, 181 A.2d 20; Saliba v. American Policyholders Ins. Co., 158 N.J. Super. 48, 385 A.2d 328 (L. Div. 1976), aff'd 157 N.J. Super. 476, 385 A.2d 239 (App. Div. 1978); Deodato v. Hartford Ins. Co., 143 N.J. Super. 396, 363 A.2d 361; 6B Appleman § 4254 at 30 \u0026 n.35.10 (1979 \u0026 1986 Supp.); 13 Appleman § 7385 at 110-38 (1976 \u0026 1986 Supp.); 2 Couch § 15:9 at 136-46 (1984 \u0026 1985 Supp.). See generally C. Fried, Contract as Promise (1981) (contract as based upon promises of parties). For a progressive and a radical view of the importance of intent in the history of contract, see respectively G. Gilmore, The Death of Contract (1974); Gabel \u0026 Feinman, Contract Law as Ideology, in The Politics of Law 172 (D. Kairys, ed. 1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Plaintiff misreads my opinion in Lac D'Amiante du Quebec, Ltee. v. American Home Assur. Co., 613 F. Supp. 1549, to argue that that case supports its position that contra proferentem is to be strictly applied. In Lac D'Amiante, I stated the general principle that ambiguities are to be construed in favor of the insured, citing Bryan Construction Co. v. Employers' Surplus Lines Ins. Co., 60 N.J. 375, 290 A.2d 138. The admissibility of extrinsic evidence was not, however, an issue in Lac D'Amiante as the parties stipulated that at the time the policies at issue were executed, there had been no negotiations or discussions regarding the trigger of coverage. Moreover, I specifically noted, \"The relative size and bargaining power of the parties is not an issue in this case.\" 613 F. Supp. at 1559 n.18. Thus, contrary to plaintiff's assertion, Lac D'Amiante in no manner aids plaintiff in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. For a history of quasi-contract at common law and the rationale for granting recovery on that basis, see J. Baker, An Introduction to English Legal History 300-14 (1970). See also Restatement of Restitution, Pt. 1 Introductory Note at 4-10 (1937). (The term \"restitution\" is somewhat more comprehensive than \"quasi-contract\".) I note that even when there is a breached contract, a recovery in restitution is unwarranted when the recovery would be for a sum of liquidated damages, as here. Restatement of Restitution 2d, Tentative Draft No. 1 § 17 at 153-54 (April 5, 1983); Restatement of Contracts 2d § 373 (1979); Restatement of Contracts § 350 (1932). Any such recovery must be on the contract, and this contract provides for none. A recent study of restitutional recoveries observes, \"A court should not impose a hypothetical contract if the parties could have negotiated an express agreement.\" Note, A Theory of Hypothetical Contract, 94 Yale L.J. 415, 420 (1984) (hereinafter referred to as \" A Theory of Hypothetical Contract \"). See Restatement of Restitution 2d, Tentative Draft No. 1, § 1 Comments h. \u0026 k., § 21 comment a. (April 5, 1983). It is quite clear that Johnson \u0026 Johnson was aware of and could well have negotiated for and purchased coverage for recall had it so desired.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Common law restitutionary theories, with their qualifications and pro-individualistic failure to reward altruism, are insufficient for recovery here. Moreover, civil law quasi-contract theories, which tend more in the direction of reward for unselfish acts, are similarly unavailing. The civil law, although on different theoretical grounds, has hedged its quasi-contractual remedies with exceptions and narrow definitions in order to avoid an overexpansion of this theory of recovery beyond its basic rationale in unjust enrichment. See B. Nicholas, An Introduction to Roman Law 229-31 (1962) (hereinafter referred to as \"Nicholas\"). The quasi-contract theory of the Roman law most relevant here is negotiorum gestio (\"management of the affairs [of another]\") -- a theory of legally implied agency whereby a negotiorum gestor (\"manager\") who undertakes to perform a service on behalf of a dominus rei gestae (\"principal\") without a specific mandatum (\"agency\") or similar obligation is entitled to reimbursement for his actions. The policy behind allowing such recovery was to encourage the protection of an absentee's interests by public spirited neighbors. See W. Buckland, A Text-Book of Roman Law 536-44 (3d ed. 1963); W. Buckland \u0026 A. McNair, Roman Law \u0026 Common Law 329-37 (2d ed. 1952); R. Lee, The Elements of Roman Law 371-77 (1956); Nicholas, supra this note, at 227-33 (1962); F. Schulz, Classical Roman Law 610-25 (1951). For an excellent study of the survival of this principle in present day civil law, see Dawson, Negotiorum Gestio: The Altruistic Intermeddler, 74 Harv. L. Rev. 817-65, 1073-1129 (1961). A primary restriction upon recovery under this theory was that the affair managed needed to be that of another, and not one's own as well. Another prerequisite for recovery was that the principal be absent (i.e., unreachable) or be present and consent. Finally, as at common law, the manager must have acted with the expectation of being rewarded for his services. While all of these requirements, which would preclude recovery in the present case, have been to a certain extent modified and reshaped by modern developments, they continue to be major elements within the theory of recovery under negotiorum gestio. Moreover, \" Negotiorum gestio. . . constitutes one of the most marked divergences . . . between the Civil law and the Common law. The latter insists on the individualistic principle that a man should not be required to pay for a service for which he has not asked, and holds that to encourage rendering of such services would be to encourage the 'officious intermeddler.'\" Nicholas, supra this note, at 229. For a thorough discussion of how the primarily modern doctrine of unjust enrichment as a theory of recovery in its own right in the civil law developed, see generally J. Dawson, Unjust Enrichment (1951). For a brief summary of the reasoning behind this principle and how its use is circumscribed, see Nicholas, supra this note, at 231-33.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Cf. Weedo, 81 N.J. at 240, which cites with approval the following quotation from Henderson, \"Insurance Protection for Products Liability and Completed Operations -- What Every Lawyer Should Know,\" 50 Neb. L. Rev. 415, 441 (1971); \"The insured, as a source of goods or services, may be liable as a matter of contract law to make good on products or work which is defective or otherwise unsuitable because it is lacking in some capacity. This may even extend to an obligation to completely replace or rebuild the deficient product or work. This liability, however, is not what the coverages in question [including general liability coverage] are designed to protect against. The coverage is for tort liability for physical damages to others and not for contractual liability of the insured for economic loss because the product or completed work is not that for which the damaged person bargained for.\" (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. The question of coverage for a criminal act, of course, is relevant only to the question of whether hypothetical future deaths would have been covered by the policy (the underlying theory for recovery on the present liability policy), and not to the issue of coverage for the recall itself, which, of course, is a business expense which certainly could have been insured against separately as an independent act.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Recoverability under Property Insurance, supra note 14, clearly contemplates only claims based on property damage and not those arising out of personal injury. See 15 Couch § 54:174 at 559-62 (1983 \u0026 1985 Supp.), which relates coverage for such expenses to necessity for care for damaged property. Moreover, the policy implications that must be taken into account when discussing harm to persons are different from and more stringent than those relating to property damage. Compare N.J.S.A. 2C:3-5 (\"Use of force for the protection of other persons\") with N.J.S.A. 2C:3-6 (\"Use of force in defense of premises or personal property\"). Such distinctions stem from ancient precedent. See State v. Zellers, 7 N.J.L. 220 (Sup. Ct. 1824). While one could argue that greater solicitude towards human life should serve as greater justification for the coverability of mitigation expenses where personal injury rather than property damage is at stake, it is significant that plaintiff can cite no case of liability insurance in which mitigation expenses were allowed where they were based upon personal injury. The relative ineffectiveness of rewarding mitigation expenses in order to encourage mitigation, discussed below, is emphasized where personal injury is involved and, inter alia, the insured's already strong moral and legal duties to mitigate are much enhanced. To the contrary, as also discussed below, the compelling public interest in preservation of life and limb militate against allowing mitigation expenses, as the insured must take personal responsibility for those he puts in peril.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. This line of argument is related to the question of the proximity of relationship between the accident and the mitigation. It makes no sense to allow mitigation expenses, for instance, for the repair of a car's brake system only after one of the brakes has malfunctioned and caused someone injury, and yet to deny recovery before such an injury takes place. But see Levmore, supra note 16, at 118-19. Yet, plaintiff admits that the only way that the recall-related damages it seeks could be recovered were if some damage first took place. On public policy grounds, this proposition is unsound and is discussed below. Continuing the brake analogy, it would be equally absurd to allow coverage under an automobile liability or collision policy for brake repairs before an accident. There must be some relationship of proximate causation between an accident and acts in mitigation thereof and some line drawing. If not, the notion of prevention of a specific accident becomes overly remote and unrelated to coverage for a specific accident, and related only to general safety measures which entail an entirely different kind of premium structure. For a discussion as to various theories of proximate causation and foreseeability, see W. Prosser \u0026 W. Keeton, Law of Torts, §§ 42-43 at 272-300 (5th ed. 1984). For a discussion of how tenuous and remote recovery on a liability policy under mitigation theory might become without delineation of its limits, see Allocation of Costs, supra note 16, at 1323-24. It is clear from the great majority of the cases discussed above that the courts have chosen to avoid the slippery slope and have drawn the line between acceptable recovery and overly remote preventative claims very close to the division between third-party and first-party claims. For instance, in Farr v. Traders \u0026 General Ins. Co., 235 Ark. 185, 357 S.W.2d 544, the court denied a claim for mitigation expenses under a liability policy where the damage prevented was insufficiently related to the harm that had already occurred, as was evidenced, in part, by the fact that ultimate damages were so difficult to approximate. To this extent it might well be argued that the reasonableness of plaintiff's mitigation efforts goes not only to damages, but also to liability. See Restatement of Restitution 2d, Tentative Draft No. 2, Ch. 9, § A (April 6, 1984), \"No award of restitution in money for a benefit or gain will be made unless . . . the value of the benefit, or the amount of the gain, has been established to a reasonable certainty . . . .\" But see Allocation of Costs, at 1327, which argues that the court should inquire into and verify the extent of the insured's claimed mitigation expenses as a means of assuring that the insured does not undertake and charge the insurer for unnecessary extra precautions, an argument that relies heavily on the unscrupulous insured and his interest in allowing damages to mount secretly -- the discovery problem discussed below. Allocation of Costs, at 1323, also raises the problem that in any quasi-contractual recovery against the insurer for mitigation expenses, numerous other parties, including potential victims to the extent insurance would not cover their injuries and the insured to the extent of his underinsurance, are benefited by the insured's mitigation efforts and, therefore, recovery of mitigation expenses solely against the insurer would not spread the burden of the benefit fairly. Allocation of Costs, indicates, as well, that it would be fairly easy to ascertain the relatively small number of parties legally benefited by mitigation and to divide the respective proportions of liability among them, and states that the doctrines of de minimis and gratuitousness could narrow the scope of beneficiaries. I have some difficulty with the Note's reference to \"legally\" benefited, a term \"Allocation of Costs\" does not adequately define, as this relates to the much more difficult question of who is proximately benefited by the mitigation and of who is and is not gratuitously benefited as discussed in reference to who is a volunteer in such circumstances. In this context, see Winkler v. Great American Ins. Co., 447 F. Supp. 135, where one of the court's arguments against awarding the insured recovery on a flood insurance policy for allegedly mitigative expenses made in shoring up a beach house's support (thereby making it less prone towards future flood damage) was that any such recovery against the insurer would have to be diminished to the extent of the insured's personal benefit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. See Farr v. Traders \u0026 Gen. Ins. Co., 235 Ark. 185, 357 S.W.2d 544, in which the court considered the immediate necessity of the action taken and still denied coverage, based in part on the fact that ultimate damage was too speculative. See also Winkler v. Great American Ins. Co., 447 F. Supp. 135, where recovery on a mitigation theory was denied in part because of the lack of urgency in the allegedly mitigating action; J. L. Simmons Co. v. Lumbermens Mut. Ins. Co., 84 Ill. App. 2d 98, 228 N.E.2d 227, in which no coverage for mitigation expenses was found in part because the insured could have taken steps to notify the insurer and effect its consent but failed to do so. Levmore, supra n.15, at 118-19, states, \"When more time is available there is no need to grant restitution -- that is, to create a missing bargain in order to regulate social obligations -- because the parties will arrange on their own to prevent large losses.\" Levmore would also deny restitution in non-immediate cases because the insured would have time to shop for the cheapest means of mitigating possible damages. In the instant case, plaintiff had time to consider several possible options for reducing damages for possible future deaths, and apparently undertook the most expensive means available. See Restatement of Restitution 2d, Tentative Draft No. 1, § 3 Comment b (April 5, 1983); Restatement of Restitution § 116(d) (1937).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. In this regard, Bowman Steel Corp. v. Lumbermens Mut. Cas. Co., 364 F.2d 246, appears to be mistaken in relying on Leebov -- in which an agent of the insured was present -- for the Proposition that an insured can take mitigation efforts without informing the insurer. (In Bowman, coverage for a settlement, not mitigation expenses, was at issue.) See Allocation of Costs, supra note 16, at 1327-28, which states, \"As a general rule the insured should seek consent.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Allocation of Costs, supra note 16, at 1326, briefly discusses and dismisses this problem of potentially large premiums entailed in including mitigation expense recovery in standard liability policies. It states that recovery on such clauses would be insufficiently frequent to raise premiums substantially throughout the industry and that uncertainty as to coverage by inclusion of a mitigation reimbursement clause could be accurately assessed by closely drawn definitions and appropriate actuarial calculations. The facts before me lead me to believe otherwise. Recall coverage is in fact available to insureds, but at a substantial premium. Surely any liability insurance policy that included recall coverage in addition to the basic policy would cost substantially more than the basic policy alone. The note's point as to uncertainty of premiums is well taken, but beside the point. Such calculations already take place in the free market which currently offers both pure third- party insurance in the form of general liability insurance and liability insurance with clauses such as cooperation clauses similar to maritime sue and labor clauses. Moreover, with the uncertainties involved in any such ex post facto reward system, mitigation might be actually discouraged in a worst case scenario. Ceteris paribus if mitigation expenses were recoverable on a liability policy unclear as to such coverage, the insured would be equally likely to mitigate (which effort would be compensated) or to allow damages to mount (assuming all damages to be covered). Thus, allowing recovery of mitigation expenses under ordinary liability policies where the policy was not explicit as to nonrecovery of such expenses (e.g., by analogy to the present case), would be somewhat of a lottery. An unscrupulous insured, instead of risking the potentiality of nonrecovery of mitigation expenses through the long and complex litigation process, might well chance the possibility of a surer recovery for damages and, thus, permit them to mount.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. This discussion clearly raises the market encouragement problems envisioned by Levmore, supra note 16, at 79-81. Levmore at 118, states that there would be no market encouragement problem in allowing restitution for mitigation expenses as the insurer would prefer to have the insured, who is immediately available, mitigate rather than bring in its own agents to mitigate damages. However, this is a superficial analysis which only looks at the situation ex post, i.e., after damage has commenced. If looked at ex ante in a real world perspective, awarding restitution with regularity in insurance mitigation cases would eventually require all liability policies to include mitigation expenses, a situation that would considerably restrict market choice in the liability insurance market between policies that do and do not include coverage for mitigation expenses and would thus take away a certain force for choice and competition in the insurance market. The economic concept of \"moral hazard\" as it relates to insurance is relevant to this discussion. See Stiglitz, \"Risk, Incentives and Insurance: The Pure Theory of Moral Hazard,\" Princeton University Department of Economics Financial Research Center Memorandum # 42 (1982) (hereinafter referred to as \"Stiglitz\"). Economists have developed the doctrine that an insured will always desire full coverage at \"actuarial fair rate,\" but that the system cannot allow full coverage because to do so would unduly encourage careless actions by the insured -- i.e., an insured knowing he was fully insured may well, both consciously and unconsciously, fail to take all the precautions an ordinary uninsured actor would normally take in his day to day life. Because of this reticence on the part of insurers fully to insure, a stance that is backed by the public policy encouraging care, there would be no true equilibrium (where supply equals demand) in insurance markets. Some insurance, on the other hand, is useful to economic growth and development, in that it encourages creative and productive risk taking. Finding the optimum point is the function of the insurance market. To increase coverage above this optimum point, the insurer must require a large additional premium, both as a sort of bond against careless action by the insured and to cover the additional \"moral hazard\" of encouragement towards the carelessness that additional coverage might occasion. See generally Stiglitz. See also Centex Homes Corp. v. Prestressed Systems, Inc., 444 So.2d 66, where the court rested on public policy in denying recovery for' repair under liability insurance for if the court allowed recovery, insured contractors could receive an initial payment from their customer for certain future work with the knowledge that they would be paid again by their insurance company to repair any mistakes, which eventually the court felt would encourage shoddy initial work. See also Ambassador Ins. Co. v. Montes, 76 N.J. 477, 388 A.2d 603, which, although it decided that an insurer would be required to reimburse an injured person to the extent of coverage in order to satisfy the public interest in compensating victims, specifically allowed a subrogation recovery against the insured by the insurer for intentional acts in order to vindicate the public policy that people should bear the consequences of their own acts in order to discourage wanton acts by an insured who knew he would not have to pay for any damage caused by him. It is because of this concept of \"moral hazard\" that insurers have developed policies of underinsurance, caps on liability, and large deductibles, in order to make the insured more responsible for his own actions and, therefore, more careful in the initial instance. Underinsurance, caps, and large deductibles, as discussed below, also act as additional factors encouraging mitigation, as the insured who allows actual damages to mount increases his personal loss, whereas if he mitigates he decreases his personal loss, irrespective of coverage. In a system in which mitigation expenses might sometimes be allowed under ordinary liability policies, in addition to the problem of uncertainty of the insurer's liability, there is also the potential for the \"moral hazard\" of recovery for mitigation expenses to be seen as additional coverage tending towards uncompensated full coverage, which potential, absent the discouraging element of an additional premium would encourage carelessness, and thus increase the number of occasions in Which actual mitigation is necessary. See Stiglitz.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Levmore, supra note 16, and Allocation of Costs, supra note 16, suggest that this discovery problem is a primary reason behind the uniform provision for coverage of mitigation expenses under sue and labor clauses of marine insurance policies. I would suggest, however, that the inclusion of such clauses in marine insurance is due primarily to the emergency nature of most maritime accidents and the difficulty in communication with the insurer as to how best to mitigate. Allocation of Costs, at 1323-24, suggests in addition that in maritime insurance there is generally less concern with the scope of the beneficiaries in reference to the problems or proximate cause (as the interests at stake are made rather finite by the surrounding seas) than there is with terrestrial policies and there is greater doubt with maritime insurance as to the insured's personal interest in mitigating damages (as the insured property is generally at the high seas and not under direct control of the insured, but of an agent) than is present in most land-based insurance. In spite of these many differences between marine and non-marine insurance, Levmore and Allocation of Costs imply that marine insurers are wiser than non-marine insurers in invariably utilizing sue and labor clauses in their policies, while non-marine insurers fail to use similar clauses on a regular basis, and they urge the courts to correct this \"oversight\" by interpolating such a term into all insurance policies. It may well be, however, that non- marine insurers are properly responding to market pressures in their particular fields, which pressures, as the authors admit, are different in several ways from those in the maritime area.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. In J. L. Simmons Co. v. Lumbermens Mut. Ins. Co., 84 Ill. App. 2d 98, 228 N.E.2d 227, the court distinguished Leebov v. United States Fidelity \u0026 Guar. Co., 401 Pa. 477, 165 A.2d 82, because, unlike the case before it, some initial damage resulting in a satisfied legal claim against the insured had occurred. However, Recoverability Under Property Insurance, supra note 14, at 1273 n.2 found that the distinction made in J. L. Simmons Co. between allowing mitigation expenses in cases where initial damage had occurred and disallowing such costs in those where there was no initial damage was faulty for if the primary purpose for such recovery were to encourage mitigation such a distinction failed to make sense.\u003c/span\u003e\n\n",
    "body_length": 143798,
    "citedas": [
      "645 F. Supp. 525"
    ],
    "attorneys": "Smith, Stratton, Wise, Heher \u0026 Brennan, P.C. By: Wendy L. Mager, Esq. , Patterson, Belknap, Webb \u0026 Tyler, P.C., By: Gregory L. Diskant, Esq., Linda Novak, Esq., Frederick B. Campbell, Esq., Attorneys for Plaintiff. , Tompkins, McGuire \u0026 Wachenfeld, P.C. By: William B. McGuire, Esq., William J. Prout, Jr., Esq. , Mendes \u0026 Mount P.C., By: Richard M. Seybold, Esq., James A. McGuire, Esq., Attorney for Defendants North River Insurance Co., Transit Casualty Co., Employers Insurance of Nausau, and First State Insurance Co. , Feinberg, Feinberg \u0026 Tritsch P.C., By: Bruce A. Tritsch, Esq., Attorneys for Defendant Northbrook Excess \u0026 Surplus Insurance Co. , Philips, for Defendant American Centennial Insurance Co. , Hoagland, Longo, Oropollo \u0026 Moran, Esqs., By: Michael B. Oropollo, Esq., Attorneys for Defendant Aetna Casualty \u0026 Surety Co. , De Gonge, Garrity \u0026 Fitzpatrick P.C., By: Francis X. Garrity, Esq., Attorneys for Defendant Granite State Insurance Co. Barry, District Judge.",
    "category": [
      "252",
      "184"
    ],
    "judges": "BARRY, District Judge",
    "citation_count": 0
  }
}
