{
  "id": "qLTqTGYBTlTomsSBfTpL",
  "document": {
    "title": "07/18/89 ALLSTATE INSURANCE COMPANY v. MARSHALL",
    "full_title": "ALLSTATE INSURANCE COMPANY v. MARSHALL FREEMAN, ALONDA FREEMAN, AND MARY HELEN KELLY . METROPOLITAN PROPERTY \u0026 LIABILITY INSURANCE COMPANY V. DAVID DICICCO AND JAMES GRAVENMIER",
    "jurisdiction": "Michigan Supreme Court",
    "date": "1989-07-18T00:00:00.000Z",
    "docket": "Docket Nos. 81239, 81433",
    "body": "In these cases, consolidated for purposes of appeal, we are asked to decide the meaning of a coverage provision and two exclusionary clauses within a homeowner's liability insurance policy.\n\nIn Allstate Ins Co v Freeman, we hold that the exclusionary clause requires application of a two-part objective test. An insurer may relieve itself of its duty to defend and indemnify if (1) the insured acted either intentionally or criminally, and (2) the resulting injuries occurred as the natural, foreseeable, expected, and anticipated result of an insured's intentional or criminal acts. In the instant case, we agree with the Court of Appeals that the exclusion precludes coverage for Alonda Freeman. We find that Alonda Freeman acted either intentionally or criminally and Mary Kelly's injuries were the \"expected\" result of Alonda Freeman's acts. We also hold that \"an insured\" unambiguously refers to \"all\" or \"any\" insureds under the homeowner's policy. Therefore, the exclusion also excluded coverage for Marshall Freeman. Accordingly, we affirm the decision of the Court of Appeals in Freeman. 160 Mich App 349; 408 NW2d 153 (1987).\n\nIn Metropolitan Property \u0026 Liability Ins Co v DiCicco, we hold that a proper analysis of whether an insurer has a duty to defend and indemnify an insured under a homeowner's policy requires a determination of whether coverage exists under the policy, and if coverage exists, then there must follow a determination of whether the exclusionary clause applies. In the present case, we find that the claimed incident constituted an \"occurrence\" under the coverage provision of the insured's policy. However, unlike a majority of this Court, we would hold that, in order to avoid its duty to defend and indemnify under the exclusion, the insurer must show that an objective insured \"intended or expected\" injury to result from those intentional acts. In this case, we find that an objective insured would expect injury to result from the stabbing incident. Even assuming we agreed with the majority and applied a subjective standard of review to the \"intended or expected\" exclusion, we would conclude that a subjective insured would \"expect\" injury to result in the instant case. Therefore, we would reverse the decision of the Court of Appeals in DiCicco and reinstate the decision of the trial court. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nI. INTRODUCTION\n\nIn reviewing a grant or denial of summary Disposition under MCR 2.116(C)(10), we consider the pleadings, affidavits, depositions, admissions, and any other documentary evidence in favor of the party opposing the motion. A motion for summary Disposition tests the factual basis for plaintiff's allegations and may be granted only if \"there is no genuine issue as to any material fact, and the moving party is entitled to judgment as a matter of law.\" MCR 2.116(C)(10); Velmer v Baraga Area Schools, 430 Mich 385, 390; 424 NW2d 370 (1988). An insurer may utilize this procedure in a declaratory action to determine whether it must indemnify and provide a defense for an insured in an underlying tort action. See, e.g., Wright v White Birch Park, 118 Mich App 639; 325 NW2d 524 (1982).\n\nThe duty of an insurance company to provide a defense in an underlying tort action depends upon the allegations in the complaint and extends to allegations which \"even arguably come within the policy coverage.\" Detroit Edison Co v Michigan Mutual Ins Co, 102 Mich App 136, 142; 301 NW2d 832 (1980). The duty to defend is broader than, and not necessarily conclusive of, an insurer's duty to indemnify. The court must resolve any doubt pertaining to the duty to defend in favor of the insured. Guerdon Industries, Inc v Fidelity \u0026 Casualty Co of New York, 371 Mich 12, 18-19; 123 NW2d 143 (1963); Illinois Employers Ins of Wausau v Dragovich, 139 Mich App 502; 362 NW2d 767 (1984). However, it is equally clear that an insurer's duty to defend and indemnify does not depend solely upon the terminology used in a plaintiff's pleadings. Rather, \"it is necessary to focus on the basis for the injury and not the nomenclature of the underlying claim in order to determine whether coverage exists. . . . must the allegations be examined to determine the substance, as opposed to the mere form, of the complaint.\" Illinois Employers Ins, supra at 507; Shepard Marine Construction Co v Maryland Casualty Co, 73 Mich App 62; 250 NW2d 541 (1976). It is against this backdrop that we must decide the cases before us today.\n\nII. METROPOLITAN INS v DiCICCO\n\nA. FACTS AND PROCEEDINGS\n\nThe parties stipulated that the trial Judge would decide the case upon the basis of the briefs and deposition transcripts. We adopt the facts as set forth by the trial court:\n\nThere is little dispute as to what occurred on February 25, 1984. DiCicco and Gravenmier were residents of the same college residence hall. Gravenmier was in a hallway with his girlfriend and a Graham Williamson. They had discovered glue in Gravenmier's door lock and suspected DiCicco had committed the prank. They knocked and kicked at DiCicco's door, and when DiCicco came out there was a scuffle in the hall with first Williamson and then with Gravenmier. Both DiCicco and Gravenmier landed blows, the glass of a fire extinguisher cabinet was broken. Gravenmier and DiCicco separated and the fight came to an abrupt end. DiCicco returned to his room and Gravenmier started down the hall with his girlfriend and Williamson. Within a short time DiCicco came from his room again holding a folding hunting knife with the three-inch blade exposed. DiCicco called Gravenmier and his girlfriend offensive names and Gravenmier returned to respond. Gravenmier observed the knife, put his hands up and told DiCicco in effect that if he were dumb enough or brave enough to use it on Gravenmier's stomach. DiCicco commenced poking at Gravenmier's chest with his left hand repeating the admonition, \"don't mess with me.\" He backed Gravenmier against the wall. Gravenmier reacted by grabbing DiCicco by the throat, turning, and pushing DiCicco against the wall. Gravenmier then felt the knife being withdrawn from his stomach.\n\nDiCicco denies any intent to use the knife, claiming that he went to get the knife merely to scare away the other persons he considered to be a threat. No one observed him make a gesture of moving the knife as though to stab Gravenmier. The knife was held in his right hand and the poking was done with his left. DiCicco denies knowledge of in fact stabbing. Immediately following the stabbing, DiCicco looked shocked. Gravenmier obviously did not expect DiCicco would use the knife or he would not have engaged in his act of bravado.\n\nSubsequently Gravenmier commenced a tort action. Grand Traverse File 84-2119-NO. In that action Gravenmier makes allegations against DiCicco in Count I of negligence in the course of the dispute in that DiCicco inadvertently stabbed him. In Count II he alleges DiCicco intentionally inflicted the stab wound.\n\nThere is no dispute that as of the date of the incident David DiCicco was an insured under a homeowner's insurance policy issued by Plaintiff, Metropolitan Property \u0026 Liability Insurance Company, to David DiCicco's parents.\n\nThe prosecutor filed criminal assault charges against DiCicco, but eventually dismissed the charges. The plaintiff argues that the prosecutor dismissed the charges because Gravenmier withheld his cooperation, fearful that a criminal conviction would eliminate any possibility that DiCicco's insurer would pay damages awarded in a civil suit. Although plausible, there is no record support for this theory.\n\nDefendant Gravenmier filed a civil suit against DiCicco, and plaintiff Metropolitan has provided a defense for DiCicco in the civil suit under a homeowner's insurance policy issued to DiCicco's father. That case remains pending in Grand Traverse Circuit Court.\n\nPlaintiff filed the instant suit, seeking a declaration that the policy does not cover the stabbing incident between DiCicco and Gravenmier and, therefore, it does not have a duty to defend or indemnify DiCicco in the underlying tort action. The trial court granted summary Disposition in favor of plaintiff.\n\nDefendant appealed, and the Court of Appeals reversed, remanding the case to the trial court to determine whether DiCicco intended to stab Gravenmier. This Court granted leave to appeal in consolidation with Allstate Ins Co v Freeman. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nB. ANALYSIS\n\nInitially, in determining whether a policy applies, we first must determine whether the policy is clear and unambiguous on its face. We look to the language of the policy and we construe any ambiguity in favor of the insured. Powers v DAIIE, 427 Mich 602, 624; 398 NW2d 411 (1986). \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e In the instant case, the policy sets forth the essential terms and phrases in bold-faced type under conspicuously marked sections entitled \"Coverages II,\" \"Definitions,\" and \"Exclusions applicable to section II\" (section headings are also in bold-faced type). \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Raska v Farm Bureau Mutual Ins Co, 412 Mich 355, 363; 314 NW2d 440 (1982). The terms used are either clearly defined within the policy itself or given a meaning in accordance with their common usage. Fireman's Fund Ins Co v Ex-Cell-O Corp, 702 F Supp 1317, 1323, n 7 (ED Mich, 1988) (the omission of a definition of a term with a common meaning does not necessarily render an insurance policy ambiguous). Therefore, we conclude that the provisions in the Metropolitan policy are clear and unambiguous. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e Jones v Farm Bureau Mutual Ins Co, 172 Mich App 24; 431 NW2d 242 (1988); American States Ins Co v Maryland Casualty Co, 587 F Supp 1549 (ED Mich, 1984). We cannot create an ambiguity where none exists. Edgar's Warehouse, Inc v United States Fidelity \u0026 Guaranty Co, 375 Mich 598; 134 NW2d 746 (1965); Patek v Aetna Life Ins Co, 362 Mich 292; 106 NW2d 828 (1961); Dimambro-Northend Associates v United Construction, Inc, 154 Mich App 306, 313; 397 NW2d 547 (1986); Farm Bureau Mutual Ins Co v Hoag, 136 Mich App 326, 332; 356 NW2d 630 (1984). Similarly, we reject the temptation to rewrite the plain and unambiguous meaning of the policy under the guise of interpretation. Rather, we enforce the terms of the contract as written. Eghotz v Creech, 365 Mich 527, 530; 113 NW2d 815 (1962); Stine v Continental Casualty Co, 419 Mich 89, 114; 349 NW2d 127 (1984); Dimambro-Northend Associates, supra at 312-313; Murphy v Seed-Roberts Agency, Inc, 79 Mich App 1, 7-9; 261 NW2d 198 (1977).\n\nPlaintiff argues that the Court of Appeals should have affirmed the trial court's summary Disposition in its favor because the coverage section of DiCicco's homeowner's policy does not apply to the fighting incident between DiCicco and Gravenmier. This provision requires an \"occurrence.\" \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e However, neither the trial court nor the Court of Appeals appears to have determined whether the fighting incident constituted an \"occurrence\" within the meaning of the coverage provision of the policy.\n\nPlaintiff contends that the language of the insurance contract requires the determination of whether the fighting incident constituted an \"occurrence\" under the policy before addressing any applicable exclusionary provisions. See Frankenmuth Mutual Ins Co v Kompus, 135 Mich App 667; 354 NW2d 303 (1984); Western Casualty \u0026 Surety Group v Coloma Twp, 140 Mich App 516, 521; 364 NW2d 367 (1985); Allstate Ins Co v Cannon, 644 F Supp 31, 32-33 (ED Mich, 1986); Unigard Mutual Ins Co v Spokane School Dist, 20 Wash App 261; 579 P2d 1015 (1978); Grange Ins Ass'n Authier, 45 Wash App 383; 725 P2d 642 (1986); Hins v Heer, 259 NW2d 38 (ND, 1977); American Home Assurance Co v Osbourn, 47 Md App 73; 422 A2d 8 (1980). Although some courts have addressed the exclusionary clause before determining whether coverage exists under a policy, \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e we agree with plaintiff that the proper construction of a contract requires that we first determine whether coverage exists, and then whether an exclusion precludes coverage. As the Maryland Court of Appeals observed in a case implicating the identical provisions involved in this case:\n\nOsbourn here contends that \"it was for the jury to determine whether the facts of this case as revealed by the evidence, fit within the exclusions of the policy. The jury declared that they did not.\" We disagree. It is plain that the court submitted to the jury an irrelevant issue. The exclusion was inapplicable for the reason that there was no language in Section II, Part I, the liability provision, which afforded coverage to the appellee in the first place under the facts alleged. [ American Home Assurance Co, 47 Md App 82.]\n\nAccordingly, we must determine first whether the fighting incident constituted an \"occurrence.\" Plaintiff places great reliance on Frankenmuth v Kompus, supra, for its position that the fighting incident did not constitute an \"occurrence.\" In Kompus, several insurance companies and individuals appealed orders declaring their respective duties to defend Dr. Kompus, the insured, in his underlying tort actions, alleging assault, malpractice, and other claims. These claims arose from Dr. Kompus' alleged homosexual activity with several patients. Dr. Kompus was convicted of third-degree criminal sexual assault. The Kompus Court found that Dr. Kompus' actions were not accidental and, thus, did not satisfy the policy's definition of \"occurrence.\" In Kompus, the policy defined an \"occurrence\" as an \"accident,\" and the Court of Appeals interpreted \"accident\" with reference to an insurance policy involving a general liability section identical to that in the present case:\n\n\"An 'accident,' within the meaning of policies of accident insurance, may be anything that begins to be, that happens, or that is a result which is not anticipated and is unforeseen and unexpected by the person injured or affected thereby -- that is, takes place without the insured's foresight or expectation and without design or intentional causation on his part. In other words, an accident is an undesigned contingency, a casualty, a happening by chance, something out of the usual course of things, unusual, fortuitous, not anticipated, and not naturally to be expected.\" [ Kompus, supra at 678, quoting Guerdon Industries, Inc, supra at 18-19; Allstate Ins Co v Cannon, supra at 32.]\n\nThe Kompus Court found this definition to be in harmony with the word's common usage. See also American States Ins v Maryland Casualty Co, supra. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nHowever, the Court of Appeals in the present case distinguished Kompus on the ground that \" Kompus merely held that a psychiatrist's homosexual acts on his patients were intentional as a matter of law.\" Consequently, the Court reasoned, it was unnecessary to reach the exclusion provision of the insured's policy since the psychiatrist's acts were not \"occurrences\" as that term was defined in the policy. According to the Court of Appeals, \" same Conclusion cannot be reached in the present case . . . a homosexual act can never be unintentional; a stabbing can be.\" We disagree. If we adopted the Court of Appeals interpretation of Kompus, then we would effectively restrict the definition of \"accident\" to \"unintentional.\" \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e This we decline to do. Rather, we find that the last sentence of the Kompus definition accurately summarizes those events which constitute an \"accident\": \"an accident is an undesigned contingency, a casualty, a happening by chance, something out of the usual course of things, unusual, fortuitous, not anticipated, and not naturally to be expected.\" Accordingly, we find that ascertaining the insured's \"intent\" may determine whether the insured's actions constituted an \"accident,\" but it does not necessarily follow that an insured must act unintentionally for an act to be an \"occurrence.\" \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nWe also find Allstate Ins Co v Cannon, supra, particularly instructive when characterizing an event as an \"occurrence\" under the present policy language. In Cannon, Allstate brought an action for declaratory judgment that it did not have a duty to defend or indemnify its insured under a homeowner's policy with the same language involved in this case. Plaintiffs in the underlying action, Louise L. Jackson and Ernestine Dennis, sued Kenneth Cannon (the insured) for the shooting death of Larry James and the wounding of David Dennis by defendant Lance Rutland with a rifle which he obtained from defendant Eddie Gaines. Gaines gave the rifle to Cannon because Rutland wanted the gun for protection. A verbal street fight ensued between Rutland and James. After Cannon broke up the fight, he and Rutland went to Cannon's home. Cannon handed the loaded rifle to Rutland knowing Rutland was angry. Rutland returned to the scene of the fight and fired two warning shots and a third in self-defense. Although Rutland said he never aimed the rifle at anyone, he killed James and wounded Dennis, a bystander. Rutland pleaded guilty to second-degree murder. United States District Court Judge Avern Cohn held:\n\njudgment in favor of Allstate is appropriate in this case. The operative act is Cannon's handing a loaded rifle to Rutland. Indeed, Cannon had custody of the rifle on behalf of Rutland. Cannon also purchased ammunition for the rifle. . . . Rutland had been in a fight and was angry. He left the scene of the fight to get the rifle. Cannon knew that. Cannon also knew Rutland was returning to the scene of the fight with the rifle. It is fatuous to argue that the injuries from the shootings were \"accidents\" as defined by the Michigan Supreme Court. While D. Dennis's wounding may have been accidental, certainly the discharge of the rifle was not an accident. [ Allstate Ins Co v Cannon, supra at 33.]\n\nAlthough we find Cannon and Kompus analogous to the case at bar, and we agree that they represent examples of situations in which there was no \"occurrence\" under the present policy language, the claimed incident in the instant case is not clear cut enough to allow us to make a similar determination. Under the analyses we advance today, we conclude that the present coverage provision \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e must be broadly construed. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Therefore, we hold that the claimed incident constituted an \"occurrence\" under the policy.\n\nThus, we turn next to the exclusionary clause in the plaintiff's policy. That provision reads: \"[The policy does not cover] bodily injury or property damage which is either expected or intended from the standpoint of the insured.\" There is precedential authority in this jurisdiction which holds that under an exclusion excepting coverage for \"injury . . . caused intentionally by or at the direction of the insured,\" an insured must subjectively intend both his act and the resulting injury in order to avoid its duty to defend and indemnify. Morrill v Gallagher, 370 Mich 578, 583; 122 NW2d 687 (1963). Putman v Zeluff, 372 Mich 553; 127 NW2d 374 (1964). See also Transamerica Ins Co v Anderson, 159 Mich App 441; 407 NW2d 27 (1987); Turner v Burch, 156 Mich App 303; 401 NW2d 355 (1986); Linebaugh v Berdish, 144 Mich App 750; 376 NW2d 400 (1985); Farm Bureau Mutual Ins Co v Rademacher, 135 Mich App 200; 351 NW2d 914 (1984); Kermans v Pendleton, 62 Mich App 576, 580; 233 NW2d 658 (1975); Vermont Mutual Ins Co v Dalzell, 52 Mich App 686; 218 NW2d 52 (1974); Connecticut Indemnity Co v Nestor, 4 Mich App 578; 145 NW2d 399 (1966). Drawing on this authority, defendants argue that the Court of Appeals erred and that we should construe the current exclusionary clause as narrowly as the \"caused intentionally\" exclusion. Thus, DiCicco would have us interpret the addition of the word \"expected\" to the exclusion as superfluous, thereby requiring plaintiff to prove DiCicco acted intentionally and intended to injure Gravenmier. Whereas, plaintiff urges that we construe the addition of \"expected\" according to its plain and unambiguous meaning and find, therefore, that the exclusion applies to \"expected,\" as well as \"intended,\" injuries.\n\nWe are convinced that the exclusion in the present case differs from the \"caused intentionally\" exclusion and, as the plaintiff persuasively argues, that the exclusion does not require a determination of whether DiCicco intended to stab Gravenmier. Rather, as plaintiff contends, the express language of the exclusion only requires a determination of whether \"bodily injury . . . is . . . either expected or intended.\" We agree and we so hold.\n\nAlthough other jurisdictions have not reached a uniform Conclusion on this issue, \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e we agree with plaintiff that the addition of the word \"expected\" expands the meaning of the \"caused intentionally\" language. We are persuaded that the present policy exclusion represents an attempt by insurers to avoid the harsh results of Morrill and similar cases nationwide. Aetna Casualty \u0026 Surety Co v Freyer, 89 Ill App 3d 617; 44 Ill Dec 791; 411 NE2d 1157 (1980). Accordingly, \"' word in a contract should be rejected as surplusage if it serves some reasonable purpose.'\" Ex-Cell-O Corp, supra, pp 1325-1326; Geerdes v St Paul Fire \u0026 Marine Ins Co, 128 Mich App 730, 734; 341 NW2d 195 (1983); Draper v Nelson, 254 Mich 380, 383; 236 NW 808 (1931). See also Associated Truck Lines v Baer, 346 Mich 106, 110; 77 NW2d 384 (1956). In our opinion, under a literal reading of the exclusion, the addition of \"expected\" serves the purpose of excluding coverage for \"expected,\" in addition to \"intentional,\" injuries. In fact, the Court of Appeals has distinguished between \"intended\" and \"expected\" injuries in cases involving the \"caused intentionally\" and the \"expected or intended\" exclusions. State Farm Fire \u0026 Casualty Co v Jenkins, 147 Mich App 462; 382 NW2d 796 (1985); Linebaugh \u0026 Berdish, supra; State Farm Fire \u0026 Casualty Co v Groshek, 161 Mich App 703; 411 NW2d 480 (1987); Allstate v Freeman, supra; Aetna Casualty \u0026 Surety Co v Sprague, 163 Mich App 650, 654; 415 NW2d 230 (1987). As the Jenkins Court stated in the context of the identical exclusion:\n\nWe believe, where a policy excludes coverage for intended or expected injuries, a distinction should be drawn between the terms \"intentional\" and \"expected.\" In order to avoid liability for an expected injury, it must be shown that the injury was the natural, foreseeable, expected, and anticipated result of an intentional act. [ Jenkins, supra at 467-468. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Emphasis added.]\n\nIn this respect, we agree with those courts which have held that \" the purposes of an exclusionary clause in an insurance policy the word 'expected' denotes that the actor knew or should have known that there was a substantial probability that certain consequences will result from his actions.\" City of Carter Lake v Aetna Casualty \u0026 Surety Co, 604 F2d 1052, 1058-1059 (CA 8, 1979). \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e We also reject defendant's contention that the standard we adopt today will preclude coverage for negligent acts by the insured. As the City of Carter Lake court stated, (supra) at 1059, n 4:\n\nThe difference between \"reasonably foreseeable\" and \"substantial probability\" is the degree of expectability. A result is reasonably foreseeable if there are indications which would lead a reasonably prudent man to know that the particular results could follow from his acts. Substantial probability is more than this. The indications must be strong enough to alert a reasonably prudent man not only to the possibility of the results occurring but the indications also must be sufficient to forewarn him that the results are highly likely to occur.\n\nMoreover, we note that our decision today is in accord with those Court of Appeals decisions which have held that plaintiff must show: (1) the insured acted intentionally, and (2) the insured \"intended or expected\" injury to result from those acts. State Farm v Jenkins, supra; Yother v McCrimmon, 147 Mich App 130; 383 NW2d 126 (1985); Wright, supra; Group Ins Co of Michigan v Morelli, 111 Mich App 510; 314 NW2d 672 (1981). \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e We find that the above-cited cases support the proposition that if the court determines that the insured acted intentionally, then the \"expected or intended\" language is satisfied by a finding that injury resulted as the \"natural, foreseeable, expected, and anticipated\" consequence of those intentional acts. However, we disagree with defendants that these cases or the policy language requires a determination of the insured's intent to act. Accordingly, we agree with the trial court that the insurer need not prove that the insured acted intentionally under the exclusion. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nFinally, defendants also contend that we must determine the insured's expectations or intentions from his subjective viewpoint because the exclusion states expectation \"from the standpoint of the insured.\" Basically, they would have us construe the exclusionary language so as to require an insurer to prove that the insured said, \"yes I expected or intended injury to result from my intentional act.\" Unfortunately, a majority of this Court agrees with defendants on this issue. However, in our opinion, plaintiff persuasively argues that we should adopt an objective standard. As one court recognized:\n\nProbing one's state of mind is an elusive task at best. Supplanting an objective standard with a subjective standard for determining whether the act or conduct of an insured is \"intentional\" or \"expected or intended\" for purposes of assessing coverage would emasculate apposite policy provisions by making it impossible to preclude coverage for intentional acts or conduct absent admissions by insureds of a specific intent to harm or injure. Human nature augers against any viable expectation of such admissions. [ Truck Ins Exchange v Pickering, 642 SW2d 113, 116 (Mo App, 1982).]\n\nIn deciding this issue, we take into account that under the \"caused intentionally\" exclusion, numerous Court of Appeals panels have avoided potentially absurd results by not requiring a literal finding of an insured's \"subjective intentions.\" For example, some Court of Appeals panels have held that, under the \"intent to injure\" requirement of the \"caused intentionally\" exclusion, \"intended tortious acts and unintended tortious results [is a distinction] without a difference . . . .\" Linebaugh v Berdish, supra at 756. Moreover, some panels have stated that the finding of an intentional act necessarily encompasses the corollary finding that the insured intended the injury. Turner v Burch, supra. Similarly, several recent Court of Appeals decisions have achieved a similar result under the \"caused intentionally\" language by inferring the insured's \"intent to act\" from the very nature of his actions. Kermans v Pendleton; Farm Bureau Ins Co v Rademacher, supra. Lastly, some panels have avoided such theoretical exercises and simply equated the \"caused intentionally\" language with the \"expected or intended\" exclusion. Transamerica Ins Co v Anderson; Linebaugh v Berdish, supra. We find these cases persuasive, but rather than engaging in their theoretical exercises or drawing questionable inferences to determine the insured's \"subjective expectation,\" we hold that the \"expected or intended\" exclusion must be determined on the basis of an objective standard. Shelter Mutual Ins Co v Parrish, 659 SW2d 315 (Mo App, 1983); Pickering, supra; Fireman's Ins Co v Smith, 13 Ark App 250, 253-254; 683 SW2d 234 (1985); CNA Ins Co v McGinnis, 282 Ark 90, 93-94; 666 SW2d 689 (1984). \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nUnder the facts of the instant case, we would conclude that the trial court properly granted plaintiff's motion for summary Disposition. Summary Disposition is appropriate when there is no genuine issue of material fact. MCR 2.116(C)(10). Neither party contends that DiCicco returned to his room after the brawl with Gravenmier ended. Rather, it is unrefuted that DiCicco obtained a folding hunting knife, he opened it, and returned to confront Gravenmier with a barrage of verbal attacks and threatening motions with the knife. We find it inconceivable that, under these facts, an objective person would not \"expect\" injury to result from his stabbing Gravenmier with a hunting knife. Therefore, we agree with the trial court that DiCicco must have expected serious injury to result.\n\nEven assuming that we agreed with the defendant and adopted a subjective standard of review of the exclusionary clause, nevertheless, we would conclude that the trial court properly granted plaintiff's motion for summary Disposition. We have the complete record upon which the parties stipulated to the resolution of their declaratory action. Accordingly, we disagree with the Dissent that we must remand the case to the trial court for a determination under a subjective analysis.\n\nIn our opinion, the facts of the instant case would present the ideal circumstances in which a trial court should infer the insured's subjective intentions as a matter of law. The mere fact that the defendants denied their intentions or expectations does not surprise us, nor should it obligate plaintiff to defend in the underlying suit. Otherwise, an insured could simply obligate an insurer to defend by denying that he intended or expected injury to result.\n\nRather, we would hold that defendant \"subjectively expected\" injury to result even though he denied any intent to injury. This Court has recognized the difficulty in determining an individual's \"subjective intentions\": \"'Intent is a secret of the defendant's mind,' which he can disclose by his declarations or by his actions and ' his actions sometimes speak louder than words.'\" People v Strong, 143 Mich App 442, 452; 337 NW2d 335 (1985). (Citations omitted; emphasis added.)\n\nWe adopt this analysis because it accurately addresses the circumstances of the instant case. Although the defendant denies any intent to injure, his actions speak louder than those words. In the instant case, we note that determining the defendant's \"subjective expectations\" requires a lesser degree of proof than his \"subjective intentions.\" DiCicco never contested that he grabbed a folding hunting knife from his room, opened it, and returned to confront Gravenmier with a barrage of verbal attacks and threatening motions with the knife. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Contrary to Justice Boyle's Conclusion, we believe that to claim that DiCicco did not \" expect or intend\" injury to result from his conduct, does in fact, \"' in the face of all reason, common sense and experience.'\" Boyle, J., post, p 720 (citing McGinnis, supra at 93). Therefore, even under these circumstances, we would hold that the defendant \"subjectively expected\" injury to result.\n\nAccordingly, we would reverse the decision of the Court of Appeals and reinstate the trial court's declaratory order in favor of Metropolitan.\n\nIII. ALLSTATE INS CO v FREEMAN\n\nA. FACTS AND PROCEEDINGS\n\nThe plaintiff, Allstate Insurance Company, seeks a determination of its obligation to defend and indemnify under a homeowner's insurance policy issued to Marshall and Alonda Freeman for a shooting incident in which Alonda shot the defendant-appellant, Mary Helen Kelly. The Freemans lived two houses away from Kelly. On February 25, 1984, Kelly stood outside her home, shouting at another neighbor. Alonda Freeman came out of her home and told Kelly to shut her \"damn mouth.\" This provoked an argument between Kelly and Alonda Freeman, during which Alonda Freeman went back into her home. However, rather than remaining safely inside, she retrieved a loaded .38 caliber handgun from her kitchen cabinet and reappeared almost immediately on the front porch. Alonda Freeman testified that without issuing any type of a warning, she aimed the gun in Kelly's direction and fired. Although Alonda Freeman stated that she did not intend to injure Kelly, she also admitted that she stood only three to six feet away from Kelly when she fired the gun. The shot hit Kelly in the shoulder. On August 16, 1984, Alonda Freeman was convicted of discharging a firearm intentionally, aiming without malice and with injury. MCL 750.235; MSA 28.432. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nOn July 13, 1984, a month prior to Alonda Freeman's conviction in the criminal case, Kelly filed a tort action for assault and battery against Marshall and Alonda Freeman for damages resulting from the February, 1984, shooting.\n\nOn August 7, 1984, plaintiff filed the instant declaratory judgment suit seeking a determination that plaintiff did not have to pay any obligation or defend the Freemans upon the basis of the intentional-act exclusion. On September 26, 1984, Kelly amended her original complaint in an attempt to claim damages for negligence. On October 12, 1984, the court entered a default judgment against the Freemans for failure to appear or file an answer. Plaintiff stipulated to the setting aside of these default judgments on December 17, 1984, and on January 25, 1985, moved for summary Disposition, seeking a determination that it had no obligation to defend or indemnify. There is no dispute that on the date of the incident the Freemans were insureds under a homeowner's policy issued by Allstate.\n\nOn February 22, 1985, Wayne Circuit Court Judge Maureen P. Reilly granted plaintiff's motion with regard to Alonda Freeman. However, she reserved judgment, without prejudice, as to Marshall Freeman because of the nonspecific nature of the tort allegations alleged against him. Marshall Freeman was not at home at the time of the shooting incident. On March 15, 1985, Kelly filed a second amended complaint in the underlying tort action in which she argued that Marshall Freeman breached an independent duty of care, which essentially amounted to a claim for negligent entrustment of the firearm. On October 4, 1985, Judge Reilly granted plaintiff's motion for summary Disposition and held that plaintiff did not have a duty to defend or indemnify Marshall Freeman in the underlying tort action. Defendants filed a joint claim of appeal in the Court of Appeals on November 1, 1985. The Court of Appeals affirmed the orders of summary Disposition. On March 22, 1988, this Court granted the declaratory defendants' delayed application for leave to appeal in consolidation with Metropolitan Property \u0026 Liability Ins Co v DiCicco. 430 Mich 857 (1988).\n\nB. SUMMARY DISPOSITION MOTION -- ALONDA FREEMAN\n\nThe Court of Appeals held that the policy exclusion requires application of a two-part test. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e The exclusion in the Allstate policy provided:\n\nExclusions -- Losses We Do Not Cover\n\n1. We do not cover any bodily injury or property damage which may reasonably be expected to result from the intentional or criminal acts of an insured person or which is in fact intended by an insured person. [Emphasis added.]\n\nThe Court of Appeals held that Allstate may obviate its duty to defend and indemnify under the exclusion if it can prove that (1) the insured acted either intentionally or criminally, \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e and (2) the resulting injury was reasonably expected to result from such intentional or criminal conduct. However, Alonda Freeman contends that under the second prong, the Court of Appeals erred in not requiring Allstate to prove Alonda Freeman intended to injure Kelly and, alternatively, that her subjective expectation controls. We find neither argument proffered by Alonda Freeman persuasive.\n\nWe note first that neither party contends that the exclusion is ambiguous as it applies to Alonda Freeman. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e We agree with this Conclusion. The provision, under a conspicuous heading entitled, \"Exclusions -- Losses We Do Not Cover,\" sets forth, in plain English, a two-part test. We do not find the terms, \"reasonably be expected,\" \"intentional,\" or \"criminal\" ambiguous. Moreover, several recent decisions interpreting the identical exclusionary clause in this case have failed to find any ambiguity. See Barton v Allstate Ins Co, 527 So 2d 524 (La App, 1988); Allstate Ins Co v Talbot, 690 F Supp 886 (ND Cal, 1988); Allstate Ins Co v Foster, 693 F Supp 886, 888 (D Nev, 1988) (citing Freeman, supra); Allstate Ins Co v Gilbert, 852 F2d 449 (CA 9, 1988).\n\nApplying the exclusionary language that we find unambiguous to the facts in this case, we are persuaded, as was the Court of Appeals, that Alonda Freeman's conduct satisfies the first element of the exclusionary language as either an intentional or criminal act. The uncontroverted testimony showed that Alonda Freeman left the scene of the fight and reentered her home. However, rather than remaining safely inside, she reappeared with a loaded .38 caliber gun and fired it towards Kelly who was approximately three to six feet away. As the Court of Appeals stated, \"there is . . . no dispute that [Alonda Freeman] pointed a loaded gun in the direction of Kelly and fired it at her at close range.\" Freeman, supra at 356. Under these circumstances, we affirm the holding of the Court of Appeals that Alonda Freeman acted intentionally. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nIn her second argument, Alonda Freeman asserts that the exclusion does not apply because she did not intend to injure Kelly. See, e.g., Morrill, supra; Putman, supra. We rejected the same argument involving a slightly different exclusion in DiCicco, supra. In so doing, we distinguished \"expected\" from \"intended\" injuries within the context of an exclusion which excluded injuries \"either expected or intended,\" and held that \"expected\" required a lesser degree of proof than \"intended.\" Accordingly, we held that an insurer could satisfy either the \"expected or intended\" portion of the exclusion by proving that injury resulted as the \"natural, foreseeable, expected, and anticipated result of [the insured's] intentional .\" Jenkins, supra at 468; Morelli; Yother; Wright, supra.\n\nSimilarly, the Allstate exclusion requires an intentional or criminal act. We find our analysis of \"expected injuries\" in DiCicco equally applicable in the context of this case. Therefore, we hold that \"expected,\" within the context of \"reasonably be expected,\" connotes the same meaning as it does in \"expected or intended.\" An insurer may obviate its duty to defend and indemnify under the exclusion in the present case if the resulting injury was the natural, foreseeable, expected, and anticipated result of the intentional or criminal conduct.\n\nAlonda Freeman further argues that we must determine \"expectation\" from her subjective viewpoint. While there is a line of authority which appears to support this view under the \"expected or intended\" exclusion in other jurisdictions, we do not choose to follow it. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Rather, we find that \"reasonably be expected\" is unambiguous, and therefore, requires application of an objective standard of expectation.\n\nIn support of this Conclusion, we find that the exclusion also excludes coverage for injuries \"actually intended by an insured person.\" In our opinion, this section of the exclusion requires application of a subjective standard. As we stated in DiCicco, we will give effect to all words in an insurance contract if they serve a reasonable purpose. We are persuaded that Allstate included both phrases in order to reinforce its intent to exclude both \"objectively expected injuries\" and \"subjectively intended injuries.\" Therefore, we agree with the Court of Appeals that, under the Allstate exclusion, \"reasonably be\" immediately preceding \"expected,\" in addition to the omission of \"from the standpoint of the insured,\" requires application of an objective test of \"expectation.\"\n\nAccordingly, we agree with the Court of Appeals that a reasonable person would expect injury to result from the shooting incident in this case. As the Court of Appeals stated, \"we agree with the principle that 'some acts . . . \"are so nearly certain to produce injury that intent or expectation to injure should be inferred as a matter of law.\"' \" Freeman, supra at 356; MacKinnon v Hanover Ins Co, 124 NH 456, 460; 471 A2d 1166 (1984); Barton v Allstate Ins Co, supra. For example, Barton involved a shooting incident and implicated the identical exclusionary clause involved in this case. The insured and wife were separated. At 4:00 a.m. one morning, he went to her home and found a man hiding in her bathroom. The insured took out his .357 magnum revolver and shot through the bathroom door, injuring the man. However, the insured claimed he intended to open the door and not to injure the boyfriend. The court held that the exclusion applied because it found that the insured intentionally (intentional act) fired the gun and, therefore, he should have been aware that \"it was substantially certain [reasonably be expected] that the person behind the door would be injured.\" Id. at 526.\n\nSimilarly, the shooting incident in this case constitutes such an act. The uncontroverted testimony showed that after the initial fight with Kelly ended, Alonda Freeman reentered her home, retrieved a loaded .38 caliber handgun, and returned outside to confront Kelly. Then, without issuing a warning, Alonda Freeman shot towards Kelly from a close distance. A motion for summary Disposition is proper under the facts of the instant case. MCR 2.116(C)(10). It would be patently disingenuous to say that injury would not be reasonably expected from the shooting incident. Freeman, supra at 356; Linebaugh, supra at 760-761; Cannon, supra at 34.\n\nTherefore, for the reasons discussed above, we affirm the Court of Appeals holding that under the intentional-act exclusion of the Freemans' policy, Allstate had no duty to defend or indemnify Alonda Freeman.\n\nC. SUMMARY DISPOSITION MOTION -- MARSHALL FREEMAN\n\nNext, we address Marshall Freeman's argument that Allstate must defend him against the Kelly suit. Marshall Freeman raises two arguments. First, that Allstate has a separate and distinct duty to cover each insured under the policy, and, therefore, its duty to defend depends solely upon his conduct. And, second, that the policy language, \"an insured,\" is ambiguous and, therefore, must be construed in favor of the insured. The Court of Appeals rejected both contentions and held that Allstate did not have a duty to defend Marshall Freeman.\n\nWith respect to Marshall Freeman's first argument, we agree with the Court of Appeals analyses holding that \" we agree with Kelly and the Freemans that, under the policy, Allstate has a separate and distinct duty to cover each of the insureds, we nonetheless agree with the trial court that in this case any duty to defend Marshall Freeman is solely derivative of the duty to defend Alonda Freeman under the policy.\" Freeman, supra at 357. Although the Court determined that the claim against Marshall Freeman was essentially one of negligent entrustment, \"where an insurance policy exclusion precludes coverage for the particular injury, then it also excludes coverage for negligent entrustment of the instrumentality that caused the injury. In other words, we look to the underlying cause of the injury to determine coverage and not to the specific theory of liability.\" Freeman, supra at 357-358. See Illinois Employers Ins of Wausau v Dragovich, supra at 507; Shepard Marine Construction Co v Maryland Casualty Co, supra at 65. For example, in Michigan Mutual Ins Co v Sunstrum, 111 Mich App 98; 315 NW2d 154 (1981), Timothy Sunstrum suffered severe injuries in an automobile accident while riding in a truck owned by Warren Priesman and driven by, his son, Michael. Although Michael was uninsured, Warren had automobile insurance for the truck through Associated General Insurance Company, a subsidiary of Michigan Mutual Insurance Company. Michigan Mutual also provided homeowner's insurance for Warren Priesman's residence. Timothy Sunstrum brought an action alleging that Warren Priesman negligently entrusted the truck to his son. The Court of Appeals, (supra) at 103-104 denied coverage holding:\n\nOther jurisdictions which have denied coverage have done so after concluding that negligent entrustment of a motor vehicle, as a cause of action, is derived from the more general concepts of ownership, use or operation of a motor vehicle. These decisions have reasoned that although the act of negligently entrusting a motor vehicle is an essential (if not the primary) element of the tort, liability giving rise to the tort is not actually triggered until the motor vehicle is used in a negligent manner resulting in injury. These jurisdictions have concluded that because the accident occurred off the homeowner's premises and resulted from the use or operation of a motor vehicle, the clear language of the exclusionary clause disavows coverage. [Citations omitted. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e See also Allstate Ins Co v Goldwater, 163 Mich App 646, 649; 415 NW2d 2 (1987); State Farm Fire \u0026 Casualty Co v Huyghe, 144 Mich App 341; 375 NW2d 442 (1985).]\n\nWe also find Allstate Ins Co v Goldwater, supra, a recent Court of Appeals decision, particularly instructive. In Goldwater, two minors, Ronald Goldwater and Robbie Buchte, collided while riding their dirt bikes. The Buchtes sued the Goldwaters for negligent operation of a motor bike. They also sued Ronald Goldwater's father under a negligent-entrustment theory. Plaintiff, the Goldwater's insurer (Allstate Insurance Company), filed a declaratory action, seeking a determination that it had no duty to defend and indemnify the Goldwaters. The Court of Appeals held:\n\n[The Goldwater's homeowner's insurance] excludes coverage for an accident involving a motorized land vehicle designed for recreational use off public roads, owned by an insured, that occurred away from the residence premises.\n\nSince plaintiff has no duty to defend the claim against Ronald Goldwater for negligent use of the dirt bike, it has no duty to defend his father on the claim of negligent entrustment. [ Id. at 649.]\n\nSimilarly, in the instant case, the Court of Appeals concluded that the exclusion focused on \"bodily injury\" and that Alonda Freeman's conduct precluded coverage under the policy. We agree. Therefore, Allstate has no duty to defend Marshall Freeman because it has no duty to defend Alonda Freeman's conduct.\n\nHowever, Marshall Freeman also contends that the exclusion is ambiguous as applied to him because \"an insured\" could mean either \"that insured,\" \"the insured,\" or \"any insured.\" Whereas, plaintiff contends that \"an insured\" means \"any insured.\" The policy exclusion provides, in pertinent part: \" do not cover any bodily injury or property damage which may reasonably be expected to result from the intentional or criminal acts of an insured person . . . .\" Any ambiguity must be construed in favor of the insured. Thus, we agree that if \"an insured\" is ambiguous, then Allstate must defend Marshall Freeman because \"the insured\" or \"that insured\" would refer to criminal or intentional acts of that particular insured, and in this case, Alonda Freeman. American States Ins Co v Borbor, 826 F2d 888, 894 (CA 9, 1987); Western Casualty \u0026 Surety Co v Aponaug Mfg Co, 197 F2d 673, 674 (CA 5, 1952); Arenson v Nat'l Automobile \u0026 Casualty Ins Co, 45 Cal 2d 81; 286 P2d 816 (1955); Unigard Mutual Ins Co, supra.\n\nThe crux of Marshall Freeman's argument adopts the reasoning asserted by the Dissenting opinion in the Court of Appeals decision. Freeman, supra at 361. Although Marshall Freeman cites no case law directly on point, he argues that, in the instant case, we should adopt several rules of insurance contract construction which this Court has applied in the context of an automobile accident policy. Powers, supra at 623-631. While we agree that these principles are generally applicable in the present case, we also find extremely persuasive several decisions by other courts which addressed this issue in the context of an identical policy exclusion. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Allstate Ins Co v Gilbert, (supra) at 453-454; Allstate Ins Co v Condon, 198 Cal App 3d 148; 243 Cal Rptr 623 (1988); Allstate Ins Co v Foster, 693 F Supp 886, 889 (D Nev, 1988); Travelers Ins Co v Blanchard, 431 So 2d 913 (La App, 1983).\n\nIn Allstate Ins Co v Gilbert, supra, a fourteen-year-old minor filed a tort action against Albert and Margaret Gilbert. The United States Court of Appeals for the Ninth Circuit affirmed the lower court decision which held that Allstate did not have a duty to defend Albert Gilbert for sexual molestation of a minor. However, Margaret argued that the claims against her only involved negligence, \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e and, therefore, the Allstate policy required Allstate to defend her in the underlying action. Further, she advanced an argument identical to that of Marshall Freeman, namely, that \"the term 'an insured person' connotes the singular, not the plural, and therefore applies only to the insured committing the willful act.\" Gilbert, supra at 454. However, the court rejected her contention:\n\nRecently, a California appellate court was faced with a similar problem of policy interpretation. In Allstate Ins Co v Condon, [ supra ], an automobile insurance policy excluded coverage of certain automobiles \"available or furnished for the regular use 'of a person insured.'\" The issue was whether \"a person insured\" should be interpreted to mean only the named insured or to include additional insureds under the policy. The court held that \"a person insured\" was functionally equivalent to the terms \"any insured\" and \"an insured,\" and \"logically refers to any one of all the persons insured under the policy\" (as distinguished from \"the insured\" which refers only to a particular insured). . . . We agree with Condon that \"an insured\" refers to all insured under the policy. [ Id.]\n\nWe adopt the analysis of the Gilbert court and hold \"that by excluding insurance coverage for injury or damage intentionally caused by 'an insured person,' Allstate unambiguously excluded coverage for damages caused by the intentional wrongful act of any insured under the policies.\" Gilbert, supra at 454 (citations omitted).\n\nWhile Justice Archer attempts to distinguish Gilbert, his effort misses the mark. We are persuaded that a proper analysis of Gilbert, the cases upon which it relied, and a correct usage of the English language mandates that this Court adopt the Conclusion advanced by plaintiff.\n\nJustice Archer contends that in Gilbert the court reversed its holding in American States Ins Co v Borbor, supra. We find this Conclusion untenable for several reasons. First, Justice Archer uses the following quote from Borbor out of context: \"Judge Thompson, who wrote Gilbert, stated that ' American States intended that the wrongful act of any insured would void the policy, it could have unambiguously drafted and included such language in the contract.'\" Post, pp 734-735. We agree with this quotation as applied in the context of the Borbor opinion. In Borbor, the United States Court of Appeals for the Ninth Circuit addressed the issue whether an insurance policy covered defendants as individuals, a partnership, or both. The court addressed the limited interpretation of the meaning of \"the insured,\" \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e and concluded that if the insurer intended \"any insured\" it could have unambiguously drafted such language. The Borbor court, and the cases which it relied upon, never distinguished, nor had reason to distinguish, the term \"an insured\" from \"any insured.\"\n\nThe Gilbert court never contested the validity of this proposition. However, Justice Archer, in his effort to distinguish Gilbert, extrapolates from the Borbor court's opinion the Conclusion that it also held that \" court reasoned that no uncertainty or ambiguity would have existed if the policy exclusion would have referred to 'any insured' rather than 'an insured.'\" Post, p 735. We disagree that Borbor even remotely supports this inference.\n\nIn fact, the only authority cited by the Borbor court, which analyzed the relationship between \"an insured\" and \"any insured,\" distinguished \"the insured\" from \"a,\" \"any,\" or \"an\" insured and, therefore, supports the position advanced by plaintiff. Borbor, supra at 894 (emphasis added) quoting Comment, Spouse's fraud as a bar to insurance recovery, 21 Wm \u0026 Mary L R 543, 549-554 (1979). If the Borbor court intended to distinguish \"an insured\" from \"any insured,\" then it would have done so rather than citing authority which equated the two terms. Accordingly, we disagree with Justice Archer that the Gilbert court retreated from its position in Borbor. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e Rather, we believe that Borbor supports the Conclusion reached by Judge Thompson in Gilbert.\n\nJustice Archer also concludes that \"an insured\" is ambiguous because Gilbert sought guidance from Allstate Ins Co v Condon, supra which, in turn, drew support from a provision of the California Insurance Code. Post, p 734. Although we agree that Gilbert sought guidance from Condon and that Condon drew support from the insurance code, we disagree that this suggests that \"an insured\" is ambiguous.\n\nIn Condon, an exclusion in the insurance policy precluded coverage for non-owned automobiles that were \"'available or furnished for the regular use of a person insured.'\" Condon, supra at 152 (emphasis added). The court rejected the Condon argument that \"a person insured\" was ambiguous and unequivocally held that \"a person insured\" means \"any insured\" and not \"the insured.\"\n\nHowever, Justice Archer finds \"it instructive\" that the Condon court drew upon a statutory provision to support its holding that \"an insured\" means \"any insured.\" We agree and rely upon the specific wording of the Condon opinion to determine the significance of the court's reference to the insurance code. As the court stated:\n\n\"A person insured\" in the Allstate policy has a plural connotation similar to \"any insured.\" \"A person insured\" logically refers to any one of all the persons insured under the policy. There is no logical method to construe the phrase as singling out any particular insured person within the coverage of the policy.\n\nInsurance Code section 11580.1, subdivision (c)(8) provides another analogous definition. [ Condon, supra at 153. Emphasis added.]\n\nThus, the court drew support from the insurance code only after already concluding in the preceding paragraph that \"a person insured\" unambiguously meant \"any insured.\" Accordingly, we find that the Condon court referred to the insurance code for exactly the purpose which it stated, namely, that it \" another analogous definition.\"\n\nEven assuming that we agreed with Justice Archer's analysis of the interrelationship between Gilbert, Condon, and the insurance code, we disagree with the Conclusions drawn from that relationship. We note that the California code is part of every insurance policy written in California and is \"equivalent to an exclusionary clause in the policy.\" Borbor, supra at 894 (citations omitted). This Court has held that the omission of a definition from an insurance policy does not render that term ambiguous. In this respect, we note that insurance law in California differs from many other states, including Michigan, because the California Insurance Code codifies many seemingly obvious and well-established principles of insurance law. If we adopted the analysis of Justice Archer in the instant case, we would preclude ourselves from drawing upon cases involving the interpretation of insurance policy provisions merely because the California Legislature codified them. We cannot agree that \"an insured\" is ambiguous because the California Legislature defined a term in a code which it considers the equivalent of a policy exclusion, whereas, plaintiff in the instant case did not define the same, unambiguous terms.\n\nFurthermore, we agree with those decisions that reach the same Conclusion as Gilbert by relying upon a correct usage of the English language. See Allstate Ins Co v Foster, supra at 889. This case does not present a situation in which the particular word in question has several meanings. See Shumake v Travelers Ins Co, 147 Mich App 600, 607-608; 383 NW2d 259 (1985). Rather, this case involves the interpretation of a word in which sources uniformly define \"an\" as an indefinite article. For example, the Foster court stated that, \"'' or 'an' is an indefinite article often used in the sense of 'any' and applied to more than one individual object; whereas 'the' is an article which particularizes the subject spoken of.\" Foster, supra at 889; Black's Law Dictionary (5th ed); The American Heritage Dictionary (2d ed, 1982). See Brooks v Zabka, 168 Colo 265, 268-270; 450 P2d 653 (1969); People v Enlow, 135 Colo 249, 261-263; 310 P2d 539 (1957); comment, (supra) at 551. We agree. Strong public policy supports this decision. Adherence to a correct usage of the English language in insurance contract construction promotes a uniform, reliable, and reasonable foundation upon which policyholders and insurers alike may rely when they enter into a contractual agreement. In the instant case, if we place the word \"a\" or \"an\" in front of the word \"insured,\" then we must conclude that \"an insured\" unambiguously means \"any insured.\" \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\n\nAccordingly, we hold that under the policy exclusion in the instant case, \"an insured\" unambiguously refers to \"any insured.\" \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e As we have previously held: \"The expectation that a contract will be enforceable other than according to its terms surely may not be said to be reasonable.\" Raska v Farm Bureau Mutual Ins Co, supra at 362; Klym v Nida, 147 Mich App 709, 713; 383 NW2d 93 (1985). We base our decision today upon an interpretation of the insurance policy and not upon a factual dispute. Summary Disposition is proper under these circumstances. MCR 2.116(C)(10). Therefore, we affirm the decision of the Court of Appeals in Freeman with regard to Marshall Freeman.\n\nIV. SUMMARY\n\nA\n\nIn Allstate Ins Co v Freeman, we hold that Allstate's exclusionary clause requires application of a two-part objective test. An insurer may relieve itself of its duty to defend and provide coverage if (1) the insured acted either intentionally or criminally, and (2) the resulting injuries occurred as the natural, foreseeable, expected, and anticipated result of an insured's intentional acts. We also hold that \"an insured\" unambiguously refers to \"all\" or \"any\" insureds under the homeowner's policy. Accordingly, we affirm the decision of the Court of Appeals in Freeman.\n\nB\n\nIn Metropolitan Property \u0026 Liability Ins Co v DiCicco, we hold that the claimed incident constituted an \"occurrence\" under the coverage provision of the insured's policy. We also hold that an insurer need not prove that the insured acted intentionally in order to avoid its duty to defend and indemnify under the present exclusion. However, unlike a majority of this Court, we would hold that, in order to avoid its duty to defend and indemnify under the exclusion, the insurer must show that an objective insured \"intended or expected\" injury to result from those acts. Therefore, we would reverse the decision of the Court of Appeals in DiCicco and reinstate the decision of the trial court.\n\nBoyle, J.\n\nI agree with the analyses and Conclusions of Chief Justice Riley in Freeman, but write separately to express my views in DiCicco, viz., that Metropolitan Property and Liability Insurance Company has a duty to defend on these facts, although it may yet emerge that Metropolitan is not liable to indemnify DiCicco.\n\nI\n\nTHE ISSUE\n\nWe are initially faced with the most basic of tasks for any appellate court -- that of discerning the issue before the Court. While the issue presented by the parties is whether Metropolitan has a duty to defend, it often appears in the opinion of the Chief Justice that the issue is whether Metropolitan has a duty to indemnify. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e As explained in one treatise:\n\nA duty to defend is contractual and if there is no contract to defend there is no duty to defend. The policy sets forth the duty to defend as primarily giving rise to the insured's reasonable expectation of protection. Therefore, a duty to defend may exist even though an exclusion would be sufficient to bar the insurer's duty to pay a claim. [14 Couch, Insurance, 2d (rev ed),  51:35, pp 444-445.]\n\nBecause the duty to defend, like the duty to indemnify, is contractual, any delineation of the scope of the duty to defend without reference to the policy itself must be viewed as a mere generality. Indeed, even the delineation quoted above may be too sweeping.\n\nHowever, the importance of distinguishing between the duty to defend and the duty to indemnify extends beyond analysis of the policy language itself. A complaint against an insured may state facts within policy coverage, outside policy coverage, or partly within or partly outside policy coverage. See, generally, 14 Couch, Insurance, 2d (rev ed),  51:44-51:47, pp 458-487. Moreover, it may well be that a conflict will emerge between the alleged and known facts. Again, as explained in the treatise:\n\nThe general rule -- that is, that the determination of whether or not the claim made against the insured is one which by the terms of the contract the insurer is required to defend depends upon the facts stated in the complaint or petition in the action against the insured -- does not take into account the possibility that a divergence may exist between the facts as alleged in the petition and the actual facts as they are known to, or ascertainable by, the insurer. The few cases in which the existence of such a divergence was discussed do not show a uniform result. Some of them take the view that allegations in the complaint or petition remain determinative of the insurer's duty to defend even though the actual facts are to the contrary, while other cases apparently favor the opposite view and hold that the insurer should not look exclusively to the allegations of the complaint or petition in the proceedings against the insured but is to be guided by the actual facts of which it has knowledge. The duty of the insurer to defend should be fixed by the facts which the insurer learns from the complaint, the insured, or other sources. It has the duty to defend its insured whenever it ascertains facts which give rise to the of liability under the policy. Thus, an insurer under a comprehensive personal liability policy obligating it to defend suits alleging bodily injury but excluding coverage as to injury caused intentionally by the insured was obligated to defend an action alleging intentional assault since there was a possibility that damages obtained were covered by the indemnity provisions of the policy in that injured party could have amended to allege negligent conduct and insured might have been able to show a defense of self-defense so that any injury was not willful and intended. [ Id.,  51:51, pp 495-501.]\n\nNevertheless, whether the complaint against the insured states facts within or outside the scope of coverage, whether the dispositive facts are those pled or known, we must eventually return to the language of the policy itself to decide whether there is a duty to defend. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e This very basic question is not one of public policy, but whether the insurer has contractually bound itself to provide a defense. In contrast, once a duty to defend is found, public policy comes to bear upon exercise of the duty by the insured:\n\nUnder liability or indemnity policies in which the insurer assumes the duty of defending or settling suits or claims against the insured, this obligation is one requiring due care and a strict performance in utmost good faith. In such case, the insurer owes the duty to exercise reasonable care in conducting the defense, and is liable for damages resulting to the insured by reason of its negligence in performing such duty. [14 Cough, Insurance, 2d (rev ed),  51:78, pp 565-566.] \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nIt is particularly easy in this case to blend the contractual duty to defend with the duty to indemnify, because both forms of coverage are set forth in the same policy language. The trial court noted:\n\nThere is no dispute that as of the date of the incident David DiCicco was an insured under a homeowner's insurance policy issued by Plaintiff, Metropolitan Property \u0026 Liability Insurance Company, to David DiCicco's parents. It is also undisputed that the policy language in pertinent part :\n\nSection II\n\nCoverages:\n\nCoverage F -- Personal Liability\n\nMetropolitan will pay on behalf of the insured all sums which the insured shall become legally obligated to pay as damages because of bodily injury sustained by other persons or property damage, to which this insurance applies, caused by an occurrence. Metropolitan shall have the right and duty, at its own expense, to defend with attorneys selected by and compensated by Metropolitan, any suit against the insured seeking damages on account of such bodily injury or property damage even if any of the allegations of the suit are groundless, false or fraudulent . . .\n\nExclusions applicable to section II\n\nMetropolitan does not insure:\n\n1. Under coverage f -- personal liability . . .\n\nf. Bodily injury or property damage which is either expected or intended from the standpoint of the insured.\n\nPlaintiff advises the Court through its brief that the policy further states:\n\nDefinitions:\n\nOccurrence means an accident, including injurious exposure to conditions, which results, during the policy term, in bodily injury or property damage. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nIn this case it is undisputed that the duty to defend is coextensive with the duty to indemnify, at least insofar as the operative facts are the same for both coverages. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e However, the operative facts may be quite divergent, because the duty to indemnify arises only after liability is found in the underlying claim.\n\nThe declaratory judgment action of the insurer with which we are presently concerned was tried without a jury by the stipulation of the parties on the basis of deposition transcripts and the written arguments of counsel. Thus, although our resolution of this matter is based upon the findings of the trial court, see opinion of Chief Justice Riley, ante, p 665, different facts may yet emerge at trial on the underlying claim. At this point, we know only that DiCicco has denied \"any intent to use the knife\" and that Gravenmier \"did not expect DiCicco would use the knife\" in an actual stabbing. See opinion of Chief Justice Riley, ante, p 664. It is within this factual framework that we must resolve the limited coverage question of the duty to defend.\n\nII\n\nA. INTRINSIC ANALYSIS\n\nI agree that the incident in the instant case is not so \"clear cut\" as to allow us to conclude that there was no \"occurrence.\" Thus, I believe that the next logical step is to determine whether \"such bodily injury\" unambiguously falls within the exclusion of  1(f). \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e I am assisted in this task by this Court's own opinions and the policy language at issue. In Raska v Farm Bureau Mutual Ins Co, 412 Mich 355, 361-362; 314 NW2d 440 (1982), we explained:\n\nAny clause in an insurance policy is valid as long as it is clear, unambiguous and not in contravention of public policy.\n\nA contract is said to be ambiguous when its words may reasonably be understood in different ways.\n\nIf a fair reading of the entire contract of insurance leads one to understand that there is coverage under particular circumstances and another fair reading of it leads one to understand there is no coverage under the same circumstances the contract is ambiguous and should be construed against its drafter and in favor of coverage.\n\nYet, if a contract, however inartfully worded or clumsily arranged, fairly admits of but one interpretation it may not be said to be ambiguous or, indeed, fatally unclear.\n\nTo emphasize the relevant policy language, it excludes:\n\nBodily injury or property damage which is either expected or intended from the standpoint of the insured.\n\nThere are no complex or contradictory provisions in this exclusion. Moreover, it is difficult to justify a search for ambiguity in this provision as a whole, since neither party nor either of the other opinions of the Court suggests one which might preclude coverage. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nThe Chief Justice reasons that the use of both \"intended\" and \"expected\" unambiguously requires an objective construction of \"expected\" in order to avoid a superfluous reading of the latter. However, this reading ignores the phrase \"from the standpoint of the insured\" which, by the absence of a comma following \"expected,\" presumably modifies both \"expected\" and \"intended.\" \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Cf. Buntz v General American Life Ins Co, 136 Pa Super 284; 7 A2d 93 (1939). See, generally, 2 Couch, Insurance, 2d (rev ed),  15:13, pp 156-157 (the punctuation in an insurance policy may be resorted to as an aid in construction, although the construction according to strict rules of grammar does not prevail over the intent of the parties as shown by the whole instrument). See also 3 Corbin, Contracts,  549, pp 183-186 (contracts are to be interpreted and their legal effects determined as a whole). Indeed, the Chief Justice does not dispute that the phrase \"from the standpoint of the insured\" modifies both words, but instead reasons that the phrases \"expected\" and \"intended\" are alternatives and \"' one's state of mind is an elusive task . . . .'\" Ante, p 677. Quoting with approval Truck Ins Exchange v Pickering, 642 SW2d 113, 116 (Mo App, 1982). Again, I find the case law instructive, but of little use in an intrinsic analysis for ambiguity.\n\nPerhaps most instructive is a comparison of Metropolitan's exclusion with one which all members of this Court agree creates an objective standard. The Allstate exclusion specifies:\n\nWe do not cover any bodily injury or property damage which may reasonably be expected to result from the intentional or criminal acts of an insured person or which is in fact intended by an insured person. [Emphasis added.]\n\nIn the Allstate exclusion, the addition of the word \"reasonably\" clearly imparts an objective standard in contrast to \"in fact intended.\" In contrast, the absence of the word \"reasonably\" coupled with the modifying clause \"from the standpoint of the insured\" clearly imparts a subjective standard in the Metropolitan exclusion.\n\nI do not believe that a fair reading of the Metropolitan exclusion would support an objective standard and therefore conclude that the policy language is unambiguously subjective. Moreover, given that all members of this Court agree that the exclusion is unambiguous, I believe that it is unnecessary to belabor the point. I would therefore apply the exclusion in its plain and easily understood sense. Wertman v Michigan Mutual Liability Co, 267 Mich 508, 510; 255 NW 418 (1934).\n\nTo apply the exclusion in its plain and easily understood sense, we need only determine whether Gravenmier's injury was either expected or intended from the standpoint of DiCicco. In doing so, we must apply the facts as found by the trial court. See the opinion of the Chief Justice, ante, p 664. Most relevant in this regard are the following findings of the trial court:\n\nDiCicco denies any intent to use the knife, claiming that he went to get the knife merely to scare away the other persons he considered to be a threat. No one observed him make a gesture of moving the knife as though to stab Gravenmier. The knife was held in his right hand and the poking was done with his left. DiCicco denies knowledge of in fact stabbing. Immediately following the stabbing, DiCicco looked shocked. Gravenmier obviously did not expect DiCicco would use the knife or he would not have engaged in his act of bravado.\n\nIt is obvious that these findings will not require the Conclusion that DiCicco expected or intended to injure Gravenmier. I therefore conclude that the plaintiff insurer has failed to establish that the  1(f) exclusion is relevant. Metropolitan is bound, by the general coverage provision, the unambiguous language of its own policy, to provide a defense to DiCicco in the underlying claim. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nAgain, I emphasize that this Disposition of the declaratory judgment claim involves no determination of Metropolitan's duty to indemnify. If it is established in the underlying claim that DiCicco intended or expected to injure Gravenmier, Metropolitan may yet have a defense to indemnification.\n\nB. EXTRINSIC ANALYSIS\n\nAs this Court has long held, insurers in drafting policies must use language which is clear and understandable to laymen. See, e.g., Wadsworth v New York Life Ins Co, 349 Mich 240, 259; 84 NW2d 513 (1957); Century Indemnity Co v Schmick, 351 Mich 622, 627; 88 NW2d 622 (1958). This is simply correlative of the rule that technical constructions of policies are not favored and exceptions to the general liability provided for in a policy are to be strictly construed against the insurer. Francis v Scheper, 326 Mich 441, 448; 40 NW2d 214 (1949). See, generally, 2 Couch, Insurance, 2d (rev ed),  15:74, pp 334-357. Both rules stem from the presumption that the parties to a contract of insurance fully understand the provisions. Id.,  15:12, pp 155-156. Since an insured is charged with knowledge of the provisions of the policy, Cleaver v Traders' Ins Co, 71 Mich 414, 417; 39 NW 571 (1888), 2 Couch, (supra) ,  15:14, pp 157-159, it reasonably follows that insurers must draft policies in language which is clear and understandable to laymen.\n\nI have concluded that Metropolitan failed to draft its exclusion so as to clearly preclude a duty to defend DiCicco. Indeed, I have concluded that the policy clearly and unambiguously requires the insurer to provide a defense on these facts. Thus, there is no need to resort to extrinsic evidence to ascertain the meaning of the exclusion. Id.,  15:57, pp 298-302. (Since all prior negotiations are assumed to be merged in the written contract, the policy itself constitutes the contract between the parties, and, if the meaning is clear, it alone must be looked to in construction.) \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e However, assuming arguendo that an ambiguity exists and therefore that extrinsic evidence is admissible, I would nevertheless hold that Metropolitan has a duty to defend under this policy.\n\nPerhaps the most common of extrinsic aids to the construction of an insurance policy or other contract are usage and custom. See id.,  15:60, pp 307-308; 3 Corbin, (supra) ,  555, pp 228-239. It is in this light that I have reviewed the large number of cases from foreign jurisdictions cited by the parties. It is, of course, possible that the reasoning of other courts would also add insight into relevant methods of intrinsic analysis. Moreover, it is possible that the weight of authority may be of use in resolving an ambiguity. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e However, the sheer weight of authority cannot create an ambiguity in the plain and ordinary meaning of the policy language where none would otherwise exist. Again, we charge the insured with knowledge of the policy provisions. We do not charge the insured with the accumulated knowledge of a law library. As explained by Professor Corbin:\n\nWhen a member of a trade or profession makes a contract with one who is not a member, a usage or custom is not operative against the latter unless he in fact knows it or has such reason to know it that the member reasonably believes that he knows it. This is true even though the transaction is one that regularly occurs within the trade or profession. [3 Corbin, (supra) ,  557, p 248.]\n\nHere, there is no evidence that the insured in fact knew or had reason to know of a usage apart from the plain or ordinary meaning of the words of the exclusion. Thus, in reviewing the case law as to usage, I am only assuming arguendo both that the policy language requires extrinsic analysis and that it is relevant to the interpretation of the policy language in this case.\n\nAs explained in the opinion of Justice Archer, standard policy language prior to 1966 included coverage for bodily injury or property which was \"accidental.\" See opinion of Justice Archer, post, pp 723-725. This was interpreted to exclude coverage for \"expected or intended\" injury, but two problems arose.\n\nThe first problem with the \"expected or intended\" interpretation was whether it should be viewed from the standpoint of the injured party or from that of the insured. As one commentator has explained:\n\nA split of authority existed prior to the 1966 revisions as to whether the happening of an accident must be determined from the standpoint of the insured or from the standpoint of the victim. Where the question of accident is viewed from the standpoint of the victim, it seems obvious that almost all instances of personal injury or property damage would appear to be accidents. The victim of an assault or other personal injury or property damage generally does not intend or expect it to happen. [Rynearson (supra) , Exclusion of expected or intended personal injury or property damage under the occurrence definition of the standard comprehensive general liability policy. 19 Forum 513, 521-522 (1984). See also anno: Liability insurance: Assault as an \"accident,\" or injuries, therefrom as \"accidentally\" sustained, within coverage clause, 72 ALR3d 1090,  4, p 1100.]\n\nObviously, interpretation of the policy language to require only that the injury be \"expected or intended from the standpoint of the injured party\" greatly expanded the liability of the insurer.\n\nA second, and relatively minor problem, arose in interpretations of the pre-1966 language regarding whether \"accidental, expected or intended\" injuries must be measured by the act or the result. As explained by Rynearson:\n\nThe primary split in authority involved a question of whether or not an insured would be barred by the \"foreseeable\" or \"expected\" consequences of his act or conduct. A distinction was made between intentional acts and intentional results, with the emphasis being on the result, and not the act which brought about the result. Thus, one had to have either foreseen or intended the results of his act in order to bar coverage. The term \"expected\" was not necessarily equated with the term \"foreseeable\" and could denote a different degree of anticipation of damage from a particular course of action. [Rynearson, (supra) , 19 Forum 518. Emphasis added.]\n\nAs can be seen from Rynearson's Discussion, although \"foreseen\" and \"intended\" acts may denote different degrees of anticipation, either may be viewed from the standpoint of the insured. A split of authority had nevertheless developed over the use of a subjective or an objective test.\n\nThe 1966 revisions were clearly designed to remedy the split of authority as to whether the accidental nature of the injury was to be measured from the standpoint of the insured or from that of the injured party:\n\nPrior to 1966, the language employed to achieve a similar \"exclusion\" objective had been, generally, \"bodily injury or property damage caused intentionally by or at the direction of the insured.\" The courts had experienced difficulties with this latter language insofar as it was being used to clarify the concepts of \"accident\" or \"accidental means,\" as those concepts appeared in policies prior to 1966. The view that \"caused intentionally,\" as an amplification of the circumstances that constituted an \"accident\" or \"accidental means,\" signified that the prospective was to be from the standpoint of the victim, had been rejected, for the reason that it is the state of the will of the person by whose agency the injury was caused rather than that of the injured person which determines whether an injury was accidental. However, this approach was characterized as a form of punishment to the wrongdoer, and it ignored the fact that insurance also is for the benefit of injured victims of accident. For this reason, others considered the resulting injury from the point of view of the victim, and if it was accidental from that point of view, the loss would be covered by the liability insurance issued to the actor.\n\nIt appeared that the change of language now under scrutiny, which emerged from the 1966 \"revision\" undertaking, had reference to this agreement as to perspective, and that one of its purposes was to make more specific the concept of \"accident\" contained in the definition of \"occurrence.\" It was stressed that the phrasing \"from the standpoint of the Insured\" seemed designed to make plain that the \"accident\" component of an \"occurrence\" is to be evaluated from the perspective of the insured rather than of the injured victim. [Anno: Construction and application of provision of liability insurance policy expressly excluding injuries intended or expected by insured, 31 ALR4th 957, 972. See also 34 ALR4th 761 (acts of self-defense as within the same exclusion), and 35 ALR4th 1063 (criminal conviction as falling within the same exclusion).]\n\nWhile the 1966 revision, adopting the language of dispute in this proceeding, resolved the split of authority as to the viewpoint of the injured or insured, it did nothing to resolve the insurer's problem as to whether a subjective or objective standard should be employed. Indeed, it made the insurer's position as to the latter less tenable. As I have discussed in part II, intrinsic analysis of the phrase \"from the standpoint of the insured\" imparts a subjective meaning to the words \"expected or intended.\"\n\nParenthetically, it might be argued that the prepositional phrase, \"from the standpoint of the insured,\" should be read to modify the antecedent \"intended.\" See 2 Couch, Insurance, 2d (rev ed),  15:13, pp 156-157. Thus, the word expected might be given an objective meaning in contrast to \"intended,\" i.e., \"reasonably expected.\" However, under such a reading, the word \"expected\" might yet be viewed from the standpoint of the injured party. Indeed, had the insured insisted that the qualifying phrase be applied only to \"intended,\" viewing \"expected\" from the standpoint of the injured party would appear to be the most reasonable reading of the modified exclusion in an intrinsic analysis. Needless to say, it is not a reading that the insurer has suggested nor does it appear to be one that the insurer would prefer. Therefore, even in light of the extrinsic evidence, I would adopt a reading of the exclusion under which the phrase \"from the standpoint of the insured\" qualifies both \"expected\" and \"intended.\"\n\nClearly, extrinsic analysis establishes that the phrase \"from the standpoint of the insured\" was not principally intended by the insurer to convey a subjective standard. However, it must be conceded that the insurer was aware of the split of authority regarding a subjective or objective standard. Subsequently, language was adopted by the insurer which solved one coverage issue while weakening the insurer's position as to another. That is, the insurer accepted a clause imparting a subjective standard in order to clarify that the accidental nature of the injury must be viewed from the standpoint of the insured. In this light, the continuing argument as to an intent to employ an objective standard is commensurately weakened.\n\nThe insurer's argument is weakened further when it is considered that alternative language might have placed them in a better position as to both coverage questions, as illustrated by the language employed by Allstate in the companion case.\n\nThere are presently two distinguishable classes of cases under the standard exclusion used by Metropolitan. First, there is the class of cases involving an intended act, but unintended injury:\n\nThe courts in a number of jurisdictions have adopted the view that the injury or damage is \"caused intentionally\" within the meaning of an intentional injury exclusion clause so as to preclude coverage if the insured intended the act and to cause some kind of bodily injury or damage . . ., with the result that the insurer will not be relieved of its obligations under a liability policy containing the exclusion unless the insurer acted with such specific intent. . . . is authority explicitly supporting the view that once it is found that harm was intended, it is immaterial that the actual harm caused was of a different character or magnitude from that intended by the insured . . . . [31 ALR4th at 973.] \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nUtilizing a subjective standard for \"expected or intended,\" courts have found that there was coverage when the intentional burning of property, but without the intent to injure or cause damage, in fact caused injury or damages. See, e.g., Aetna Ins Co v Janson, 60 Ill App 3d 957; 18 Ill Dec 143; 377 NE2d 296 (1978). Similarly, coverage has been found in cases in which guns were intentionally pointed, but the discharge or the striking of the injured party was unintentional. See, e.g., Vanguard Ins Co v Cantrell, 18 Ariz App 486; 503 P2d 962 (1972); Jackson v Lajaunie, 253 So 2d 540 (La App, 1971), aff'd in part and rev'd in part on other grounds, 264 La 181; 270 So 2d 859 (1972).\n\nAnother class of cases involves an intentional act, the result of which injury can only occur. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e In these cases, some courts have quite reasonably presumed that the injury was intentional. Thus, in Fireman's Ins Co v Smith, 13 Ark App 250, 253-254; 683 SW2d 234 (1985), cited by the Chief Justice, a wrongful death action was brought against the insured in alleging that the shooting of the victim was \"willful, malicious and intentional.\" Since the language of the complaint in the underlying claim was controlling, it could only be presumed that the injury was intended and coverage was excluded. Similarly, in Cavanagh v Ohio Farmer Ins Co, 20 Ariz App 38; 509 P2d 1075 (1973), an intent to injure was presumed from the fact that the insured placed a loaded gun to the victim's head and pulled the trigger. Presumed intent can also be found in CNA Ins Co v McGinnis, 282 Ark 90; 666 SW2d 689 (1984), also cited by the Chief Justice. In McGinnis the insured caused injury to his minor stepdaughter through sexual abuse. The court rejected McGinnis' claim that although the sexual intercourse was intended, no harm was intended. The McGinnis court analogized to Clark v Allstate Ins Co, 22 Ariz App 601; 529 P2d 1195 (1975), in which no coverage was found as a matter of law, although the insured denied an intent to injure when striking the victim in the face with a closed fist. As explained in McGinnis, to claim that the insured did not expect or intend to cause injury \"flies in the face of all reason, common sense and experience.\" Id. at 93.\n\nThe same cannot be said in this case. While DiCicco did intentionally brandish the knife and further \"poked\" Gravenmier in the chest with his other hand, it was apparently Gravenmier's own act of bravado which immediately preceded the injury. While it is true that facts may yet emerge in the underlying claim which would establish that DiCicco actually expected or intended to stab Gravenmier (as opposed to Gravenmier accidentally being cut), I cannot say on the present facts that the denial of an intent to injure \"flies in the face of all reason, common sense and experience\" so that intent to injure may be presumed. I cannot say that brandishing a knife always results in injury -- that DiCicco's actions preclude coverage as a matter of law. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nTherefore, assuming arguendo that extrinsic analysis is necessary, it is my Conclusion that the trial court improperly granted judgment for the insurer in this action, and I would reverse its judgment. However, I would again emphasize that I necessarily take no position as to whether Metropolitan must eventually indemnify DiCicco for injuries caused to Gravenmier.\n\nConclusion\n\nThe insurer has failed to establish either an actual intent to injure Gravenmier or such acts as would allow the court to presume an intent to injure as a matter of law. The trial court therefore erred in granting declaratory judgment for the insurer in this action. I would remand this matter for further proceedings consistent with this opinion.\n\nArcher, J. (concurring in part and Dissenting in part).\n\nINTRODUCTION\n\nI respectfully Dissent from the lead opinion's application in Metropolitan Property \u0026 Liability Ins Co v DiCicco, of an objective standard to an insurance exclusionary clause regarding coverage of an insured's behavior which results in \"bodily injury or property damage which is either expected or intended from the standpoint of the insured.\" In Allstate Ins Co v Freeman, I concur with the Conclusion of the lead opinion that the exclusionary clause at issue mandates the application of an objective standard of review, thus relieving the insurer of a duty to defend against Alonda Freeman's actions. However, I Dissent from its finding that the insurer does not have a duty to defend Marshall Freeman on the basis of a co-insured's intentional acts. Accordingly, I would affirm the result of the Court of Appeals in Metropolitan Property \u0026 Liability Ins Co v DiCicco. I would also affirm the decision of the Court of Appeals in Allstate Ins Co v Freeman with regard to Alonda Freeman. However, I would reverse the decision of the Court of Appeals with regard to Marshall Freeman, and remand this portion of the case to the trial court for consideration on the separate question of the insurer's liability for Marshall Freeman's alleged negligence.\n\nI. METROPOLITAN INSURANCE CO v DICICCO\n\nI accept the recitation in the lead opinion of the factual background giving rise to the instant case.\n\nA\n\nIn Fresard v Michigan Millers Mutual Ins Co, 414 Mich 686, 693-695; 327 NW2d 286 (1982), this Court succinctly stated the oft-cited rules concerning the construction of insurance policy provisions:\n\nThis Court recently reiterated that \" clause in an insurance policy is valid as long as it is clear, unambiguous and not in contravention of public policy.\" Raska v Farm Bureau Mutual Ins Co of Michigan, 412 Mich 355, 361-362; 314 NW2d 440 (1982). The Raska majority noted that the only pertinent question was \"whether the exclusionary clause in this contract is ambiguous, for if it is not ambiguous we are constrained to enforce it.\"\n\nWhen examining the language of this or any other insurance policy, we are mindful of several other principles of construction so rudimentary as to be axiomatic:\n\nThe contract should be viewed as a whole.\n\nThe intent of the parties should be given effect.\n\nAn interpretation of the contract which would render it unreasonable should be avoided.\n\nMeaning should be given to all terms.\n\nAmbiguities should not be forced.\n\nConflicts among clauses should be harmonized.\n\nThe contract should be viewed from the standpoint of the insured.\n\nThe insurer should bear the burden of proving an absence of coverage.\n\nThe use of standard policies presents a unique situation in which the precise language we are asked to analyze already has been interpreted by courts in other jurisdictions. The existence of so many opinions is both an advantage and a disadvantage. The benefit, of course, is the insight provided by learned jurists in other states and in the federal courts. The danger is that weight unfairly may be accorded a view merely because it has withstood attack for a period of time or because it is embraced by the majority of jurisdictions.\n\nMindful of these rules of construction, we turn first to the development of the exclusionary clause itself.\n\nThe insurance industry has employed standardized general liability insurance policies for over four decades.1a Fresard, supra at 691. The instant exclusionary clause is the product of sweeping revisions in standardized general liability policies undertaken in 1966. Upon examination of commentary issued contemporaneously with its introduction, it is clear the provision was primarily designed to resolve the controversy concerning the requirement under then-prevalent general liability insurance policies, that bodily injury or property damage be caused \"by accident.\"2a However, the term \"accident\" was rarely defined by the policy, thus producing contradictory constructions in the instances of an insured's alleged intentional behavior. As a result, the courts focused alternatively on an accident's presence either from the standpoint of the victim, in furtherance of a public policy not to reward an insured for intentional tortious actions, or from the standpoint of the insured party, in order not to penalize the injured party and effectuate the remedial purposes of insurance coverage.\n\nIn response to the judicial impasse concerning the construction of the term \"accident,\" the 1966 drafters premised an insurer's duty to defend and to provide coverage upon the more expansive concept of an \"occurrence\" which, as correctly noted by the majority, is inclusive not only of the commonly understood meaning of \"accident,\" but also of intentional actions.3a However, the drafters also provided that the physical injury or property loss must neither be expected nor intended from the standpoint of the insured. While this language answered the question of the perspective from which an occurrence was to be considered, the inclusion of the terms \"expected\" and \"from the standpoint of the insured\" within the exclusionary provision left unresolved the two issues before us today.4a First, whether the construction of pre-1966 insurance exclusionary clause language is applicable to the instant provision. Second, whether examination of the instant clause entails an objective or subjective standard of review.5a\n\nB\n\nI concur that an insurer's duty to defend is triggered by the determination of whether an occurrence is in fact present. The concept of an occurrence is appropriately broadly construed, and I accept that in the instant case an occurrence is in fact present for purposes of Metropolitan's insurance policy. However, while I also find that the instant exclusionary clause is unambiguous as a matter of law, I disagree as to the Conclusions to be drawn from its nonambiguity:6a\n\nThe word \"occurrence\" instead of the word \"accident\" in the insuring clause means that the word \"occurrence\" is in fact broader than the word \"accident\" and is so intended by the insurer. In such case, the intent of the policy is to insure the acts or omissions of the insured, including his intentional acts, excluding only those in which the resulting injury is either expected or intended from the insured's standpoint.\n\nIt is clear therefore, that the insured here would be debarred from coverage in those cases where his deliberate acts or assaults resulted in injuries which would be expected or intended by him to result from his deliberate acts. But what about coverage where the results of his acts (even though deliberate) are unexpected or not intended by the insured? The answer under which a policy provision is that (1) the event is an occurrence; (2) since it results in bodily injury it is an accident under the definition of the policy, and (3) since it is unintended or unexpected, it is within the coverage of the policy.\n\nSuch a construction of the insurance policy is not strained or forced, but rather is an interpretation of the plain, ordinary and popular meaning of the words used by the insurer in defining the coverage extended. It should be interpreted in that sense. . . . We do not consider this provision to be ambiguous; the possibility of unintended bodily injury brings that result within the policy coverage. . . . [ Northwestern Nat'l Casualty v Phalen, 182 Mont 448, 455-456; 597 P2d 720 (1979). Emphasis added.]\n\nAs noted in the lead opinion, prior to the introduction of the 1966 revisions, this Court required under language involving injury or property loss incurred \"by or at the direction of the insured,\" a showing both of subjective intention to commit the act in question and a comparable state of mind to the harm inflicted. Clearly, this requirement becomes unnecessary under the standard espoused in the lead opinion which is satisfied where the bodily or property damage injury need only reach a threshold of natural and foreseeable consequence.7a However, I must Dissent from the interjection in the lead opinion of an objective standard of reasonability in the absence of clear language so dictating. See, e.g., Health Care \u0026 Retirement Corp v St Paul Fire \u0026 Marine Ins Co, 621 F Supp 155, 161 (W Va, 1985):\n\nmajority rule with respect to intentional injury exclusions is that the exclusion applies if the insured intended to do a particular act, and intended to do some harm, even if the harm actually done was radically different from the harm intended. Yet, on the other hand, an intentional injury exclusion will not apply if the insured intentionally does an act, but has no intent to commit harm, even if the act involves the foreseeable consequences of great harm or even amounts to gross or culpable negligence. . . . Without such a distinction, the policy language referring to \"the standpoint of the insured\" is rendered meaningless. [Emphasis added.]\n\nFurther, while I agree with the observations in the lead opinion that the terms \"intended\" and \"expected\" are not synonymous, this does not logically mandate an objective standard of review8a\n\nto the extent that \"expected\" may be defined in terms of anticipation and that a lesser degree of proof may be required to establish expectation than to establish intent. However, we reject the view that expectation is to be Judged on an objective standard. The word \"reasonable\" is not employed in the exclusion in question, and we reject [the insurance company's] plea that we read in a reasonableness standard. It was [the insurance company] which drafted the policy and if it wanted an objective standard to apply, it could have drafted its policy accordingly.9a [ Aetna Casualty \u0026 Surety Co v Dichtl, 78 Ill App 3d 970, 977; 398 NE2d 582 (1979).]\n\nAs the lead opinion argues against rendering the term \"expected\" superfluous by equating it with the term \"intended,\" I similarly find that the application of an objective standard of review places this Court in the position of redacting the phrase \"from the standpoint of the insured\" from the instant exclusionary clause. This Court is bound by the language of the exclusionary clause and should be reticent to introduce concepts of foreseeability, more appropriate in the arena of tort actions than in the realm of insurance.\n\nI would also note that the lead opinion cites a number of decisions by the Court of Appeals, in addition to decisions from other jurisdictions, which have found it unnecessary in certain factual situations to engage in a subjective analysis and have inferred either an intent or expectation to injure as a matter of law. However, I disagree that the import of these decisions constitutes an engagement in theoretical exercise seeking to avoid a determination of an insured's subjective intentions.10a Upon examination of these decisions, I observe that within the areas of child molestation and certain violent assaultive actions, because of the nature of the act itself, a number of courts have found that the insured fell within the instant exclusionary clause as it was nearly impossible, even under a subjective standard, to find that the party could not have either intended or expected the harm which had been inflicted. However, while there are limited factual scenarios which may arguably lend themselves to such a determination, this does not erase the clear language of the exclusionary clause or the remaining multitude of instances in which a determination of the insured's subjective state of mind is necessary. Further, the lead opinion fails to cite any authority that these decisions are indicative of an unworkable subjective standard, or that its approach is an exception which threatens to engulf the rule.\n\nAccordingly, in the absence of explicit policy language to the contrary, I would hold that the appropriate standard of review to construe the instant exclusionary clause must be subjective:\n\ndecide that the \"exclusion\" from the foundational personal liability coverage afforded Dodge by his policy, as the exclusion is stated in the language \"bodily injury . . . which is either expected or intended from the standpoint of the Insured,\" refers only to bodily injury that the insured in fact subjectively wanted (\"intended\") to be a result of his conduct or in fact subjectively foresaw as practically certain (\"expected\") to be a result of his conduct. [ Patrons-Oxford Mutual Ins Co v Dodge, 426 A2d 888, 892 (Me, 1981).]\n\nSee also Northwestern Nat'l Casualty, supra; Alabama Farm Bureau Ins v Dyer, 454 So 2d 921 (1984); Health Care \u0026 Retirement Corp v St Paul Fire \u0026 Marine Ins Co, supra; Vanguard Ins Co v Cantrell, 18 Ariz App 486; 503 P2d 962 (1972); MacKinnon v Hanover Ins Co, 124 NH 456; 471 A2d 1166 (1984); Rodriquez v Williams, 107 Wash 2d 381; 729 P2d 627 (1986). Thus, the finder of fact may exclude coverage either for actions in which the insured subjectively expected injury or loss or where the loss is the consequence of the insured's subjective intention both to the act itself and the resultant harm.11a\n\nC\n\nI concur with the statement in the lead opinion of the appropriate standard of review by this Court of the trial court's grant of declaratory judgment in favor of the insurer.12a Upon review of the lower court record, it is clear the trial court applied an objective standard of review to the instant exclusionary clause:\n\nThere appears to be a conflict [by panels of the Court of Appeals] whether there need be a specific showing of intent to injure regardless of which type of contract language is used.13a Faced with the choice of this conflict, this Court prefers the reasoning of Frankenmuth Mutual Ins Co v Kompus [135 Mich App 667; 354 NW2d 303 (1984)], and its progeny. The apparent intent of the policy language excluding coverage for intended or expected injury is to avoid the subjective analysis inherent in the question whether there was an actual intent to injure.\n\nAs the trial court below explicitly eschewed the application of a subjective standard of review, I would hold that the trial court must apply the standard espoused within this opinion. If there is a question of fact as to the intention or expectation on the part of the insured from a subjective standpoint, a grant either of a directed verdict or summary Disposition is clearly incorrect. Accordingly, I would affirm the result reached by the Court of Appeals and would remand the case to the trial court for reconsideration not inconsistent with this opinion.\n\nII. ALLSTATE INS CO v FREEMAN\n\nA\n\nI concur with the result reached in part III(B) of the lead opinion that the insurer had no duty to defend Alonda Freeman. In contrast to the exclusionary clause at issue in Metropolitan Ins Co v DiCicco, the instant exclusionary clause contains explicit language relating to the relevance of the reasonableness of the insured's actions and clearly dictates an application of an objective standard of review.14a\n\nB\n\nHowever, I respectfully Dissent from the Conclusion in the lead opinion that Allstate had no duty to defend Marshall Freeman.\n\nInitially, with regard to the analysis of the lead opinion in examining the underlying cause of action as determinative of the instant coinsured's entitlement to coverage, I disagree with the depiction of a cause of action of negligent entrustment constituting a derivative action. It is well settled that a cause of action for negligent entrustment is a separate cause of action in negligence for the defendant's failure to prevent dangerous instrumentalities from falling under the control of persons incapable of proper usage.15a See 2 Restatement Torts, 2d,  390, pp 314-318, and Prosser \u0026 Keeton, Torts (5th ed),  33, pp 197-203.\n\nHowever, irrespective of the action alleged against Marshall Freeman, the question here turns upon whether the instant exclusionary clause's reference to the acts of \"an insured person\" is clearly understandable and not subject to reasonable variances in interpretation so that a lay insured would equate the term \"an\" with \"any\" and would conclude that the acts of any person insured under the policy would serve to relieve the insurer from a duty to defend all the remaining insured individuals. Although I concur with the observation that this Court, in an examination of an insurance provision, should decline to create an ambiguity where none exists, unlike the lead opinion, I do not find that the provision is unambiguous as a matter of law and decline to adopt its Conclusion that \"an insured\" unambiguously means that coverage was excluded for damages caused by the intentional wrongful act of any insured (either Alonda or Marshall).16a\n\nThe lead opinion adopts the result found in Allstate Ins Co v Gilbert, 852 F2d 449 (CA 9, 1988), in support of its construction of the instant exclusionary clause. Gilbert, in turn, relied on Allstate Ins Co v Condon, 198 Cal App 3d 148, 153; 243 Cal Rptr 623 (1988), in determining that \"an insured\" refers to all insureds under the policy. The Condon court held:\n\n\"A person insured\" logically refers to any one of all the persons insured under the policy [as distinguished from \"the insured\" which refers only to a particular insured.] [ Id.]\n\nHowever, one year prior to the Gilbert decision, in American States Ins Co v Borbor, 826 F2d 888, 894 (CA 9, 1987), Judge Thompson, who wrote Gilbert, stated that \" American States intended that the wrongful act of any insured would void the policy, it could have unambiguously drafted and included such language in the contract.\" The result was that an innocent spouse was not excluded because of the intentional wrongdoing of her husband. The court reasoned that no uncertainty or ambiguity would have existed if the policy exclusion would have referred to \"any insured\" rather than \"an insured.\" Accordingly, the provision was construed in favor of the insured.17a\n\nOne year later in Condon, the California Supreme Court drew support from the California Insurance Code,  11580 (West Supp, 1988), which codified the definition of \"an insured\" as meaning \"any insured,\" in an attempt to construe the import of these modifiers.\n\nInsurance Code section 11580.1, subdivision (c)(8) provides another analogous definition. The section reads, in pertinent part:\n\n\"The term 'the insured' as used in paragraphs (1), (2), (3), and (4) shall mean only that insured under the policy against whom the particular claim is made or suit brought. The term 'an insured' as used in paragraphs (5) and (6) shall mean any insured under the policy . . . .\" Thus, \"an insured\" is defined as referring to all insureds under the policy, contrasted to one insured person when identified as \"the insured.\"\n\nIt is true the Allstate policy herein refers to \"a person insured.\" \"A\" and \"an\" are analogous modifiers; one or the other is used dependent upon whether the word it modifies begins with a consonant or a vowel sound. Words beginning with consonant sounds are properly modified by \"a.\" \"An\" is used to precede words beginning with vowel sounds. If Allstate had used the term \"an person insured,\" the policy provision would have been grammatically incorrect. Because proper grammar necessitated this deviation from the precise statutory language, for purposes of section 11580.1, subdivision (c), \"a person insured\" is the functional analog of \"an insured person.\" The Insurance Code thus defines \"a person insured\" as \"any person insured under the policy.\" [ Condon, supra at 153-154.]\n\nI find it instructive that the decision primarily relied upon by the lead opinion found it necessary to draw from an opinion which sought guidance from a comparable statutory provision in order to construe what is today characterized as unambiguous language. Accordingly, I would adhere to the admonition of the Borbor court that an insurer may void a policy by using appropriate language, i.e., \"any insured,\" in its policy exclusion. 826 F2d 894. If Allstate had meant \"any,\" it should have said \"any,\" not \"an.\" Rather than engage in an exercise in semantics, I find that \"an\" is not synonymous with \"any,\" and conclude that \"an insured\" should apply to Alonda Freeman alone. Thus, Marshall Freeman should not have been excluded under the terms of the policy's exclusionary clause.\n\nConclusion\n\nAccordingly, in Metropolitan Ins Co v DiCicco, I would affirm the result of the Court of Appeals, and would remand the case to the trial court for consideration of the action alleged against DiCicco pursuant to the subjective standard of review announced in this opinion. In Allstate Ins Co v Freeman, I would affirm the decision of the Court of Appeals denying coverage with regard to Alonda Freeman on the basis of an objective standard of review. However, I would reverse the decision of the Court of Appeals with regard to Marshall Freeman and remand the case to the trial court for consideration of the negligence action against him.\n\nCavanagh, J. (concurring in part and Dissenting in part).\n\nIn Metropolitan, I accept the Conclusion \"that Metropolitan Property and Liability Insurance Company has a duty to defend on these facts, although it may yet emerge that Metropolitan is not liable to indemnify DiCicco,\" for the reasons stated by my sister, Justice Boyle. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nIn Freeman, I accept the analyses and Conclusions of the majority in affirming the holding of the Court of Appeals with respect to Alonda Freeman, namely, that the exclusion precludes coverage for her intentional acts. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Yet, I do not agree with the majority that Allstate has no duty to defend Marshall Freeman. I write separately because I am convinced that the term \"an insured\" in the Allstate policy exclusion does not mean that Marshall Freeman's negligence liability is not covered simply because Alonda's liability for the same injury is excluded. Simple principles of insurance clause construction, which the majority accepts, naturally lead to this obvious Conclusion.\n\nMoreover, under the Allstate exclusion, the mere fact that the injury to Mary Kelly was caused by an excluded act (i.e., Alonda's act of intentionally shooting her) is not dispositive of the question of Allstate's duty to defend Marshall Freeman against allegations that he negligently entrusted a dangerous instrumentality to his wife, Alonda. The majority has found no authority that is clearly controlling, or persuasive, in reaching the Conclusion that Allstate has drafted an unambiguous exclusion.\n\nI\n\nTHE FACTS\n\nI accept the statement of facts set forth in the lead opinion in Allstate v Freeman. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e There are additional facts relating to Marshall's claim for coverage, however, that deserve mention. After the defendant, Mary Kelly, filed the original amended complaint for damages arising from Marshall's negligence on September 26, 1984, a second amended complaint was filed on March 15, 1985, which alleged in pertinent part:\n\nThat the defendant Marshall Freeman carelessly and negligently placed, allowed and/or permitted an illegal and unregistered pistol, fully loaded with bullets, to be assessable to his wife and defendant Alonda Freeman in their household, knowing said weapon was illegally purchased and possessed, unlawfully non-registered, fully loaded and that his wife and defendant Alonda Freeman had no training or skills in how to use said firearm; all harm caused plaintiff having been reasonably foreseeable by defendant Marshall Freeman having carelessly exercised unreasonable care in placing said illegal weapon in his household.\n\nThese pleadings adequately allege that Marshall Freeman violated a separate duty of care in allowing his wife to have access to a loaded firearm despite her lack of training or skills in how to use that dangerous instrumentality.\n\nII\n\nTHE ISSUE\n\nThe issue is whether Allstate has a duty to defend Marshall against the allegations that he negligently entrusted the firearm to Alonda, or otherwise was negligent in supervising the firearm, which she intentionally used to injure Mary Kelly.\n\nThe question presented requires this Court to determine the proper interpretation of an insurance contract which provides, in relevant part:\n\nLosses we cover:\n\nWe will pay all sums arising from the same loss which an insured person becomes legally obligated to pay as damages because of bodily injury or property damage covered by this part of the policy.\n\nWe may investigate or settle any claim or suit for covered damages against an insured person. If an insured person is sued for these damages, we will provide a defense with counsel of our choice, even if the allegations are not true. We are not obligated to pay any claim or judgment or defend any suit if we have already exhausted the limit of liability by paying judgments or settlements.\n\nExclusions -- Losses we do not cover\n\n1. We do not cover any bodily injury or property damage which may reasonably be expected to result from the intentional or criminal acts of an insured person or which is in fact intended by an insured person.\n\nThe lead opinion correctly states the two issues raised by Marshall Freeman under this policy language. Marshall has claimed:\n\nFirst, that Allstate has a separate and distinct duty to cover each insured under the policy, and, therefore, its duty to defend depends solely upon his conduct.\n\n, that the policy language, \"an insured,\" is ambiguous and, therefore, must be construed in favor of the insured. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nIII\n\nPROCEDURAL HISTORY AND ANALYSES OF COURTS BELOW\n\nThe trial court analyzed the defendants' negligence claim against Marshall as derivative of the claim against Alonda. In granting the plaintiff's motion for summary Disposition, the trial court found no duty to defend for the following reason:\n\nclaim itself, damages for Kelly's injury, was what triggered the exclusionary clause. Because the injury could reasonably be expected to result from Alonda Freeman's intentional act, regardless of intent to injure . . . the injury was not covered even if Marshall Freeman was negligent in leaving the weapon in the Freeman home. [160 Mich App 349, 352; 408 NW2d 153 (1987), summarizing the trial court's reasoning.]\n\nThe Court of Appeals affirmed, in a two to one decision. Judge Hood, writing for the majority, found that the plain language of the exclusionary clause makes Allstate's duty to defend Marshall on the claim of negligent entrustment solely derivative of the duty to defend Alonda. Id. at 357. The majority relied upon a rule for interpreting \"intentional acts\" exclusionary clauses that was stated in general terms, rather than being rooted in the language of the exclusionary clause of the Allstate policy:\n\nan insurance policy exclusion precludes coverage for the particular injury, then it also excludes coverage for negligent entrustment of the instrumentality that caused the injury. In other words, we look to the underlying cause of the injury to determine coverage and not to the specific theory of liability alleged in the complaint. Illinois Employers Ins of Wausau v Dragovich, 139 Mich App 502, 507; 362 NW2d 767 (1984); Shepard Marine Construction Co v Maryland Casualty Co, 73 Mich App 62, 65; 250 NW2d 541 (1976) . . . Michigan Mutual Ins Co v Sunstrum, 111 Mich App 98; 315 NW2d 154 (1981), lv den 414 Mich 890 (1982). [ Id. at 357-358.]\n\nJudge Theiler, in his Dissenting opinion, found the term \"an insured\" to be ambiguous. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e We granted leave to decide, inter alia, the validity of Marshall's claim that he is entitled to be defended against the claim of negligent entrustment. 430 Mich 857 (1988).\n\nIV\n\nMETHOD OF CONTRACT INTERPRETATION\n\nThe lead opinion has stated a method of interpreting the insurance contract clause at issue that is the prevailing law, but yet does not apply those very same principles. Thus, it is useful to state those established rules of insurance contract interpretation at the outset because they ought to be adhered to in deciding this case.\n\nFirst, the lead opinion concludes that the exclusion focuses on \"bodily injury,\" yet it accepts that this is rendered ambiguous if \"an insured\" can be read to mean both the named insured and any insureds. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Second, we agree in the abstract on the rules of construction that must guide our interpretation of the policy exclusion at issue here. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Third, the lead opinion accepts that the principles of insurance contract construction applied by this Court in the context of an automobile accident policy, see Powers v DAIIE, 427 Mich 602, 623-631; 398 NW2d 411 (1986), also apply in the present case. See also Raska v Farm Bureau Mutual Ins Co, 412 Mich 355, 363; 314 NW2d 440 (1982). \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Finally, we are in agreement on the following specific rules of construction under which we must interpret the Allstate \"intentional acts\" exclusion. These principles are that (1) exclusions are strictly construed against the insurer, because (2) the policy must \"make clear\" the exclusion, and, as a consequence, (3) the insurer must accept a liberal interpretation that favors the insured where it could have employed a plainer and more generous use of words that would have removed the ambiguity. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nV\n\nANALYSIS: DOES THE ALLSTATE POLICY CLEARLY EXCLUDE COVERAGE FOR NEGLIGENT ENTRUSTMENT BY AN INNOCENT COINSURED SPOUSE?\n\nA. INTRODUCTION\n\nI now reach the central issue, whether Allstate has unambiguously excluded Marshall's negligent entrustment liability under the above definition. The majority has found no ambiguity in the Allstate \"intentional acts\" exclusion and has put forth, as an incontrovertible fact of English grammar and usage, the argument that the term \"an insured\" necessarily refers to all insureds. I disagree with this Conclusion. The plain meaning of the term \"an insured\" unambiguously means both \"any insured\" and \"the named insured.\" Indeed, the indefinite articles \"a, an,\" and \"the\" all may be used before \"insured\" to mean either all the insureds or the one insured. Therefore, the Court must construe the ambiguity -- that arises from the two plausible meanings that these indefinite articles create when they modify the term \"insured\" -- liberally in favor of the insured.\n\nB. THE TERM \"AN\" INSURED IS AMBIGUOUS\n\nThe meaning of the indefinite article \"an\" is ambiguous under accepted rules of English grammar and usage. \"An\" is the indefinite article sometimes used in the place of \"a.\" \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e The term \"an insured\" is ambiguous according to a technical, as well as a common-sense, meaning of the term read in the context of the Allstate policy exclusion. This ambiguity is inherent in the use of the indefinite article \"an\" before a noun which creates a problem of interpretation since it gives the noun potentially two different meanings.\n\nThe definition of the word \"an\" in Black's Law Dictionary (5th ed) demonstrates why this indefinite article (which is in the family of adjectives) has this effect:\n\nThe word \"a\" has varying meanings and uses. \"A\" means \"one\" or \"any,\" but less emphatically than either. It may mean one where only one is intended, or it may mean any one of a great number. It is placed before nouns of the singular number, denoting an individual object or quality individualized, article \"a\" is not necessarily a singular term; it is often used in the sense of \"any\" and is then applied to more than one individual object . . . the meaning depends on context. [Citations omitted.]\n\nGiven the above definition of the word \"an,\" it is clear that the Allstate \"intentional acts\" exclusionary clause is reasonably susceptible of two different meanings. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe term \"an insured\" is ambiguous in the context of the Allstate exclusion because it can be taken to mean either the named insured or all insureds. Thus, an ordinary layman of average intelligence could easily read the Allstate exclusion as follows:\n\nLosses We Cover:\n\nWe will pay sums arising from the same loss, which a named insured person becomes legally obligated to pay as damages because of bodily injury or property damage covered by this part of the policy.\n\nExclusions:\n\nWe do not cover bodily injury or property damage which may reasonably be expected to result from the intentional or criminal acts of a named insured person (who commits those acts) or which is in fact intended by that named insured.\n\nIn light of this ambiguity, I must Dissent. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nI have chosen not to follow the analyses of the cases cited in the lead opinion which contain language similar to the Allstate policy. See ante, pp 693-699, citing and discussing two cases, Allstate Ins Co v Condon, 198 Cal App 3d 148, 152; 243 Cal Rptr 623 (1988), and Allstate Ins Co v Gilbert, 852 F2d 449 (CA 9, 1988). These cases hold that the term \"an insured\" is unambiguous. The analysis in these two cases is simply not persuasive, and this Court is not required to follow it. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e These courts simply have not adhered to the concept that an ambiguity must be found where a phrase has more than one plausible meaning when read according to accepted rules of English usage.\n\nC. THE AMBIGUITY IN THE TERM \"AN INSURED\" CAN BE SEEN BY READING THE CONTRACT AS A WHOLE\n\nI disagree with the majority for the additional reason that it fails to look at the insurance policy as a whole. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Allstate, as drafter of this policy, chose to clarify that the meaning of the term \"insured\" in its third exclusion should be understood in the plural sense. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e The \"intentional acts\" exclusion that we must interpret, however, is not similarly clear in its meaning. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThe insurer's failure to insert \"any\" before \"insured\" in the \"intentional acts\" exclusion indicates that the insurer intended \"any insured person\" and \"an insured\" to have different meanings. We must read the policy as a whole to determine the intent of the parties -- at least insofar as it can be ascertained from the language of the contract. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nD. THE INSURER COULD USE PLAIN LANGUAGE TO CLEARLY EXCLUDE FROM COVERAGE MARSHALL'S NEGLIGENT ENTRUSTMENT LIABILITY\n\nThe term \"an insured\" could have been made unambiguous if Allstate had included a separate definition of that term, making it clear that the noun it modifies (insured) refers to any named insured. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Conversely, if Allstate had used the term \"the insured\" to achieve the necessary clarity, then Marshall's negligent entrustment liability would clearly be covered under the policy and not within the scope of the exclusion. In Unigard Mutual Ins Co v Spokane School Dist, 20 Wash App 261; 579 P2d 1015 (1978), the Court stated the accepted view, namely,\n\ncoverage and exclusion is defined in terms of \"the insured,\" courts have uniformly considered the contract between the insurer and several insureds, to be separable, rather than joint, i.e., there are separate contracts with each of the insureds. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIf the Allstate exclusion used the term \"the insured,\" the insurer could argue that this term refers to all insureds. This grammatical argument is supported by the theory that \"a, an, and the\" are all articles which render the noun they modify subject to two potential meanings. At least one learned jurist has relied upon this argument, lending support to the common-sense notion that even the term \"the\" can create ambiguity in the noun it modifies. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e If this argument were made by the insurer, however, it would fail because the insurer must clearly and unmistakably exclude negligent entrustment claims from its broad liability insurance contract. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nThus, the insured will not always win in claiming coverage under the intentional acts exclusion. If Allstate had merely added \"y\" to the word \"an,\" to give us \"any insured,\" then Marshall's negligence liability would clearly be excluded. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e In sum, Allstate has failed to unambiguously exclude negligent entrustment liability of an innocent co-insured spouse, such as Marshall Freeman, either in its broad coverage provision or in the \"intentional acts\" exclusion.\n\nVI\n\nTHERE IS NO CONTROLLING PRECEDENT THAT REQUIRES THE TERM \"AN INSURED\" TO BE READ ONLY TO MEAN ALL INSUREDS\n\nThe majority relies primarily upon cases that have interpreted the meaning of motor vehicle exclusions in general liability insurance contracts. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e These cases do not stand for any general principle applicable to the construction of the Allstate \"intentional acts\" exclusion for the obvious reason that they construe the meaning of different contractual language. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nTo decide this case, the majority has extracted a principle from these cases that is totally inapposite to the particular language of the Allstate \"intentional acts\" exclusion:\n\nan insurance policy exclusion precludes coverage for the particular injury, then it also excludes coverage for negligent entrustment of the instrumentality that caused the injury. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nAny such abstract rule, which runs contrary to our established rules of contract interpretation, must be rejected for the reasons stated by Justice Boyle:\n\nthe duty to defend, like the duty to indemnify, is contractual, any delineation of the scope of the duty to defend without reference to the policy itself must be viewed as a mere generality. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nBut, assuming the validity of the abstraction arguendo, the analysis the majority relies upon is flawed on its own terms. The language of the Allstate policy differs dramatically from the provisions of the homeowner's liability policies from which the majority gleans the above abstract rule of insurance contract exclusion clause interpretation. Given the plain and obvious differences of language between the Allstate \"intentional acts\" exclusion and the exclusions construed by the cases on which the majority relies, it is apparent that these precedents are inapplicable. The coverage dispute involved here is conceptually and linguistically distinct from the issue courts have faced in construing the motor vehicle exclusionary clauses. The Allstate policy excludes bodily injury related to acts of an insured on the basis of the state of mind of a person committing those acts. Yet, the language of the exclusion leaves it unclear whether the negligence of a coinsured is covered when that negligent act is a cause of injury, but there is a concurrent cause of the same injury traceable to the intentional act of another insured (whose acts are clearly excluded).\n\nThose cases involve claims by insureds who seek coverage for negligent entrustment of an automobile, despite the existence of a motor vehicle exclusion in the general liability policy. They present an issue of contract interpretation that is conceptually distinct from the issue in this case. The issue there is whether the motor vehicle exclusion can be interpreted as unambiguously excluding all injury that is in any way causally related to the use of an inanimate object (i.e., a motor vehicle), or whether it also can be viewed as not excluding injuries caused by the loaning or negligent entrustment of the vehicle. See West American Ins Co v Hinze, 843 F2d 263, 267-268 (CA 7, 1988) (holding that the negligent supervision of a child is not within the scope of the motor vehicle exclusion clause because no negligent acts were committed in the handling of, or with respect to, the excluded instrumentality).\n\nBy contrast, the \"intentional acts\" exclusion relates to injury that is the product of the acts of one particular insured whose behavior is of a certain type (i.e., is intentional). Thus, we must interpret an exclusion that does not clearly spell out whether all injury is excluded from coverage when the injury is caused both by the intentional acts of one insured and by the merely negligent acts of another.\n\nThe key difference between the two exclusions is that the motor vehicle exclusions clearly exclude all negligence liability related to the use of the motor vehicle. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The \"intentional acts\" exclusion, by contrast, does not plainly exclude any negligence liability.\n\nOnly by a strained construction of the exclusion that gives priority to one of two possible interpretations of the term \"an insured,\" can one arrive at the Conclusion that negligent entrustment liability is excluded from coverage. Thus, I am unpersuaded by the majority's reliance upon the motor vehicle exclusion cases to support the Conclusion that Allstate has no duty to defend Marshall against the claim of negligent entrustment. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\n\nThus, derivative liability theory upon which the majority relies, \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e namely, that Allstate's duty to defend Marshall is derivative of its duty to defend Alonda, is plainly inapplicable here. Therefore, the cases cited in support of that theory would not control, even if they could be applied to decide this case under the derivative theory. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nWe must also keep in mind that the first issue is whether Allstate has a duty to defend Marshall Freeman. When interpreting the Allstate policy, we must attempt to discern what meaning would serve the broader purposes of the policy. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Judge Wahls, in his Dissent in Dragovich, \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e indicates why the language of insurance liability policies, such as the Allstate homeowner's policy here, often create a duty to defend that is broader than the duty to indemnify. Allstate, as drafter of the policy, has clearly intended to create a broad duty to defend. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nUnder this broad duty, Allstate has a clear obligation to defend Marshall Freeman against the allegations by Mary Kelly that he negligently entrusted his wife with a dangerous instrumentality. The pleadings clearly imply facts that would make Allstate liable under its duty to indemnify. Thus, the duty to defend in this case extends at least up to the point of summary judgment, since facts might be available that would establish coverage during the process of discovery. Dragovich, supra at 508 (Wahls, J., Dissenting). \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e I would apply the approach that Judge Wahls followed to the case at bar. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nAllstate has provided contractually a broad \"all risk\" form of coverage for a homeowner's liability, and cannot now attempt to exclude coverage for precisely the kind of negligent claims that it is designed to cover. The exclusionary clause language not only is ambiguous, but it conflicts with a broad coverage provision. This is an easy case since ambiguities in a policy exclusion are to be construed in favor of the insured -- especially where there is a broad duty to defend provision in the policy.\n\nVII\n\nConclusion\n\nThe issue in this case must be decided in reliance on principles of contract interpretation alone. By following established principles of insurance contract interpretation this Court should reach the Conclusion that the Allstate policy covers Marshall's negligent acts.\n\nThe alternate rationale upon which the majority relies, namely, that Allstate's duty to defend Marshall is derivative of its duty to defend Alonda, is unpersuasive on its merits. To accept Allstate's view, that Marshall's coverage is purely derivative of Alonda's intentional or other tort liability, would be incorrect as a matter of tort law (as well as under rules of contract interpretation). \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\nThe tort of negligent entrustment focuses on a different type of conduct than Allstate sought to exclude by the language of its exclusionary policy. \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Thus, I must conclude that Marshall's negligent entrustment liability is a separate and independent source of tort liability not clearly excluded by the Allstate policy. At least under this policy, \"Allstate has a separate and distinct duty to cover each of the insureds . . . .\" \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Since I conclude that Allstate has a duty to defend Marshall Freeman against Mary Kelly's second amended complaint, I too \"would reverse the decision of the Court of Appeals with regard to Marshall Freeman, and remand [ Allstate Ins Co v Freeman ] to the trial court\" to consider the issue of Allstate's duty to defend Marshall Freeman against the allegations of negligence. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\n\nLevin, J. (concurring in part and Dissenting in part).\n\nIn Metropolitan, I join with Justices Cavanagh, Boyle, and Archer in concluding that the insurer had a duty to defend DiCicco and in affirming the decision of the Court of Appeals reversing the trial court's decision granting summary Disposition to the insurer.\n\nIn Allstate, I agree with Justices Cavanagh and Archer that the Court of Appeals erred in affirming the trial court's summary Disposition in favor of Allstate on the issue whether it was under a duty to defend or indemnify Marshall Freeman.\n\nI write separately because there was a genuine issue of material fact on the question whether Alonda Freeman acted intentionally or criminally and, more specifically, whether she shot Mary Helen Kelly in valid or mistaken self-defense.1b\n\nI\n\nThe lead opinion states in a footnote that the signers \"are not persuaded by Alonda Freeman's characterization that she acted in self-defense\"2b and, after reviewing the testimony of Alonda Freeman and Mary Helen Kelly, that the Court of Appeals correctly concluded that the trial court properly rejected the claim of self-defense. The lead opinion quotes the statement in the opinion of the Court of Appeals that \"'there is still no dispute that pointed a loaded gun in the direction of Kelly and fired it at close range.'\"3b\n\nAlonda Freeman testified on deposition that Mary Helen Kelly said \" bitch, I'm tired of y'all fucking with me. I'm going to put an end to it. I'm going to kill you bitch, and your kids. At this point, she leaped off her porch and began coming towards my home. She was still hollering and screaming that she was going to kill me.\"\n\nAlonda Freeman further testified that Kelly \"kept on coming. At this point, my kids were screaming and hollering. She was still hollering, that she was going to kill us.\" Freeman went into a cabinet in her kitchen and removed a gun. Freeman's \"kids were screaming and hollering, even worse. She was coming and she was going to kill us. I could still hear her hollering, she was going to kill us. When I returned back to the door, she was all the way in my walkway, like a foot from my porch. She went to do like this, as if she was going to step on my porch with her foot up and I shot her.\"\n\nFreeman said her state of mind was that she was defending herself \" my children. My everything. As I said, she stated she would kill me and my children.\"\n\nIn response to the question whether Kelly was armed with any weapon, Freeman said \" she leaped off her porch, she did have something in her hand. Now, what happened to it, between her house and my house, I lost sight of it, because I was really focusing on one point.\" When Kelly stepped on the porch, her fists were \"balled up, clenched\" and she was \" and hollering.\" Freeman fired when Kelly was between three and five feet away.\n\nIn response to the question whether when she fired she was trying to get away from Kelly, Freeman responded \" so trying to get away from me. Trying to defend me and my children, to keep her from killing us, which she stated she would do.\"\n\nKelly was hit in the right shoulder. Freeman said she \"didn't intend for it to hit any certain place.\"\n\nII\n\nThe inquiry on the motion for summary deposition was not whether the members of this Court would be persuaded by Alonda Freeman's characterization that she acted in self-defense or even whether, if the Justices were sitting as triers of fact, we would be so persuaded, but whether any reasonable juror might be so persuaded. Questions of credibility are, of course, for the jury and not for the court.\n\nThere was a genuine issue of material fact on the question whether Alonda Freeman acted in self-defense.\n\nIII\n\nIn Transamerica Ins Group v Meere, 143 Ariz 351, 356; 694 P2d 181 (1984), the Supreme Court of Arizona, construing an exception in public liability coverage for injury \"which is 'expected or intended' by the insured,\" said that the\n\nprinciples of contractual \"intent\" and public policy coincide; the provision [the exception from coverage] is designed to prevent an insured from acting wrongfully with the security of knowing that his insurance company will \"pay the piper\" for the damages. That design is not served by interpreting the provision to exclude coverage in self-defense situations where the insured is not acting by conscious design but is attempting to avoid a \"calamity\" which has befallen him.\n\nThe court continued:\n\nis evidence from which the finder of fact may decide that Meere was confronted with a risk over which he had little control. His blow may not have been the result of a cognitive process, and his action may not have been \"voluntary.\" Although his act was intentional, and its natural consequence was to cause injury, his basic desire or purpose may not have been to injure. . . .\n\nSubstantial authority supports such an analysis. The Nebraska Supreme Court, after analyzing a number of cases concluded:\n\n\"The cases, as evidenced by those already cited, point out that when one acts in self-defense the actor is not generally acting for the purpose of intending any injury to another but, rather, is acting for the purpose of attempting to prevent injury to himself. It can easily be said that such act, though resulting in bodily injury to another, was neither expected nor intended within the terms of the policy . . . . An injury resulting from an act committed by an insured in self-defense is not, as a matter of law, an expected or intended act . . .\"\n\nAllstate Insurance Company v Novak, 210 Neb 184, 192-93; 313 NW2d 636, 640-41 (1981); see also Patrons-Oxford Mutual Insurance Co v Dodge [426 A2d 888 (Me, 1981)]; Farmers Insurance Exchange v Sipple, 255 NW2d 373 (Minn, 1977); Hanover Insurance Group v Cameron, 122 NJ Super 51; 298 A2d 715 (1973).4b [ Id., pp 358-359. Emphasis in original.]\n\nIV\n\nAlonda Freeman was convicted following a bench trial of the misdemeanor of discharging a firearm intentionally but without malice resulting in injury.5b There is a substantial body of authority that conviction of the insured of having committed a criminal offense in respect to the incident for which public liability insurance coverage is sought, does not necessarily establish that an injury resulting from commission of the offense was intended or expected by the insured.6b\n\n\u003cspan class=\"fn\"\u003e1. Apparently, Justice Boyle believes that we inadvertently referred to the issue in the instant case as \"whether Metropolitan has a duty to indemnify,\" and not \"whether has a duty to defend.\" Post, p 701. On the contrary, we specifically distinguished the two concepts in section I. Therefore, because we hold that Metropolitan has no duty to defend in the instant case, it necessarily follows that this finding obviates its duty to indemnify DiCicco. On the other hand, if we had held that Metropolitan had a duty to defend, then it would be incorrect to refer to Metropolitan's duty to defend or indemnify.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. 430 Mich 857 (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Justice Cavanagh incorrectly assumes that we cite Powers for the proposition that we should apply the broad rules of construction of an automobile liability policy under the no-fault act in the instant case. Post, p 742. On the contrary, we cite Powers simply for the proposition that ambiguity should be construed in favor of the insured.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The provision entitled \"Section II Coverages,\" provided, in pertinent part: \"Metropolitan will pay on behalf of the insured all sums which the insured shall become legally obligated to pay as damages because of bodily injury sustained by other persons or property damage, to which this insurance applies, caused by an occurrence.\" Likewise, the definitional section defined an \"occurrence\" as an \"accident . . . which results . . . in bodily injury.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The Metropolitan definition of \"occurrence\" differs from numerous others which include the exclusionary language in the Metropolitan policy within their definition of \"occurrence.\" The two clauses differ because the Metropolitan policy does not include the \"bodily injury . . . expected or intended\" language. Courts have also interpreted this clause as clear and unambiguous under Michigan law. Bigelow-Liptak Corp v Continental Ins Co, 417 F Supp 1276 (ED Mich, 1976). But see Patrons-Oxford Mutual Ins Co v Dodge, 426 A2d 888 (Me, 1981); Quincy Mutual Fire Ins Co v Abernathy, 393 Mass 81; 469 NE2d 797 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The coverage provision also requires \"bodily injury sustained by other persons.\" However, neither party contends that Gravenmier suffered bodily injury as a result of the stabbing incident, thereby satisfying the \"bodily injury\" requirement of \"occurrence.\" We agree and need not address this issue further.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Shelter Mutual Ins Co v Bailey, 160 Ill App 3d 146, 157-160; 112 Ill Dec 76; 513 NE2d 490 (1987); Mid-America Fire \u0026 Marine Ins Co v Smith, 109 Ill App 3d 1121; 65 Ill Dec 634; 441 NE2d 949 (1982).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. As the American States court found:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe term \"occurrence\" includes an \"accident.\" Accident has often been defined by courts according to common usage. Black's Law Dictionary 14 (5th ed. 1979) defines accident as: \" fortuitous circumstance, event, or happening; an event happening without any human agency, or if happening wholly or partly through human agency, an event which under the circumstances is unusual and unexpected by the person to whom it happens; an unusual, fortuitous, unexpected, unforeseen or unlooked for event, happening or occurrence; an unusual or unexpected result attending the operation or performance of a usual or necessary act or event; chance or contingency; fortune; mishap; some sudden and unexpected event taking place without expectation, upon the instant, rather than something which continues, progresses or develops; something happening by chance; something unforeseen, unexpected, unusual, extraordinary or phenomenal, taking place not according to the usual course of things or events, out of the range of ordinary calculations; that which exists or occurs abnormally, or an uncommon occurrence.\" [ American States Ins Co, 587 F Supp 1552.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Similarly, we reject DiCicco's argument that we must focus solely upon the words \"caused intentionally\" in the Kompus definition.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See, generally, 10 Couch, Insurance, 2d (rev ed),  41:7 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The Metropolitan policy differs from similar policies which have included the present exclusion within the definition of occurrence. Cases involving this clause have generally focused upon the \"expected or intended\" portion of the definition. In our opinion, these cases, by implication, also broadly defined the \"accident\" section of \"occurrence.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. However, under the authority of Kompus and Cannon, we do not preclude the possibility that an incident may not be considered an \"occurrence\" under the coverage section of the policy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See, generally, State Auto Mutual Ins Co v McIntyre, 652 F Supp 1177 (ND Ala, 1987); 31 ALR4th 957; 7A Appleman, Insurance Law \u0026 Practice,  4492 et seq.; 12 Couch, Insurance, 2d (rev ed),  44:285 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. As an Illinois appellate court stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe policy in this case did more than exclude intentional injuries. It excluded coverage for liability for bodily injury or property damage \"which is either expected or intended from the standpoint of the insured.\" . . . these two words \"intended\" and \"expected\" cannot be treated as synonymous since if they were there would be no reason for the insurer to have modified the insurance clause by adding the word \"expected.\" Even where the damages are not accomplished by design or plan (not intended), they may be of such a nature that they should have been reasonably anticipated (expected) by the insured. [ Freyer, supra at 620.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. We also take into account the fact that \"expected\" requires a lesser degree of proof than \"intended.\" Bay State Ins Co v Wilson, 96 Ill 2d 487, 492-494; 71 Ill Dec 726; 451 NE2d 880 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Similarly, our decision today is supported by at least one other Court of Appeals decision. Michigan Millers Mutual Ins v Berry, 123 Mich App 634; 333 NW2d 70 (1983). See also Cannon, supra at 33-34. In Berry, supra at 640, after the Court held that the insured intended his actions, it also stated that \"the exclusionary provision at issue in this case [the same as the present case] did not require a finding of intent. Coverage was excluded based on the undisputed evidence that Robertson expected the property damage which occurred.\" (Emphasis added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. We emphasize that under our holding today, even if the trial court does not preclude coverage for \"intended acts which result in natural, foreseeable, expected, and anticipated injuries,\" it may also preclude coverage under the exclusion for injuries which satisfy this Court's definition of \"expected injuries.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Justice Boyle attempts to distinguish McGinnis and Smith on the ground that they involved the interpretation of a provision which excluded coverage for \"expected or intended\" injuries, without reference to the \"standpoint of the insured.\" However, a more careful review of these cases reveals that they involved precisely the same exclusionary provision as in the instant case. The Dissent in Smith noted that it was interpreting the same provision as in Talley v MFA Mutual Ins Co, 273 Ark 269, 271; 620 SW2d 260 (1981), which excluded coverage for \"'bodily injury . . . which is either expected or intended from the standpoint of the insured.'\" Thus, these cases actually reinforce the proposition that we must focus our interpretation on the \"expected or intended\" language of the exclusion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Justice Boyle contends that this characterization of fight enlarges the trial court's findings or construes the record most favorably toward the insurer. The parties submitted the instant declaratory judgment action upon the briefs, deposition and preliminary examination testimony. Granted, we took the \"liberty\" to review and rely upon those same documents that the trial Judge based his findings of fact upon. However, in no way did our \"summarization\" of the record distort what actually happened between DiCicco and Gravenmier. Rather, in reviewing the preliminary examination testimony of Gravenmier, we find that the above recitation of facts is well supported:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Would you take the knife here, exhibit number one, and show us exactly how he was holding it when you came back to his doorway?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. He was holding it approximately like this, down with the blade, the sharp edge towards his body.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. The blade was extended then ?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes. He extended it, I was not sure if it was with the left or right hand. He had it extended by the time I was close.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. I see. So, you actually watched him extend the blade?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes, pretty close, I can't recall that well.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Okay. And, as you were approaching him is when he extended the blade?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Okay. Then you have indicated, for the record, that he was holding with the blade facing him and the point of the blade to his left, is that right?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes. He had held it pretty close to his belly.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. He was holding it close to him, himself?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Did he say anything about the fact that he had a knife in his hand?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. No, he did not.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Was it -- was it obvious to you that he had the knife in his hand?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Okay. And, then you continued to approach him and did what?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. I told him that was one of the last things that he needed to do and if he was stupid enough to and it was really stupid and if he was stupid enough here is my gut, you got the knife go ahead. And, I raised my hands and nothing happened.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. You were pretty close to him at that point?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Within two feet.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. What happened after you -- after you said that to him?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. He just kept saying \"don't mess with me, don't fuck with me, I don't want to take anymore of your shit,\" kept poking his finger into my chest and pushed me a couple of times and I was up against the wall in this round, he just turned me around literally.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Okay. You became -- your back became up against the wall that was on . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. . . . in between room doors.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Okay. The wall was on the same side of the hallway as your room and his room?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. And, he is poking you with, I take it, his left hand at that point because he has the knife in the other hand ?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. I don't know. I am pretty sure it was his right hand that he was poking with.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Okay. Well, he was poking with one hand and had the knife in the other, anyways.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes, um-hum.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. And, with one hand he got you up against the wall ?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes, with the other he was flashing the knife about.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. And, during this period of time you were not -- what were you doing, if anything, physically to him?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Nothing. I was -- I just kept backing up.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. At the time -- let's go back to the point and time where you stated that you were two feet away from him and told Dave \"look, you don't need to do that, that is a stupid thing to do\" or words to that effect.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. All right. He was standing in his doorway, is that correct?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. And, you were standing, obviously, in the hallway?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Now, down the hall to your right is Graham and Cindy, is that right?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. And, the way that you were going to exit the . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. . . . yes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. What is down to your left, is it -- your room is down there, right?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. And, is there an exit down that way to?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Two more doors and then there is a stairway.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. Okay. This is also an exit that was opened at the time this event happened?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. Yes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eQ. What happened after he had you up against the wall then ?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA. He was pushing me and he put his left arm against my chest a couple of times just pushing me back and was flashing the knife around my face and around my body and across. Most of the time I kept straight so I can't recall all of the places the knife went. [Emphasis added.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Alonda Freeman alleged that she acted in self-defense. While we recognize that there is conflicting testimony as to who started the argument and the precise nature of what each person said, we are not persuaded by Alonda Freeman's characterization that she acted in self-defense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eKelly claimed that Alonda came out of her home and began swearing at Kelly. Although she began walking towards the Freemans' house, Kelly alleged that she did not make any threats and never encroached upon the Freemans' property. Rather, Alonda, went into her home, got the handgun, came back out, and shot Kelly.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhereas, Alonda claimed that Kelly began the argument. Further, she stated that Kelly threatened to kill Alonda and her children. Kelly began walking toward the Freemans' house. Alonda went into the house, retrieved the handgun, and reappeared on her front porch. Alonda testified that she fired after Kelly allegedly lunged at Alonda. Although Alonda first thought Kelly held an object in her hands, she stated that she did not see anything when she pulled the trigger.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOur review of the testimony persuades us that the Court of Appeals was correct in concluding that upon the basis of the evidence and testimony presented, the trial court properly rejected Alonda Freeman's claim of self-defense. As the Court of Appeals stated:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn reviewing a grant or denial of summary Disposition under MCR 2.116(C)(10), this Court considers the pleadings, affidavits, depositions, admissions and other documentary evidence available to it and gives the benefit of any reasonable doubt and views the evidence in a light most favorable to the party opposing the motion. Wright, [ supra at 646.] Considering the evidence under these standards, we must nonetheless reject the Freemans' self-defense argument. . . . is still no dispute that she pointed a loaded gun in the direction of Kelly and fired it at her at close range. [ Freeman, supra at 352-353.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Neither party contends that the coverage section of the policy applies in this case. That section provided in pertinent part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eLosses We Cover\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe will pay all sums arising from the same loss which an insured person becomes legally obligated to pay as damages because of bodily injury or property damage covered by this part of the policy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe may investigate or settle any claim or suit for covered damages against an insured person. If an insured person is sued for these damages, we will provide a defense with counsel of our choice, even if the allegations are not true. We are not obligated to pay any claim or judgment or defend any suit if we have already exhausted the limit of liability by paying judgments or settlements.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe do not address the applicability of the exclusion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The exclusion also excludes coverage for injuries actually intended. This case does not implicate this portion of the exclusion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. However, Marshall Freeman argues that the policy is ambiguous as it applies to him. We address this issue in section III(C) of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Similarly, we also agree with the Court of Appeals that Alonda Freeman's conviction in the criminal case for discharging a firearm intentionally but without malice satisfies the \"criminal conduct\" aspect of the first element of the exclusion. MCL 750.235; MSA 28.432. Allstate Ins Co v Talbot, 690 F Supp 886 (ND Cal, 1988) (conviction of child molestation constituted criminal acts specifically excluded from coverage under the identical policy involved in this case). A criminal conviction is admissible in a declaratory action in order to determine whether an insurer has a duty to defend and indemnify. Transamerica Ins Co v Anderson, 159 Mich App 441, 444-445; 407 NW2d 27 (1987); Yother, supra at 134.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. We also rejected this argument in DiCicco, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Similarly, we also agree with the Court of Appeals in distinguishing Shelby Mutual Ins Co v United States Fire Ins Co, 12 Mich App 145; 162 NW2d 676 (1968), from Sunstrum, on the ground that liability in Shelby arose from an independent and statutorily imposed duty. As the Shelby Court stated: \" Here the parents are liable because of the statute which becomes operative on account of the maliciously destructive act of the child, independent of the means the child employed to cause the destruction.\" Id. at 150 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Conversely, we also find equally instructive cases which have distinguished \"the insured\" from \"an insured\" and \"any insured.\" Allstate Ins Co v Green, 831 F2d 145, 147 (CA 6, 1987); Safeco Ins Co of America, Inc v McKenna, 90 NM 516; 565 P2d 1033 (1977); Pawtucket Mutual Ins Co v Lebrecht, 104 NH 465; 190 A2d 420 (1963); Borbor, supra at 894; Aponaug Mfg Co, supra at 674.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Specifically, the complaint alleged \"Margaret negligently cared for and supervised [the minor], and that Margaret was negligent in failing to take steps to prevent Albert's acts of sexual molestation upon [the minor] when she knew that he had a propensity for committing, and intended to commit such acts.\" Gilbert, supra at 450 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The language arose out of  533 of the California Insurance Code. California courts interpret the insurance code as if it were an exclusion in an insurance policy. Therefore, the Borbor court's analysis of \"the insured\" is applicable in the present case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The Dissent notes that the Court of Appeals for the Ninth Circuit issued Gilbert and Borbor within one year of each other and that Judge Thompson wrote the opinion of the court in both cases. If Judge Thompson intended to restrict the Gilbert decision as argued by the Dissent in the instant case, then we assume he easily could have done so.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Similarly, we disagree with Justice Cavanagh's Conclusion that the exclusion in the Allstate policy \"is reasonably susceptible of two different meanings\" on the basis of the definition of the word \"an\" in Black's Law Dictionary. Post, p 744. This statement is misleading and incorrect. Justice Cavanagh cites the definition of \"a\" and not \"an,\" which suggests his recognition that the definition of \"an\" contradicts his position. \"The English indefinite article, equivalent to 'one' or 'any' . . . .\" Black's Law Dictionary (5th ed), p 77. By contrast, the definition of \"the\" states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAn article which particularizes the subject spoken of. \"Grammatical niceties should not be resorted to without necessity; but it would be extending liberality to an unwarrantable length to confound the articles 'a' and 'the.' The most unlettered persons understand that 'a' is indefinite, but 'the' refers to a certain object.\" [ Id., p 1324.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Accordingly, we also reject the defendant's contention that \" Allstate had meant 'any,' it should have said 'any,' not 'an.'\" Post, p 736. The Condon court rejected this argument as it stated, \"because 'any person insured' would have been a more precise term to describe an exclusion designed to cover all persons under the policy, we are required to construe the exclusionary clause in favor of the Condons. This contention is without merit.\" Id. at 154. We agree.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCONCURRING FOOTNOTES\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 It is of course, premature to consider indemnification on these facts, since no liability has yet been found on the part of DiCicco in the underlying claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 It is unfortunate, given the contractual nature of this question, that the answer has failed to incorporate the entire policy in its pleadings as now required under the court rules. See MCR 2.113(F). Cf. GCR 1963, 113.4. See also 1 Martin, Dean \u0026 Webster, Michigan Court Rules Practice, R 2.112, comment 5, p 243. This declaratory judgment action was filed prior to the effective date of the Michigan Court Rules. We are deciding this question only on stipulated portions of the policy. In so deciding the question before the Court, we of course take no position as to whether additional language in other policies may distinguish the duty to defend in subsequent cases.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 As observed in the practice pointer of one commentator:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhile generally a liability policy is thought of as providing coverage, or indemnity for a judgment against the insured, it has been emphasized that the liability insurance policy is \"litigation insurance\" as well, protecting the insured from the expense of defending suits brought against him. By clear and unequivocal language in most policies, the insurer has assumed the obligation of relieving its insured of the expense of defending an action alleging and seeking damages within the coverage policy . . . . Thus, the insured should reasonably expect that the insurer will employ its vast legal and investigative resources to defeat the action for the mutual benefit of both the insurer and the insured.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt has been noted in a number of cases that a conflict arises between the insurer and the insured under the intentional injury exclusion clause, since the insurer would escape liability if the insured's acts are determined to have been intentionally done to cause injury, and in fact lead to an award of punitive damages against the insured, while the insured would be most interested in having \"coverage\" for both the cost of defense and the amount of a judgment rendered against him, if any . . . . It has been held that the insured is not deprived of his contractual right to have a defense provided by the insurer when a conflict of interest between the two arises under the described circumstances, and it has been suggested that when such a conflict of interest arises, the insured must be informed of the nature of the conflict and given the right either to accept an independent attorney selected by the insurer or to select an attorney himself to conduct his defense; if the insured elects to choose his own attorney, the insurer must assume the reasonable costs of the defense provided. [Anno: Construction and application of provision of liability insurance policy expressly excluding injuries intended or expected by insured, 31 ALR4th 957, 976.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 The trial court was also without a copy of the complete policy and additionally noted that the defendant had not admitted that the policy contained the above-quoted definition of \"occurrence.\" However, the defendant on appeal has conceded that the definition is contained in the policy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 I do note, but do not base my decision on, the preface to the exclusions applicable to section II: \"Metropolitan does not insure.\" Because the common meaning of \"insure\" is to indemnify or to secure indemnity, see Black's Law Dictionary (5th ed), p 726; The Random House Dictionary of the English Language, Unabridged Edition, p 738, it is arguable that the exclusions do not apply to the duty to defend. However, the defendant has not argued this point, nor is it necessary to my decision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 I must observe at the outset that I find some irony in the opinion of the Chief Justice insofar as it holds that Gravenmier's injury constitutes an \"occurrence,\" or \"accident,\" yet falls within the relevant exclusion. As I read the opinion of the Chief Justice, it adopts the definition of an \"accident\" as set forth by the Supreme Court in Guerdon Industries v Fidelity \u0026 Casualty Co of New York, 371 Mich 12, 18-19; 123 NW2d 143 (1963), and adopted by the Court of Appeals in Frankenmuth Mutual Ins Co v Kompus, 135 Mich App 667, 678; 354 NW2d 303 (1984), \"'anything that . . . takes place without the insured's foresight or expectation and without design or intentional causation on his part.'\" This language exists without reference to \"the standpoint of the insured\" -- the critical language of exclusion at issue. If as asserted by the Chief Justice, \"expected or intended\" must be given an objective meaning, i.e., reasonably expected or intended, it would appear that the definition of \"occurrence\" or \"accident\" would be the better candidate. I find it difficult to accept a method of interpretation under which the words \"without the insured's foresight or expectation\" are deemed to allow coverage in the absence of a subjective intent, while the words \"either expected or intended from the standpoint of insured\" are deemed to unambiguously preclude coverage even in the absence of a subjective intent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 Doubtless, this is at least in part because of the general rule that ambiguities must be resolved in favor of the insured. See Raska, supra. See also Nickerson v Citizens Mutual Ins Co, 393 Mich 324, 330; 224 NW2d 896 (1975) (language in an insurance policy is to be strictly construed against the drafter). Nevertheless, an insurer might suggest an unambiguous reading of the actual policy language which supports its Conclusion, while leaving it to the courts to find an ambiguity upon the basis of an alternative, fair reading suggested by the insured. The plaintiff-insurer in this instance has not suggested a plain or unambiguous reading of the policy language which supports its position. The defendant insured claims there is an ambiguity, but does not indicate the specific source or nature of the ambiguity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 Arguably, the prepositional phrase, \"from the standpoint of the insured,\" modifies only the last antecedent \"intended.\" See 2 Couch, Insurance 2d (rev ed),  15:13, pp 156-157. Thus, the word, \"expected\" need not be viewed from the standpoint of the insured, but instead given an objective construction. However, the insurer has not argued in favor of this reading of the policy and, for reasons discussed in part B, it seems unlikely that the insurer would prefer this reading.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 Arguably, this matter should be remanded to the trial court for further findings which would establish whether in fact DiCicco intended or expected to stab Gravenmier. However, both parties have been content to premise their appeal on the trial court's present fact finding. Metropolitan has requested no relief, either principally or alternatively, involving a remand for further findings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 In so concluding, I am mindful of Professor Corbin's admonition:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eBefore holding that the words of a written contract are so \"plain and clear\" that extrinsic evidence in aid of interpretation is not admissible, the court's attention should be called to the fact that in so holding it is substituting is own linguistic education and experience for that of the contracting parties. In such cases, the court often says that \"a court can not make a contract for the parties\"; but when it holds the parties bound in accordance with a meaning that seems \"plain and clear\" to the court and excludes convincing evidence that the parties gave the words a different meaning, it is doing exactly what it declares that it can not do: the court is making a contract for the parties that they did not themselves make. [3 Corbin, Contracts,  542, pp 111-112.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eBut Professor Corbin also observed:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWithout a doubt, in supporting the interests of their clients, counsel often urge upon the court interpretations of the language of a contract that are far removed from common and ordinary usage, without producing any substantial evidence that the other party to the transaction gave the unusual meaning to the language or had any reason to suppose that the first party did so. In such cases the harassed Judge is justified in saying that the words are too plain and clear to justify such an interpretation. [ Id., p 112.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 This, of course, additionally assumes that the cases have construed the same policy language. Unfortunately, in a number of cases cited by the Chief Justice, the policy language varies significantly. See, e.g., CNA Ins Co v McGinnis, 282 Ark 90; 666 SW2d 689 (1984); The Fireman's Ins Co v Smith, 13 Ark App 250, 253-254; 683 SW2d 234 (1985), ante, p 678. In these cases, the policy exclusions were apparently limited to acts \"expected or intended\" without regard to the \"standpoint of the insured.\" These cases are also factually distinguishable, as discussed below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 Thus, as Justice Archer observes, post, p 731, n 11, the insured need not intend the actual bodily injury inflicted in order to fall under the exclusionary clause.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 Again, as explained at 31 ALR4th 973, although a subjective standard may be used, \" such a view, the courts have also recognized that the insured's intent may be actual or inferred from the nature of the act and the accompanying reasonable foreseeability of harm . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 Again, it must be emphasized that the trial court's findings of fact, upon which the insured's appeal is based, specify only that\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eDiCicco denies any intent to use the knife, claiming that he went to get the knife merely to scare away the other persons he considered to be a threat. No one observed him make a gesture of moving the knife as though to stab Gravenmier. The knife was held in his right hand and the poking was done with his left. DiCicco denies knowledge of in fact stabbing. Immediately following the stabbing, DiCicco looked shocked. Gravenmier obviously did not expect DiCicco would use the knife or he would not have engaged in his act of bravado.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThese findings have not been challenged as clearly erroneous or inadequate by the plaintiff insurer, nor has the insurer requested any alternative relief, such as a demand to the trial court for further findings. It is inappropriate to reach behind the trial court's findings and search the record for evidence which might have supported the insurer's positions and construe the record most favorably toward the insured.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1a See also Wendorff, The new standard comprehensive general liability insurance policy, ABA Section on Ins, Neg, \u0026 Comp Law (1966 Proceedings), pp 250-251.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe National Bureau of Casualty Underwriters, a rating organization composed of stock insurance companies, and the Mutual Insurance Rating Bureau, a rating organization composed of mutual insurance companies, have developed through the joint efforts and co-operation of their Underwriting and Policy Forms Committees so-called \"standard\" general liability and automobile policies which their member companies are required to use. These policies are not \"standard\" from the standpoint of being a statutory policy, such as the fire policies. Insurance companies which are not members of either of these rating organizations may, of course, prepare their own policy forms. However, the \"standard\" policies which have been promulgated by the two rating organizations under their National Standard Policy Provisions Program have become a standard of comparison for other \"nonstandard\" policies. . . . of the nonbureau or independent insurers use the \"standard\" general liability and automobile policies with little or no variation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2a See Wendorff, n 1 (supra) ; Tarpey, The new comprehensive policy: Some of the changes, 33 Ins Coun J 223, 224 (1966); Obrist, New comprehensive general liability insurance policy, pp 6-7 (Defense Research Institute, 1966).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3a See ante, pp 668-672.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4a See Even, The corporate insurance administrator -- problems with the 1966 revised liability policy, 3 Forum 95 (1968), for an overall criticism of the 1966 standardized revisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5a See Iowa Kemper Ins Co v Kasper, 419 Mich 924, 926; 355 NW2d 109 (1984) (Levin, J.):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis Court has held . . . that a clause excluding coverage for injury \"caused intentionally by or at the direction of the insured\" does not exclude coverage for intentional acts with unintended results.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe instant exclusionary clause pertains to injuries that were \"expected,\" as well as those \"intended.\" The question is whether this change in language justifies a departure from this Court's earlier construction. . . .\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhile an objective standard may be appropriate for tort liability, it is not necessarily appropriate when construing or applying an insurance policy. In this context, the expectations and intentions of a reasonable person may not be material; arguably only the actual subjective expectations and intentions of the insured should be considered.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6a I note that at least one jurisdiction has criticized the finding of an insurance provision's ambiguity as result orientated. See Transamerica Ins Group v Meere, 143 Ariz 351, 355; 694 P2d 181 (1984):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eOf course, a finding of ambiguity is the easy way out since it permits the court to create its own version of the contract and to find, or fail to find, ambiguity in order to justify an almost predetermined result. This is an approach which we have abandoned. See Darner Motor Sales v Universal Underwriters Ins Co, 140 Ariz 383; 682 P2d 388 (1984). We believe the proper methodology is to determine the meaning of the clause -- where it is susceptible to different constructions -- by examining the purpose of the exclusion in question, the public policy considerations involved and the transaction as a whole.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7a The use of the \"natural and foreseeable\" approach was also used in pre-1966 judicial decisions attempting to define parameters for the term \"accident.\" See Even, n 4 (supra) at 101:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThere is a definite split of authority, however, as to what acts of negligence result in liability covered by the terms of such a policy. Some courts have held that such policies do not cover liability for the natural and probable consequences of negligence of the insured or his agent. These courts reason that since everyone is responsible for the natural and probable consequences of his acts, injury and damage which is the natural and probable consequences of the negligence is itself not caused by accident. These courts conclude negligence-caused injury or damage is not caused by accident unless an unprecedented or unforeseeable event is an immediate or concurrent cause of the loss so that the loss is not the natural and probable consequence of the negligent act. The difficulty with this interpretation is that it so greatly restricts the insurer's liability as to render the policy valueless, and even meaningless; and denies coverage for what is the predicate of any likely liability against the insured.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8a See ante, pp 676-678. I would further suggest that while the terms are not synonymous, I cannot accept the position that the inclusion of this term in conjunction with the remainder of the exclusion speaking to the insured's standpoint, has so enlarged the scope of the exclusion so as to merit the encroachment of a tort-like standard in the context of insurance. Accord Patrons-Oxford Mutual Ins Co v Dodge, 426 A2d 888 (Me, 1981); State Farm Fire \u0026 Casualty Co v Muth, 190 Neb 272; 207 NW2d 364 (1973).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9a I acknowledge that ratification of a uniform insurance policy provision is a time-consuming process as evidenced by the only four major revisions undertaken in standardized policies since 1940. See Fresard, supra at 691. However, it is obvious the industry is capable of drafting such language as evidenced by the provision considered in Allstate Ins Co v Freeman.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10a The advocation of a subjective standard does not necessarily imply the adoption of an inference of an insured's intent as a matter of law. See MacKinnon v Hanover Ins Co, 124 NH 456, 460-461; 471 A2d 1166 (1984), for an example of a jurisdiction applying a subjective standard of review, yet rejecting an inference of intent or expectation as a matter of law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11a I wish to make it clear that the insured need not intend the actual bodily injury inflicted in order to fall within the instant exclusionary clause. It is sufficient that the factfinder conclude the insured subjectively expected some type of harm reasonably foreseeable from the insured's standpoint. Accordingly, I would reverse the Court of Appeals remand to the trial court on the question whether DiCicco intended to stab Gravenmier.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12a I note that in the instant case, both parties had stipulated to the determination of the case in this non-jury trial solely on the basis of the information contained within the deposition obtained prior to trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13a The language referred to by the trial court includes that at issue in the instant case and policy exclusions which relieves an insurer for injury \"caused by or at the direction of the insured.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14a See text ante, p 685.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15a The lead opinion cites the decision of the Court of Appeals in Michigan Mutual Ins Co v Sunstrum, 111 Mich App 98; 315 NW2d 154 (1981), in support of the idea that the cause of injury is controlling in the determination of spousal coverage under homeowners insurance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn Sunstrum, the Court of Appeals denied coverage to a father where it was alleged that he had negligently entrusted his truck to his son. However, the Court held that the clear language of the exclusionary clause disavowed coverage where an accident occurred away from the homeowner's premises and resulted from the use or operation of a motor vehicle. Unlike the case at bar, the policy in this case prevented coverage for bodily injury arising out of the use, etc., of \"'any motor vehicle owned or operated by, or rented or loaned to, any Insured.'\" Id. at 101. These words are unambiguous. \"Any insured\" obviously means each insured operating a motor vehicle. Therefore, I find Sunstrum to be distinguishable and not supportive with respect to the majority's interpretation of the exclusionary clause in the present case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16a See 2 Couch, Insurance,  15:84, pp 416-419:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe test to be applied by the court in determining whether there is ambiguity is not what the insurer intended its words to mean, but what a reasonably prudent person applying for insurance would have understood them to mean. The criterion is ambiguity from the standpoint of a layman, not from that of a lawyer.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe fact that courts of the several jurisdictions have arrived at different constructions as to the meaning of the words in a provision or exclusion of a policy, and even in some instances have taken almost opposite views, is some indication that the terms are ambiguous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eHowever, aside from the question of ambiguity, I would reject, in the absence of clear language to the contrary, holding an individual coinsured liable for another's independent intentional acts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17a It should be noted that the exclusionary clause in Borbor referred to the actions of \"the insured.\" 826 F2d 890. We note also that the lead opinion similarly finds persuasive decisions discussing the distinctions between \"the insured\" versus \"a\" or \"an\" insured. See lead opinion ante, p 693, n 27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 Ante, p 701.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 Ante, p 660.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 See ante, pp 682-685.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 Ante, p 690.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 See Freeman, supra at 359.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 Ante, p 692.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 See ante, p 692 which states that \" ambiguity must be construed in favor of the insured.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 Raska is cited by the lead opinion (ante, p 666) and by Justice Boyle (ante, pp 707-708).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 These principles are taken directly from Powers, supra at 623-631, and Raska, supra at 361-363.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSee also ante, pp 665-666, citing Raska and Powers. I infer from the citation of Raska in the lead opinion that it accepts the other principles of insurance contract interpretation stated by the Raska majority.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 See Freeman, supra at 363. Judge Theiler concluded that \"an,\" read in the context of the Allstate policy, is ambiguous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 See Huggins v Tri-County Bonding Co, 337 SE2d 12, 17-18 (W Va, 1985). (Language in an insurance exclusion is ambiguous when it is \"reasonably susceptible of two different meanings or is of such doubtful meaning that reasonable minds might be uncertain or disagree as to its meaning.\" Citations omitted.) The term \"an insured\" is also ambiguous under a common sense meaning of \"ambiguity.\" For example, the Webster's New Collegiate Dictionary (1974), defines \"ambiguous\" as meaning both \"doubtful or uncertain\" and \"capable of being understood in two or more possible senses.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 See also, ante, p 736.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 For example, the court in Condon, supra at 153, relies upon strained reasoning when it concludes that \"proper grammar necessitated\" the use of the term \"an insured,\" as opposed to the statutorily mandated term \"a.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSuch reasoning ignores the fact that the policy exclusion at issue could have been drafted in at least two ways that would have indicated the plural connotation of \"any insured.\" To see how Allstate could have drafted the policy at issue in Condon to be both plural in its reference and grammatically correct, read the disputed coverage provision in that case and insert either the term \"any insured person\" or \"any person insured\" for the disputed word \"a person insured.\" Id. at 151.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThus, as a matter of accepted English usage, the Condon court's reasoning is flawed. Id. at 153. I also reject that court's Conclusion that \" is no logical method to construe the phrase [\"an insured\"] as singling out any particular insured person within the coverage of the policy. Indeed, my reasoning with respect to the meaning of the indefinite article \"an\" shows otherwise.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSimilarly, the decision in Gilbert, supra at 454, is unpersuasive in concluding, \"We agree with Condon that 'an insured' refers to all insureds under the policy.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 The lead opinion concludes that \"the omission of a definition from an insurance policy does not render that term ambiguous.\" (Ante, p 698.) Yet, it nowhere discusses Allstate's use of the term \"any insured person\" in the third exclusion in the policy. See Discussion below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15 The third exclusion in the Allstate policy uses the word \"any insured person,\" instead of the ambiguous term \"an insured.\" The exclusion states:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eExclusions -- Losses we do not cover\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. We do not cover bodily injury to any person eligible to receive benefits required to be provided or voluntarily provided by any insured person under any workers' compensation, non-occupational disability or occupational disease law.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16 The exclusion we are interpreting employs the term \"an insured\" to describe whose coverage is limited when one of the class of insured persons commits an \"intentional or criminal act[].\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17 See, generally, 2 Couch, Insurance, 2d (rev ed),  15:29, pp 216-227. The Couch treatise explains:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe intent of the parties is to be ascertained from the language of the entire policy considered as a whole in connection with the risk or subject matter . . . its words, parts, and provisions must be construed together as one entire contract. All of the terms and conditions of each part should be read and interpreted together in light of all the other parts. The intent of the contracting parties is to be ascertained, not by a process of dissection in which words or phrases are isolated from their context, but rather from a process of synthesis in which the words and phrases are given a meaning in accordance with the obvious purpose of the insurance contract as a whole. [ Id. at 216-226. Citations omitted.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18 See, e.g., Safeco Ins Co of America, Inc v McKenna, 90 NM 516; 565 P2d 1033 (1977); Pawtucket Mutual Ins Co v Lebrecht, 104 NH 465; 190 A2d 420 (1963); Western Casualty \u0026 Surety Co v Aponaug Mfg Co, 197 F2d 673, 674 (CA 5, 1952).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19 See also id. at 266, and cases cited therein.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20 See People v Enlow, 135 Colo 249; 310 P2d 539 (1957) (Day, J., Dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21 See State Farm Fire \u0026 Casualty Co v Teresa Lather, unpublished opinion of the United States District Court for the Southern District of Indiana (Docket No. IP 83-561C). In the context of construing a motor vehicle exclusion in a homeowner's liability policy, Judge Barker relied on the principle that insurers must clearly exclude negligent entrustment claims from broad liability policies:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIf [the insurance company] intended to exclude negligent entrustment and negligent supervision from its coverage, it must state that exclusion \"clearly and unmistakenly.\" [ Id. at 14.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22 See Freeman, supra at 364.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23 See, e.g., Michigan Mutual Ins Co v Sunstrum, 111 Mich App 98; 315 NW2d 154 (1981); Shelby Mutual Ins Co v United States Fire Ins Co, 12 Mich App 145; 162 NW2d 676 (1968); State Farm Fire \u0026 Casualty v Huyghe, 144 Mich App 341; 375 NW2d 442 (1985); Allstate Ins Co v Goldwater, 163 Mich App 646, 649; 415 NW2d 2 (1987). These cases hold, with the exception of Shelby, that automobile-related negligent entrustment liability of any insured is excluded from the coverage of homeowner's liability policies when one insured commits tortious acts related to the use of the excluded instrumentality.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24 In all these cases, the exclusion relates to bodily injury arising out of the ownership, maintenance, use, or operation of a motor vehicle. The policy language differs slightly in each case. But, the general issue that the courts have faced in the motor vehicle exclusion cases is whether the policy exclusion clearly excludes negligent acts that relate only indirectly to the use of the vehicle but are nevertheless causally related to some foreseeable harm related to that use.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25 Freeman, supra at 357. Ante, p 690.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26 Ante, pp 701-702.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27 In Hinze, supra at 267, the Seventh Circuit pointed out the obvious fact that the motor vehicle exclusions in homeowner's liability policies are intended to exclude a whole range of negligent acts:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe \"instrumentality\" theory, to the extent it is recognized [in the context of construing the scope of motor vehicle exclusions in liability insurance contracts], is clearly limited to a negligent entrustment action for the explicit reason that negligent entrustment includes by definition a finding of negligence with the entrusted instrument.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28 See ante, pp 690-691. But, I do note that courts in at least five other states have found language similar to the motor vehicle exclusion clause interpreted by the Sunstrum Court to be ambiguous. On the basis of the finding of ambiguity in the language of the exclusion, these courts have concluded that the insurer owed the insured a duty to defend against negligent entrustment actions arising from the use and operation of a motor vehicle. See Douglass v Hartford Ins Co, 602 F2d 934 (CA 10, 1979); United Fire \u0026 Casualty Co v Day, 657 P2d 981 (Colo App, 1982); U S Fidelity \u0026 Guaranty Co v State Farm Mutual Automobile Ins Co, 107 Ill App 3d 190; 437 NE2d 663 (1982); Upland Mutual Ins, Inc v Noel, 214 Kan 145; 519 P2d 737 (1974); Republic Vanguard Ins Co v Buehl, 295 Minn 327; 204 NW2d 426 (1973); McDonald v Home Ins Co, 97 NJ Super 501; 235 A2d 480 (1967); Lalomia v Bankers \u0026 Shippers Ins Co, 35 AD2d 114; 312 NYS2d 1018 (1970).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29 Ante, p 690.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30 See Dragovich, supra, Sunstrum, supra, and Shepard Marine Construction Co, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31 As the Couch treatise explains, \"An ambiguity for which the insurer is responsible is not to be resolved so as to defeat the purpose of the policy, where a reasonable construction which will uphold the policy is permissible.\" Couch, n 17 (supra) at  15:14, p 158. (Citations omitted.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32 Dragovich, supra at 508-510.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Allstate has said that it will defend against the negligent personal acts of an insured on the premises of the household \"'even if the allegations are not true.'\" See ante, p 739.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. Judge Wahls' approach, which I would apply to the duty to defend issue at bar, was explained further as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe majority analysis would be more convincing if the issue were policy coverage rather than duty to defend the claim. Where the ability of a party to prove negligence necessarily turns on facts in the control of an adversary, considerations of fairness require that an insurer with potential liability defend the claim through the discovery process. Summary judgment is inappropriate where an insufficient factual basis exists to decide whether claims are in fact covered by the policy in question. Reurink Bros Star Silo, Inc v Maryland Casualty Co, 131 Mich App 139, 147; 345 NW2d 659 (1983). [ Id. at 509-510.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Judge Wahls' reasoning should be applied here, even if the insured has \"simply labeled claim as a negligence count to avoid the [intentional-acts] exclusions of the insurance contract.\" Dragovich, supra at 508.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThis approach is a fair one given the unambiguously broad contractual duty to defend that Allstate has voluntarily assumed by contract and its ambiguous policy exclusion. To find otherwise would be inconsistent with the policy language, as other courts have found construing similar exclusions in homeowner's liability policies. See, generally, Milliken, Coverage under a homeowner's policy for third-party claims arising out of an automobile accident, 53 Ins Couns J 146, 150 (1986).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Allstate contends that Marshall's tort liability under a theory of negligent entrustment is \"triggered\" only by the intentional acts of Alonda (which are excluded from coverage).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe basic elements of the tort of negligent entrustment were explained in a recent law review article:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNegligent entrustment has three elements: (1) a person relinquishes control of a dangerous instrumentality to another; (2) the first person knows or should have known that the entrustee is likely to use the instrumentality involving an unreasonable risk of harm to others; and (3) the injury must be caused by the entrustor and entrustee. [Note, Exclusion of automobile related liability under a homeowner's insurance policy, 9 U of Hawaii L R 345, 353, n 53 (1987), citing Prosser \u0026 Keeton, Torts (5th ed),  33, pp 197-203; Leitner, Negligent entrustment of a motor vehicle and the homeowner's policy, 35 Fed'n of Ins Couns Q 335, 336 (1985). See also ante, pp 732-733 (opinion of Archer, J.). The elements of this tort were explained in Perin v Peuler (On Rehearing), 373 Mich 531, 539-540; 130 NW2d 4 (1964).]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA claim of negligent entrustment depends upon a finding that the tortious acts of Alonda were the proximate cause of the damages alleged. See Perin, supra at 538-540. (\"In all cases [of negligent entrustment] . . . the cause of the plaintiff's injury must be proximately connected to some negligent act or omission for which either the entrustor or the entrustee is legally responsible.\")\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eYet, Marshall's legal liability is only \"triggered\" when he acts negligently. His failure to prevent the foreseeable misuse of a dangerous instrumentality necessarily precedes the actual misuse of the firearm by Alonda.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMoreover, his negligent entrustment liability exists irrespective of whether the dangerous instrumentality (in this case, a firearm) is used in an intentionally tortious, or a merely negligent, manner.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. I find it significant that Marshall Freeman can be held liable in negligence whether or not Alonda acts intentionally. Under a different policy exclusion, but in a very similar factual context, the West Virginia Supreme Court pointed out:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ecritical element of a negligent entrustment cause of action is the initial improper loaning of the vehicle -- improper in the sense that it is given to a person who is known to be likely to cause an unreasonable risk of harm to others. [ Huggins v Tri-County Bonding Co, 337 SE2d 12, 17 (W Va, 1985), citing, inter alia, Restatement Torts, 2d,  308; Prosser \u0026 Keeton, Torts (5th ed),  73.]\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Freeman, supra at 357.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Ante, p 722.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1b The question whether an insurer has a duty to defend an insured where the insured acted in self-defense, and, where the insured acted in mistaken self-defense, to indemnify the insured despite policy language excluding injury caused by an intentional or criminal act, is not addressed in the opinions of the Justices. The factual Disposition by the majority of Alonda Freeman's claims made it unnecessary for the majority to consider this legal question.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2b Ante, p 683, n 20.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3b Ante, p 683, n 20.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4b In the Nebraska, Maine, and Minnesota cases, the policies excepted injury \"which is either expected or intended from the standpoint of the Insured.\" In the New Jersey case, the exception was for injury caused \"intentionally by or at the direction of the Insured.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5b MCL 750.235; MSA 28.432.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6b See anno: Criminal conviction as rendering conduct for which insured convicted within provision of liability insurance policy expressly excluding coverage for damage or injury intended or expected by insured, 35 ALR4th 1063, 1068; Patrons-Oxford Mutual Ins Co v Dodge, 426 A2d 888 (Me, 1981). But see Bay State Ins Co v Wilson, 96 Ill 2d 487; 71 Ill Dec 726; 451 NE2d 880 (1983); State Farm Fire \u0026 Casualty Co v Dominguez, 131 Cal App 3d 1; 182 Cal Rptr 109 (1982).\u003c/span\u003e\n\n",
    "body_length": 196459,
    "citedas": [
      "443 N.W.2d 734",
      "432 Mich. 656"
    ],
    "attorneys": "Garan, Lucow, Miller, Seward, Cooper \u0026 Becker, P.C. (by Rosalind Rochkind, James L. Borin, and James C. Rabaut), Detroit, Michigan, for the plaintiff in Freeman. Nelson \u0026 Kreuger, P.C. (by Steven L. Kreuger), Grand Rapids, Michigan, for the plaintiff in DiCicco. Law Offices of Joseph DeVal Welton, P.C. (by Joseph DeVal Welton) Detroit, Michigan, and Craig Daly, Detroit, Michigan, in Freeman. Sinas, Dramis, Brake, Boughton, McIntyre \u0026 Reisig, P.C. (by David R. Brake), Lansing, Michigan, for defendant James Gravenmier in DiCicco.",
    "category": [
      "184",
      "188"
    ],
    "judges": "Riley, C.j. Griffin, J., concurred with Riley, C.j. Boyle, J. Brickley, J., concurred with Boyle, J. Archer, J. (in Agreement in part and Dissenting in part). Cavanagh, J. (in Agreement in part and Dissenting in part). Levin, J. (in Agreement in part and Dissenting in part).",
    "citation_count": 5
  }
}
