{
  "id": "VJWzQ2YBTlTomsSBaXIo",
  "document": {
    "title": "LARSEN v. A.C. CARPENTER",
    "full_title": "KNUD I. LARSEN, Plaintiff, v. A.C. CARPENTER, INC., A.A. CARPENTER, INC., and ASSOCIACION DE PRODUCTORES RURALES DEL ESTADO ARAGUA, Defendants",
    "jurisdiction": "E.D. New York",
    "date": "1985-10-15T00:00:00.000Z",
    "docket": "81 CV 4129 (ERN)",
    "body": "NEAHER, District Judge.\n\nMEMORANDUM OF DECISION AND ORDER\n\nThis suit is brought pursuant to the Court's admiralty jurisdiction. See 28 U.S.C. ยง 1333; Fed. R. Civ. Pro. 9(h). Plaintiff is Knud I. Larsen (\"Larsen\"), a Danish corporation owning the M/V JETTE SIF. Defendant Associacion de Productores Rurales del Estado Aragua (\"APRA\") is a Venezuelan farmer organization, which buys supplies for its members. Defendants A.C. Carpenter, Inc. and A.A. Carpenter, Inc. (together \"Carpenter\") are New York corporations engaged in potato wholesale buying and selling.\n\nThis suit arose from an unsuccessful commercial undertaking. Briefly described, Carpenter purchased seed potatoes in Michigan, contracted for their sale to APRA and hired the JETTE SIF from Larsen for their transport to Venezuela. The ship arrived in Venezuela but was not unloaded; rather, the cargo was eventually dumped in a rotted condition at sea.\n\nRegarding the resultant legal claims, Larsen seeks damages from defendants for demurrage, detention and related expenses stemming from the cargo's nondischarge. APRA, in turn, counterclaims against Larsen for the potatoes' spoilage and connected damages. Additionally, APRA crossclaims against Carpenter for similar losses and for not procuring appropriate insurance. For its part, Carpenter counterclaims against Larsen for a freight refund. Finally, aside from affirmative recovery, each party - if adjudged liable in any respect - seeks indemnification from another.\n\nTo resolve these multiple claims, the Court held a bench trial that concluded on March 3, 1983. Having reviewed the trial record (including numerous depositions), the parties' submissions and the law, the Court holds: 1) Larsen prevails on its claim against Carpenter but not on its claim against APRA; 2) APRA's counterclaim against Larsen is dismissed but its crossclaim against Carpenter merits relief; and 3) Carpenter's counterclaim and crossclaim are dismissed.\n\nThe findings of fact and conclusions of law underlying these holdings follow. See Fed. R. Civ. Pro. 52(a).\n\nI. FINDINGS OF FACT\n\nA. Sale\n\nIn August 1981, APRA was seeking seed potatoes to plant for the production of table potatoes. Learning of this, Robert Carpenter, a salesman for defendant Carpenter, contacted APRA president Simon Ortega and, thereafter, went to Venezuela for a meeting.\n\nIn Venezuela, Ortega took Robert Carpenter to visit potato farms. Robert Carpenter understood that the seed potatoes he might supply would not be consumed but would be planted to grow table crops.\n\nNegotiating, Robert Carpenter offered good quality Michigan produce. For his part, Ortega asked that the purchase arrive not later than the \"second week of November.\" T. 412. Ortega also communicated his desire to inspect before buying.\n\nIn accord with that desire, Ortega journeyed to the Gaylord, Michigan area where the potatoes were grown and stored. During that September 8-12, 1981 trip, Ortega was impressed by the produce, much or all of which was already warehoused.\n\nMore negotiations ensued. Robert Carpenter informed Ortega that he wanted to receive a letter of credit before shipment and that discharge was APRA's responsibility. Among his requests, Ortega preferred that for better circulation the potatoes be crated, not bagged. Robert Carpenter responded that crates would be difficult to timely obtain.\n\nConcerning the potatoes' transport, Ortega left the ship's chartering to Robert Carpenter. Nothing was explicitly said requiring that the vessel be refrigerated.\n\nThe deal was struck at the Detroit airport. Robert Carpenter agreed to sell 30,000 bags of potatoes at $21 per 110 lb. (50 kg.) bag CIF Puerto Cabello, Venezuela, the discharge port.\n\nThe agreement's \"primary terms\" were contained in an October 9, 1981 letter of credit opened by APRA with Banco Provincial de Venezuela (\"Banco Provincial\"), the issuing bank. Joint Pretrial Order p. 4. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\" The letter of credit listed the documents (including a bill of lading) Carpenter had to submit with its sight draft to the Republic National Bank of Miami (\"Republic National\"), the confirming bank.\n\nB. Erwinia\n\nThe harvested potatoes underwent by lot joint federal-state inspections while in Michigan. Of the 60 federal-state certificates issued (covering an average of 412 bags per lot), 47 indicate no soft rot. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\" But 13 note that such decay was present, although within the allowable .5% regulatory range. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\"\n\nAllowable then, the potatoes later died from just such soft rot determined to have been induced by erwinia bacteria. The soft rot death came despite the potatoes having a storage life up to \"a couple of years.\" T. 301. In other words, these September 1981 harvested potatoes dying roughly, two months later succumbed well short of their life span. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\" That rapid soft rot demise necessitates a discussion of erwinia, the fatal agent.\n\nIn Michigan and worldwide soils, erwinia is harmless if remaining on a potato's skin. To cause damage, erwinia must enter the pulp via skin cuts, bruises of lenticells (pores). Once in, erwinia attacks cell wall pectin (a glue-like substance), thereby breaking down the potato's infrastructure. About eighty percent water, the potato is unable to retain its moisture and shrinks into a soft rot state.\n\nTo elaborate further, a potato is a living vegetable needing oxygen. With respect to erwinia's lenticell entry, when a water film overlays its skin, the breathing potato enlarges those pores facilitating air ingress and carbon dioxide emission. That dilation allows erwinia to swin [sic] into the pulp through the pores.\n\nSimilarly, when water is present, erwinia can enter through harvest-handling incurred wounds. Access by whatever opening, pulp-penetrated erwinia gives off a strong ammonia-like stench. Lenticells and wounds are the gates but skin water is erwinia's vehicle into the potato. Water, in short, is the key to erwinia generated soft rot.\n\nPossible water sources pertinent to these potatoes were harvest rain, the potatoes themselves, condensation and seawater. Rain at reaping time requires no detailed exposition and seawater is more appropriately dealt with later. See infra pp. 27-29. Regarding the potatoes themselves, if subject to heat, they exude their own water through the pores. As to condensation, in a storage setting with dew point higher than pulp temperature, the potatoes become coated with a water film from the cooled ambient air. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\"\n\nWhich prevoyage water source(s) facilitated erwinia entry into these potatoes can only be deduced. Rain probably fell at harvest time. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\" But the Gaylord soils are sandy and would not likely retain water long enough (four to five days) for lenticell expansion. Moreover, those soils generally have antibodies competing against erwinia, lessening the infection possibility for an unearthed potato.\n\nThat does not preclude entry via lesions received during the postharvest-handling phase, since rain was likely present. In fact, Dr. Potter, a plant pathology professor, flatly stated that entry \"occurred after harvest.\" If so, that ingress period would have coincided with erwinia's usual penetration pattern, Dr. Potter observing that \"the greatest loss to the potato industry comes in the post-operative area.\" T. 318.\n\nNecessarily a deduction, that \"post-operative\" stage (after harvest but before storage) was apparently the time when erwinia began its intrusion. Along with Dr. Potter's testimony, that deduction is substantiated by the federal-state certificates (upon which he relied) in essence attesting that prior to those Michigan inspections conducted in storage adequate water existed for erwinia's entry into a small percentage of pulps. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\"\n\nC. Charter\n\nTo transport the potatoes to Venezuela, the JETTE SIF was hired pursuant to a Gencon charter party executed on October 13, 1981 between Carpenter and Larsen. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\" The agreement was for the entire vessel and one voyage to Puerto Cabello. The initial freight rate was $60 \"per 1000 kg fios.\" Ex. 1, pt. I, cl. 13. Laytime was \"6 days of 24 running hours.\" Id., pt. I, cl. 16(c).\n\nBuilt in 1975 for general cargo and fruit, the JETTE SIF has two cargo hatches - the no. 1 forward and the no. 2 aft. Without bulkheads separating those hatches, the cargo space runs fore and aft without interruption. Vertically divided, the under space is the lower hold and the upper is the 'tween deck. MacGregor pull covers overlay the hatches.\n\nFour high volume electrical fans propel air through the cargo spaces with two each aft of the lower hold and 'tween deck. Ambient air is received from the main deck outlets constructed to prevent rain or seawater intrusion into the stow areas.\n\nAlthough not mechanical extractors, four exhaust vents are correspondingly forward of the fans. Air is forced out through those vents by fan pressure and pulled out by suction through the main deck ducts when the ship is underway. Those main deck ducts are also built to resist rain or seawater entry.\n\nThe JETTE SIF has a one speed thirty (at least) air change per hour capacity. Through Novo Chartering, a ship broker, Robert Carpenter had requested that capacity, but the charter party only specified twenty-five. Regardless, being only electrically ventilated, the JETTE SIF could not substantially alter the holds' temperatures and humidities.\n\nRobert Carpenter had considered a vessel with an automated chilling system, telling Novo Chartering that a \"ventilated or refrigerated ship\" was required. Ex. 125, pp. 16-17. But when available refrigerated ships were located, Robert Carpenter backed off because \"they wanted too much money.\" Id., p. 17.\n\nD. Wilmington\n\nWith a small percentage already erwinia invaded, the burlap sacked potatoes began arriving by truck on October 15, 1981 at Wilmington, Delaware, the load port, and were stored in a dockside warehouse to await the JETTE SIF. The unrefrigerated vessel reached Wilmington harbor on October 22, tendering its notice of readiness at 11:50. The same day, George Geiser, a National Cargo Bureau (\"NCB\") surveyor, inspected the ship and issued a certificate of readiness at 16:30 confirming that the holds were fit to receive the potatoes.\n\nDue to unfavorable weather forecasts and intermittent rain, stowing did not begin until 08:00 on October 28. When it did commence, loading was not without problems. Hired by Carpenter, neither stevedore Jay Murphy nor his men had had previous potato experience. JETTE SIF Captain Sven Nissen did have an extensive background with that cargo. Robert Carpenter, too, had loaded potato shipments before.\n\nPrior to loading, Captain Nissen met with Murphy. Learning that Murphy had never handled potatoes, the Master said that he would instruct the longshore gang. They also discussed the cargo amount relative to the ship's capacity, both foreseeing that space would be troublesome. Captain Nissen believed, however, that all could be taken.\n\nWhen loading began, Captain Nissen directed that the 'tween deck be stowed twelve tiers high with dunnage every fourth. When Robert Carpenter arrived that same morning, he issued directions as well.\n\n\"Q. Were you making any suggestions to [Murphy] as to the method . . . the cargo should be stowed . . .?\n\n\"A. Yes, sir.\n\n\"Q. Was [Murphy] consulting with you as to how the cargo should be placed . . .?\n\n\"A. I was pretty much consulting with him. I advised him that because of the size of the holds . . . I wanted six air channels made, three vertical and three horizontal, so that every bag of potatoes would get plenty of air.\"\n\nEx. 125, pp. 22.\n\nAfter loading for about a day, Captain Nissen apparently became increasingly concerned about the capacity. He instructed that the 'tween deck and lower hold air aisles be narrowed from the 2-2 1/2 feet width to 1-1 1/2.\n\nNear completion, Captain Nissen wanted bags added atop the stow in the lower hold and over the beams that were beneath the ceiling. Manifesting his ongoing supervisory participation, Robert Carpenter opposed, maintaining that ventilation would be impeded by plugging the space between the beams and the ceiling; and Captain Nissen acquiesced.\n\nConcern about loading all the bags had another consequence - the charter party's renegotiation. By that modification, Carpenter agreed to a $96,000 flat rate instead of a per tonnage fee.\n\nThat change, in turn, led to a discussion about authority over the stow. Robert Carpenter recalled:\n\n\"[A]fter . . . we worked out the lump sum figure, . . . I said, Captain, now it's your responsibility; the stowage is yours . . . and all I want is clean on board bill of ladings. Because prior to making a call to the owners, he mentioned . . . that he was ready to protest the stowage . . . and I said, I don't want this, captain. I said, we'll straighten it out; it will be your responsibility.\"\n\nEx. 125, p. 83.\n\nDespite that unequivocal direction, Robert Carpenter did not cease making decisions.\n\n\"[W]e had completed the loading up to the top of the hatch coams [the covers' sides], and we were finishing hatch 1, and . . . had potatoes left over; and Mr. Murphy said . . . why not fill up hatch . . . 2, fill the hatch coaming, that we could get another 150 ton in there. I said, fine . . . and they reopened hatch 2, put in pallets around the hatch coam and filled the rest up with potatoes, so . . . hatch . . . 2 was filled up to the top of the covering.\"\n\nId., pp. 71-72.\n\nLoading finished at 16:40 on October 30 with the ship filled and bags left on the pier. Captain Nissen then signed a clean of board bill of lading for 30,119 bags. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\"\n\nBefore departure, the charterer gave written instructions to the Master. The holds were to be constantly ventilated at thirty air changes per hour, so long as the outside temperature stayed above 41 degrees F. and the humidity below 90%.\n\nE. Voyage\n\nThe ship sailed at 19:50 on October 30. Activated shortly after loading ceased, the ventilation system operated at thirty or better air changes per hour throughout the voyage.\n\nEncountering heavy weather the first four days, the vessel rolled and took water over its hatches. As a result, Captain Nissen later filed a sea protest at Puerto Cabello.\n\nBesides that rough weather, the ship was slowed by damage sustained on the previous voyage when it had grounded off Belize, bending the propellers. After that stranding, the vessel was inspected and cleared for the Venezuelan trip with directions that the engine speed \"be controlled so as to eliminate vibration\" due to the dented propellers. Ex. 9. So, though having a 12 knot capability, the JETTE SIF averaged 9.03 during the 1828 mile journey. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\"\n\nThe passage was not only lengthened by adverse weather and reduced rpm's but also by a seven hour bunker trip to Curacao laying approximately 150 miles northwest of Puerto Cabello. Expected to take five days, the voyage took over eight. Not surprisingly, on this journey into equatorial latitudes, warm and humid outside conditions were prevalent. The conditions in the cargo holds, through which the fans circulated ambient air, were likewise warm and humid, as indicated below: Outside Air Temp./Humidity 'Tween Deck Lower Hold Octpber 30 65 degrees/72% 56.5 degrees/97% 55 degrees/96%November 1 75 degrees/52% 63 degrees/88% 67 degrees/78%November 2 77 degrees/58% 66.6 degrees/88% 70 degrees/84%November 3 79 degrees/58% 70.5 degrees/87% 72 degrees/80%November 4 81 degrees/75% 75 degrees/98% 77 degrees/98%November 5 85 degrees/75% 81 degrees/86% 80.6 degrees/88%November 6 86 degrees/75% 82.5 degrees/89% 83 degrees/83%November 7 85 degrees/92% 84 degrees/82% 82 degrees/95%November 8 85 degrees/83% 83.6 degrees/92% 84 degrees/91%\n\nCarpenter's Proposed Findings of Fact p. 35, #72 (partially summarizing Ex. 11, which contains the vessel's temperatures and humidities recorded at noon each day).\n\nAlso not surprisingly, the simmering internal atmosphere was conducive to erwinia growth.\n\nF. Puerto Cabello: Nondischarge\n\nWith its heating cargo, the JETTE SIF entered Puerto Cabello harbor on November 8. Captain Nissen cabled a notice of readiness that was received at 17:00 by Consignaciones Dasar (\"Dasar\"), the agent for both APRA and Larsen. For various reasons, the vessel did not dock until four days later.\n\nThe National Institute of Ports (\"INP\") is a government agency that oversees the Venezuelan waterfront, including the coming and going of ships and the hiring of longshoremen. INP insists that certain documentation (bills of lading, cargo manifests, etc.) be tendered twenty-four hours before arrival. If not done, INP will neither assign a berth nor classify a discharge. The JETTE SIF's papers were not timely produced.\n\nThe $96,000 freight having been paid, Anthony Carpenter, Robert's brother and president of both Carpenter corporations, received the bill of lading on October 31. On November 2, he submitted to Republic National the bill and other papers necessary for the letter of credit sight draft (and eventually necessary for INP). Republic National reviewed the documents and paid the $630,000 sight draft for the potatoes' purchase. The next day, not having been instructed by Anthony Carpenter to engage a special courier, Republic National forwarded the documents by registered air mail to Banco Provincial.\n\nOn November 10, with the ship already at Puerto Cabello anchorage for two days, Robert Carpenter and Ortega went to Banco Provincial to inquire about the unreceived documents. The papers arrived about noon and were reviewed. The next day the requisite documents were given to the Venezuelan authorities. An occupied berth being assigned, the ship did not dock until 14:00 on November 12. Discharge did not begin then either due to an INP equipment shortage. Nor did it commence on November 13 because the longshoremen went on strike at 08:00.\n\nExercising its charter party general strike clause rights, Carpenter informed Larsen that it would hold the JETTE SIF in Puerto Cabello during the stoppage. The strike ended at 12:00 on November 16. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\" Unloading still did not go forward. The INP longshoremen refused to discharge because the potatoes were putrefying with a noticeable ammonia stench. Special stevedores (distinct from the INP longshoremen) would only perform the onerous task for more money. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\"\n\nOn Saturday, November 14, Ortega for the first time viewed and all but rejected the cargo. He seems to have withheld a final decision until the following Monday when the hatches would be opened.\n\nThe November 16 inspection apparently confirmed his earlier tentative appraisal, since Ortega (then or shortly thereafter) informed John-Thomas Duesing, Carpenter's Caracas agent, that he did not want the cargo. Despite the disavowal, Ortega still would have unloaded the vessel believing that APRA by law had to discharge, truck and burn the cargo, which would have cost about $25,000.\n\nPlanting plans by then foresaken, even that resigned effort was unsuccessful, as Dasar's Marichal related:\n\n\"Q. At anytime after November 16, 1981, did you attempt to negotiate with the local stevedores for the discharge of the cargo from the JETTE SIF?\n\n\"A. We tried with Simon Ortega. [W]e would start to discharge the vessel, but there was no help from the sellers. [C]ommunication was lacking.\"\n\nEx. 122, p. 41.\n\nThe lack of communication may have been attributable to Robert Carpenter's leaving Puerto Cabello on November 11. When back in New York, he received a telephone call on or about November 19 from Duesing. Robert Carpenter was informed that \"Ortega was refusing the cargo because of the condition.\" Ex. 122, p. 69. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\" He returned to Venezuela, meeting with Duesing on November 26.\n\nAdding to the previous troubles, another general strike began at 13:00 on November 19. That stoppage lasted through November 24.\n\nOstensibly, an alternative existed. Ten hours by sea, La Guaira was a nearby port. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\" Proceeding there, however, was unrealistic because the Venezuelan government would have required other permits taking 48-72 hours to procure. Also, nothing guaranteed that the La Guaira longshoremen would have responded any differently than their Puerto Cabello counterparts to the smelling, rotting potatoes.\n\nOn November 25, INP at last ordered the ship from the dock and it departed to anchorage at 19:40. By then, the potatoes were unquestionably a total loss.\n\nG. Puerto Cabello: Other Liability Relevant Matters\n\nBefore proceeding beyond Puerto Cabello, additional factual issues pertinent to the subsequent legal analysis are best addressed at this point.\n\n1. Arrival Condition\n\nWhen INP ordered the ship to anchorage, the potatoes were incontestably beyond use. When prior to November 25 they had become unfit for planting (or other use) is disputed. The focus is on their November 8 arrival condition.\n\nThe credited evidence is that the cargo had considerable soft rot when the vessel entered Puerto Cabello harbor. For instance, Robert Carpenter told of his November 11 observations upon boarding.\n\n\"Q. Was there anything unusual about the cargo?\n\n\"A. There was a smell.\n\n\"Q. [C]ould you pinpoint where it was coming from?\n\n\"A. No, just a general smell.\n\n\"Q. What was the smell of?\n\n\"A. Of decaying potatoes.\"\n\nEx. 125, p. 51.\n\nOn November 13, the log noted that bags with advanced decaying were seen:\n\n\"INSPECTED . . . CARGO AND FOUND . . . SOME . . . SACKS . . . ROTTEN AND FILLED WITH FLIES.\"\n\nEx. 2.\n\nOrtega visited the next day.\n\n\"Q. When you went aboard the vessel on November 14th, did you smell anything?\n\n\"A. Yes, it was a smell of something rotten . . . like ammonia. There were fleas also. And underneath the end it was a kind of a dark liquid.\"\n\nT. 435.\n\nDr. Ramon Lastra, a plant pathologist with the Venezuelan Institute of Scientific Research, surveyed the cargo on November 23. Based on that inspection and his review of the log's recorded temperature and humidity levels, Dr. Lastra offered an opinion as to when the potatoes began rotting:\n\n\"A. [B]y the extent of the damage . . . I can put it maybe 3rd, 4th or 5th or 6th of November.\n\n\"Q. That is your best estimate?\n\n\"A. Yes, but that is very difficult to estimate.\"\n\nEx. 119, p. 35.\n\nJohn Maguregui, the manager of the Caracas Lloyd's Agency, which performs cargo examinations, had hired Dr. Lastra and had accompanied him on the November 23 survey. Extrapolating from a survey observation, Maguregui gave a more specific reason partially supporting his and Dr. Lastra's appraisal of an early deterioration onset date - the 9-10 day fly life cycle.\n\n\"A. [F]rom Dr. Lastra's verbal report to me, the flies would only deposit eggs on decomposing organic material; in this case, soft rotting potatoes.\n\n. . .\n\n\"Q. Were you given any indication by Dr. Lastra how soon before November 13th . . . of 1981 the damage must have commenced?\n\n\"A. Yes. That it probably commenced, and in this we agreed, . . . sometime after the vessel approached tropical waters. . . . That is high temperatures and humidities.\"\n\nId., p. 62.\n\nPlainly, attempting to isolate the particular voyage day of the infection's spread involves conjecture. Nevertheless, with respect to the cargo's November 8 arrival condition, Dr. Potter responding to a hypothetical was emphatic that the potatoes were unfit for planting:\n\n\"Q. Based on the facts that I have given you - I'll add . . . that after a number of potatoes were examined by the authorities in Venezuela, it was noted that they were affected with Erwinia rot, and that . . . given off in the ship's hold was an ammonia-type odor. Can you tell us whether . . . those seed potatoes were suitable [on November 8] for . . . being sown . . .?\n\n\"A. . . . I'd say no, they would not be.\n\n\"Q. Why not?\n\n\"A. Because it is obvious that there must be a great deal of rot in that pile of potatoes . . . . And that doesn't necessarily mean that the potato was completely disintegrated but if you have any amount of soft rot in a potato, it should not be used for seeding. Absolutely not.\n\nT. 293-94. See generally Ex. 118, p. 18 (Antonio Landaeta, chief of the Puerto Cabello plant protection division of the Venezuelan Ministry of Agriculture, commented: \"[W]hen an importation is for seeding, the plant protection division has to be exceedingly careful so that this seed can be used for agricultural purposes, and a seed which is not in the optimum conditions cannot be used for seeding.\"); Ex. 89 (Venezuelan Legislation 1980, No. 46 allowing a maximum of .5% wet (soft) rot for imported seed potatoes).\n\nDirectly or inferentially, others were not in accord with Dr. Potter. Carlos Araque, a surveyor with Supervisiones e Inspecciones Venezuela, C.A. (\"Sivenca\") was aboard on November 13 and smelled a \"[f]ermented odor.\" Ex. 115, p. 29. Certain bags had broken open and \"some potatoes [were seen] in a decomposition process.\" Ex. 84. Araque estimated that \"a maximum of 20% of the bags\" were spotted. Id. Returning on November 16, Araque opened ten of the 'tween deck's worst looking bags and estimated \"that no more than 10[%] of those potatoes were looking in bad condition.\" Ex. 115, pp. 21.\n\nYet, during a next day survey, Araque's perception was strikingly different.\n\n\"Q. Can you tell us what was your estimate of the extent of damage aboard the JETTE SIF which was observed on November 17th? . . . .\n\n\"A. At that time I couldn't realize the amount of damage.\n\n\"Q. Why . . .?\n\n\"A. Because it was so big.\"\n\nId., pp. 25-26.\n\nIndeed, Araque graphically recalled the red flags of extensive erwinia rotting.\n\n\"A. [J]uice from the potatoes stowed in the 'tween deck were falling down wetting the cargo into lower hold.\n\n\"Q. Was the water coming down from the 'tween deck rapidly or slowly?\n\n\"A. Rapidly. It was like rain. \"Q. What type of an odor was [there]?\n\n\"A. Decomposition. I mean ammonia. . . .\n\n\"Q. Was it . . . strong . . .?\n\n\"A. Yes.\n\nId., pp. 46-47.\n\nEven accounting for erwinia's acceleration rate, the November 17 palpable putrefaction renders suspect Araque's 10% decay assessment just the day before. That and his previous conservative estimate appear more likely the result of cursory perusals.\n\nDr. Jose Barreiro, a food science professor, related the results of an investigation performed by Biotec, his food industry consulting firm. Those findings are contained in the Biotec Report, which utilized a mathematical model to gauge the cargo's daily deterioration levels. As explained by Dr. Barreiro, the model is a standard decay measure that will identify some straightline rate since decomposition velocity is a constant. That ascertained straightline rate, however, \"could be any degree.\" T. 611.\n\nHere, the appraised decay percentages of the November 13, 16, 18 and 19 surveys were put into the model. Digesting that data, the methodology projected deterioration from the voyage's commencement until November 20. As summarized in the Biotec Report, the degradation was purportedly zero until November 12 climbing to 83% on November 20. The Biotec Report concluded that:\n\n\"[T]he deterioration . . . started between November 12 and 13 . . . . In this way, the cargo arrived . . . in sound condition. . . .\"\n\nId., p. 29.\n\nIn light of the other testimony (scientific and lay), the Biotec Report's projections cannot be accepted. The apparent misstep leading to those comparatively low assessments has been intimated - the systemic use of data from inspections that underestimated the deterioration levels.\n\nTwo such examinations (on November 13 with 1% and November 16 with 10%) were performed by Sivenica's Araque. The likely superficialities of those surveys already noted render unreliable their small percentages. The November 18 inspection was by Biotec's Emilio Saiz, who had never checked potatoes before and took no samples for laboratory analysis. His opinion that only 20% had spoiled by that late date also has to be questioned.\n\nOn November 20, Saiz did take samples that were analyzed by an agronomist, who assigned an 83% degradation. Those samples were taken from various 'tween deck stow areas extending from the top tier to the third down.\n\nThat inspection was not as cursory. Still, no tween deck potatoes were selected from the stern nor, most notably, from beneath the third tier. Below that tier were nine more layers and, as Dr. Potter remarked in general, stow temperatures are higher midload to the extent that a \"melting in the pile\" can occur. T. 344. Thus, the 'tween deck samples were not taken from where the infection was probably the worst.\n\nAdditionally, 10-15% of the unsampled lower hold bags, being visibly dry, were evidently assumed in good condition. That may have been unwarranted. Hence, while the November 20 survey's 83% spoilage rate was not as dubiously derived, that figure as well could be deflated.\n\nIn short, the Court rejects the Biotec Report's deterioration levels. When supplied with accurate data, the model may be a valid scientific tool. For the most part, dependable information seems to have been lacking here.\n\nThat view notwithstanding, Dr. Barreiro's regression check determined that the survey data correlated \"very well\" with the model. T. 612. Assuming the methodology's structural correctness, conceivably the correlation means that the inspections' estimates were all erroneously low, albeit in a mathematically consistent manner.\n\nBut there is further persuasive scientific testimony that calls for distrust of the Biotec model's findings. Drawing upon other information in the Biotec Report (including the ship's temperature, humidity and dew point records), Dr. Cargill calculated significantly higher degradation amounts. In doing so, Dr. Cargill, with many years of potato storage experience, offered a nonerwinia theory for their death, i.e., due to nearly continuous hold condensation and resultant increased pulp respiratory heat (BTU's), the potatoes suffocated.\n\nNoting first that plants lose their viability at \"5 to 6 BTU['s],\" Dr. Cargill gave his opinion on the potatoes' arrival condition.\n\n\"Q. [W]hen do the potatoes begin to lose their viability . . .?\n\n\"A. Based on this Biotec report, they started to lose their viability on . . . approximately the 4th of November . . . .\n\n\"Q. That's when it went above 6 BTUs?\n\n\"A. 7.2\n\n\"Q. What occurred when you had a BTU of 11 on [the] November 8th [arrival]? . . .\n\n\"A. That tells me that the potatoes were in a degenerated condition.\n\n\"Q. And?\n\n\"A. [T]he only way potatoes can have an 11 BTU . . . is degenerating . . . I'd like to say, rotting potatoes.\"\n\nT. 269.\n\nDr. Cargill's dying-on-arrival assessment not only contradicts the model's zero estimate (and other asserted levels) but coincides with the credited evidence, even though his calculations were from a suffocation analysis. When asked about accounts that the potatoes had died from erwinia infection, Dr. Cargill acknowledged being aware of the information but suggested that a plant pathologist be asked about it.\n\nWhile those erwinia reports undercut Dr. Cargill's position that suffocation was the primary decay factor, they are consistent with his contentions that the cargo holds had continuous condensation during the voyage and the potatoes characteristically responded with heightened respiration. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\" Such moist and heated holds would have been an erwinia favorable environment. So, besides their deleterious oxygen depriving effect, those conditions would have supplied erwinia with ideal ambient surroundings to perform its lethal operation. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\"\n\nThus, Dr. Cargill's coordinate theory substantiates that evidence conflicting with the model's results. Concomitantly, Dr. Cargill's circumscribed but cogent analysis - itself - is a distinct reason for rejecting the methodology's conservative calculations.\n\nFrom the preceding, then, it follows that whatever the exact percentage of decay upon the JETTE SIF's November 8 entry into Puerto Cabello harbor, the potatoes were unfit for planting. \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\"\n\n2. Seawater\n\nMuch evidence has been received concerning whether seawater penetrated the cargo holds. Ramon Soler, a chemical engineer and manager of SGS, S.A. (\"SGS\"), analyzed liquid samples taken about November 17 from the JETTE SIF. The method employed was a silver nitrate test that determines chloride presence but not quantity. Since chloride is an ocean mineral component, a positive response might indicate seawater entering the stow areas.\n\nSoler's test results were positive. But potatoes also contain chlorides, and Techni Alimentos, a laboratory, was requested to ascertain a sample's composition. Based on that sample's chloride amount and calcium-magnesium ratio, Techni Alimentos concluded that seawater was in the liquid.\n\nThat examination was conducted by Dr. Carin Soulavy. Dr. Barreiro sharply challenged her findings and the basis therefore. To illustrate, Dr. Soulavy testified that chlorides in potatoes were about 300-400 parts per million (\"ppm's\"). Dr. Barreiro, on the other hand, maintained that the figure was much higher, i.e., about 1,610 ppm's. Dr. Barreiro took particular issue with the determination that the identified 2,500 ppm's of chlorides pointed to seawater, which has 34-37,000 ppm's. The 2,500 ppm's figure, according to him, was much \"closer to the natural contents of . . . potatoes.\" T. 635. Similarly, he asserted that the reported calcium-magnesium ratio was well within the range of potatoes.\n\nConcerning this dispute, the Court accepts Dr. Barreiro's testimony, being corroborated by additional facts suggesting that ingress of seawater did not occur and that the liquid on the decks was from the shrinking potatoes. To be specific, potatoes are approximately 80% water, as previously mentioned. The Techni Alimentos sample was obtained about November 17. Araque saw liquid coming down \"like rain\" from the sacks that day. Ex. 115, p. 46. Thus, whether or not the sole origin, the decomposing cargo was a source of the deck liquid. See generally Ex. 119, p. 13 (Regarding the draining observed on the November 24 survey, Dr. Lastra stated that \"[I]t was a steady stream, like an open faucet.\").\n\nThe same cannot be said about seawater. Succinctly put, the means of entry - untainted by speculation - has not been exhibited. The ballast tank's minor hole had been repaired. Further, with that tank beneath, the lower hold's deck was not the ship's skin. The lower hold's deck and the ship's bottom, rather, were double barriers through which seawater would have had to pass before reaching the potatoes. Even if the pencil-sized puncture had remained unpatched, the ocean could not have invaded the lower hold unless its deck was not watertight. Of that, nothing has been shown.\n\nSpeculation has been advanced about leaking via the MacGregor hatch covers. Yet, in Wilmington, NCB's Geiser inspected those tops appraising them in good condition, and found their gaskets (for a tight seal) satisfactory. At Puerto Cabello, the November 23 Lloyd's inspection designated the covers and gaskets \"[i]n apparent sound order and condition.\" Ex. 120, p. 55. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\"\n\nAgainst that evidentiary background, seawater leakage is unproven. To the contrary, the scale tips the other way.\n\n3. Ventilation\n\nThe fans, as noted, were promptly turned on after loading and remained on during the voyage. Without much likely effect, the fans were also on at Puerto Cabello. Robert Carpenter's account is somewhat counter. Boarding in Puerto Cabello harbor on November 11, he heard a \"slight hum\" but \"didn't feel much air coming up.\" Ex. 125, p. 51. His recollection must be put in context.\n\nIf intact to Puerto Cabello, the vertical aisles collapsed after arrival. Supporting that inference, Araque saw the aisles clogged with fallen bags during a November 13 survey, probably traceable to unsecured stowing and rough seas. In subsequent days, the channels gave way, presumably from the potatoes' dehydration. On November 18, Dr. Jose Gonzalez, an agrononmist, discerned no passages. Biotec's Saiz perceived only \"vestiges of channels\" on November 18 and 20. Ex. 114, pp. 58-59. And when he was aboard on that latter date, Dr. Lastra saw no aisles.\n\nSo, when Robert Carpenter made his ventilation observations, the channels were no doubt disappearing. Rather than a separated stow through which ventilated air could move, the potatoes in each hold were compacting into a unitary mass. That consolidation would have prevented circulation, muffled the hum of the fans and accounted for Robert Carpenter's possible impression that the ventilation system was not fully functioning.\n\n4. Stow\n\nFocusing on the stow itself, to get more bags aboard at Wilmington, the aisles had been narrowed. The lower hold had been filled to the beams and the 'tween deck to the coamings. Upon leaving Wilmington, the ship was packed.\n\nAs attested by the Lloyd's Report compiled after a November 20 survey, that loading was an improper stow.\n\n\"BAGS WERE STOWED DEEP AND TIGHT, 12 OR MORE TIERS HIGH WITHIN TWEENDECKS, 10 OR MORE TIERS HIGH WITHIN LOWER-HOLDS, WITH LIMITED DUNNAGE AND MINIMAL VENTILATION CHANNELS (STOWAGE OF SUBJECT . . . CARGO CALLS FOR TIERS NOT TO EXCEED 8 IN HEIGHT AND FOR AMPLE DUNNAGE AND VENTILATION CHANNELS).\"\n\nEx. 57, CCC(5)(F).\n\nMaguregui, who had participated in that survey, observed that the stuffing would have impeded ventilation on a south bound journey with expectedly high temperatures and humidities. Apart from hindered circulation, he noted the more direct role of overloading in the erwinia infection's spread.\n\n\"A. [T]he more tiers you stow, you will exert greater pressure on the lower tiers. . . .\n\n\"Q. [T]he pressure put on the bottom sacks would cause water to ooze out of the potatoes?\n\n\"A. Water was oozing, and on its vertical descent . . . would contact potatoes below and create further soft rot.\"\n\nEx. 120, pp. 33-34.\n\nAll too plainly, the Wilmington stow facilitated the destruction of the potatoes.\n\n5. Nonrefrigeration\n\nConcerning this final problem before moving from Puerto Cabello to Dakar, the experts - for once - were united in their views that refrigeration would have slowed erwinia. While granting that soft rot works in cool conditions, too, Dr. Potter stressed the benefits of refrigeration.\n\n\"Q. If these potatoes had been carried in a refrigerated vessel and assuming that some of them had a half of 1 percent rot, would that have retarded the progression of the rotting . . .?\n\n\"A. That would have helped a great deal. . . .\n\n\"Q. [continuing] Definitely. [I]f somebody asked . . . how you should ship potatoes, I would say, in a refrigerated shipment, frankly, if I was the shipper, that's exactly what I'd be doing. I've been at sea myself and I would do that.\"\n\nT. 354-55.\n\nThe verity of Dr. Potter's opinion was affirmed by William Loggie, a salesman-manager with Canadian Packers, Inc., which exports 300-400 million lbs. of potatoes each year to Venezuela and elsewhere.\n\n\"Q. Why do you use refrigerated vessels, rather than electrically-ventilated vessels?\n\n\"A. Because we are responsible for delivery . . . of potatoes . . . suitable for the purpose . . . intended, and we found through experience, that potatoes will arrive in much better condition on refrigerated vessels, than they will on an electrically-ventilated vessel.\"\n\nT. 364-65. In accord with that responsibility and experience, Canadian Packers whenever possible has procured refrigerated vessels, \"[s]ince they became readily available on the market . . . approximately eight to ten years ago.\" T. 365. See also Ex. 117, p. 28 (Relative to Puerto Cabello, Port Inspector Enrique Gomez indicated that refrigerated vessels were becoming the norm, although acknowledging that prior to November 1981 \"some\" ventilated vessels arrived.).\n\nClearly, a refrigerated vessel would have impeded the erwinia process, enabling more potatoes to survive the voyage. Moreover, utilizing such a ship would have been consonant with commercial responsibility and developing industry custom.\n\nH. Dakar\n\nAfter being ordered from its berth by INP on November 25, 1981, the JETTE SIF left Puerto Cabello harbor about six days later. From there, the vessel obviously unable to re-enter the charter market, sought to rid itself of the rotted cargo. That mission was not fully accomplished until December 25. During the interim, the ship sought an equipped and willing discharge port. After ten other ports had been contacted, Dakar, Senegal, having laborers and gear, consented.\n\nCaptain Tyge Halse, a Larsen shoreside superintendent, met the JETTE SIF there on December 17. He described what he encountered.\n\n\"I discovered a strong rotten smell all over, and I told the captain I should like to . . . inspect hatches . . . and I open up the lip . . . and there was a swamp of half an inch large green shining flies, millions of them coming up, so I just slapped it again and got hold of a team who could fumigate the whole area.\"\n\nT. 26.\n\nA survey determined that less than half the original tonnage remained. Some potatoes had been dumped in the Puerto Cabello harbor area. The remainder had simply evaporated or had liquefied and been pumped out.\n\nWith hired workers and equipment, the vessel went to sea for four days to perform the clean out. Upon returning to Dakar, the JETTE SIF after more cleansing was at last fit at 12:00 on December 25 for the charter market.\n\nWith the voyage coming to that unfortunate end, this litigation was already underway, having been commenced on December 21, 1981. With additional facts being related where essential, we turn to the legal issues.\n\nII. CONCLUSIONS OF LAW\n\nAnalyzing the parties' claims will be simplified by resolving at this juncture numerous issues, some preliminary and others fundamental in nature.\n\nA. Preliminary Issues\n\n1. Choice of Law\n\nThe commercial transaction underlying this litigation was international and interstate, suggesting a choice of law inquiry. See Cardinal Shipping Corp. v. M/V SEISHO MARU, 1983 AMC 2573, 2576 (S.D. Tex.) (The Supreme Court in Romero v. International Terminal Operating Co., 358 U.S. 354, 382-83, 3 L. Ed. 2d 368, 79 S. Ct. 468 (1959) \"expanded the application of the broad principles governing choice of law problems to all maritime cases, noting that there must be due regard for the particular interests advanced by different aspects of maritime law and for the interacting interests of the United States and foreign countries.\"). See also Restatement (Second) of Conflict of Laws ยง 188 comment d, at 579 (1971) (\"Each issue is to receive separate consideration if it is one which would be resolved differently under the local law . . . of the potentially interested states.\").\n\nThe parties have not raised this matter. That silence coupled with their general citation to this forum's law (federal and state) suggests a tacit agreement. See Walter E. Heller \u0026 Co. v. Video Innovations, Inc., 730 F.2d 50, 52 (2d. Cir. 1984) (\"[I]n the absence of a strong countervailing public policy, the parties to litigation may consent by their conduct to the law to be applied.\"). See, e.g., El Hoss Eng'g \u0026 Transp. Co. v. American Indep. Oil Co., 183 F. Supp. 394, 399, (S.D.N.Y. 1960), rev'd on other grounds, 289 F.2d 346 (2d. Cir.), cert. denied, 368 U.S. 837, 82 S. Ct. 51, 7 L. Ed. 2d 38 (1961) (\"[N]either party has made any contention that the law of Kuwait governs . . . the agreement. Nor has either made any reference . . . to what the law of Kuwait . . . is . . . . Both have treated the case throughout on the basis that the law of the forum applies . . . . [T]his has the effect of a stipulation between them that the case should be governed by the law of the forum . . . .\") (cited by Heller).\n\nMore to the point, the parties refer to the law of neither foreign (Venezuela or Denmark) nor out-of-state (Michigan or Florida) jurisdictions arguably touched by the ranging business activities. They have relied on this jurisdiction's statutes and decisions. See generally Lopez v. Bulova Watch Co., 582 F. Supp. 755, 757 (D.R.I. 1984) (\"The parties have . . . briefed . . . in terms of Rhode Island law, so the court may accept the implicit premise that such law governs [the state] claims.\").\n\nBy their conduct, the parties have impliedly consented to an adjudication under this forum's jurisprudence. See Petroleo Brasileiro, S.A., Petro. v. Ameropan Oil Corp., 372 F. Supp. 503, 508 n.23 (E.D.N.Y. 1974) (\"The second cause of action . . . would appear . . . to raise a question of [Brazilian] law . . . . But . . . it also appears that despite the international character of the sale, the parties are content to have their contract rights determined under [the] New York [Uniform Commercial Code].\") (footnote omitted).\n\nAccordingly, United States maritime (principally, Second Circuit) and New York State law are controlling. Where appropriate, their statutory and decisional bodies will be looked to in the first instance.\n\n2. Robert Carpenter's Deposition\n\nRobert Carpenter was the leading actor in the events of this suit. He negotiated the potatoes' sale, oversaw the ship's chartering, partially supervised the loading and monitored the nondischarge. He was the one witness material to the sweep of this litigation.\n\nCarpenter's counsel intended to produce him for trial. But if she did not, APRA's counsel would have subpoenaed him. Larsen's counsel, too, apparently desired to elicit testimony from him. In brief, all counsel were interested in Robert Carpenter taking the stand.\n\nDespite that mutuality, Robert Carpenter did not show for the proceedings. By that time, he had ceased working for Carpenter and supposedly had been in Puerto Rico during much of the trial. Still, he was expected until the final day. The night before, Anthony Carpenter called his brother requesting his appearance. Robert Carpenter refused.\n\nPretrial, Robert Carpenter had been deposed. After a colloquy with counsel on the final day, the Court, rather than delaying the proceedings, directed that Larsen and APRA could use Robert Carpenter's deposition with the sections determined by them. See Fed. R. Civ. Pro. 32(a)(2) (permitting an adverse party to offer against a corporation part or all of the prior testimony of a deponent holding an enumerated corporate management position when deposed).\n\nCarpenter, in contrast, would be limited to offering portions that fairly should be read with those sections submitted by the others. See Fed. R. Civ. Pro. 32(a)(4) (permitting the nonoffering party to have corresponding deposition parts received \"in fairness\"). As it had earlier indicated, the Court at the time of that directive was unfamiliar with Robert Carpenter's deposition in view of his expected appearance. Additionally, since much of the trial focus was on expert testimony, the Court was not entirely cognizant of Robert Carpenter's importance as a fact participant.\n\nAs it turned out, no witness took part in the pertinent events to the extent Robert Carpenter did. And to properly understand those incidents, the Court believes its inherent authority permits considering his full deposition. See generally McCormick on Evidence ยง 8, at 12 (E. Cleary 2d. ed. 1972) (\"[T]he parties . . . have the primary responsibility for finding, selecting, and presenting the evidence. However, our system of party-investigation and party-presentation has some limitations. It is a means to the end of disclosing the truth and administering justice, and for reaching this end the judge may exercise various powers.\"); United States v. Brandt, 196 F.2d 653, 655 (2d. Cir. 1952) (\"[The judge] enjoys the prerogative, rising often to the standard of a duty, of eliciting those facts he deems necessary to the clear presentation of the issues. . . . To this end he may call witnesses on his own motion, adduce evidence, and himself examine those who testify.\").\n\nIn that manner, the Court sua sponte reconsiders the prior directive and receives Robert Carpenter's unedited deposition. See generally 9 Wigmore on Evidence ยง 2484, at 282 (J. Chadbourn rev. ed. 1981) (\"That the trial judge has no power to cause the evidence produced by the parties to be supplemented never will be conceded so long as the bench retains a true conception of its constitutional function and a due sense of self-respect.\"); Miller v. United States, 354 F.2d 801, 805 (8th Cir. 1966) (\"[T]he trial judge alone is responsible for fact determinations and conclusions to be drawn therefrom. He therefore has a special interest in bringing out all of the truth, in thoroughly understanding the testimony of the witnesses . . . .\").\n\n3. Joint Venture\n\nThe Carpenter corporations have been referred to as one, being joint venturers in the sale-charter. Under New York law, a joint venture is:\n\n\"a special combination of two or more persons wherein some specific venture a profit is jointly-sought without any actual partnership or corporation designation.\"\n\nSee Sherrier v. Richard, 564 F. Supp. 448, 457 (S.D.N.Y. 1983).\n\nA joint venture is contractual and may be oral. See id. In fact, the agreement's existence \"may be inferred from the conduct of the parties in the performance of the joint enterprise.\" See 16 N.Y. Jur. 2d Business Relationships ยง 1582, at 258 (1981) (footnote omitted).\n\nTowards that inquiry, the \"crucial factors\" are:\n\n\"intent . . ., [which may be] express or implied, . . . joint control and management of the business, . . . sharing of profits and losses, and . . . a combination of property, skill or knowledge.\n\nSee Sherrier v. Richard, 564 F. Supp. at 457.\n\nTaking them out of order, the joint control-management and combined resources requisites can be addressed in tandem. The corporations' unitary and intrafamilial structure alone almost satisfies these. A.C. Carpenter, Inc. (\"AC\") and A.A. Carpenter, Inc. (\"AA\") share the same offices, telephones and employees. AA's sole stockholder is Anthony Carpenter, who is also an AC stockholder as is his stepmother Doris and brother Robert. Anthony, as mentioned, is president of both.\n\nWith respect to this business deal, Robert Carpenter was essentially a salesman for both corporations during the relevant period. AC purchased the potatoes in Michigan, sold them to AA and chartered the JETTE SIF. AA bought the potatoes from AC, contracted with APRA and shipped the cargo. In each instance, Robert Carpenter was the focal figure for both corporations - their joint control-management and combined resources flowing through him.\n\nGiven that structural mixture and Robert Carpenter's pivotal role in each phase of the enterprise, the unity factors - of necessity - are met. See 16 N.Y. Jur. 2d ยง 1585, at 260 (\"To constitute a joint venture, the parties must have a community of interest in the . . . undertaking and equal authority . . . . It is not enough . . . that the parties agree to act in concert . . . unless there is a coagulation of property, profits, or other interests which the parties hold jointly and which are made accessible to each under the confidential relationship which exists between them.\") (footnotes omitted).\n\nConcerning the agreement factor, Anthony Carpenter vacillated at trial as to whether one had been fashioned, when it had been reached, etc. Thereafter, he was confronted with his deposition outlining just such an agreement (responsibilities, costs reimbursement and profit-loss division) along with describing subsequent occurrences consonant with that accord. Anthony Carpenter then acknowledged that prior testimony.\n\nAs a prior inconsistent statement, the previous sworn account was receivable for its impeachment value and its truth. See Fed. R. Evid. 801(d)(1)(A) (\"A statement is not hearsay if . . . [t]he declarant testifies at the trial . . . and is subject to cross-examination concerning the statement, and the statement is . . . inconsistent with his testimony, and was given under oath subject to the penalty of perjury . . . in a deposition . . . .\"). See also Fed. R. Evid. 801(d)(2) (C) (similarly sanctioning an out-of-court statement's reception for its substance when given by a party's authorized representative).\n\nAnthony Carpenter's deposition admissions, in particular, supplemented by credited portions of his witness stand testimony and other evidence demonstrates that a joint venture agreement was intended, attained and performed. See generally Stone v. First Wyoming Bank, 625 F.2d 332, 340 (10th Cir. 1980) (\"[S]ince the joint venture is a contractual relationship, the intent of the parties is controlling and is to be gleaned, in the absence of an express agreement, from the conduct, the surrounding circumstances, and the transactions between the parties.\").\n\nFinally, a profit-loss division (the most important element) did transpire. Anthony Carpenter's in-court testimony again varied from his deposition version. Compare T. 553 ($90,000 for AC and $22,000 for AA) with Ex. 124, p. 65 (split in half). Regardless, whatever the figures, profits were divided. Cf. Demian, Ltd. v. Charles A. Frank Associates, 671 F.2d 720, 723 (2d. Cir. 1982) (\"We do not question the . . . finding that no joint venture existed . . . since there is no evidence of profit or loss sharing . . ., which is essential to recovery on a joint venture theory.\").\n\nAll factors present, the Carpenter corporations were joint venturers.\n\n\"Since the rights, duties, and liabilities of joint venturers are governed by rules similar . . . to those governing . . . partners, joint venturers may be jointly and severally liable to third parties for the debts of the venture.\n\nSee 16 N.Y. Jur. 2d ยง 1594, at 274-75 (footnotes omitted).\n\nIn brief, for this suit, the Carpenter corporations are legally tied. Liability for one is liability for both. See Rowe v. Brooks, 329 F.2d 35, 39 (4th Cir. 1964) (\"We hold that the arrangement entered into verbally . . . constituted a joint venture, imposing responsibility on both . . . for liability incurred . . . .\").\n\nB. Fundamental Issues\n\n1. Carriage Contract\n\nThe first carriage contract candidate is the charter party, a maritime agreement:\n\n\"by which the charterer . . . obtains the use and service of all or some part of a ship for a period of time or a voyage or voyages.\"\n\nSee Trowbridge, The History, Development, and Characteristics of the Charter Concept, 49 Tul. L. Rev. 743, 745 (1975) (footnote omitted).\n\nThe second is the bill of lading, more easily described by its possible functions - the carriage contract being one.\n\n\"A bill of lading is . . . an acknowledgment by a carrier that it has received goods for shipment. Secondly, the bill is a contract of carriage. Thirdly, if the bill is negotiable . . . it controls possession of the goods . . . .\"\n\nSee G. Gilmore \u0026 C. Black, The Law of Admiralty ยง 3-1, at 93 (2d ed. 1975) (footnote omitted) (\"Gilmore \u0026 Black\").\n\nBoth documents are employed in the two major types of marine cargo transport: common and private.\n\n\"The common carrier . . . [is] . . . one who holds himself out to the public as engaging in the business of transporting goods . . . for compensation and who offers his services to the public generally. . . . The vessel engaged in common carriage usually carries many independent shipments . . . . This is the opposite of private carriage, which exists either where the shipowner leases the entire . . . vessel to one person or where only one shipment takes up the whole . . . vessel. If either the entire capacity . . . is leased to one person or one shipment takes up the entire . . . vessel, the carriage will be deemed private carriage, even though the contract of carriage may be in . . . a bill of lading. Conversely, if there are two or more independent shipments . . . on board . . ., the carriage will be deemed common carriage, even though the contract of carriage . . . is . . . a charter party.\n\nSee Zock, Charter Parties in Relation to Cargo, 45 Tul. L. Rev. 733, 737 (1971) (footnotes omitted) (\"Zock\").\n\nFurthermore, if the agreement remains private with no bill issued or transferred, the carriage contract is not subject to federal statutory law; and, importantly, the charter party alone may be controlling.\n\n\"[P]arties to a private contract of carriage such as [a] charter party . . . are not subject to the rigid legal regime imposed by law on common carriers by water under . . . the Carriage of Goods by Sea Act [COGSA], 46 U.S.C. ยงยง 1300-15. Where no bill of lading is issued for the cargo, the parties to a charter party enjoy freedom of contract to allocate between themselves responsibilities for loading and stowing the cargo and any necessary preparations.\"\n\nSee Fernales Shipping Co. v. Bonaire Petroleum Corp., 733 F.2d 381, 383-84 (5th Cir. 1984). \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\"\n\nThat freedom often inures to the shipowner's benefit.\n\n\"[T]he shipowner engaged in private carriage is not deemed an insurer of the safe arrival of the cargo. The private carrier is liable for . . . damage to cargo only if . . . proximately caused by his breach of a specific obligation imposed . . . by the contract of carriage. [T]he parties to a contract of private carriage enjoy complete freedom to adjust the risk . . . . Thus, . . . the shipowner can . . . avoid liability for any cause, including liability for his own negligence . . . . Further, absent express contractual incorporation, the relations between the parties to a contract of private carriage are never subject to the provisions of . . . COGSA. In sum, the shipowner's liability . . . will be determined by the obligations imposed [in the contract of private carriage].\n\nSee Zock, 45 Tul. L. Rev. at 738-39 (footnotes omitted). See also 2A Benedict on Admiralty ยง 22, at 3-2, 3 (M. Cohen 7th ed. 1985) (\"Benedict \") (\"[I]f the contract is one of private carriage, the carrier may, by the stipulations of the contract . . . exempt itself from liability for any cause . . . .\").\n\nIn this hire, the contract leasing the entire vessel was for a private carriage. See id., at 3-2. (\"Where one shipper's cargo takes up the full reach of the ship, it will be presumed . . . that the ship is a private carrier . . .\").\n\nAnd this private carriage contract was a voyage charter party. See Nissho-Iwai Co. v. M/T STOLT LION, 617 F.2d 907, 914 (2d Cir. 1980) (\"Under a voyage charter the charterer engages the vessel to carry goods only for a single voyage . . . .\"); Vandeventer, Analysis of Basic Provisions of Voyage and Time Charter Parties, 49 Tul. L. Rev. 806, 806 (1975) (\"Under [a] voyage . . . charter part[y], the shipowner retains possession, management, and control of his ship. . . . [T]he shipowner puts his ship at the charterer's disposal generally for the carriage of a full cargo from one or more ports to a named port or ports . . . at rates agreed in advance.\").\n\nAll of which does not preclude the bill from affecting this ocean transport. To the point, since the bill was issued to Carpenter and subsequently transferred to APRA, COGSA could define the receiver's legal relationship with the shipowner.\n\nThat far reaching statutory scheme in part states:\n\n\"Every bill of lading . . . which is evidence of a contract for the carriage of goods by sea to or from ports of the United States, in foreign trade, shall have effect subject to the provisions of this chapter.\"\n\nSee 46 U.S.C. ยง 1300 (emphasis added). See also 46 U.S.C. ยง 1302 (\"[Under every contract of carriage of goods by sea, the carrier in relation to the loading, handling, stowage, carriage, custody, care, and discharge of such goods, shall be subject to the responsibilities and liabilities and entitled to the rights and immunities set forth in . . . this title.\").\n\nYet, if the bill is not \"evidence of [such] a contract\", the transport may be clear of COGSA.\n\n\"In . . . private carriage where the cargo owner and vessel owner have entered into a . . . charter party, any bill of lading which may be issued serves only as a receipt for the cargo and, when in negotiable form, as an indicia of title. . . . [The bill of lading's] provisions . . . are not contractual, the contract of carriage being the charter party alone.\"\n\nSee 2A Benedict ยง 34, at 4-13 (emphasis added; footnote omitted).\n\nThat COGSA is and should be extraneous to an unnegotiated bill-receipt is plain enough. See Zock, 45 Tul. L. Rev. at 746 (\" [A] bill of lading is deemed merely a receipt when it is issued to . . . the charterer. COGSA does not apply to such a bill of lading, because it does not evidence a contract of carriage between the shipowner and the charterer.\") (footnote omitted). See, e.g., Amtraco Corp. v. S.S. SANTONA, 1979 AMC 2585, 2590-91 (S.D.N.Y.) (\"The relations between the parties . . . are governed by . . . the voyage charter party executed by [the shipowner] and [the shipper]. This agreement constitutes a private contract of carriage, to which the provisions of COGSA are not applicable. [A] bill of lading was issued but, remaining in the hands of the partnership [between the shipper and the receiver], it was merely a receipt and did not . . . alter the . . . contract.\").\n\nLess plain is COGSA's irrelevance when the bill is negotiated to a charter party nonsignatory. As indicated, the document may simply become a bill-indicia of title outside COGSA's realm. See 2A Benedict ยง 34, at 4-13; id., ยง 44, at 5-6.\n\nBut for that to occur, 1) the bill must incorporate the charter party by reference and 2) the ultimate holder must have actual or constructive notice of that incorporation. With respect to an arbitration clause dispute, the District Court in Midland Tar Distillers, Inc. v. M/T LOTOS, 362 F. Supp. 1311, 1313 (S.D.N.Y. 1973) recognized those requirements.\n\n\"The bill of lading will be found to incorporate an arbitration clause contained in the charter party and will be made subject to it when the bill clearly refers to the charter party and the holder of the bill has either actual or constructive notice of the incorporation.\"\n\nSee also H. Tiberg, The Law of Demurrage 588 (2d ed. 1971) (\"If [the receiver] is to be held liable under the same terms as the charterer he must therefore be given notice of the charterparty terms. . . . [T]he incorporation . . . is usually effected by means of a reference: 'Freight and all other conditions as per charterparty (dated . . .)'.\") (emphasis in original). Cf. 2A Benedict ยง 34, 4-13 (\"[I]f after securing from the carrier a bill of lading in negotiable form which makes no reference to any charter party between shipper and vessel owner, the shipper endorses the bill of lading over to a purchaser . . . without notice of the . . . charter party, the terms of the latter instrument are not binding on the purchaser; between him and the carrier the bill of lading is the contract of carriage.\") (footnote omitted).\n\nThis bill was transferred to charter party nonsignatory APRA. The inquiry, then, in resolving whether APRA's legal relationship with Larsen is charter party or COGSA governed sights on the incorporation and notice requirements. Regarding incorporation, the Second Circuit in Son Shipping Co. v. DeFosse \u0026 Tanghe, 199 F.2d 687, 688 (2d Cir. 1952) instructed:\n\n\"Where the terms of the charter party are . . . expressly incorporated into the bills of lading they are a part of the contract of carriage and are binding upon those making claim . . . for the breach of that contract just as . . . if the dispute were between the charterer and the shipowner.\"\n\nSee also Bauer, Responsibilities of Owner and Charterer to Third Parties - Consequences Under Time \u0026 Voyage Charters, 49 Tul. L. Rev. 995, 1001-02 (1975) (\"The leading case is Son Shipping. . . where the bill of lading stated that 'all the terms whatsoever of the . . . charter except the rate and payment of freight . . . govern the rights of the parties concerned in this shipment. The court held that all terms . . . were incorporated into the bills of lading, stating that the breadth of language 'leaves no fair doubt as to the meaning of the parties.'\") (emphasis in original; footnotes omitted).\n\nThis bill did have a charter party incorporation reference. So, the inquiry's focus narrows further to whether APRA had actual or constructive notice of the reference. Regarding notice, the District Court in Henkel, K.G. v. M/T STOLT HIPPO, 1980 AMC 2618, 2619 (S.D.N.Y.) commented:\n\n\"Nor is there any significance to the fact that neither plaintiff [cargo holder in due course] nor defendant [shipowner] was a signatory . . . : cargo owners like plaintiff, . . . are seldom signatories to the incorporated charter party, but will nonetheless be bound by its terms so long as the incorporation is sufficient to give the cargo owner fair notice . . . .\"\n\nSee also Amoco Overseas Co. v. S.T. AVENGER, 387 F. Supp. 589, 593 (S.D.N.Y. 1975) (\"[T]he courts . . . require that the charter party be identified specifically enough to give such meaningful notice to the eventual holders of the bill of lading.\").\n\nTo properly notify, the charter party incorporation on a bill must be a manifest reference. See generally McMahon, The Hague Rules and Incorporation of Charter Party Arbitration Clauses into Bills of Lading, 2 J. Mar. L. \u0026 Com. 1, 7 (1970) (\"[A] general reference such as 'subject to all terms, conditions and exceptions' of a specifically designated charter party is sufficient . . . . . . . [F]ailure to specifically designate the charter party referred to, as by leaving blanks in the reference clause of the bill of lading incomplete, will cause the charter . . . to fail of incorporation.\") (footnotes omitted). But see G. Robinson, Admiralty Law ยง 56, at 403 (1939) (\"[T]he shipowner . . . will want to bring to the notice of [the cargo interests] the [lien clause] right which he has reserved under the charter. . . . If the bill of lading issued provides 'Right as per charter', or similar language, this subjects the goods to a lien for charter freight.\") (footnote omitted).\n\nThe capitalized incorporation clause on this bill's face is certainly conspicuous.\n\n\"THIS BILL OF LADING SUBJECT TO ALL THE TERMS, CONDITIONS, PROVISIONS AND EXCEPTIONS OF THE COVERING CHARTER PARTY.\"\n\nEx. 14.\n\nTrue, the charter party was not designated with particularity. See State Trading Corp. of India v. Grunstad Shipping Corp. (Belgium) N.V., 582 F. Supp. 1523, 1524 (S.D.N.Y. 1984) (\"The bill of lading here contains 'unmistakeable language' incorporating . . . the charter party, including the arbitration clause: 'All terms and conditions, liberties and exceptions of the charter-party, dated as overleaf, are herewith incorporated.'\") (footnote omitted). But see W. Tetley, Marine Cargo Claims 47-48 (1965) (\"When . . . the holder of the bill of lading is not a party to the charterparty, then the bill of lading is the contract. [N]evertheless, the terms of the charterparty will apply if the bill of lading invokes 'all the terms, conditions and exceptions of the charterparty.'\") (footnote omitted).\n\nNotwithstanding, APRA should not have been confused about which carter party was alluded to. Ortega left the vessel's chartering to Robert Carpenter. And Ortega admitted that \"a day or two after the ship left Wilmington\", he was informed by Robert Carpenter that the JETTE SIF had been hired. T. 418. Surely, the bill's nonspecific reference should not have left Ortega in doubt about which charter party had been incorporated. See generally Scrutton on Charterparties and Bills of Lading 65 (A. Mocatta, M. Mustill \u0026 S. Boyd 19th ed. 1984) (\"Scrutton\") (\"Where the incorporating clause refers to, but does not identify, a charterparty, the court will assume that the reference is to any charter under which the goods are being carried.\") (footnote omitted).\n\nThe problem is more perplexingly basic. To be precise, Ortega did not \"see\" the capitalized incorporation clause, which was front and center on the bill's face and just beneath the Master's signature.\n\n\"Q. When you saw the bills of lading . . . for the first time, with Mr. Carpenter, in Banco Provincial in Caracas, on November 10th, d[id] you notice the [incorporation] sentence . . .? \"A. I am not too familiar with maritime businesses. Honestly, . . . we did not see this clause . . . .\"\n\nT. 423-24 (emphasis added).\n\nOrtega did not \"see\" the clause because he apparently just skimmed the bill. T. 478. His lack of caution was imprudent in an international transaction involving a substantial outlay. It now has legal consequences under fundamental contract-notice principles. See 3 A. Corbin, Corbin on Contracts ยง 607, at 656 (1960) (\"One who . . . accepts a written instrument without reading it with care is likely to be surprised and grieved at its contents later on. In most cases, he has been held bound in accordance with its written terms.\") (footnote omitted); Livingston \u0026 Gilchrist v. Maryland Insurance Co., 11 U.S. (7 Cranch) 506, 537, 3 L. Ed. 421 (1813) (\"It is a general rule, that a paper, which expressly refers to another paper, within the power of the party, gives notice of the contents of that other paper.\").\n\nThus, by general contract-notice law, APRA can be held to have had at least constructive notice of the incorporation reference. See 42 N.Y. Jur. Notice and Notices ยง 3, at 384 (1965) (\"Negligent ignorance . . . frequently has the same effect in law as actual knowledge.\") (footnote omitted). See, e.g., Avila Group, Inc. v. Norma J. of California, 426 F. Supp. 537, 540 (S.D.N.Y. 1977) ( A fabric buyer's president signed the seller's order form without reading the arbitration provisions on the back and plainly referred to on the front. The buyer was subject to the unseen clauses with the District Court marking the \"rule that a person of ordinary understanding and competence will be bound by the provisions of a contract that he signs whether or not he has read them.\") (footnote omitted).\n\nIn addition, however, a specifically applicable commercial standard affords another more conduct-defining basis for reaching the same result. To elaborate, Ortega essentially testified that APRA routinely relies on its banks to review the shipping documents.\n\n\"Q. If the bill of lading had . . . said, for example, two thousand bags rotted\n\n\"Q. [continuing] . . . [W]ould you have authorized payment by your bank under the letter of credit?\n\n\"A. The documents go also to the bank. . . .\n\n\"A. [continuing] The banks responds in our favor. Regularly we just check the quantity and the dates.\"\n\nT. 478. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\"\n\nBy an express letter of credit provision, those reviews were subject to the Uniform Customs and Practice for Documentary Credits (1974 Revision), International Chamber of Commerce Publication No. 290, reprinted in, McKinney Forms, U.C.C. ยง 5-102 - Form 1 (West 1965 \u0026 1985 Supp.) (\"UCP\"). \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\"\n\nUnder the UCP's article 7, Republic National and Banco Provincial were required to:\n\n\"examine all documents with reasonable care to ascertain that they appear on their face to be in accordance with the terms of the credit.\"\n\nIf, after examining the papers (including the bill) with \"reasonable care\", the banks concluded that the documents were not in strict compliance with the letter of credit, payment to Carpenter could have been refused.\n\n\" The rule of strict compliance . . . applies with special force. At least in theory the bank must reject a tender which deviates in the slightest degree from the ideal.\"\n\nSee Gilmore \u0026 Black ยง 3-13, at 121. See also Venizelos, S.A. v. Chase Manhattan Bank, 425 F.2d 461, 465 (2d Cir. 1970) (\"[T]he essential requirements of a letter of credit must be strictly complied with by the party entitled to draw against the letter . . ., which means that the papers, documents and shipping descriptions must be as stated in the letter.\").\n\nDishonor would have effectively stopped the sale-charter transaction. Instead, confirmer Republic National paid Carpenter's sight draft on November 2, 1981, the documents \"BEING FOUND IN ORDER.\" Ex. 83. Nor on November 10 did issuer Banco Provincial reject the documents.\n\nLast in the chain, Ortega that same day did not object. Irrespective of the banks' examinations and APRA's casual practices, Ortega representing the letter of credit account party likewise should have scrutinized the documents. See H. Harfield, Bank Credits and Acceptances 107-08 (5th ed. 1974) (\"[T]he [letter of credit] account party should be certain that documents are in order before exercising any dominion over them . . . .\").\n\nIndeed, UCP article 19(a)(ii) authorized the bill's repudiation.\n\n\"Bills of Lading . . . will be rejected . . . which are issued under and are subject to the conditions of a Charter-Party.\"\n\nThis fact remains: The banks and Ortega did not disapprove the bill with its obvious incorporation reference, despite the UCP's requisite reviews. Having accepted that document with the others, the banks and Ortega must be deemed - in effect - to have performed those reviews. See generally H. Harfield, Letters of Credit 66 (1979)\n\n(\"[Acceptance . . . precludes the obligor [issuer] from a subsequent assertion that the documents were not in compliance with the . . . credit.\") (footnote omitted). Cf. Voest -Alpine International Corp. v. Chase Manhattan Bank, 707 F.2d 680, 683 (2d Cir. 1983) (\"[N]othing in the purpose or function of letters of credit forecloses the party from giving up its rights.\"). \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\"\n\nAnd when doing so, they should have seen the bill's clause. Therefore, with general contract-notice law and a specifically applicable commercial standard serving as bases, APRA must be charged with constructive notice of the charter party incorporation reference. See Bierzynski v. New York Central Railroad Co, 31 A.D.2d 294, 297 N.Y.S.2d 457, 461 (N.Y. App. Div. 1969), aff'd, 29 N.Y.2d 804, 327 N.Y.S.2d 365, 277 N.E.2d 412 (1971) (\"'Constructive notice . . . exists whenever it is shown that reasonable diligence would have produced actual notice.'\") (quoting 42 N.Y. Jur. Notice and Notices ยง 3, at 382 (1965)).\n\nWere the Court to hold otherwise, a shipowner, whose post-COGSA contractual freedom has been preserved by case law, could not protect itself from a third party cargo interest, who - contrary to elementary business conduct - simply does not \"see\" a patent incorporation reference. Apart from being unwilling to countenance haphazard commercial practice, the Court will not contribute to the erosion of that contractual freedom.\n\nAccordingly, the manifest incorporation reference constructively noticed, the charter party (not the bill-indicia of title) is the carriage contract and its terms (not COGSA) governs the legal relationships in the potatoes' transport.\n\n2. Causation\n\nWithin the factual framework of another maritime case, the Second Circuit has said of proximate cause that:\n\n\"Liability must rest on causal relationship between the negligent aspect of the conduct and the harm resulting from the conduct. Where the absence of up-to-date manuals and charts is an unseaworthy condition, the damage that is proximately caused by this unseaworthiness is such damage as is attributable to inadequacy of the out-of-date materials.\"\n\nSee American Smelting and Refining Co. v. S.S. IRISH SPRUCE, 548 F.2d 56, 60 (2d Cir.), cert. denied, 431 U.S. 955, 97 S. Ct. 2678, 53 L. Ed. 2d 272 (1977).\n\nHelpfully, in isolating this suit's proximate cause, certain facts are not disputed and others are indisputable. To begin, potatoes can be stored up to \"a couple of years.\" T. 301. These September 1981 harvested potatoes died in November 1981 principally from erwinia induced soft rot. That condition was on the potatoes when harvested due to the bacteria inhabiting the earth. More importantly, as the federal-state certificates attest, erwinia had penetrated a small percentage of the potatoes in Michigan.\n\nAfter reviewing those certificates, Dr. Potter put the minor infection within a time context.\n\n\"A. [I]n most cases, no soft rot was indicated but that a half a percent was shown. . . . I don't like to see it, naturally, but it is tolerable and it will pass inspection. According to present rules.\n\n\"Q. When you say it's 'tolerable', it is tolerable [when the inspection was made]?\n\n\"A. Yes.\n\nT. 307.\n\nSubsequently, Dr. Potter tied that \"tolerable\" Michigan soft rot to the infection which spread during the voyage.\n\n\"Q. [I]n the samples that did show . . . up to one-half of 1 percent soft rot, . . . is there the possibility that those potatoes were already infected with Erwinia bacteria . . . at the time they were inspected? . . .\n\n\"A. Yes. I think the inspection tells you that right there.\n\n\"Q. So the very fact that it says one-half of 1 percent soft rot indicates that . . . there is Erwinia bacteria in that sample?\n\n\"A. That sample, yes. That's what he tells you. . . .\n\n\"Q. Would you please take a look at . . . the outside air temperature[s] supplied into the surface space aboard the vessel. . . .\n\n. . .\n\n\"Q. [P]lease go down those temperatures . . . through . . . November the 12th . . . . . . .\n\n\"Q. [continuing] What happens to that one-half of 1 percent soft rot?\n\n\"A. [U]nder those circumstances, . . . you are going to spread the infection. That's quite obvious, I think.\"\n\nT. 335-38 (emphasis added). See also Ex. 123, pp. 23-28 (Dr. Gonzalez agreed that once entering a potato, erwinia will multiply - its growth rate dependent on temperature and humidity. He additionally observed after perusing the JETTE SIF's voyage temperatures that, \"If you have any kind of infection, these temperatures favor the development of the disease.\"). See generally T. 688, 698-99 (Although believing that the Puerto Cabello arrival spoilage was \"insignificant\", Dr. Barreiro affirmed the general proposition that .5% postharvest soft rot in a potato is traceable to erwinia and that under temperature and humidity advantageous conditions, the decay will multiply.\n\nConsidered with all the credited evidence, the certificates' \"tolerable\" erwinia soft rot was the causal connection to the expanded decay. The next stage was the cargo's destruction, unbrokenly linked to erwinia's preloading invasion. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\" See T.J. Stevenson \u0026 Co. v. 81,193 Bags of Flour, 629 F.2d 338, 350 (5th Cir. 1980) (\"The [preloading] presence of 'only' partial [weevil] infestation [of a flour cargo] is roughly the equivalent of being only 'a little bit pregnant.'\").\n\nPut differently, had erwinia been absent from the pulps before the Wilmington stowing, the potatoes would not have spoiled as quickly as they did. Given that direct relationship between the preloading infection and the eventual destruction, the proximate cause of the loss, was the furnishing of erwinia laden potatoes at Wilmington. \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\" See generally American Smelting and Refining Co. v. S.S. IRISH SPRUCE, 548 F.2d at 60.\n\nRelatedly, along with proximate cause, erwinia qualifies for another legal label - inherent vice. See Vana Trading Co. v. S.S. METTE SKOU, 556 F.2d 100, 104 (2d Cir.), cert. denied, 434 U.S. 892, 98 S. Ct. 267, 54 L. Ed. 2d 177 (1977) (\"The Supreme Court has accepted a jury charge defining [inherent vice] as '\"any existing defects, diseases, decay or the inherent nature of the commodity which will cause it to deteriorate with a lapse of time.\"' Missouri Pacific R.R. v. Elmore \u0026 Stahl, 377 U.S. 134, 136, 138-39, 12 L. Ed. 2d 194, 84 S. Ct. 1142 . . . (1964).\") (footnote omitted).\n\nDr. Potter described erwinia as \"[c]ommon . . . the world over\" and \"a soil inhabitant.\" T. 298. See also Ex. 123, p. 22 (Dr. Gonzalez concurred, stating that erwinia was \"[a]ll over the world\" and \"[v]ery common.\"). Necessarily, whether inside the pulps or on the skins, erwinia is a natural passenger of potatoes extracted from soils worldwide.\n\nConcerning this common pathogen's decay producing capacity, Dr. Potter designated it \"[t]he greatest degrader of all kinds of vegetables.\" T. 298. See generally T. 590 (Dr. Barreiro called erwinia a \"classical source of deterioration.\").\n\nQuite normally, then, the potatoes carried their future ruination. That being true, they possessed an inherent vice. See Parks, Marine Insurance: Proximate Cause, 10 J. Mar. L. \u0026 Com. 519, 530 (1979) (\"Parks\") (\"It is a vice which is an innate or natural or normal quality of the goods. . . . . For example, meat becoming putrid . . . or fruit becoming rotten . . . .\").\n\nAll that was required for massive decomposition was hot and humid trip conditions. See Scrutton, at 226-27 (\"By 'inherent vice' is meant the unfitness of the goods to withstand the ordinary incidents of the voyage, given the degree of care which the shipowner is required by the contract to exercise in relation to the goods. Thus a tendency of the goods to heat, discolour, rot, or evaporate . . . may . . . constitute inherent vice.\") (footnotes omitted). See, e.g., Midwest Nut and Seed Co. v. S.S. GREAT REPUBLIC, 1979 AMC 379, 384 (S.D.N.Y.) (\"[T]his [pistachio nut] cargo is one with an inherent vice [of mold] . . . . From the testimony of experts it is established that the atmospheric conditions in [the growing area and loading port] at the time the cargo was prepared for shipment that the development of . . . mold could have been present, and there was sufficient warmth and humidity to lay the basis for growth of the toxin. Moreover, shipment in containers without refrigeration and in an almost closed atmosphere seems close to the optimum conditions . . . for development of [mold].\").\n\nErwinia being an inherent vice has legal import. More precisely, when the inherent vice possibility is advanced, a weighty burden is cast upon the shipper to prove the cargo's good condition before loading. See id. 1979 A.M.C. at 383-84 (\"Where cargo damage may have resulted from a hidden defect, the burden is on the shipper to establish that the cargo was delivered in good condition.\").\n\nThat burden is not shouldered by producing the bill, which in this instance said:\n\n\"SHIPPED on board in apparent good order and condition . . . .\"\n\nEx. 14. See also Hecht, Levis \u0026 Kahn, Inc. v. S.S. PRESIDENT BUCHANAN, 236 F.2d 627, 631 (2d Cir. 1956) (\"[W]hen deterioration . . . may have resulted from a hidden defect, the shipper . . . must present some evidence beyond the bill of lading since the bill of lading is evidence only of apparent or external good condition.\").\n\nEven if listing no soft rot, the federal-state certificates would be inadequate. See Midwest Nut and Seed Co. v. S.S. GREAT REPUBLIC, 1979 A.M.C. at 384 (\"Where the damage is caused by an inherent vice, a certificate of the Department of Agriculture will not suffice to meet the shipper's burden of delivery to the carrier in good order . . . .\"). By identifying soft rot, the certificates, in fact, are affirmative inherent vice evidence.\n\nAt any rate, besides those and the bill, Carpenter has submitted nothing else. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\" See Commodity Service Corp. v. Hamburg-American Line, 354 F.2d 234, 234 (2d Cir. 1965) (\"The district judge found that [the shipper] failed to sustain that burden. Neither the certification of the 'fatbacks' by the Department of Agriculture nor the recitation in [the shipowner's] bill of lading establishes the good order of the cargo, since both refer only to the external condition . . . and do not reveal the possibility of inherent defects.\").\n\nAbsent the requisite evidence, Carpenter has failed to meet its burden of dispelling the inherent vice possibility. See Compagnie de Navigation Fraissinet \u0026 Cyprien Fabre, S.A. v. Mondial United Corp., 316 F.2d 163, 170 \u0026 n.9 (5th Cir. 1963) (Noting that \"[n]early all\" apparent good order-concealed defect cases \"involve produce or similar . . . commodities\", the Fifth Circuit commented that, \"Where because of the perishable or intrinsic nature of the [goods], the internal condition is not adequately revealed by external appearances, cargo may have a considerable burden of going further to prove actual condition.\").\n\nErwinia, in sum, was not only the proximate cause of the destruction but was also an inherent vice in and on the potatoes as they went aboard the JETTE SIF.\n\nNot surprisingly, several other causes have been propounded. See generally Parks, 10 J. Mar. L. Com. at 530 (\"It is often quite difficult to differentiate whether damage to a perishable cargo resulted from (a) perils of the sea, or (b) inherent vice, or (c) . . . stowage.\").\n\nTwo causes promoted the damage by assisting the erwinia proximate cause. See Caemint Food, Inc. v. Brasileiro, 647 F.2d 347, 356 (2d Cir. 1981); Indiana Farm Bureau Cooperative Assoc. v. S.S. SOVEREIGN FAYLENNE, 1978 AMC 1514, 1527 (S.D.N.Y. 1977).\n\nNonrefrigeration was one. Foregoing a more costly refrigerated vessel, Carpenter chose a ventilated ship. See generally Chiang, The Characterization of a Vessel as a Common or Private Carrier, 48 Tul. L. Rev. 299, 318 (1974) (\"A particular vessel is specified by the charter party, because each vessel has her own peculiarity as to fitness, loading capacity, speed, etc. and the charterer generally regards such peculiarity as a factor in entering into a charter contract.\") (footnote omitted).\n\nTo be sure, as measured by increasing industry practice, that money saving selection by an experienced shipper for the transport of perishables into equatorial climes was an eyes-open gamble. See Aunt Mid, Inc. v. Fjell -Oranje Lines, 458 F.2d 712, 717 (7th Cir.), cert. denied, 409 U.S. 877, 93 S. Ct. 130, 34 L. Ed. 2d 131 (1972) (\"'The plaintiff gambled when he shipped the cabbages in a ventilated hold rather than under refrigeration. This act, together with the tendency of the goods to spoil at temperatures in excess of 40 degrees, caused the loss . . . .'\") (quoting the District Court).\n\nConsequently, even though ventilated vessels are still engaged, the JETTE SIF's nonrefrigeration facilitated the spread of the inherent vice by being unable to retard it. See Commodity Service Corp v. Boston Insurance Co., 1964 AMC 926, 936 (S.D.N.Y.), aff'd, 354 F.2d 234 (2d. Cir. 1965) (\"[T]he plaintiff chose to book this perishable cargo for . . . uncooled carriage. Although there is evidence that salted dry fatbacks are customarily shipped . . . in the summer months without refrigeration, this factor does not aid the plaintiff since the plaintiff has failed to prove that the fatbacks were inherently sound so as to survive the crossing . . . .\"). See generally Ajiba Coussa v. Westchester Fire Insurance Co., 1962 AMC 1805, 1813 (S.D.N.Y. 1961) (\"The evidence . . . is more susceptible of an inference of a gradual deterioration of a perishable commodity. These nuts were part of the 1953 crop . . . stored without refrigeration and shipped [also without refrigeration] to Venezuela in 1955. The nuts were exposed to temperatures and humidity [conducive to decomposition and inherent vice mold growth] which are ordinarily to be expected for a shipment travelling from New York to Venezuela in the late spring.\").\n\nThe improper stow likewise contributed. The bags were stacked high and packed tight. The vertical aisles were narrow and inadequately secured, collapsing before or soon after arrival. See generally 2A Benedict ยง 92, at 9-4 (\"Proper stowage requires that cargo be made secure by dunnage, tomming, lashing, and so forth, so that the stow will remain intact during expectable weather.\") (footnote omitted).\n\nConcomitantly, the ship's overloading prevented the fans from moving air through the stow. Due to the ambient heat and humidity, unimpeded circulation may not have markedly relieved the cargo. Still, the ventilation system would have had an opportunity to lessen temperature conditions. See generally Horn v. CIA de Navegacion Fruco, S.A., 404 F.2d 422, 433 n.15 (5th Cir. 1968), cert. denied, 394 U.S. 943, 22 L. Ed. 2d 477, 89 S. Ct. 1272 (1969) (\"Although the district court . . . did not rule explicitly that the faulty stowage resulted in improper ventilation, and thus the capacity of the ship to cool the bananas, . . . such determination is . . . necessary to its findings.\").\n\nIn addition, compacting from the excessive stow probably intensified the heat by elevating the respiratory levels of the potatoes. In turn, lenticells would have dilated, emitting pulp water and admitting erwinia.\n\nLastly, due to the stow's height, the oppressive weight from the upper bags must have compressed down on those beneath, hastening their infrastructure breakdown, moisture loss and erwinia entry. Cf. Indiana Farm Bureau Cooperative Assoc. v. S.S. SOVEREIGN FAYLENNE, 1978 A.M.C. at 1527 (\"Stowage of the [fertilizer] to a height of some 20 feet . . . may have contributed to the damage. This conclusion is based on . . . the lower tiers . . . solidif[ying] to a greater extent than those above . . . . The Court consequently finds that the height . . . was a contributory cause of the impacting . . . .\").\n\nIn short, as did the nonrefrigeration, the improper stow abetted the inherent vice's malignant dissemination. See id., 1978 A.M.C. at 1528 (\"[T]he defense of inherent vice affects the reasonableness of stowage. The only reason why the stowage of the [fertilizer] . . . resulted in increased caking and impacting was the imperfection of the product itself, and the imperfection was such as to escape reasonable inspection. No evidence has been presented that would establish the fault [of the shipowner] in these circumstances.\").\n\nThat said, other proffered factors are rejected as unproven or noncausal. The entry of seawater was not proven. The electrical ventilation, another suggested culprit, was constructed to propel external air through the load. However, any benefit that ambient circulation might have provided was thwarted by the improper stow. The system operative, causation cannot be attributed.\n\nNor did the use of burlap bags as opposed to crates (which APRA knew could not be timely obtained) demonstrably further deterioration. Certainly, crates would have afforded better ventilation exposure and inhibited compacting. Nonetheless, their inherent vice laden contents would have been vulnerable to the same dangerous conditions - nonrefrigeration and improper stow. Packaging's role, if any, was a bit part.\n\nSlowness in reaching Puerto Cabello has been asserted, i.e., decreased speed, the approximate seven hour bunker trip, etc. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\" The cumulative two to three day delay was inconsequential considering the potatoes' potential life span of up to \"a couple of years.\" T. 301. Robert Carpenter acknowledged as much:\n\n\"Q. . . . [T]he vessel arriving eight or nine days after . . . Wilmington . . . was of no concern to you, in terms of the decay rate of the potatoes?\n\n\"A. No, sir, not really.\"\n\nSo viewed, singly or collectively, the various reasons for slowness were not causally connected to the damage. See, e.g., Ocean Commercial Co. v. The Polykarp, 134 F. Supp. 834, 837 (S.D.N.Y. 1955) (\"I do not regard the delay in La Guaira during excessively hot weather as being a determinative fact . . . . Although the port congestion . . . was widely known . . ., the question of [the shipowner's] . . . responsibility . . . for this delay, is not germane . . . because . . . the delay was not a causal factor.\"); Indiana Farm Bureau Cooperative Assoc. v. S.S. SOVEREIGN FAYLENNE, 1978 A.M.C. at 1529-30 (\"The length of the voyage . . . is also irrelevant . . . . [T]he length . . . did not contribute to the [fertilizer's] caking. [O]nce the initial settling of the cargo had taken place, the weight would remain constant and a longer . . . time would not affect the [fertilizer].\").\n\nIn sum, erwinia inherent vice proximately caused the spoilage with the aid of nonrefrigeration and improper stow.\n\n3. Responsibility\n\nEstablishing charter party damage responsibility entails shifting burdens.\n\n\"[A] private carrier's prima facie liability is established by proof of its receipt of the cargo in good condition and its nondelivery or delivery in bad order. If it would escape liability, the private carrier must bear the burden of explaining the cause of the . . . damage sustained by the cargo while in its possession, or it will be faced with the prima facie presumption that the loss resulted from its negligence and, thus, its liability may be established.\"\n\nSee 2A Benedict ยง 22, at 3-2 \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\"\n\nThat procedure is foreshortened here. Carpenter, as discussed, has not shouldered its threshold burden of proving tender of the potatoes to the vessel in good order. Larsen, accordingly, is not accountable for the damage. See generally The NIEL MAERSK, 91 F.2d 932, 934 (2d Cir.), cert. denied, 302 U.S. 753, 82 L. Ed. 582, 58 S. Ct. 281 (1937) (\"The shippers had the burden of establishing that their merchandise was in actual good order and condition at the time of shipment. . . .This burden was not sustained, and [they] . . . must fail in their effort to recover damages against the carrier.\").\n\nIn the main, Carpenter is likewise chargeable for the promoting causes. However, assigning responsibility for those is avoidable. In The NIEL MAERSK, 91 F.2d at 934-35, which concerned a fish meal cargo that probably had inherent defects when loaded, the Second Circuit enunciated the sound reasons in not apportioning liability for possible in transit damage.\n\n\"[T]here is no proof of the condition of the fish meal when loaded. If the fish meal . . . was . . . unfit for shipment and the damages were thereafter increased through stowage in ill-ventilated and hot portions of the ship, the [consignees] would have the burden of showing what was the condition of the meal when placed on board. Without proof of such condition, there would be no basis for calculating any damages caused by the carrier. The condition of the goods when placed on board was not within its knowledge, and it should not have the burden of separating damages arising from causes prior to shipment from damages due to negligent stowage.\"\n\nSee also Caemint Food, Inc v. Brasileiro, 647 F.2d at 356 (\"The district court . . . predicated its decision on a finding that the . . . mold . . . had been promoted by improper ventilation . . . . . . . But even if there were sufficient evidence of improper ventilation, [the consignee] still fails because . . . it did not establish that the [canned corned beef] cargo was in good condition when delivered . . . and the problem of concurrent causation was thus never reached.\") (applying The NIEL MAERSK reasoning to a COGSA governed suit).\n\nAll the same, to fully develop the record, the Court - without precisely apportioning - will treat accountability for the two promoting causes. Larsen's principal liability shield is charter party, pt. II, cl. 2:\n\n\"Owners are to be responsible for . . . damage to the goods . . . only in case the . . . damage . . . has been caused by the improper or negligent stowage . . . (unless . . . performed by shippers/Charterers or their stevedores . . .) or by personal want of due diligence on the part of the Owners . . . to make the vessel . . . seaworthy . . . . And the Owners are responsible for no . . . damage . . . arising from any other cause whatsoever, even from the neglect or default of the Captain or crew . . . or from unseaworthiness of the vessel on loading or commencement of the voyage or at any time whatsoever. Damage caused by contact with or leakage, smell or evaporation from other goods . . . not to be considered as caused by improper or negligent stowage, even if in fact so caused.\n\nEx. 1. See also id., rider cl. 21 (\"The vessel is not responsible for rot, decay or deterioration of the cargo.\").\n\nDespite that sweeping immunity, Larsen's liability is pressed for the nonrefrigeration and improper stow. Pertinent to the former, a shipowner must furnish a vessel capable of transporting that cargo.\n\n\"'The test of seaworthiness is whether the vessel is reasonably fit to carry the cargo which she has undertaken to transport.' . . . As seaworthiness depends not only upon the vessel being staunch and fit . . ., but upon its character in reference to the particular cargo . . . a vessel must be able to transport the cargo which it is held out as fit to carry, or it is not seaworthy. . . . \"\n\nSee The SOUTHWARK, 191 U.S. 1, 9, 48 L. Ed. 65, 24 S. Ct. 1 (1903) (quoting The SYLVIA, 171 U.S. 462, 464, 43 L. Ed. 241, 19 S. Ct. 7 (1898)). See also The CHEROKEE, 130 F.2d 67, 71 (4th Cir. 1942) (\"The general rule is that a ship must not accept a shipment of perishable goods unless it is equipped to carry them safely.\").\n\nIf it ever was, that rule is no longer paramount. See Chamlee, The Absolute Warranty of Seaworthiness: A History and Comparative Study, 24 Mercer L. Rev. 519, 528 (1973) (\"[T]he absolute warranty of seaworthiness, although technically still viable as to charter parties and marine insurance, is actually of minimal significance in modern commercial maritime transactions . . . .\").\n\nThat is so because apart from general exonerating clauses, the caselaw recognizes that the charter party delineates the shipowner's specific obligations. And for this hire, the charter party promised ventilation, not refrigeration. See, e.g., Oxford Paper Co. v. The NIDARHOLM, 282 U.S. 681, 685, 75 L. Ed. 614, 51 S. Ct. 266 (1931) (\"The owner's duty to provide a seaworthy . . . ship . . . did not extend to the defective cribbing. That warranty applies only to the ship and such equipment as is called for by the charter party.\").\n\nThe caselaw additionally recognizes that under certain circumstances the shipowner's seaworthiness duty may be waived by the shipper. See, e.g., The CHEROKEE, 130 F.2d at 71 (\"[T]he carrier refers to the evidence that it was reluctant to accept the [watermelon] shipment and did so only after the inadequacy of its refrigerating equipment had been fully explained to the shippers and they had expressed their willingness to take the risk. This defense . . . would . . . be sufficient. We know of no reason why a shipper may not waive his right to strict enforcement of a carrier's obligation . . ., and the resulting understanding does not violate the law or exempt the carrier from the consequences of his own misconduct . . . .\").\n\nCarpenter well knew that the JETTE SIF was unrefrigerated and hired it for that money saving reason. Carpenter's awareness effectively waived any objection to the JETTE SIF's nonrefrigeration, presupposing that limitation constituted an unseaworthy condition. See 2A Benedict ยง 64, at 7-7 (\"[S]eaworthiness does not require that a vessel be of the latest design for 'ships well built in their time, may still carry cargo unless they become so clearly out of fashion as to be an anachromism.'\") (quoting The PACIFIC FIR, 57 F.2d 965, 967 (2d Cir. 1932)).\n\nIn any event, whether by the charter party or Carpenter's waiver, Larsen is not accountable for the non-refrigeration. Cf. Aunt Mid, Inc. v. Fjell-Oranje Lines, 458 F.2d at 718 (\"[W]e are unpersuaded that the district court erred in determining that the [shipper] gambled in using ventilated stowage rather than refrigeration [in a Netherlands-USA cabbage transport] and that it should bear the loss resulting from the election.\").\n\nThat does not close the discussion. Carpenter had a sale contract duty to APRA to secure a vessel that would safely carry perishables into the tropics. Carpenter had that responsibility even though refrigerated transportation was not an express part of their bargain. See N.Y.U.C.C. ยง 2-504(a) (\"[U]nless otherwise agreed [the seller] must . . . put the goods in the possession of such a carrier . . . as may be reasonable having regard to the nature of the goods and other circumstances . . . .\").\n\nAn experienced shipper, Carpenter must have known what was reasonable even if not quite customary in the industry. Still, it opted for a cheaper ventilated vessel. Cf. Aunt Mid, Inc. v. Fjell-Oranje Lines, 458 F.2d at 716 (\"'[T]he [shipper] compared the freight rates applicable to ventilated hold and refrigerated stowage; then, against the advice of its agent . . . and contrary to the . . . customary industry practice, it elected to take the risk of shipping the [cabbages] in ventilated hold stowage . . . to save $1,560.00 in freight . . . .'\") (quoting the District Court).\n\nUnder these circumstances, refrigerated transportation would have been reasonable and Carpenter had the sale contract obligation to secure such a vessel. See ยง 2-504, Comment 3 (\"[T]he seller must see to any arrangements, reasonable in the circumstances, such as refrigeration . . . .\"). See also T. 365 (Loggie stated that: \"[W]e are responsible for delivery of potatoes . . . suitable for the purpose . . . intended, and . . . potatoes will arrive in much better condition on refrigerated vessels . . . .\") (quoted in full supra p. 33).\n\nCarpenter shares the improper stow blame with Larsen. Ostensibly, under this Gencon charter party, the loading duty was with Carpenter pursuant to pt. I, cl. 15's free-in-out-stow and rider cl. 19, which begins:\n\n\"The cargo to be loaded, stowed and discharged free of expense to the vessel by Charterers/Receivers' Stevedores . . . .\"\n\nEx. 1. See also Bauer, Responsibilities of Owner and Charterer to Third Parties - Consequences Under Time \u0026 Voyage Charters, 49 Tul. L. Rev. 995, 1012-13 (1975) (\"Under . . . a clause [such as the latter], all errors of the master . . . in stowage . . . will be excused.\").\n\nIrrespective, a body of law holds that if the Master does the loading or interferes, liability flows to the shipowner. In Indiana Farm Bureau Cooperative Assoc. v. S.S. SOVEREIGN FAYLENNE, 1978 A.M.C. at 1532 with a Gencon agreement having virtually the same pertinent clauses, the District Court remarked:\n\n\"The only instances in which liability for stowage remains with the vessel despite such clauses are those in which the Master, in the interest of seaworthiness, interposes his judgment for that of the charterer.\"\n\nSee also Zock, 45 Tul. L. Rev. at 741 (\"[R]ecent cases have questioned whether such [Gencon exculpatory] clauses . . . may be valid in all situations.\").\n\nDue to the longshoremen's inexperience, Captain Nissen intervened from the start. Robert Carpenter, too, oversaw the stow from the first morning. After the lumpsum modification, Robert Carpenter vested Captain Nissen with sole loading authority but continued some decisionmaking (such as filling the 'tween deck no. 2 hatch to the coamings). While the Master was certainly dominant, both were at fault for the excess loading.\n\nCaptain Nissen's apparent concern was inadequate space, not seaworthiness. When the hire was per tonnage, not taking the maximum cargo would have lowered the shipowner's earned freight. Even after the lumpsum modification, Captain Nissen's supervisory participation served Larsen's interests. See Vandeventer, Analysis of Basic Provisions of Voyage and Time Charter Parties, 49 Tul. L. Rev. 806, 812 (1975) (\"Where a charterer pays a lump-sum freight, the vessel owner must carry a full cargo or reduce the freight . . . accordingly.\").\n\nThat being so, Larsen and Carpenter are answerable for the improper stow. As mentioned, however, overloading and nonrefrigeration are only promoting causes for which accountability need not have been identified much less broadly apportioned. See The NIEL MAERSK, 91 F.2d at 934-35; Caemint Food, Inc. v. Brasileiro, 647 F.2d at 356. Loss responsibility remains with Carpenter alone for not delivering the potatoes to the vessel in good order.\n\nThose fundamental issues having been resolved, the parties specific claims will be analyzed.\n\nC. Parties' Claims\n\n1. Larsen\n\na. Demurrage\n\nStarting definitions are contained in 2B Benedict ยง 31, at 2-1:\n\n\"The . . . time allowed to the charterer under the charter party for loading and unloading is known as 'laydays' or 'laytime'. After the agreed laydays have expired, the charterer is liable for delay according to an agreed daily or hourly rate of liquidated damages known as 'demurrage'.\n\n(footnote omitted).\n\nBroadly viewed, demurrage law is unforgiving of delay.\n\n\"The general rule is that the charterer, having undertaken absolutely to see the ship loaded in a stated time, assumes the risk of all casualties preventing this, and the obligation of paying demurrage if anything goes wrong.\"\n\nSee Gilmore \u0026 Black ยง 4-8, at 213. See also United States v. Atlantic Refining Co., 112 F. Supp. 76, 80 (D.N.J. 1951) (\"[D]emurrage is extended freight and . . . the risk of vicissitudes which prevent the loading or discharge . . . within the stipulated lay days lies unconditionally with the charterers.\").\n\nIn limited instances, the charterer's duty may be excused.\n\n\"The charterer is relieved from his obligation if the delay results from the fault of the owner . . . or if he is protected by an express exception in the charter . . . .\"\n\nSee W. Poor, Charter Parties and Ocean Bills of Lading ยง 39, at 101 (5th ed. 1968) (\"Poor\").\n\nThis charter party alloted six laydays. When that lapsed, the $2000 per diem demurrage rate began.\n\nThe pertinent events were set in motion at 11:50 on October 22, 1981 in Wilmington and ended at 12:00 on December 25, 1981 in Dakar. With respect to laytime commencement, charter party, pt. II, cl. 6(c) is operative:\n\n\"Laytime for loading and discharging shall commence at 2 p.m. if notice of readiness is given before noon and at 8 a.m. next working day if notice given during office hours after noon. Notice at loading port to be given to the Shippers . . . . Time lost in waiting for berth to count as . . . laytime.\"\n\nEx. 1.\n\nNotice having been tendered at Wilmington before noon, laytime could have started at 14:00. See 2B Benedict ยง 33, at 2-15 (\"[L]aydays will not commence until the ship has 'arrived' and a notice of readiness has been tendered to the charterer . . . . The notice must be given during the hours specified in the charter party and must be properly communicated to the charterer.\") (footnote omitted).\n\nIt did not because NCB had not passed the ship as required by charter party, rider cl. 20.\n\n\"Vessel to be tendered . . . after passing inspection by N.C.B. . . . and ready . . . to load . . . potatoes.\"\n\nEx. 1. See also Compania Naviera Puerto Madrin S.A. Panama v. Esso Standard Oil Co., 1962 AMC 147, 156 (S.D.N.Y. 1961) (\"The determination of when laytime begins . . . depends upon the terms of the charter party . . . .\"). See generally Burke, Voyage Charters - Special Problems, 45 Tul. L. Rev. 937, 945 (1975) (\"Burke\") (\"An arrived vessel . . . has reached her agreed destination, complied with legal and physical readiness, and has given proper notice of readiness. [L]aytime then begins to run.\") (footnote omitted).\n\nHence, the notice was not valid until NCB certified the ship at 16:30 on October 22. See Compania Naviera Puerto Madrin S.A. Panama v. Esso Standard Oil Co., 1962 A.M.C. at 158 (\"A notice of readiness given when a vessel is not actually ready has no effect. A false notice must be treated as no notice.\").\n\nPursuant to charter party, pt. II, cl. 6(c), laytime would not have set in until 08:00 the next day. Carpenter, though, may have been willing to dispense with the extra time allowed by that provision, as evidenced by the Wilmington Statement of Facts prepared by the charterer's agent and Captain Nissen. After NCB passed the vessel at 16:30, that document reads:\n\n\"No loading this day as Charterers elected not to employ labor account unfavorable weather forecast. Labor for today must be employed previous day.\n\nEx. 18.\n\nIf loading had started post 16:30 on October 22, the lay period could have been triggered. See generally Poor ยง 38, at 98 (\"A provision as to notice is waived when there is actual notice and work is begun.\") (footnote omitted).\n\nLoading did not start and the Court will not speculate on whether charter party, pt. II, cl. 6(c) was, in fact, altered. See M. Summerskill, Laytime 141 (1966) (\"Summerskill\") (\"Such a stipulation [referring to a Gencon version of pt. II, cl. 6(c)] is part of the contract between charterer and shipowner; loading or discharging, before the fixed period has expired, is insufficient evidence . . . of an agreement to vary that stipulation. It is necessary to show . . . that the parties agreed to vary their contract . . . .\") (footnote omitted). Laytime, therefore, commenced at 08:00 the next day October 23.\n\nOn that day, rain fell intermittently as it did during the subsequent work days of October 26 and 27. \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e\" Charter party, rider cl. 19's \"weather permitting\" qualification exempts from laytime those periods of actual precipitation listed in the Wilmington Statement of Facts. \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e\" Ex. 1. See also Burke, 45 Tul. L. Rev. at 947 (Under a \"weather permitting\" provision, \"laytime is interrupted only so long as bad weather actually prevents work.\") (footnote omitted); Summerskill at 58 (same).\n\nLoading did commence on October 28 and continued until completion at 16:40 on October 30. After deleting the designated time spans, 1 day, 19 hours and 49 minutes laytime remained when the JETTE SIF departed from Wilmington. See Appendix.\n\nThe JETTE SIF sailed into Puerto Cabello harbor on Sunday November 8. Captain Nissen cabled a notice of readiness, which was received that day at 17:00 by Dasar, APRA's and Larsen's agent. Dasar's Santiago Marichal testified that the Sunday acknowledgment was a \"mistake.\" Ex. 122, p. 20. See Gilmore \u0026 Black ยง 4-8, at 213 (\"[W]hen . . . lay days actually start to run . . . will depend on the . . . charter, on the custom of the port, and on the often quite unique facts of the individual case.\") (footnote omitted). Cf. 2B Benedict ยง 33, at 2-15 to 2-17 (\"The notice must be given during the hours specified in the charter party . . . . There are many possible sources for problems . . . . For example, . . . a notice delivered outside the specified hours is considered to have come too late even though accepted . . ., although such notice would probably be deemed as having been . . . accepted on the next allowable day; . . . Saturday notices are frequently troublesome . . . .\") (footnotes omitted).\n\nCharter party, pt. II, cl. 6(c) requires an afternoon declaration to be communicated \"during office hours\" for laytime to commence the next day at 08:00. Ex. 1. See also Burke, 45 Tul. L. Rev. at 945 (\"As a condition precedent to the commencement of laytime, the readiness of the vessel must be communicated . . . as provided in the charter.\") (footnote omitted).\n\nInferable from Marichal's testimony is that Puerto Cabello has no Sunday shipping office hours. Thus, the JETTE SIF's announcement was invalid until 08:00 on Monday November 9. Effective then, (\"before noon\"), laytime under charter party, pt. II, cl. 6(c) recommenced at 14:00 that day.\n\nThe residual running, the cargo still was not being discharged because Banco Provincial had not received the essential documentation. Those papers arrived on November 10 and were delivered to the Venezuelan authorities the following day. Customs clearance came oh November 12.\n\nConceivably, the belated clearance meant that the vessel was not ready to unload before November 12, negating the November 9 notice. See generally Burke, 45 Tul. L. Rev. at 945.\n\nFor this, if fault there be, it was not Larsen's. Cf. Poor ยง 39, at 101. Neither APRA nor Carpenter directed Republic National to expedite the documents with a courier. Unlike them, Larsen had no relationship with that bank nor the responsibility to oversee the hastening of those indispensable papers. Carpenter and APRA must accept the blame for that delay. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\"\n\nSeen that way, laytime did resume at 14:00 on November 9. The 1 day, 9 hours and 49 minutes left from Wilmington lapsed at 09:49 on November 11 - despite the ship's nonclearance.\n\nDue to an equipment shortage, INP could not unload on November 12. The next day at 08:00 its longshoremen staged a strike lasting to 12:00 on November 16. That stoppage activated charter party, pt. II, cl. 15 (the general strike clause).\n\n\"Neither Charterers nor Owners shall be responsible for the consequences of any strikes . . . preventing or delaying the fulfilment of any obligations under this contract. . . . If there is a strike . . . and same has not been settled within 48 hours, Receivers shall have the option of keeping vessel waiting until such strike . . . is at an end against paying half demurrage after expiration of the time provided for discharging, or of ordering the vessel to a safe port where she can safely discharge . . . .\"\n\nEx. 1.\n\nCarpenter opted to keep the JETTE SIF at Puerto Cabello. The demurrage accumulated during that strike period (from 08:00 on November 13 to 12:00 on November 16) is reduced by half. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\"\n\nGenerally, most demurrage disputes are arbitrated and once laytime has been exceeded, arbitral adjudications have split over whether the strike exception can be operative. See 2B Benedict ยง 41, at 2-58 n.3 (decisions summarized therein).\n\nFurther, charter party, pt. II, cl. 15 arguably lends itself to either interpretation. Compare Ex. 1, pt. II, cl. 15 (\"Neither Charterers nor Owners shall be responsible for the consequences of any strike . . . .\") with id. (\"Receivers shall have the option of keeping vessel waiting until such strike . . . is at an end against paying half demurrage after expiration of the time provided for discharging . . . .\") (emphasis added). By that language, the parties may be protected from all strikes no matter when begun or only those commencing during the lay period and continuing after the free time has lapsed. Cf. The ONISILOS, [1971] 2 Lloyd's L.R. 29, 33 (C.A.) (noting a separate Gencon general strike clause ambiguity within another factual context).\n\nGiven that decisional division and charter party ambiguity, enforcing the general strike clause is the tempered course, neither Carpenter nor APRA able to impel the discharge during that strike. See generally Summerskill at 183 (\"The charterer can prevent time from running only to the extent that the strike rather than any action or inaction of his part caused the delay.) (footnote omitted).\n\nThe succeeding days are more problematical. The strike ended at 12:00 on November 16, and at 13:00 the INP longshoremen refused to unload the JETTE SIF due to the cargo's condition and attendant ammonia stench. That left the nonINP special stevedores, who demanded extra money for the onerous task. Whether to acquiesce was APRA's and Carpenter's charter party decision. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e\"\n\nAnother dockwide strike ensued at 13:00 on November 19 running through November 24. Contrasting the first such strike (November 13 to 16), that last stoppage and the immediately preceding cargo dispute are not sheltered by the general strike clause.\n\nTo particulize, a stoppage may not fall within the general strike clause's half demurrage purview.\n\n\"There is sometimes a question whether the work stoppage amounts to a strike at all. The cases have examined the clause from the perspective of both the nature of the strike and the motivation of the workers involved.\"\n\nSee 2B Benedict ยง 40, 2-53 (footnotes omitted). See generally Poor ยง 48, at 117 (\"The mere fact that the workmen refuse to work does not constitute a 'strike'.\") (footnote omitted).\n\nBefore noon on November 16 a strike was directed at all vessels. While the longshoremen's motives are unknown, the stoppage was general. See Poor ยง 48, at 117 n.4 (\"It has been said that a strike is 'a general concerted refusal by workmen to work in consequence of an alleged grievance.'\") (citation omitted).\n\nBeginning at 13:00 that day, the reason for the JETTE SIF's nondischarge was known and sharply focused. The INP longshoremen would not handle the rotting cargo. The special stevedores demanded additional wages for the offensive chore. For demurrage purposes, that was not a strike. Cf. id. ยง 48, at 117 (\"The fact that laborers refuse to work because of the fear of plague does not constitute a strike.\") (footnote omitted); H. Tiberg, The Law of Demurrage 475 (2d ed. 1971) (\"[W]here stevedores take time off from work in rain . . . because they dislike getting wet, English and American cases have held that there is not a strike within the accepted meaning of the [strike] clause . . . .\") (footnote omitted).\n\nThe log, itself, distinguishes the periods. Regarding the strike, the entry at 13:00 on November 14 is:\n\n\"NO WORK BECAUSE OF DOCK LABOR STRIKE.\"\n\nEx. 2. Quite different is the entry two days later:\n\n\"FROM [13:00] NO WORK BECAUSE OF DISPUTE ABOUT CARGO.\"\n\nId.\n\nThe difference between a \"DOCK LABOR STRIKE\" and a \"DISPUTE ABOUT CARGO\" manifests a change in the shoreside workers' motivation from a general grievance against all Puerto Cabello vessels to a limited disagreement narrowly directed at the JETTE SIF's decomposing cargo. No strike ongoing, half demurrage cannot be granted. See generally Summerskill at 183 (\"'I do not think . . . that abstention of a workman from mere fear to do a particular thing or perform a particular contract would necessarily constitute a strike.'\") (quoting Williams Bros. (Hull) Ltd. v. Naamlooze Vennootschap W.H. Berghuys Kolenhandel, [1916] 21 Com. Cas. 253, 257.\n\nAs an added reason for the half demurrage clause's nonenforcement, the cargo dispute was in the final analysis traceable to Carpenter as the tenderer of erwinia infected potatoes. Cf. Tiberg at 478 (\"The strike must not have been caused or contributed to by the charterer's fault or negligence.\") (footnote omitted); Summerskill at 183 (\"[I]f a strike causes delay because the charterer has failed in a duty, he is not relieved from his liability for delay by the exception clause.\")\n\nWith Carpenter at fault, Larsen does not suffer the lessened rate. See generally Pennsylvania Railroad Co. v. Moore-McCormack Lines, Inc., 370 F.2d 430, 432 (2d Cir. 1966) (\"[T]he inability of the carrier to place the cargo on the wharf and . . . the consignee to receive it were caused by the strike of the consignee's sea-going employees and the consequential refusal . . . of the stevedoring firms to cross the picket lines. This was not the fault of the . . . carrier, and the . . . consignee is not . . . relieved of its obligation to pay demurrage.\")\n\nFrom 13:00 on November 19 through November 24, the log entry is:\n\n\"NO WORK BECAUSE OF DISPUTE ABOUT CARGO AND STRIKE.\"\n\nEx. 2 (emphasis added).\n\nThe half demurrage provision is still unavailable. Strike or not, this vessel would not have been unloaded because of the continuing controversy over the rotting potatoes. See Summerskill at 184 (\"The charterer can only obtain protection from a strike exception clause to the extent that the delay was caused by the strike.\"). See generally id. at 181 (\"If two or more causes contribute to a loss of time, so that the delay is not entirely attributable to an excepted cause, the charterer is not allowed to benefit in respect of any delay which he has caused.\").\n\nRegarding the last Puerto Cabello phase from 01:00 to 19:40 on November 25, the log entry states:\n\n\"NO WORK BECAUSE OF DISPUTE ABOUT CARGO.\"\n\nEx. 2. The most recent dockwide stoppage had evidently settled, but the JETTE SIF cargo dispute had not. The full rate was in force until the vessel left the pier at 19:40. And when it did so, the shipowner had incurred demurrage damages totaling $25,654 for the 12 days, 19 hours and 51 minutes in excess of the laytime allowed. See Appendix. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\"\n\nb. Detention\n\nThe post Puerto Cabello period from 19:40 on November 25 to 12:00 on December 25 remains. Ordered from its berth, the JETTE SIF later embarked to free itself of the putrefied potatoes. Quite rightly, the shipowner treated the carriage contract as ended when APRA and Carpenter were conclusively unable to bring about the discharge.\n\n\"[W]here some radical alteration of conditions has swept away all the assumptions on which the contract was made, making impossible the fruition of its commercial object, then the courts have spoken of frustration, and have declared . . . that the charter is no longer in existence.\"\n\nSee Gilmore \u0026 Black ยง 4-12, at 224. See also Summerskill at 204 (\"When a ship is on demurrage a stage may be reached at which the contract can be regarded as at an end. That stage is reached either (1) when the charterer . . . is unable to perform . . . or (2) when the frustration of the venture has put an end to the contract. . . . If [the charterer's] conduct is equivalent to a repudiation, the shipowner may accept it as such, and sail away, claiming damages.\") (footnotes omitted).\n\nPrior to departing, Larsen sustained $2,000 per day charter party liquidated damages for demurrage. Thereafter, with the carriage contract over, the stipulated figure was not necessarily applicable because the vessel was incurring unliquidated damages for detention. See id. at 212 (\"[Detention] damages . . . only become due where the charter party had come to an end because the delay was equivalent to repudiation by the charterer, and had been accepted as such by the shipowner.\").\n\nYet, the demurrage rate is often adopted. See id. at 216 (\"Damages for detention are unliquidated . . ., since no sum is agreed in advance . . . . Nevertheless, the demurrage rate . . . is frequently applied, since it represents an estimate by the parties of the daily value of the ship.\").\n\nWith the cargo on board for most of the post Puerto Cabello stage, the JETTE SIF could not undertake another contract. The $2,000 per day amount for that off-charter period is a reliable referent, presumably negotiated during the ship's leasing to reflect daily hire worth. So applied, Larsen's basic damages for detention are $59,362. See Appendix.\n\nThat amount is not all-inclusive. Extra expenses beyond estimated daily costs, represented by the $2,000 rate, are recoverable. See generally Tiberg at 564-65 (\"Where the shipowner rescinds the contract upon the charterer's refusal to carry out his obligations or upon the actual frustration of the adventure . . ., the common law systems allow him complete indemnity for the delay and other loss.\") (footnotes omitted). Cf. Summerskill at 208 (\"Special circumstances may arise . . . as a result of which the shipowner recovers special damages . . . as well as . . . demurrage.\").\n\nPlaintiff's Summary of Claim, identified by Captain Halse at trial, details the extra expenses borne, such as Dakar equipment rental and labor wages. The parties have stipulated that the amounts therein correctly reflect the supporting invoices and exchange rate. T. 29. Totaling $66,789.95, those expenses exceeding the daily working costs are returnable. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\"\n\nc. Interest, Attorney's Fees and Litigation Costs\n\nLarsen's recovery includes interest. With a defined rate, postjudgment interest is mandated by 28 U.S.C. ยง 1961. Prejudgment interest is discretionary but usually allowed.\n\n\"Although the allowance of prejudgment interest in admiralty is said to be a matter committed to the trial court's discretion, . . . it should be granted in the absence oi: exceptional circumstances.\"\n\nSee Mitsui \u0026 Co. v. American Export Lines, Inc., 636 F.2d 807, 823 (2d Cir. 1981). See also Waterside Ocean Navigation Co. v. International Navigation Ltd., 737 F.2d 150, 154 (2d Cir. 1984) (\"In these days . . . of inflation, . . . only if such [prejudgment] interest is awarded will a person wrongfully deprived of his money be made whole for the loss.\").\n\nExceptional circumstances arresting prejudgment interest might be:\n\n\"where the party requesting the prejudgment interest has unreasonably delayed prosecuting its claim, has made a bad faith estimate of its damages which precludes settlement or has not sustained any actual damages.\"\n\nSee United States v. Peavey Barge Line, 748 F.2d 395, 402 (7th Cir. 1984).\n\nNothing suggests such exceptional circumstances. Larsen is granted prejudgment interest from December 25, 1981 until the day before judgment, after which ยง 1961 governs.\n\nThe rate is also discretionary. See 2 S. Sorkin, How to Recover for Loss or Damage to Goods in Transit ยง 11.07[4], at 11-32 (Supp. 1985) (\"Sorkin\") (\"The rule that prejudgment interest in admiralty courts is within the discretion of the trial judge has been held to be applicable to the rate . . . . The court may look to the . . . actual cost of borrowing money . . . state law or other reasonable guideposts.\") (footnotes omitted).\n\nThat latitude is subject to parameters.\n\n\"An award of prejudgment interest is in the first instance, compensatory . . . . \"In addition . . ., [such] awards . . . are governed by fundamental considerations of fairness.\"\n\nSee Rolf v. Blyth, Eastman Dillon \u0026 Co., 637 F.2d 77, 87 (2d Cir. 1980).\n\nN.Y. Civ. Prac. Law ยง 5004 offers a compensation oriented, fair rate of 9%. See Strobl v. New York Mercantile Exchange, 590 F. Supp. 875, 883 (S.D.N.Y. 1984), aff'd, 768 F.2d 22 (2d Cir. 1985) (The District Court employed ยง 5004's 9% rate for a common law fraud claim and for a Commodity Exchange Act claim.).\n\nLarsen also seeks attorney's fees. That request is denied, no proof having been presented \"that the defendants acted in bad faith in defending the action.\" See Seguros Banvenez, S.A. v. S/S OLIVER DRESCHER, 761 F.2d 855, 861 (2d Cir. 1985). See also Demsey \u0026 Associates v. S.S. SEA STAR, 500 F.2d 409, 411 (2d Cir. 1974) (\"[I]n the absence of statute or contractual authorization, attorney's fees are not generally recoverable . . . .\").\n\nFinally, Larsen asks litigation costs, probably meaning extraordinary expenses incurred in prosecuting this suit of an international nature. See generally Gradmann \u0026 Holler GMBH v. Continental Lines, S.A., 679 F.2d 272, 274 (1st Cir. 1982) (\"Appellants . . . challenge the award . . . for extraordinary costs . . . incurred when appellees' attorneys made a trip to Europe in preparation for the trial, deposition and transcript expenses, fees and travel expenses for expert witnesses . . . .\").\n\nThe general approach is otherwise. See id. (\"Ordinarily the taxation of costs would be limited to those ordinary costs authorized by [28 U.S.C.] ยง 1920 [e.g., marshal and docket fees, etc.]. Extraordinary costs may be allowed, however, when specifically approved by the court prior to trial.\").\n\nNo such prior order has been issued. Larsen is limited to those costs awardable under ยง 1920 and Civ. R. 4 of this District. See Rules of the United States Courts in New York (2d ed. 1984).\n\nTo summarize, along with ordinary costs, Larsen will receive $151,805.95 for demurrage, detention and other losses plus 9% interest from December 25, 1981.\n\nd. Liability\n\nOnly Carpenter is liable for the award. Regardless of the bill's negotiation, Carpenter remains bound under charter party, pt. II, cl.8 (the lien clause).\n\n\"Owners shall have a lien on the cargo for . . . demurrage and damages for detention. Charterers shall remain responsible for . . . demurrage (including damages for detention) incurred at port of loading. Charterers shall also remain responsible for . . . demurrage (including damages for detention) incurred at port of discharge, but only to such extent as the Owners have been unable to obtain payment thereof by exercising the lien on the cargo.\"\n\nEx. 1.\n\nOrdinarily, due to the bill's transfer, APRA would also be accountable for the damages sustained under the lien clause and charter party, rider cl. 19. However, APRA was not obligated to take delivery, considering the cargo's arrival condition and intended purpose. See Cargill, Inc. v. S/S NASUGBU, 404 F. Supp. 342, 349 (D. La. 1975) (\"'The duty of the consignee . . . to accept delivery . . . is not ordinarily excused by the fact that the goods are damaged, unless such damage renders the property practically valueless, having regard . . . to the purpose intended.'\") (quoting Miller, Law of Freight Loss and Damage Claims ยง 506.1 (1st ed. 1953) (emphasis added); 1 Sorkin ยง 4.09, at 418 (\"A consignee has a duty to accept goods . . . damaged in transit . . . unless the goods are . . . worthless.\") (emphasis added; footnote omitted). See also T. 295 (Dr. Potter stated that if the seed had been planted as it was upon arrival, \"you would spread the disease . . . to the rest of the potatoes. One would be well advised not to plant that lot of seed . . . . . . . In my experience, . . . we would have advised any grower if he received seed in that state, not to plant it. To return it.\"). See generally supra note 16 (rejecting the contention that the potatoes could have been used for other than planting on arrival).\n\nThat being so, APRA is not liable to Larsen for the demurrage, detention and related expenses, the potatoes useless and, therefore, valueless on arrival. See Bosung Industrial Co. v. M.V. AEGIS SONIC, 590 F. Supp. 908, 914-15 (S.D.N.Y. 1984) (In justifiably refusing to accept a \"'practically valueless'\" concrete pipe shipment, consignment cargo interest was not liable to the carrier for the delay and other expenses incurred.) (quoting Miller). Cf. T.J. Stevenson \u0026 Co. v. 81,193 Bags of Flour, 449 F. Supp. 84, 124-25 (S.D. Ala. 1976), aff'd in relevant part, 629 F.2d 338, 371 n.74 (5th Cir. 1980) (A shipper-consignee was liable for detention in unreasonably refusing to discharge defective flour where remedies against the cargo's supplier were available.). \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e\"\n\n2. APRA\n\na. Counterclaim Against Larsen\n\nThis counterclaim is predicated on already rejected arguments, viz., the potatoes were in good condition when tendered at Wilmington, the vessel was unseaworthy and the charter party was nonbinding on the receiver. By reason of the previous adverse resolutions, APRA's counterclaim is dismissed.\n\nb. Crossclaim Against Carpenter\n\n(1) Implied Warranty of Merchantability\n\nThe crossclaim is not dismissed. As the letter of credit confirms, APRA and Carpenter entered into a sale contract. Article 2 of the New York Uniform Commercial Code (\"UCC\" or \"Code\") regulates that agreement as involving a \"transaction[] in goods.\" See ยง 2-102. See also ยง 2-105 (\"'Goods' means all things . . . movable at the time of identification to the contract for sale . . . .\"); 1 R. Anderson, Uniform Commercial Code ยง 2-105:23, at 566 (3d ed. 1981) (\"Anderson\") (\"If they have been harvested . . . the crops are goods . . . as things that are movable.\") (footnote omitted). See, e.g., Borges v. Magic Valley Foods, Inc., 101 Idaho 494, 616 P.2d 273, 275 (Idaho 1980) (\"The potatoes . . . were clearly movable . . . and, hence, were 'goods' . . . and the dispute is governed by the Uniform Commercial Code.\").\n\nAs one \"who deals in goods of [that] kind,\" seller Carpenter is a potato \"merchant.\" See ยง 2-104. That being true, ยง 2-314's implied warranty of merchantability controls.\n\n\"(1) [A] warranty that the goods shall be merchantable is implied in a contract for their sale if the seller is a merchant with respect to goods of that kind.\n\n(c) are fit for the ordinary purposes for which such goods are used . . . .\"\n\nSee 3 Anderson ยง 2-314:51, at 159 (\"The sole criteria for the . . . implied warranty of merchantability is that there be a contract for the sale of goods and that the seller be a merchant . . .\") (footnotes omitted). \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\"\n\nOther UCC provisions have significance. As mentioned, one sale particular in the letter of credit was \"US DOLLARES 630,000.00 CIF PUERTO CABELLO.\" Ex. 62. That CIF term activated ยง 2-320.\n\n\"(1) C.I.F. means that the price includes . . . the cost of the goods and the insurance and freight to the named destination. (2) C.I.F. destination . . . requires the seller at his own expense and risk to\n\n(a) put the goods into the possession of a carrier at the port for shipment and obtain a negotiable bill . . . of lading . . .; and\n\n(b) load the goods and obtain a receipt from the carrier (which may be contained in the bill of lading) showing that the freight has been paid . . .; and\n\n(c) obtain a policy . . . of insurance . . .; and\n\n(d) prepare an invoice . . . and procure any other documents required to effect shipment or to comply with the contract; and\n\n(e) forward . . . with commercial promptness all the documents . . . .\n\n(4) Under the term C.I.F. . . . the buyer must make payment against tender of the required documents . . . .\"\n\nOrdinarily, the CIF term also identifies who has the risk of loss. See Gilmore \u0026 Black ยง 3-7, at 107 (\"Under a C.I.F. term the buyer (for whose benefit the insurance is carried) bears the risk of loss in transit.\") (footnote omitted).\n\nThat risk of loss transfer is described by ยง 2-509.\n\n\"(1) Where the contract requires . . . the seller to ship the goods by carrier . . .\n\n(b) if it does require him to deliver them at a particular destination and the goods are there duly tendered while in the possession of the carrier, the risk of loss passes to the buyer . . . .\"\n\nSee Gilmore \u0026 Black ยง 3-8, at 109 (\"The Article 2 rules on risk-shifting are set out in ยง 2-509. If the contract 'requires . . . the seller to ship the goods by carrier' subsection (1) provides that the risk shifts at the delivery point.\").\n\nNotably, ยง 2-509 can be countermanded by ยง 2-510.\n\n\"(1) Where a . . . delivery of goods so fails to conform to the contract as to give a right of rejection the risk of their loss remains on the seller until cure or acceptance.\n\nSee also ยง 2-509 Comment 1 (\"The scope of [ยง 2-509] is limited strictly to . . . where there has been no breach by the seller. Where for any reason his delivery or tender fails to conform to the contract, [ยง 2-509] does not apply and the situation is governed by [ยง 2-510].\"). See generally 4 Anderson ยง 2-510:4, at 4 (\"The risk of loss falls on the seller as soon as he is guilty of the breach even though the buyer has not yet taken any action with respect to . . . rejecting.\") (footnote omitted)\n\nHere, the risk would have normally passed on October 30, 1981 with completion of the loading and signing of the bill. \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\" See ยง 2-320 Comment 1. (\"The C.I.F. contract is not a destination but a shipment contract with risk of subsequent loss . . . passing to the buyer upon shipment if the seller has properly performed all his obligations . . . .\").\n\nThat passing of the risk was stopped by ยง 2-510, since Carpenter breached the sale contract by delivering potatoes in improper condition to the JETTE SIF. See Gilmore \u0026 Black ยง 3-8, at 109 (\"[Section] 2-510 . . . provides in substance that, if one party is in breach, he continues to bear the risk even though apart from the breach, the ยง 2-509 rules would allocate the risk to the other party.\"). Cf. Ohoud Establishment for Trade and Contracts v. Tri -State Contracting \u0026 Trading Corp., 523 F. Supp. 249, 254 (D.N.J. 1981) (\"According to the U.C.C., risk of loss in the absence of a breach passes to the buyer when the seller . . . tenders the goods to the possession of the carrier. U.C.C. sec. 2-509 . . . . Therefore, . . . if the soda was delivered in proper condition to the ocean carriers, the risk of future damage by the acts of the carriers passed to the buyer.\").\n\nHere the erwinia inherent vice proximately caused the spoilage. Were it not for erwinia's presence in some pulps (and on the skins) upon delivery to the vessel, the potatoes would not have decomposed when they did. See, e.g., Indiana Farm Bureau Cooperative Assoc. v. S.S. SOVEREIGN FAYLENNE, 1978 A.M.C. at 1517 (\"To recover on its [UCC] warranty claims, [the fertilizer buyer] must show the . . . breach of warranties made to it by [the seller]. It must also show that the [inherent] defect constituting the breach existed in the product when it was lifted [aboard] by the [carrier] at [the loading port], and that the defect proximately . . . caused the damages . . . .\").\n\nThe wrongful tender to the ship of nonconforming goods with indwelling faults causally connected to the subsequent massive deterioration was a breach of the implied warranty of merchantability. See 3 Anderson ยง 2-314:57, at 164 (\"[T]he defect . . . to establish that there has been a breach of warranty must have existed at the time of the sale. In addition, that defect . . . must have been a proximate cause of the plaintiff's harm.\") (footnotes omitted).\n\nThat breach gave APRA a ยง 2-510 right to reject, as more particularly spelled out by ยง 2-601.\n\n\"[I]f the goods or the tender of delivery fail in any respect to conform to the contract, the buyer may\n\n(1) reject the whole . . . .\"\n\nSee Note, Risk of Loss in Commercial Transactions: Efficiency Thrown into the Breach 65 Va. L. Rev. 557, 568 (1979) (\"Section 2-510(1) covers nonconforming goods . . . . Regardless of when the risk would have shifted if the goods had been conforming, subsection (1) places all risk on the seller. Given the buyer's absolute right to reject under section 2-601 . . ., the risk remains on the seller for even minor nonconformity in performance.\") (footnotes omitted).\n\nNecessarily, the actual repudiation could only have come at Puerto Cabello. See Howard, Allocation of Risk of Loss Under the UCC: A Transactional Evaluation of Sections 2-509 and 2-510, 15 U.C.C. L.J. 334, 357 n.84 (1983) (\"Note that the subsection says 'right of rejection.' The buyer need not yet have rejected.\") (emphasis in original).\n\nAlthough evidently deferring a final decision until the November 16 survey, Ortega tentatively refused the potatoes as early as the 14th on his first inspection, two days after the ship docked. See 4 Anderson ยง 2-602:7, at 72 (\"Delivery of the goods to a carrier constitutes delivery to the buyer but is not an acceptance by the buyer . . . so that he may reject them if they . . . are nonconforming. Furthermore, the time within which the buyer may reject goods begins to run from his physical receipt of the goods rather than from the time of the seller's delivery of the goods to the carrier . . . .\").\n\nWhen conclusively arrived at, the decision had to be timely communicated to Carpenter.\n\n\"Rejection of goods must be within a reasonable time after their delivery or tender. It is ineffective unless the buyer seasonably notifies the seller.\n\nSee ยง 2-602(1). See also Sherkate Sahami Khass Rapol v. Henry R. Jahn \u0026 Son, Inc., 701 F.2d 1049, 1051 (2d Cir. 1983) (\"What is a reasonable time for the doing of these acts (inspection and notification] depends upon the 'nature, purpose and circumstances' of the acts.\") (quoting ยง 1-204(2)).\n\nThough the exact date is unclear, Ortega's Puerto Cabello declination was communicated to Duesing, Carpenter's Caracas agent, sometime between November 16 and 19. That notice, of course, was imputable to Carpenter. See 3 Am. Jur. 2d Agency ยง 273, at 635-36 (1962) (quoted supra note 12). Close on the heels of the November 16 definitive inspection, that notice came within a reasonable period.\n\nApart from that imputed knowledge, Duesing on or about November 19 directly relayed Ortega's rejection to Robert Carpenter in New York. That, too, was within a reasonable time after the inspection under the circumstances.\n\nThe statutory perquisites having been met, APRA may recover on the implied warranty of merchantability.\n\n(2) Damages\n\n(a) Purchase Price, Unloading Fee, Survey Cost and Letter of Credit Interest\n\nBefore rejecting, APRA had paid for the potatoes. Under ยง 2-512, that remittance did not prejudice its remedial rights.\n\n\"(1) Where the contract requires payment before inspection nonconformity of the goods does not excuse the buyer from so making payment . . . .\n\n(2) Payment pursuant to subsection (1) does not constitute an acceptance of goods or impair the buyer's right to inspect or any of his remedies.\"\n\nSee generally T.J. Stevenson \u0026 Co. v. 81,193 Bags of Flour, 629 F.2d at 358 (\"The Code recognizes that the existence of payment-related documents such as the quality certificates and bills of lading (. . . used . . . to obtain payment under the letter of credit) do not affect the point of acceptance, nor the buyer's right to inspect.\")\n\nFurther, with no modification of ยง 2-314's implied warranty of merchantability manifest, paying for nonconforming goods and incurring related expenses entitled APRA to a damage award. See generally 3 Anderson ยง 2-314:4, at 106 (\"The entire purpose behind UCC ยง 2-314 is to hold the seller responsible when inferior goods are passed along to the unsuspecting buyer . . . and if the requisite proofs are established the only exculpatory relief afforded is a showing that the implied warranties were modified . . . .\").\n\nAs part of that award, APRA will be refunded the $630,000 purchase price. See ยง 2-711(1) (\"Where . . . the buyer rightfully rejects . . . any goods . . ., the buyer may . . . recover[] so much of the price as has been paid . . . .\"). \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e\"\n\nDamages beyond refund of the price raise questions of proof regarding incidental or consequential damages. See generally 4 Anderson ยง 2-711:14, at 429 (\"In the absence of proof of incidental or consequential damages, the warranty plaintiff will never recover more than an amount equal to the purchase price.\") (footnote omitted).\n\nSufficiently linked damages, however, may be reimbursable under ยง 2-715.\n\n\"(1) Incidental damages resulting from the seller's breach include expenses reasonably incurred in inspection, receipt, transportation . . . and custody of goods rightfully rejected . . . and any other reasonable expense incident to the delay....\n\n(2) Consequential damages resulting from the seller's breach include\n\n(a) any loss resulting from . . . needs of which the seller at the time of contracting had reason to know and which could not reasonably be prevented by cover or otherwise . . . .\"\n\nFor incidentals, APRA seeks $21,000 for the unloading fee (advanced despite the cargo's nondischarge) and $1,100 for the survey cost. Being \"reasonably considered necessary at the time . . . incurred,\" those charges are awardable. See Alcan Rubber \u0026 Chemical, Inc. v. MV HELLENIC LEADER, 1978 AMC 63, 72 (S.D.N.Y. 1977). See also Wood, Damages in Cargo Cases, 45 Tul. L. Rev. 932, 940-41 (1971) (\"[T]here usually arise necessary expenses incidental to the loss sustained. These include survey fees (to determine the quantum of damage . . . .\").\n\nAs a consequential, APRA requests the $6,359 letter of credit interest charge. During negotiations, Robert Carpenter told Ortega that a \"condition\" was receipt of a letter of credit before shipment. Ex. 125, p. 12. Thus, the seller knew that a letter of credit would be opened and should have known that interest would be charged. The $6,359 is therefore a proper element of consequential damages. See 4 Anderson ยง 2-715:46, at 533 (\"[W]hen the seller knows or has reason to know that the buyer is paying interest . . ., the buyer can recover therefore . . . Thus a buyer . . . can recover the interest paid on a loan from a third person who financed the purchase of the goods when the seller had 'reason to know' that the buyer . . . borrow[ed] money . . . to complete the purchase.\") (footnotes omitted).\n\n(b) Lost Profits\n\n(i) Receivable Under the UCC\n\nWarranting a deeper probe is APRA's application for anticipated lost profits of $662,790. Lost profits are consequentials awardable under ยง 2-715(2)(a). See R. Dunn, Recovery of Damages for Lost Profits 2d ยง 2.1, at 54 (1981) (\"Dunn\") (\"Decisions . . . have permitted recovery . . . of lost profits damages by a buyer from a breaching seller under U.C.C. ยง 2-715(2)(a)\"). See also Harbor Hill Lithographing Corp. v. Dittler Bros., Inc., 76 Misc. 2d 145, 348 N.Y.S.2d 920, 924 (N.Y. Sup. Ct. 1973) (\"[T]he code and commentary . . . make quite clear that resale circumstances put the seller on notice of potential exposure to liability for lost profits.\")\n\nAPRA's request would also be cognizable at common law. See Excelsior Motor Mfg. \u0026 Supply Co. v. Sound Equipment, Inc., 73 F.2d 725, 728-29 (7th Cir. 1934), cert. denied, 294 U.S. 706, 79 L. Ed. 1241, 55 S. Ct. 352 (1935).\n\n\"The general rule is that where profits are lost as the result of a breach of contract, if the profits were in the contemplation of the parties and there is some rational basis shown for determining such profits, they may be recovered as damages.\"\n\nIn fact, the Code's lost profits rule extends from the common law. See J. White \u0026 R. Summers, Handbook of the Under the Uniform Commercial Code 396 (2d. ed. 1980) (\"White \u0026 Summers\") (\"[Section] 2-715(2) codifies the more liberal reading of Hadley v. Baxendale.\"). See generally Dunn ยง 2.26, at 116-17 (\"[D]amages for breach of warranty in which defective seeds . . . [are] . . . sold is usually . . . the value of the crop which would have been raised . . ., less the value of the crops actually raised and less expenses of raising them. Cases both before and after . . . the . . . Code have adopted this rule. Damages for lost profits are recoverable, not merely the cost of the seed.\").\n\nVia common law or Code, \"[d]eterm[ing] . . . prospective profits is inherently problematical and difficult of proof.\" See R \u0026 I Electronics, Inc. v. Neuman, 66 A.D.2d 836, 411 N.Y.S.2d 401, 404 (N.Y. App. Div. 1978). A measure of lenience is accorded.\n\n\"The law of damages is clear. . . . It is not required that the profits be definitely . . . proved. The breach of the contract having prevented such profits from being made, conclusive proof is impossible. The injured party is permitted to introduce evidence tending to establish the damage and no greater degree of certainty . . . is required than for any other fact . . . .\"\n\nSee Excelsior Motor Mfg. \u0026 Supply Co. v. Sound Equipment, Inc., 73 F.2d at 729. See also Katz Communications, Inc. v. Evening News Assoc., 705 F.2d 20, 25 (2d Cir. 1983) (\"'[S]o long as the figure arrived at had a reasonable basis . . . and was not merely speculative . . . the [court] had the right to resort to reasonable conjectures and probable estimates and to make the best approximation possible . . . . This is particularly so where the conduct of wrongdoers has rendered it difficult to ascertain the damages suffered with the precision otherwise possible.'\") (quoting In re Estate of Rothko, 43 N.Y.2d 305, 401 N.Y.S.2d 449, 457, 372 N.E.2d 291 (1971)).\n\nThough variously stated and ordered, the general UCC proof sequence is causation, foreseeability, certainty (reasonable or less) and mitigation. See Schiro, Prospecting for Lost Profits in the Uniform Commercial Code: The Buyer's Dilemmas, 52 S. Cal. L. Rev. 1727, 1750-51 (1979) (\"Schiro\") See generally Dunn ยงยง 1.1-.18, at 1-50; id. ยง 6.17, at 285-91. The first three factors are in injured party's proof, whereas establishing (non)mitigation is the wrongdoer's. See Schiro, 52 S. Cal. L. Rev. at 1750-51.\n\n(ii) Causation, Foreseeability and Certainty\n\nTaking up APRA's factors, earnings unrealized by the farmers were causally connected to Carpenter's breach, i.e., if conforming goods had been shipped, then planting, harvesting and marketing for profit would have successively ensued. For potatoes, none of that followed. See generally Note, Sales - Uniform Commercial Code - Disclaimers of Warranty and Limitation of Remedy in the Sale of Seed, 24 Wayne L. Rev. 1223, 1237 (1978) (\"Commercial farmers stand to lose much more in the way of lost sales and profits than do personal consumers of seed.\").\n\nSimilarly, gains from the sale of potatoes were foreseeable, being \"reasonably within the contemplation of the parties\" at contracting. See Harbor Hill Lithographing Corp. v. Dittler Bros., Inc., 348 N.Y.S. 2d at 923. See also White \u0026 Summers at 396 (\"The plaintiff can recover lost profits if the seller had reason to know at the time of contracting that if he breached . . . the plaintiff would be deprived of those profits.\").\n\nAPRA, of course, knew. So did Robert Carpenter.\n\n\"Q. [T]he purpose for which the Venezuelan receivers were purchasing the seed potatoes was . . . growing new crops of potatoes?\n\n\"A. Yes, sir.\n\n\"Q. They were not going to be consumed?\n\n\"A. No, sir.\"\n\nEx. 125, p. 10.\n\nHis brother knew as well.\n\n\"Q. Did you know for what purpose the seed potatoes had been bought?\n\n\"A. I assumed they were bought to replant.\n\nWhat are seed potatoes usually purchased for?\n\n[T]o replant, to grow what we call table stock.\"\n\nT. 557.\n\nFrom that awareness, the brothers' foreknowledge that a breach meant lost profits can be inferred. See Lewis v. Mobil Corp., 438 F.2d 500, 510 (8th Cir. 1971) (Analogously, the Eighth Circuit commented: \"Where a seller provides goods to a manufacturing enterprise with knowledge that they are to be used in the manufacturing process, it is reasonable to assume that he should know that defective goods will cause a disruption of production, and loss of profits is a natural consequence of such disruption.\"). See generally Schiro, 52 S. Cal. L. Rev. at 1756 (\"[For lost profits calculations], the UCC . . . abandoned the precedents that required knowledge of resale being communicated to the seller and instead adopted the 'reason to know' standard.\") (footnote omitted).\n\nNot attacking the latter element, Carpenter challenges the projected earnings' certainty. In the first instance, Carpenter broadly maintains that the estimates are speculative. See, e.q., Ohoud Establishment for Trade and Contracts v. Tri-State Contracting \u0026 Trading Corp., 523 F. Supp. at 256 (\"[S]peculative damages have been barred since the days of Hadley v. Baxendale. . . .\").\n\nA distinction is relevant to that objection. \"Those courts which have gone further than a simple statement that 'reasonable certainty' is required have almost invariably recognized that the rule applies only to the fact of damages, not to the amount. . . . Proof of the fact . . . means proof that there would have been some profits. [O]nce this . . . has been established . . ., less certainty (perhaps none at all) is required in proof of the amount. . . .\"\n\nSee Dunn ยง 1.4, at 910 (emphasis in original).\n\nNew York Courts have long subscribed to that distinction.\n\n\"[W]hen it is certain that damages have been caused by a breach . . . and the only uncertainty is . . . their amount, there can rarely be good reason for refusing . . . any damages whatever . . . . [S]o far as they can be properly proved, [lost profits] may form the measure of damage. As they are prospective they must, to some extent, be uncertain and problematical, and yet on that account a person complaining of breach of contract is not to be deprived of all remedy.\"\n\nSee Wakeman v. Wheeler \u0026 Wilson Mfg. Co, 101 N.Y. 205, 209-10, 4 N.E. 264 (1886). See, e.g., Contemporary Mission, Inc v. Famous Music Corp., 557 F.2d 918, 926 (2d Cir. 1977) (Regarding an asserted loss of royalties, the Second Circuit observed: \"[U]nder the long-standing New York rule, when the existence of damage is certain, and the only uncertainty is as to its amount, the plaintiff will not be denied a recovery of substantial damages.\").\n\nOrtega's testimony was the evidentiary basis for both the fact and the amount of lost profits.\n\n\"Q. . . . You testified earlier that you have grown potatoes in the past. Are you acquainted with the . . . production that you would get from each hectare if you planted the seed potatoes?\n\n\"A. It's an average of 20,000 kilos per hectare.\n\n\"Q. And how did you arrive at the computation . . .?\n\n\"A. We start with the basis of 30,000 sacks, dividing them by forty sacks of seed that we use for each hectare. I believe it would give us about 750 hectares.\n\n\"Q. So that every hectare which is 2.4 acres, you would plant forty bags of seed . . .?\n\n\"A. Yes.\n\n\"Q. And is that based on your experience as a farmer, who has grown potatoes?\n\n\"A. Usually this is normal.\n\n\"Q. . . . So that if you sowed seven hundred and fifty acres at forty bags per acre, you would expect to harvest how many kilos . . . .\n\n\"A. I believe it's about 15 million kilos.\n\n\"Q. And that was based on your experience and the experience of others?\n\n\"A. Yes.\n\n\"Q. [I]f these potatoes had been grown . . ., when would you expect to harvest . . . and have them ready for marketing?\n\n\"A. In February and March\n\n\"Q. And do you know what the selling price was of each kilo . . . in February or March of 1982?\n\n\"A. Yes; at that time, . . . one kilo would cost 1.9 bolivars. . . .\n\n\"Q. If all these potatoes had been grown and had been sold, at that price . . . you would have received $6,627,906.98 . . . converting the B's into dollars?\n\n\"THE INTERPRETER: The witness understood the question and answered yes.\n\n\"Q. [W]hat would have been the cost to produce these potatoes so that they could be put in the market for sale? \"A. According to our many years of experience, we estimated about ten percent earnings of the gross sale.\n\n\"Q. [Y]our net profit would be ten percent of a selling price, or 662,790 dollars?\n\n\"A. Yes, sir.\n\n\"Q. How did you come to the conclusion that ninety percent of the selling price would be incurred in costs to produce the potatoes?\n\n\"A. Well, the cost of the land; the seeding costs, the fertilizer; labor, immigration, watering and . . . insecticide, and the application of the insecticide. Transportation, interest of the loan from the bank.\n\n\"Q. That would account for ninety percent of the selling price?\n\n\"A. About that. This is the estimate.\"\n\nT. 440-43.\n\nSubsequently, Ortega confirmed the certainty of the essential component in his lost profits appraisal - the harvested crop.\n\n\"Q. What variables can affect the production of the table potatoes that are obtained from . . . planting the seed potatoes?\n\n\"A. In our area, the crop is almost a hundred percent sure. Sometimes we have . . . no rain. We have enough irrigation of water so from year to to the following year, it is very, very slight variation.\n\nT. 507.\n\nThe latter testimony concerned the fact of lost profits, the yield being \"almost a hundred percent sure.\" Earnings would have followed that dependable harvest. See, e.g., Borne Chemical Co. v. Dictrow, 85 A.D.2d 646, 445 N.Y.S.2d 406, 413 (N.Y. App. Div. 1981) (In a breach of an agreement not to compete suit, with respect to the fact of lost profits the Second Department stated: \"[T]he plaintiff has the burden of proving that it sustained a net loss of profits as the result of the wrongful competition of the defendants. . . . [P]roof of competition in violation of the contract between the parties and a loss of profits with the onset of that competition will be sufficient to warrant an award of damages . . . .\").\n\nSatisfying the fact requirement eases APRA's amount burden. See id. at 413-14 (\"Where it is certain that [lost profits] have been caused . . . and the only question is . . . their amount, there can rarely be good reason for refusing to grant . . . any damages whatever . . . . A person violating his contract should not be permitted entirely to escape liability because the amount of damages which he has caused is uncertain . . . .\") (citing Wakeman)\n\nAs mentioned, Ortega provided the basis for lost profits calculation. See R \u0026 I Electronics, Inc. v. Neuman, 411 N.Y.S.2d at 404 (\"Profit is computed as the amount the plaintiff would have realized under the contract if it had been faithfully carried out, less the necessary expense of performance . . . . The plaintiff must supply some basis of computation for determining the amount of the injury. [C]osts . . . taken into consideration . . . generally include the cost of labor, materials and superintendence . . . .\").\n\nTo particularize, Ortega gave estimates founded on past average area harvests, learned through his farm experience and that of his fellow organization members. See Dunn ยง 2.26, at 120 (\"When lost profits . . . are held recoverable, damages may be calculated from evidence of average yields for the season on land in the vicinity or from yields on the same land in other years.\"). See also Excelsior Motor Mfg. \u0026 Supply Co. v. Sound Equipment, Inc., 73 F.2d at 729 (\"[D]amages for the interruption of a going business with consequent loss of profits may be recovered where proof is introduced as to the amount of profit made in the past . . . together with facts that the circumstances have not so changed as to alter the prospects of equal profits . . . .\"). So founded, Ortega's estimates were not speculative.\n\nAside from speculativeness, Carpenter raises a more direct objection that Ortega's account was not substantiated by other evidence, e.g., APRA documentation corroborating the projections, surrounding area yield rates, etc. Carpenter is correct.\n\n\"Q. Mr. Ortega, do you have any records . . . concerning production for the preceding planting seasons in . . . Aragua . . . prior to 1981?\n\n\"A. No, I do not. [W]e just plant the seeds. Sometimes it is a little bit more, a little less. There is not a definite amount of figuring.\n\n\"Q. [D]o you keep any records of your costs . . . for each planting season?\n\n\"A. No.\n\n\"Q. Do you have any documentation with respect to the production of . . . the adjoining states to Aragua, in 1981? . . .\n\n\"A. No. I have no documentation.\"\n\nT. 505-06.\n\nLater, Ortega partly explained the lack of records.\n\n\"Q. Do [the farmers] keep records . . . in . . . Aragua?\n\n\"A. The association has nothing to do with the production of every farmer. Usually, most of them are very small farms.\n\nT. 508.\n\nDocumentation would have bolstered Ortega's assertions, but its absence goes to testimonial weight - not competence. See generally Contemporary Mission, Inc. v. Famous Music Corp., 557 F.2d at 926 (\"[T]he test for admissibility of evidence concerning prospective damages is whether the evidence has any tendency to show their probable amount.\").\n\nIf attacking the weight, Carpenter's perceived position is that Ortega's testimony - by itself - is too slight to tip the evidentiary scale towards a lost profits award. If that is Carpenter's point of view, it is not the law.\n\nIn Goldenberg v. World Wide Shippers And Movers of Chicaqo, Inc., 236 F.2d 198, 202 (7th Cir. 1956), the Seventh Circuit approved a lost profits award on furniture intended for auction resale but damaged in transit.\n\n\"The only evidence on what the value of the furniture would have been . . . was the testimony of . . . Goldenberg that the usual . . . markup . . . was fifty per cent. The defendant did not contest Goldenberg's assertion. The trial court accepted the only evidence offered . . . and, in the absence of any contrary showing, the court's valuation was correct.\"\n\nSee also Excelsior Motor Mfg. \u0026 Supply Co. v. Sound Equipment, Inc., 73 F.2d at 730 (\"'[While the law will not permit witnesses to speculate . . . as to possible . . . damages, still the best evidence . . . is often . . . the opinion of well-informed persons . . . .'\") (quoting Daughetee v. Ohio Oil Co., 263 Ill. 518, 105 N.E. 308, 311 (Ill. 1914)).\n\nOn this subject, Ortega testified basically as an expert. See, e.g., Jay Edwards, Inc. v. New England Toyota Distributor, Inc., 708 F.2d 814, 820 n.4 (1st Cir.), cert. denied, 464 U.S. 894, 78 L. Ed. 2d 231, 104 S. Ct. 241 (1983) (\"[T]he bulk of plaintiff's evidence came from . . . Edwards [president of plaintiff car dealership in a suit against a distributor] . . . who, with the assistance of an accountant, prepared the damages calculations. In giving his opinion as to lost profits, Edwards was acting essentially as an expert witness. It is not unusual for an officer of a corporat[ion] . . . to testify as to lost profits, and such 'evidence is ordinarily held adequate . . . to make out a case.'\") (quoting Dunn ยง 7.2, at 294).\n\nMoreover, as Goldenberg indicates, if doubtful of Ortega's figures, Carpenter could have attempted rebuttal. For instance, Carpenter could have challenged Ortega with the results of its independent Argua potato industry investigation - had one been performed. See, e.g., Lee v. Jos. E. Seagram \u0026 Sons, Inc., 552 F.2d 447, 455 (2d Cir. 1977) (\"[Defendant liquor distiller] suggests that the best way of determining profits would be to consider the profits of an existing distributorship. But it came forward with no such proof . . . .\").\n\nThe opposite occurred. Carpenter did not offer rebuttal evidence, despite Ortega withstanding cross-examination unimpeached. See, e.g., Autowest, Inc. v. Peugeot, Inc., 434 F.2d 556, 565 (2d Cir. 1970) (\"'This evidence, while purely an estimate, . . . was proof . . . as . . . certain as the subject-matter admitted. The witness testified from his knowledge of the business history, made his calculations upon what appears to be a reasonable basis, and the defendants had ample opportunity by cross-examination or the offer of their own evidence . . . to discredit him and show any fallacy in his reasoning . . . .'\") (quoting William H. Rankin Co. v. Associated Bill Posters, 42 F.2d 152, 155 (2d Cir.), cert. denied, 282 U.S. 864, 75 L. Ed. 765, 51 S. Ct. 37 (1930)).\n\nAbsent such discrediting, APRA carried the burden on the causation, foreseeability and certainty factors entitling it to some lost profits.\n\n(iii) Mitigation\n\nHow much lost profits depends on the mitigation inquiry for which Carpenter has the burden. See Schiro, 52 S. Cal. L. Rev. at 1751 (\"Mitigation . . . has remained a separate factor introduced after the fact by the defendant's argument that whatever damage may be recoverable . . . must now be reduced to the extent plaintiff failed to mitigate.\") (footnote omitted).\n\nIn part, consequential damages are those \"which could not reasonably be prevented by cover or otherwise.\" See ยง 2-715(2)(a). That UCC section requires an injured party to mitigate when possible. See Schiro, 52 S. Cal. L. Rev. at 1751 n.77 (\"The mitigation principle is included in . . . ยง 2-715(2)(a) by the phrase 'cover or otherwise' and in comment 2 to that section . . . .\").\n\nAlbeit sketchily, Carpenter does raise nonmitigation. To address that contention, two periods must be analyzed. The first involves the vessel's Puerto Cabello stay and the nondischarge.\n\nAs between them, APRA owed no duty to Carpenter to discharge the useless cargo except as delineated by the UCC's ยงยง 2-601 et seq.\n\n\"[T]he duty of the consignee to accept goods to mitigate damages is one owed to the carrier, not to the consignor. The rights and liabilities between consignor and consignee concerning the duty of consignee to accept a shipment are governed by the Uniform Commercial Code.\n\nSee 1 Sorkin ยง 4.09, at 4-19(citing Long Prarie Packing Co. v. Midwest Emery Freight System, 429 F. Supp. 201, 203 (D. Mass. 1977).\n\nFor the most part, the relevant Code sections have been discussed and APRA's conduct found in accordance. But assuming APRA is a \"merchant buyer,\" ยง 2-603(1) details additional postrejection steps. Those, however, must only be taken by a declining purchaser \"when the seller has no agent . . . at the market of rejection.\" See ยง 2-603(1). Here, Carpenter's agent Duesing was at Puerto Cabello and, thus, the Code required no more of APRA with respect to the nondischarge.\n\nYet, believing that it had to unload, APRA was willing to partly pay the extra amounts for discharging, trucking and burning the unwanted cargo. Ortega, in fact, negotiated with the special stevedores to that end. But timely assistance was not forthcoming from Carpenter, the breaching seller responsible for the potatoes' condition and, in actuality, the nondischarge.\n\nIn brief, viewing the whole Puerto Cabello scenario (the intermittent strikes, the cargo dispute, Robert Carpenter returning to New York, etc.), the Court discerns neither Code noncompliance nor unreasonableness demonstrating a failure to mitigate in APRA's conduct under semi-chaotic circumstances. See generally Dunn ยง 6.17, at 286 (\"Proof of mitigation . . . requires only . . . that plaintiff took reasonable steps to cut his losses, not that the plaintiff did what the defaulting party would have had him do . . . .\").\n\nThe second period follows the JETTE SIF's Puerto Cabello departure and concerns the farmers' cover efforts.\n\n\"'Cover' . . . means that the purchaser may buy substitute goods at a reasonable price and recover from the seller . . . the difference between the 'cover' price and the contract price plus incidental damages. U.C.C. ยง 2-712. For damages to be awarded, the purchaser must show that he was unable to cover to prevent his claimed loss of profits.\n\nSee id. ยง 2.1, at 53.\n\nCover by purchasing substitute seed potatoes was out of the question, Ortega noting that the October-November planting \"season was already over.\" T. 436. Ortega did acknowledge on direct examination that some APRA members planted different crops.\n\n\"Q. Did you or the other farmers . . ., who had purchased these seed potatoes, plant any other vegetables to take their place?\n\n\"A. Some planted something, others did not.\n\n\"Q. Do you know the quantity that was planted by some?\n\n\"A. It's very difficult to say.\"\n\nT. 437.\n\nThough bearing the nonmitigation burden, Carpenter's counsel did not query Ortega regarding that limited covering. As is plain from the quoted testimony, however, productive interrogation was probably (and correctly) foreseen as futile, in light of APRA's lack of record-keeping and its loose knit membership.\n\nStill, Carpenter had the burden, and possible to mine or not, that was its problem. A lost profits award may not be denied for failure of all members to cover. See Katz Communications, Inc. v. Evening News Assoc., 705 F.2d at 26 (\"[T]here is little, if any, relevant evidence on [costs plaintiff could have saved after being apprised of the breach] in the record. However, the burden is on the [defendants] to prove any potential item in mitigation of damages inasmuch as it is pro tanto a defense to the claim . . . .\").\n\nThen again, the full $662,790 sought cannot be granted because some farmers did plant substitute crops. See 4 Anderson ยง 2-715:30, at 52 (\"[T]he plaintiff can not recover for a possible loss which . . . has been avoided by . . . mitigati[on] . . . .\") (footnote omitted). See, e.q., Sierra Wine \u0026 Liquor Co. v. Heublein, Inc., 626 F.2d 129, 132 (9th Cir. 1980) (An exclusive distributorship termination without reasonable notice entitled plaintiff to lost profits that would have been earned during the cut off period, but less actual gains received from another franchise acquired during that same period.).\n\nNo evidence was adduced of what income, if any, came from the substitute crops. That was also Carpenter's proof. See Dunn ยง 6.17, at 286 (\"Proof of failure to mitigate damages is a matter for the defense, as is proof of the amount of benefit plaintiff derived from mitigation.\"). Irrespective, Carpenter should not be totally answerable for APRA's nonrecord-keeping.\n\nOtherwise, the Court would be disregarding mitigation evidence. That would, perhaps, work a windfall for APRA and a concomitant penalty for Carpenter, thereby offending the law's compensatory purpose. See Seguros Banvenez, S.A. v. S/S OLIVER DRESCHER, 761 F.2d at 860-61 (\"The correct measure . . . is the amount necessary to put the injured parties in the exact position they would have been in had there been no breach.\"). \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\"\n\nReducing the potato lost profits award by presumed alternative earnings is the fairer tack. Cf. Aljassim v. SS SOUTH STAR, 323 F. Supp. 918, 927 (S.D.N.Y. 1971) (\"[A]lthough the fact of damages . . . is certain, the full amount claimed . . . should not be awarded. [T]he witness . . . acknowledge[d] that although the events . . . had greatly affected his business, other factors could have affected [it]. [W]e find that one-half . . . the loss of profits . . . were due to factors other than [defendant's] conduct . . . and for which [defendant] should not be charged) (footnote omitted).\n\nA 30% reduction is just. If not all APRA members sowed other seed, then not all realized earnings from substitute crops. \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e\" Thus, setting aside the full lost profits award due to full mitigation is unwarranted.\n\nFrom a different vantage point, the alternative produce was not the mitigating members' first choice - the potatoes were, the Argua area presumably quite fertile for their growth. A reasonable extrapolation is that those replacements were not as profitable as the potatoes would have been. So viewed, substitute crop earning must be credited, but the abatement cannot be great. Cf. C. Itoh \u0026 Co. v. Hellenic Lines, Ltd., 470 F. Supp. 594, 599-600 (S.D.N.Y. 1979) (\"The record does not show . . . the extent to which the damages could have been reduced except for plaintiff's neglect - an issue on which defendant . . . bears the burden . . . . Nonetheless, the Court is convinced that plaintiff's delay in selling the boots for salvage did enhance the damage and an appropriate offset . . . is required. The damage figure . . . will be . . . reduced by 10% . . . .\") (footnotes omitted).\n\nConcededly, the Court is operating within perceived equitable parameters. A 30% reduction is within those boundaries. Subtracting that from the amount sought, APRA is awarded $463,953 in lost profits. Cf. id. at 600 n.23 (\"The final award may not be precise, but 'it has long been recognized that courts of admiralty may apply equitable principles in attempting to reach a just result.'\") (quoting Hato La Vergarena, C.A. v. S.S. SUSAA, 1973 AMC 195, 201 (S.D.N.Y. 1972)).\n\n(c) Interest, Attorney's Fees and Costs\n\nOn the state law crossclaim award, APRA will receive interest. N.Y. Civ. Prac. Law ยงยง 5001, 5003 mandate pre and postjudgment interest, respectively. By ยง 5004, their rates are 9% per year.\n\nUnlike Larsen's, APRA's prejudgment interest cannot be uniformly overlaid. The statutory referent is ยง 5001(b).\n\n\"Interest shall be computed from the earliest ascertainable date the cause of action existed . . . . Where . . . damages were incurred at various times, interest shall be computed upon each item from the date it was incurred . . . .\"\n\nAPRA's first time defined damages are the purchase price, unloading fee, survey cost and letter of credit interest charge. Their \"earliest ascertainable date\" is when the potatoes should have been delivered. See Mitsui \u0026 Co. v. American Export Lines, Inc., 636 F.2d 807, 824 (2d Cir. 1981) (\"[I]nterest . . . is a form of compensation . . . to make the injured party whole . . . and . . . the plaintiff has not suffered any loss until the time when the goods should have been . . . delivered.\").\n\nThe date for the 9% prejudgment interest commencement is November 9, 1981, when the Puerto Cabello notice of readiness was effective. See Associated Metals \u0026 Minerals Corp. v. M/V PAN DYNASTY, 587 F. Supp. 1554, 1558 (E.D. La. 1984) (awarding interest from the vessel's arrival date).\n\nThe second time defined damages are the lost profits. Those would not have been \"incurred\" (gains realized) until postdelivery, i.e., after planting, harvesting and marketing. Running prejudgment interest from the breach delivery date would overpay APRA and overcharge Carpenter. See Morse v. Swank, Inc., 520 F. Supp. 829, 830 (S.D.N.Y. 1981), aff'd, 688 F.2d 816 (2d Cir.), cert. denied, 459 U.S. 833, 103 S. Ct. 75, 74 L. Ed. 2d 73 (1982) (\"'Where . . . the damages include loss of profits which would have been earned after the wrong, interest from [the breach date] would be a penalty rather than compensation.'\") (quoting Adler v. Pilot Industries, Inc., 192 Misc. 774, 81 N.Y.S.2d 822, 823 (N.Y. Sup. Ct. 1948)).\n\nHad they been delivered, the potatoes would have been sown in November 1981. T. 409-10, 436. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\" As harvested table potatoes, they would have been ready for marketing in February-March 1981. T. 441. That time frame reasonably allows for fixing April 1, 1982 as the date profits will have been deemed lost for purposes of the 9% prejudgment interest.\n\nAs did Larsen, APRA seeks attorney's fees and litigation costs. For substantially the same reasons, the Court denies all but ordinary costs.\n\nSummarizing, APRA is awarded $658,459 for the purchase price, unloading fee, survey cost and letter of credit interest charge from November 9, 1981 and $463,953 for lost profits from April 1, 1982. Pre and postjudgment interest at 9% will be received running from the designated dates. Finally, APRA will bear its own attorney's fees and extraordinary expenses but will be entitled to ordinary costs.\n\n3. Carpenter\n\nContrasting its quite colorable defensive positions, Carpenter's affirmative contentions are either meritless or abandoned. In its answer, Carpenter counterclaims against Larsen for 1) a freight refund and 2) the sailing from Venezuela without authorization, which is joined with a conversion allegation. Against APRA, Carpenter crossclaims for refusing delivery. Linked to these are indemnity requests.\n\nExcept for general references to indemnification, Carpenter has not briefed any of those charges - an indication of their lack of merit. Further, the Joint Pretrial Order does not mention the unauthorized sailing-conversion counterclaim nor the refusing delivery crossclaim. The Court considers them abandoned. Cf. Landy v. Federal Aviation Administration, 635 F.2d 143, 148 (2d Cir. 1980), cert. denied, 464 U.S. 895, 78 L. Ed. 2d 232, 104 S. Ct. 243 (1983) (\"Landy's claim that the Government seizure of his plane violated due process was substantially abandoned in the trial court. A retrial on the issue . . . will not be directed.\").\n\nThe Joint Pretrial Order does mention the freight refund counterclaim against Larsen for nondelivery. The Court will briefly deal with it and the indemnity applications.\n\nThough prepaid, the freight could be recoverable. See Hellenic Lines, Ltd. v. United States, 512 F.2d 1196, 1203 (2d Cir. 1975) (\"[The District Court] correctly stated that 'under American maritime law . . . prepaid freight is not \"earned\" until delivery . . . .'\"). See also Poor ยง 29, at 80 (\"[A]dvance payment must be earned . . . or else it must be repaid.\") (footnote omitted).\n\nBut no shipowner must do what cannot be done. See id. ยง 28, at 78 (\"[I]f the ship is ready to make delivery, and the consignee is unable to receive, this does not deprive the shipowner of his freight.\").\n\nThe JETTE SIF did dock at Puerto Cabello. Whether or not obligated (in APRA's instance) to receive the useless cargo, those with charter party unloading responsibility were unable to effect the discharge. No refund will lie where Larsen performed and the others did not. See id.\n\nAdditionally, as discussed, after INP ordered the vessel from berth, the shipowner was correct in treating the charter party as ended and in attempting to get rid of the fly infested, putrefied potatoes wherever possible. Delivery having been frustrated due to the unfit potatoes, Carpenter cannot obtain a freight refund. See H. Baer, Admiralty Law of The Supreme Court ยง 18-11, at 527 (3d ed. 1979) (\"If the freight has been paid in advance and no delivery is made the shipper is entitled to a return of the prepaid freight[] . . . just as long as the failure [to deliver] is not attributable to the shipper.\") (emphasis added; footnote omitted). The counterclaim against Larsen is therefore dismissed.\n\nLastly, having been at fault on the shipowner's demurrage-detention claim and the buyer's sale contract crossclaim, Carpenter's indemmity applications are denied. Cf. 23 N.Y. Jur. 2d Contribution, Indemnity and Subrogation ยง 63, at 108 (1982) (\"[W]hen, by the wrongful . . . act of a person, another is rendered liable, there arises an implied contract on the part of the wrongdoer to indemnify the innocent party.\") (footnote omitted).\n\nIII. CONCLUSION\n\nTo recapitulate, Larsen is awarded against Carpenter $151,805.95 with interest from December 25, 1981. Larsen will receive 9% prejudgment interest along with post-judgment interest as delineated by 28 U.S.C. ยง 1961.\n\nAPRA's counterclaim against Larsen is dismissed but its crossclaim against Carpenter merits an award of $658,459 (purchase price, unloadihg fee, survey cost and letter of credit interest charge) from November 9, 1981 and $463,953 (lost profits) with interest from April 1, 1982. APRA will receive prejudgment and postjudgment interest, both at 9% running from the designated dates.\n\nCarpenter's counterclaim and crossclaim are dismissed.\n\nThe prevailing parties will receive ordinary costs pursuant to 28 U.S.C. ยง 1920 and Civ. R. 4 of this District. They will bear their own attorney's fees and extraordinary expenses.\n\nSO ORDERED.\n\nAPPENDIX I. Demurrage Date Laytime Rainz Laytime Used 10/23/81 08:00-17:00 08:50-09:35 1 hr. 45 mins. 9 hrs. 45 mins. 10:15-10:45 30 mins. 11:00-17:00 6 hrs.10/24 - - -10/25 - - -10/26 08:00-24:00 10:03-10:40 11 hrs. 31 mins. 6 hrs. 37 mins. 11:38-12:20 42 mins. 13:30-16:40 3 hrs. 10 mins.10/27 00:00-24:00 15:15-17:00 22 hrs. 15 mins. 1 day 1 hr. 45 mins.10/28 00:00-24:00 - 1 day 1 day10/29 00:00-24:00 - 1 day 1 day10/30 00:00-16:40 - 16 hrs. 40 mins.\n\nNote: Laytime left upon departing Wilmington:\n\n1 day 19 hrs. 49 mins. (6 allowed days minus 4 days 4 hrs. 11 mins.) Data Total Laytime Used 10/23/81 1 hr. 45 mins. 10/24 1 hr. 45 mins.10/25 1 hr. 45 mins.10/26 13 hrs. 16 mins. 10/27 1 day 11 hrs. 31 mins. 10/28 2 days 11 hrs. 31 mins. 10/29 3 days 11 hrs. 31 mins. 10/30 4 days 4 hrs 11 mins.\n\nNote: Laytime left upon departing Wilmington:\n\n1 day 19 hrs. 49 mins.\n\n(6 allowed days minus 4 days 4 hrs. 11 mins.) B. Puerto Cabello Date Laytime Strike Laytime Used 11/9 14:00-24:00 - 10 hrs. 10 hrs.11/10 00:00-24:00 - 1 day 1 day11/11 00:00-24:00 - 1 day 1 day Note: Laytime lapsed at 09:49 on 11/11. 11/12 00:00-24:00 - 1 day 1 day11/13 00:00-24:00 08:00-24:00 16 hrs. 1 day 16 hrs. divided by 2=811/14 00:00-24:00 00:00-24:00 12 hrs. 1 day 24 hrs.(1 day) divided by 2=12 hrs.11/15 00:00-24:00 00:00-24:00 12 hrs. 1 day 24 hrs.(1 day) divided by 2=12 hrs.11/16 00:00-24:00 00:00-12:00 18 hrs. 1 day 12 hrs. divided by 2 = 6 hrs.11/17 00:00-24:00 - 1 day 1 day11/18 00:00-24:00 - 1 day 1 day11/19 00:00-24:00 - 1 day 1 day11/20 00:00-24:00 - 1 day 1 day11/21 00:00-24:00 - 1 day 1 day11/22 00:00-24:00 - 1 day 1 day11/23 00:00-24:00 - 1 day 1 day11/24 00:00-24:00 - 1 day 1 day11/25 00:00-19:40 - 19 hrs.40 mins. Date Total Laytame Used 11/9 10 hrs. 11/10 1 day 10 hrs. 11/11 2 days 10 hrs. 11/12 3 days 10 hrs. 11/13 4 days 2 hrs. 11/14 4 days 14 hrs. 11/15 5 days 2 hrs. 11/16 5 days 20 hrs. 11/17 6 days 20 hrs. 11/18 7 days 20 hrs. 11/19 8 days 20 hrs. 11/20 9 days 20 hrs. 11/21 10 days 20 hrs. 11/22 11 days 20 hrs. 11/23 12 days 20 hrs. 11/24 13 days 20 hrs. 11/25 14 days 15 hrs. 40 mins.C. Demurrage Totals Laytime at Wilmington: 4 days 4 hrs. 11 mins.Laytime at Puerto Cabello: + 14 days 15 hrs. 40 mins.Laytime Used: 18 days 19 hrs. 51 mins.Laytime Allowed: - 6 days - -Demurrage: 12 days 19 hrs. 51 mins. (12.827 days) 12.827 days x $ 2000 per day Award: $ 25,654\n\nII. Detention A. Post-Puerto Cabello Date Detention Total Detention 11/25 19:40-24:00 4 hrs. 20 mins. 4 hrs. 20 mins.11/26-12/24 00:00-24:00 (each day) 29 days 4 hrs. 20 mins. 29 days12/25 00:00-12:00 29 days 16 hrs. 20 mins.B. Detention Totals Detention: 29 days 16 hrs. 20 mins. (29.681 days)29.681 days x $ 2000 per day $ 59,362 + $ 66,789.95 (Related Expenses)Award: $ 126,151.95III. Larsen's Total Award Demurrage Award: $ 25,654Detention Award: $ 126,151.95 Total Award: $ 151,805.95\n\n\u003cspan class=\"fn\"\u003e1. Regarding unloading responsibility, Ortega's testimony was contrary to an express letter of credit term and to Robert Carpenter's recollection. According to Ortega, Robert Carpenter had initially wanted $22 per bag, which would have included the discharge cost. That price was rejected. Ortega asserted that APRA, instead, accepted the $21 figure and a $21,000 \"share\" of the unloading fee. T. 426. However, the letter of credit, drafted at APRA's behest by Banco Provincial, contained the sale's \"primary terms. Joint Pretrial Order p. 4. One such term was \"CIF PUERTO CABELLO.\" Ex. 62. Ordinarily, a CIF (cost, insurance and freight) provision places loading responsibility on the shipper. See N.Y.U.C.C. ยง 2-320(2)(b) (\"Unless otherwise agreed, . . . C.I.F. destination . . . requires the seller . . . to . . . load the goods . . . .\"). [Note: For discussions regarding the applicability of the New York Uniform Commercial Code to the sale contract, see infra pp. 35-37, 101-02]. Necessarily, the shipper would not have unloading responsibility, its performance complete upon putting the goods aboard the vessel and forwarding the requisite documents to the receiver. See G. Gilmore \u0026 C. Black, The Law of Admiralty ยง 3-7, at 106-07 (2d ed. 1975). A different understanding concerning a \"primary term[]\" should have been contained in the letter of credit, which refers not at all to the $21,000 discharge limitation; and Ortega's parol evidence testimony cannot vary APRA's and Carpenter's manifest agreement. See N.Y.U.C.C ยง 2-202 (\"Terms . . . which are . . . set forth in a writing intended by the parties as a final expression of their agreement with respect to such terms . . . may not be contradicted by evidence of any prior agreement or of a contemporaneous oral agreement . . . .\"). APRA, thus, had discharge responsibility. This finding, though, is without practical importance. As will be discussed, APRA had no duty to unload that unusable cargo, the potatoes' Puerto Cabello arrival condition.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Michigan Crop Improvement Association (\"MCIA\"), independent of the federal-state authorities, also inspected some potatoes. Only 2 MCIA certificates are in evidence, neither citing soft rot. Since it is unclear whether the 924 bags encompassed by the MCIA certificates are also covered by the federal-state certificates, they are not otherwise included in the Court's figures.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Those 13 lots contain a total of 5830 bags. Although partially illegible, A208263 for a 450 bag lot is included in that total. When compared to the immediately preceding A208262 prepared by the same inspector on the same day concerning the same grower's produce, A208263 can be construed as noting soft rot.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Some potatoes may have been harvested in late August, others in early October. When in Michigan between September 8-12, 1981, Ortega visited warehouses, in which a \"big quantity\" of the potatoes to be purchased were already stored. T. 414. That indicates a late August-early September harvest. Dr. Cargill, an agricultural engineering professor, who \"work[s] with these farmers all the time,\" testified that they harvest \"the last week of September, the first week of October.\" T. 255. So, while September will be designated the gathering month, some potatoes may have been harvested a little earlier, others a little later.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. Dr. Cargill explained dew point as: \"the combination of temperature and the amount of water that the air will hold. If I have a cubic foot of air . . . [and] . . . [i]f I cool that air, it might rain. [D]ew point has been reached. If I put a cold potato in a dew point that is higher than the temperature of the potato, condensation occurs. T. 193.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. No direct evidence has been received showing September 1981 rain in the Gaylord area, although such precipitation was likely. Rain fell during the first week of October 1981; however, according to Dr. Cargill, the potatoes were probably in warehouses by then. That aligns with Ortega's testimony. See supra note 4.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Dr. Cargill's testimony indirectly corroborated this reasoning and, perhaps, further pinpointed the initial entry time. He described the Gaylord warehouses' effective ventilating systems, which would have diminished the likelihood of storage condensation. Absent condensation, erwinia could not have first entered the potatoes in the warehouses. Thus, the time of ingress was probably after harvest but before storage wherein the inspections were conducted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The five page charter party repeats some clause numbers. To prevent confusion, the first page clause numbers will be preceded by \"part I\", the second and third page clause numbers by \"part II\" and the fourth and fifth page clause numbers by \"rider.\" The clause and part designations will be abbreviated as \"cl.\" and \"pt.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. There are two bills of lading, one for 30,000 bags and another for 119. Identical in all other respects, they will be referred to in the singular. Despite the 30,119 figure, the exact number of bags actually loaded is uncertain. Murphy said that 27,745 were stowed. The ship tallied 29,757 with 362 remaining on the dock. Responding to the ship's count, Carpenter agreed to be responsible for any shortage up to 362 bags (accounting for the difference between the bill of lading 30,119 figure and the vessel's count). At trial, further information (e.g., bags arriving too late to load) indicated the number actually stowed was different yet - 27,663. These mettlesome discrepancies are unimportant. Whatever the number shipped, APRA will be refunded its full purchase price, negating a protest that it paid for some bags never placed on board. See infra p. 109.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. The Belize grounding also caused a one centimeter puncture of the No. 4 portside ballast tank that was securely repaired well before the vessel reached Wilmington.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Dasar's Santiago Marichal testified that the strike ended at 12:00 on November 16. The log supports his recollection. That day's 01:00 entry is: \"NO WORK BECAUSE OF STRIKE.\" Ex. 2. The next pertinent entry states: \"FROM [13:00] NO WORK BECAUSE OF DISPUTE ABOUT CARGO.\" Id. The reasonable inference (consistent with Marichal's account) is that the dockwide strike was ongoing at 01:00 and was ended at 12:00. From 13:00, the longshoremen specifically refused to unload the JETTE SIF's rotting cargo.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Robert Carpenter's notification date of Ortega's rejection seems to have been November 19, but it may have come during the following few days. Agent Duesing, of course, had notice prior to imparting Ortega's rejection to Robert Carpenter. Although that knowledge is imputable to the shipper, precisely when Duesing was informed is also unclear. See 3 Am. Jur. 2d Agency ยง 273, at 635-36 (1962) (\"The general rule . . . is that the principal is chargeable with . . . the . . . notice to his agent . . . . The fact that the . . . notice of the agent was not actually communicated will not prevent the operation of the general rule . . . .\") (footnotes omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The transcript (T. 436) refers to \"Guamanaro\", which is probably an incorrect phoneticsm for La Guaira, the only other Venezuelan port designated to receive seed potatoes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. To refute the charge of continuous condensation during the voyage, Larsen maintains that erwinia is aerobic needing oxygen. Extending, if consistent moisture existed in the holds, that bacteria could not have flourished - water cutting off its oxygen. Regarding erwinia's oxygen needs, the scientific testimony was again inconsistent. Dr. Barreiro said that the bacteria is aerobic but can be \"facultative anerobic\", meaning that in air's absence it obtains oxygen from nonair sources and still grows. T. 591. Dr. Potter, in contrast, related that erwinia was anerobic with \"low oxygen requirements.\" T. 295. Without proffering an unscientific opinion on erwinia's specific oxygenic nature, several points can be made towards resolution adequate for present purposes. First, the testimonial common ground is that erwinia can work under semi-anerobic conditions (\"facultative anerobic\" and anerobic with \"low oxygenic requirements\"), although the growth rate might vary. Second, continuous condensation does not mean that no air was in the holds. Indeed, as mentioned, the ventilation system was on throughout the voyage. If erwinia needs some air, that was present. Finally, erwinia works quickly. Considering all the above, whether erwinia is aerobic or anerobic, the scientists' testimonial differences do not preclude finding that continuous condensation in the holds permitted the pathogen to rapidly perform its assassinating mission.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Dr. Cargill also acknowledged that the BTU rate of a bacterially infected potato would increase. If so, his determination that the potatoes were degenerated on arrival may have even been conservative, erwinia infection not having been allowed for.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Larsen contends that as supported by the Biotec Report's conclusions, 67% of the cargo could still have been used for table or animal consumption on November 20. The thoroughness of the November 20 survey, from which the 67% figure is derived, has already been questioned. In addition, Larsen's argument ignores that changing a Venezuelan import license (i.e., converting the authorization to other than planting) is time consuming. These potatoes had no extra time, since the \"EXTENT OF [THE] DAMAGE [WOULD HAVE] INEVITABLY INCREAS[ED] EXPONENTIALLY DURING [THE] PROCESS\" of relicensing, paying separate fees, etc. Ex. 57, DDD(3). The latter point is likewise pertinent to a contention that at arrival the potatoes could have been used for other than planting.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Robert Carpenter did give testimony supporting seawater entry. He recounted a November 27 conversation with Captain Antonio de Vasconcelos, a surveyor. \"He . . . passed on . . . that he had a conversation with one of the crew members. He didn't specify who . . . . He was told the ship had kept the hatch covers open on the way down, and saltwater had come through the top of the hatches . . . . Ex. 125, p. 71 Absent separate exceptions matching each tier, the testimony is inadmissible multilevel hearsay (purportedly) emanating from an unidentified individual. See Fed. R. Evid. 805 (\"Hearsay . . . within hearsay is not excluded . . . if each part of the combined statements conforms with an exception to the hearsay rule . . . .\"). Apart from that disability, substantial reliability problems remain. See 4 J. Weinstein \u0026 M. Berger, Weinstein's Evidence P805[01], at 805-5 (1984) (\"'Every level of hearsay provides another possibility that the facts were inaccurately reported by the declarant . . . or misunderstood by the person to whom the statement was made.'\") (citation omitted). The alleged origin was an anonymous crew member, who imparted an account later passed on by Captain de Vasconcelos, another uncross-examined out-of-court declarent. That account was finally filtered through Robert Carpenter. Assuming no purposeful fabrication, the product of such successive retelling is inherently untrustworthy. That is especially so in this instance where the record is barren of direct corroborating evidence that the hatches were open outbound. This impaired testimony cannot be admitted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Carpenter's failure to tender the potatoes to the vessel in good order, see infra pp. 60-67, lessens the significance of whether COGSA is applicable. Compare The NIEL MAERSK, 91 F.2d 932, 934-35 (2d Cir.), cert. denied, 302 U.S. 753, 82 L. Ed. 582, 58 S. Ct. 281 (1937) (pre-COGSA) (quoted infra pp. 73-74) with Caemint Food, Inc. v. Brasileiro, 647 F.2d 347, 356 (2d Cir. 1981) (COGSA) (quoted infra p. 74).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. A charter party copy did not accompany the letter of credit documents. So, if Ortega had seen the incorporation reference, he could not have immediately reviewed that carriage contract. But he certainly could have requested a copy from Robert Carpenter or Captain Nissen. At any rate, the charter party was not a document specified in the letter of credit. Its absence (as is usual) when the other shipping papers were transferred to the banks and Ortega does not defeat the incorporation. See H. Tiberg, The Law of Demurrage 593 (2d ed. 1971) (\"The general view . . . is . . . that the incorporation is effective even though the charterparty was not presented at . . . negotiation.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The letter of credit sent by Banco Provincial to Republic National said that it was \"SUBJECT TO THE UNIFORM USAGES AND RULES RELATIVE TO LETTERS OF CREDIT (1974 REVISION) INTERNATIONAL CHAMBER OF COMMERCE (BULLETIN NUMBER 290).\" Ex. 62. That was likely a UCP misdesignation. Republic National specified the UCP in the standard manner when forwarding a subsequent letter of credit amendment from Banco Provincial to Carpenter's Flagship Bank. Ex. 64. As well, a letter of credit translation for the Flagship Bank contains a parenthetical correcting Banco Provincial's original misidentification. Ex. 65. Thus, Banco Provincial also must have meant the UCP.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The letter of credit transaction is not directly connected to the ship's hire. Despite that separateness, injecting constructive notice of the incorporation reference into the legal relationships involved in the ship's hire is not analytical overreaching. For to have not considered that evidence would be ignoring proof arising in an apart but assuredly coordinate transaction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. As Dr. Potter testified, the identified soft rot was tolerable when the Michigan inspections were conducted. With some bags arriving at Wilmington as early as October 15, 1981, two weeks of storage there were left before loading. And Dr. Cargill remarked that some condensation occurred at Wilmington during the wait. Additional infection post-Michigan but before loading, therefore, cannot be discounted.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Even with no preloading pulp infection, some potatoes would have decayed due to erwinia's inevitable residence on the skins. As inferable from the just cited opinions of Drs. Potter, Gonzalez and Barreiro, though, the damage would not have been as substantial since the skin erwinia would have had to first access some pulps before disseminating through the stow. Thus, if the bacteria had not penetrated certain potatoes before Wilmington, erwinia could still have been the proximate cause of the arrival deterioration, although the decomposition would have been less.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. A winter test was performed, which involved planting Michigan crop samples in Florida to ascertain whether diseases (usually viral) would appear. The scientists, however, disagreed whether erwinia would have been identified. In any event, the test results have not been produced, despite Robert Carpenter's deposition assurance that he would provide them. For that nonproduction, Larsen urges that a negative inference be drawn, i.e., the findings demonstrated erwinia's presence. See Tupman Thurlow Co. v. S.S. CAP CASTILLO, 490 F.2d 302, 308 (2d Cir. 1974) (\"The nonproduction of material evidence which is in the control of a party raises an inference that that evidence is unfavorable to that party.\"). The Court declines. First, the scientific disagreement renders it unclear whether the winter test even identifies erwinia. The outcome, in other words, may not be \"material.\" Second, even if the scientists were in accord that erwinia would be isolated, drawing an adverse inference means receiving cumulative evidence, sufficient proof already in the record that some potatoes were infected. In brief, Larsen asks the Court to take an uncertain and superfluous step.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The bunker deviation was excusable as a reasonable departure to close lying Curacao. See Ex. 1, pt. II, cl. 3 (\"The vessel has the liberty to call at any port . . . for any purpose . . . .\"). See also 2A Benedict ยง 125, at 12-19 (\"While Courts were originally inclined to construe these [broad liberty] clauses strictly against the carrier, in recent years they have been interpreted more favorably . . . to authorize reasonable departures from the normal route.\") (footnotes omitted). See generally General Electric Co. v. S.S. NANCY LYKES, 706 F.2d 80, 86 (2d. Cir.), cert. denied, 464 U.S. 849, 78 L. Ed. 2d 145, 104 S. Ct. 157 (1983) (\"[A] deviation is unreasonable . . . when . . . substantially increas[ing] the exposure of cargo to foreseeable dangers that would have been avoided had no deviation occurred.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. The cargo's Wilmington condition, of course, has significance for the sale contract analysis as well. See infra pp. 104-06.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Without dispute, the weekend period from 17:00 on October 23 to 08:00 on October 26 is excluded from the laytime calculations by charter party, rider cl. 19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Larsen argues that Carpenter should only be credited with raintimes contained in the log. The Court disagrees. Captain Nissen, Larsen's loading representative, signed the Wilmington Statement of Facts listing the United States Weather Bureau's precipitation periods for that area. Attested to then by its on-site representative, Larsen is held now to those averred raintimes.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. As between buyer and seller, the culpability for the documents belatedness rests more with Carpenter under the sale contract's CIF term. See N.Y.U.C.C. ยง 2-320(2) (e).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. Larsen asserts that Carpenter should not benefit from the general strike clause for its part in the documents' lateness. That position disregards Carpenter's full penalization for the November 9-12 period, most of that span being directly attributable to the papers' delay. Moreover, as treated in the following text, this apportionment is consistent with the Court's approach to the none-to-clear general strike clause, i.e., allowing the half demurrage rate where laytime had been exceeded if the stoppage was not due to the charterer's (or receiver's) fault.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Notwithstanding, as will be discussed, APRA had no duty under the charter party or the sale contract to unload this cargo, given its deteriorated state and intended purpose. See infra pp. 99-101, 125-27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Pointing out that the shipowner did not agree to pay half the increased unloading charge, APRA maintains that Larsen did not mitigate damages. The argument's false premise is that Larsen had that obligation. See Summerskill at 217 (\"[The mitigation] rule does not apply generally in demurrage cases; there is not . . . a duty upon the shipowner to load or discharge cargo which is not being loaded or discharged by the charterer at the agreed rate. The reason for this alteration of the general rule . . . seems to be that the parties have agreed in advance that the demurrage payment shall constitute the damages.\") (footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Larsen's demurrage amount, Item 3.01 in the Summary of Claim, is not approved, the Court having recomputed that sum to reflect the preceding analysis. Likewise, Items 3.01 and 3.21 for the post-Puerto Cabello loss of time are not approved. The allowed amount for those combined Items is the $59,362 basic detention award. Finally, Item 3.23 in the Summary of Claim for Puerto Cabello disbursements is increased by $7,784.14 in related expenses for which plaintiff had been billed just before trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. As will be discussed, had the potatoes been damaged though not worthless, APRA's discharge duty would have been owed to Larsen under the charter party, not to Carpenter under the sale contract even with its CIF term. See infra pp. 125-27.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Several ยง 2-314(2) subsections could be urged, e.g., subsection (e) (\"adequately contained\" goods) for using burlap bags rather than crates. The primary allegation, though, is that the potatoes were unfit, making ยง 2-314 (c) the focus. See T.J. Stevenson \u0026 Co. v. 81,193 Bags Flour, 629 F.2d 338, 351 (5th Cir. 1980) (\"[W]e consider only . . . subsection(c) . . . and do not reach the arguably applicable standards of subsections (a) and (b). The question is therefore whether the flour . . . was 'fit for the ordinary purposes for which such goods are used.'\") (footnote omitted). On a broader note, because ยง 2-314 is brought to bear, considering recoveries via ยง 2-313's express warranties and ยง 2-315's implied warranty of fitness for a particular purpose - both urged by APRA - is not necessary. See 3 Anderson ยง 2-313:7, at 12 (\"[T]here is no advantage to be gained by suing on the one theory rather than the other because the recovery . . . [is] the same.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Actually, the risk may not have passed until the documents were presented to Republic National on November 2, 1981. See Gilmore \u0026 Black ยง 3-7, at 106-07 (\"The seller completes his performance by procuring the necessary documents (bill of lading, insurance policy . . . [etc.] . . .) and forwarding them to the buyer.\"). But as the text next addresses, the potatoes were not in good condition upon tender and the risk never shifted. Thus, fixing a more precise risk transfer date can be forgone.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The sale price being refunded, the buyer's claim against Carpenter for nonprocurement of \"all risks\" insurance need not be considered. An affirmative reason does exist, though, for denying recovery on that alternative theory. To specify, an inherent vice proximately caused the loss. And \"all risk\" coverage usually does not extend to inherent vice. See Greene v. Cheetham, 293 F.2d 933, 936-37 (2d Cir. 1961) (\"[T]he 'all-risk' event . . . would not include . . . an event caused by the consummation during the period of coverage of an indwelling fault in the goods that had existed prior to that coverage.\"). Hence, if Carpenter had procured an \"all risks\" policy, APRA would not be made whole, the harm flowing from an uninsured defect. Were it necessary to resolve, then, APRA's insurance argument would fail. See Morrison Grain Co. v. Utica Mutual Insurance Co., 446 F. Supp. 415, 420 (D. Fla. 1977), aff'd in relevant part, 632 F.2d 424, 431 (5th Cir. 1980) (\"'Under an all risk policy the insured must prove that the cargo was in good condition when the policy attached and that the cargo was damaged when unloaded from the vessel.'\") (citation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Here, Carpenter's proof plight is more understandable. Data regarding the exact gains, if any, derived by those APRA members planting alternative crops was probably in their heads. Even Ortega, their president, appeared to have little knowledge on this point. Consequently, regional comparative information, which Carpenter could have independently researched for Ortega's cross-examination or rebuttal, would not have served. The number of APRA farmers who planted, what they planted and the amount they planted unknown, information regarding production elsewhere could not be compared to anything. As to deposing the individual farmers, that is dismissed as unrealistic, their own organization apparently not knowing who all of them were. In sum, on this point, the Court takes Carpenter's evidentiary problem into account.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Those who did not plant could have been stopped for valid reasons, such as financial inability to buy other seeds. Without evidence to the contrary, nonmitigation by all cannot be held against APRA.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. The transcript references are to the testimony of Ortega, who later inconsistently stated that they planted in January. T. 505. He may have misspoken since his other testimony (including his communication to Robert Carpenter that the potatoes were needed by the \"second week of November\") points to a fall sowing. T. 412. Regardless, the important time span pertaining to lost profits is the February-March harvesting-marketing, about which there are no evidentiary discrepancies.\u003c/span\u003e\n\n",
    "body_length": 204291,
    "citedas": [
      "620 F. Supp. 1084"
    ],
    "attorneys": "DeORCHIS \u0026 PARTNERS, New York, New York, VINCENT M. DeORCHIS, ESQ. for Plaintiff. , ZOCK, PETRIE, REID \u0026 CURTIN, New York, New York, MARY T. REILLY, ESQ., for Defendants A.C. Carpenter, Inc. and A.A. Carpenter, Inc. , GIALLORENZI \u0026 CAMPBELL, New York, New York, RENATO C. GIALLORENZI, ESQ., for Defendant Associacion de Productores Rurales del Estado Aragua.",
    "category": [
      "124",
      "243",
      "252"
    ],
    "judges": "NEAHER, District Judge.",
    "citation_count": 0
  }
}
