{
  "id": "qYAqHJQBep42eRA9OdCH",
  "document": {
    "title": "Reichert v. Hornbeck",
    "full_title": "Jeffrey W. REICHERT v. Sarah H. HORNBECK, f/k/a Sarah H. Reichert",
    "jurisdiction": "Court of Special Appeals of Maryland",
    "date": "2013-03-20T00:00:00+0000",
    "docket": "No. 0213",
    "body": "HOTTEN, J. In this divorce action between Jeffrey W. Reichert (“Jeffrey”), the appellant-cross-appellee, and Sarah Hornbeck1 (“Sarah”), the appellee-cross-appellant, the Circuit Court for Baltimore City granted a divorce on the grounds of a twelvemonth separation, pursuant to Md.Code (1984, 2012 Repl.Vol.), § 7-103(a)(4) of the Family Law Article,2 and granted both *292parties joint physical and legal custody of the child with tie-breaking authority to Sarah. The court declined to make any award of rehabilitative alimony to Sarah. The court, however, ordered Jeffrey to pay $1,651 per month in prospective and retroactive child support. Because Jeffrey had contributed $500 per month in pendente lite child support prior to the absolute dissolution of the parties’ marriage, the court credited him $4,806 in retroactive child support but, nevertheless, concluded he owed $15,006 in arrearages. As a consequence, the court ordered Jeffrey to pay an additional $500 per month in child support until the $15,006 in arrearages were satisfied. In addition, the court granted Jeffrey the right to claim the parties’ minor child as a dependent for his 2011 taxes and every other year thereafter. After reviewing the property the parties amassed during their eighteen-month marriage, the court found that the 2009 joint tax refund should have been equally divided into both Jeffrey and Sarah’s accounts. As a consequence, the court concluded that because Jeffrey had wrongfully dissipated the entire amount of the refund, it was extant property. Therefore, the court designated half the amount of the refund ($8,100) Jeffrey’s extant property. As a result, the court granted Sarah a monetary award in the amount of $7,000 and further awarded her $60,000 in attorney’s fees. Following the court’s judgment of absolute divorce, Jeffrey filed a motion to alter or amend the court’s judgment on October 27, 2011. In response, Sarah filed a motion in opposition and further moved to revise the court’s previous judgment on November 16, 2011. The trial court held a hearing on February 21, 2012, and issued a memorandum and *293order on March 30, 2012, leaving open the issue of whether Sarah was entitled to additional attorney’s fees for the post-trial motions. As a result, the court held an additional hearing on April 13, 2012, denying her request for additional fees. Jeffrey noted a timely appeal to this Court.3 In response, Sarah filed a timely cross-appeal. In sum, both parties presented six questions for our review. We have consolidated, rephrased, and reorganized them as follows:4 1. Did the circuit court abuse its discretion when it ordered joint legal custody of the minor child with tie-breaking authority to Sarah Hornbeck and when it ordered joint physical custody of the minor child? 2. Did the circuit court err in its findings when it calculated the child support owed to the parties’ minor child? 3. Did the circuit court err or abuse its discretion regarding the tax exemption for the parties’ minor child? 4. Did the circuit court err in granting Sarah Hornbeck a monetary award in the amount of $7,000? 5. Did the trial court abuse its discretion in awarding Sarah Hornbeck $60,000 in attorney’s fees? *294For the reasons outlined below, we affirm the Circuit Court for Baltimore City’s judgment of absolute divorce and its grant of joint physical and legal custody, with tie-breaking authority to Sarah Hornbeck. Because we conclude, however, that the court erred in ordering Jeffrey to pay an unrealized amount of income, in ordering alternating years to the tax dependency exemption without the appropriate consideration, in the granting of a monetary award, and in ordering $60,000 in attorney’s fees, we vacate those orders and remand the case for further proceedings consistent with this opinion. I. FACTUAL AND PROCEDURAL HISTORY Sarah and Jeffrey first met in a restaurant on April 8, 2000. Jeffrey was a recent law school graduate and bar exam passee, working for Allegis Group as Associate General Counsel. At that time, Sarah was preparing for her matriculation to the University of Baltimore School of Law and contemplating a future career in legal practice. The couple dated for a little over three years until their initial breakup in the spring of 2008. The relationship ended shortly before Sarah’s successful completion of her legal studies. Although both Sarah and Jeffrey attributed their initial breakup of 2003 to different factors, both parties characterized their initial relationship as “rocky.” Nonetheless, Sarah and Jeffrey remained in contact with one another following the end of their initial relationship. Around April of 2008, the two agreed to meet for dinner. Thereafter, the parties resumed their romance on and were engaged four months later. At that time, Jeffrey had proverbially moved-up the ladder at Allegis Group and was now earning approximately $125,000 a year as Group General Counsel for Allegis Group. In addition, he earned an additional amount from his work with the Army Reserves. Shortly before the rekindling of their romance, Sarah was earning approximately $120,000 a year at Roy Kirby and Sons, *295Inc. She left the company, however, shortly after the end of her prior failed engagement. She subsequently assumed employment with Thomson Reuters as a Westlaw Research Specialist on August 17, 2009, earning roughly $68,340 a year. On November 1, 2008, Sarah and Jeffrey moved into a three-story rental property located at 1286 Harbor Island Walk, Baltimore, Maryland 21230. The parties were subsequently married in an elaborate ceremony at Mount Vernon Place United Methodist Church on January 31, 2009. At the time of the parties’ marriage, Jeffrey was 35.5 Sarah was nearly 34.6 Shortly thereafter, the parties’ honeymooned on St. Kitts, an island located in the West Indies formally known as St. Christopher Island. Unfortunately, the conflict that Sarah and Jeffrey had experienced during their first relationship returned on the second night of their honeymoon and would remain throughout their short marriage. Despite the parties’ many disagreements, Sarah bore a son, Grant Lyle Reichert (“Grant”), on November 7, 2009. Sadly, Grant was born with a collapsed lung, and spent the first three nights after his birth in the Neonatal Intensive Care Unit at Johns Hopkins Hospital. At approximately twenty-four to twenty-five days of age, Grant began vomiting. Unfortunately, Grant’s vomiting progressively worsened, necessitating emergency surgery to correct his pyloric stenosis.7 Grant’s medical complications have subsequently resolved. *296Sarah and Jeffrey found ways to work through their personal conflicts to attend to the needs of their child. However, once Grant’s condition improved Sarah and Jeffrey’s discourse resumed. Marriage counseling proved unsuccessful. At the end of a counseling session on August 27, 2010, Sarah and Jeffrey departed separately. Fearing for her safety and for that of her son, Sarah attempted to obtain a protective order, but her request was denied. Sarah returned home to Grant, who was in the care of Sarah’s mother. Later that evening, divorce and custody papers were delivered to Sarah. After Sarah contacted counsel, she was subsequently informed that Jeffrey had filed a protective order against her. In response, Sarah filed a counter complaint for limited divorce, custody, child support and other relief. She subsequently filed a timely answer to Jeffrey’s complaint on September 24, 2010. The parties proceeded to litigate the matter for a series of months. Trial commenced on September 20, 2011. At the close of trial on September 30, 2011, the circuit court issued its oral opinion, in which it granted a divorce on the grounds of a twelve-month separation, pursuant to Md.Code (1984, 2012 RepLVol.), § 7-103(a)(4) of the Family Law Article,8 and granted both parties joint physical and legal custody of the child with tie-breaking authority to Sarah. The court declined to make any award of rehabilitative alimony to Sarah. However, the court ordered Jeffrey to pay $1,651 per month in prospective and retroactive child support. Because Jeffrey had contributed $500 per month in pendente lite child support prior to the absolute dissolution of the parties’ marriage, the court credited him $4,806 in retroactive child support but concluded he, nevertheless, owed $15,006 in arrearages. As a consequence, the court ordered Jeffrey to pay an addition $500 per month in child support until the $15,006 in arrearages were satisfied. Additionally, the court granted Jeffrey the right to claim the parties’ minor child as a dependent for his 2011 taxes and every-other year thereafter. *297The court subsequently addressed Sarah and Jeffrey’s distribution of the marital property. Preliminarily, it noted that both Jeffrey and Sarah entered the marriage as property owners, each individually owning condominiums in Baltimore City, Maryland. Further, although the court acknowledged that the parties’ retirement plans were marital property, it granted the retirement plans to the respective spouse for whom the plan was created. After reviewing additional property the parties’ amassed during their eighteen-month marriage, the court found that the 2009 joint tax refund should have been equally divided into both Jeffrey and Sarah’s accounts. As a consequence, the court concluded that because Jeffrey had wrongfully dissipated the entire amount of the refund, it was extant property. Thereafter, the court granted Sarah a monetary award in the amount of $7,000 and further awarded her $60,000 in attorney’s fees. Following the court’s judgment of absolute divorce, Jeffrey filed a motion to alter or amend the judgment on October 27, 2011. In response, Sarah filed a motion in opposition and further moved to revise the court’s previous judgment on November 16, 2011. The trial court held a hearing on February 21, 2012, and issued a memorandum and order on March 30, 2012, leaving open the issue of whether Sarah was entitled to additional attorney’s fees for the post-trial motions. As a result, the court held an additional hearing on April 13, 2012, denying her request for additional fees. Jeffrey noted a timely appeal to this Court, to which Sarah responded by filing a timely cross-appeal. Additional pertinent facts with be provided infra. II. DISCUSSION (A) The Legal and Physical Custody of the Parties’ Minor Child. After granting the parties’ request for an absolute divorce and ordering that Sarah’s maiden name be restored, the *298circuit court addressed the issue of child custody in its oral opinion, stating: [Sarah’s counsel] has said to me that because [Jeffrey] has exhibited the behavior that I’ve already spoken about before the trial, during the trial and the like. That I should not award him with the joint custody that he’s requesting. And I believe it was something to the effect that if, you know, is the kind of character, the person with this kind of character that should have the joint custody with the child. And when I thought about this and literally I had not made up my mind about anything, until I heard you all argue. So I’m back there thinking about it. And part of me initially said, you know, yeah. She’s kind of right, because that’s a character flaw. A lot of what I’ve seen here is character flaw. But if I did that who would I be punishing? Would I punish [Jeffrey]? But who am I to be concerned about when I’m talking about custody? It’s Grant. And then also if I did that it would punish Grant. And I’m not willing to make him suffer. He has, regardless of what your flaws or individual flaws are[,] I think he has great parents. Regardless to what your individual flaws may be. I can address those in another way. But as far as [G]rant is concerned[,] he gets the best of both of you. As much as the other witnesses tried when they came in, and when it came down to it, each of them said I’ve got concerns about him, but they’re fit, and they’re proper and they love their son. And even when the other person testified concerning the parenting if you would of the other, it wasn’t a whole lot that you all could say about, that was negative about the parenting, because it wasn’t. Each of you are a good parent. Your character flaws show up when you deal with each other, but not when you deal with Grant. And so when it comes to custody, this Court believes[,] and as much as I don’t like to split children down the middle, it has been working, it’s not broken. Joint custody *299I am going to grant. Physical joint custody with Grant. And Pm going to address some other — we’re going to change some issues concerning the holidays and the like, and we’ll take about that in a moment. But I just want to get the decision part out of the way, and we’ll go back and tweak some of the other things. Each of you talked about, or you both said joint legal custody would be acceptable. And I, the concern that I have is that you all don’t communicate well. That’s a concern that I have, but you’ve asked for, or you’ve agreed to a parent — a parental — a parent coordinator, sorry. You’ve agreed to a parent coordinator. And I think that that [sic] is the best way to do it.... And the reason, short of your inability to communicate with each other, I have to deal with, certainly the character and reputation of the parents. I think short of what you all exhibit towards each other, as I said I think that each of you are — yeah—other persons that came here to testify on your behalf, the proffers that I received. They each find that you all are good people. Nobody has said that you’re horrible people. One individual may not have liked how somebody looked at them, or how they didn’t speak, or they did speak. Not that you’re bad people. So[,] I can’t say there’s anything wrong with your character, or your reputation that gives this Court any concern when it comes to custody. The psychological and physical fitness of each parent, I find that you all are certainly equal in that matter. And so[,] therefore, I don’t think that gets in the way. The desire of the parents and the content of any agreement between them, you all had one agreement concerning just the — that was financial more than anything else, the investment and the college tuition. But you at least desire, each of you desires to be a good parent to Grant. And that’s what I think is very, very important. Your willingness to share the custody, I *300know that one side wanted, [Sarah] wanted sole custody with joint legal, but sole physical. But [Jeffrey] wanted joint physical, as well as joint legal custody. So there’s a little bit, you know, kind of plus and minus I did there with the willingness part of this, the factors that I look at. But not so much so that[ ] it would make me override that the consent agreement that you all entered into has been working. It has been. The ability for you all, I talked about the communicating, we’re going to settle that with the parent coordinator. The potential of maintaining natural family relations, I believe that whether the child is with [Jeffrey], or with [Sarah], ... they will have the ability commune with their families on an equal basis. Not just [Sarah] and not just [Jeffrey], but with grandparents, with cousins, and with aunts and uncles and the like on each side. He’s too young to tell me what his preference is, so we can’t even consider that. The material opportunities that would affect the child’s future, you all are more, as I indicated, extremely blessed to provide material opportunities. Certainly [Jeffrey] makes more money than [Sarah] does. Whether that’s, you know, in my opinion sometimes it’s a choice that we make as to, you know, whether or not you make a lot of money, and sometimes it’s not. Sometimes it’s the best job you can get, and you hold onto that until you can do better. That’s just the way of the world. The age, health and sex of the child, and Grant’s very young. Not quite two, almost two, not quite. And his health is, from what I understand now is great. The only time that I think you all had the chance to bring it together was when he was ill. Yeah, and that was really when I thought, that was the one time that you all actually came together. And a lot of weight for a little boy. He couldn’t even hold you together. So, you know, it only lasted for awhile. But that was the *301time in which you all[,] sort of, had a meeting of the minds if you will. The suitability of your residences, I have — they’re certainly very suitable. I have no concerns one way or the other. I think again, he’s a blessed little boy to have two residences, and the two that are as — that they’re safe. And that he has a place where he can grow, and he can thrive. And so I think they’re very suitable. How long — you want me to consider how long the child’s been separated from one parent or the next. You all for the last year, all right, it’s been 13 months maybe, something like that been [sic] sharing him back and forth. So he certainly hasn’t had to be separated from either one of you to any extent to where it would damage him when he wasn’t with you, or that he would resist going with you, because he’s not familiar with you. There’s been no voluntary abandonment for me to consider. His relationship with each of you, everyone comes in and testifies to each of you. And said how Grant loves you back, as much as you all love him. And that’s important, as well. You all live [in] very close proximity to each other[. S]o[,] that’s not like someone has to travel a long, long distance to get to him and the like, but you do live very, very close. There’s nothing, no schools I have to worry about, whether he lives — he’s going to be able to go to school or he’s not. I don’t have to worry about that. The demands of each parent’s employment. And there’s a lot of talk about that. And in my reviewing and listening to the evidence, I think each of you, the way it came out can work as much as you want to work. In that sense of flexibility. You can work from home, when you want to work from home. You can go to work. You spend some hours when you travel, some hours when you travel. The Army — the Jag Reserve that [Jeffrey], that *302may take him away a little bit more. And I’m going to address that period of time with the custody. ____The age and number of children involved, only one child that’s involved in this matter. Sincerity, motivation of the parent’s request, you all are more sincere than anybody. And I think that the legal fees bear that out, that you’ve been very serious about your requests, and the best interest of Grant, which is the final thing that I must consider. And as I said, I think that Grant deserves the best of both of you. I think that in the last 13 months, or how — I say 13 months, how many months are we talking about a year?.... That he has gotten the best of both of you. Nobody has testified to me about anything that’s been less. When Grant — when it was concerning [ ] Grant, ... you all gave your best. And that you all were, for the most part on your best behavior, when you all were doing the exchanges.... (emphasis added). Following the court’s continued discussion of how Grant’s holidays and vacation schedule would be divided between Sarah and Jeffrey, the Court considered the matter of a tie-breaking authority with the parties’ counsel: THE COURT: Yes, and I am holding — I don’t know what I want to do. But I know what I have to do. I have to give a tie[-]breaker. I meant,] that’s the hard part, because I just wish that you guys could talk, but you don’t. Is there a way, and I’ve seen this before, [counsel], where the parties cannot come to an agreement. That they have to seek a mediator, I’ve seen that done before. [Sarah’s counsel]: Or with the parent coordinator bona fide efforts to try to resolve it, and if not then a tie[-]breaker’s allowed. *303THE COURT: Okay, okay. I can’t make the parent coordinator do the tie[-]breaking authority can I? No. [Jeffrey’s counsel]: Unfortunately, Your Honor, you can’t. THE COURT: Okay, all right. But the parent coordinator will be used for that particular reason, for communication between the parents. So there must be some bona fide effort. And then [Sarah] will have the tie[-]breaking authority. (emphasis added). On appeal, Jeffrey contends that the trial court abused its discretion when it ordered joint legal custody, with tie-breaking authority to Sarah. Specifically, he asserts that the court abused its discretion “because [the court] gave no reason for the decision, because it was not supported by the evidence, and because there was no finding that it was in the son’s best interest.” Thus, he argues that, “[i]n essence, the court gave legal custody to [Sarah.]” Conversely, Sarah argues that while “the court had reason to grant sole custody” to her, the trial court properly exercised its discretion when it ordered joint legal custody of their minor child with tie-breaking authority to her, because the court’s order of a bona fide effort to agree via the parent coordinator safeguards Grant’s best interest. Nevertheless, Sarah further contends that the circuit court erred when it ordered joint physical custody for two reasons. First, she asserts that “[t]he trial court failed to give weight to [Jeffrey’s] abuse of the legal system in his effort to obtain custody” of their minor child. Second, she attests that “[t]he court further failed to give adequate weight to the best interest[ ] of the child,” which, she insists, is not “served here by joint physical custody.” We conclude, however, that the circuit court properly exercised its discretion. Preliminarily, we note that this Court reviews child custody determinations utilizing three interrelated standards of review. Gillespie v. Gillespie, 206 Md.App. 146, 170, 47 A.3d 1018 (2012) (affirming the circuit court’s modification of physical custody by granting significantly more access to the *304father and concluding there was no error in modifying the joint legal custody decree by granting the father tie-breaking authority in the event of an impasse). The Court of Appeals described the three interrelated standards in the case of In re Yve S., 373 Md. 551, 819 A.2d 1030 (2003): .... [W]e point out three distinct aspects of review in child custody disputes. When the appellate court scrutinizes factual findings, the clearly erroneous standard of [Md. Rule 8-131(c) ] applies. [Second,] if it appears that the [court] erred as to matters of law, further proceedings in the trial court will ordinarily be required unless the error is determined to be harmless. Finally, when the appellate court views the ultimate conclusion of the [court] founded upon sound legal principles and based upon factual findings that are not clearly erroneous, the [court’s] decision should be disturbed only if there has been a clear abuse of discretion. Id. at 586, 819 A.2d 1030. Therefore, the reviewing court gives “due regard ... to the opportunity of the lower court to judge the credibility of the witnesses.” Id. at 584, 819 A.2d 1030. Further, we acknowledge that “it is within the sound discretion of the [trial court] to award custody according to the exigencies of each case, and ... a reviewing court may interfere with such a determination only on a clear showing of abuse of that discretion. Such broad discretion is vested in the [trial court] because only [it] sees the witnesses and the parties, hears the testimony, and has the opportunity to speak with the child; [it] is in a far better position than is an appellate court, which has only a cold record before it, to weigh the evidence and determine what disposition will best promote the welfare of the minor” child. Id. at 585-86, 819 A.2d 1030. It is a bedrock principle that when the trial court makes a custody determination, it is required to evaluate each case on an individual basis in order to determine what is in the best interests of the child. Gillespie, 206 Md.App. at 173, 47 A.3d 1018 (citations omitted). See also Bienenfeld v. BennettrWhite, 91 Md.App. 488, 503, 605 A.2d 172 (1992) (“It is well established that child custody determinations be made by *305careful examination of facts on a case-by-case basis.”); Montgomery Cnty. v. Sanders, 38 Md.App. 406, 419, 381 A.2d 1154 (1978) (the best interest of the child varies with each individual case). “Courts are not limited or bound to consideration of any exhaustive list of factors in applying the best interest standard, but possess a wide discretion concomitant with their ‘plenary authority to determine any question concerning the welfare of children within their jurisdiction[.]’ ” Bienenfeld, 91 Md.App. at 503-04, 605 A.2d 172 (internal citation omitted) (quoting Kennedy v. Kennedy, 55 Md.App. 299, 310, 462 A.2d 1208 (1983)). Nonetheless, Maryland courts have provided a list of factors that the trial court may use in rendering its custodial determination. These factors include: [AJmong other things, the fitness of the persons seeking custody, the adaptability of the prospective custodian to the task, the age, sex and health of the child, the physical, spiritual and moral well-being of the child, the environment and surroundings in which the child will be reared, the influences likely to be exerted on the child, and, if he or she is old enough to make a rationale choice, the preference of the child. Wagner v. Wagner, 109 Md.App. 1, 39, 674 A.2d 1 (1996) (citing Hild v. Hild, 221 Md. 349, 357, 157 A.2d 442 (1960), and Kramer v. Kramer, 26 Md.App. 620, 623, 339 A.2d 328 (1975)), quoted in Gillespie, 206 Md.App. at 173, 47 A.3d 1018. “At best we can discuss the major factors that should be considered in determining whether joint custody is appropriate, but in doing so we recognize that none has talismanic qualities and that no single list of criteria will satisfy the demands of every case.” Taylor v. Taylor, 306 Md. 290, 303, 508 A.2d 964 (1986) (discussing joint custody considerations). Accordingly, “[t]he best interest of the child is therefore not considered as one of many factors, but as the objective to which virtually all other factors speak.” Id. Indeed, there are specific factors particularly relevant to a consideration of joint custody: (1) the capacity of the parents to communicate and reach shared decisions affecting the child’s welfare; (2) the willingness of parents to share *306custody; (3) the fitness of the parents; (4) the relationship established between the child and each parent; (5) the preference of the child; (6) the potential disruption of child’s social and school life; (7) the geographic proximity of the parental homes; (8) the demands of each parents’ employment; (9) the age and number of children; (10) the sincerity of the parents’ request for joint custody; (11) the financial status of the parents; (12) the impact on state or federal assistance; (13) the benefit to the parents; and (14) any other relevant factors to be considered. Taylor, 306 Md. at 304-11, 508 A.2d 964. These factors, however, are “in no way intended to minimize the importance of considering all factors and all options before arriving at a decision.” Id. at 303, 508 A.2d 964 (emphasis added). To be sure, the capacity of the parties to communicate and reach shared decisions regarding the children’s welfare is of paramount importance. Id. (“This is clearly the most important factor in the determination of whether an award of joint legal custody is appropriate.... ”). See also Gillespie, 206 Md.App. at 173, 47 A.3d 1018. As a consequence, “[rjarely, if ever, should joint legal custody be awarded in the absence of a record of mature conduct on the part of the parents evidencing an ability to effectively communicate with each other concerning the best interest of the child, and then only when it is possible to make a finding of a strong potential for such conduct in the future” Taylor, 306 Md. at 304, 508 A.2d 964. We caution, however, that this does not require the parents to agree on every aspect of parenting, “but their views should not be so widely divergent or so inflexibly maintained as to forecast the probability of continuing disagreement on important matters.” Id. at 305-06, 508 A.2d 964. See also Barton v. Hirshberg, 137 Md.App. 1, 25, 767 A.2d 874 (2001). Therefore, at a minimum, the parties must maintain “[a] sense of respect for one another as parents, despite the disappointment in each other as marriage partners. Each [must] appreciate[ ] the value of the other to the child, and [maintain] sensitivity] *307to the possible loss of a parent-child relationship.” Taylor, 306 Md. at 306, 508 A.2d 964 (citing S. Steinman, Joint Custody: What We Know, What We Have Yet to Learn, and the Judicial and Legislative Implications, 16 U.C.D.L. Rev. 739, 745 (1983)). Ordinarily, the best evidence of compatibility with this criterion will be the past conduct or “track record” of the parties. Taylor, 306 Md. at 307, 508 A.2d 964. “We recognize, however, that the tensions of separation and litigation will sometimes produce bitterness and lack of ability to cooperate or agree.” Id. Thus, “[t]he trial judge will have to evaluate whether this is a temporary condition, very likely to abate upon resolution of the issues, or whether it is more permanent in nature.” Id. “Blind hope that a joint custody agreement will succeed, or that forcing the responsibility of joint decision-making upon the warring parents will bring peace, is not acceptable.” Id. Therefore, “[i]n the unusual case where the trial judge concludes that joint legal custody is appropriate notwithstanding the absence of a ‘track record’ of willingness and ability on the part of the parents to cooperate in making decisions dealing with the child’s welfare, the trial judge must articulate fully the reasons that support that conclusion.” Id. The instant record contains evidence of the parties’ ability to cooperate in matters relating to Grant. First, there was the existence of an agreement for joint custody pursuant to a consent order prior to trial. See Barton, 137 Md.App. at 26, 767 A.2d 874. Sarah argues before us, as she did before the trial court, however, that she “entered into the [i]nterim [c]onsent [ajgreement in the belief that the joint custody schedule would be temporary.” She further asserts that she only acquiesced “to this short-term solution on the courthouse steps in fear that she might lose custody entirely in light of the entry of the fraudulently obtained [i]nterim [protective [o]rder” Jeffrey had obtained against her. Notwithstanding these assertions, she offered other testimony at trial suggesting that both she and Jeffrey “should participate fully in *308Grant’s life and his development and also [in] the decisions affecting his life and development and well-being.” She additionally noted a willingness to adapt to circumstances when both she and her husband are working. Moreover, Jeffrey’s testimony at trial additionally recognizes the parties’ ability to work in tandem to address Grant’s needs. This evidence indicates that the parties have been able to communicate and reach decisions regarding Grant in the past. Admittedly, tensions and disagreements between the parties have escalated. Nonetheless, after hearing all the testimony and after judging the credibility and demeanor of the witnesses, the trial court concluded that the parties could resolve their differences and act together in Grant’s best interest. As the trial court observed, “when it was concerning [ ] Grant, ... you all gave your best. And that you all were, for the most part on your best behavior, when you all were doing the exchanges.” Further, even assuming arguendo that the record reflects the parties’ inability to communicate or cooperate regarding Grant’s best interest, the court “articulated fully the reasons that supported the] conclusion” that joint physical and legal custody was appropriate through an extensive and thoughtful consideration of all suggested factors. The court specifically noted the parties’ flexibility in their employment schedules and their sincerity in providing for Grant’s best interest. In sum, the court believed, “that Grant deserves the best of both [Sarah and Jeffrey].” The court believed “that in the last 13 months, or how — I saw 13 months, how many months are we talking about a year?.... That he has gotten the best of both of you. Nobody has testified to me about anything that’s been less.” The court additionally explained its reasoning in providing Sarah tie-breaking authority and observed that this authority was not to be used cavalierly: “But the parent coordinator will be used for that particular reason, for communication between the parents. So there must be some bona fide effort. And then [Sarah] will have the tie[-]breaking authority.” *309As a consequence, we find no error or abuse of discretion in the circuit court’s grant of joint legal and physical custody. The circuit court’s decision was not “well removed from any center mark imagined by the reviewing court and beyond the fringe of what the court deems minimally acceptable.” In re Yve S., 373 Md. at 583-84, 819 A.2d 1030. Therefore, we affirm the circuit court’s order of joint legal and physical custody. (B) The Calculation of Child Support. Following the circuit court’s custodial determination, the court proceeded to address the issue of child support. Specifically, the court stated: .... So[,] that being said, the child support which I will follow right up with this. And my figures came out different from everybody’s figures. And this is where people are going to stop smiling at me, and stop shaking their head in agreement, and I know that so I won’t look at you. Both sides agree that [Sarah’s] salary per month is $5,695. Where you all differed was as to what [Jeffrey’s] salary is. And I think that had [Jeffrey] been forthcoming about a number of things, we wouldn’t have that question. I don’t know whether that military salary is more or less than what that one document says that it is. I can’t imagine, sir, that since January the l[st], 2001 and September the 30[th], 2011 that you could not have gotten one document to show this [c]ourt what it is that you were making this year. So as I said when you hide from me, it makes me wonder what you’re hiding from me. And so where I won’t punish you when it comes to Grant. And punish is a harsh word, I don’t even really mean it in that term, but I guess what I mean is when I look at what I have to consider across the [b]oard, there is some way in which that has to be a sanction that I have to look at it, in a light that makes it more beneficial or equitable if you will for both parties. *310So I am taking the salary that was on your W-2 form of $23,052.1 know that that [sic] includes the investment incentive, I know that. I know it and I’m doing that on purpose, because I believe that a lot of this — hold that, take it back. $23,052 is what the [c]ourt came up with and believes that [is] what [Jeffrey’s] salary is. The problem is when I look at it on a shared basis, I did not include any allowance for a childcare [provider]. And I’ll tell you why, this [is] 50/50[. W]hen the child’s in your care[,] you pay for childcare. When the child is in your care and you need childcare, you pay for it. That’s how this [c]ourt looks at it. The $140 will certainly be put in dad’s column when it comes to the medical insurance. But that was the only thing that I put in the column. And I don’t believe that either of the attorneys, short of the child care included anything else in their columns, other than the salaries. This is what the guidelines tell me. That the child support based on the shared custody, comes out to be $2,492 a month. That’s what it comes out to be. And I don’t know, it didn’t make sense to me, because I looked at [Sarah’s] proposal, that was based on the shared [custody]. It was — I mean based on sole custody, physical custody to [Sarah], I would’ve expected the numbers to have been higher, than what they were for shared. I put the numbers in, that’s what they came out to be. And if anybody wants to say there’s anything I’m doing wrong with it, I’m happy to hear it. But I can only plug the numbers in and it comes out to what it is. (emphasis added). Upon the court’s invitation, the parties’ counsel both indicated that the schedule on which the court had relied did not have equal amounts of overnights between Sarah and Jeffrey. After correcting the number, the circuit court concluded: Okay, that you all. $1,651 is the monthly child support. Let me go to my calculator. The date of filing that this *311[c]ourt had, and I’m doing it as to the date that [Sarah] filed. Now this is the date that I’m using, September 21, 2010. Is that correct? Okay. So actually, we’re taking about one year? And I’m dealing with the arrearages at this point. When I multiply 12, which is one year, it’s $19,812. And that is before I subtract the credit that he is due. I had the credit at $4,806? So I have the arrearages at $15,006. Now, [Jeffrey], I’ll tell you one of the things that did disturb this [c]ourt in hearing it, even though you were not under an order to pay child support. It would’ve gone such a long way, had you taken that responsibility a lot earlier. And certainly the $500 and some odd dollars that was given, it was $534 that was given to [Sarah] during the time that — pending trial, between January and today’s date, was offset by the fact that she had to pay the — and agreed to pay for the Touareg. So really she came out with $5 a month. In essence, I’m giving you credit for what you paid, but in a essence, that’s kind of what she ended up with, it was like $5 once she paid the car note. It was $5 that she had. So you weren’t under the order, but this is the child that you tell me that you — this is your man. This is your little man. And so I took that into consideration when I used the figure that I used. I think the figures are legitimate. I know there was a question about the investment that was included in there. I believe that certainly your potential for this year getting the bonuses that you have gotten in the past. I certainly can’t imagine that those won’t happen again. And when you look at the information that I was given, this is the figure that the [c]ourt believes is the actual figure of your salary, at least as much as I could put together *312about your salary, since there’s a piece of it that I don’t know. (emphasis added). Following the court’s oral opinion and order, Jeffrey petitioned the court for rehearing to alter or amend its judgment. Specifically, Jeffrey argued that the circuit court “erred in the determination of [his] income ... which resulted in an error in the calculation of [his] child support obligation and ... arrears.” In response, Sarah moved for an increase in child support and requested the circuit court to modify Jeffrey’s income to include his previously unreported rental income. The trial court held a hearing on February 21, 2012. After considering the parties’ arguments, the court denied Jeffrey’s request to amend the judgment of child support and issued a memorandum opinion and order on March 30, 2012, providing: [Jeffrey] requests that this court amend its judgment to reflect that [his] actual monthly income is $18,295 and not $23,052. [Jeffrey] alleges that in calculating [his] child support and arrearage payments, the court included unrealized income in [his] monthly salary. [He] argues that the income received from the Allegis Group on Plaintiffs W[-]2 was unrealized income. For further guidance, [Jeffrey] suggests] that the Allegis Plan illustrates that [he] did not realize this income. [He] states that his correct monthly income is $18,295. Accordingly, per [Jeffrey], the monthly child support should be amended to $977 and the arrears should be amended to $6,918. In reviewing the Allegis Group Plan[,] it is clear to this court that the Allegis Group is a complicated investment vehicle. During trial, [Jeffrey] failed to provide the testimony necessary to support his claim that the $23,052 monthly salary is partially unrealized income based on how the Allegis Group investment vehicle is designed. The time to offer this testimony would have been at trial. [Jeffrey] likened the Allegis Plan to the S Corporation at issue in Walker v. Grow, 170 Md.App. 255 [907 A.2d 255] (2006). The facts in Walker v. Grow indicated that the Appellee did not technically receive all the income reported on his tax *313returns. In that case, as in this case before this court, the court had before it someone with a “somewhat complex business and personal financial picture.” Unlike the present case, expert testimony was offered to the trial court in Walker v [.] Gro[w ] to assist the trier of fact to understand the evidence and to determine a fact in issue. An expert or a witness familiar with the design of the Allegis Plan would have been helpful to this court in determining if [Jeffrey] actually received income from Allegis. This testimony was not presented. .... Considering the fact that Allegis is not an S Corporation, no expert testimony was presented during trial and that this court questions the credibility of [Jeffrey] as it concerns his income, this court is not persuaded to rely on [Jeffrey’s] assertion alone. The court did not find [Jeffrey] to be a credible witness during the trial on the merits, especially as to his testimony concerning his income. The court finds that [he] has not been credible and forthcoming about his income in that [he] refuse[s] to respond to [Sarah’s] request for documents detailing his income from all sources in discovery. [Jeffrey] failed to respond to the court’s order compelling discovery and during depositions^ He] failed to refused to produce documents as to all his income. Trial testimony revealed that [Sarah] willfully (and wrongfully) cashed the 2009 joint income tax return and retained the funds. Additionally [Jeffrey] points to his 2010 tax return to show his actual income. However, during the hearing on the motion it was brought to this court’s attention that [he] failed to include on his income tax statement the rental income from his real property. Again, this is a credibility issue on the part of [Jeffrey]. For all of the above reasons, this court cannot rely on [his] testimony concerning his salary. Therefore, the court denies [Jeffrey’s] request to alter and amend the order by reducing the income to $18,295. This court also *314denies the request to adjust the arrears to the amount of $6,918. (footnotes omitted) (emphasis in added). In addition, the circuit court granted Sarah’s request to revise the guidelines to reflect an income from Jeffrey’s rental property in the amount of $1,800 per month in rent. As a consequence, Jeffrey’s monthly child support obligation was increased from $1,651 per month to $1,653 per month. Before this Court, Jeffrey asserts that the circuit court erred when it calculated the child support owed to Grant. Specifically, Jeffrey contends that “[t]he trial court’s inclusion of [his] [incentive [investment [p]lan and gross rental income ... to calculate child support was clearly erroneous and an abuse of discretion.” Sarah counters Jeffrey’s argument by asserting that circuit court properly exercised its discretion in calculating Jeffrey’s child support obligations because Jeffrey “was given ample opportunity to present evidence^] including expert testimony to explain the overly complicated Allegis Group, Inc.[,] compensation plan.” She further argues that “[r]egardless, the parties’ income is above the child support guidelines established by statute and the [court] did not err in including [Jeffrey’s] [incentive [investment [p]lan earnings in the calculation of child support as the court clearly questioned [Jeffrey’s] veracity when presenting his financial picture at trial.” Preliminarily, we note that “[t]he parents of a child are his [or her] natural guardians and, quite apart from the moral obligations of parenthood, owe the child a legal, statutory obligation of support.” Walker v. Grow, 170 Md.App. 255, 265, 907 A.2d 255 (2006) (quoting Lacy v. Arvin, 140 Md.App. 412, 422, 780 A.2d 1180 (2001)). Therefore, in addressing these contentions, it is useful to put them in context by reviewing the purpose of the child support guidelines — notwithstanding our observation that this is an “above guidelines” case. See, e.g., Jackson v. Proctor, 145 Md.App. 76, 89, 801 A.2d 1080 (2002). *315To comply with federal law, the General Assembly enacted Maryland’s Child Support Guidelines (“the guidelines”) in 1989, contained in Md.Code (1989, Repl.Vol.2012), § 12-201 et seq. of the Family Law Article. Jackson, 145 Md.App. at 89, 801 A.2d 1080 (citations omitted). The purpose of the guidelines is: “(1) to remedy a shortfall in the level of awards that do not reflect the actual costs of raising children[;] (2) to improve the consistency, and therefore, the equity of child support awards!;] (3) to improve the efficiency of court processes for adjudicating child support.” Voishan v. Palma, 327 Md. 318, 322, 609 A.2d 319 (1992) (internal quotes omitted). See also Bagley v. Bagley, 98 Md.App. 18, 36, 632 A.2d 229 (1993). As a consequence, the General Assembly chose to create guidelines based on the Income Shares Model to fulfill these goals. This model rests upon the principle that a child should receive the same proportion of parental income, and thereby enjoy the same standard of living, he or she would have experienced had the child’s parents remained together. Accordingly, the model establishes child support obligations based on estimates of the percentage of income that the parents in an intact household typically spend on their children. Voishan, 327 Md. at 322-23, 609 A.2d 319 (internal citations omitted). If the combined adjusted actual income of the parents is $15,000 per month or less, the court must calculate the proper amount of child support using the statutory child support guidelines. See Md.Code (1991, 2012 Repl.Vol.), §§ 12-202(a)(1) and 12-204(d) of the Family Law Article. Cf. Walker, 170 Md.App. at 265, 907 A.2d 255 (discussing the statutory obligation prior to the 2010 amendments, increasing the guidelines from a statutory consideration of $10,000 to $15,000); Johnson v. Johnson, 152 Md.App. 609, 614, 833 A.2d 46 (2003). In the event the combined adjusted actual income is over $15,000, “the court may use its discretion in setting the amount of child support.” Md.Code (1991, 2012 Repl.Vol.), *316§ 12-204(d) of the Family Law Article. Maryland’s appellate courts recognize “[s]everal factors [that] are relevant in setting child support in an above [guidelines case. They include the parties’ financial circumstances, the ‘reasonable expenses of the child,’ and the parties’ ‘station in life, their age and physical condition, and expenses in educating the child[ ].’ ” Smith v. Freeman, 149 Md.App. 1, 20, 814 A.2d 65 (2002) (quoting Voishan, 327 Md. at 329, 609 A.2d 319). “Nevertheless, in above [guidelines cases, calling for the exercise of discretion, the rational of the [guidelines still applies.” Malin v. Mininberg, 153 Md.App. 358, 410-11, 837 A.2d 178 (2003). In the case at bar, the circuit court calculated the amount of child support by extending the scheduled support to a combined monthly income of $30,547. Ordinarily, child support orders are within the sound discretion of the trial court. Walker, 170 Md.App. at 266, 907 A.2d 255 (citing Shenk v. Shenk, 159 Md.App. 548, 554, 860 A.2d 408 (2004)). Nonetheless, “where the order involves an interpretation and application of Maryland statutory and case law, our Court must determine whether the lower court’s conclusions are ‘legally correct’ under a de novo standard of review.” Id. (quoting Child Support Enforcement Admin, v. Shehan, 148 Md.App. 550, 556, 813 A.2d 334 (2002)). “When the [circuit court] exercises discretion with respect to child support in an above [guidelines case, [the court] ‘must balance the best interests and needs of the child with the parents’ financial ability to meet those needs.’ ” Freeman, 149 Md.App. at 20, 814 A.2d 65 (quoting Unkle v. Unkle, 305 Md. 587, 597, 505 A.2d 849 (1986), quoted in Walker, 170 Md.App. at 267, 907 A.2d 255. To be sure, “ ‘the central factual issue is the “actual adjusted income” of each party[.]’ ” Johnson, 152 Md.App. at 615, 833 A.2d 46 (citation omitted)). Therefore, “even in a case in which the statutory schedule of basic child support obligations does not apply, the trial court must ascertain each parent’s ‘actual income.’ ” Walker, 170 Md.App. at 267, 907 A.2d 255. See also Johnson, 152 Md.App. at 615-22, 833 A.2d 46 (using the statutory *317definition of “actual income” to determine that a “bonus” received by the obligor should be included in the calculation, which caused the combined income to exceed the statutorily enumerated maximum). “ ‘Actual income’ means income from any source.” Md.Code (1991, 2012 Repl.Vol.), § 12-201(b)(1) of the Family Law Article. See Walker, 170 Md.App. at 267, 907 A.2d 255. “For income from self-employment, rent, royalties, proprietorship of a business, or joint ownership of a partnership or closely held corporation, ‘actual income’ means gross receipts minus ordinary and necessary expenses required to produce income.” Md.Code (1991, 2012 Repl.Vol.), § 12-201(b)(2) of the Family Law Article (emphasis added). Further, Md.Code (1991, 2012 Repl.Vol.), § 12-201(b)(3) of the Family Law Article explicitly provides that a party’s actual income includes: “(i) salaries; (ii) wages; (iii) commissions; (iv) bonuses; (v) dividend income; (vi) pension income; (vii) interest income; (viii) trust income; (ix) annuity income; (x) Social Security benefits; (xi) workers’ compensation benefits; (xii) unemployment insurance benefits; (xiii) disability insurance benefits; (xiv) ... any third party payment paid to or for a minor child as a result of the obligor’s disability, retirement, or other compensable claim; (xv) alimony or maintenance received; and (xvi) expense reimbursements or in-kind payments received by a parent in the course of employment, self-employment, or operation of a business to the extent the reimbursements or payments reduce the parent’s personal living expenses.” Id. In addition, based on “the circumstances of the case,” “the court may consider the following items as actual income: (i) severance pay; (ii) capital gains; (iii) gifts; or (iv) prizes.” Md.Code (1991, 2012 ReplVol.), § 12-201(b)(4) of the Family Law Article (emphasis added). “Actual income,” however, shall never include “benefits received from means-tested public assistance programs, including temporary cash assistance, Supplemental Security Income, food stamps, and transitional emergency medical and housing assistance.” Md.Code (1991, 2012 Repl.Vol.), § 12-201(b)(5) of the Family Law Article. *318The definition of actual income in Section 12-201(b) contains numerous enumerated factors that constitute income. None of the enumerated factors, however, include unrealized gains or appreciation in asset value. See Barton, 137 Md.App. at 20, 767 A.2d 874. Compare Md.Code (1991, 2012 Rep.Vol.), § 12-201(b) of the Family Law Article with Md.Code (1984, Repl.Vol.2012), § 11 — 106(b)(11)(i) of the Family Law Article (“directing that for the determination of alimony”, the court shall consider “ ‘all income and assets, including property that does not produce income’ ”) (emphasis added). In making an actual income determination, “[t]he court must verify the parents’ income statements ‘with documentation of both current and past actual income.’ ” Walker, 170 Md.App. at 269, 907 A.2d 255 (quoting Md.Code (1991, 2012 Repl.Vol.), § 12-203(b)(l) of the Family Law Article) (emphasis added). Therefore, this prompts two questions: (1) “What is required to verify the parent’s actual income;” and (2) “what constitutes suitable documentation to verify the income alleged by the parent?” Section 12-203(b)(2)(i) of the Family Law Article provides an answer: [SJuitable documentation of actual income includes pay stubs, employer statements otherwise admissible under the rules of evidence, or receipts and expenses if self-employed, and copies of each parent’s 3 most recent tax returns. Md.Code (1991, 2012 Repl.Vol.), § 12-203(b)(2)(i) of the Family Law Article. In the instant case, Jeffrey provided his 2010 Federal Income Tax Return, noting that his adjusted gross income was $219,542. This amount included his income from both Allegis Group and the United States Army Reserves. At trial, he further submitted into evidence his current Allegis Group pay stub (noted as “Joint Exhibit No. 7”), acknowledging that — as of September 10, 2011 — Jeffrey had earned $131,446.19 from his employ at Allegis Group. Jeffrey additionally provided his pay stub for the Army Reserves (noted as “Joint Exhibit No. 8”), and he testified about his earnings with the Army. Of particular importance, however, was Jeffrey’s submission of *319the Allegis Group Incentive Investment Plan (“the Plan”), designated as “Joint Exhibit No. 13.” Section 7, entitled, “ALLOCATION OF UNITS TO THE ACCOUNT,” provides as follows: The Companies [Allegis Group and its subsidiaries] shall initially allocate to the Account of each Participant [of the Allegis Group Incentive Investment Plan] who is eligible to be allocated Units, the number of Units such Participant is eligible to receive and earn. At any given time, each Unit allocated to the Participant’s Account shall be deemed to be economically equivalent to the sum of (i) the Fair Market Value of one share of Allegis Group’s common stock, plus (ii) the excess, if any, of (a) the aggregate Cash dividends made by Allegis Group with respect to one issued and outstanding share of common stock of Allegis Group, over (b) the aggregate cash distributions made by the Companies with respect to one Unit.[9] All determinations of Fair Market Value, the amounts allocated to the Account of each Participant, and the value of such Participant’s Account shall be made by the Board, whose determinations shall be binding upon the Companies and all Participants. The establishment and maintenance of any Accounts do not create in any Participant any rights in, or entitle any Participant to any payments with respect to, any Units until payments with respect to such Units are earned in accordance with Section 9 of the Plan. The Companies shall not be required to set aside any funds to make the payments required herein or to purchase, *320hold or dispose of any common stock of the Companies or any investment with respect to amounts allocated in the Accounts; each Company’s only obligation being to make payments as described in Section 9. Any funds set aside by the Companies to make the payments required herein or any earnings thereon shall be solely for the purpose of aiding the Companies in measuring and meeting their respective obligations under this Plan and no escrow, trust or trust fund is intended. (emphasis added). In addition, Section 9 of the Allegis Group Incentive Investment Plan, entitled “EARNING OF UNITS; RIGHT TO RECEIVE PAYMENT FOR ACCOUNT,” in pertinent part, provides: In order to earn and become entitled to receive payment for the Units allocated to a Participant pursuant to the Plan, the Participant shall not, during the thirty (30) month period following the date of his or her Separation from Service, either directly on his or her own behalf, or indirectly through any entity in, or on behalf of or with respect to which, the Participant is an officer, director, trustee, shareholder, creditor, employee, partner, or consultant. (1) Engage in the business of recruiting, employing and providing the services of scientific, telecommunications, engineering, automotive, technical, information, technology, information systems, industrial, office support, financial support, accounting, legal, energy, aviation, environmental and/or other personnel on a temporary or permanent basis, providing information systems, information technology and telecommunications services, or any other lines of business that the Companies engage in, enter or prepare to enter during the Participant’s employment with the Companies (collectively, the “Companies Business”), in which the Participant performed work or obtained knowledge and information during the two (2) year period preceding his or her Separation from Service, within a radius of two hun*321dred fifty (250) miles of the office in which the Participant last worked or any other office in which the Participant worked during the two (2) years preceding his or her Separation from Service, or as much thereof as a Court of competent jurisdiction deems reasonable; (2) Approach, contact, solicit or induce any individual, corporation or other entity which is a client or customer of any of the Companies, about which Participant obtained knowledge by reason of Participant’s employment by the Companies, in an attempt to: (a) enter into any business relationship with a client or customer of any of the Companies if the business relationship is competitive with any aspect of Companies’ Business in which Participant worked during the two (2) year period preceding his or her Separation from Service, or (b) reduce or eliminate the business such client or customer conducts with the Companies; If the Participant complies with the terms and conditions of this Section 9 and earns and becomes entitled to receive payment for the Units that he or she is eligible to earn, the Company that employed the Participant at the time of his or her Separation form Service shall have the obligation to pay such Participant the value of such Participant’s Account as determined at the time of the Participant’s Separation from Service and in accordance with the terms of the Plan. If the Separation from Service is due to death or Disability ..., payment shall be by check within 30 days after the date of Separation from Service. If Separation from Service is due to any reason other than death or a Disability ..., the amount credited to the Participant’s Account, together with simple interest on the outstanding principal balance at the rate of (i) 9% per annum with respect to any Units awarded prior to or on December 31, 2004, and (ii) 6% per annum with respect to any Units awarded after December 31, 2004, will be paid to the Participant as follows: (a) five percent (5%) of the *322amount credited to the Participant’s Account shall be paid to the Participant at the end of each of the ten consecutive calendar quarters immediately following his or her Separation from Service and the receipt by the Company of his or her Unit certificates (if any were issued); and (b) fifty percent (50%) of the amount credited to the Participant’s Account, plus all accrued and unpaid interest, shall be paid to the Participant at the end of the thirty month period following his or her Separation from Service. The terms and conditions set forth in this Section 9 are material and essential terms of any award of Units.... (emphasis added). Additionally included as part of Joint Exhibit No. 13 was the executed Allegis Group Incentive Investment Plan 2007 Award Agreement for Jeff[rey] Reichert (“Agreement I”). The agreement awarding Jeffrey a total of 7500 Incentive Investment Units, which Jeffrey accepted, was, by reference, subject to the terms and restrictions of the Allegis Group Incentive Investment Plan. Specifically, Agreement I, in pertinent part, provides: The award is subject in all respect to the applicable provisions of the Plan, a complete copy of which has been furnished to you and receipt of which you acknowledge by acceptance of the award. Such provisions are incorporated herein by reference and made a part hereof. In addition to the terms, conditions and restrictions set forth in the Plan, all terms, conditions and restrictions set forth in this Agreement, including the following, are applicable to the award of Units as evidenced hereby: 3. Payment. Subject to the terms and conditions set forth in this Agreement and in the Plan, you shall be entitled to receive payment for vested Units upon your Separation from Service (as defined in the Plan) with the Company. You shall have no right to payment for Units that have not vested as of the date of your Separation from Service with the Company. *323In addition, you specifically acknowledge and agree that the terms and conditions set forth in Section 9 of the Plan are material and essential to your award of Units and your eligibility to receive payment for any vested Units.... 7. Conformity with Plan. This Agreement is intended to conform in all respects with, and is subject to all applicable provisions of, the Plan, which is incorporated herein by reference. Inconsistencies between the Agreement and the Plan shall be resolved in accordance with the terms of the Plan. (emphasis added). Further attached to Joint Exhibit No. 13 was an executed “ALLEGIS GROUP INCENTIVE INVESTMENT PLAN 2010 AWARD AGREEMENT FOR Reichert, Jeffrey,” (“Agreement II”), which advised Jeffrey as to the potential tax consequences pursuant to the Allegis Incentive Investment Plan. The tax consequences, found in paragraph 3 of the agreement, provide that Units are not consideration for services rendered and are not to be considered or deemed wages. Under the Internal Revenue Code, as now in effect, you will not recognize income at the time you accept the award of Units under the Plan. Instead, you will recognize ordinary income, subject to federal and state income tax -withholding, at the time you receive, or have the right to receive, payment for Units.... Although the Company anticipates that the federal income tax consequences of the Plan are as described, the Internal Revenue Service is not bound by such description and the Company does not guarantee the federal income tax treatment of your award of Units, or your acceptance or redemption of or payment for the Units. Accordingly, you should discuss with your own tax advisor the anticipated tax consequences of the Units and the Plan, (emphasis added). We conclude that Jeffrey’s submission into evidence of his 2010 Federal Income Tax Return, his Allegis Group pay stub, *324his Army Reserves pay stub, the Plan, and Agreements I and II are well within the parameters of Md.Code (1991, 2012 Repl.Vol.), § 12-203(b)(i), provided, supra. Therefore, these documents were, in fact, suitable and must be included in the court’s verification of the parents’ adjusted actual income. See Md.Code (1984, 2012 Repl. Vol), § 12-203(b)(l) of the Family Law Article (noting that “[i]ncome statements of the parents shall be verified with documentation of both current and past actual income.”) (emphasis added). Nonetheless, Sarah relies on the circuit court finding that “[d]uring trial, [Jeffrey] failed to provide the testimony necessary to support his claim that the $23,052 monthly salary is partially unrealized income based on how the Allegis Group investment vehicle is designed.” In addition, the circuit court dismissed Jeffrey’s contention that his unrealized income was similar to the “pass-through” corporate income reported on a shareholder’s tax return discussed within this Court’s opinion in Walker v. Grow, 170 Md.App. 255, 269-76, 907 A.2d 255 (2006), stating that [u]nlike the present case, expert testimony was offered to the trial court in Walker v [.] Gro[w ] to assist the trier of fact to understand the evidence and to determining a fact in issue. An expert or a witness familiar with the design of the Allegis Plan would have been helpful to this court in determine if [Jeffrey] actually received income from Allegis. This testimony was not presented. .... Considering the fact that Allegis is not an S Corporation, no expert testimony was presented during trial and that this court questions the credibility of [Jeffrey] as it concerns his income, this court is not persuaded to rely on [Jeffrey’s] assertion alone. But Sarah’s reliance on the circuit court’s interpretation of this Court’s opinion in Walker v. Grow is misconceived. We explain. In Walker v. Grow, the parents of two minor children, Elinor Walker (“mother”) and Ronald Grow (“father”), had *325engaged in several support disputes over the years. 170 Md.App. at 263, 264, 907 A.2d 255. There, the mother moved for modification of child support, alleging that the children’s expenses had increased, and, additionally, that the father’s income had increased. Id. at 264, 907 A.2d 255. The basis of the mother’s assertion was premised on the fact that the father was chief operating officer to a S Corporation (“Aliron”) and a shareholder in said corporation, which, in turn, resulted in the father’s tax return showing an adjusted gross income of $272,835. Id. As a consequence, the mother requested that the circuit court “recalculate child support on the basis of an ‘above [guidelines’ analysis of the joint income of the parties, the minor children’s expenses and other related factors.” Id. In his monthly statement to the court at trial, however, the father listed in his financial statement monthly wages at $12,499.06, which amounted to an actual income of $149,988.72 per year. Id. at 264, 269, 907 A.2d 255. This financial statement, however, was a stark contrast to the father’s federal income tax return for 2003, listing a taxable income of $277,175, and the federal income tax returns of 2001 and 2002, showing taxable incomes of $174,751 and $249,148 respectively. Id. at 269, 907 A.2d 255. Therefore, the father offered into evidence testimony of Aliron’s accountant, who noted that “because Aliron is a Subchapter S corporation, [the father’s] federal income tax returns do not reflect his actual income. Rather, ‘[the] income of the business is flowed through the shareholders and reported on the shareholder’s personal tax returns, and the taxes associated with that income [are] paid by the shareholders.’ ” Id. Aliron’s account further explained that the father did not “ ‘technically receive the income that was reported’ on his tax returns[.]” Walker, 170 Md.App. at 269, 907 A.2d 255. Thereafter, the father entered into evidence a 1040 tax return on which Aliron’s accountant had calculated his income without the pass-through income that was retained by Aliron, which would be used to pay the company’s taxes or distributed for business purposes. Id. at 270, 907 A.2d 255. Aliron’s accountant explained how she came *326to that calculated income and then proceeded to demonstrate the calculation from the stand. Id. After considering all the evidence presented, the court ultimately found that the father’s income was even less than the amount testified by Aliron’s accountant. Id. 273, 907 A.2d 255. Consequently, the circuit court based its child support award on a determination that the passthrough corporation’s income should be excluded and that the father’s actual income was $12,442 per month, which would amount to $149,304 per year. Id. The mother objected to the court’s exclusion of the pass-through corporate income in the modified calculation of child support. Id. Before this Court, the mother asserted that the circuit court erred in accepting the testimony of Aliron’s accountant in making its determination of the father’s adjusted actual income. Id. Rejecting the mother’s argument, we concluded that the trial court may admit expert testimony to assist in determining a parent’s income when appropriate so long as “the court determines that the testimony will assist the trier of fact to understand the evidence or to determine a fact in issue.” Id. at 274, 907 A.2d 255 (quoting Md. Rule 5-70210), 276-77, 907 A.2d 255. We therefore observed that “[bjecause the evidence included [the father’s] financial statement and his tax returns, it was certainly appropriate for the court to consider [the accountant’s supplemental] testimony on the issue in verifying [the father’s actual] income[ ]” as required by Md.Code (1991, 2012 Repl.Vol.), § 12-203(b)(1) of the Family Law Article. Walker, 170 Md.App. at 276-77, 907 A.2d 255. *327Nothing in onr opinion, however, requires a parent seeking to exclude pass-through or unrealized income from actual income in the calculation of the court’s child support award to offer expert testimony supporting that parent’s documentation used to verify his or her actual income. This is particularly true when that parent offers a variety of “suitable documentation of actual income” into evidence. See Md.Code (1991, 2012 Repl.Vol.), § 12-203(b)(2)(i) of the Family Law Article. Should a parent seeking to exclude the passthrough or unrealized income desire to present expert testimony, he or she may. A parent’s choice to present expert testimony is beneficial to the trial court, but it is a gratuitous addition when suitable documentation of that parent’s actual income is offered into evidence.11 Accordingly, we conclude that the circuit court abused its discretion in its inclusion of Jeffrey’s Allegis Incentive Investment Plan.12 Upon remand, the circuit court should analyze its child support determination pursuant to Md.Code (1991, 2012 Repl. Vol.), §§ 12-201 and 12-204(d) of the Family Law Article. In addition, because Jeffrey and Sarah share physical custody of the child, the circuit court must also adhere to Md.Code (1991, 2012 RepLVol.), § 12-204(m) of the Family Law Article.13 *328(C) The Alternating Tax Exemption. Following a discussion of the court’s grant of joint legal custody, the court addressed the parties’ right to the tax exemption for the parties’ minor child. The court found that because the parties shared custody of their son, they should share the right to claim the tax exemption of his dependency in the following colloquy: THE COURT:.... Taxes, let me ask a question. I saw on the taxes from one of the years, well Grant’s only been around for one probably, tax year. Where both persons had, both persons claimed him. Did they claim him for the full year, or half? Does anybody know? *329[Sarah’s counsel]: Well[,] I believe both claimed him as a dependent, as head of household with a dependent. THE COURT: Okay. I believe if I’m not mistaken, for taxes that each of them claim him for six months a piece on taxes. They cannot. Okay, then first year claiming since and — I thought I saw that on that. When I’m filling out taxes 1 to 12 months, they gave you a range. Mr. — for the — the [c]ourt is actually, because I know what I’m going later on concerning finances, the [c]ourt is actually going to, for the first — the taxes for this would [be for the] 2011 year, right? Tax 2011, [Jeffrey] is going to be able to claim Grant, 2011 and every odd year thereafter. 2012 tax year, [Sarah] will be able to claim him, and every even year thereafter. Okay, let me go — are we — we’re clear about the custody issues? So I can move onto the next thing. Within Jeffrey’s petition for rehearing to alter or amend its judgment of October 11, 2010, Jeffrey additionally argued that the circuit court had abused its discretion in alternating the tax dependency exemption. Specifically, he argued that “[according to IRC § 152(c)(4)(A)(ii), when a child resides equally with both parents, as in the instant case, the parent with the highest adjusted gross income is entitled to the dependency exemption.” After the parties’ hearing of February 21, 2012, the court denied Jeffrey’s request to be named the sole beneficiary of the tax exemption within its memorandum and opinion of March 30, 2012, stating: The court did not err when it ordered that the tax dependency exemption alternate between [Jeffrey] and [Sarah], [Jeffrey] argues that this court abused its discretion in alternating the tax dependency and requests the sole right to claim minor child as a dependent for state and federal tax returns. IRC Section 152(c)(4)(B)(i) states that the tax exemption for a child shall be claimed by the “parent with whom the child resided for the longest period of time during the *330taxable year.” Prior to 1984, a non-custodial parent could claim a tax dependency exemption if the non-custodial parent paid more than $1,200 toward the support of the child in the calendar year. The law now provides that the custodial parent is always entitled to the exemption unless he or she executes a signed waiver disclaiming the child as an exemption for a given year. The law changed in order to resolve the dispute between the divorce [sic] parents and to reduce the number of divorced parents both claiming the dependency exemption in the same calendar year. The committee wished “to provide more certainty by allowing the custodial spouse” to claim the exemption. Congress was silent on whether a state court can require a custodial parent to execute a waiver of the tax exemption to the non-custodial parent. The Maryland Court of Special Appeals in Wassif v. Wassif [77 Md.App. 750, 551 A.2d 935 (1988) ] ruled that a court order alone is insufficient to effectuate the transfer of the tax exemption. A non-custodial parent may claim the tax exemption only if the custodial parent executes a signed waiver of the exemption. Although a Maryland court has not ruled on whether alternating the tax exemption is within the court’s discretion, other states have made such a determination. A Mississippi state court ruled that the parties may alternate the tax exemption because the court found that both parties would benefit from the dependency exemption. In this case, the Mississippi court determined that the court did not abuse its discretion by alternating the tax exemption because both parties in the case are employed, have similar monthly incomes and would benefit from use of the dependency exemption. An Illinois appellate court also determined that alternating the tax dependency is within the court’s discretion. The court ruled that Defendant was entitled to the dependency exemption in alternating years because Defendant has substantial visitation with minor child and provides child support and health insurance benefits. *331This court holds that due to the parties’ shared custody of the minor child[,] alternating the tax dependency is within the spirit of IRS Section 152(c)(4)(B)(i) and follows Maryland [L]aw. This court finds this [sic] its decision is also consistent with other jurisdictions in that alternating the dependency exemption is beneficial to both parties. The minor child is in the care and custody of each party on a shared basis and therefore, both are entitled to claim the child on their taxes but in alternating years. (footnotes omitted). Before this Court, Jeffrey maintains his assertion that the circuit court “abused its discretion when it refused to modify its finding that the parties should alternate the tax dependency for Grant” because “even if child support is modified to reflect [Jeffrey’s] actual income, he pays the majority of the support for Grant.” Thus, he attests that the court failed to conform with Section 152(c)(4)(B)(ii) of the Internal Revenue Code, which provides that in situations where more than one parent is claiming the qualified child,14 “if the parents claiming *332any qualifying child do not file a joint return together” and “if the child resides with both parents for the same amount of time during such taxable year,” then that child will be treated as the qualifying child of “the parent with the highest adjusted gross income.” See 26 U.S.C. 152(c)(4)(B)(ii). Conversely, Sarah, relying on this Court’s opinion in Wassif v. Wassif 77 Md.App. 750, 551 A.2d 935 (1989), argues that the trial court properly exercised its discretion because “[a] court may assign or otherwise allocate the tax exemption for a minor child” as it sees fit. We find Jeffrey’s argument more persuasive and, therefore, vacate the circuit court’s order and remand the issue for further consideration. Title 26, Section 152(e) of the United States Code provides the “[s]pecial rule [regarding the tax dependency exemption] for divorced parents[.]” Id. Prior to January 1, 1985, Sections 152(e)(2)(B)(i) and (ii) (1982) of the Internal Revenue Code provided that unless otherwise specifically agreed to in writing by the parties or addressed in a court decree, the noncustodial parent could claim a dependency tax exemption if he or she paid more than $1,200 toward the support of a child in any calendar year and the custodial parent did “not clearly establish that he provided more for the support of such child during the calendar year than the parent not having custody.” See Wassif v. Wassif 77 Md.App. 750, 759, 551 A.2d 935 (1989) (quoting 26 U.S.C. § 152(e)(2)(B)(i) (1982)). “By virtue of the Deficit Reduction Act of 1984 (Pub.L. No. 98-369, 98 Stat. 494), this law was amended to provide that the custodial parent is now always entitled to the exemption unless he or she executes a signed waiver disclaiming the child as an exemption for a given year.” Id. (citing 26 U.S.C. § 152(e)(2)(A) (Supp.II, 1984)) (emphasis added). Specifically, Section 152(e) of the Internal Revenue Code, in pertinent part, now provides: (e) Special rule for divorced parents, etc. *333(1) In general. Notwithstanding subsection (c)(1)(B),[15] (c)(4),[16] or (d)(1)(C),[17] if— (A) a child receives over one-half of the child’s support during the calendar year from the child’s parents— (i) who are divorced or legally separated under a decree of divorce or separate maintenance, (ii) who are separated under a written separation agreement, or (iii) who live apart at all times during the last 6 months of the calendar year, and— (B) such child is in the custody of 1 or both of the child’s parents for more than one-half of the calendar year, such child shall be treated as being the qualify*334ing child of a qualifying relative of the noncustodial parent for a calendar year if the requirements described in paragraph (2) or (3) are met. (2) Exception where custodial parent releases claim to exemption for the year. For purposes of paragraph (1), the requirements described in this paragraph are met with respect to any calendar year if— (A) the custodial parent signs a written declaration (in such a manner and form as the Secretary may by regulations prescribe) that such custodial parent will not claim such child as a dependent for any taxable year beginning in such calendar year, and (B) the noncustodial parent attaches such written declaration to the noncustodial parent’s return for the taxable year beginning during such calendar year. 26 U.S.C. 152(e)(1) \u0026amp; (2) (2008) (emphasis added).18 This Court first addressed the post-1984 revisions to 26 U.S.C. 152(e) et seq., in Wassif v. Wassif, 77 Md.App. 750, 551 A.2d 935 (1989). There, Patricia Lynn Wassif (the “mother”) petitioned to alter the Circuit Court for Anne Arundel County’s judgment of absolute divorce, which, in part, ordered that Anis M. Wassif (the “father”) would be entitled to claim one of the couple’s three minor children as a dependent on his income tax returns. Id. at 753-54, 551 A.2d 935. On appeal, the mother argued before this Court that the circuit court lacked jurisdiction to order a custodial parent to execute a waiver of his or her presumptive right to the tax dependency exemption provided by Section 152(e) of the In*335ternal Revenue Code. Id. at 759, 551 A.2d 935. Rejecting her argument, we noted that [t]he legislative history of the 1984 amendment indicates that the purpose of the new law was to relieve the IRS of acting as the mediator in disputes between parents over exemptions. Up to that time, the IRS had been involved in numerous factual disputes between divorced parents over which parent provided more support for a child. The new statute was meant to address the desire of the IRS not to get involved in such factual disputes where it had very little, if anything, to gain by the outcome. Id. (relying on H.R.Rep. No. 432, Part II, 98th Cong., 2d Sess., reprinted in the 1984 U.S.Code Cong. \u0026amp; Admim.News 697, 1140).19 See also Vohsen v. Vohsen, 801 S.W.2d 789, 791 (Mo.Ct.App.1991) (noting that “[t]he 1984 amendment wa[s] not designed to provide a benefit to the custodial parent.” Rather, it sought to achieve “ ‘certainty in the allocation of the dependency exemption for federal tax administration purposes.’” (quoting Cross v. Cross, 178 W.Va. 563, 363 S.E.2d 449, 457 (1987))) (emphasis in original). As a consequence, we joined the majority of our sister jurisdictions, holding that state court allocations of the exemptions to a non-custodial parent does not interfere with Con*336gressional intent and concluded “that a custodial parent may be ordered to execute the necessary waiver of dependency exemption in favor of a non-custodial parent who is paying child support.” Wassif, 77 Md.App. at 761, 551 A.2d 935.20 But our opinion in Wassif only addressed the permissibility to allocate the tax dependency exemption generally and declined to further consider the nature of the exemption within the greater scheme of the marital dissolution. Our review was limited to Patricia Wassif s contention that the trial court was without any power to allocate the tax dependency exemption provided by 26 U.S.C. § 152(e). See Wassif, 77 Md.App. at 759, 551 A.2d 935. Thus, we return to an analysis of the Internal Revenue Code’s statutory language. When a reviewing court engages in an analysis of statutory construction, the overarching rule is that, in construing statutes, “our primary goal is always ‘to discern the legislative purpose, the ends to be accomplished, or the evils to be remedied by a particular provision....’” Barbre v. Pope, 402 Md. 157, 172, 935 A.2d 699 (2007) (citations omitted). See Opert v. Criminal Injuries, 403 Md. 587, 593, 943 A.2d 1229 (2008). If the language is clear and unambiguous, we ordinarily “need not look beyond the statute’s provisions and our analysis ends.” Opert, 403 Md. at 593, 943 A.2d 1229. If, upon this preliminary analysis, however, we conclude that “the language is subject to more than one interpretation, it is ambiguous, and we resolve the ambiguity by looking at the statute’s legislative history, case law, and statutory purpose.” Barbre, 402 Md. at 173, 935 A.2d 699. *337Unfortunately, the plain language of the Internal Revenue Code does not explicitly address whether a state court can effectively order that the tax dependency exemption alternate between the child’s parents, or whether this is within the spirit of 26 U.S.C. § 152(e) et seq.21 Likewise, Maryland has never addressed the permissibility of such an order. Therefore, we turn our attention to the reasoning of our sister jurisdictions for guidance and begin where our decision in Wassif left off. In Cross v. Cross, 178 W.Va. 568, 363 S.E.2d 449 (1987), the West Virginia Supreme Court of Appeals reasoned that Congressional silence in the amended code as to whether a state trial court can require a custodial parent to execute a waiver “demonstrates Congress’s surpassing indifference to how the exemption is allocated as long as the IRS doesn’t have to do the allocating.” Id. at 457. As a consequence, the court concluded that Congress did not intend to forbid state courts from allocating the exemption and that a state court has broad equitable power to order a custodial parent to sign the necessary waiver: Indeed, under the new [26 U.S.C. § 152(e) ] a state court does not have the power to allocate the exemption simply by court order alone (as it could have done before the 1984 Amendment), but it does have the equitable power to require the custodial parent to sign the waiver ... [T]here is no prohibition — express or implied — on a state court’s requiring the execution of the waiver, and because the court allocation of dependency exemptions has been custom and usage for decades, it is more reasonable than not to infer that if Congress had intended to forbid state courts from allocating the exemption by requiring the waiver to be signed, Congress would have said so. Id. at 458 (emphasis in original), quoted in Wassif, 77 Md.App. at 760, 551 A.2d 935. See also Hisquierdo v. Hisquierdo, 439 U.S. 572, 581, 99 S.Ct. 802, 59 L.Ed.2d 1 (1979) (noting that in *338family law matters, the Court “has limited review under the Supremacy Clause to a determination whether Congress has ‘positively required by direct enactment’ that the state law be preempted.”). Thus, the court found “nothing in the 1984 amendment to [26 U.S.C. § 152(e) ] that precludes a power in [West Virginia’s] trial courts to award the dependency tax exemption as an integral power of setting child support by ordering the custodial parent to execute the waiver required by the [Internal Revenue Code].” Cross, 363 S.E.2d at 458 (emphasis in original). Notwithstanding these findings, however, the court did not completely dismiss notions that the 1984 amendment to 26 U.S.C. § 152(e) may also serve as “a collateral financial benefit upon the custodial parent.” Cross, 363 S.E.2d at 457. The court went on to note that despite Congressional intent to only remove the Internal Revenue Service from the dependency dispute, See H.R.Rep. No. 432, Part II, 98th Cong., 2d Sess, reprinted in 1984 U.S.Code Cong. \u0026amp; Admin.News 697, 1140, nothing was meant to imply that “the new [26 U.S.C. § 152(e) ] does not provide valuable benefits to custodial parents even though providing those benefits was not its primary purpose.” Id. at 459. The court continued, stating: ----In the 94 percent of all divorces that are concluded by voluntary settlement, the custodial parent is given a new bargaining chip that, depending upon the economic circumstances, may be of significant value. Furthermore, when the dependency exemption is allocated to the non-custodial parent on a year-to-year basis[,] the custodial parent must sign a waiver to allow the noncustodial parent to take the exemption. This simple mechanical requirement provides the custodial parent with an opportunity to collect back support payments every April 15th. In light of the low level of compliance with alimony and child support awards, this scheme hardly seems ill-conceived from points of view other than the [Internal Revenue Service]’s. *339The facts of life are that income tax exemptions are valuable only to persons with income, and up to a certain point, the higher the income the more valuable exemptions become because of the progressivity of the federal income tax. In this regard, it is to be remembered that the federal government is not providing every custodial parent with a cash grant under [26 U.S.C. § 152(e) ]. Rather, [Section 152(e) ] provides an economic benefit that is of significantly greater value to a parent with income than it is to a parent without income. Consequently, it seems only reasonable that the trial judge should allocate the dependency exemption to the parent in the highest tax bracket, and then enhance (or reduce) the value of the cash child support payments to offset the value of the exemption____ This, however, is not to say that the custodial parent loses any of the benefits rightly conferred upon her by the new [Section 152(e) ]. When the circuit court orders that a custodial parent execute the waiver of the dependency exemption in favor of her former spouse, execution of the waiver is dependent upon a non-custodial parent’s having paid his [or her] court-ordered child support. This gives the custodial parent leverage because she [or he] can refuse to execute the waiver in the event of nonpayment, which forces the non-custodial parent to take her [or him] back to court to force the execution of the waiver, at which time she [or he] may raise the back payment issue. Cross, 363 S.E.2d at 459-60 (emphasis added). Thus, the West Virginia Supreme Court of Appeals concluded that a trial court may allocate the tax dependency exemption to the noncustodial parent so long as he or she is within a higher tax bracket and additionally enhance the child support obligation of the non-custodial parent to offset the value of the tax exemption. Id. at 460. Like the West Virginia Supreme Court of Appeals’ opinion in Cross, the Court of Appeals of Missouri reached a similar conclusion regarding the Congressional silence in Vohsen v. *340Vohsen, 801 S.W.2d 789 (Mo.Ct.App.1991) (noting that 26 U.S.C. § 152(e)’s amendments “sought to achieve ‘certainty in the allocation of dependency exemption for federal tax administration purposes.’ ” (quoting Cross, 363 S.E.2d at 457)) (emphasis in Cross, 363 S.E.2d at 457). Specifically, the intermediate appellate court noted that “the 1984 [Ajmendment was made to eliminate the need for the Internal Revenue Service to resolve conflicts when both parents claimed a child as a dependent.” Id. at 791. Therefore, under the court’s holding: [W]hen parents cannot agree on who is to receive the exemption, it will be appropriate for our trial courts to determine this issue. This trial court involvement will have no impact on the [Internal Revenue Service] and does not conflict with the Internal Revenue Code.... ... [T]o effectuate such an allocation, a trial court must order the custodial parent to annually sign the prescribed declaration.... The court’s order should make execution of the declaration contingent upon the custodial parent’s receipt of the court ordered child support payments. A deadline for singing the declaration ... should [further] be established. If the custodial parent does not timely sign the annual declaration, the noncustodial parent may seek appropriate court relief. In such a situation, whether the court ordered support payments have been made will be readily ascertainable, and the trial court will be able to determine if either parent has not complied with its previous orders. If the support payments have not been made, the trial court could allow the custodial parent to retain the exemptions. On the other hand, if the payments have been made, the trial court could enforce its order requiring both parents to sign the declaration. Id. at 792 (emphasis added). In either circumstance, the court concluded that the trial court’s permissive order will neither infringe on the Internal Revenue Code nor involve the Inter*341nal Revenue Service in determining which parent is entitled to the exemptions, satisfying the amendment’s purpose. See id. The court additionally recognized that the financial benefit of the tax dependency exemption served because it could be leveraged by a custodial parent against a non-custodial parent’s obligation to timely tender the court-ordered child support. See id. Although the cases referenced, supra, discuss circumstances in which there is but one primary custodial parent and one non-custodial parent, they impart two underlying principles to the 26 U.S.C. § 152(e)’s amendments: (1) a state court has broad equitable power in determining whether an allocation of the tax dependency exemption is appropriate and; (2) any allocation of the tax dependency exemption pursuant to 26 U.S.C. § 152(e) is an element of the parties’ child support calculus. In re Marriage of Fowler, 197 Ill.App.3d 95, 143 Ill.Dec. 305, 554 N.E.2d 240, 243 (1989); In re Marriage of Lovetinsky, 418 N.W.2d 88, 90 (Iowa Ct.App.1987). See Monterey Cty. v. Cornejo, 53 Cal.3d 1271, 1279, 283 Cal.Rptr. 405, 812 P.2d 586 (1991); Nichols v. Tedder, 547 So.2d 766, 775 (Miss.1989). As a consequence, any aUocation of the tax dependency exemption must be evaluated based on a child’s best interests. Singer v. Dickinson, 588 N.E.2d 806, 811-12 (Ohio 1992); Bobo v. Jewell, 38 Ohio St.3d 330, 528 N.E.2d 180, 182 (1988); Dindal v. Dindal, 2009 Ohio 3528, P. 20, 2009 WL 2159689 (Ohio Ct.App., Hancock Cty., July 20, 2009); Hildenbrand v. Hildenbrand, 1998 WL 8699, *2, 1998 Ohio App. LEXIS 25, *5 (Ohio Ct.App., Butler Cty., Jan. 12, 1998). See Cornejo, 53 Cal.3d at 1280, 283 Cal.Rptr. 405, 812 P.2d 586; Cross, 363 S.E.2d at 460. Cf. Vohsen, 801 S.W.2d at 792. In this regard, we find the Ohio Supreme Court’s opinion in Singer v. Dickinson, 63 Ohio St.3d 408, 588 N.E.2d 806 (1992) (defining the apphcable test to a determination of whether an allocation of the tax dependency exemption was warranted), superceded by statute, Ohio Rev.Code Ann. § 3119.82 (Lexis-Nexis 2013), as recognized in Dindal v. Dindal, 2009 Ohio 3528, P. 20, 2009 WL 2159689 (Ohio Ct.App., Hancock County, July 20, 2009), instructive. *342In Singer v. Dickinson, the Ohio Supreme Court observed that, given the amendments to Section 152(e)’s administrative convenience, 26 U.S.C. § 152(e) “does not limit the state court’s authority to allocate the exemption[,]” because the allocation of the exemption concerns the support of the child. Singer, 588 N.E.2d at 809, 811 (citation omitted). The court’s evaluation of the Section 152(e) resulted in a determination that “[t]he exemption is clearly meant to provide a federal tax allowance for the costs attributable to supporting children.” Id. at 811 (reasoning that such a purpose is apparent from the plain language of the statute, “which recognizes the custodial parent presumption only if the child received over half of his support from his parents”). The court rejected, however, the juvenile court’s stated reasons for the allocation of the tax exemption, premised on an analysis of the percentages of support. Id. at 812. It reasoned that an allocation of the dependency exemption that only “marginally increased the non-custodial parent’s ability to pay child support equates to no more than a zero-sum transaction,” resulting in infinitesimal benefit to the child’s interests. Id. Specifically, it concluded: The juvenile court’s analysis of percentages of support is inadequate when the dependency exemption is at issue. The allocation of the dependency exemption provided by Section 152(e) ... may be awarded to the non [-jcustodial parent when that allocation would produce a net tax savings for the parents, thereby furthering the best interest of the child. Such savings would occur through allocation to the non [-jcustodial parent only if the non[-]custodial parent’s taxable income falls into a higher tax bracket than the tax bracket of the custodial parent.... If both parents’ incomes are taxed in the same tax bracket, no net savings are realized by allocating the exemption to the non[-]custodial parent.... The juvenile court’s analysis assumes that the parent having the greater support obligation under the guidelines should have the exemption. However, we do not perceive *343how it serves the child’s best interest to allow the non[-]custodial parent to claim the exemption when there will be no net tax savings. While an additional exemption for the non[-]custodial parent may marginally increase his ability to pay support, the removal of an exemption would equally decrease the custodial parent’s ability to support the child. The child’s best interest is not furthered by the zero-sum transaction. Singer, 588 N.E.2d at 812 (emphasis added). Therefore, the court recognized that even where the non-custodial parent’s share of support was greater, “it would make little sense to allocate the exemption to the non-custodial parent merely because that parent is responsible for a higher percentage of the support obligations under the guidelines!]” when that benefit to the non-custodial parent was weighed against a custodial parent’s lesser income and closer day-to-day support relationship with the child. Id. See also Motes v. Motes, 786 P.2d 232, 239 (Utah Ct.App.1989) (noting that “use of the power to order a custodial parent to execute a section 152 declaration should not be used to evenly or otherwise divide the available exemptions without regard to the particular economic realities!]” of the parties to that specific case) (emphasis in original). Rather, allocation of the tax dependency exemption to the non-custodial parent requires an on record showing that the interests of the child have been furthered. Id. at 811. Primarily, the Ohio Supreme Court found that such an allocation to the non-custodial parent would only be in the best interest of the child if “that allocation would produce a net tax savings for the parents,” id. at 812, because it thereby increased the after-tax spendable income of the family as a whole, which can then be channeled into an increase in child support payments to offset the dependency exemption. Cf. id. Indeed, the majority of our sister jurisdictions agree with this general principle. Cornejo, supra, 53 Cal.3d at 1279-80, 283 Cal.Rptr. 405, 812 P.2d 586; Motes, supra, 786 P.2d at 239; Nichols, supra, 547 So.2d at 775; Fudenberg v. Molstad, 390 N.W.2d 19, 21 (Minn.Ct.App.1986). Cf. Cross, 363 S.E.2d at 459-60; *344In re Marriage of Lovetinsky, 418 N.W.2d at 90; Lincoln v. Lincoln, 155 Ariz. 272, 746 P.2d 13, 17 (Ct.App.1987). But see Sarver v. Dathe, 439 N.W.2d 548, 551-52 (S.D.1989) (concluding that an allocation is preempted by federal law but, nevertheless, recognizing that the tax dependency exemption is still a factor to be considered in determining child support). We, accordingly, adopt the majority view and further conclude that the allocation of the tax dependency exemption may be allocated to a non-custodial parent only if it enhances the child’s best interest. Requiring the trial court to consider both the comparative actual incomes of a child’s parents and whether the non-custodial parent is, in fact, within a higher tax bracket to warrant a tax dependency exemption allocation to the non-custodial parent is in accordance with the General Assembly’s adoption of the Income Shares Model, which rests upon a child’s ability to “receive the same proportion of parental income, and thereby enjoy the same standard of living, he or she would have experienced had the child’s parents remained together.” Voishan, 327 Md. at 322-23, 609 A.2d 319. See also Petrini v. Petrini, 336 Md. 453, 460, 648 A.2d 1016 (1994) (“[I]t is for the trial judge to set an amount reasonably calculated to maintain as nearly as possible the standard of living enjoyed by the child prior to the parents’ divorce.”). To be sure, “it would be an abuse of discretion for a divorce court to order a custodial parent to sign the declaration in the absence of appropriately supported findings that [the allocation would result in an increase in after-tax spendable income of the family as a whole] or demonstrating other exceptional circumstances making it in the best interest of the parties and their child[ ] that the [exemption] be” waived to the non-custodial parent. Motes, 786 P.2d at 239. Therefore, because “[t]he parents of a child are his [or her] natural guardians and, quite apart from the moral obligations of parenthood, owe the child a legal, statutory obligation of support,” Walker, 170 Md.App. at 265, 907 A.2d 255, an allocation of the tax dependency exemption to the non-custodi*345al parent requires the trial court to engage in an on record analysis of whether such allocation would be within the child’s best interest. See Motes, 786 P.2d at 239. If the trial court determines that the non-custodial parent’s income places him or her within a higher tax bracket, the court must then find, pursuant to Maryland Law, whether the requesting party’s higher tax bracket results from the existence of unrealized or pass-through income or is the result of the party’s actual income. If the requesting party has received no unrealized income or the unrealized/pass-through income is inconsequential, the court should allocate the exemption to the noncustodial parent and include an equitable portion of the after-tax increased spendable income within its award of child support to further the best interest of the child. As we indicated in Wassif, however, under the current state of 26 U.S.C. § 152(e)(2), such a court order, standing alone, is ineffective to transfer a tax dependency exemption. 77 Md. App. at 761, 551 A.2d 935. As a consequence, the court must order the custodial spouse to execute a yearly declaration waiving his or her right to the tax dependency exemption pursuant to 26 U.S.C. § 152(e)(2) et seq. Further, the court’s order should provide that the duty to execute the waiver of the custodial parent’s right to the exemption at the end of each year is contingent on the non-custodial parent maintaining satisfaction of his or her child support obligations. In the instant case, however, we are met with the unique circumstance where the parents maintain shared custody of their minor child. See Parts I \u0026amp; 11(A), supra. “Shared physical custody may, but need not, be on a 50/50 basis, and in fact most commonly will involve custody by one parent during the school year and by the other during summer vacation months, or division between weekdays and weekends, or between days and nights.” Taylor, supra, 306 Md. at 297, 508 A.2d 964. Therefore, in instances where the parents share joint custody but one parent still attains primary physical custody and care of the child for more than one-half of the calendar year, we conclude that the general principles regarding the exemption analysis remain constant whether the par*346ents share joint physical custody — in theory — or one parent is specifically designated the primary custodian of the minor child. See 26 U.S.C. § 152(e)(1)(B) (2008). But when both parents share joint physical custody of the child on an essentially 50/50 basis, Section 152(e) of the Internal Revenue Code does not apply because it operates under the assumed premise that one parent is the primary physical custodian of the minor child. See id. § 152(e)(1)(B) (explicitly noting that, notwithstanding other sections of the statute that would allocate the exemption to the parent with the highest adjusted gross income, if “such child is in the custody of 1 or both of the child’s parents for more than one-half of the calendar year, such child shall be treated as being the qualifying child” of the primary custodial parent unless the primary custodial parent signs a written declaration waiving his or her right to the tax dependency exemption). Consequently, in instances where Section 152(e) is inapplicable, allocation of the exemption returns to the parent with the highest adjusted gross income pursuant to 26 U.S.C. § 152(c)(4)(B)(ii). Notwithstanding assertions that “alternating the tax dependency is within the spirit of [26 U.S.C. § ] 152(c)(4)(B)(ii) and [additionally] follows Maryland [L]aw,” any reliance on the Mississippi Court of Appeals’ decision in H.L.S v. R.S.R., 949 So.2d 794 (Miss.Ct.App.2006), or the Third District Appellate Court of Illinois’ opinion in In re Marriage of Sawicki (“Sawicki”), 346 Ill.App.3d 1107, 282 Ill.Dec. 404, 806 N.E.2d 701 (2004), is misconceived. The facts and reasoning of these cases are inapposite to the case at bar. Both intermediate appellate courts acknowledge that, in those particular cases, there is but one primary physical custodian of the minor child. H.L.S., 949 So.2d at 796-97 (noting that “full care, custody, and control of the minor child” was awarded to the father that the Chancery Court only modified custody to allow the mother a broader visitation with the minor child); Sawicki, 282 Ill. Dec. 404, 806 N.E.2d at 704 (observing that the mother was awarded primary physical custody of the child). Thus, the court addressed the parties contentions within the context of a 26 U.S.C. § 152(e) analysis. See H.L.S., 949 So.2d at 799 *347(relying on the court’s previous opinion in Laird v. Blackburn, 788 So.2d 844, 852 (Miss.Ct.App.2001), which, in turn, was based on an adoption of the Indiana Child Support Guidelines set forth in In re Marriage of Glover v. Torrence (“Glover”), 723 N.E.2d 924, 938 (Ind.Ct.App.2000));22 Sawicki, 282 Ill. Dec. 404, 806 N.E.2d at 711 (premising its analysis on the trial court’s broad equitable discretion to allocate the exemption pursuant to 26 U.S.C. § 152(e) as set forth by the court’s previous decisions of In re Marriage of Fowler, 197 Ill.App.3d 95, 143 Ill.Dec. 305, 554 N.E.2d 240, 243 (1989), and In re Marriage of Van Ooteghem, 187 Ill.App.3d 696, 135 Ill.Dec. 331, 543 N.E.2d 899, 900-01 (1989)). As noted, supra, when both parents share joint physical custody of the child on an essentially 50/50 basis, Section 152(e) of the Internal Revenue Code does not apply because it *348operates under the assumed premise that only one parent is the primary physical custodian of the minor child. Accordingly, we conclude that the circuit court abused its discretion in allocating the tax dependency exemption between the parents in alternating years. Based on the particular circumstances of the ease at bar, the circuit court must allocate the exemption to the parent with the highest adjusted gross income pursuant to 26 U.S.C. § 152(c)(4)(B)(ii). However, when the circuit court does so, it must additionally consider whether any increase in after-tax spendable income should be channeled into an increase in child support payments to offset the dependency exemption in order to further the best interest of the child pursuant to the Income Shares Model. Cf Singer, 588 N.E.2d at 811-12. See also Cornejo, 53 Cal.3d at 1279-80, 283 Cal.Rptr. 405, 812 P.2d 586; Motes, 786 P.2d at 239; Nichols, 547 So.2d at 775. Therefore, if the parent with the highest adjusted gross income additionally falls within a higher tax bracket, similar to a Section 152(e) analysis, the court must determine whether the exempt party’s higher tax bracket results from the existence of unrealized or pass-through income. If the party maintains no unrealized income or if the unrealized or pass-through income is inconsequential, the court must include that after-tax increased spendable income within its award of child support. Merely adjusting the child support payment without these considerations would be insufficient because it leaves the child no better off than before. There must be more. (D) The Monetary Award Granted to Sarah Hornbeck. Jeffrey next contends that the circuit court abused its discretion when it granted Sarah a monetary award in the amount of $7,000 for two reasons. First, Jeffrey asserts that the court erred by refusing to “go back and make the appropriate adjustments to the marital property calculations” regarding the parties’ debt for the VW Touareg subsequent to “changing its] mind and ordering] that the vehicle be transferred to [Jeffrey.]” He attests that this error further “made *349him responsible” for selling the vehicle and for the entire debt — notwithstanding the fact that the value of the vehicle was negative. Second, he contends that the circuit court further erred when it attributed to Jeffrey $3,100 of extant property for the wrongfully dissipated 2009 tax refund. Sarah counters that the court “correctly classified the property and then considered the statutory factors in making the determination to order a $7,000 monetary award[.]” She argues, therefore, that the circuit court properly exercised its “pure” discretion, and that the monetary award should be affirmed. We elect to address these contentions in reverse order. (1) The Circuit Court’s Finding of Dissipation And The Valuation of Extant Property. We begin by addressing Jeffrey’s second contention: that the $3,100 was wrongfully attributed to him. Preliminarily, we note that “[m]arital property means property, however titled, acquired by one or both parties during the marriage.” Md.Code (1984, 2012 Repl. Vol), § 8-201(e)(1) of the Family Law Article, quoted in Williams v. Williams, 71 Md.App. 22, 34, 523 A.2d 1025 (1987). See also Campolattaro v. Campolattaro, 66 Md.App. 68, 81, 502 A.2d 1068 (1986). Thus, “[pjroperty acquired by a party up to the date of the divorce, even though the parties are separated, is marital property.” Williams, 71 Md.App. at 34, 523 A.2d 1025 (citations omitted). But, as this court has previously articulated: ... [Mjarital property which generates a monetary award must ordinarily exist as “marital property” as of the date of the final decree of divorce based on evidence adduced at the trial on the merits or a continuation thereof. Therefore, property disposed of before commencement of the trial under most circumstances cannot be marital property. Gravenstine v. Gravenstine, 58 Md.App. 158, 177, 472 A.2d 1001 (1984) (emphasis added), quoted in Williams, 71 Md.App. at 34, 523 A.2d 1025. The exception to this general principle *350exists under circumstances of wrongful dissipation of the parties’ marital property. It is well established that “[dissipation [occurs] where one spouse uses marital property for his or her own benefit for a purpose unrelated to the marriage at a time where the marriage is undergoing an irreconcilable breakdown.” Sharp v. Sharp, 58 Md.App. 386, 401, 473 A.2d 499 (1984). Stated more simply, it occurs when “marital assets [are] taken by one spouse without agreement by the other spouse.” John F. Fader, II \u0026amp; Richard J. Gilbert, Maryland Family Law, § 15-10 (4th ed.2006). Therefore, “a conveyance made by a husband before and in anticipation of his wife’s suit for alimony, or pending such suit, or after decree has been entered therein in the wife’s favor, to prevent her from obtaining alimony, is fraudulent and may be set aside, unless the grantee took [the marital property] in good faith, without notice and for value.” Oles Envelope Corp. v. Oles, 193 Md. 79, 89, 65 A.2d 899 (1949) (holding that a spouse’s sale of marital property stock for $42,000 over book value adequate consideration to defeat fraudulent dissipation claim), quoted in Solomon v. Solomon, 383 Md. 176, 202, 857 A.2d 1109 (2004). In Jeffcoat v. Jeffcoat, this Court discussed the appropriate burdens of persuasion and production, stating: The burden of persuasion and the initial burden of production in showing dissipation is on the party making the allegation. Choate v. Choate, 97 Md.App. 347, 366, 629 A.2d 1304 (1993). That party retains throughout the burden of persuading the court that funds have been dissipated, but after the party establishes a prima facie case that the monies have been dissipated, i.e. expended for the principal purpose of reducing the funds available for equitable distribution, the burden shifts to the party who spend the money to produce evidence sufficient to show that the expenditures were appropriate. 102 Md.App. 301, 311-12, 649 A.2d 1137 (1994) (concluding that dissipation was clearly demonstrated by the record when, notwithstanding the family’s prior “hard work, frugality, and *351sound fiscal management,” the husband spent almost $300,000 in the year following the parties’ separation), quoted in Simonds v. Simonds, 165 Md.App. 591, 614-15, 886 A.2d 158 (2005). More recently, the Court of Appeals specifically addressed a dissipation argument’s specific burdens of persuasion and production in Omayaka v. Omayaka, 417 Md. 643, 12 A.3d 96 (2011). There, the plaintiff (“wife”) filed a complaint for divorce on grounds of voluntary separation. Id. at 647, 12 A.3d 96. In response, the defendant (“husband”) denied that he and his wife had ever resolved to voluntarily live apart for the statutory period required for a divorce by voluntary separation and further submitted a counterclaim for absolute divorce alleging in “count II” of his counter-complaint that his wife had dissipated the parties’ marital assets. Id. Specifically, the husband, in part, asserted: COUNT II DISSIPATION OF MARITAL ASSETS 11. [The husband] did refinance the marital home. Pursuant to an agreement between the parties, [the wife]’s counsel was to place her share of the proceeds in an escrow account until she had accounted for the transfer of marital funds in the amount of $80,000[ ]. By a June 13th 2006 communication, the parties understood that [the wife]’s counsel was to release all but $40,000[] to her and would provide an accounting of what, if anything, was taken and how the marital money was spent. To date[,] no such accounting has been provided. 12. [The wife] has clearly dissipated the marital funds, these funds were transferred during the pendency of litigation and not spent for any family use purposes. Indeed some of these funds were wired to an overseas bank account and/or [to] persons that [the husband] is not aware of or was privy to. Id. at 647-48, 12 A.3d 96. Thereafter and during the trial before the Circuit Court for Prince George’s County, the defendant called his wife as his first witness on his counterclaim of divorce. Id. at 648, 12 *352A.3d 96. The wife’s testimony included two concessions: “that (1) while married to [her husband], she opened two bank accounts in her name only, and (2) from March of 2005 through December of that year, she made ‘over the counter’ withdrawals of approximately $80,000[ ] from those accounts.” Id. at 648-49, 12 A.3d 96. The wife, however, denied the allegations of dissipation, attesting that when she and the defendant lived together “each one of [them] had [their] own account[s]. So the way [she] spent [her] money, [she] spent [her] money, and he just spent his own money.” Id. at 649, 12 A.3d 96. She further explained that “[t]he only joint account that [they] had [was] where [they] used to pay [their] bills.” Id. At the conclusion of the trial, the circuit court granted the wife an absolute divorce and denied the husband’s counterclaim for dissipation, noting that he had failed to meet his burdens of production and persuasion. Id. at 649-51, 12 A.3d 96. As a consequence, the husband noted an appeal to this Court. Id. at 646, 12 A.3d 96. The Court of Appeals, however, issued a writ of certiorari on its own initiative to address the parties’ contentions regarding a dissipation arguments’ burden of persuasion and production. Id. After reviewing the parties’ contentions on appeal, the Court acknowledged with approval Judge John F. Fader, II, and Judge Richard J. Gilbert’s “cookbook method” to resolve a dissipation allegation, and noted: • If property does not exist at the time of divorce, it cannot usually be included as marital property. • Well, that is so unless one spouse proves [by a preponderance of the evidence] that the other spouse dissipated assets acquired during the marriage to avoid inclusion of those assets toward consideration of the monetary award. • [A prima facie case] of dissipation occurs when evidence is produced that marital assets were taken by one spouse without agreement by the other spouse. *353• Then, the burden of going forward with evidence shifts to the party who [allegedly] took the assets without permission to [produce evidence that generates a genuine question of fact on the issue of (1) whether the assets were taken without agreement, and/or (2)] where the funds are [and/or (3) whether the funds] were used for marital or family expenses. • If that proof of use for marital or family purposes is not produced, then the property taken is “extant” marital property, titled in or owned by the individual who took the marital property without permission. • From that “extant” property in the name of one spouse, the other spouse may be given a monetary award to make things equitable. Omayaka, 417 Md. at 655-56, 12 A.3d 96 (quoting John F. Fader, II \u0026amp; Richard J. Gilbert, supra, at § 15-10) (additions and modifications in Omayaka, 417 Md. at 655-56,12 A.3d 96). Thereafter, the Court concluded, “It is clear that the ultimate burden of persuasion remains on the party who claims that the other party has dissipated marital assets.” Id. at 656, 12 A.3d 105 (emphasis added). In doing so, the Court recognized that, although the husband was entitled to argue that the wife’s explanation of the dissipated marital funds was unreasonable, the circuit court maintained no requirement to accept the husband’s argument because it was within the circuit court’s discretion to determine which evidence offered was the “better” evidence. Id. at 657 \u0026amp; n. 4, 12 A.3d 105. Specifically, the Court reasoned that [w]hen a party attempts to prove a particular point by presenting evidence that is less clear, less direct, less reliable and/or less satisfactory than other evidence available to that party, the trier of fact is permitted — but not required — to find that the “better” evidence “would have been detrimental to [that party] and would have laid open deficiencies in, and objections to [that party’s] case *354which the more obscure and uncertain evidence did not disclose.” Omayaka, 417 Md. at 657 n. 4, 12 A.3d 96 (quoting Loyal Protective Ins. Co. v. Shoemaker, 178 Okla. 612, 63 P.2d 960, 963 (1936)) (additional citations omitted) (textual addition in Omayaka, supra, 417 Md. at 657 n. 4, 12 A.3d 96) (emphasis added). Thus, because dissipation is a clear question of fact, the circuit court was entitled to accept or reject any portion of the testimony of a witness. Id. at 658, 12 A.3d 96. “The finding that [the wife] had testified truthfully was therefore not erroneous — clearly or otherwise — merely because the [c]ircuit [c]ourt could have drawn different ‘permissible inferences which might have been drawn from the evidence by another trier of facts.’ ” Id. (quoting Hous. Opportunities Comm’n of Montgomery Cnty. v. Lacey, 322 Md. 56, 61, 585 A.2d 219 (1991)) (emphasis in Omayaka, supra, 417 Md. at 658, 12 A.3d 96). Clearly, therefore, the appellate court must consider evidence produced at trial in a light most favorable to the prevailing party, and, if substantial evidence was presented to support the trial court’s determination, it is not clearly erroneous and cannot be disturbed. Housing Opportunities Comm’n v. Lacey, 322 Md. 56, 60, 585 A.2d 219 (1991) (quoting Ryan v. Thurston, 276 Md. 390, 391-92, 347 A.2d 834 (1975)). In the instant case, Sarah presented testimonial evidence of the wrongful dissipation of the parties’ 2009 joint tax return in the following colloquy with her counsel at trial: [Sarah’s counsel]: You and [Jeffrey] filed a joint return for 2009; is that correct? [Sarah]: Yes. [Sarah’s counsel]: Showing you what has been marked for identification as Joint Exhibit No. 3, can you identify this document? [Sarah]: Yes, this is the joint tax return for the year 2009. [Sarah’s counsel]: Thank you. And there was a refund due to the two of you, is that correct? [Sarah]: Yes. *355[Sarah’s counsel]: Did you get that refund, or any part of it? [Sarah]: No, I did not. [Sarah’s counsel]: What was your understanding about the nature of the refund? Was it a direct deposit or paper? [Sarah]: It was my understanding the joint refund was — a paper check was to be issued. [Sarah’s counsel]: What happened with the refund? [Sarah]: I was expecting a paper check when I reviewed the tax refund document — the income tax return documents, because direct deposit was not selected, as I understood. And, I never saw a paper check. I was expecting a joint check to be made out to both of us and I never saw it. [Sarah’s counsel]: Did you execute the necessary document for the electronic filing? [Sarah]: No. Indeed, Sarah and Jeffrey’s Maryland e-File Declaration for Electronic Filing explicitly noted that the parties “d[id] not want direct deposit of [their] refund or any electronic funds withdrawal (direct debit) of [their] balance due.” Moreover, Joint Exhibit No. 3 included a letter of correspondence from Paar, Melis \u0026amp; Associates, the parties’ accountants, dated August 27, 2010, in which the parties were, in relevant part, advised: Enclosed is your 2009 Form 1040, U.S. Individual Tax Return, prepared from the information you provided. Your return will be electronically filed with the IRS once we receive your signed Form 8879, IRS e-file Signature Authorization. Your federal return reflects a refund of $3,476. You should receive a check for this amount in approximately four to eight weeks. *356Enclosed is your 2009 Maryland income tax return, prepared from the information provided. Your return will be electronically filed with the Maryland taxing authority. You’re Maryland income tax return reflects a refund of $703. You should receive a check for this amount in approximately four to eight weeks. (emphasis added). In addition, during Jeffrey’s cross-examination at trial, Jeffrey, in fact, provided no testimony that he used the money for living expenses. Rather, he asserted, in contrast to Sarah’s statement, that the 2009 tax refund was deposited electronically, during the following colloquy: [Sarah’s counsel]: You received a — you and Sarah [Horn-beck] filed joint tax returns for 2009; is that correct? [Jeffrey]: Yes. [Sarah’s counsel]: And, checks were issued as refunds in both of your names; isn’t that correct? [Jeffrey]: I don’t know whose names were on the checks. It was direct deposited to my account by my accountant; but I never saw a check. [Sarah’s counsel]: It’s your testimony there was direct deposit? [Jeffrey]: Yes. [Sarah’s counsel]: Did you give [Sarah] any of that money? [Jeffrey]: No. [Sarah’s counsel]: You kept it all? [Jeffrey]: Yes. [Sarah’s counsel]: You had it directed into your account? [Jeffrey]: Yes. [Sarah’s counsel]: Did you tell [Sarah] you were doing that? [Jeffrey]: I didn’t know what was on the statement. We filed — she signed — when you fill out the tax form, it’s an option to give them your checking account number that says *357that you would like to have any refunds deposited directly. She signed the return, so I didn’t specifically tell her; no. Further evaluation of the record additionally demonstrates Jeffrey’s calculated conduct in anticipation of the parties’ imminent dissolution. The court noted this conduct throughout its oral opinion. Because an accusation of dissipation is a clear question of fact, the circuit court was entitled to accept or reject any portion of the testimony of a witness. Omayaka, 417 Md. at 658, 12 A.3d 96. Therefore, “when a party attempts to prove a particular point by presenting evidence that is less clear, less direct, less reliable and/or less satisfactory than other evidence available to that party, the trier of fact is permitted — but not required — to find that the ‘better’ evidence.” Id. at 657 n. 4, 12 A.3d 96 (citation omitted). Accordingly, we conclude that the circuit court committed no error in attributing to Jeffrey $3,100 of extant property for the wrongfully dissipated 2009 tax refund. (2) The Circuit Court’s Marital Property Calculations Regarding The VW Touareg. Subsequent to the circuit court’s valuation and identification of the majority of the parties’ marital property, identification of extant property in the amount of $3,100 and its denial of Sarah’s request for alimony, the court returned to discuss the VW Touareg and initially ordered Sarah to sell the vehicle and split the proceeds with Jeffrey: .... What I am doing with the Touareg, I’m going to order the Touareg be sold. I’m going to — since the Touareg is in your possession, I am going to order that [Sarah] within 60 days will sell the Touareg, and you will split the proceeds with [Jeffrey] on that Touareg. All right. The next one— That decision prompted the following dialogue between the court and the parties: [Sarah’s counsel]: May I ask a question, Your Honor? THE COURT: You may, did I miss something? *358[Sarah’s counsel]: Who is responsible for the debt on the Touareg, since that’s in [Jeffrey’s] name? It was my understanding— THE COURT: I was supposed to address that, yes. Well[,] here’s what — there is no proceed, unless the debt is paid. [Sarah’s counsel]: Correct. THE COURT: So[,] when you sell it, the debt gets paid. And then out of that, then there’s a proceed. So if she sells it for, I don’t know what you can sell it for, and I’m not even sure whether or not, you know, if it really is worth $24,000 or not. [Sarah’s counsel]: I think we agreed that the fair market of the car, was $15,999. THE COURT: But they owe $24,000? [Sarah’s counsel]: $24,000 correct, yes. THE COURT: $24,000, that’s where the $24,000 came from. [Sarah’s counsel]: And it was my understanding Your Honor, that you had put that into the marital property calculation on [Jeffrey’s] side. THE COURT: Uh-huh. [Sarah’s counsel]: So[,] since the debt’s in his name,— [Sarah’s counsel]: Okay, it was my understanding that that [sic] was — well I guess I’m confused. Who’s paying the— any deficit, if there is a deficit, who is going to be responsible for the deficit? The debt is in [Jeffrey’s] name? THE COURT: Here it is. [Jeffrey’s counsel]: According to my notes, Your Honor, it says that you estimated that the value would be at $15,909 for the lien of $24,047, based on Exhibit 25. And then you said that they are — the $24,000 lien would be split between the parties, each— THE COURT: Right, I was taking it off of the — and I didn’t take it off of the marital property, because to me it was a flush. And I was going to deal with it later, and *359I didn’t deal with it, that was the problem. So there is still this $24,047. Then[,] I think the best thing we can we do [sic] in this regard, and it’s the only other way I can think of, instead of letting — instead of having [Sarah] sell the car — I’m trying to think what the equitable thing will be to do. Then here’s what I’m going to do. The vehicle will be given back to [Jeffrey], because the loan is in his name. It will be given back to him. If [Jeffrey] decides to sell it, that’s up to [him]. If he decides to sell it. I don’t know what else to do with this vehicle. (emphasis added). Jeffrey’s counsel objected to this designation of the VW Touareg to Jeffrey based an impermissible transfer of property and on its negative value in the following colloquy: [Jeffrey’s counsel]: Your Honor, I do not believe under the Family Law [Article] you have the authority to do that. THE COURT: To do what? Really? I can’t transfer— THE COURT: But it’s titled in both of their names, correct? [Sarah’s counsel]: Yes, ma’am. THE COURT: It’s just the loan that we’re talking about. [Sarah’s counsel]: It’d be the same thing if you sold it. If it was ordered to be sold, and he was responsible for the debt. It’s the same issue. THE COURT: Uh-huh. [Jeffrey’s counsel]: And then he now has a negative marital debt that was acquired during the marriage attached to him, and then a monetary award. He has a $24,000 debt with something that’s only valued at $16,000. He’s getting double penalized for this negative asset, with your award of the monetary award — with your Order of a Monetary Award. THE COURT: Well[,] let me ask you a question. *360[Jeffrey’s counsel]: He’s being double billed for that. THE COURT: Because I didn’t give her any alimony, that’s the one thing that I’m doing. I’m not giving her alimony. And so that might be the reason I’m doing that, [counsel], is because I’m not making any alimony payments to her that [Jeffrey] will have to keep up over a period of time. Which may in the long run end up, if I did that, putting him in certainly much more of a peril than it would be to deal with the debt of the Touareg. He doesn’t have to sell it, he doesn’t have to if he doesn’t want to. I mean[,] it’s in their name. can certainly ask — have [Sarah] take her name off this Touareg as having on the title [sic]. She can do that. The loan is not in her name. (emphasis added). Jeffrey argues that the court erred by refusing to “go back and make the appropriate adjustments to the marital property calculations” regarding the parties’ debt for the YW Touareg subsequent to “changing its] mind and ordering] that the vehicle be transferred to [Jeffrey].” He attests that this error further “made him responsible” for selling the vehicle and for the entire debt — notwithstanding the fact that the value of the vehicle was negative. Thus, he asserts that the court abused its discretion in making a monetary award by including the negative value of the vehicle. We agree. “The purpose of the monetary award is to correct any inequity created by the way in which property acquired during the marriage happened to be titled.” Doser v. Doser, 106 Md.App. 329, 349, 664 A.2d 453 (1995). See Long v. Long, 129 Md.App. 554, 579, 743 A.2d 281 (2000). In Ward v. Ward, 52 Md.App. 336, 449 A.2d 443 (1982), this Court explained: The monetary award is thus an addition to and not a substitution for legal division of the property accumulated during the marriage, according to title. It is “intended to *361compensate a spouse who holds title to less than an equitable portion of that property....” What triggers operation of the statute is the claim that a division of the parties’ property according to its title would create an inequity which would be overcome through a monetary award. Id. at 339-40, 664 A.2d 453 (internal citation omitted) (emphasis in original). “When a party petitions for a monetary award, the trial court must follow a three-step procedure.” Malin v. Mininberg, 153 Md.App. 358, 428, 837 A.2d 178 (2003) (citations omitted). As we explained in Innerbichler v. Innerbichler, 132 Md.App. 207, 228, 752 A.2d 291 (2000): First, for each disputed item of property, the court must determine whether it is marital or non[-]marital. [Md.Code (1984, 2012 Repl.Vol.), §§ 8-201(e)(1) \u0026amp; 8-203 of the Family Law Article]. Second, the court must determine the value of all marital property. [Md.Code (1984, 2012 Repl.Vol.), § 8-204 of the Family Law Article]. Third, the court must decide if the division of marital property according to title will be unfair; if so, the court may make a monetary award to rectify any inequity----[Md.Code (1984, 2012 Repl.Vol.), § 8-205(a) ]. Jeffrey’s quarrel focuses on the circuit court’s valuation of this marital property in view of the outstanding debt on the VW Touareg. Nonetheless, Sarah argues that “the trial court can exercise pure discretion when granting a monetary award.” “Were we to accept the wife’s position [and turn a blind-eye to the circuit court’s ruling], we would be forced to distinguish this case from the situation presented in Ward [v. Ward, 52 Md.App. 336, 449 A.2d 443 (1982) ], solely on the grounds that th[is] marital debt[ ][was] in [Jeffrey’s] name only and because the debt impairs the title to [court identified marital property]. Such an approach would ignore the economic realities of the debt[.]” Schweizer v. Schweizer, 55 Md.App. 373, 377, 462 A.2d 562 (1983). Had the circuit court credited Jeffrey with the debt of $24,000, the vehicle would have had no value for *362the purposes of a monetary award consideration and would not have been included in the granting of any such award. See Sharp v. Sharp, 58 Md.App. 386, 397, 473 A.2d 499 (1984) (citing Schweizer, 55 Md.App. at 378, 462 A.2d 562). Accordingly, we conclude that the circuit court abused its discretion in the valuation of the VW Touareg resulting in an inequitable monetary award. Thus, we vacate the judgment and remand for further consideration. (E) The Attorney’s Fees Granted to Sarah Hornbeck. Following the circuit court’s $7,000 monetary award to Sarah, it addressed Sarah’s request for attorney’s fees, awarding her $60,000. Specifically, the court stated: ____Okay. I think the attorneys [sic] fees is [sic] the last issue that I have to deal with. A lot has been made about the month of August and— excuse me. A lot has been made about the August, period of time between August the l[st], and the time that the Protection Orders were sought. And so I’m going to address that when I’m looking at whether or not I’m going to require [Jeffrey] to pay any of the legal fees of [Sarah]. And the testimony came out that there was an August the l[st] incident. There was an August the 10[th] incident. [On A]ugust l[st,] the police were called and some injury to [Jeffrey]. [Sarah] filled out the document that indicated that she had been physically assaulted, and then changed her mind based on the police officer’s assertion to her that an arrest would be imminent if in fact that happened. And she changed her mind and filled out a different document. Being an Ex-Domestic Violence Prosecutor, that doesn’t sound strange to the Court at all, that a police officer would say that. I don’t think that it’s right, but they say it. And so I don’t find that to be — and it doesn’t surprise me that people do in fact change their minds. Sometimes *363immediately when it looks as though what they don’t — can’t imagine happening, is going to happen. And many people who call the police, and then once the police officers start to do what it is that they do, and what they’re ordered to do, mandated to do[,] people change their minds. Which is why it makes these situations very dangerous for police officers. It makes it very, very dangerous. And so they allowed [Sarah] to opt out, by changing what her statement was. I’m looking for my statute, hold on for a second. On August the 10[th,] there was an incident that involved [Sarah] taking [Jeffrey’s] phone, going to the very top floor, locking the door. [Jeffrey] wanted to get in, get his phone, or get into her, it was not clear. [Jeffrey] then leaves. [Jeffrey] also called [Sarah’s father] ... [t]o see if he could call his daughter to get her to give him his phone back, and it was just a mess. A mess. And I’m going to tell you, I’ve always learned that sometimes you keep people out of your marriage. Because what happens a lot of times, you all get other people mad at the other person. And you all go right back together again, and they’re stuck with the emotion because they love you. So sometimes you got to keep people out of it. But be that as it may, [Jeffrey] testified meaning — I’m sorry, [Sarah’s father] testified that he was involved in the sense that he was getting phone calls from [Jeffrey]. And [Sarah’s mother] testified getting calls from her daughter, as to the emotion that this particular night’s incident caused. Which I believe[,] at that point[,] was probably when it dawned on [Sarah] that this was it. Meaning that things could not be repaired again. Because then it leads to the locks being changed. [Jeffrey] not really staying in the home, but staying at — I want to say Dominic’s house. I think I’m correct. But then I certainly did pay close attention to the legal bills that [Jeffrey] presented in his testimony that, this was in [Jeffrey’s] head way before August 4[th]. *364Not long after the August l[st] incident, [Jeffrey] puts things in motion. That he wanted out and I have to agree that a lot of it was calculated it was. You can’t get around it. [Jeffrey] set it in motion, had communications with [his attorney], about protection orders, divorce, etc. [He d]id not mention a word to [Sarah]. And let me say this, I also know that I’m only being told a piece of this whole story. I do realize that there’s a whole lot more that you all were communicating to each other that I’ll never know. But what I do know [is] it sounds as though [Jeffrey] [w]as on his way to divorce, and did not share that. At least did not articulate that to [Sarah]. And sort of, you know, kept up with the doctor’s appointments, and the like. And[,] you know[,] planning out what lawyers do. You are both lawyers. You know, we plan litigation. Thinking about litigation, you know, long before. That’s why when things happen in your friends [’] lives, they call you. They want to know how can I start this thing so it can look best for me? And I have to admit, when we get to the filing of the Protection Orders, both of — it just surprised this [c]ourt that both of you went on the same day and complained an incident that happened 20 some odd days earlier. I read the text messages, or the e-mails from [Sarah] to [Jeffrey]. And when I read it it’s not a text message that wife, I think[,] sends a husband. You were documenting. That’s what lawyers do[. W]e document. Because at that point, you had already come back from being denied a Protection Order in one of the emails, and it didn’t look as thought it was something that, you know, you were just saying to him. Because you didn’t say to him[, “]I went today to get a Protection Order. I don’t want you around anymore. [”] It was, you know, very detailed so that just in case it ended up that it’d have to be in [c]ourt. That’s my opinion, we’d do it that way. But I don’t believe that [Sarah]— [Sarah] put this in motion. So[,] the [c]ourt has to look at, *365when I’m looking at [c]ounsel fees is the reasonableness of the fees. I have to look at the financial resources and financial needs of both of the parties. And whether there was substantial justification for prosecuting and/or defending the proceedings. And I’m looking at 11-110 in the Family Article. And if there’s absence of justification!, i]f I find that there is an absence of justification for prosecuting or defending, or good cause to the contrary, the [cjourt can award to the other party the reasonable and necessary expenses. Perhaps had someone at some point, and I’m saying [Jeffrey] been honest and said, [“Yjou know what[,] I don’t want to be in this marriage anymore. I want out.[”] You all could’ve come to some kind of agreement. But what happens!? Jeffrey], when you look back in hindsight, as I’m sure [Sarah] did, it looks like you had already planned it. And everything else after that looked very contrived. And so it sort of put her in a position where she had to defend herself legally. Because you were drumming up all of the ammunition that you could drum up. You were getting, you know, getting your lawyers lined up. Trying to get the psychiatrist, psychologist, whoever lined up. You all went to a session together. Something happened in that session, and I’m not even privileged, not even allowed to know, but I know something happened that would send both of you not long after that to the courthouse. One going in one direction, and one going in the other. But I believe that’s when the rubber met the road was inside of that session, that none of us will ever know sort of what happened. Perhaps it did come out that it was already set up, I don’t know. But when looking at the records, [Jeffrey], set it up. It didn’t have to get this far. I’ll look at the — again, I’ll go *366back to the number of requests that were made for documents. That had to be made for documents. There was a question about whether or not the surveillance, or there was an argument that they were trying to catch [Jeffrey] doing something. And[,] again, that’s distrust. But also, you didn’t leave much trust left after you’ve done this to [Sarah]. And you know, you got to see what you can get to defend your case. So I don’t think that they were unreasonable things that she did. And building the expense that you built I would say that. The [c]ourt sanctioned [Jeffrey], because of the failure to comply with discovery. Although during trial, no one asked this [c]ourt to enforce the sanction, and they didn’t. And to their credit they did not ask that, but it didn’t get over me that there had to be not only an [o]rder to [c]ompel, and that didn’t do it. And then there had to be a sanction. So now I have to figure out the sanction and attorney’s fees. Because I believe that there was information that was purposefully kept from this litigation. It didn’t have to be. If you don’t have anything to hide, bring it forward. So I’m not sure what’s out there, but I’m going to certainly have to, again do what I believe is equitable. [Sarah’s] finances are way, way lower. Meaning income and finances way, way lower than [Jeffrey’s]. [Jeffrey] makes a tremendous amount of money comparatively speaking to [Sarah]. The [c]ourt is going to order based on that, that [Sarah] was[,] in fact[,] justified in defending the proceedings the way in which she did. And I’m going to order [Jeffrey] to pay a portion of the attorneys fees for [Sarah]. The court is going to require you, sir, to foot $60,000 of this bill. And that is to be paid directly to the attorneys, to [the firm of Sarah’s attorney]. (emphasis added). Following the entry of the circuit court’s final order correlative to its oral opinion, Jeffrey filed within his petition for *367rehearing an argument that the circuit court had abused its discretion in awarding $60,000 in attorney’s fees, noting that “the amount of attorney’s fees far exceeded the amount in controversy.” The court denied Jeffrey’s request to alter or amend its previous award of attorney’s fees, stating within its memorandum and opinion of March 30, 2012: The court did not err when it awarded attorney’s fees to the [Sarah], [Jeffrey] request that the judgment be amended to reduce or abate the counsel fees. [Jeffrey] argues that the court erred in ordering [him] to pay $60,000 as contribution to [Sarah’s] counsel fees. The court denies this request. The court[,] in determining whether to award [Sarah’s] request for counsel fees[,] is bound by the factors outlined in Fam. Law. § 12-203. This court considered the financial circumstances of each party and the[n] considered [Sarah’s] justification for defending and bringing her claim. [Jeffrey’s] obstructionist behavior throughout the entire case from its inception weighed heavily in the court[’]s consideration of [Sarah’s] justification for defending and bringing her claim. [Jeffrey] failed to challenge the counsel fees at trial. [Jeffrey] also argues that he is unable to pay the required amount and should not be forced to go into debt to pay [Sarah’s] counsel fees. [Jeffrey] compares this case to a contempt hearing standard. This is not a contempt hearing[,] and[,] thereforef, Jeffrey] uses the incorrect standard. The court carefully weighed the factors and determined [Jeffrey’s] contribution to [Sarah’s] counsel fees to be [$]60,000. (emphasis added). Before this Court, Jeffrey’s final assignment of error is that the circuit court erred in awarding Sarah $60,000 in attorney’s fees. Specifically, he asserts that the trial court’s award of attorney’s fees was unreasonable because “[t]he trial court did not properly analyze and explain the financial status and needs of each party.” Therefore, he attests that the trial *368court’s simple statement that Jeffrey makes “a lot more money” than Sarah is an inadequate analysis of the financial status of each party, the needs of each party, and whether there was substantial justification for bringing, maintaining, or defending the proceeding. See Md.Code (1999, 2012 Repl.Vol.), §§ 7-107(c) \u0026amp; (d) of the Family Law Article; Md.Code (1984, 2012 Repl.Vol.), § 12-203(b) of the Family Law Article. In sum, Jeffrey contends that the circuit court misapplied the statutory criteria for awarding attorney’s fees. We agree. Although the circuit court is vested with a high degree of discretion in making an award of attorney’s fees, Lieberman v. Lieberman, 81 Md.App. 575, 600, 568 A.2d 1157 (1990), the trial judge must “consider and balance,” Bagley v. Bagley, 98 Md.App. 18, 39, 632 A.2d 229 (1993) (emphasis added), the required considerations as articulated by the General Assembly in Sections 7-107(c) and 12-203(b) of the Family Law Article, which provide consideration of “(a) the financial status of both parties, (b) their respective needs, and (c) whether there was substantial justification for instituting or defending the proceeding.” Holston v. Holston, 58 Md. App. 308, 325, 473 A.2d 459 (1984); Bagley, 98 Md.App. at 40, 632 A.2d 229. See Md.Code (1999, 2012 Repl.Vol.), §§ 7-107(c) \u0026amp; 12-203(b) of the Family Law Article. As a consequence, “[t]he [trial court] necessarily [must] consider the financial status of both parties and their respective needs in [its] award of alimony.” Holston, 58 Md.App. at 325, 473 A.2d 459. Section 7-107 provides that the circuit court may order one party to pay the other a “ ‘reasonable’ amount for ‘reasonable’ and ‘necessary’ expenses,” id. at 326, 473 A.2d 459, including: (1) suit money; (2) counsel fees; and (3) costs. Md.Code (1999, 2012 Repl.Vol.), § 7-107(a) of the Family Law Article. It appears from the record that the circuit court did not satisfactorily consider the financial status and needs of Jeffrey. Certainly, the court’s bald statement that Jeffrey earns “a tremendous amount of money” compared to Sarah is insufficient. As discussed in Parts 11(b) and 11(d)(2), supra, Jef*369frey was erroneously ordered to pay support on an unrealized amount of income and a miscalculated $7,000 monetary award. Jeffrey’s own financial statement admitted during the divorce proceedings demonstrated a deficit each month. Further Sarah acknowledged through the parties’ Joint Property Statement that Jeffrey did not maintain sufficient assets to cover the marital debt and his attorneys fees much less an additional $60,000 in counsel fees for Sarah’s attorney. We conclude that, even though there may be basis for an award of some counsel fees and costs pursuant to the rule, an award of $60,000 in attorneys fees is, on this record, arbitrary and clearly wrong. Miller v. Miller, 70 Md.App. 1, 12-13, 519 A.2d 1298 (1987) (citation omitted). We accordingly vacate the judgment. Upon remand, the circuit court should consider whether Sarah is entitled to a contribution toward her attorney’s fees once a decision regarding the issue of a monetary award is rendered. See, e.g., Doser v. Doser, 106 Md.App. 329, 335-36 n. 1, 664 A.2d 453 (1995); Kelly v. Kelly, 153 Md.App. 260, 280, 836 A.2d 695 (2003) (remanding an award of attorney’s fees for further consideration subsequent to this Court’s decision to remand the case for reconsideration of a monetary award and on the issue of whether alimony should be ordered). See also Alston v. Alston, 331 Md. 496, 509, 629 A.2d 70 (1993) (remanding alimony issue upon reversal of monetary award); Randolph v. Randolph, 67 Md.App. 577, 589, 508 A.2d 996 (1986) (vacating monetary award in light of reversal of counsel fees, and vacating alimony for reconsideration in light of new monetary award). JUDGMENT OF THE CIRCUIT COURT FOR BALTIMORE CITY IS AFFIRMED IN PART AND VACATED IN PART. CASE IS REMANDED FOR FURTHER PROCEEDINGS CONSISTENT WITH THIS OPINION. COSTS TO BE PAID BY APPELLEE. . Section 7-103, entitled, \"Absolute divorce,\" in relevant part, provides: *292(a) Grounds for absolute divorce. — the court may decree an absolute divorce on the following ground[ ]: (4) 12-month separation, when the parties have lived separate and apart without cohabitation for 12 months without interruption before the filing of the application for divorcef.] Md.Code (1984, 2012 Repl.Vol.), § 7-103(a)(4) of the Family Law Article. . Jeffrey noted an appeal after the circuit court's written opinion of March 30, 2012. He also noted an appeal after the denial of Sarah's request for attorney’s fees. . In his brief, Jeffrey Reichert presented the following five questions for our review: 1. Did the trial court err in its findings regarding Reichert's income when it calculated child support? 2. Did the trial court abuse its discretion regarding the tax exemption for the parties' minor child? 3. Did the trial court abuse its discretion in awarding Hornbeck $60,000 in attorney’s fees? 4. Did the trial court err when it granted Hornbeck a monetary award? 5. Did the trial court abuse its discretion when it ordered joint legal custody of the minor child but with tie breaking authority to Horn-beck? In Sarah Hombeck's cross-appellate brief, she presented one additional question for our review: I. Did the trial court abuse its discretion when it ordered joint physical custody of the minor child? . Jeffrey was bom on April 2, 1973. . Sarah, was born on July 13, 1974. . Pyloric stenosis is a condition affecting the opening (pylorus) between the stomach and the small intestine. See Pyloric Stenosis, Definition, http://www.mayoclinic.com/health/pyloric-stenosis/DS00815 (last visited Feb. 5, 2013) When the condition occurs, \"the pylorus muscles thicken, blocking food from entering the baby’s small intestine.” Id. Symptoms usually include: vomiting after meals that usually occurs after three weeks of age, but may occur at anytime between one week and five months of age. See Pediatric Surgery Health Topics, Pyloric Stenosis, http://www.hopkinschildrens.org/pyloric-stenosis.aspx (last visited Feb. 5, 2013). The vomiting is forceful and usually has the appearance of partially digested milk. Id. . See note 2, supra. . Section 2, subsection (l) of the Allegis Group Incentive Plan, entitled, \"DEFINITIONS,” specifically provides: (1) \"Incentive Investment Unit” or \"Unit” shall mean, as the context requires, either the total number of incentive investment units with respect to which Participants are eligible to earn the right to receive payment in accordance with the terms and conditions of the Plan, or, in he case of any particular Participant, the number of incentive investment units with respect to which such Participant can earn the right to receive payment in accordance with the terms and conditions of the Plan[J . Rule 5-702, entitled, \"Testimony by experts,” provides: Expert testimony may be admitted, in the form of an opinion or otherwise, if the court determines that the testimony will assist the trier of fact to understand the evidence or to determine a fact in issue. In making that determination, the court shall determine (1) whether the witness is qualified as an expert by knowledge, skill, experience, training, or education, (2) the appropriateness of the expert testimony on the particular subject, and (3) whether a sufficient factual basis exists to support the expert testimony. Md. Rule 5-702. . We caution, however, that the party seeking to exclude the unrealized or pass-through income still bears the burden of persuasion as to why the court should disregard the information provided within his or her income tax documentation in calculating child support. . Because we recognize that \"[f]or income from self-employment, rent, royalties, proprietorship of a business or joint ownership of a partnership or closely held corporation, ‘actual income' means gross receipts minus ordinary and necessary expenses required to produce [that] income,” Md.Code (1991, 2012 Repl.Vol.), § 12-201(b)(2) of the Family Law Article, we further conclude that it was error for the circuit court to calculate Jeffrey's child support obligations by including the gross rent he received for his condominium without subtracting \"ordinary and necessary expenses required to produce [that] income[.]” See id. § 12-201(b)(2). . Section 12-204(m) provides: (m) Shared physical custody cases. — (1) In cases of shared physical custody, the adjusted basic child support obligation shall first be *328divided between the parents in proportion to their respective adjusted actual incomes. (2) Each parent's share of the adjusted basic child support obligation shall then be multiplied by the percentage of time the child or children spend with the other parent to determine the theoretical basic child support obligations owed to the other parent. (3) Subject to the provisions of paragraphs (4) and (5) of this subsection, the parent owing the greater amount under paragraph (2) of this subsection shall owe the difference in the 2 amounts as child support. (4) In addition to the amount of the child support owed under paragraph (3) of this subsection, if either parent incurs child care expenses under subsection (g) of this section, health insurance expenses under subsection (h)(1) of this section, extraordinary medical expenses under subsection (h)(2) of this section, or additional expenses under subsection (i) of this section, the expense shall be divided between the parents in proportion to their respective adjusted actual incomes. The parent not incurring the expense shall pay that parent’s proportionate share to: (i) the parent making direct payments to the provider of the service; or (ii) the provider directly, if a court order requires direct payments to the provider. (5) The amount owed under paragraph (3) of this subsection may not exceed the amount that would be owed under subsection (l) [which apply to cases other than shared physical custody cases] of this section. Md.Code (1991, 2012 Repl.Vol.), § 12-204(m) of the Family Law Article. See Part 11(C), infra, for further discussion of Section 12-204(m)’s relation to an allocation of a tax dependency exemption when the parents share physical custody of the minor child. . Section 152(c) of the Internal Revenue Code states that a \"[qjualifying child[, f]or the purposes of this section,” means: (1) In general. The term \"qualifying child” means, with respect to any taxpayer for any taxable year, an individual— (A) who bears a relationship to the taxpayer described in paragraph (2) [meaning, if the individual is the child of the taxpayer or the descendant of such a child, or a brother, sister, stepbrother, or stepsister of the taxpayer or descendant of any such relative. See 26 U.S.C. § 152(c)(2), et seq.] (B) who has the same principal place of abode as the tax payer for more than one-half of such taxable year, (C) who meets the age requirements of paragraph (3) [requiring that the individual is younger than the taxpayer claiming such individual as a qualifying child and has not attained the age of nineteen as of the close of the calendar year in which the taxable year of the taxpayer begins, or is a student who has not attained the age of twenty-four as of the close of such calendar year. See 26 U.S.C. § 152(c)(3) et seq.] (D) who has not provided over one-half of such individual’s own support for the calendar year in which the taxable year of the taxpayer begins, and (E) who has not filed a joint return (other than only for a claim or refund) with the individual’s spouse under section 6013 [26 U.S.C. *332§ 6013] for the taxable year beginning in the calendar year in which the taxable year of the taxpayer begins. . See note 14, supra. . Section 152(c)(4), provides the \"[sjpecial rule relating to 2 or more who can claim the same qualifying child,” specifically providing: (A) In general. Except as provided in subparagraphs (B) and (C), if (but for this paragraph) an individual may be claimed as a qualifying child by 2 or more taxpayers for a taxable year beginning in the same calendar year, such individual shall be treated as the qualifying child of the taxpayer who is— (i) a parent of the individual, or (ii) if clause (i) does not apply, the taxpayer with the highest adjusted gross income for such taxable year. (B) More than 1 parent claiming qualifying child. If the parents claiming any qualifying child do not file a joint return together, such child shall be treated as the qualifying child of— (i) the parent with whom the child resided for the longest period of time during the taxable year, or (ii) if the child resides with both parents for the same amount of time during such taxable year, the parent with the highest adjusted gross income. (C) No parent claiming qualifying child. If the parents of an individual may claim such individual as a qualifying child but no parent so claims the individual, such individual may be claimed as the qualifying child of another taxpayer but only if the adjusted gross income of such taxpayer is higher than the highest adjusted gross income of any parent of the individual. 26 U.S.C. § 152(c)(4) (2008). . Section 152(d)(1)(C) provides that a qualifying relative is an individual \"with respect to whom the taxpayer provides over one-half of the individual's support for the calendar year in which such taxable year begins....” 26 U.S.C. § 152(d)(1)(C) (2008). . Section 152(e)(4) defines the terms provided in Sections 152(e), and specifically states: (4) Custodial parent and noncustodial parent. For the purposes of this subsection— (A) Custodial parent. The term \"custodial parent” means the parent having custody for the greater portion of the calendar year. (B) Noncustodial parent. The term \"noncustodial parent” mans the parent who is not the custodial parent. 26 U.S.C. § 152(e)(4) (2008). . The Legislative History of the Deficit Reduction Act (Pub.L. No. 98-369) reported in H.R.Rep. No. 432, Part II, 98th Cong., 2d Sess., reprinted in the 1984 U.S.Code Cong. \u0026amp; Admin.News 697, 1140, gives as the \"[r]easons for [c]hange[:]” The present rules governing the allocations of the dependency exemption are often subjective and present difficult problems of proof and substantiation. The Internal Revenue Service becomes involved in many disputes between parents who both claim the dependency exemption based on providing support over the applicable thresholds. The cost to the parties and the Government to resolve these disputes is relatively high and the Government generally has little tax revenue at stake in the outcome. The committee wishes to provide more certainty by allowing the custodial spouse the exemption unless that spouse waives his or her right to claim the exemption. Thus, dependency disputes between partners will be resolved without the involvement of the Internal Revenue Service. Id. (emphasis added), quoted in Wassif, 77 Md.App. at 760, 551 A.2d 935. . Specifically, we observed: [o]ther courts have similarly held that state court allocation of the exemption to a non[-]custodial parent does not interfere with Congressional intent. See Pergolski v. Pergolski, 143 Wis.2d 166, 420 N.W.2d 414 (1988); Lincoln v. Lincoln, 155 Ariz. 272, 746 P.2d 13 (1987); Fudenberg v. Molstad, 390 N.W.2d 19 (Minn.Ct.App.1986). But see Gerardy v. Gerardy, 406 N.W.2d 10 (Minn.Ct.App.1987); and Theroux v. Boehmler, 410 N.W.2d 354 (Minn.Ct.App.1987). Contra Lorenz v. Lorenz, 166 Mich.App. 58, 419 N.W.2d 770 (1988); Davis v. Fair, 707 S.W.2d7U (Tex.App.1986). Wassif, 77 Md.App. at 761, 551 A.2d 935. . Admittedly, as we noted in Wassif, supra, 77 Md.App. at 759-60, 551 A.2d 935, Section 152(e) of the Internal Revenue Code fails to even address with specificity the permissibility of any allocation. . Concluding that the trial court properly exercised its discretion to allocate the tax exemption to the primary custodian of the minor child, the Indiana Second District Court of Appeals premised its decision in Glover on five enumerated factors within Indiana Child Support Guideline 6. The intermediate appellate court found that the trial court considered the five factors, which provide: In determining when to order a release of exemptions, it is recommended that at a minimum the following facts be considered: (1) the value of the exemption at the marginal tax rate of each parent; (2) the income of each parent; (3) the age of the child(ren) and how long the exemption will be available; (4) the percentage of the cost of supporting the child(ren) borne by each parent; and (5) the financial burden assumed by each parent under the property settlement in the case. Glover, 723 N.E.2d at 938. Nonetheless, the court recognized that the “discretionary authority to order the custodial parent to sign a waiver of her [or his] presumed right to claim a child as dependent for income tax purposes[,]” should be guided primarily by the goal of making the maximum amount of support available to the minor child. Cf. id. (citing In re H.M.H., 691 N.E.2d 1308, 1309 (1998)). See also In re Ritchey, 556 N.E.2d 1376, 1379 (1990) (concluding a trial court maintains \"equitable jurisdiction to consider the respective tax burdens of custodial and non[-]custodial parents and, in a proper case, to order a custodial parent to sign a waiver of a dependency exemption,” and that such authority does not contravene 26 U.S.C. § 152(e)).\n\n",
    "body_length": 159976,
    "citedas": [
      "210 Md. App. 282",
      "63 A.3d 76",
      "2013 WL 1148340",
      "2013 Md. App. LEXIS 27"
    ],
    "attorneys": "M. Evelyn Spurgin, (Hillman, Brown \u0026 Darrow, PA, on the brief), Annapolis, MD, for Appellant., Sarah Hornbeck, Baltimore, MD, for Appellee.",
    "category": [],
    "judges": "Hotten",
    "citation_count": 1
  }
}
