{
  "id": "BoqQQGYBTlTomsSBe5AV",
  "document": {
    "title": "Knight v. Dugger",
    "full_title": "THOMAS KNIGHT A/K/A, ASKARI ABDULLAH MUHAMMAD -APPELLANT, v. RICHARD L. DUGGER*FN* AND TOM BARTON -APPELLEES",
    "jurisdiction": "Eleventh Circuit",
    "date": "1988-12-08T00:00:00.000Z",
    "docket": "No. 86-5610",
    "body": "RONEY, Chief Judge:\n\nThis is an appeal from the denial of a writ of habeas corpus in a capital case, the tragic facts of which have been referred to as \"unusual and bizarre.\" Knight v. State, 394 So.2d 997, 999 (Fla. 1981). On July 17, 1974, Askari Abdullah Muhammad, formerly known as Thomas Knight, abducted Sydney Gans, a wealthy Miami business man on his way to work, forced him to return to his home and held his wife Lillian hostage, demanding a $50,000 ransom. After Gans obtained the money, notifying law enforcement officers in the process, Muhammad instructed Gans to drive to a secluded area, where Muhammad fatally shot Gans and his wife. Law enforcement officers, hot on Muhammad's trail after Gans' tip, came upon the crime scene just as Muhammad was running away. Muhammad was apprehended four and a half hours later, hiding in the brush 2000 feet away from the crime scene. He had bloodstains on his pants and was standing atop a buried rifle and a bag containing $50,000.\n\nOn September 19, 1974, while awaiting trial on two counts of first-degree murder, Muhammad escaped from jail. A massive, nationwide manhunt ensued and Muhammad was recaptured on December 31, 1974. In April 1975, Muhammad was tried, convicted and sentenced to death. Muhammad's convictions and sentence were affirmed on direct appeal. Knight v. State, 338 So.2d 201 (Fla. 1976). Muhammad raised twenty-three points on appeal, including a number of issues related to the extensive publicity that accompanied his trial. No petition for certiorari was filed after this decision.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nThe collateral proceedings in this case have moved in a rather disorderly course. Shortly after executive clemency proceedings were held in December 1979, Muhammad filed a petition for writ of habeas corpus with the Florida Supreme Court, alleging ineffective assistance of appellate counsel. The court transferred the petition to the trial court for consideration as a motion for post-trial relief under Fla. R. Crim. P. 3.850. Muhammad sought leave to amend the petition and moved for appointment of new counsel. On August 15, 1980, the trial court, sua sponte, dismissed the petition.\n\nMuhammad was appointed new counsel and an appeal was taken from the dismissal of his petition. While this appeal was pending before the Florida Supreme Court, two things happened. First, on October 12, 1980, Muhammad fatally stabbed a prison guard in his cell on death row. Muhammad was ultimately convicted and sentenced to death for this crime, and the judgment and sentence were affirmed on appeal. Muhammad v. State, 494 So.2d 969 (Fla. 1986), cert. denied, 479 U.S. 1101, 107 S. Ct. 1332, 94 L. Ed. 2d 183 (1987).\n\nSecond, the Governor signed a death warrant and Muhammad's execution for the Gans' murders was scheduled for March 3, 1981. A motion for a stay of execution was filed with the court on February 2, 1981. As of February 20, 1981, the supreme court had not ruled on the appeal or the motion for stay, and Muhammad returned to the trial court, filing a motion under rule 3.850. The trial court dismissed the petition because of the appeal pending with the supreme court. On February 24, 1981, the supreme court denied Muhammad's appeal, rejecting the contention that he received ineffective assistance of counsel on direct appeal. Knight v. State, 394 So.2d 997 (Fla. 1981).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nOn the same day that his appeal was denied, Muhammad filed a petition for writ of habeas corpus and a motion for stay of execution in the United States District Court. The district court granted the stay, retained jurisdiction over the petition and ordered Muhammad to return to state court to exhaust his claims. Pursuant to this directive, Muhammad filed a 3.850 motion with the trial court on March 26, 1981. The motion was denied on August 25, 1981, and the Supreme Court affirmed. Muhammad v. State, 426 So.2d 533 (Fla. 1982), cert. denied, 464 U.S. 865, 78 L. Ed. 2d 174, 104 S. Ct. 199 (1983). Nine points were raised in this appeal. The court found that four of the issues had been previously decided, found that two of the issues were procedurally barred and found three of the issues to be meritless.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Of the three issues addressed on the merits, only the question of ineffective assistance of trial counsel was dealt with at length.\n\nWith the exhaustion requirement satisfied, Muhammad pursued his previously filed federal petition, which raised thirteen bases for relief.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e A United States Magistrate conducted the initial review of the petition and recommended that it be denied. Objections were filed to the magistrate's report \u0026 recommendation, and as a part of the district court's de novo review of the petition, it held an evidentiary hearing on the issue of ineffective assistance of counsel at the penalty phase. On June 27, 1986, the district court entered an order dismissing Muhammad's petition for writ of habeas corpus. This order was accompanied by an exhaustive memorandum opinion.\n\nOn appeal, Muhammad raises the following seven claims: (1) ineffective assistance of counsel at guilt and penalty phases of trial; (2) denial of a fair trial based on failure to change venue and inadequate voir dire; (3) infringement of the right to present a defense by improper exclusion of evidence of Muhammad's insanity; (4) denial of due process right to unanimous verdict because of ambiguity in theory of prosecution and in instructions on underlying felonies; (5) denial of right to fair sentencing hearing because of prosecutor's comment on Muhammad's right to remain silent and improper shifting of burden of proof; (6) right to an evidentiary hearing on the claim that the death penalty in Florida has been imposed in an arbitrary and discriminatory manner; and (7) denial of right to an individualized sentencing determination based on failure to consider non-statutory mitigating circumstances.\n\nAs to the first six of these grounds, we are satisfied that the district court handled each one properly. Accordingly, we affirm the denial of relief on these claims based on the district court's careful, detailed, 123-page opinion, attached hereto as an appendix.\n\nMuhammad's last claim, however, concerning restrictions on the consideration of non-statutory mitigating evidence presents a more difficult issue. The district court decided this case prior to the United States Supreme Court's decision in Hitchcock v. Dugger, 481 U.S. 393, 107 S. Ct. 1821, 95 L. Ed. 2d 347 (1987). In Hitchcock, the Supreme Court reversed this Court's in banc decision in Hitchcock v. Wainwright, 770 F.2d 1514 (1985) and held that, on the record of the case, it appeared clear that the jury had been restricted in its consideration of non-statutory mitigating circumstances in contravention of Lockett v. Ohio, 438 U.S. 586, 57 L. Ed. 2d 973, 98 S. Ct. 2954 (1978). Hitchcock \"breathed new vitality into claims based on the exclusion of non-statutory mitigating factors. . .,\" Hargrave v. Dugger, 832 F.2d 1528, 1533 (11th Cir. 1987) (in banc), petition for cert. filed, U.S.L.W. (March 2, 1988), and so we must examine Muhammad's Lockett claim anew.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nThis Court reaffirmed the case-by-case approach to the evaluation of an alleged Lockett violation in Hitchcock v. Wainwright, 770 F.2d 1514 (1985) (in banc). Because the United States Supreme Court adopted this case-by-case approach in evaluating Hitchcock's Lockett claim, albeit with different results than were reached in this Court, it would appear that the Supreme Court's reversal of Hitchcock on the merits does not affect the viability of the case-by-case approach. Compare Hitchcock v. Dugger, 481 U.S. 393, 107 S. Ct. 1821, 1823-24, 95 L. Ed. 2d 347 (1987) with Hitchcock, 770 F.2d at 1516-18.\n\nThis approach requires a court to \"consider the status of Florida's law on the date of sentencing, the record of the trial and sentencing, the jury instructions requested and given, post-trial affidavits or testimony of trial counsel and other witnesses and proffers of non-statutory mitigating evidence claimed to have been available at the time of sentencing.\" Hitchcock, 770 F.2d at 1517. Consideration of these matters in the instant case, and comparison of the record herein with that in Hitchcock, see Hargrave v. Dugger, 832 F.2d 1528 (11th Cir. 1987) (In banc) (suggesting that the Lockett claims in pre-Lockett cases should be evaluated by \"matching the record\" with Hitchcock), petition for cert. filed, U.S.L.W. (March 2, 1988), reveal a clear Lockett violation.\n\nThe following chart is illustrative:\n\nHitchcock v. Dugger Muhammad v. Dugger\n\nInstructions The jury was told by the trial judge At the commencement\n\nof the sen-\n\nto Jury that he would instruct them \"on tencing hearing the\n\ncourt instruct-\n\nthe factors in aggravation and miti- ed the jury that it\n\nwould \"receive\n\ngation that you may consider testimony or evidence\n\nfrom either\n\nunder our law.\" The judge then side concerning\n\ninstruct-\n\naggravating or mit-\n\ned them that \"[t]he mitigating igating circumstances.\"\n\nThe court\n\ncircumstances which you may consid- then stated that\n\n\"aggravating cir-\n\ner shall be the following. . .\" (list- cumstances shall\n\nbe limited to the\n\ning the statutory mitigating cir- following . . .\"\n\n(listing\n\nthe statutory\n\ncumstances). Hitchcock v. Dug- aggravating\n\ncircumstance-\n\nger, 107 S. s) and \"[t]he mitigating\n\nCt. at 1824.\n\ncircumstances\n\nwhich you may\n\nconsider, if estab-\n\nlished by the\n\nevidence, are as fol-\n\nlows . . .\" (listing\n\nthe statutory mit-\n\nigating circumstances).\n\nComments In his sentencing order, the judge Before the jury\n\nwas called at the\n\nof found that \"there [were] insuffi- penalty phase, the\n\ntrial judge made\n\nJudge cient mitigating circumstances as the following\n\ncomment to the attor-\n\nenumerated in Florida Statute neys: \"[I]t's the\n\nState's burden to\n\n921.141(6) to outweigh the aggra- produce or . . .\n\nconvince the jury\n\nvating circumstances.\" (Emphasis and the Court of\n\nthe aggravating\n\nadded by United States Supreme circumstances.\n\nThen it is the duty\n\nCourt). The judge described the of the defense\n\nto do two things:\n\nsentencing process as follows: \"In First, to show\n\nsome mitigating cir-\n\ndetermining whether the defendant cumstances set\n\nforth in the stat-\n\nshould be sentenced to death or life ute. In addition\n\nto show that, to\n\nimprisonment, this Court is man- show that those\n\nmitigating circum-\n\ndated to apply the stances overcome\n\nfacts to certain the force and ef-\n\nenumerated 'aggravating' and fect of the\n\naggravating circum-\n\n'mitigating' circumstances.\" (Em- stances.\" (Emphasis\n\nadded). In\n\nphasis added by United States Su- the judge's sentencing\n\norder, he re-\n\npreme Court). Hitchcock v. Dug- fers only to statutory\n\nmitigating\n\nger, 107 S. factors.\n\nCt. at 1824.\n\nComments The prosecutor told the jury that it In voir dire, the\n\nprosecutors made\n\nof was \"to consider the mitigating cir- the following objection\n\nto defense\n\nProsecutor cumstances and consider those by counsel's question\n\non the ability of\n\nnumber.\" The prosecutor then went down jurors to follow the\n\njudge's instruc-\n\nthe statutory list item by item, tions on mitigating\n\ncircumstances:\n\narguing that only one statutory \"I object to that,\n\nfactor--\n\nunless [defense\n\npetitioner's youth--was applicable. counsel] advises\n\nthe jury that the\n\nHitchcock Court will advise\n\nv. Dugger,\n\n107 S. Ct.\n\nat 1824.\n\nthe jury as to\n\nx-number of possible\n\nmitigating cir-\n\ncumstances. . . . and\n\nnames each\n\none.\" During argument\n\nin the pen-\n\nalty phase, the\n\nprosecutor stated\n\nthat \"there are two\n\nmitigating cir-\n\ncumstances of the\n\nseven that are\n\nin the law that I\n\nthink you might\n\nreasonably be asked\n\nto consider.\"\n\n(Emphasis added).\n\nComments/ Defense counsel introduced non- Defense counsel\n\ntestified at a hear-\n\nActions of statutory mitigating evidence and ing on Muhammad's\n\nineffective-\n\nDefense referred to it in his closing argu- ness claim that he\n\nwas \"sure that\n\nCounsel ment. While stressing the evi- the Judge was not\n\ngoing to confine\n\ndence relating to statutory mitigat- us to testimony\n\nstrictly in adher-\n\ning factors, he told the jury that in ence with the\n\nstatutory mitigating\n\nreaching its sentencing decision it circumstances\" and\n\nit could be ar-\n\nwas to \"look at the overall pic- gued that he did\n\npresent non-statu-\n\nture. . . . consider everything to- tory mitigating\n\nevidence by intro-\n\ngether. . . . consider the whole pic- ducing a pre-sentence\n\ninvestigation\n\nture, the whole ball of wax.\" report that had once\n\nbeen prepared\n\nHitchcock v. Dugger, on Muhammad. In\n\n107 S. Ct. at his argument\n\n1823-24. at the penalty phase,\n\nhowever, de-\n\nfense counsel made\n\nthe following\n\nstatement: \"Now\n\nhis Honor has\n\nread to you the\n\nmitigating factors\n\nthat you are\n\nrequired by law to\n\nconsider, and there\n\nare two miti-\n\ngating factors that\n\nI want to sug-\n\ngest to you that are\n\nappropriate as\n\nI try to reason with\n\nyou.\" (Empha-\n\nsis added).\n\nIn this case, like Hitchcock, the statements of the trial judge, the prosecutor and defense counsel suggest a shared perception that statutory mitigating factors were all that the jury was required to consider. Since a Lockett error is thus apparent, the Court must next consider the Government's contention that such error is harmless in this case.\n\nThis Court has held that a Lockett violation can be harmless. See Clark v. Dugger, 834 F.2d 1561, 1569-70 (11th Cir. 1987), cert. denied, 485 U.S. 982, 108 S. Ct. 1282, 99 L. Ed. 2d 493 (1988). The precise guidelines for determining harmlessness in this context, however, have not been settled. Cf. Magill v. Dugger, 824 F.2d 879, 893-95 (11th Cir. 1987) (holding that Lockett violation did not constitute harmless error); Armstrong v. Dugger, 833 F.2d 1430, 1436 (11th Cir. 1987) (noting that Supreme Court rejected harmless error contention involving cumulative, non-statutory mitigating evidence in Skipper v. South Carolina, 476 U.S. 1, 90 L. Ed. 2d 1, 106 S. Ct. 1669 (1986); stating in dicta that it was \"doubtful\" that Lockett violation in this case was harmless); Ruffin v. Dugger, 848 F.2d 1512, 1519-20 (11th Cir. 1988) (Tjoflat, J. concurring in part and dissenting in part) (petitioner \"not entitled to a new sentencing hearing if the Lockett error was harmless beyond a reasonable doubt.\"). See also Hargrave v. Dugger, 832 F.2d 1528 (11th Cir. 1987) (in banc) (granting relief on Lockett claim without addressing issue of harmless error) cert. denied, 489 U.S. 1071, 109 S. Ct. 1353, 103 L. Ed. 2d 821, 57 U.S.L.W. 3588 (1989); Messer v. Kemp, 831 F.2d 946 (11th Cir. 1987) (same), cert. denied, 485 U.S. 1029, 108 S. Ct. 1586, 99 L. Ed. 2d 902 (1988).\n\nThe State argues that the Lockett error was harmless in this case because so many aggravating factors were found (four) that no amount of non-statutory mitigating evidence could change the result in this case. No authority has been furnished for this proposition and it seems doubtful that any exists. The State's theory, in practice, would do away with the requirement of an individualized sentencing determination in cases where there are many aggravating circumstances. It is this requirement, of course, that is at the heart of Lockett and its progeny. See Lockett v. Ohio, 438 U.S. 586, 604, 57 L. Ed. 2d 973, 98 S. Ct. 2954 (1978) (\"'in capital cases the fundamental respect for humanity underlying the Eighth Amendment . . . requires consideration of the character and record of the individual offender and the circumstances of the particular offense . . .,\" quoting Woodson v. North Carolina, 428 U.S. 280, 304, 96 S. Ct. 2978, 49 L. Ed. 2d 944 (1976)).\n\nWhile we are not prepared to definitively state what might constitute harmless error in the Lockett context, it is clear that harmless error cannot be made out simply because multiple aggravating circumstances exist in a given case. Since the State offers no other arguments to support its contention that the violation of Lockett in this case is harmless, relief must be granted.\n\nWe therefore remand this case to the district court with instructions to enter an order granting the application for writ of habeas corpus, unless the State within a reasonable period of time either resentences Muhammad in a proceeding that comports with Lockett or vacates the death sentence and imposes a lesser sentence consistent with law.\n\nAFFIRMED IN PART, VACATED IN PART, AND REMANDED WITH INSTRUCTIONS\n\nAPPENDIX\n\nUNITED STATES DISTRICT COURT SOUTHERN DISTRICT OF FLORIDA\n\nNo. 81-391-CIV\n\nJune 27, 1988, Filed\n\nASKARI ABDULLAH MUHAMMAD, f/k/a THOMAS KNIGHT, Plaintiff v. LOUIE L. WAINWRIGHT, etc., Defendants\n\nTHIS CAUSE comes before the Court upon the Petition for Habeas Corpus filed by ASKARI ABDULLAH MUHAMMAD, f/k/a THOMAS KNIGHT. The Court has reviewed the record, held two conferences and an evidentiary hearing, reviewed memoranda provided by the parties, and is otherwise advised in the premises.\n\nThe Memorandum Opinion of the Court is set forth below. The Petition for Writ of Habeas Corpus is denied for the reasons stated.\n\nBACKGROUND\n\nThe Circuit Court for the Eleventh Judicial Circuit in and for Dade County adjudged Askari Abdullah Muhammad (f/k/a Thomas Knight) guilty of two counts of first degree murder and sentenced him to death. Petitioner's execution was to occur on March 3, 1981, at 7:00 a.m. On February 24, 1981, Petitioner filed his Petition for Writ of Habeas Corpus in this district court. Petitioner filed his application for Stay of Execution on the following day, February 25, 1981. On February 26, 1981, United States District Judge Joe Eaton granted Petitioner's motion to stay his execution. By Order of March 9, 1981, the Court retained jurisdiction over the matter.\n\n1. State action--exhaustion of state remedies\n\nPrior to filing his Petition in this district court, Petitioner appealed his conviction to the Florida Supreme Court. By Order of September 30, 1976, the Florida Supreme Court affirmed the Circuit Court's conviction and death sentence. See Knight v. State, 338 So.2d 201 (Fla. 1976). On February 24, 1981, the Florida Supreme Court declined to grant Petitioner's state habeas petition. See Knight v. State, 394 So.2d 997 (Fla. 1981). The state case was in this posture when Petitioner filed his federal petition for writ of habeas corpus in this district court. While retaining jurisdiction over the matter, Judge Eaton ordered Petitioner to return to state court to litigate an unexhausted issue pertaining to Petitioner's claim that he received ineffective assistance of trial counsel. Eventually, the Florida Supreme Court heard Petitioner's post conviction claim and on December 16, 1982, that Court affirmed the trial court's denial without hearing Petitioner's motion to vacate judgment and sentence. See Muhammad v. State, 426 So.2d 533, 538 (1982), reh. den'd, 426 So.2d 533 (1983), cert. denied., 464 U.S. 865, 104 S. Ct. 197, 78 L. Ed. 2d 173, reh. denied, 464 U.S. 1013, 104 S. Ct. 539, 78 L. Ed. 2d 718 (1983).\n\nHearings on the federal Petition for Writ of Habeas Corpus were held on June 12 and November 27, 1984. On August 14, 1985, United States Magistrate Charlene Sorrentino issued a report in the instant matter. Thereafter, Petitioner filed his objections to that report on December 6, 1985. Each of Petitioner's several bases for issuance of the writ will be discussed hereafter.\n\nI. PRETRIAL PUBLICITY\n\nA. Need for Evidentiary Hearing\n\nPetitioner Muhammad contends as one of the grounds for granting the Writ of Habeas Corpus that the pretrial publicity generated by the news media was so pervasive that prejudice to his ability to receive a fair and impartial trial in Dade County should be presumed. Petitioner also claims that the trial court made two errors at the end of the voir dire. The first was the trial court's denial of his motion for change of venue. The second was his request for additional peremptory challenges.\n\nThe Florida Supreme Court twice addressed petitioner's contentions, denying relief each time. On Petitioner's first appeal of his conviction, the Court noted that \"the trial court 'expressly determined that no showing of prejudice had been made. Additionally, we note that the trial judge was extremely liberal in excusing jurors for cause in order that an impartial trial would be secured,'\" ( Knight v. State, 338 So.2d 201 (Fla. 1976) at 203) and \"appellant 'has failed to prove that he did not receive a fair and impartial trial and that the setting of this trial was inherently prejudiced.'\"\n\nOn a later review of the issue, the Florida Supreme Court found:\n\nThe record shows that trial defense counsel did present evidence of the pretrial publicity in support of the motion for change of venue. The denial of the motion for change of venue was reviewed and affirmed on appeal. The record also shows that defense counsel questioned prospective jurors extensively regarding any influence the pretrial publicity may have had on them.\n\nMuhammad v. State, 426 So.2d 533 (Fla. 1982) at 537. It is thus apparent that petitioner's claims in this pretrial publicity issue have been exhausted in state proceedings and are properly before this Court.\n\nPetitioner has requested an evidentiary hearing to explore the merits of his pretrial publicity claim. The standards governing whether the federal district court must hold an evidentiary hearing to determine the merits of a habeas corpus petition of a person in state custody are set forth in Townsend v. Sain, 372 U.S. 293, 83 S. Ct. 745, 9 L. Ed. 2d 770, and Thomas v. Zant, 697 F.2d 977 (11th Cir. 1983). Petitioner urges this court to grant him an evidentiary hearing on his pretrial publicity claim on the grounds that the material facts relevant to the pretrial publicity generated by his capture, escape and recapture \"were not adequately developed at the state court hearing.\" See 372 U.S. at 313, 83 S. Ct. at 757. I agree with the Report of the Magistrate which determined that petitioner did receive an adequate hearing on the issue in the trial court.\n\nAt the close of the jury selection defense counsel for petitioner proffered some of the evidence of the pretrial publicity from which, the defense urged, prejudice could be presumed. The proffer was not made in the presence of the jury. Defense counsel began by encapsulating film clips shown on the television newscast. The defense's summary of the television coverage of petitioner's alleged crimes included brief descriptions of the persons interviewed, the running time of the film clips, the channels on which they were shown, the times of day at which they were shown, the dates of the airings, and the estimated numbers of persons in the viewing audiences.\n\nDefense counsel then repeated the process using the newspaper articles about the Petitioner and the crimes. Beginning by giving the dates of the articles, defense counsel's proffer stated whether the articles appeared on the front page, in which newspaper the articles appeared, the topics of the articles (e.g., the specific crimes, the general articles on the insanity defense, other crimes allegedly committed by the defendant, etc.), and the circulation figures of the newspapers. Defense counsel specifically mentioned certain allegedly prejudicial descriptions of the defendant which had appeared in the news stories. The trial judge heard the cumulative proffer but commented that the jurors had answered that they could give the defendant a fair and impartial trial and that the court was relying not only upon their answers on voir dire, but their expressions and mode of answering. The court also noted that there had not been great discussion in the press as to the nature of the evidence against Petitioner.\n\nThis Court concludes that the proceedings at the state trial level were adequate to develop the factual predicate for petitioner's pretrial publicity claim. See Coleman v. Zant, 708 F.2d 541 (11th Cir. 1983) at 547 (\"the content of and audience for television/radio media's coverage are indeed 'indispensable to a fair, rounded development of the material facts'\") (quoting Townsend v. Sain, 372 U.S. at 322, 83 S. Ct. at 762).\n\nFurther, the Court has reviewed an extensive indexed collection of television news scripts and newspaper articles compiled by petitioner and appended to his request for evidentiary hearing. Thus, the factual matter upon which the pretrial publicity claim rests is before the Court. This Court is not faced with having to \"rel[y] on the voir dire transcript in the absence of a well-rounded description of the local television and radio coverage.\" Coleman v. Zant, 708 F.2d at 547. Accordingly, the Court concludes that since the material facts were addressed at the state proceeding, and a full record with documentation of the media coverage is before the Court, an evidentiary hearing on the pretrial publicity claim is unnecessary and petitioner's request for such hearing is denied. The Court now examines the media coverage itself to determine whether it can be found to have prejudiced petitioner's trial.\n\nB. The Media Coverage\n\n1. Television\n\nThe Court first examines the television news scripts submitted by petitioner. The initial coverage which aired on July 17, 1974, the day of the Gans murders, cannot be said to have been unduly prejudicial because it consisted primarily of factual news reporting. Petitioner was referred to as an \"alleged\" killer or a \"suspect.\" One clip, originating from the suspect's neighborhood and shown on Channel 10, the ABC local station, mentioned that the suspect was from a \"black\" section of Opa Locka and had marital problems, but reported also that the suspect was liked by his neighbors. The same clip reported that the suspect was described by his neighbors as one who loved children. The clip concluded with the on-scene reporter stating that \"everyone I talked to said the same thing: 'I can't believe he would do something like this.'\"\n\nAnother film that was shown on Channel 10 on July 17th at 6:00 p.m., and 11:00 p.m., reported that a man is in jail charged with a \"brutal machine-gun slaying.\"\n\nA news story which aired on July 17th on Channel 7, the local NBC affiliate, reported that the suspect \"surrendered meekly\" and that \"WCKT newsfilm showing the suspect's face has been withheld at the request of the Public Safety Department . . . until witnesses can try to identify him in a police lineup.\"\n\nAnother July 17th newscast referred to the victims as a \"wealthy Miami industrialist and his wife.\" Later in the broadcast, the petitioner was referred to as an \"unidentified black man,\" \"the abductor,\" \"the kidnapper,\" and \"the killer.\" Describing the capture, the broadcast mentioned that \"the young black man with his hair in numerous braids seemed relatively unconcerned and even smiled a few times as he was put into a car for a trip to Jackson Memorial Hospital.\"\n\nA newscast which aired on July 17th reported that Thomas Knight \"was found with a weapon and the money.\"\n\nIn a newscast of July 17th it was reported that \"a few teenage boys said Thomas Knight was nuts, dumb . . . but mostly people said he spent time on his car.\"\n\nOn July 18th, a news brief reported that \"the suspect in the Gans kidnap murder is picked out of a lineup and arraigned.\" The same news show concluded by mentioning that \"Florida Attorney General Robert Shevin reacted to the kidnap murder today. . . calling on the Supreme Court to reinstate the death penalty.\"\n\nA July 18th newscast show at 6:00 p.m. on Channel 7, the NBC affiliate, focused on the arraignment and stated that \"the suspect appeared rather nonchalant as he was escorted back to his cell . . . Knight appeared in a police lineup and according to Metro Public Safety officials -- was positively identified as the man driving around town yesterday in the Gans' (sic) auto.\" The same newscast also reported that \"Knight's co-workers say he was basically a loner . . . he was also known in the neighborhood as a quiet guy. Knight's arrest record is quite extensive, dating back to 1965 when he was placed on five years probation for a breaking and entering conviction. His (sic) had another bout with police last month when he was arrested and charged with grand larceny.\"\n\nThe remainder of the television coverage until September 20, 1974, has been reviewed by the Court. I do not find anything unduly prejudicial to the defendant in this period of television coverage, as whatever scant coverage existed focused on the factual aspects of the crime and not upon the guilt or innocence of Petitioner.\n\nPetitioner became newsworthy again when he, along with ten other prisoners, escaped from the Dade County Jail on September 20, 1974. A newsclip that aired on September 20th at 6:00 p.m. reported that police were searching for nine of eleven men who escaped from the Dade County Jail, and that the men were considered dangerous.\n\nAn editorial shown on Channel 4, the CBS affiliate, on September 20th, complained about the lax security at the jail that allowed eleven prisoners to escape. The editorial mentioned that \"One still on the loose is charged with the murder of Sidney and Lillian Gans two months ago . . . one of the most frightening crimes in recent local history.\"\n\nAnother September 20th newscast described the escape, reporting that \"5 prisoners are still at large, including Thomas Knight, the alleged killer of industrialist Sidney Gans and his wife. All are described as extremely dangerous.\"\n\nA newsclip which aired on September 20th at 11:00 p.m., mentioned that \"Knight might have been the coordinator of the jailbreak.\"\n\nA September 21st newsclip which aired at 11:00 p.m. on Channel 7 reported that \"among the 3 inmates still missing is 23-year old Thomas Knight of Opa Locka. Knight is charged with two counts of murder in the kidnap-slaying of wealthy businessman Sydney Gans and his wife. Police say Knight may have been the leader of the escape. At this hour, police have set up a perimeter in the area of N.W. 27th Avenue as Knight was positively identified by 15 customers as the man who held up a food store in the area.\"\n\nAnother September 20th newscast reported that \"the leader [of the jailbreak] and most sought-after one, Thomas Knight, continues to follow his police predicted behavior: elusive and smart.\" The newscast then briefly described a holdup in which Knight was allegedly involved earlier that day.\n\nAnother September 21st newscast which aired at 11:00 p.m. on Channel 7 gave a description of the holdup that Knight allegedly committed.\n\nWhile Knight was at large, there was coverage of the escape which featured on occasion \"Wanted\" pictures of Knight and brief updates of reported sightings of him. Some of this coverage mentioned in passing the Gans murders, but the Gans murders and the guilt or innocence of Knight therein was not made the focus of the Knight escape reporting.\n\nOn September 25th a brief mention was made of a $500.00 reward offered to anyone who turned in Thomas Knight.\n\nOn September 30, 1974, it was twice briefly reported that \"today Dade State Attorney Richard Gerstein announced a reward for information leading to Knight's arrest. Gerstein says an anonymous donor has promised 2,500 dollars for information leading to Knight's arrest.\"\n\nOn October 16th, it was reported at 11:00 p.m. that Knight had been the subject of an intensive manhunt that day after he was reputedly spotted in South Dade. The newscast reported that \"Knight is the most sought-after man in Dade County. He's wanted to stand trial for the brutal slaughter of a wealthy Miami couple.\"\n\nOn November 13th it was reported on the 6 o'clock news that \"the Miami FBI office wants accused slayer Thomas Knight placed on the 10-most-wanted list . . . He's now wanted by the FBI for unlawful flight to avoid prosecution. Georgia officials want Knight in connection with robbery and homicide. An accomplice of Knight's was captured in that case . . .\".\n\nOn December 31, Channel 4 reported on Knight's capture, stating \"when Knight escaped from the Dade County Jail in September, he was described as cunning and vicious. But today, at a federal court hearing in Orlando, he seemed confused and was caught in a simple error.\" The report also mentioned that \"the FBI says Knight is wanted for a slaying in Georgia and for several robberies, all of which occurred while he was a fugitive.\"\n\nOn January 2, 1975, Channel 7 reported on the transfer of Knight from Orlando to Miami, and stated \"Knight smiled and made obscene gestures to newsmen as he entered the Dade Jail. Knight was held in solitary confinement in the Orlando jail, and jail attendants said he went in a rampage last night . . . tore up be[ds] and he attempted to set the mattress in his c[ell] on fire.\" The report mentioned in one line the murder of the Ganses and also reported that \"he is also wanted in Cordele, Georgia, where police say he shot and killed a liquor store clerk during a robbery.\"\n\nThe remainder of the television coverage is not remarkable.\n\n2. Newspapers\n\nOn July 18 the Miami Herald ran a front page article on the murders. The headline reported \"Dade Couple Kidnapped and Shot To Death.\" There were two portrait photos of the Ganses and a picture which showed Knight's head as he was ducking into a police car. The article contained a detailed factual account of the crime.\n\nAnother Miami Herald article which ran on July 18 on page 28 was headlined \"Good Worker, But Emotional.\" The article mentioned that a hat, which co-workers said belonged to Knight had been found in the executive parking lot at Sidney Gans's business. The article reported that \"Knight had served time in prison for a Fort Pierce burglary conviction and was awaiting trial in Dade County on a June 15 larceny arrest.\" The article quoted one of Knight's co-workers as stating that Knight was \"a good worker -- a very good worker . . . He was pretty witty - he joked a lot, laughing all the time.\" The article reported that Knight often complained to his co-workers about \". . . racism, because Knight felt there were a lot of anti-blacks.\" Another co-worker was quoted as stating that Knight was \"a very good worker\" with \"a very strong character,\" but he could be \"very emotional.\" The co-worker said that Knight once told him he could be dangerous when mad since he was a karate expert. The article concluded by noting that \"co-workers as well as Knight's neighbors in Opa Locka expressed shock that he had been charged with the murders.\"\n\nAn article which appeared in the Miami News on July 18 was headlined \"8 of 11 Identify Murder Suspect.\" The article briefly described the crime and Knight's earlier arrest for grand larceny for stealing roofing tiles from an earlier employer. The earlier employer was reported to have described Knight as a hardworking, hot-tempered person who had trouble getting along with others.\n\nA front-page article in the Miami Herald on July 19 was headlined \"Kidnap-Death Suspect Was Out on Bond.\" The article rehashed the events surrounding the crime. It also consisted mainly of burglary charges. One of Knight's former probation officers recalled Knight as \"arrogant, with a chip on his shoulder.\" A former employee described Knight as a \"hothead.\" The article reported that Knight's neighbors described him \"as a quiet man who liked to tinker with his 1965 Plymouth.\"\n\nA July 19 article appearing in the Miami News was headlined \"Gans Liked Giving Man With Record Second Chance.\" The article described the crime and Knight's previous work problem at Gory Associated Industries, where he was fired after allegedly stealing a truckload of roof tile. The article related that Knight had been picked out of a police lineup by several police witnesses, but others could not be positive in their identification.\n\nAnother July 19 Miami News article was headlined \"Murder-Kidnap Suspect Faces Jury.\" That article described the crime factually.\n\nA July 27th article was headlined \"Slaying Suspect Knight Held; Trial Heads to Circuit Court.\" The article briefly described the crime and Knight's preliminary hearing.\n\nThe next important spate of newspaper publicity was generated upon Knight's escape from the Dade County Jail. On September 23, the front page of the local section of the Miami Herald was headlined \"Thomas Knight Tough, Smart, Free.\" The article briefly described the jailbreak and then reported the feelings of Knight's neighbors and his mother. The article reported that \"accused kidnap-murderer Thomas Knight 'could have been anything he wanted,' a friend says.\" A neighbor was quoted as stating \"once I would have trusted Thomas Knight with my apartment or my car, now I don't trust him as far as I can spit.\" The article continued by stating \"it was a shock when Knight, 23, was charged with the kidnap-murder last July of a North Miami industrialist and his wife. \"I just couldn't believe it was the right Thomas Knight, said a neighbor for whom Knight once fixed a sewing machine.\" Later in the article it was reported that \"he (Knight) chose escape, says a friend who talked with Knight after his arrest, because he saw himself in the electric chair. The things that scared him most were, one, (State Attorney Richard) Gerstein prosecuting, two, the publicity about the case. Thomas thought that there was no way to get a fair trial in Dade County or in Florida.\"\n\nThe same article, which is reported in depth here because it is one of the main sources for references to Knight that does not focus solely on the facts of the crime or the escape, continues \"like many felons Knight had a deep interest in law. Was a graduate of the Raiford Bar Association, you might say.' He reportedly wrote from memory a complete transcript of his hour-and-a-half pre-trial hearing. He also, a source said, wanted to direct his own trial.\"\n\nThe same article reported that \"his tested IQ was about 100,' - average nationally, but for a disadvantaged student, indifferent to school, likely to indicate exceptional ability.\" The article reported that Knight's mother said \"I think it's something wrong with his head . . . I just pray to God the police don't kill him. If I could tell him something it would be to tell him to give up. Maybe then they would have mercy and send him some place to get some help about his head.\"\n\nThe article reported that \"neighbor Art Doyle, who used to drink beers with Knight, recalls sharing complaints about a leaking roof. Knight fixed it. He [Knight] knew nothing about cars, another neighbor said, but learned by taking apart his beige 1965 Plymouth.\"\n\nThe article briefly mentioned that Knight's life appeared to be straightening out after arrests earlier in his life.\n\nThe article reported that \"Beatrice [Knight's wife] was attractive, Knight jealous. She left him shortly before he allegedly killed Sydney Gans, owner of Sydney Bag and Paper, and Gans' wife, Lillian. When Beatrice left, My Lord, something must have exploded inside him, a neighbor said.\"\n\n\"Knight was also frustrated about work, a friend said. 'Thomas used to say he'd go to work on time, do it, but no matter how good he did, he never moved up. \"Some cracker comes in with a diploma, first day on the job, and moves up ahead of you,\" he'd say.'\"\n\nAn article which appeared in the Miami News on September 23rd was headlined \"Everyone, Everywhere 'Sees' Fugitive Knight.\" The article reported numerous false sightings of the fugitive but did not contain material particularly prejudicial to Knight.\n\nAn article which appeared in the September 30th Miami Herald, on the front page of the local section, was headlined \"Manhunt: Not Glamorous, Just Tiring.\" The article reported that detectives who had helped capture Knight initially were also working to recapture him. The article generally described the manhunt by police and the numerous false sightings of Knight called in to police. A photograph of a \"Wanted\" poster for Knight was included.\n\nThe few articles about the continuing manhunt, which ran between September 30th and December 31st, were primarily factual. Knight was recaptured on December 31, 1974, in New Smyrna Beach, Florida. Periodically, articles detailing his recapture and his fugitive time appeared in the newspapers. An article which appeared in the December 31st Miami Herald was headlined \"Fugitive Knight Seized in Raid at New Smyrna.\" The article was a factual account of the police and FBI capture of Petitioner in a boarding house in New Smyrna Beach. While the article essentially reported the capture, it did recount the details of the Gans murders, albeit briefly and also factually.\n\nAn article which appeared in the Miami News on January 3, 1975, was headlined \"Accused Kidnapper - Slayer placed in Dade Safety Cell.\" A photograph of a smiling Knight flanked by guards also appeared and was captioned \"Laughing Knight escorted by deputies.\"\n\nThe article reported that \"Thomas Knight, laughing and waving obscenely at photographers, has been brought back in the Dade County Jail to await trial on murder and kidnapping charges.\" The article briefly recounted in two sentences the Gans murders. The article also reported that \"Knight is also charged with the October murder of a Georgia liquor store clerk.\" A Georgia Sheriff was quoted as stating \"We want him (Knight) back up here very badly, after Dade County has a crack at him.\"\n\nAn undated January 1975 article, presumably from January 3rd or 4th, appeared in the Miami Herald headlined \"Georgia Police Also Want Knight.\" The article reported that a suspected accomplice was willing to testify that Knight was the triggerman in the Georgia shooting. The article briefly touched upon the Gans crimes, the jailbreak, Knight's fugitive time, and his prior record. The information in the article was rather detailed and factual, except for a brief section which inquired \"How did Knight manage to stay free for three months despite a $3,000 reward on his head and nationwide notoriety as one of the FBI's 10 Most Wanted Criminals? And did his plans include a future bank robbery and the abduction of a police chief, as notes seized in his second-floor tenement seemed to indicate?\"\n\nAn article appearing in the Miami Herald around the same period in January 1975 was headlined \"17 of Knights's 'Free Days' Spent in Arkansas Jail.\" A photo of Knight was shown with the caption \"Cocky and Boastful Knight Is Returned to Dade Jail.\" In the article, Knight is quoted extensively as having hidden his identity from Arkansas police who had jailed him for trespassing:\n\n\"I made a fool out of the [Arkansas] police department and they showed how stupid they are. They think they're so smart and they're not.\"\n\n\"They arrested me for trespassing on a train and asked me for my Social Security Number. I told them I never had one.\n\n\"They asked me for my driver's license. I said I didn't have one. They wanted to know my mother's name. I said I didn't have a mother. They asked me for my father's name and I said I didn't know.\n\n\"They said, 'well who raised you?' I said I came from an orphan's home. When they asked what school I went to, I told them Black Muslim School. I always give a phony name.\n\n\"I'm glad I can use my own name now. My wife is here in Miami. I love her very much. I kept trying to call her and could never get through. Somebody told me they had her in jail. That's the only reason I swung back this way. I'm glad I got caught. I'll have a chance to see my wife. I got real lonesome and I wanted to see her.\"\n\nThe remaining articles which appeared up until Knight's trial began were not particularly significant. There was an article which rehashed Knight's alleged shooting in Georgia, an article about the similarity of the cell in which he was held in at Orlando to the one he escaped from in Miami, an article about Knight's acceptance of his court-appointed attorney, and a brief mention of a robbery charge, against Knight, which was dismissed. The articles were primarily factual accounts.\n\nThere were several articles which appeared during the trial, but these articles focused on an error of the trial judge, the outbursts made by Knight in the courtroom, Knight's attempts to fire his lawyers, and an editorial denouncing the death penalty as unfair. The record reflects that the judge repeatedly directed that the sequestered jury was not to read about, listen to, watch or discuss any aspect of the Knight case. There is no indication that any juror did come into contact with any of the publicity generated during the trial. In any event, the Court specifically finds that the publicity generated during the trial was not legally prejudicial to the Petitioner. In fact, the most noteworthy publicity during this period was a long editorial in the April 24, 1975 Miami News which discussed the unfairness of the death penalty as applied to Thomas Knight in particular and to poor young blacks in general.\n\n3. The Applicable Law\n\nIn essence, the right to jury trial guarantees to the criminally accused a fair trial by a panel of impartial, indifferent jurors. Irvin v. Dowd, 366 U.S. 717, 6 L. Ed. 2d 751 at 755, 81 S. Ct. 1639 (1961). Where a petitioner adduces evidence of inflammatory, prejudicial pretrial publicity that so pervades or saturates the community as to render virtually impossible a fair trial by an impartial jury drawn from that community, jury prejudice is presumed and there is no further need to establish bias. Mayola v. State of Alabama, 623 F.2d 992 (5th Cir. 1980) at 997.\n\nDue process required the trial court to grant a defendant's motion for change of venue where the trial court was unable to seat an impartial jury because of prejudical pretrial publicity of an inflamed community atmosphere. Rideau v. Louisiana, 373 U.S. 723, 726, 83 S. Ct. 1417, 1419, 10 L. Ed. 2d 663 (1963).\n\nThe burden placed upon a petitioner to show that pretrial publicity deprived him of his right to a fair trial is an extremely heavy one. Coleman v. Kemp, 778 F.2d 1487 (11th Cir. 1985) at 1537. \"To satisfy his burden even in . . . sensational cases, the petitioner must, therefore, demonstrate that the populace from which his jury was drawn was widely infected by a prejudice apart from mere familiarity with the case.\" Mayola, 623 F.2d at 999.\n\nPetitioner relies on several famous cases in which the pretrial publicity was found to have prejudiced the right of the defendants therein to a fair trial by a panel of impartial indifferent jurors. In Irvin v. Dowd, supra, the Supreme Court found that the pretrial publicity of the case had indeed prejudiced the defendant's right to a fair trial. Newspaper headlines \"announced [petitioner's] confessions to . . . six murders . . .\" and his \"offer to plead guilty if promised a 99-year sentence . . .\" Id. [366 U.S. at 725-26, 6 L. Ed. 2d] at 758 [ 81 S. Ct. at 1644]. In the pretrial publicity was a newspaper story that appeared the day before trial which discussed petitioner Irvin's oral admissions to additional murders. It also contained comments of petitioner's court-appointed counsel, who acknowledged the criticism he had received over being Irvin's counsel. The article further recounted the extent of the community's deep feelings as to the defendant's guilt and its hopes for punishment; comments of spectators (\"my mind is made up;\" \"I think he is guilty;\" and \"he should be hanged\") were printed.\n\nIn Rideau v. Louisiana, 373 U.S. 723, 10 L. Ed. 2d 663, 83 S. Ct. 1417 (1963), the Supreme Court found that a single piece of pretrial publicity was so devastating in its adverse impact upon petitioner that prejudice to petitioner's right to a fair trial was presumed and the writ of habeas corpus was granted. In Rideau, a film was made of an \"interview\" between the sheriff and the accused, who was without counsel at the time. In the film, the accused, under interrogation, admitted to certain crimes, including murder. The film was televised later that day and was shown twice more over the next two days. The Supreme Court found:\n\nThe spectacle of Rideau personally confessing in detail to the crimes with which he was later to be charged . . . was Rideau's trial - at which he pleaded guilty to murder. Any subsequent court proceedings in a community so pervasively exposed to such a spectacle could be but a hollow formality.\n\nRideau, [at 726] 10 L. Ed. 2d at 665 [83 S. Ct. at 1419] (emphasis in original).\n\nPetitioner in the instant cause relies on Sheppard v. Maxwell, 384 U.S. 333, 16 L. Ed. 2d 600, 86 S. Ct. 1507 (1966), in which the Supreme Court granted petitioner's writ of habeas corpus on a prejudicial pretrial publicity claim. Sheppard was a Cleveland physician accused of murdering his wife. Sheppard claimed that an intruder had been the killer. Sheppard claimed that he was attacked by the \"form,\" whom he then pursued unsuccessfully. Shortly after the police were notified of the murder, Sheppard became the prime suspect. The views of the Assistant County Attorney, later the chief prosecutor of Sheppard, appeared in the news, sharply criticizing the refusal of the Sheppard family to permit the immediate questioning of the suspect. Sheppard, 16 L. Ed. 2d at 606. From that point on, headline stories repeatedly stressed Sheppard's lack of cooperation with the police and other officials. Id.\n\nOne front page editorial appeared which suggested that Dr. Sheppard should have been subjected instantly to a third-degree interrogation. Id. at 607. The next day, another front page editorial appeared demanding that the coroner call an immediate inquest. Id.\n\nThe inquest was broadcast on live television. Sheppard was examined without counsel for more than five hours over the three day proceeding, which ended in a public brawl.\n\nThere was editorial coverage which directly demanded that Sheppard be arrested and jailed immediately. There appeared an editorial cartoon that depicted the accused as an untelling sphinx. The names and addresses of the veniremen were published in all three of Cleveland's newspapers. All of the prospective jurors received anonymous and identified telephone calls, as well as letters regarding the impending trial. Id. at 609.\n\nA front-page story which appeared during the jury selection contained subjective material which evoked sympathy for the victim. The same article featured quotations of the chief detective in the case assuring readers that the prosecution's exhibits would speak for the victim and tell her story. Id. at 611.\n\nWhile Sheppard was on the stand, a Captain Kerr of the Homicide Bureau issued a press statement denying allegations of police mistreatment. The press statement carried the headline \"Bare-faced Liar, Kerr Says of Sam.\" Id. at 612.\n\nThe Supreme Court observed that \"for months the virulent publicity about Sheppard and the murder had made the case notorious.\" Id. at 615.\n\nThe Eleventh Circuit recently decided the case of Coleman v. Kemp, 778 F.2d 1487 (11th Cir. 1985), a case not cited by petitioner but germane to this issue. The pretrial publicity in that case was so relentless and prejudicial that the court granted petitioner's writ, holding that \"if there were no constitutional right to a change in the venue in the instant case, then one can conceive of virtually no case in which a change of venue would be a constitutional necessity.\" Id. at 1538.\n\nIn the Coleman case, four escaped prisoners from Maryland killed six members of a Georgia farm family, the Aldays, shooting five men and raping and killing the wife of one of the men.\n\nThe director of the state crime lab was quoted as saying that the Alday murders were \"the biggest deliberately planned homicide in Georgia.\" This quotation appeared in a front page article in the Atlanta Constitution. Id. at 1518.\n\nOne article quoted one of the suspects, whose mug shots and escapee status had already been prominently featured in the major newspaper of the community in which the crimes were committed, as stating that he would \"kill any policeman who tries to stop us for any reason.\" Id. at 1491.\n\nA front-page article quoted the director of the Georgia Bureau of Investigation as stating that the circumstantial evidence against the four suspects was overpowering, and \"there's no point in looking for anybody else.\" Id.\n\nAn article in a leading local paper quoted Sheriff White of Seminole County (where the murders took place):\n\nIf I had my way about it, I'd have me a large oven and I'd precook them for several days, just keep them alive and let them punish . . . And I don't think that would satisfy me.\n\nWhenever I'm protecting them, I'm going to do my job and bring them to court, and I hope they'll get justice.\n\nI don't see where they could put up any plea for mercy . . . The acts of these men are lower than animals.\n\nIf a citizen gets out of hand and starts shooting people up, there's only one way to arrest and that's with a shotgun. Any man that believes in God believes in capital punishment . . . I could throw the switch to the electric chair and never lose a minute's sleep.\n\nId. at 1501.\n\nA news article reported a Georgia official as stating that there was ballistics evidence that the suspects had killed the victims. Id.\n\nSheriff White was quoted in another news article, stating:\n\nThere's blood boiling all over the nation about this. You name me a state where if they [the captured suspects] broke loose, people wouldn't want to hurt them. There's no other place for it [the trial] to be held except in Seminole County.\n\nId. at 1519.\n\nA front-page article appeared headlined \"Deserve What They Get: Mother of Slay Suspects.\" The mother of three of the accused murderers was quoted as stating that \"they had no respect for their family and those people in Georgia. How can they expect any from us?\" Id. at 1502.\n\nOne article described two of the suspects as \"hav[ing] been involved with homosexuality.\" Another article quoted the son of one of the murder victims as stating, \"I think the killers ought to be killed.\" Id. at 1519.\n\nThe Georgia Director of Public Safety was quoted as saying that \"the killings were the most horrifying crime that has ever been committed in our state.\" Id.\n\nSheriff White's quotations again found their way into print. An article reported him stating that \"there's not a doubt in my mind that lynching has crossed the mind of everybody. I'd like to try 'em in court this afternoon if I had them down there.\" Id. at 1520.\n\nAnother article mentioned suspect Dungee's naming of suspect Coleman as the killer of the victim Mary Alday. Id.\n\nA front page article appeared which quoted suspect Coleman a stating that he shot and killed a Pennsylvania youth during the same crime spree because they [the suspects] did not \"want any witnesses.\" Id. at 1503.\n\nA front-page editorial referred to the suspects as \"sorry, shiftless people\" of the kind for whom the people of the community have never had much use.\n\nIt was noted in another article that the newly enacted state death penalty law could be applied to the four suspects.\n\nAn editorial appeared which began by lauding the police for the rapidity of the suspect's capture. The editorial later commented on the lack of a place in society for \". . . individuals who place no value on the life of any other individual with whom they come in contact.\" The editorial concluded by comparing killers to rattlesnakes, mad dogs or other rabid animals, opining that \"when individuals become as these lower animals, they lose their right to human treatment.\" Id. at 1493.\n\nSeveral articles appeared which featured complaining quotations from the court-appointed attorneys for the suspects. The extreme reluctance of the lawyers to represent the accused was repeatedly reported (\"I despise it, I'd rather take a whipping, but the Judge appointed me and I have to do my job.\") Id. at 1494, 1522.\n\nOne particularly prejudicial editorial appeared which called specifically for the death penalty in the Alday case:\n\nLook at it this way. When a person is convicted by the courts beyond a reasonable doubt of a crime like the slaughter of the Alday family, it seems to me that there is nothing else society can do. It is absurd to accept the argument that such a criminal can be made to see the error of his ways. As long a such a criminal lives, he is indeed a threat to society. If he is put into prison, he has the opportunity for escape or parole. If he is executed, society has nothing more to fear from such a criminal.\n\nId. at 1494.\n\nOne article reprinted a letter written by the trial judge to an attorney for one of the suspects. The letter warned the attorneys about \"trifling with the courts\" because the attorneys had filed a motion for change of venue. Id. at 1496.\n\nThe crime was reported in the newspaper to have been the \"No. 2\" story of the year in Georgia. Articles appeared describing the slayings as the worst crime in Georgia history. Id. at 1509.\n\nNumerous articles reported that one of the suspects was going to be the key witness for the prosecution and had issued a statement to police describing the slayings. Id. at 1497.\n\nAn article appeared which discussed the hopes of the surviving Alday family members that the killers would be put to death for their crimes. Id. at 1525.\n\nOther articles and editorials appeared which called the killers mad dogs, sex maniacs, ghouls and beasts. Several of the articles which appeared in exploitative \"true crime\" magazines hinted at necrophilia which purportedly was performed on Mary Alday. Id. at 1526-27.\n\nFinally, extensive reporting was made of the testimony from the witness stand of Billy Isaacs, the youngest suspect who was the state's eyewitness. Isaacs described the crimes in ghastly detail and the participation therein of each of the accused. Petitioner Coleman was the last to be tried; before his trial a multitude of articles appeared which covered exhaustively the trial of two of his accomplices, both of whom were found guilty of the murders and were sentenced to death.\n\nHaving examined the nature and the extent of the pretrial publicity in the cases where the writ was granted due to presumed prejudice to a defendant's right to a fair trial, and that produced pretrial the instant cause, I conclude that the pretrial publicity generated in Petitioner Muhammad's (Knight's) case does not warrant the relief sought.\n\nThe Court notes that \"the proceedings in [the Rideau, Irvin, Sheppard and Coleman cases] were entirely lacking in the solemnity and sobriety to which a defendant is entitled in a system that subscribes to any notion of fairness and rejects the verdict of a mob. They cannot be made to stand for the proposition that juror exposure to information about a state defendant's prior convictions or to news accounts of the crime which he is charged alone presumptively deprives the defendant of due process.\" Murphy v. Florida, 421 U.S. 794, 44 L. Ed. 2d 589 at 594, 95 S. Ct. 2031 (1975) (Marshall, J.) Again, \"it is not required that the jurors be totally ignorant of the facts and issues involved. In these days of swift, widespread and diverse methods of communication, an important case can be expected to arouse the interest of the public in the vicinity, and scarcely any of those best qualified to serve as jurors will not have formed some impression or opinion as to the merits of the case.\" Irvin, 81 [6] L. Ed. 2d at 756.\n\nIt is reasonably clear, of course, that while some residents of Dade County may have been exposed to more than one of the several media, it is equally likely that no one person would have read all of the publicity referred to or, indeed all of the comments in a single media organ. Thus, the cumulative weight of the publicity, such as it was, and as presented by Petitioner, should be discounted. See Coleman v. Kemp, 778 F.2d at 1538.\n\nIn the instant cause, the record of the pretrial publicity is almost entirely devoid of the elements that have been held to be prejudicial in connection with other habeas petitions raising such claims. Here, there was no confession or admission by petitioner to any of the crimes for which he was convicted. The damaging impact of a heavily publicized confession or admission cannot be underestimated. Such an inclusion in the pretrial publicity has been held to have infected an exposed community to such an extent that a fair trial there was not possible. See, e.g., Rideau, supra [10 L. Ed. 2d] at 665; see also Irvin, supra [6 L. Ed. 2d] at 758; Coleman v. Kemp, supra, at 1539-40 (\"the explicit details of the inculpatory and eyewitness testimony of Coleman's own half-brother, Billy, together with the other publicity in the case, approaches the prejudicial impact of the televised confession in Rideau.\"). Several sentences appeared in two articles concerned with petitioner's alleged shooting of the Georgia liquor store clerk which said that Knight's suspected accomplice in the alleged crime was willing to testify that Knight was the triggerman. However, the reporting was not exploited heavily, was factual, and was not repeated. Further, the voir dire in the case does not reveal any mention or recollection by any prospective juror of the Georgia allegations.\n\nSecond, \". . . there is no evidence of record of official misconduct . . . in infuencing the publicity given the case.\" Yount v. Patton, 537 F. Supp. 873 (W.D. Pa. 1982), rev'd, 710 F.2d 956 (3d Cir. 1983), rev'd 467 U.S. 1025, 104 S. Ct. 2885, 81 L. Ed. 2d 847 (1985). In Sheppard, the Assistant County Attorney (who was to be the chief prosecutor), the County Coroner, and a Captain of the Homicide Bureau each aired his views inappropriately as to the veracity of the accused, his reluctance to be interrogated, and his participation in the subject crime. The Supreme Court observed that the trial judge's failure to take any preventive or remedial action was aggravated by the fact that many of the prejudicial news items could be traced to the prosecution (as well as the defense). Sheppard, supra, at 619. In Coleman v. Kemp, supra, at 1539, the Eleventh Circuit noted the significance of \"the community's ranking law enforcement officer['s] . . . widely reported and outrageous statements as to the need for vengeance, retribution, and capital punishment, all in the name of 'justice.'\"\n\nIn the case sub judice, the record reflects that there were two instances of official publicity. In one instance then Attorney General Shevin \"reacted to the kidnap-murder . . . calling on the Supreme Court to reinstate the death penalty.\" While a statement like this cannot be other than adverse to a murder suspect yet to be tried, the record shows that this statement was not influential in any way upon any subsequent press coverage. It did not spearhead a rash of similar sentiments. It appeared within a day or two of the petitioner's capture and was not repeated or featured after that. In short, while the statement was indeed made, it does not demonstrate concerted official involvement with or influence on the pretrial publicity.\n\nDuring the time that the suspect Knight was free after his escape, a reward for information leading to his capture was offered. State Attorney Gerstein (later the chief prosecutor in the case) announced the reward. While the announcement was made by the prosecution, it did not focus on petitioner's guilt or innocence as to the Gans murders and cannot be said to have influenced the publicity or public opinion vis-a-vis those crimes. The announcement was only for the legitimate purpose of apprehending one who was suspected of unlawful flight to avoid prosecution.\n\nThe record shows that the publicity in the instant cause did not focus on the appropriateness of or the need for the death penalty for the accused (aside from the single mention discussed above, which was made more than eight months before trial). In Irvin, supra at 758 comments of spectators advocating the death penalty were published in the newspapers. In Coleman v. Kemp, supra, the record was rife with repeated calls for the death penalty's summary application, both by officials and by the victims' family. Id. at 1519, 1525. \"The fact that the Alday family wanted the death penalty pervaded the community . . . editorials called for the death penalty, and reports of comments from attorneys and other news articles repeatedly suggested the appropriateness of the death penalty.\" Id. at 1525. The record in the instant cause does not contain any such prejudicial advocacy of the death penalty for Petitioner. As evidence of the fact that the community was not saturated with a desire for vengeance against the petitioner, the only noteworthy editorial which appeared (during the trial) strongly denounced the death penalty and argued that such penalty was inappropriate and unfair as against defendant Knight.\n\nFurther there is no record showing of invidious personal attacks on petitioner appearing in the press. Knight was not turned into a monster in the press through a \"'barrage of inflammatory publicity immediately prior to trial,' Murphy v. Florida, 421 U.S. 794, 798, 95 S. Ct. 2031, 2035, [44 L. Ed. 2d 589] (1975), amounting to a 'huge . . . wave of public passion,' Irvin, supra, at 728 . . .\" Patton, supra at 2889. The record demonstrates a lack of \"'feature' articles obviously aimed at exploiting community sentiment.\" Mayola, supra at 995. Generally, \". . . the news stories were primarily factual in nature.\" [ See Murphy v. Florida, 421 U.S. [at] 802, 95 S. Ct. at 2037]; see also Calley v. Callaway, 519 F.2d at 206 (\"[a] prejudicial pretrial publicity claim must be viewed differently when the news accounts complained of are 'straight news stories rather than invidious articles which would tend to arouse ill will and vindictiveness.'\") (quoting Beck v. Washington, 369 U.S. 541, 556, 82 S. Ct. 955, 963, [8 L. Ed. 2d 98] (1962)); Hale v. United States, 435 F.2d 737, 748 (5th Cir. 1970) (\"no editorials or cartoons denounced appellant\"), cert. denied, 402 U.S. 976, 91 S. Ct. 1680, [29 L. Ed. 2d 142] (1971). Willie v. Maggio, 737 F.2d 1372 (5th Cir. 1984) at 1387.\n\nUnderstandably, the record of publicity does contain, naturally, numerous descriptions of the Gans murders, though these accounts eventually were reduced, with the passage of time, to one or two sentence tag-lines. There was also mention made of Petitioner's previous arrests; none of these arrests, however, was for a crime remotely approaching the severity of the Gans killings. The record further reflects that Petitioner was described variously as arrogant, a hothead, nuts. However, the record also discloses numerous humanizing references to Petitioner, detailing his good sense of humor, diligence at work, love of children, willingness to help neighbors with problems and his intelligence.\n\nThe record shows references to the neighbors' disbelief that Petitioner would commit the crimes with which he was charged. Petitioner was not accorded one-sided treatment by the press, which seemed to recognize that the stories it printed would be more interesting if the subject Knight was given more than one dimension. Petitioner was not called any of the hostility-inducing epithets attached to the petitioner(s) in the Coleman v. Kemp (mad dogs, sex maniacs, ghouls, beasts) or Mayola (convicted sex pervert, confessed boy slayer) cases.\n\nIn sum, \"Petitioner has failed to show that the setting of the trial was inherently prejudicial . . .\", Murphy, supra at 597, such that this Court can presume prejudice from the pretrial publicity and grant the writ sought on the claim.\n\nFinally, even if the publicity in this cause were presumed prejudicial to petitioner Muhammad's Sixth Amendment right to a fair trial, the transcripts of the extensive voir dire proceedings in the case effectively rebut any assertion that the impanelled jurors were incapable of sitting impartially. See Coleman v. Kemp, 778 F.2d 1487 (11th Cir. 1985) at 1541 n.25. However, because I conclude there is no presumed prejudice in this cause, since the publicity was comparatively restrained, it is unnecessary to discuss further the particulars of the voir dire.\n\nII. THEORY OF PROSECUTION\n\nPetitioner Muhammad claims that he was denied due process and a fair trial due to the failure of the state to announce whether it was proceeding under a theory of felony murder or premeditated murder. The defense in this cause twice moved to have the state elect one or the other theory of prosecution; both motions were denied. Petitioner claims that his defense was hampered and his rights to due process and fair trial were prejudiced by the denial of his motions for statement of particulars because he was not specifically notified of the charges against him.\n\nThis claim was raised by Petitioner on district appeal to the Florida Supreme Court, which held:\n\nWe find appellant's allegation that the Court erred in allowing the State to prosecute the charges under a theory of felony murder when the indictment charged premeditated murder to be absolutely contrary to established precedent.\n\n\"The indictment was in the usual form charging murder to have been committed with a premeditated design to effect the death of Corbin. The appellant argues that he should have been furnished with bill of particulars specifying whether the state would proceed in the theory of felony murder or premeditated murder. Without being appraised of the specific theory under which the State was electing to proceed, appellant says he was placed at a burdensome disadvantage by being forced to prepare defenses to each, which defenses necessarily are inconsistent. Appellant contends that forcing such a burden upon him constituted a denial of due process.\n\n'The allegations of the indictment were sufficient to charge murder in the first degree, regardless of whether the murder was committed in the perpetration of any of the felonies mentioned in F.S.A.  782.04 or was committed with a premeditated design, Southworth v. Florida, 98 Fla. 1184, 125 So. 345. Under such a charge evidence may be introduced and defendant may be convicted either on the theory that the killing was carried out as a result of a premeditated design to effect death or on the theory of felony murder. Larry v. State, 104 So.2d 352 (Fla. 1958)\"\n\nCf. Hargrett v. State, 255 So.2d 298 (Fla. App. 3, 1971).\n\nKnight v. State, 338 So.2d 201, 204 (Fla. 1976).\n\nThis issue of state law has been repeatedly affirmed by state courts faced with the question. State v. Pinder, 375 So.2d 836 (Fla. 1979) at 839 (citing Knight); Ables v. State, 338 So.2d 1095 (Fla. 1st DCA1976) at 1097.\n\nThe Court views this claim primarily as an issue of state law. Issues of state law are ordinarily immune from federal review. See Francois v. Wainwright, 741 F.2d 1275 (11th Cir. 1984) at 1281. The ultimate source of any state's law is found in the decisions of its highest court. See Ford v. Strickland, 696 F.2d 804 (11th Cir. 1983) at 810.\n\nAs the court notes elsewhere in this opinion, there was ample evidence in this cause upon which to base a conviction for premeditated murder, and indeed the Court finds that the primary theory of prosecution was in fact premeditated murder as charged in the indictment. See Knight v. State, 394 So.2d at 1002. While premeditated murder was charged in the indictment, strongly argued to the jury, and premeditated design instructions were given to the jury, the record discloses that there was also substantial proof of felony murder established through the testimony of state witnesses. See Knight v. State, 394 So.2d at 999-1000 (factual statement setting out in detail appellant's abductions and robbery). A federal court will not overturn a factual conclusion of a state court unless the conclusion is not fairly supported by the record, which is not the case here. See Wainwright v. Goode, 464 U.S. 78, 78 L. Ed. 2d 187 at 192-93, 104 S. Ct. 378 (1983).\n\nPetitioner relies upon Cole v. Arkansas, 333 U.S. 196, 92 L. Ed. 644, 68 S. Ct. 514 (1948) for the proposition that a criminal defendant is constitutionally entitled to specific notice of the charges against him.\n\n\"No principal of procedural due process is more clearly established than that notice of the specific charge, and a chance to be heard in a trial of the issues raised by that charge, if desired, are among the constitutional rights of every accused in a criminal proceeding in all courts, state or federal.\"\n\nCole, supra at 647.\n\nConsideration of the stated principle does not help Petitioner here. Petitioner was given notice, through the indictment of the charges of premeditated murder that the state was bringing against him.\n\nAt the time of Petitioner's trial, Florida law permitted (and still does) the state to prosecute under premeditated or felony murder theories when the indictment charged premeditated murder. Therefore, the trial court's denials of the defense's motions for statements of particulars were proper under state law.\n\nAt any rate, a refusal by a court to grant a bill of particulars is reversible error only if it can be shown that the defendant was actually surprised at trial and thereby suffered prejudice to his substantial rights. See, e.g., United States v. Cole, 755 F.2d 748 (11th Cir. 1985); United States v. Williams, 679 F.2d 504, 510 (5th Cir. 1982) (citing United States v. Colson, 662 F.2d 1389, 1391 (11th Cir. 1981)). In this cause, Petitioner has not seriously claimed surprise.\n\nFurther, Petitioner has not demonstrated that any prejudice to him resulted from the trial court's denials of his motions. The state prosecuted primarily under a premeditated design theory even though evidence showing felony-murder was introduced at trial. The trial court simply refused to limit the state to one theory of prosecution where state law permitted the prosecution to proceed under a dual theory. If there was error by the trial court, this Court is convinced that such error was not of a constitutional dimension. The benefit to the state from the error (if any was committed) did not contribute to Petitioner's conviction since there was ample evidence upon which to base a conviction under either theory. See Chapman v. California, 386 U.S. 18, 17 L. Ed. 2d 705, 87 S. Ct. 824 (1967) (\"harmless error\" rule).\n\nIII. EXCLUSION OF DEFENSE WITNESS\n\nPetitioner contends that his Fifth Amendment right to due process and Sixth Amendment right to fair trial were violated by the trial court's exclusion of the testimony of defense witness, Lt. Pat Duval of the St. Lucie County Sheriff's Department, Fort Pierce, Florida.\n\nPetitioner asserts that Duval's testimony was needed to impeach the testimony of the psychiatrist Dr. Mutter, a state expert witness. Dr. Mutter stated at the pretrial competency hearing that he had based his opinion that defendant Knight was sane, in part, on Knight's appropriate expressions of affection for his father. Further, Petitioner contends that Duval's testimony was crucial because it would have bolstered the testimony of the defense's witnesses. One of the defense's psychiatric witnesses testified that Knight had paranoid fantasies involving fear and hatred of his father. Another defense psychologist testified that Knight had difficulty with the concept of \"father\" in a word-association test.\n\nThe defense attempted to introduce the testimony of Lt. Duval to provide a background for the defense expert's opinion that Knight's mental difficulties could be illustrated by his perceptions of and response to his father. The prosecution objected to Lt. Duval's proposed testimony because Duval did not appear on the witness list provided to the state by the defense. The trial court permitted the defense to proffer Lt. Duval's testimony outside the presence of the jury, ruling that if it were relevant it would be admitted.\n\nAfter hearing Lt. Duval's proffer, the trial judge sustained the state's objections as to its competency.\n\nLt. Duval would have testified that he had arrested Thomas Knight in the past. Lt. Duval proffered that Petitioner first came to his attention when he arrested him at age ten or eleven. Duval proffered that he was generally familiar with the Knight family background because Mrs. Knight, Thomas's mother, occasionally spoke to him about various family problems. (Duval admitted that he did not know the other Knight siblings well.) Duval knew about the incest incident involving the father and sister of Thomas Knight, for which the elder Knight was eventually imprisoned. Lt. Duval also would have testified that in 1970, he had seen Thomas Knight in a jail cell after an arrest and that Knight's conversation was rambling and vaguely threatening.\n\nAfter Lt. Duval had indicated that his testimony was to be in the general area described, the state objected to the testimony and the trial court sustained the objection.\n\nPetitioner raised the issue of the exclusion of this defense witness in his state habeas corpus petition, as part of a larger ineffective assistance of appellate counsel claim. The Florida Supreme Court addressed the point:\n\nThe third asserted omission by appellate counsel concerns the failure to raise as error the exclusion of testimony by witness Pat Duval. The testimony of this witness was proferred at trial to show the jury that, given the family history of abuse and incest by the father of the petitioner, the feelings professed by the petitioner to the expert witness were in fact \"inappropriate.\" The proposed witness Duval was not an expert witness and our review of the record reveals that the ruling of the trial judge was clearly within his discretion and was proper under the circumstances of this case. The failure to raise the issue on appeal was not a substantial deficiency by appellate counsel, and there was no prejudice.\n\nKnight v. State, 394 So.2d 997, 1003 (Fla. 1981).\n\nI have reviewed the entire trial record submitted in this cause. As to the instant issue, I find that the trial judge acted within his discretion in excluding the testimony of the witness, Lt. Duval. He was not an expert on the insanity issue. He would not, as indicated by his proffer, have testified as to his direct knowledge of Knight's sanity. Allowing the introduction of summaries of conversations between Duval and Mrs. Knight would have violated the rule against hearsay evidence without a showing that the hearsay fell into any of the recognized hearsay exceptions. Duval's knowledge of Knight was remote in time. There was no showing made by the proffer that Duval's recollections were especially accurate or reliable. See, e.g., R. at 3121. There was nothing in the proffer that related directly to the question of Thomas Knight's sanity, and nothing was profferred that did not involve hearsay or non-authenticated evidence.\n\nThe right to present witnesses in one's own defense in a criminal trial lies at the core of the Fifth and Fourteenth Amendments' guarantee of due process of law. Washington v. Texas, 388 U.S. 14, 19, 87 S. Ct. 1920, 1923, [18 L. Ed. 2d 1019] (1967). In reviewing the evidentiary determination of a state trial judge, the federal court does not sit as a \"'super' state Supreme Court.\" Shaw v. Boney, 695 F.2d 528, 530 (11th Cir. 1983). The general rule is that a federal court will not review a trial court's actions with respect to the admission of evidence. Id.; Nettles v. Wainwright, 677 F.2d 404, 414 (5th Cir. 1982) (citing Lisenba v. California, 314 U.S. 219, 228, 62 S. Ct. 280, 286, [86 L. Ed. 166] (1941)). Before habeas relief may be granted because of a state court's erroneous evidentiary ruling, the violation must rise to the level of a denial of \"fundamental fairness.\" Bryson v. Alabama, 634 F.2d 862, 865. Id.\n\nFundamental fairness is violated when the evidence excluded is material in the sense of a crucial, critical, highly significant factor. Boykins v. Wainwright, 737 F.2d 1539, 1544 (11th Cir. 1984).\n\nPetitioner has cited several cases to the Court in support of his contention that his rights to due process and fair trial were violated by the state court's evidentiary ruling. The Court has reviewed the cited authorities and finds that they are distinguishable from the case at bar.\n\nIn Washington v. Texas, supra, the Supreme Court held that defendant Washington's Sixth Amendment right to have compulsory process for obtaining witnesses in his favor was violated by a state procedural statute providing that persons charged as principals, accomplices, or accessories in the same crime could not be introduced as witnesses for each other. The Texas trial judge refused to permit convicted perpetrator Fuller to testify on behalf of co-perpetrator Washington when the testimony would have exculpated Washington (Fuller would have testified that Washington tried to persuade him not to commit the crime and that Washington ran before the fatal shot was fired.)\n\nIn reviewing Washington's conviction, the Court relied on Rosen v. United States, 245 U.S. 467, 62 L. Ed. 406, 38 S. Ct. 148 (1918), in overruling United States v. Reid, 53 U.S. 361, 12 How. 361, 13 L. Ed. 1023 (1852) (which had held that one of two defendants jointly indicted for murder on the high seas could not call the other as a witness). This rule had been followed because it was thought that if two persons charged with the same crime were allowed to testify on each other's behalf, each would try to swear the other out of the charge. The rule rested on the premise that the right to present witnesses was subordinate to the Court's interest in preventing perjury. In Rosen the Court took note of \"the conviction of our time that the truth is more likely to be arrived at by hearing the testimony of all persons of competent understanding who may seem to have knowledge of the facts involved in a case, leaving the credit and weight of such testimony to be determined by the jury or the court. . . .\"\n\nThe Court held that Washington had been denied his Sixth Amendment rights because the state had denied him the \"right to put on the stand a witness who was physically and mentally capable of testifying to events that he had personally observed, and whose testimony would have been relevant and material to the defense.\" Washington, 18 L. Ed. 2d at 1025.\n\nIn Chambers v. Mississippi, 410 U.S. 284, 35 L. Ed. 2d 297, 93 S. Ct. 1038 (1973), the Court considered two Mississippi state evidentiary rulings in petitioner's case. The facts showed that police officers in Woodville, Mississippi, had tried to arrest a youth in a pool hall. A skirmish ensued when onlookers attempted to prevent the arrest. In the melee, one of the officers, Liberty, was shot. Before the officer died, he returned the fire, hitting a man who was running down an alley. The wounded man was Chambers. Chambers was taken to the hospital by three persons and subsequently charged with Liberty's murder.\n\nOne of the men who took Chambers to the hospital was McDonald. McDonald later gave a sworn confession to Chambers' attorneys that he shot Liberty. McDonald stated that he had already told another man, Williams, that he had used his own pistol. He also stated that his confession was voluntary. McDonald was jailed after making the confession.\n\nMcDonald later repudiated the confession. He stated that one Rev. Stokes had persuaded him to confess, saying that he would not go to jail and that he would share in the proceeds of a suit against Woodville. McDonald's repudiation was accepted and he was released.\n\nThe trial court ordered McDonald to appear at the trial. The state, however, did not call him. Chambers called McDonald and had his sworn confession read to the jury. On cross-examination, the state elicited the fact McDonald had repudiated his prior confession. McDonald then testified that he had not shot Liberty and explained why he had given a false confession. Chambers then attempted to examine McDonald as an adverse witness, but the trial court ruled (and was upheld on appeal) that since McDonald was not adverse in the accusatory sense, he could not be called as an adverse witness, even though his testimony was hostile to Chambers.\n\nChambers then sought to introduce the testimony of three persons to whom McDonald had admitted the shooting. The trial court refused to let the jury hear any of their testimony on hearsay grounds (upheld on appeal).\n\nChambers was convicted of the shooting and sentenced to life in prison.\n\nThe Supreme Court, in reversing the conviction, balanced the essential and fundamental right of cross-examination against the Mississippi rule that a party may not impeach its own witness. The rule rested on the presumption that a party who calls a witness \"vouches for his credibility.\" The Court rejected the present usefulness of such a rule, which had been condemned as archaic, irrational and potentially destructive of the truth-gathering process. Chambers, 35 L. Ed. 2d at 309 n.8.\n\nThe Court held that the availability of the right to confront and to cross-examine those who give damaging testimony against the accused has never been held to depend on whether the witness was initially put on the stand by the accused or by the state.\n\nThe Court further held that it was additional fundamental error for the trial court to have excluded the testimony of the three witnesses to whom McDonald had admitted the shooting. The Court held that the hearsay exception which permitted declarations against interest should have included declarations against penal, as well as pecuniary, interest. The circumstances of the case provided considerable assurances of the reliability of the confessions made by McDonald to the witnesses, who were close friends of McDonald's. (The spontaneous confessions were made to close friends shortly after the murder, each confession was corroborated by other evidence in the case, all of the confessions were unquestionably admissions against interest, and McDonald himself was present in the courtroom and available for cross-examination if there had been any question about the truthfulness of the extra-judicial statements.)\n\nIn Green v. Georgia, 442 U.S. 95, 60 L.Ed2d 738, 99 S. Ct. 2150 (1979), the Supreme Court vacated petitioner Green's death sentence where the trial court excluded as inadmissible hearsay a statement made by co-indictee Moore exculpating Green. The trial court refused to allow one Pasby, a confidant of Moore to whom an admission was made by Moore, to testify on behalf of the co-perpetrator Green. The Supreme Court held that in this case the supporting evidence corroborating the admission was ample since the State used it to convict Moore. The statement was certainly against interest. In these circumstances, the Court held, \"the hearsay rule may not be applied mechanistically to defeat the ends of justice.\" Id. (citing Chambers v. Mississippi, 410 U.S. 284, 302, 35 L. Ed. 2d 297, 93 S. Ct. 1038 (1973)).\n\nIn Boykins v. Wainwright, 737 F.2d 1539 (11th Cir. 1984), Petitioner Boykins successfully challenged his robbery conviction on habeas. Boykins's only defense at trial was insanity and he sought to introduce expert testimony of one Dr. Jesus Rodriguez, who had treated petitioner for mental illnesses for three years at the Florida State Mental Hospital at Chattahoochee and had last examined him eight months before the robbery. Rodriguez was to have testified on the history of Boykins's mental illness and the possibility that Boykins's symptoms might have recurred after his release from the mental hospital. But because Boykins had been judged competent by hospital officials in January, 1973, the trial court refused to admit any evidence of his mental illness prior to then on the ground that it was irrelevant. Instead, the judge limited Dr. Rodriguez to the single hypothetical question of whether the doctor felt Boykins was sane at the time of the robbery.\n\nThe Eleventh Circuit held that the excluded testimony was material in that it was a crucial, critical, highly significant fact in Boykins's defense. Id. at 1544. Rodriguez had been his treating physician and was intimately familiar with his history. There was no indication that Dr. Rodriguez's testimony was not trustworthy. The doctor was to testify on Boykins's entire symptomatology, and that was information in an area which was needed for the jury's resolution of the issue of the defendant's criminal responsibility. See Gordon v. United States, 438 F.2d 858 (5th Cir., cert. denied, 404 U.S. 828, 92 S. Ct. 139, [30 L. Ed. 2d 56] (1971).\n\nA comparison of the foregoing cases and their rationales reveals that all of those cases presented either clear error by the trial courts in their evidentiary rulings or compelling reasons for exceptions to state evidentiary or procedural rules. In Green, Chambers and Washington, the trial courts involved all erred when they refused to allow the testimony of persons directly involved in the crimes to be introduced. The excluded testimony in those cases was direct and materially relevant; the testimony related directly to the crime in question. In Chambers the trial court also erred by excluding the \"hearsay\" statements of the witnesses; the excluded statements were confessions against interest made by one co-perpetrator exculpating another. There can be no doubt as to the critical and crucial nature of these exclusions. It was certainly reasonable to conclude that the direction of the trials were changed by these exclusions. Each of the defendants was prejudiced by the exclusion of these directly exculpatory statements.\n\nIn the instant cause, it is difficult to conclude that Lt. Duval's proffered testimony had any direct bearing on either the crime for which the defendant was being tried or the question of the defendant's sanity. The testimony concerned various loosely organized recollections of the defendant as a youth and of his family background by a sympathetic police officer. As far as the jury's need to hear that defendant harbored feelings for his father that were inconsistent with feelings of affection, that was spoken to in Dr. Wells's remarks on the fears of the father held by Mr. Knight. R. 2981-82. Nothing in Lt. Duval's proffer or his contemplated testimony approaches the massive need for the excluded testimony in Green, Chambers and Washington.\n\nThe excluded testimony in Boykins is likewise readily distinguishable from the instant case. Lt. Duval was not an expert and had never been professionally responsible for knowledge of Knight's mental condition. Moreover, his proposed testimony concerned Knight's family history but contained no hint that Duval had any personal knowledge of any incidents tending to show Knight's insanity (save for one incident where Duval heard Knight make rambling, threatening statements).\n\nIn sum, the Court must deny Petitioner's writ on this ground, as it finds no prejudice to Mr. Knight from the trial judge's evidentiary ruling since the excluded testimony cannot be considered crucial, critical or highly significant. The exclusion of Lt. Duval did not affect the fundamental fairness of this trial.\n\nIV. FAILURE TO INSTRUCT ON FELONY MURDER\n\nPetitioner Muhammad raises as one ground for granting the writ of habeas corpus the error of the trial court in failing to instruct the jury on the underlying elements of the felonies of kidnapping and robbery. Petitioner claims that the trial court instructed the jury that a verdict of guilty of murder in the first degree could be returned under either a premeditated murder theory or a felony-murder theory. Error requiring the granting of the writ occurred, Petitioner contends, because the trial court failed to instruct the jury on the elements of the crimes constituting the underlying felonies. The issue was raised on appeal to the Supreme Court of Florida, which held, in denying Petitioner's appeal on the stated grounds:\n\nThe record in the instant cause reflects that the trial judge gave the general definitive instructions for homicide but did not specifically instruct upon the elements of the underlying felony of kidnapping or robbery. There was no request or objection by petitioner's trial counsel to this failure to give these instructions.\n\nWe conclude that where there is sufficient evidence of premeditation, the failure to give the underlying felony instruction, where it has not been requested, is not error which mandates a reversal absent a showing of prejudice. See Frazier v. State, 107 So.2d 16 (Fla. 1958).\n\nKnight v. State, 394 So.2d 997 (Fla. 1981) at 1002.\n\nPetitioner urges the Court that the Florida Supreme Court treatment of this issue should not be afforded the usual immunity from federal review. See Francois v. Wainwright, 741 F.2d 1275, 1281 (11th Cir. 1984); Ford v. Strickland, 696 F.2d 804, 810 (11th Cir. 1983). Rather, Petitioner urges, the Court should be guided by the Eleventh Circuit's holding in Adams v. Wainwright, 764 F.2d 1356 (11th Cir. 1985). The specific language in Adams relied upon by Petitioner states:\n\nThe Florida Supreme Court's approach to deciding the petitioner's Stromberg claim was incorrect. The proper approach is to examine only the trial court's instructions and the jury's verdict, not the sufficiency of the evidence to support the verdict. Stromberg does not suggest a harmless error standard based on overwhelming evidence of guilt under the valid portion of the jury charge.\n\nAdams, supra at 1362.\n\nPetitioner claims that the Adams holding shows that the ruling by the Florida Supreme Court cannot be determinative as it employed a legally erroneous standard of review. A close reading of the Adams case and Stromberg v. California, 283 U.S. 359, 75 L. Ed. 1117, 51 S. Ct. 532 (1931) shows that Petitioner's reliance on these cases is misplaced. Stromberg held that \"a conviction cannot be upheld if (1) the jury was instructed that a guilty verdict could be returned with respect to any one of several listed grounds, (2) it is impossible to determine from the record on which ground the jury based the conviction, and (3) one of the listed grounds was constitutionally invalid.\" Adams, supra at 1361 (citing Stromberg v. California, 283 U.S. 359, 368, 51 S. Ct. 532, 535, [75 L. Ed. 1117] (1931)) (emphasis added by this Court). The third prong of the Stromberg enunciation is required for a Stromberg attack upon a conviction; its inclusion in the Stromberg language is preceded by the conjunctive \"and\" rather than the disjunctive \"or.\" Indeed, the very trigger of a Stromberg attack is the presence of a listed ground upon which a jury might convict that is constitutionally invalid.\n\nThus, the Adams case examined in part whether Petitioner Adams's conviction could be sustained in the face of a Stromberg attack where the verbal charge given the jury during the guilt-innocence proceedings listed, as murder in the first degree, both premeditated murder and felony murder, with the latter being defined as killing during the commission of, or an attempt to commit, \"rape. . . abominable and detestable crime against nature or kidnapping . . .\" (and where the reference to rape was erroneous under Florida law and the Florida statute prohibiting abominable and detestable crimes against nature had been declared unconstitutional before the petitioner's trial). The Adams court was concerned with the proper approach to examining the propriety and sufficiency of jury instructions where the instructions created the possibility that a defendant might have been convicted of a crime that did not exist under state law or under a statute previously held to be unconstitutional. The Stromberg case and the portion of Adams relied upon by Petitioner are not concerned with the failure to instruct the jury on the elements of the underlying felonies. Instead, they deal with instructions which contain misstatements of the law (certainly the inclusion in a jury charge of a constitutionally invalid ground qualifies as a misstatement of the law).\n\nIn Petitioner Muhammad's case the trial court's charge to the jury did not set forth as a ground for conviction the violation of a statute previously held unconstitutional. It is crystal clear from the record that when the prosecution or the trial court referred to underlying felonies committed by the Defendant, the references were to robbery and kidnapping. Both exist under Florida law. Neither was declared unconstitutional prior to petitioner's trial. Therefore, Petitioner's reliance on Stromberg and Adams is inappropriate.\n\nThis Court is faced with jury instructions which contained omissions, or incomplete instructions, rather than misstated or erroneous elements. The standard is \"whether the ailing instruction by itself so infected the entire trial that the resulting conviction violates due process,\" Cupp v. Naughten, 414 U.S. [141] at 147, 38 L. Ed. 2d 368, 94 S. Ct. 396, not merely whether \"the instruction is undesirable, erroneous or even 'universally condemned,'\" Id., at 146, 38 L. Ed. 2d 368, 94 S. Ct. 396. Henderson v. Kibbe, 431 U.S. 145, 52 L. Ed. 2d 203 at 212, 97 S. Ct. 1730 (1977). Further, \"an incomplete instruction is less likely to prejudice the defendant than one which is substantively incorrect. See Henderson v. Kibbe, supra 431 U.S. at 155, 97 S. Ct. at 1737. Moreover, a claim of prejudice is particularly remote where the defendant did not object to the instructions' lack of completeness when the opportunity arose. Id. Such is the status of the petitioner's claim here. The jury instruction was not substantively erroneous, just incomplete. The Petitioner's trial counsel did not object or move for further instructions. \". . . Under the circumstances, the possibility that the jury would have reached a different verdict . . . 'is too speculative to justify the conclusion that constitutional error was committed.' Id. at 157, 97 S. Ct. at 1738.\" Adams, supra at 1364-65.\n\nThe Court is in accord with the Florida Supreme Court that the failure to instruct on the underlying felonies was harmless error. In finding that there was no prejudice, the court held:\n\nAn argument could be made under the facts of this case that giving the underlying felony instruction would have been more of a detriment than a benefit to this petitioner. This stems from the fact that one of the arguments of the petitioner at trial was the lack of direct evidence that Knight actually killed the victims. Indeed, the record reflects that there was strong circumstantial evidence but no direct eyewitness evidence of the actual killings, in contrast to the considerable direct evidence, including numerous law enforcement eyewitnesses, that Knight was the perpetrator of the kidnapping and the robbery.\n\nHowever, the record in this cause, and in particular, the final argument of counsel demonstrates that the state, although it mentioned felony murder, strongly argued premeditated murder to the jury. The record reflects that there is not only sufficient but overwhelming evidence of premeditated murder. . . . We are satisfied beyond a reasonable doubt that the failure to give the instruction at issue was not prejudicial and did not contribute to the petitioner's conviction. See Chapman v. California, 386 U.S. 18, 87 S. Ct. 824, 17 L. Ed. 2d 705 (1967).\n\nKnight, supra at 1002; see also, e.g., Henderson, supra at 214 n.16.\n\nThe record reflects that the premeditated murder theory was the primary ground stressed by the state. The indictment returned against the Petitioner charged premeditated murder. The prosecution, as discussed above, strongly argued the calculated premeditative nature of the killings and the preparations of the Petitioner in anticipation of the acts. Under Florida law, premeditation can be shown by circumstantial evidence and may be inferred from evidence such as the nature of the weapon used, the presence or absence of provocation, previous difficulties between the parties, the manner in which homicide was committed, and the nature and manner of the wound inflicted. Way v. Wainwright, 786 F.2d 1095, 1096 (11th Cir. 1986)(citing Sireci v. State, 399 So.2d 964, 967 (Fla. 1981)). In this case, the jury was exposed to an overwhelming amount of circumstantial evidence showing premeditation.\n\nThe trial judge, in his charge, spent considerable time discussing the premeditated design theory and instructing the jurors accordingly. He reminded the jury that the indictment charged premeditated design and described the various classes of homicide and the elements involved. While the judge did comment on felony-murder in his discussion of the kinds of first degree murder under Florida law, his mentions of felony-murder merely tracked the statutory language on first-degree murder. The instructions' omissions did not extend in any way to the instructions on premeditated murder. The premeditated murder instructions given were specific and fully detailed. R. 3573-75. Thus, this case is unlike Glenn v. Dallman, 686 F.2d 418 (6th Cir. 1982), where the harmless error rule was held inapplicable because the instructions were incomplete as to the only crime charged. Cf. Adams, supra at 1364. The omissions in the instructions did not leave the jury guessing as to the elements of the only crime with which petitioner was charged. See In Re: Winship, 397 U.S. 358, 364, 25 L. Ed. 2d 368, 90 S. Ct. 1068 (1970). The jury was carefully instructed on the varying gradations and respective elements of homicide, focusing on premeditated murder.\n\nAccordingly, I am convinced that the trial court's omission as to the elements of the underlying felonies was harmless beyond a reasonable doubt. See Chapman, supra at 711. Here there was ample evidence of premeditation aside of the evidence of the felonies. See also, e.g., State v. Pinder, 375 So.2d 836 (Fla. 1979) at 839; R. at 3467-70 (summation by state in closing). Petitioner Muhammad was not prejudiced by the trial court's instructions as delivered such that the \"ailing instruction[s]\" violated his rights to due process. I conclude further that the verdict would not have been different if the elements of the underlying felonies for the secondary theory of felony-murder had been included in the instructions.\n\nV. JURY INSTRUCTIONS\n\nPetitioner contends that the jury should have been instructed concerning the consequences of a successful insanity defense, i.e. that if Petitioner were found not guilty by reason of insanity, he would have been committed to a state psychiatric hospital. Absent this information, Petitioner asserts that his jury was permitted to speculate concerning whether a verdict of not guilty by reason of insanity might allow the Petitioner to go free. In his favor, Petitioner cites this Court to an excerpt taken from the Prosecutor's summation that arguably injects speculation into the fact finding process:\n\nBut at any rate, as a jury, no matter what the evidence, you can disregard that evidence if you wish and turn that man loose, walk him out of this courtroom as though nothing had ever happened and nobody can stop you.\n\nR. at 3464.\n\nRespondent contends that the Florida Supreme Court decided this issue as a matter resting on an adequate foundation of state substantive law in Muhammad v. State, 426 So.2d 533, 536 (Fla. 1982). This argument assumes that federal habeas review is barred by the doctrine set forth in Wainwright v. Sykes, 433 U.S. 72, 53 L. Ed. 2d 594, 604, 97 S. Ct. 2497 (1977). However, the Florida Supreme Court reviewed the merits of Petitioner's claim along with Petitioner's claim regarding ineffective assistance of appellate counsel. In that context, Petitioner argued that his appellate counsel was ineffective by failing to preserve this issue for appeal. Thus, this Court's habeas review is not barred by Wainwright v. Sykes.\n\nOn July 8, 1976, the Florida Supreme Court decided Roberts v. State, 335 So.2d 285 (Fla. 1976). The Roberts rule was designed to avoid \"confusion and wonderment as to the possible practical effect of a verdict of not guilty by reason of insanity . . . Jurors will be able to weigh the evidence relating to the factual existence of legal insanity in an atmosphere untroubled by the distracting thought that such a verdict would allow a dangerous psychopath to roam at large.\" Id. at 289. The Florida Supreme Court adopted the \" Lyles rule\" espoused by the D.C. Circuit Court of Appeal in Lyles v. U.S., 103 U.S. App. D.C. 22, 254 F.2d 725 (D.C. Cir. 1957). The Lyles court held that \"whenever hereafter the defense of insanity is fairly raised, the trial judge shall instruct the jury as to the legal meaning of a verdict of not guilty by reason of insanity in accordance with the expressed view in this opinion.\" Id. at 729. Relying on Roberts, the Petitioner argues that he was denied a federal constitutional right to have a judge instruct the jury to the consequences of a verdict of not guilty by reason of insanity.\n\nThe Florida Supreme Court decided Roberts after Petitioner's trial and after briefs had been submitted and oral argument in the direct appeal of his conviction. Petitioner did not ask the trial court for a jury instruction concerning the consequences of a not guilty by reason of insanity verdict. Instead, Petitioner argued this issue in his state Petition for Habeas Corpus in connection with his charge that his appellate counsel was ineffective in not anticipating the Roberts rule. Because Petitioner did not preserve this issue for his state appeal, Roberts does not apply. As the Florida Supreme Court found in Knight v. State, 394 So.2d 997, 1003 (Fla. 1981), \"clearly our Roberts decision did not adopt a rule of law dictated by the United States Supreme Court, the United States Constitution, or the Florida Constitution, nor did it apply retroactively to any pending decisions except those in which the issue had been preserved and which were actually pending on appeal.\" It can only be inferred that the Florida Supreme Court intended to confine the Roberts rule to a state law issue. Issues of state law are ordinarily immune from federal review. Francois v. Wainwright, 741 F.2d 1275, 1281 (11th Cir. 1982, en banc).\n\nPetitioner's charge that his appellate counsel should have preserved this issue on appeal in anticipation of Roberts is without force. There is no requirement that counsel, to be reasonably effective, must anticipate changes in the law. Parker v. North Carolina, 397 U.S. 790, 25 L. Ed. 2d 785, 792, 90 S. Ct. 1458, 1462 (1970); Alvord v. State, 396 So.2d 184, 191 (Fla. 1981).\n\nThe Roberts case was decided after Petitioner's state appeal. As fashioned by the Florida Supreme Court, Roberts did not vest Petitioner with the retroactive right to a jury instruction at his trial concerning the consequences of a not guilty by reason of insanity verdict. As the Florida Supreme Court noted, this issue is a matter of state law determined adversely to Petitioner in Knight v. State, 394 So.2d 997, 1002-3 (Fla. 1981). In Knight, the Florida Supreme Court held that Roberts did not apply to Knight because Petitioner's appellate counsel did not preserve the issue on appeal. Effectively, this decision meant that McClure v. State, 104 So.2d 601 (Fla. 3 DCA1958) applied at Petitioner's trial. Under the McClure rule, while the trial court \"may instruct the jury as to the consequences of a verdict of not guilty by reason of insanity, a refusal to do so does not constitute error.\" Roberts, 335 So.2d at 288.\n\nVI. DUE PROCESS AT SENTENCING PHASE\n\nPetitioner argues that he was denied due process at the sentencing phase of his trial. Because of the asserted due process deprivation at sentencing, Petitioner claims that the death sentence recommended by the jury and imposed by the judge was improper. Petitioner alleges that specific violations occurred at his sentencing through inadequate jury instructions, improper prosecutorial argument, a non-unanimous jury recommendation, defense counsel's ineffective assistance at the sentencing phase, and the excessive and disproportionate sentences imposed.\n\nPetitioner's claim of ineffective assistance at sentencing will be addressed separately.\n\nPetitioner maintains that the trial court failed to specify which felonies were being referred to when the jury was instructed that one of the statutory aggravating circumstances was that the capital felonies were committed while the defendant was engaged in the commission of any robbery, rape, arson, burglary, kidnapping, or aircraft piracy or the unlawful throwing, placing or discharging of a destructive device or bomb. The Magistrate's Report states that \"the jury had sat through . . . [the] trial and knew full well that Sydney and Lillian Gans were murdered during the course of a robbery and kidnapping.\"\n\nThis Court finds that there was no way the jury could not have known which of the enumerated felonies were applicable in the case after having heard the cumulative testimony and arguments presented. Further, the prosecution repeatedly told the jury that the underlying felonies involved were robbery and kidnapping. See R. at 3467, 3567, 3624-25.\n\nAs a second ground for finding taint in the sentencing procedure, Petitioner claims that the trial court failed to instruct the jury that the standard for a finding of mental disturbance was less stringent at the sentencing phase than at the guilt-innocence phase of the trial. The jury in this cause was not without the benefit of a specific and careful explanation, delivered by defense attorney Meadows, that the showing of mental disturbance for the mitigating circumstance of mental disturbance could be made under a less stringent standard than that required for a finding of incompetency to stand trial. R. at 3535-38. There was no objection raised by the prosecution to this explanation, which also mentioned that the lesser standard was provided for by statute. Given the specific and detailed explanation which was not disputed or questioned at all by the prosecution, this Court cannot find any error of constitutional magnitude stemming from the fact that the jury heard the explanation from defense attorney Meadows rather than from the court. The important thing is that the jury was informed that the standard for mental disturbance for the purpose of finding the presence of a statutory mitigating circumstance was a lesser standard than that for competency to stand trial.\n\nPetitioner claims that the trial court's instructions restricted the jury's consideration of mitigating circumstances only to those listed in the statute. The state court rejected this claim on the ground that it presupposed that counsel was expected to anticipate the decision in Lockett v. Ohio, 438 U.S. 586, 98 S. Ct. 2954, [57 L. Ed. 2d 973] (1978). Muhammad v. State, 426 So.2d at 538. Petitioner's claim cannot be rejected out of hand solely upon the above-stated basis. A court should consider the status of Florida's law on the date of sentencing, the trial record, and proffers of non-statutory mitigating evidence claimed to be available. Hitchcock v. Wainwright, 770 F.2d 1514 (11th Cir. 1985)(en banc) at 1517.\n\nAt the time of Knight's sentencing, the confusion in Florida law had not yet been, at least, partially alleviated by Lockett and obviously had not been clarified by the later decision in Songer v. State, 365 So.2d 696, 699 (Fla. 1978). Because these decisions had not yet been issued, it is important to examine the record at sentencing to evaluate the claim of petitioner.\n\nThe Court concludes that this claim is without merit in light of the fact that the defense discussed non-statutory mitigating circumstances without limitation by the trial judge. Further, although the trial judge did not find that there were any mitigating circumstances present, statutory or otherwise, there was no indication that the judge did not consider everything presented. See Palmes v. Wainwright, 725 F.2d 1511 (11th Cir.), cert. denied, 469 U.S. 873, 105 S. Ct. 227, [83 L. Ed. 2d 156] (1984).\n\nThe instructions given to the jury do not appear to have been restrictive. Defense counsel, in fact, argued the existence of non-statutory mitigating circumstances to the jury seemingly without limitation (although arguably some of the non-statutory mitigating factors were discussed in conjunction with defense counsel's presentation on mental disturbance as a mitigating circumstance). Moreover, Attorney Matthews testified at this Court's evidentiary hearing that he knew the judge was not restricting the defense to statutory mitigating circumstances.\n\nDefense counsel argued that the death penalty should not be recommended because there was no proof that it was a deterrent to future crimes. R. 3633. Defense counsel also discussed the failure of society to deal with the underlying causes of crime.\n\nAnd I want to suggest to you, as you consider the verdict in this case, that there is a very important factor involved here as far as society is concerned and as far as I get into the discussion now of the mitigating factors which I believe are appropriate.\n\nI want to discuss to you that all of society's efforts have been fruitless and have really not done much to prevent crime because we have not dealt with the real basic problem, and that's the roots, the causes, the basic underlying causes of crime.\n\nAnd I believe that relates to Thomas Knight, and its appropriate for you to consider that in your deliberations as to the punishment for him.\n\nR. at 3634-35.\n\nThe failure of society to deal with \"the roots\" and \"causes of crime\" is not a statutorily listed mitigating circumstance, yet it was presented to the jury.\n\nPetitioner Knight's family background was referred to by defense counsel at the sentencing phase.\n\nThere's other testimony that has been put in evidence today, you know, about his family background, the circumstances under which he grew up.\n\nR. 3639.\n\nWhile Petitioner's family background and tragic circumstances were not extensively discussed, because defense counsel instead emphasized other points relating to Petitioner's mental state, it cannot be said that the defense or the jury was precluded from giving weight to Knight's background or other circumstances presented in the mitigation argument.\n\nDefense counsel again mentioned the lack of guidance the defendant had received when he was a youth.\n\nI want to suggest to you, though, that it's appropriate for you to consider this. Is he to be blamed a hundred percent for what happened to him for what he did and for what has happened to him or does society have some responsibility in this matter? Where along the line as this young man was growing up was there a person who either had, either took time or had time to really give him some assistance as he was developing his mind?\n\nR. 3641.\n\nIn this cause, the defense counsel were not restricted in any way from presenting any mitigating circumstances that they desired to put before the jury and the judge. The Florida Supreme Court found that the trial court considered all of the relevant aggravating and mitigating circumstances, 394 So.2d at 1003, and this Court agrees and finds that because non-statutory mitigating factors were discussed by defense without objection or limitation by the court, the trial court's instructions on this point were not unconstitutionally restrictive.\n\nThe record shows that the trial court advised the jury that if mitigating circumstances outweighed the aggravating circumstances, the defendant should not be recommended for the death penalty. R. 3615-16. The trial judge further instructed the jury that aggravating circumstances must be established beyond a reasonable doubt, and that evidence on an aggravating circumstance which failed to meet that burden should be disregarded. R. 3618-19. Accordingly, the Court finds that the trial court did not impermissibly shift the burden of proof onto defendant.\n\nIf one or more aggravating circumstances are established, you should consider all the evidence tending to establish one or more mitigating circumstances and give that evidence such weight as you feel it should receive in reaching your conclusion as to the sentence which should be imposed.\n\nR. at 3619 (emphasis added).\n\nWith the above statement, the trial court made it clear that the balancing of the aggravating and mitigating circumstances was not simply a mere counting process. See State v. Dixon, 283 So.2d 1 (Fla. 1973) at 9-10.\n\nPROSECUTORIAL ARGUMENT\n\nPetitioner argues that the prosecutor made remarks during closing argument that were improper, inaccurate, misleading, inflammatory and designed to divert the jury from its proper function in recommending a penalty. The prosecutor's closing argument, Petitioner asserts, violated his Eighth Amendment right to be free from the improper imposition of the death penalty.\n\nThe allegedly improper remarks complained of are summarized as follows:\n\nYou having heard the facts, being best acquainted with the kind of trauma that is inflicted upon people who are the victims of kidnapping, the kind of pain that is inflicted upon a man who knows his wife is being held hostage, the kind of pain that is inflicted upon a woman who is being forced at gun point to drive around while her husband gets together fifty thousand dollars ransom for her. You are in the best position to determine whether the kind of cruelty that the law talks about is involved in this case.\n\nThere is nothing that was said by the defendant during his interviews with the various doctors who interviewed him that to me indicated any reflection or remorse or sorrow for anything that had happened in this situation.\n\nIs this the kind of situation in which we want to announce to everyone that if you do kidnap for ransom and if you do kill people during the course of that kidnapping, that you can expect the people of the State of Florida will forfeit your life for what you have done.\n\nThere is something that you can do that will speak louder than anything I can say and in a voice that will carry far more weight than the voice I have through my office or in any other way, and that is that you can announce through your advisory recommendation to the people of this community, to the people of this State, to the people who hear about it or know about it anywhere that your feeling is that anyone who commits a kidnap for ransom and during the course of that kidnapping murders the victims will forfeit his life.\n\nThe Florida Supreme Court has passed on the question of the prosecutorial remarks, albeit in the context of an ineffectiveness of counsel at sentencing claim. The state court held:\n\nMuhammad v. State, 426 So.2d 533, 538 (Fla. 1982).\n\nThis Court will address petitioner's claim on alternate grounds. First, the Court will review the state's argument that this claim is barred from federal habeas corpus review because no objection was made at trial and the issue was not raised on direct appeal.\n\nWhere no objection to prosecutorial comments is made at trial or raised on direct appeal, a federal court will usually be barred from reviewing a claim of error based thereon. See generally Engle v. Isaac, 456 U.S. 107, 71 L. Ed. 2d 783, 102 S. Ct. 1558, reh. den., 456 U.S. 1001, 73 L. Ed. 2d 1296, 102 S. Ct. 2283 [2286] reh. den., 457 U.S. 1141, 73 L. Ed. 2d 1361, 102 S. Ct. 2976 (1982); United States v. Frady, 456 U.S. 152, 71 L. Ed. 2d 816, 102 S. Ct. 1584 (1982); Wainwright v. Sykes, 433 U.S. 72, 97 S. Ct. 2497, [53 L. Ed. 2d 594] (1977); Washington v. Estelle, 648 F.2d 276 (5th Cir. 1981), cert. denied, 102 S. Ct. 402, [454 U.S. 899, 74 L. Ed. 2d 216]. If, however, sufficient cause can be shown why an objection at trial was not made and actual prejudice can be shown to have been worked on the defendant by the failure to object, a federal court will not be barred from reviewing the claim. Frady, supra; Sykes, supra; Washington v. Estelle, supra.\n\nAn allegation of ineffective assistance of counsel is not sufficient to satisfy the cause requirement. Washington v. Estelle, supra; Lumpkin v. Ricketts, 551 F.2d 680 (5th Cir. 1977), cert. denied, 434 U.S. 957, 98 S. Ct. 485, [54 L. Ed. 2d 316]; Sullivan v. Wainwright, 695 F.2d 1306 (11th Cir. 1983); Dobbert v. Wainwright, 593 F. Supp. 1418, 1442 n.18 (M.D. Fla. 1984), aff'd, 742 F.2d 1274 (11th Cir.), cert. denied, 468 U.S. 1231, 82 L. Ed. 2d 925, 105 S. Ct. 34 (1984). However, proof of ineffective assistance of counsel may, at times, be sufficient to satisfy the cause requirement if properly raised. Birt v. Montgomery, 725 F.2d 587 (11th Cir. 1984). In order to prevail in federal habeas corpus upon a claim of ineffective assistance of counsel, the Petitioner must show both that his lawyer did not render reasonably effective assistance and that there is a reasonable probability that but for counsel's unprofessional errors, the result of the proceeding would have been different. Strickland v. Washington, 466 U.S. 668 [104 S. Ct. 2052], 80 L. Ed. 2d 674 (1984). A reasonable probability is a probability sufficient to undermine confidence in the outcome. King v. Strickland, 748 F.2d 1462, 1463 (11th Cir. 1984). The standard for determining ineffectiveness of counsel is the same for both the guilt and sentencing phase of a trial. Id. [104 S. Ct. at 2064], 80 L. Ed. 2d at 693; King, 748 F.2d at 1463. A defendant challenging a death sentence must show that without the error there is a reasonable probability that the balance of aggravating and mitigating circumstances did not warrant death. Messer v. Kemp, 760 F.2d 1080 (11th Cir. 1985) (citing King, supra, quoting Strickland v. Washington, supra, 80 L. Ed. 2d at 698).\n\nA determination of whether reasonably effective assistance of counsel was rendered is based upon the totality of circumstances in the entire record. Messer, 760 F.2d at 1092; Washington v. Estelle, 648 F.2d at 279. In view of the efforts of counsel for Knight throughout the trial and sentencing as fully reflected in the record and in light of the overwhelming evidence presented at trial, this Court cannot but conclude that even if defense counsel had objected to the challenged prosecutorial remarks the balance of aggravating and mitigating circumstances would have been unaffected. (The Court has taken into account the efforts of defense counsel at trial, including but not limited to, the tenacious voir dire, which resulted in the excusal of a partially impanelled jury; the proffer of pretrial publicity and motion for change of venue; the motion for additional peremptory challenges; the proffer of defense witness Duval; the motions for bill of particulars; and at sentencing, when the defense actively participated in setting the sequence of closing arguments and rebuttals, presented three separate closing arguments, and requested and obtained additional instructions from the court to the jury on the requirement of a majority vote on advisory sentence). Accordingly, Petitioner has not demonstrated that the outcome of the case has been undermined. A careful review of the entire record and of the sentencing proceeding in particular suggests otherwise. Thus, Petitioner has failed to meet his \"burden of showing that the decision reached would reasonably likely have been different absent the [alleged] errors.\" Strickland v. Washington, 80 L. Ed. 2d at 699.\n\nFurther, as the state court noted, defense counsel's failure to remark \"could have been based on sound tactical reasons,\" United States v. Gibbs, 662 F.2d 728, 730 (11th Cir. 1981), as counsel may well have wished to avoid bringing the jury's attention back to the remarks by objecting and requesting a curative instruction by the trial judge. Muhammad, 426 So.2d at 538. Counsel's actions in such event, would not have fallen outside the wide range of reasonable professional assistance. Messer v. Kemp, 760 F.2d at 1092.\n\nTherefore, as Petitioner has not shown that counsel's actions in not objecting to the remarks constituted ineffective assistance of counsel, the requisite showing of \"cause\" has not been made. The Court, then, need not consider the \"actual prejudice\" question; this claim of Petitioner is barred by the lack of \"cause\" by Sykes and Engel from federal review. However, assuming arguendo that Petitioner could show both cause and actual prejudice (the overwhelming evidence against Petitioner and the multiple aggravating circumstances found by the court strongly mitigate against such a finding), this Court is of the opinion that the remarks complained of would not warrant the relief sought by Petitioner.\n\nThe Eleventh Circuit has concluded that \"the Strickland v. Washington test, requiring an assessment of errors to determine whether there is a reasonable probability that they changed the outcome of a case, is applicable to our analysis of whether improper closing arguments delivered by the prosecuting attorney rendered the capital sentencing hearing fundamentally unfair.\" Brooks v. Kemp, 762 F.2d 1383 (11th Cir. 1985). The Eleventh Circuit further noted that the use of this test is consistent with the need for high reliability in imposition of the penalty. Id. at 1402 n.28. The test is found in Johnson v. Wainwright, 778 F.2d 623, 630 (11th Cir. 1985):\n\nPetitioner asserts that the Strickland v. Washington/Brooks v. Kemp test for evaluating a claim of improper prosecutorial argument is incompatible with the test enunciated in Caldwell v. Mississippi, [472 U.S. 320, 105 S. Ct. 2633, 2646], 86 L. Ed. 2d 231 (1985).\n\nIn Caldwell, the Supreme Court in evaluating the impact of an improper argument used by the prosecutor at the penalty phase of Caldwell's trial concluded:\n\nBecause we cannot say that this effort [to minimize the jury's responsibility for determining the appropriateness of the death penalty] had no effect on the sentencing decision, that decision does not meet the standard of reliability that the Eighth Amendment requires.\n\nAlthough the dissenting opinions in several cases opine that the Strickland v. Wainwright/Brooks v. Kemp test is incompatible with or different from the Caldwell standard, see Bowen v. Kemp, 778 F.2d 623 (11th Cir. 1985)(Judges Kravitch, Johnson and Clark, dissenting); Brooks v. Kemp, 762 F.2d at 1448-49 (Judges Clark, Kravitch and Johnson, dissenting), the Eleventh Circuit has addressed this contention and rejected it in denying the petition for rehearing en banc in Bowen v. Kemp, 776 F.2d 1486 (11th Cir. 1985).\n\nIn addition, the Fifth Circuit has held that where improper prosecutorial argument is claimed in a case not involving prosecutorial comments designed to shift the burden of decision from the jury, Caldwell is not controlling. Kirkpatrick v. Blackburn, 777 F.2d 272, 284 (5th Cir. 1985).\n\nWhile it is not for this Court to resolve any conflict between the two standards, if such conflict truly exists, the Court can comfortably rule upon Petitioner's claim here because under either standard Petitioner is not entitled to relief.\n\nPetitioner complains first that during his argument for the finding of the statutory aggravating circumstance that the capital felony was especially heinous, atrocious or cruel, the prosecution improperly mentioned the trauma experienced by the victims before the murders. At the guilt innocence phase, the state asked a doctor, whose prior testimony had concerned the cause of the victims' deaths and the instantaneous nature thereof, whether the victims had suffered before the shootings. The defense objected and the trial court sustained the objection but permitted the doctor to answer out of the presence of the jury. The doctor replied that he could not answer the question. The judge then called the question irrelevant and resustained the objection.\n\nIt is clear that the question of suffering or emotional or mental trauma experienced by the victims was entirely irrelevant to the determination of whether the defendant was guilty of the crimes charged. It is equally clear, however, that discussion of factors showing especially heinous, atrocious or cruel nature of the killings was relevant where such factors were related to the finding of a statutory aggravating circumstance.\n\nImportantly, the prosecutor specifically called upon the jurors to assess the facts of the case in conjunction with their collective common sense. The prosecutor did not recount evidence which had not been presented. Rather, in a brief statement, the prosecutor recounted the ordeal of the Ganses and told the jury that they were in the best position to determine whether the aggravating circumstance should be found. The prosecutor did say that the jury, having heard the facts, was best acquainted with the kind of trauma inflicted upon victims of protracted kidnappings.\n\nI find no constitutional error in the prosecutor using the word trauma when describing those events into which Mr. and Mrs. Gans were projected at the day in question. While part of his argument may have gone a bit far in asking the jury to evaluate the trauma on an experiential basis, it was not sufficiently egregious to provide a basis for constitutional error. It is unlikely that this conduct changed the course of the trial.\n\nMany cases in Florida have held that the heinous, atrocious or cruel capital felony aggravating circumstance can be properly found based upon the mental anguish inflicted upon victim(s) of kidnappings or robberies who were later murdered, even when death occurred instantaneously. The common element in these cases is that, before the instantaneous death occurred, the victims were subjected to agony over the prospect that death was soon to occur. Routly v. State, 440 So.2d 1257, 1265 (Fla. 1983); see Mills v. State, 462 So.2d 1075 (Fla. 1985), cert. denied, 473 U.S. 911, [105 S. Ct. 3538], 87 L. Ed. 2d 661 (1985); Stano v. State, 460 So.2d 890 (Fla. 1984), cert. denied, 471 U.S. 1111, 105 S. Ct. 2347, [85 L. Ed. 2d 863] (1984); Copeland v. State, 457 So.2d 1012 (Fla. 1984), cert. denied, 471 U.S. 1030, 105 S. Ct. 2051, [85 L. Ed. 2d 324] (1984); Smith v. State, 424 So.2d 726 (Fla. 1982), cert. denied, [ 462 U.S. 1145, 103 S. Ct. 3129], 77 L. Ed. 2d 1379; Griffin v. State, 414 So.2d 1025 (Fla. 1982); Steinhorst v. State, 412 So.2d 332 (Fla. 1982); Adams v. State, 412 So.2d 850 (Fla. 1982), cert. denied, 459 U.S. 882, [103 S. Ct. 182], 74 L. Ed. 2d 148 (1982); White v. State, 403 So.2d 331 (Fla. 1981).\n\nFrom the facts established at trial, the jury heard enough to reasonably conclude that the victims suffered mental anguish during the hours-long ordeal. The jury probably would have reached the same conclusion even had the prosecutor omitted the reference to the jury's acquaintance with trauma.\n\nJudge Clark has commented, in his dissenting opinion in Brooks v. Kemp, 762 F.2d at 1448, that \"the language used by the Supreme Court in Caldwell is, in essence, a paraphrase of the harmless error test used by the Court in numerous cases, most notably in Chapman v. California, 386 U.S. 18, 87 S. Ct. 824, 17 L. Ed. 2d 705 (1967).\"\n\nIt is this Court's conclusion that the error complained of above did not contribute to the verdict obtained, Chapman, 17 L. Ed. 2d at 710, and that it had no legally significant effect on the sentencing decision, Caldwell, 105 S. Ct. at 2646.\n\nPetitioner complains that the prosecutor erred by stating that there is nothing that was said by the defendant during his interviews with the doctors which indicated that he felt any remorse or sorrow. Significantly, Petitioner has not shown the Court that he indicated remorse or sorrow at any time during the proceeding to demonstrate that the prosecutor's comment was untrue. However, the prosecution did not harp on this point. It was mentioned once in only one sentence. The prosecutor did not single out Petitioner's lack of remorse as an aggravating circumstance. It is probable that this remark was harmless in that it had no effect on and did not contribute to the jury's sentencing recommendation under the Caldwell/Chapman standard. The Court bases its belief on the overwhelming evidence against the defendant and at trial the actions and outbursts of the defendant at trial. Further, the Court holds that this comment did not render the sentencing proceeding fundamentally unfair as it was not so egregious as to create a reasonable probability that the outcome was changed by its utterance. Wilson v. Kemp, 777 F.2d 621 (11th Cir. 1985) at 623 (citing Brooks v. Kemp, supra).\n\nPetitioner next complains that the prosecutor's comments did not encourage the jury to make an individualized determination as to whether Thomas Knight deserved the death penalty for his particular crime. Petitioner argues that the prosecutor's rhetorical question to the jury -- \"Is this the kind of situation in which we want to announce to everyone that if you do kidnap for ransom and if you do kill people during the course of that kidnapping, that you can expect the people of the State of Florida will forfeit your life for what you have done[?]\" -- and his entreaty to the jury to announce its feeling through its advisory recommendation that \"anyone who commits a kidnap for ransom and during the course of that kidnapping murders the victims will forfeit his life,\" discouraged an individualized sentencing determination. The Court disagrees with Petitioner's assertion. These comments were inextricably linked to the prosecuting attorney's earlier summation of the specific facts and circumstances of this particular case and were not rendered generic simply by the use of the phrase \"anyone who kidnaps.\" The jury knew the facts of the case and knew that the sentencing procedure revolved around the defendant Knight and his involvement in the case.\n\nThe Court finds no error in either of these comments by the prosecutor. Prosecutorial appeals to the conscience of the community are not impermissible unless calculated to inflame. United States v. Bascaro, 742 F.2d 1335 (11th Cir. 1984), cert. denied, 472 U.S. 1017, 105 S. Ct. 3476, 3477, 3488, 87 L. Ed. 2d 613 (1985); United States v. Alonso, 740 F.2d 862 (11th Cir. 1984), cert. denied, 469 U.S. 1166, 105 S. Ct. 928, 83 L. Ed. 2d 939. I cannot conclude that these comments were not designed to inflame the passions of the jury. They can be characterized as permissible appeals to the jury as the conscience of the community. The Court finds them not to have been prejudicial to the defendant.\n\nFurther, the Court finds no merit to Petitioner's contention that the comments reflect that the Attorney General's office made a preordained decision that this case merited the death penalty. Nothing in the closing argument by the prosecution sought impermissibly to bolster the already strong case against the defendant by playing upon the authority of the state attorney's office.\n\nFinally, Petitioner complains of certain remarks made by the prosecution in response to objectionable comments made by defense counsel in his closing argument. Defense counsel had argued to the jury that the defendant had an inalienable right to live under the guarantees of the constitution and that if the defendant were executed, he would not be able to appreciate his responsibility for his crimes. The following colloquoy was had:\n\nMr. Hutchinson: In closing argument, prior to your making your first decision, Mr. Gerstein commented that figuratively the blood of Lillian and Sidney Gans is on the hands of Thomas Knight. Well, there's nothing figurative about the blood of Thomas Knight being on your hands.\n\nMr. Gerstein: That's objectionable.\n\nThe Court: Sustained.\n\nMr. Hutchinson: If you condemn him to die --\n\nMr. Gerstein: That's improper.\n\nMr. Hutchinson: All men, all men have certain inalienable rights. The first one is life.\n\nThank you.\n\nMr. Gerstein: I have a very brief response to make about some of the things that have been said, and it is even my responsibility to respond and it will be very brief.\n\nAs I listened to Mr. Hutchinson, I could not help but wonder what plea Lillian and Sidney Gans must have made to Thomas Knight on the morning and afternoon of July 17, 1974. What were they saying to this defendant on that day as they asked for their inalienable right to live? That occurred to me and I think it needs to be said in this courtroom.\n\nJust two other things. As I said and I say to you again, we want you to decide this case based solely on justice. Lillian and Sidney Gans and the people of the State of Florida have a right to justice.\n\nFinally, in order for evil to flourish in our society it is only necessary that good people do nothing. You have a chance to do something.\n\nMr. Matthews: May it please the Court, Mr. Gerstein, Mr. Carhart, ladies and gentlemen of the jury, the Court has provided that the defendant could have this last opportunity to make a rebuttal to anything that the State may have said in rebuttal to our argument. The only thing that Mr. Gerstein really has said to you, and I assume that I will necessarily be limited to it, is in effect he has told you be emotional when you go consider your verdict. I simply can only say to you that the Judge is going to instruct you to the contrary that you are not to be emotional when you consider your verdict. We all have emotions. We have absolutely no way to erase them from the rest of your personality. They play a part in all of the decisions that all of us ever make, but I say to you and I submit to you that that and that alone certainly is not to be the controlling factor.\n\nPetitioner argues that the prosecutor's comments were impermissible in that they invited the jury to engage in impermissible speculation about the trauma felt by the victims prior to their murders. I have already covered this point in connection with a similar remark. The instant remark must be viewed in context. The defense counsel's comment to the jury that \"there's nothing figurative about the blood of Thomas Knight being on your hands\" was \"clearly an invitation to the prosecutor to protest to the contrary.\" United States v. Bascaro, 742 F.2d 1335 (11th Cir. 1984) (quoting United States v. Eley, 723 F.2d 1522, 1526 (11th Cir. 1984)). When the prosecutor goes no further than to take defense counsel up on his invitation, his conduct will not be regarded as impermissibly calculated to incite the passions of the jury. Id.\n\nIn any event, the prosecutor followed the remark with an admonition to the jury that the case must be decided based only on justice. Different defense counsel, who was not embroiled in the interchange, followed the prosecutor and told the jury not to be only emotional when considering the verdict. Finally, the judge later told the jury that their recommendation should be based only upon the evidence. Viewed in the context of the entire proceeding, the prosecutor's response to defense counsel's objectionable argument was, if error, harmless error under Chapman and Caldwell, which was instantly corrected both by the prosecutor and the defense.\n\nPetitioner is not entitled to relief based upon any prosecutorial remarks in this cause under either \"cause and prejudice\" analysis or based upon the merits of his claim.\n\nThis Court concludes that none of the prosecutorial remarks complained of were so prejudicial as to have rendered the entire sentencing proceeding fundamentally unfair. Johnson v. Wainwright, supra; Brooks v. Kemp, supra.\n\nVII. DISCRIMINATORY IMPACT OF THE DEATH PENALTY ON THE BASIS OF THE RACE OF THE VICTIM\n\nPetitioner challenges the Magistrate's Report and alleges that the Eleventh Circuit decisions in McCleskey v. Kemp, 753 F.2d 877 (11th Cir. 1985) and Griffin v. Wainwright, 760 F.2d 1505 (11th Cir. 1985) compel this Court to grant his request for an evidentiary hearing to determine whether the death penalty in Florida is being applied in a racially discriminatory manner. Specifically, Petitioner alleges that certain statistical studies show disparate application of the death penalty in Florida.\n\nRecently, the Eleventh Circuit, in Griffin v. Wainwright, recognized the fact that a modification to its rule in Spinkellink v. Wainwright, 578 F.2d 582 (11th Cir. 1978) had occurred in Smith v. Balkcom, 671 F.2d 858 (5th Cir. 1982) and McCleskey v. Kemp, supra. In part, this change arose out of the court's decision that \" Spinkellink cannot be read to foreclose automatically all Eighth Amendment challenges to capital sentencing conducted under a facially constitutional statute.\" McCleskey, 753 F.2d at 891. Instead of rejecting McCleskey's Eighth Amendment argument out of hand, the Eleventh Circuit undertook a detailed analysis to determine the impact that a statistical study has on a court's decision regarding the imposition of the death penalty on the basis of race of the victim. Our discussion of Petitioner's instant claim necessarily follows the comprehensive outline set forth by the McCleskey court.\n\n1. Statistical Study\n\nThe McCleskey court considered a quantitative analysis regarding the imposition of the death penalty. See Baldus, Pulaski, Woodworth \u0026 Kyle, Identifying Comparatively Excessive Sentences of Death: A Quantitative Approach, 33 Stan.L.Rev. 1 (1980) (hereinafter referred to as the \"Baldus study\"). The authors of the Baldus study conducted several statistical tests on data concerning the imposition of sentences in homicide cases to determine the level of disparities attributable to race in the imposition of the death sentence. The McCleskey court reviewed the different methods of statistical study as well as the number of death penalties meted out in Georgia and found that \"Baldus conceded that it was difficult to draw any inference concerning the overall race effect in these cases . . . [and that] there was only a possibility that a racial factor existed in McCleskey's case.\" McCleskey, 753 F.2d at 887.\n\n2. Evidentiary value that statistical studies have in establishing ultimate facts which control a constitutional decision\n\nThe McCleskey court recognized the usefulness of statistical studies as they impact upon the judicial decision-making process. However, statistical studies have inherent limitations in aiding a court to \"explain the specific intent of a specific behavioral situation.\" Id. at 888. Historically, \"the 'Brandeis Brief' is a well-known technique for asking the court to take judicial notice of social facts. It does not solve the problem of how to bring scientific materials to the attention of the court . . . . Brandeis did not agree that the data were valid, only that they existed. . . .\" Id. Thus, in assessing McCleskey's claim, the court found that the main obstacle lay in determining the degree of deference the court should give to statistical studies in light of the standard of proof that petitioner needed to show in order to prevail on his claim. While recognizing that such studies might tend to show disparate impact on the basis of race, the court reinforced the general rule that evidence of disparate impact must be so strong that the only permissible inference is one of intentional discrimination against the petitioner. See Adams v. Wainwright, 709 F.2d 1443, 1449-50 (11th Cir. 1983); Smith v. Balkcom, 671 F.2d 858, 859 (5th Cir. 1982). \"Where intent and motivation must be proved, the statistics have even less utility. However. . . statistics, under certain limited circumstances might prove intent. . . .\" Id. at 889.\n\n3. The Constitutional standard for assessing Petitioner's Eighth and Fourteenth Amendment claims\n\nPetitioner avers that the Florida death penalty is imposed in a discriminatory fashion. Specifically, he alleges that the discrimination lies in cases where courts have applied the penalty disproportionately against impoverished black males convicted of killing white individuals. Petitioner alleges that this practice violates the Eighth and Fourteenth Amendments to the United States Constitution.\n\n\"A successful Eighth Amendment challenge requires that the race factor was operating in such a pervasive manner that it could fairly be said that the system was irrational, arbitrary and capricious.\" Id. at 891. Implicit in a Fourteenth Amendment claim is the prohibition that \"a state may not attach the 'aggravating' label as an element in capital sentencing to factors that are constitutionally impermissible or totally irrelevant to the sentencing process such as race. Due process would prevent a state from explicitly making the murder of a white victim an aggravating circumstance in capital sentencing.\" Id. at 891. Where, as in the instant case, the statute is facially neutral, the petitioner must set forth allegations supported by proof that the State of Florida (through its prosecutors, jurors or judges) has implicitly attached the aggravating label to race. Id. As in the Equal Protection context, Petitioner must show that race was \"a motivating factor\" in the death penalty decision. See Village of Arlington Heights v. Metropolitan Housing Development Corp., 429 U.S. 252, 50 L. Ed. 2d 450, 97 S. Ct. 555 (1977) (race as discriminatory factor in housing context). In a death penalty discrimination allegation such as this, race as a motivating factor is proved by the same evidence necessary for a valid Eighth Amendment claim: intent, purpose and motive to discriminate racially must be shown. See McCleskey, 753 F.2d at 892; Village of Arlington Heights, 429 U.S. at 264-66.\n\nThe McCleskey Court reviewed the Supreme Court decisions in Furman v. Georgia, 408 U.S. 238, 33 L. Ed. 2d 346, 92 S. Ct. 2726 (1972) and Gregg v. Georgia, 428 U.S. 153, 49 L. Ed. 2d 859, 96 S. Ct. 2909 (1976) in determining the constitutional standard to be applied in assessing death penalty discrimination claims. The Eleventh Circuit read Furman to be an instance where the Supreme Court struck down the Georgia death penalty statute on Eighth Amendment grounds because the system operated arbitrarily and capriciously and not in a rational way by failing to distinguish adequately the few cases in which death was imposed from the many in which it was not. Id. at 890. Later, the Supreme Court approved the improved facially neutral Georgia death statute in Gregg v. Georgia. In accompanying opinions to Gregg, the Supreme Court approved the constitutionality of the death penalty statute in Florida. See Proffitt v. Florida, 428 U.S. 242, 49 L. Ed. 2d 913, 96 S. Ct. 2960 (1976). Thus, there arose a new method of examining the judicial practice of imposing the death penalty. After Gregg, racial discrimination in the application of a death penalty statute may only be shown when the petitioner alleges intent and motive. With these requisite elements in mind, proof of disparate impact (via statistical surveys) alone is insufficient to invalidate a capital sentencing system. The disparate impact must be so great that it \"compels a conclusion that the system is unprincipled, arbitrary, irrational and capricious such that purposeful discrimination (i.e., race intentionally used as a factor in sentencing) can be presumed to permeate the system.\" McCleskey, 753 F.2d at 892.\n\nThe Eleventh Circuit casts serious doubt over the question whether statistical studies alone are ever conclusive enough to show evidence of requisite intent or motive in an Eighth or Fourteenth Amendment claim. Here, the court found that generalized studies might never be sufficient to show specific intent. Rather, these studies have \"little hope of excluding every possible factor that might make a difference between crimes and defendant, exclusive of race.\" Id. at 893-94. The subjective factors that cannot be captured by generalized statistical studies include problems arising from the \"discretion with which a sentence is invested, not only will no two defendants be seen identical by the sentencers, but no two sentencers will see a single case precisely the same.\" Id. at 894.\n\nThe McCleskey court found the Baldus study an insufficient method of proof to overcome the presumption that the statute was operating in a constitutional manner. In part, the statistics set forth a relationship between the race of the perpetrator and the race of the victim. However, that relationship was not found to rise to a level which could be called determinative in any specific case. The Eleventh Circuit's rejection of the Baldus study is highly relevant to this Court's assessment of the degree of disparity shown in the Gross and Mauro study set forth by Petitioner in the case sub judice. In its analysis of the methodology utilized by Baldus, the McCleskey court noted that the Supreme Court rejected a study of lesser quality in method -- the Gross and Mauro study concerning, in part, the death penalty in Florida. The Eleventh Circuit's analysis of the Supreme Court's decision in Sullivan v. Wainwright, 464 U.S. 109, 78 L. Ed. 2d 210, 104 S. Ct. 450 (1983), found the Gross and Mauro study insufficient as a basis for a claim of racial discrimination in the application of the Florida death penalty statute. McCleskey, supra at 897. The McCleskey court finished its discussion of the Baldus study by finding its methodology insufficient to set forth an inference of intent that would rise to an Eighth or Fourteenth Amendment claim based on racial discrimination. Based on the Eleventh Circuit's discussion and rejection of the methodology employed in Baldus and its opinion that the Gross and Mauro study was inferior to the Baldus study, Petitioner has set forth insufficient facts to allege the requisite intent, motive or purpose necessary to justify an evidentiary hearing on its racial discrimination claim. This conclusion is fully supported by the Supreme Court's decision in Sullivan v. Wainwright.\n\nVIII. EFFECTIVENESS OF APPELLATE COUNSEL\n\nPetitioner Muhammad urges the Court to grant him habeas corpus relief on the grounds that his appellate counsel was ineffective. Specifically, Petitioner alleges that appellate counsel's failure to include in the record on appeal transcripts of witnesses' testimony at the pretrial competency hearing. Petitioner further points to appellate counsel's omission from the record on appeal of the items of supposedly prejudicial pretrial publicity. Finally, Petitioner contends that the poor writing style and low quality of his appellate brief prejudiced him.\n\nThe Court adopts the Magistrate's Report as to the state's waiver of the requirement of exhaustion on the issue of omissions from the appellate record. See Magistrate's Report at 49-51; see also Thompson v. Wainwright, 714 F.2d 1495 (11th Cir. 1983); Westbrook v. Zant, 704 F.2d 1487 (11th Cir. 1983).\n\nIt is well established that a defendant has the right to effective counsel on appeal. See Anders v. California, 386 U.S. 738, 741-42, 744, 87 S. Ct. 1396, 1398-99, 1400, [18 L. Ed. 2d 493] (1966); Alvord v. Wainwright, 725 F.2d 1282, 1291 (11th Cir. 1984). In order to prevail, a petitioner must show that reasonably effective representation was not rendered. Alvord, 725 F.2d at 1291 (citing Mylar v. Alabama, 671 F.2d 1299, 1300 (11th Cir. 1982), cert. denied, 463 U.S. 1229, [103 S. Ct. 3570], 77 L. Ed. 2d 1411 (1983)). However, counsel need not provide perfect assistance. Mylar, 671 F.2d at 1300. Counsel need not brief issues reasonably considered to be without merit. Griffin v. Wainwright, 760 F.2d 1505, 1515 (11th Cir. 1985). Counsel's failure to advance errors on appeal which later gain judicial recognition does not constitute ineffectiveness. Francois v. Wainwright, 741 F.2d 1275, 1985 [1285] (11th Cir. 1984). Appellate counsel also need not raise issues that he reasonably concludes will not be considered on the merits by the appeals court. Id. In order to prevail on a claim of ineffective assistance of appellate counsel, a petitioner must first demonstrate ineffective assistance of counsel, and then must show he suffered prejudice entitling him to relief. See Griffin, 760 F.2d at 1515 (citing Strickland v. Washington, [466 U.S. 668], 104 S. Ct. 2052, 2064, 80 L. Ed. 2d 674 (1984)).\n\nPetitioner claims that appellate counsel failed to provide effective assistance by omitting from the record on appeal the transcripts of the pretrial competency hearing. Petitioner alleges that if the transcript had been available, the Florida Supreme Court would have seen the error of the trial court's exclusion of defense witness Lt. Pat Duval. The trial transcript contained the testimony of Dr. Mutter on the issue of Knight's feelings about his father. Knight had expressed feelings of affection; Dr. Mutter found these expressions appropriate. He used these feelings as part of his conclusion that Knight was sane. Petitioner argues that inclusion of this transcript would have shown the need for the countervailing testimony of the excluded defense witness Lt. Duval. Without the transcript, Petitioner claims, the appellate court could not fairly evaluate the alleged error of the trial court in excluding Duval.\n\nThis Court has examined the trial court's evidentiary ruling that the testimony of Lt. Duval would not be allowed to reach the jury, and determined that the testimony sought to be introduced was properly excluded as remote and largely hearsay.\n\nPetitioner claims that the transcript's inclusion was necessary to show the appellate court that the trial court's exclusion of Lt. Duval was erroneous.\n\nThe transcript would have laid a predicate for the necessity of the testimony of Lt. Duval. Having found that the testimony of Lt. Duval was not necessary in that it was not crucial, critical or highly significant, the conclusion is compelled that the omission of the predicate-laying transcript itself was not ineffective assistance of counsel and could not have prejudiced Petitioner.\n\nPetitioner next would show the court that the omission of the record of pretrial publicity from the record on appeal was ineffective because the Florida Supreme Court could not have made an informed decision on the merits of this claim without the items of publicity. This Court has reviewed the sum of the pretrial publicity and has found that it cumulatively did not rise to the level of prejudice found in any of these cases in which relief had been granted on similar claims. Accordingly, it is this Court's conclusion that appellate counsel's asserted omission as to the pretrial publicity could not have prejudiced him because the pretrial publicity itself was not inflammatory or biased as to defendant's guilt such that prejudice must be presumed.\n\nFinally, Petitioner claims that the poor writing style of his appellate brief made it totally worthless. See, e.g., High v. Rhay, 519 F.2d 109 (9th Cir. 1975). The Florida Supreme Court considered all of the points urged by the appellant and discussed six of them at length. Knight v. State, 338 So.2d at 203; Knight v. State, 394 So.2d at 1001. On Knight's petition for state habeas corpus relief, the Florida Supreme Court considered four additional issues which should, Petitioner contended, have been presented on direct appeal. Between the considerations of this Court and the state habeas court, none of the four points left out on direct appeal have proven to be meritorious (trial court's failure to instruct on elements of underlying felonies, trial court's failure to instruct on consequences of verdict of not guilty by reason of insanity, trial court's exclusion of defense witness Lt. Duval, and trial court's application of statutory aggravating and mitigating circumstances and failure to find mitigating circumstances). As to these four points, Petitioner has not met his burden of showing that appellate counsel's failure to present them on direct appeal was prejudicial ineffective assistance of counsel.\n\nTurning to the question of the adequacy of Petitioner's appellate brief, the Court finds that the brief, while not a model of legal writing, does not sink to the level of unconstitutional ineffectiveness presented in High v. Rhay, supra, or Wilson v. Wainwright, 474 So.2d 1162 (Fla. 1985). Petitioner Muhammad cannot be said to have been functioning on direct appeal as if he was without appellate counsel. The Court finds that while there may be some question as to whether the Petitioner received reasonable assistance of counsel on his direct appeal, there has been no showing of prejudice by appellate counsel's performance.\n\nIX. ADEQUACY OF APPELLATE REVIEW\n\nThe Court finds that Petitioner's contention that he was denied adequate appellate review is without merit. The Supreme Court of Florida has reviewed this case three separate times and has written opinions each time. Petitioner specifically alleges deficiency in the appellate court's review of his claim of prejudicial pretrial publicity and his claim that there was inadequate balancing of aggravating and mitigating circumstances. Further deficiency in appellate review occurred, Petitioner alleges, from the appellate court's failure to note omissions in jury instructions and its acceptance for review of Petitioner's brief on appeal, which was said to be poorly drafted.\n\nPetitioner's claim that the appellate court failed to properly consider his claim of prejudicial pretrial publicity is inaccurate. The Florida Supreme Court examined the issue in detail. See Knight v. State, 338 So.2d 201 (Fla. 1976) at 203-04; Muhammad v. State, 426 So.2d 533 (Fla. 1982) at 537.\n\nPetitioner's claim that the Florida Supreme Court failed to conduct an informed examination of the trial court's assessment of aggravating and mitigating circumstances is also inaccurate. The Florida Supreme Court independently reviewed the appropriateness of the death penalty in this case through the evaluation of the aggravating and mitigating circumstances as found by the trial judge. See Knight v. State, 338 So.2d at 202-03; Knight v. State, 394 So.2d 997 (Fla. 1981) at 1003; Muhammad v. State, 426 So.2d 533 (Fla. 1982) at 538.\n\nPetitioner's complaint that the appellate courts failed to review the record on this point is baseless. It is clear that the appellate court conducted an adequate review (indeed, reviews). The real thrust of this contention, that Petitioner received ineffective assistance of counsel at the sentencing phase, is treated elsewhere in this opinion.\n\nThe Florida Supreme Court addressed Petitioner's claims that the trial court erred in giving insufficient jury instructions as to the underlying felonies of robbery and kidnapping. See Knight v. State, 394 So.2d at 1002. Likewise, the Florida Supreme Court addressed Petitioner's claim of prejudice resulting from the trial court's failure to instruct the jury on the consequences of a verdict of not guilty by reason of insanity. See Knight v. State, 394 So.2d at 1004; Muhammad v. State, 426 So.2d at 538. Thus, it is apparent that these points were fully considered by the appellate courts, and this Court will not find inadequate appellate review simply because the Petitioner is dissatisfied with the appellate court's adverse conclusions.\n\nFinally, Petitioner contends that the poor quality of his brief on appeal itself made the appellate court's review of his case inadequate. This Court finds that whatever deficiency there may have been in the written presentation of Knight's brief on appeal, such deficiency in no way prevented the Florida Supreme Court from examining fully all of the legal issues raised on appeal. See Knight v. State, 338 So.2d 201. Additionally, the Florida Supreme Court examined four points not raised on appeal but subsequently raised by Petitioner under an ineffective assistance of appellate counsel claim. The Florida Supreme Court found no merit in any of the points and specifically held that their omission from the appellate brief was not prejudicial. See Knight v. State, 394 So.2d at 1001. Thus, Petitioner's assertion that the poor quality of his appellate brief contributed to or caused an inadequate appellate review of this cause is groundless.\n\nX. CONSIDERATION OF NON-RECORD EVIDENCE\n\nPetitioner argues that \"on information and belief\" the Florida Supreme Court obtained, considered and then purged from the record file information outside the record during his direct appeal.\n\nThe assumption that extraneous material was considered by the Florida Supreme Court in appeals of death penalty cases is based on an indication in Brown v. Wainwright, 392 So.2d 1327 (Fla. 1981), cert. denied, 454 U.S. 1000, 70 L. Ed. 2d 407, 102 S. Ct. 542 (1981), that such material may have been considered in other capital cases at or around the time of Knight's direct appeal.\n\nKnight was a member of that class of inmates seeking relief in Brown. \"In Ford v. Strickland, 696 F.2d 804 (11th Cir. (en banc), cert. denied, 464 U.S. 865, 78 L. Ed. 2d 176, 104 S. Ct. 201 (1983), we held that the Florida Supreme Court's decision in Brown denying habeas corpus relief to that class of death row inmates of which petitioner was a member was dispositive of the inmate's claim that ex parte materials were being used unconstitutionally.\" Funchess v. Wainwright, 772 F.2d 683, 688 (11th Cir. 1985). As Petitioner Muhammad, as stated above, was a class member in Brown, the Court holds that Brown was likewise dispositive of Muhammad's claim regarding non-record materials.\n\nXI. DUE PROCESS IN POST-CONVICTION PROCEEDINGS\n\nPetitioner had contended that he had been deprived of a forum in which to litigate certain of his post-conviction constitutional claims.\n\nThe deprivation arose, Petitioner contended, because his state habeas corpus petition was transferred by the Florida Supreme Court to the State Circuit Court for treatment as a post conviction relief motion under Rule 3.850, Fla.R.Crim.P. and then summarily dismissed.\n\nPetitioner obtained a stay of execution in federal court; the federal court also ordered on March 5, 1981, that Petitioner be afforded the opportunity to exhaust his state claims. Petitioner did in fact litigate his remaining state claims. Accordingly, his claim that he was deprived of a state forum in which to pursue his post conviction claims is now moot. Petitioner's objections to the Magistrate's report acknowledge the mootness of the contention. Id. at 67.\n\nXII. INEFFECTIVE ASSISTANCE OF COUNSEL AT TRIAL\n\nPetitioner alleges that defense counsel was ineffective at the guilt-innocence phase of his trial for failing to adequately prepare his insanity defense. This point was raised by appellant Knight in state court proceedings, wherein the Florida Supreme Court rejected appellant's claim finding that the record supported the trial court's conclusions that:\n\nDr. Rothenberg testified at the trial for more than a day, as shown by approximately 300 pages of testimony, concerning his several examinations of defendant, tests given to defendant, together with his findings and opinions. Nowhere in his extensive testimony does Dr. Rothenberg give the slightest hint that he lacked and \"needed\" background information about defendant or his family; nor copies of reports of the State's expert witnesses; nor that he was handicapped by lack of access to tapes of his interviews with defendant. As a matter of fact, he testified in a very positive manner concerning his opinion that defendant was not competent at the time of the murders, and gave lengthy reasons for his opinion. He referred to copious notes that he had taken. He even testified that he did not need to hear the tapes to refresh his recollection. Although the tapes were played during his testimony and he testified concerning them.\n\nDefense attorney Meadows interrogated Dr. Rothenberg thoroughly and knowledgably (sic). This was no matter of course, ho-hum interrogation. A reading of the transcript makes it obvious that Mr. Meadows had thoroughly prepared the examination of the psychologist.\n\nMuhammad v. State, 426 So.2d 533, 537-38 (Fla. 1982), cert. denied, 464 U.S. 865, 104 S. Ct. 199, 78 L. Ed. 2d 174 (1984).\n\nThe United States Magistrate observed that:\n\nThe petitioner has not shown that [defense lawyers'] preparation and presentation of his defense was deficient in any substantial respect. The evidence that Knight was sane under the applicable McNaughten standard was overwhelming. The fact that defense counsel attempted to present an insanity defense, presenting the sole expert who gave them an opinion favorable to Knight against the battery of psychiatrists, psychologists, and by witnesses who believed him sane, is indicative of their extraordinary efforts on Knight's behalf. There is simply no reason to believe, in the context of the overwhelming unfavorable psychiatric testimony in this case, that better preparation of the witness Rothenberg . .. would have materially affected the outcome of the trial.\n\nMagistrate's Report at 34-35.\n\nThis case is not like Ake v. Oklahoma, 470 U.S. 68, 105 S. Ct. 1087, 84 L. Ed. 2d 53 (1985) or Blake v. Kemp, 758 F.2d 523 (11th Cir. 1985) cert. denied, 474 U.S. 998, 106 S. Ct. 374, 88 L. Ed. 2d 367 (1986), where the court refused an indigent defendant access to a psychiatrist and where the state failed to provide the defense psychiatrist with a tape of defendant's confession or copies of defendant's statements. In this case, defendant was examined by seven experts on mental health, some psychologists, some psychiatrists. Dr. Corwin, who had examined Knight at the request of the Public Defender's Office, recommended that the defendant be tested further. Significantly, none of the doctors complained at the time of trial that there was insufficient matter upon which to base a conclusion as to defendant's competency to stand trial. Indeed, nowhere did any psychiatrist relate to the defense or to the state that a detailed history of petitioner's family background was absolutely needed before a diagnosis or conclusion could be made. It is undisputed that the main defense witness, Dr. Rothenberg, had been exposed to important features of defendant's history and that his information was largely from Petitioner.\n\nThe Court finds that the Petitioner was given ample access to psychiatrists for the purpose of aiding in his defense. The psychiatrists and psychologists involved here based their findings upon testing and interviews conducted at a point in time very close to the time of petitioner's crimes. While background information may well have been helpful in an academic sense to the compilation of a complete dossier on defendant, the defendant was not deprived of adequate access to psychiatric evaluation simply because the examiners' probes focused upon the mental state of petitioner at the time of the crimes instead of at an earlier date. The consensus of those who evaluated the defendant's competency was that he was indeed sociopathic with paranoid personality problems but that he fully knew the difference between right and wrong and could appreciate the seriousness of the crimes with which he had been charged.\n\nThe examining psychiatrists and psychologists (who opined that Knight was sane at the time of the crimes) based their conclusions upon examinations of the defendant conducted both very close to the time of the crimes and close to trial. There is no strong indication that the results of the examinations, conducted at a time close to the acts, would have indicated that Knight was insane if the details of Knight's distant past had been more fully available. The experts would have known better how the defendant developed his mental problems, but there is no indication that full knowledge of his past would have changed the results of their examinations at the time of the crimes and prior to trial. In any event, it is not as if the background report on Mr. Knight would have revealed incontrovertible proof of his insanity -- the most recent entry in any file on the defendant would have shown his 1971 discharge from a state mental hospital (after a short stay) as a sane person, confirmed by a court order adjudicating him competent.\n\nThe court in Blake, supra, held that the inquiry on ineffective assistance of counsel in a psychiatric assistance context must focus on counsel's actual performance at trial in order to ascertain whether counsel failed to function adequately as the government's adversary. 758 F.2d at 531. The Court has reviewed the record as to defense counsel's examinations and cross-examinations of the expert witnesses on Knight's sanity and finds that there was not ineffective assistance rendered. Defense counsel's actions in this regard constituted meaningful adversarial testing.\n\nPetitioner has not met the burden placed upon him by Strickland v. Washington, 104 S. Ct. at 2064. He has not demonstrated that defense counsel's assistance in preparing the insanity defense was inadequate such that he was prejudiced to a degree that there is a reasonable probability that the results of the trial would have been different had the background information been fully presented to the mental health experts. Petitioner was not deprived of meaningful psychiatric evaluation; no expert testified that his diagnosis was unreliable.\n\nThe Court has considered all of Petitioner's other claims of ineffective assistance of counsel at trial in the context of other claims, and has determined that no prejudice resulted to petitioner from such asserted errors which would warrant habeas corpus relief.\n\nXIII. INEFFECTIVE ASSISTANCE OF COUNSEL AT SENTENCING PHASE\n\nOne of Petitioner's main contentions in his Petition for Writ of Habeas Corpus is that his defense team failed to render effective assistance of counsel at the penalty phase of his trial. Because the record was silent as to a number of important questions, the Court felt that an evidentiary hearing was indicated. See generally Townsend v. Sain, supra. The Court has heard the trial attorneys for Petitioner as well as several other witnesses, who offered testimony that Petitioner argues should have been presented in mitigation in 1975.\n\nThe hearing evidence shows that Thomas Knight grew up in an impoverished home. He was the eldest son, one of fifteen children of Anna and S.T. Knight. Thomas and the other children were frequently beaten by their alcoholic and violent father. The father was sent to prison when Thomas was nine for attempting to rape or raping one of Thomas's sisters. Thomas was shortly thereafter sent to a boys' school at the age of nine because of a lack of supervision at home and because he had been getting into juvenile trouble repeatedly. Thomas was sent to Raiford when he was fourteen. He was a patient at a mental hospital when he was eighteen. The record evidences the extremely disadvantaged early years of Petitioner. The other conditions and circumstances of the unhappy family life of Petitioner were the subject of testimony from Petitioner's sisters, mother, aunt, schoolteacher, probation officer, boys' school headmaster, and an old family friend.\n\nThe standard for determining ineffectiveness of counsel is the same for both the guilt and sentencing phase of a trial. Strickland v. Washington, [104 S. Ct. at 2064], 80 L. Ed. 2d at 693; King v. Strickland, 748 F.2d 1462, 1463 (11th Cir. 1984). A defendant challenging a death sentence must show that without the error, there is a reasonable probability that \"the balance of aggravating and mitigating circumstances did not warrant death.\" Id. (quoting Washington, [104 S. Ct. at 2068], 80 L. Ed. 2d at 698).\n\nIn the instant cause, the testimony of Petitioner's trial counsel shows that then-defendant Knight refused to allow his defense lawyers to put his mother on the stand to offer what his counsel felt would be potentially mitigating evidence. The lawyers were in agreement on this. The lead attorneys, Matthews and Meadows, each felt that presenting the mother to the jury would have created some sympathy for the defendant, against whom they recognized the case was very strong. The Petitioner adamantly refused to allow the lawyers to present his mother and to elicit testimony from her. The lawyers testified that more than once they attempted to dissuade Petitioner from this course, but he would not change his position. Petitioner wanted to leave her out of it. Although Mrs. Knight had been subpoenaed, and prepared to testify, she was not called. Additionally, Petitioner instructed his attorney not to involve his wife, Beatrice, in the case. The wife, in turn, expressed reluctance at becoming involved. In any event, she did not provide any particularly useful information to the attorneys. Attorney Hutchinson testified that Petitioner became almost vehement when Beatrice appeared at the pretrial hearing.\n\nMoreover, the lead attorneys each testified that the Petitioner did not want his family background or history explored and made public for mitigation purposes. The lawyers testified that Petitioner did not want the subject of his father brought out at the penalty phase. Petitioner's lead attorney, Matthews, recalled that Petitioner did not want his family's history of mental illness or his father's imprisonment for the rape incident to become matters of public knowledge. Petitioner's reluctance was based, Matthews recalled, on the intensely personal subject matter (which he had not been able to face in his adult life) rather than mere embarrassment. Matthews recalled that the defense team considered other witnesses, but felt that none could have done as well as the mother as far as relating the family history and eliciting sympathy from the jury for Petitioner. Matthews also testified that he felt that the defendant would be disruptive and make it unbearable in the courtroom if the attorneys circumvented his wishes by putting on the information themselves. Matthews also testified that coming from the mother, the history would have been sympathetic, but it would not have been sympathetic coming from a \"cold piece of paper.\" The idea of putting the defendant on the stand was also considered, but rejected because of the attorneys' conclusion that he was quite vulnerable. His counsel felt that the State would have \"eaten him alive.\" The attorney testified further that Petitioner was not considered to be a promising witness in mitigation on his own behalf because of his temperament. Lt. Duval was also considered, but the attorneys felt that his testimony in mitigation would not have been sympathetic.\n\nThe sisters and aunt of Petitioner testified at the evidentiary hearing that they were not approached by defense counsel at the time of trial for the purpose of questioning or testifying on Petitioner's behalf. However, attorney Matthews testified that after learning of the defendant's decision not to go into the subject matter of his childhood and family background, the problems with his father, and his refusal to allow his mother or his wife to participate, Matthews did not pursue other character witnesses. The defendant's refusal made Matthews desperate, but it was decided to build the penalty phase presentation around anything favorable to Knight that had been produced during the guilt phase of the trial.\n\nThe questions presented by this case -- where counsel did not present additional witnesses during the sentencing phase -- seem to be governed by the cases of Mitchell v. Kemp, 762 F.2d 886 (11th Cir. 1985) and Thompson v. Wainwright, 787 F.2d 1447 (11th Cir. 1986). In Mitchell, the defendant, who had pled guilty to murder, instructed his attorney, to leave his father and his family out of the case. The attorney felt that the father was the only avenue into the defendant's family situation. The Eleventh Circuit Court of Appeals held that \"when a defendant preempts his attorney's strategy by insisting that a different defense be followed, no claim of ineffectiveness can be made. Foster v. Strickland, 707 F.2d 1339, 1343 (11th Cir. 1983), cert. denied, 466 U.S. 993, 104 S. Ct. 2375, [80 L. Ed. 2d 847] (1984); See Autry v. McKaskle, 727 F.2d 358, 360-61 (5th Cir. 1984).\" Id. at 889. Although a capital defendant's stated desire not to use character witnesses does not negate the duty to investigate, it limits the scope of the investigation required. Id. at 890 (citing Gray v. Lucas, 677 F.2d 1086, 1094 (5th Cir. 1982), cert. denied, 461 U.S. 910, 103 S. Ct. 1886, [76 L. Ed. 2d 815] (1983)).\n\nIn this instance, the attorneys for defendant Knight did not fail to conduct any investigation whatsoever. They spoke repeatedly to the defendant's mother, and spoke also to his wife. The defendant emphatically instructed them not to explore the subject matter that he now contends was erroneously omitted. The trial attorneys for the Petitioner conducted an independent investigation, according to Matthews, which led them to Ft. Pierce, Lt. Duval, and to MacClenny Hospital. But Matthews did not discuss other family members with the Petitioner because Petitioner's adamancy about his mother's not testifying and about the family history being left alone led Matthews to conclude that he \"just knew it was out of the question\" to request other family members to testify.\n\nThe Mitchell court found that Mitchell's attorney had acted reasonably when he decided not to pursue an investigation independent of Mitchell or his father.\n\nIn Thompson v. Wainwright, the defendant, convicted of a heinous murder, instructed his attorney, Solomon, not to investigate his childhood and early family life. Thompson contended that his attorney should not have heeded his request because Solomon was aware that Thompson was experiencing mental difficulties. The Eleventh Circuit Court of Appeals held that although Thompson's directions may have limited the scope of Solomon's duty to investigate, they could not excuse Solomon's failure to conduct any investigation of Thompson's background for possible mitigating evidence. Id. (emphasis in original) Solomon's explanation that he did not investigate potential mitigating evidence because of Thompson's request was particularly disturbing to the court where Solomon himself believed that Thompson had mental difficulties. Based upon these circumstances, the court found that Solomon's failure to conduct any investigation of Thompson's background fell outside the scope of reasonably professional assistance (although the petition was denied for failure to show prejudice). Id.\n\nHere, an investigation was undertaken. Counsel testified that the investigation into the defendant's background was curtailed after the defendant indicated that he would not permit the fruits of the investigation to be presented to the jury. Counsel further testified that he did the best he could with what he had to work with after the defendant persisted in his refusal to let his mother testify or to let aspects of his family background be presented. Matthews testified that his strategy would be to incorporate by reference into the penalty presentation any favorable material regarding the defendant's upbringing and mental history which had been uncovered during the trial. The record shows that this was done. (It is also significant that the State presented no witnesses during its sentencing presentation.)\n\nThe Thompson court noted that Solomon's failure to investigate was particularly disturbing because it was motivated by instructions from a defendant about whose mental condition Solomon was himself doubtful. In the instant cause, trial counsel for Petitioner found him at times lucid and involved and at other times, like he was not even there. However, Matthews testified that, in his layman's opinion, he did not think that Knight was incompetent, but rather that the stress of the situation caused him to \"psych\" himself to eliminate events from his mind. While defense counsel argued to the jury that the defendant was insane or significantly impaired at the time of the offense, there is no indication that they felt that his mental condition precluded him from making rational choices at the time of preparing for the trial. The medical opinions rendered at the relevant times also bolster the conclusion that Petitioner was able to assist in his defense. A review of the record discloses, in fact, a rather articulate and aggressive Defendant.\n\nAn attorney has expanded duties when representing a client whose condition prevents him from exercising proper judgment. Thompson, 787 F.2d at 1452 (referring to Code of Professional Responsibility EC 7-12 (Fla.Stat.Ann. 1983). While hindsight may reveal Petitioner's considered decision not to let his mother testify and counsel's decision not to call the mother to have been poor decisions, there is no indication that counsel simply abandoned Knight after he told them not to use the evidence they wanted. As indicated, the testimony adduced at the evidentiary hearing shows that Matthews tried more than once to persuade the Petitioner to let his mother testify about the family background. Matthews had the mother visit her son to try to persuade him herself. Counsel here made the strategic choice to incorporate by reference at the penalty phase that favorable material which had been raised at the trial rather than risk the adverse consequences of an outburst by defendant in the courtroom (defendant had been obstreperous in the courtroom on earlier occasions). Established legal precedent does not require that counsel, in order to be effective, submit to the jury all arguably mitigating character evidence that might exist. Griffin v. Wainwright, 760 F.2d 1505 (11th Cir. 1985) (citing to Eddings v. Oklahoma, 455 U.S. 104, 102 S. Ct. 869, [71 L.Ed2d 1] (1982); Lockett v. Ohio, 438 U.S. 586, 98 S. Ct. 2954, 57 L. Ed. 2d 973 (1978)). When an attorney makes an informed choice between alternatives, his tactical judgment will almost never be overturned on habeas corpus. Griffin v. Wainwright, 760 F.2d 1505 (11th Cir. 1985) (citing Stanley v. Zant, 697 F.2d 955, 966 (11th Cir. 1983)). Counsel will not be deemed constitutionally deficient merely because of tactical decisions. Griffin, 760 F.2d at 1513; Ford v. Strickland, 696 F.2d 804 (11th Cir.1983). Notwithstanding the possibility that other lawyers may have employed another strategy, a finding of constitutionally ineffective representation is not automatically mandated. Griffin, 760 F.2d at 1514 (citations omitted). While it is a close question, the Court finds that trial counsel for the Petitioner were not ineffective for pursuing the strategy they employed -- under the circumstances described -- relying on background information and evidence of diminished capacity developed during the guilt phase of the trial.\n\nPetitioner asserts that the performance of his defense counsel at trial fell below the standard of reasonable professional assistance because the defense team failed to provide background information about Petitioner, including his mental history, to the psychiatrists and psychologists who examined him and testified about his mental condition at trial. Courts have long recognized a particularly critical interrelation between expert psychiatric assistance and minimally effective assistance of counsel. United States v. Edwards, 488 F.2d 1154, 1163 (5th Cir.1974). See Blake v. Kemp, 758 F.2d 523 (11th Cir.1985).\n\nIn 1985, the Supreme Court held in Ake v. Oklahoma, 470 U.S. 68, 105 S. Ct. 1087, 84 L. Ed. 2d 53 (1985), that when a defendant demonstrates to the trial judge that his sanity at the time of the offense is to be a significant factor at trial, the state must, at a minimum, assure the defendant access to a competent psychiatrist who will conduct an appropriate examination and assist in evaluation, preparation, and presentation of the defense.\n\nIn Thompson v. Wainwright, supra, the Eleventh Circuit ruled that \"[defense counsel's] failure to request psychiatric assistance with respect to mitigating circumstances was not ineffective assistance of counsel. The Supreme Court's decision in Ake was a change in the law which was not foreseeable in September of 1978, and defendants are not entitled to an attorney capable of foreseeing the future development of constitutional law.\" 787 F.2d at 1459.\n\nTherefore, to the extent that Petitioner's present counsel claims ineffective assistance of Petitioner's trial counsel for failing to request or obtain psychiatric assistance in 1975, the Court finds that such a claim is foreclosed by the Eleventh Circuit's holding in Thompson.\n\nPetitioner claims that he was prejudiced by defense counsel's failure to provide background information to the psychiatrists and psychologists who examined him and testified about his mental condition at trial. Petitioner claims that the information would have challenged the conclusions of the experts who found him sane and bolstered the opinion of the expert who found him insane.\n\nPetitioner claims that his defense counsel committed additional error by failing to present psychiatric evidence favorable to his position during the mitigation argument. The Court turns to the testimony of the psychiatric experts to assess these claims.\n\nThe defense's chief psychiatric witness was Dr. David Rothenberg, a clinical psychologist. He testified that he interviewed and conducted psychological tests on the defendant over the course of four visits, July 23, 25, 26 and 30, 1974. Dr. Rothenberg recorded the interviews and the tapes were played to the jury. During the course of these interviews, Knight related some of his personal history.\n\nKnight said he was raised in Ft. Pierce, Florida. At age nine he was sent to Okeechobee Boys' School for shoplifting and fighting. He returned home but was arrested repeatedly, left school in the ninth grade, and was sent to the state prison at Raiford when he was fourteen years old for breaking into a store. He was transferred from Raiford to Appalachicola, from which he was released at age eighteen.\n\nKnight said that at age eighteen he was using LSD and snapped a gun in a girl's face. He was then sent to the Northeast Florida State Hospital at MacClenny (MacClenny), where he remained a few months. Knight said that his life had been hellish.\n\nDr. Rothenberg interviewed Knight at length and administered several standardized psychological tests. He testified that Knight was suffering from paranoid schizophrenia in the chronic state, both at the time of the offenses and at the time of his trial. He further testified that in his opinion, on July 17, 1974, the day of the crimes, Knight did not know right from wrong and did not know the nature and consequences of his acts.\n\nDr. Rothenberg believed that Knight had suffered from schizophrenia for a long time, possibly since age nine. He testified that Knight had been unable to distinguish between right and wrong for perhaps five years.\n\nDr. Rothenberg testified that at the time he saw the defendant, knowing his history would not have assisted him in arriving at a conclusion whether the defendant was legally sane. Dr. Rothenberg testified that he had the data that he required to complete his diagnosis and that he had obtained this information from the defendant, in whose credibility the doctor testified he believed. Dr. Rothenberg testified at trial that he knew of Knight's history of institutionalization.\n\nAt this Court's evidentiary hearing, Dr. Rothenberg testified that additional details of Petitioner's unhappy childhood and his mental history would have corroborated the opinion he gave at trial. However, Dr. Rothenberg also testified that such information was desirable, but not essential in order for him to render a competent evaluation. He testified that he did not ask for any other additional information from the attorney who hired him when he reported the results of the interview and tests. Finally, Dr. Rothenberg testified that he was satisfied that he gave an appropriate evaluation of the defendant.\n\nThe defense also presented the testimony of Arthur M. Wells, Jr., a clinical psychologist employed as Director of Psychology at MacClenny. Dr. Wells testified that Thomas Knight was committed to the hospital in January, 1971, at age eighteen. He remained there for three months.\n\nDr. Wells examined Knight in April, 1971. He found that Knight's cognitive or thinking processes were generally adequate, with some underlying psychopathology, well controlled at the time. Knight also displayed hostility. At trial, Dr. Wells testified that he had found some evidence of an underlying schizophrenic reaction propensity. Knight was, according to Dr. Wells, 10% or less psychotic in 1971. He appeared to have benefited as much as possible from the hospital at the time of his release, but remained potentially dangerous.\n\nWhen examined in 1971, according to Dr. Wells, Knight understood the difference between right and wrong and the nature and consequences of his actions. Dr. Wells testified that certain stressful situations could trigger psychotic behavior in the patient. Dr. Wells also testified that Knight's paranoid fear of his father could be psychotically manifested by killing a male.\n\nDr. Wells, testifying from hospital records, stated that the treating psychiatrist, Dr. Calleja, diagnosed Knight as suffering from psychosis with drug or poison intoxication, but no longer psychotic. He also diagnosed habitual excessive drinking and paranoid personality.\n\nIn rebuttal at trial, the state presented Dr. Charles B. Mutter, M.D., a psychiatrist, who testified that he examined the defendant on March 30, April 3, and April 5, 1975, for a total of approximately three and a quarter hours. He examined Knight for psychiatric, neurological or organic impairment. Dr. Mutter testified that he had reviewed defendant's MacClenny records for the examination. (Dr. Mutter testified that he reexamined the records after the interviews once and possibly twice.) At the competency hearing, Dr. Mutter testified that the defense supplied him with the records.\n\nDr. Mutter found the defendant able to distinguish right from wrong and understand the nature and consequences of his actions. He thought Knight was competent to aid in the preparation of his defense and to stand trial. He testified that he changed his diagnosis of the defendant from underlying paranoid to sociopathic personality, and that the defendant's sociopathic personality disorder would not in itself prohibit him from knowing right from wrong or from understanding the consequences of his acts. Dr. Mutter testified that a person in a paranoid state could still know right from wrong. According to Dr. Mutter, the patient was unpredictable and very dangerous.\n\nDefining a sociopathic personality, Dr. Mutter testified that such a disorder is a longstanding personality disorder which appears in an individual who usually has a more than average intellect. The doctor opined that such a person knows right from wrong but does not care. Such an individual has a serious problem from early childhood that is usually due to abuse as a child, alienation from family, and poor close family ties. Dr. Mutter opined that this hypothetical sociopathic personality is able to know right from wrong and to understand the nature and consequences of his acts.\n\nAfter the first examination, in which the Petitioner was obstructive and uncooperative, Dr. Mutter diagnosed him as having a paranoid personality disorder. The doctor examined him twice more, during which examinations Knight was cooperative. Based on the second and third examinations, the doctor changed his diagnosis from paranoid personality to sociopathic personality disorder. Dr. Mutter testified that when provoked or irritated by people whom he does not like, the sociopath can act irrationally and in a very hostile and belligerent manner, but he has the ability to smooth this over and change, like a chameleon, to suit his needs in a given situation.\n\nArthur T. Stillman, M.D., a psychiatrist who had examined the defendant on behalf of the defense, testified for the state. Dr. Stillman examined the defendant on July 24, August 6, and August 23, 1974. He testified that Knight was sane and competent, although psychiatrically disturbed, and could tell the difference between right and wrong and was aware of the consequences of his actions at the time of the offenses. Dr. Stillman thought the defendant was in a paranoid condition. At subsequent examinations, Dr. Stillman thought the defendant was faking amnesia and trying to behave as though he had mental illness. Knight had, Dr. Stillman testified, superior intelligence.\n\nDr. Stillman testified that he thought Knight was sly in his responses to examination questions, but was clever and used words exceptionally well at the first visit. On the second visit Knight was generally unresponsive, and Dr. Stillman got the impression that Knight was trying to feign mental illness. Knight was again unresponsive on Dr. Stillman's third visit.\n\nDr. Stillman was asked by the defense what were some of the environmental factors that bring a paranoid personality condition to the point where it becomes apparent and where it becomes active in Thomas Knight. He answered that he had no doubt that the ghetto situation certainly adds tremendously to paranoia because of the constant fear of crime experienced by persons living in the ghetto. Dr. Stillman testified that he was aware that the defendant had been admitted to MacClenny and had there been diagnosed schizophrenic.\n\nDr. Stillman that he found no evidence of a disturbance, upon examination of the defendant one week after the offenses, that would have kept Knight from controlling his acts one week earlier. If there had been such a disturbance, evidence of it would have been seen one week later, according to Dr. Stillman.\n\nFinally, Dr. Stillman testified that there seemed to be a past history which would enter the analysis of the defendant's mental condition in terms of his past behavior, and gave as examples the defendant's repeated arrests and his earlier conviction. Dr. Stillman testified that all these things put together begin to seem as if there is an antisocial trend in much of what the defendant was saying and doing which lends itself to a sociopathic flavor.\n\nDr. Norman Reichenberg, a clinical psychologist, testified that he spoke with the defendant on March 31, 1975, and administered multiple psychological tests. While he did not conduct a formal interview, this was because he chose to let the defendant converse freely without interruption. Dr. Reichenberg testified that he knew that Knight had been in boys' school at age nine, in Raiford at age fifteen, and other aspects of Knight's home life with respect to his first marriage and children.\n\nOn the basis of the conversation Knight was able to carry on, and primarily on the basis of the psychological testing material, Dr. Reichenberg testified that the defendant was capable of knowing right from wrong and the nature and consequences of his actions at the time of the examination and the 1974 offenses. Dr. Reichenberg found no evidence of schizophrenic processes in the test material he obtained. Dr. Reichenberg testified that although he was aware that the defendant had been in MacClenny Hospital, he was not aware that the defendant had been diagnosed schizophrenic in 1970 and 1971.\n\nAccording to Dr. Reichenberg, the defendant had paranoid approaches to interpersonal relationships but that these were not in the schizophrenic range. Dr. Reichenberg testified that the defendant's psychological material suggests that the defendant was an impulsive individual, a behavior disorder individual. Dr. Reichenberg discussed the defendant's fear of his father, which possibly could cause defendant to kill a male in a delusional defense from the murderous onslaught of the father as represented by the male. Dr. Reichenberg assessed this disturbance as a basis for much of defendant's difficulty with authority figures.\n\nDr. Carlos DeMont, a psychiatrist who was Deputy Director of Prison Medical Services for Dade County, testified that he spoke with the defendant briefly on July 19 and July 26, 1974. After seeing Knight on July 19, 1974, Dr. DeMont prescribed Valium because Knight was upset and angry. One week later, Dr. DeMont spoke with Knight and ordered him transferred to the general prison population. Dr. DeMont thought Knight was legally sane.\n\nDr. Albert Jaslow, a psychiatrist, testified that he examined Knight on March 20, 1975 for approximately one and a quarter hours, and on April 3 and 5, 1975, with Dr. Mutter, for more than two and a half hours. On the first occasion, Dr. Jaslow found the defendant uncooperative. Dr. Jaslow testified that the defendant controlled the entire session and was very sharp, alert, and quite aware of what he was doing.\n\nDr. Jaslow found that the second interview was an improvement. He testified that the defendant explained rationally why he was being cooperative with the psychiatrists the second time. On the third visit, Dr. Jaslow testified, the defendant did go fully into his own background, his problems, and his history. Dr. Jaslow found that, based on the manner in which the defendant handled and responded to the doctor's questions, and the manner in which he carried himself and showed understanding, the defendant had full capacity and did know right from wrong, was fully sane and competent, and was extremely sharp and alert and on top of the situation at all times.\n\nDr. Jaslow testified that he believed the defendant to have known the difference between right and wrong and to have understood the consequences of his actions at the time of the offenses. The nature of the offense supported this conclusion, according to Dr. Jaslow, by indicating the defendant's awareness, understanding of right and wrong, fear and concern about the consequences, and his ability to make decisions and to have governed control behavior. Dr. Jaslow testified that Knight's suggestion of paranoia did not suggest a major mental disorder. Dr. Jaslow was told by the defendant that he had been on Thorazine. Dr. Jaslow testified that he saw defendant's MacClenny material.\n\nThe Court first notes the overwhelming consensus of opinion by the experts in this cause as to Petitioner's legal sanity. Not only is there consensus on the conclusion that Petitioner was sane at the time of the offenses and at the time of trial, there is also remarkable similarity among the various opinions as to the diagnoses of sociopathic personality disorder tinged with a suggestion of paranoid personality.\n\nMore importantly, each doctor who testified (except Dr. DeMont) was aware that the defendant had been a patient at MacClenny Hospital. Some of the doctors knew that the defendant had been diagnosed as schizophrenic there. Only Drs. DeMont and Rothenberg were not given copies of defendant's MacClenny Hospital records; Dr. Rothenberg testified that he obtained this information directly from the defendant. The Court finds that a very crucial piece of background information as to Petitioner's mental history was the fact of his MacClenny commitment. As the record shows that only Dr. DeMont was without this information, this Court finds that Petitioner was not prejudiced by psychiatric opinions made unreliable because given without the benefit of crucial information. Dr. DeMont's lack of knowledge was minor since his testimony was merely cumulative of the other state experts.\n\nWhile it is true that some of the psychiatric experts did not know the details of Petitioner's upbringing, the Court cannot say that this omission as to some of the doctors was so defective that it undermines the Court's confidence in the outcome of the case. Strickland v. Washington, supra. This information did not relate directly to Knight's medical history, although the inference is certainly raised by several of the experts that an upbringing as bad as Petitioner's could contribute to whatever personality disorders Petitioner suffered from. The background information relating to Petitioner's childhood was largely assumed, in fact (though not in complete detail), by Dr. Mutter, Dr. Stillman, and Dr. Reichenberg. Dr. Mutter's testimony showed that he knew that abuse as a child and alienation from and poor ties to a family contribute to the development, from early childhood, of a sociopathic personality. Therefore, much of what Petitioner claims was not provided to Dr. Mutter was already assumed to be part of a sociopathic profile by Dr. Mutter.\n\nPetitioner claims that if Dr. Mutter had known of his early childhood, the diagnosis would not have changed from paranoid to sociopathic personality. However, Dr. Mutter testified that paranoid personality types can know the difference between right and wrong. Dr. Jaslow and Dr. Mutter each testified that the Petitioner was not cooperative with them during their respective first examinations. The doctors interviewed the defendant jointly two times after the first visits. Each time the defendant was cooperative. Dr. Mutter testified that a sociopath can change from a hostile manner to suit his needs in a given situation. This reflects what happened over the course of the examinations among Petitioner and Drs. Mutter and Jaslow, and provides a reasonable explanation why Dr. Mutter's diagnosis changed.\n\nMost of the experts examined the defendant two or three times (Dr. Reichenberg examined only once.) None of the experts testified that he was unable to render a competent opinion as to the defendant's sanity because of a lack of background information. The Court is unable to say that the many examinations of the defendant, which were usually accompanied by psychological or neurological testing, were fundamentally inaccurate or unfair to the Petitioner simply because the doctors were not provided with every detail of the Petitioner's past. It cannot be disputed that six out of the seven doctors who testified were aware that Knight had been previously committed to a mental hospital.\n\nThe Petitioner claims also that his trial counsel erred by failing to provide the psychiatric experts with information relating to incidents of mental illness in his family. While such information might have been useful to the experts, this information does not relate directly to the mental condition of the Petitioner, either at the time of trial or at the time of the offenses. Therefore, the Court cannot say that there is a probability that if the experts had had this information, their assessments of the Petitioner's mental condition would have been materially different.\n\nAlthough Petitioner's defense counsel did not render perfect assistance in preparing the psychiatric experts, the Court notes that perfect assistance is not required; reasonable professional assistance is the standard by which counsel's performance is measured. In light of the burden placed upon them, the Court finds that defense counsel did render reasonably competent professional assistance. It should not be forgotten that Petitioner's escape directly impacted upon the defense team's awareness of and ability to prepare for Knight's insanity defense. The Public Defender's office initially began preparing Knight's insanity defense. After the escape the Public Defender's office would not represent Petitioner (because of conflicts among clients), and turned the file over to Petitioner's court-appointed counsel. The psychiatric report of Dr. Corwin, made at the direction of the public defender, was not in the file when it was given to attorney Matthews. Upon finding that this report existed, defense counsel immediately started preparing an insanity defense. There was little time left to accomplish this before trial. Matthews testified at the evidentiary hearing in this Court that he brought the late recognition of the psychiatric reports before the trial court. Further, nothing in the record suggests that the Petitioner's behavior was so bizarre, during the period between his recapture and the finding of Dr. Corwin's psychological report, that the defense counsel should have been alerted to the need to raise the insanity defense. Compare Ake v. Oklahoma, supra. Attorney Matthews testified at the evidentiary hearing that he thought Petitioner was in fact competent to stand trial and to assist in his defense. Under the circumstances at the time, defense counsel testified they did the best they could. They rendered, in the opinion of this Court, reasonable assistance to Petitioner.\n\nAs to the mitigation presentation, attorney Meadows testified at the evidentiary hearing that he did not want to put on psychiatric experts to repeat their testimony. Attorney Meadows did not recall any new information that the experts could have brought out at sentencing that was not covered at trial. At the mitigation argument, defense counsel (primarily Meadows) specifically reminded the jury about the lesser standard of diminished capacity. Meadows also made repeated references to parts of the psychiatric testimony that were favorable to the defendant, including mentions of the defendant's unfortunate early history. In this way defense counsel incorporated what was favorable to the defendant at trial into the sentencing arguments. This Court cannot find that this strategy amounted to ineffective representation of counsel.\n\nFinally, this Court takes notice, as some of the psychiatric experts did, of the fact that the nature of the Petitioner's offenses itself belies the contention that Petitioner did not know right from wrong or appreciate the consequences of his actions. Petitioner's offenses were calculated and required advance planning and instant decisionmaking. His request to the police officer to not shoot him upon capture reflects his understanding of the consequences of his offenses. Moreover, a review of the comments made by the Petitioner during the trial shows Petitioner's intelligence and awareness of the proceedings.\n\nIn sum, the Court does not find error in defense counsel's preparation of the insanity defense at the trial. Neither was there error in defense counsel's sentencing phase presentation. The Court is fully cognizant of the fact that there was more that the defense counsel could have done in preparing for the insanity defense, and that additional preparation would probably have helped the Petitioner at trial. However, the Court is also mindful that defense counsel were burdened, through no real fault of their own, by the late discovery of the psychological reports made at the direction of the Petitioner's public defenders. Defense counsel also had to expend valuable time preparing for the defense.\n\nThe Court finds no error which requires that the writ be granted, bearing in mind the totality of the circumstances surrounding the insanity defense and the sentencing phase. Even if error were to be found, however, I find no prejudice resulting to Petitioner such that there is a probability of a different outcome had the errors not occurred. See Strickland v. Washington, supra. The guilt of the defendant and the aggravating circumstances found by the trial judge are strongly supported by the record. Even if the mitigating circumstance of diminished capacity or mental disturbance were found in this case, the aggravating circumstances would still outweigh the mitigating circumstances. See Francois v. Wainwright, supra.\n\nIn conclusion, there is a temptation, in reviewing a case of this type, to substitute one's personal view of proper preparation (freely nourished by hindsight) for the tests directed by Strickland v. Washington and the various Eleventh Circuit cases which treat the subject of counsel ineffectiveness. It is most difficult, but quite necessary, to make every effort to consider fully all aspects of the setting in which decisions were made by trial counsel. That effort, especially crucial in this case, particularly because of the way in which the sentencing phase was conducted, does yield benefits which direct what I feel is the proper disposition of the petition. It would not be amiss to note again the several reviews and considerable treatment of this case at the different state levels and in this Court. While the mass of evidence presented against Petitioner must not obscure the detail of the points he raises, neither must these several points -- presenting, as they do, counsel's after the fact view of what should have been done -- obscure the weight of the presentation against Petitioner both on guilt and sentencing.\n\nI will not belabor the points already made except to note that a review of the closing arguments in both the guilt-innocence and sentencing phases is instructive. Attorney Meadows built on the evidence presented during the trial (R.3526) and advised the jury of the different standards relevant to defendant's mental condition applicable at each stage. R.3635. The decisions made by counsel and the circumstances surrounding such decisions have been discussed in detail. Any further review would compound the probable imposition already pressed upon the parties and a reviewing court by the length of this memorandum. Yet the many points presented by Petitioner required full consideration. While the issues developed as to ineffectiveness at sentencing required close and difficult decisions, I have determined, for the foregoing reasons, that in this instance, as with the other points raised by Petitioner, that the petition must be denied. A separate judgment will be entered this day.\n\nDONE AND ORDERED this 27th day of June, 1986 in Chambers at Miami, Florida.\n\nTJOFLAT, Circuit Judge, specially concurring:\n\nI concur in the court's judgment. I write separately merely to comment on the respondent's argument that we should treat petitioner's Lockett claim as procedurally barred.\n\nThis is a pre-Lockett case, in that petitioner was tried and sentenced before the Supreme Court decided Lockett v. Ohio, 438 U.S. 586, 98 S. Ct. 2954, 57 L. Ed. 2d 973 (1978). In pre-Lockett cases, as I noted in Hargrave v. Dugger, 832 F.2d 1528, 1539 (11th Cir. 1987) (en banc) (Tjoflat, J., specially concurring), the Florida courts do not apply their procedural default rules to bar review of Lockett claims. We are therefore obliged to review petitioner's Lockett claim without requiring him to demonstrate cause for his state court procedural default. Id.\n\nCLARK, Circuit Judge, specially concurring:\n\nI concur. We reverse only with respect to the Hitchcock issue. The law governing Florida's jury instructions on non-statutory mitigating circumstances has changed since the district court opinion and judgment. This necessitates reversal.\n\nI write to state briefly my reason for concluding there can be no harmless error. The district court's opinion, Part XIII, page 99, finds that counsel was not ineffective at the sentencing phase. At page 122 the court states: \"It is most difficult, but quite necessary, to make every effort to consider fully all aspects of the setting in which decisions were made by trial counsel.\" That statement of the temporal consideration that must be a part of judicial decision making mandates that appellant be granted a re-sentencing proceeding. Because of the state of the law in Florida at the time of Knight's trial, defense attorneys could not anticipate the conflict between the not yet decided Lockett decision and Florida's law limiting a jury's consideration of non-statutory mitigating evidence. The members of our court had differing opinions. See our 7-5 decision in Hitchcock v. Wainwright, 770 F.2d 1514 (1985) (en banc), rev'd 481 U.S. 393, 107 S. Ct. 1821, 95 L. Ed. 2d 347 (1987).\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nBecause the facts of this case reflect the existence of non-statutory mitigating evidence at the time of Knight's trial which had not been developed by defense counsel, a new sentencing hearing is required. This is consistent with a finding by the district court that defense counsel was not ineffective. Defense counsel in 1975 prepared his case in light of Florida law at the time.\n\n\u003cspan class=\"fn\"\u003e* The caption has been altered pursuant to Fed. R. App. P. 43(c) to reflect succession of RICHARD L. DUGGER, to Secretary Florida Department of Offender Rehabilitation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. Of the twenty-three issues raised by Muhammad on appeal, the Florida Supreme Court discussed only six: (1) denial of a challenge for cause as to the impartiality of a juror; (2) refusal to grant additional peremptory challenges because of pervasive pretrial publicity; (3) denial of motion for change of venue; (4) improper admission of testimony on kidnapping because not within res gestae of crime charged; (5) error in allowing case to be tried under felony-murder theory when indictment charged premeditated murder; and (6) appropriateness of death penalty under facts of case. Knight v. State, 338 So.2d 201, 203-05 (Fla. 1976). The court summarily denied relief on the balance of the claims without listing them. Id. at 204.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Muhammad contended his counsel was ineffective on appeal because he submitted poorly written briefs and failed to raise four important issues: (1) failure to instruct the jury on the elements of the underlying felony; (2) failure to instruct the jury on the result of a verdict of not guilty by reason of insanity; (3) exclusion of lay witness who would have testified as to defendant's background and feelings toward his father; and (4) improper application of the statutory aggravating and mitigating circumstances and failure to find any mitigating circumstances. Knight v. State, 394 So.2d 997, 1001-03 (Fla. 1981). Because of the standards announced therein, Knight v. State, 394 So.2d 997 (1981), became the leading case in Florida for judging claims of ineffective assistance until the United States Supreme Court's decision in Strickland v. Washington, 466 U.S. 668, 80 L. Ed. 2d 674, 104 S. Ct. 2052 (1984).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The court noted that the following four grounds for relief had been previously adjudicated, the first two on direct appeal and the second two in Muhammad's petition for writ of habeas corpus: (1) denial of right to an impartial jury; (2) right to notice on state's theory of prosecution; (3) failure to instruct the jury on the elements of the underlying offense; and (4) denial of effective appellate review. The court found that Muhammad had committed procedural default as to these two issues: (1) exclusion of testimony of defense witness; and (2) failure to instruct the jury on the consequences of a verdict of not guilty by reason of insanity. The court summarily rejected two issues on the merits: (1) arbitrary application of the death penalty in this case; and (2) discriminatory imposition of the death penalty on black offenders. Muhammad v. State, 426 So.2d 533, 535-36 (Fla. 1982), cert. denied, 464 U.S. 865, 78 L. Ed. 2d 174, 104 S. Ct. 199 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The claims raised before the district court were as follows: (1) denial of fair trial because of pervasive pretrial publicity; (2) right to notice of state's theory of prosecution; (3) exclusion of defense witness; (4) failure to instruct on underlying felony; (5) failure to instruct on consequences of verdict of not guilty by reason of insanity; (6) denial of due process at sentencing phase based on inadequate jury instructions on non-statutory mitigating circumstances, improper prosecutorial argument, non-unanimous jury recommendation and imposition of disproportionate sentence; (7) discriminatory impact of the death penalty based on race of victim; (8) ineffectiveness of appellate counsel; (9) inadequacy of appellate review; (10) Florida Supreme Court's consideration of non-record evidence; (11) denial of due process in post-conviction proceedings; (12) ineffective assistance of counsel at guilt-innocence phase; and (13) ineffective assistance of counsel at sentencing phase. The only claim which the court found to be procedurally barred was that challenging the propriety of the prosecutor's argument during the sentencing phase.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. On appeal, the state argues that Muhammad's Lockett claim should be barred by procedural default. In rejecting a similar argument, the district court noted that the Florida Supreme Court addressed the Lockett issue on the merits (albeit in the context of ineffectiveness) in Muhammad v. State, 426 So. 2d 533, 536 (Fla. 1981), cert. denied, 464 U.S. 865, 78 L. Ed. 2d 174, 104 S. Ct. 199 (1983). In any case, Muhammad was tried and sentenced in 1975, three years before the Lockett decision. This Circuit has held that in pre-Lockett cases, Lockett is a sufficient change in the law to overcome a procedural bar. Hargrave v. Dugger, 832 F.2d 1528 (11th Cir. 1987) (in banc).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. In Hitchcock our court said: In summary, for six years after the Florida death penalty statute was reenacted in 1972, there was some ambiguity as to whether a defendant had a right to introduce evidence in mitigation at a capital sentencing proceeding when the evidence fell outside the mitigating factors enumerated in the statute. 770 F.2d at 1516.\u003c/span\u003e\n\n",
    "body_length": 217116,
    "citedas": [
      "863 F.2d 705"
    ],
    "attorneys": "Roy Black, Black and Furci, P.A., Marisa Tinkler Mendez, Black and Furci, Jesse J. McCrary, Jr., Miami, Florida, Susan Cary, Gainesville, Florida, G. Richard Strafer, Zuckerman, Spaeder, Taylor \u0026 Evans, Coral Gables, Florida, Attorneys for Petitioner-Appellant. Jim Smith, Attorney General, Miami, Florida, Susan Hugentugler, AAG, Attorneys for Respondents-Appellees.",
    "category": [
      "243",
      "36",
      "78",
      "75"
    ],
    "judges": "Roney, Chief Judge, Tjoflat and Clark, Circuit Judges. Tjoflat, Circuit Judge, specially concurring. Clark, Circuit Judge, specially concurring.",
    "citation_count": 45
  }
}
