{
  "id": "2rfvTWYBTlTomsSBZ3Rv",
  "document": {
    "title": "North Carolina v. Robbins",
    "full_title": "STATE OF NORTH CAROLINA v. PHILLIP THOMAS ROBBINS, JR.",
    "jurisdiction": "Supreme Court of North Carolina",
    "date": "1987-06-02T00:00:00.000Z",
    "docket": "No. 599A83",
    "body": "For purposes of this opinion the evidence may be summarized as follows. Additional evidence is set forth with respect to the various issues.\n\nThe state's evidence tends to show: In early June 1982, Ernest Thompson owned a .22-caliber nine-shot pistol. He kept it with bullets on his bedside table beside the telephone. Thereafter, defendant, Phillip Thomas Robbins, Jr., who went by the name of \"Jackie,\" visited Thompson in his home. When Thompson got up to go to the bathroom, defendant said that he was going to get another six-pack of beer. When Thompson came out of the bathroom, defendant was gone. Thompson then discovered that his gun was missing from its holster.\n\nAccording to Earlie Mae Williams, at about 12:30 p.m. on 17 June 1982, Anna Quick, Ms. Williams' longtime friend and co-worker, drove to the Dobbs House Restaurant at Raleigh-Durham Airport to pick up the women's paychecks. After Mrs. Quick returned to Durham, she went by the liquor store and purchased a bottle of Smirnoff vodka, and she and Ms. Williams went over to Mrs. Quick's house to talk and have dinner. Later, at about 6:30 p.m., they went to Ms. Williams' sister's house. They sat on the porch and talked and drank with Ms. Williams' sister and some other people. While they were sitting on the porch, Mrs. Quick said, \"That's him.\" Ms. Williams, not recognizing defendant as he approached, inquired, \"Him, who?\" and Mrs. Quick replied, \"That's Jackie Robbins, Beverly's [Quick's daughter] boyfriend.\" Defendant said, \"Hey, Mrs. Quick,\" and joined the conversation. Mrs. Quick and defendant then went to sit in Mrs. Quick's black-over-red Dodge Dart and continued their conversation. Later, after Mrs. Quick had gone into the house to use the bathroom, Ms. Williams came out and saw defendant, who was seated in the backseat, going through Mrs. Quick's green pocketbook. Ms. Williams testified that Mrs. Quick kept \"money, that little bit of money she had and other little items that she had\" in her pocketbook.\n\nWhen Ms. Williams asked defendant what he was looking for, defendant said he was looking for a cigarette, so Ms. Williams took the bag and gave him a cigarette and a match from it. Then Ms. Williams, Mrs. Quick, and defendant left in Mrs. Quick's car and proceeded to the ABC store at Lakewood Shopping Center to buy some more liquor. When they arrived at the liquor store, Mrs. Quick asked defendant to go in to buy the bottle, and she gave him some money from her pocketbook. At that point, Ms. Williams testified, defendant got out of the car, hesitated, said that he \"couldn't go in like this,\" and pulled a \"long gun\" out of his belt and threw it into the front seat between Ms. Williams and Mrs. Quick. Defendant then went into the liquor store. Defendant returned with a pint of Relska vodka. They then went to Ms. Williams' home. At about 8:30 p.m., after defendant had poured some of the vodka into a plastic cup for Ms. Williams, he and Mrs. Quick got back in Mrs. Quick's car. Ms. Williams said she \"talked to Anna about drinking and driving, because, you know, the police were kinda hot, so I told her to go home, you know and, of course, she said she was.\" Mrs. Quick told Ms. Williams, \"I got to take him home and I'm going to get Bernard to wash my uniforms and I'm going back.\" Defendant said, \"You ain't got to take me home. I can get out anywhere.\" \"They drove off,\" Ms. Williams testified, \"and that was the last time I seen her.\"\n\nThe next day, Friday, 18 June 1982, Mrs. Quick was supposed to pick up Ms. Williams as they were scheduled to be at work between 4:30 and 5:00 a.m. When Mrs. Quick, who had been late several times but who had failed to show up altogether only once in over ten years, did not arrive at Ms. Williams' house, Ms. Williams had her sister take her by Mrs. Quick's house. When they got there at about 4:45 a.m., they saw that the front-porch light was on and Mrs. Quick's car was gone. Ms. Williams testified, \"it was a strange feeling, you know, and we went on to work and I told my bossman about it.\" At around 3:00 p.m., Ms. Williams went by Mrs. Quick's house. The house was neat. Mrs. Quick's youngest son, Bernard, who lived there, said he had not seen any sign of his mother. Ms. Williams contacted Mrs. Quick's cousin in an effort to locate her friend, but no one had seen her. In response to a telephone call she received from a cousin early on Saturday, 19 June, Anna Quick's daughter, Phyllis Melton, began\n\nsearching for her mother. She was unable to locate her and on 19 June Ms. Melton called in a missing persons report to the Durham Police Department. She described her mother and the red 1975 automobile with a black top which one Clarence Holland had loaned Mrs. Quick.\n\nAt about 8:00 a.m. on Monday, 21 June 1982, Marvin Mangum was performing general road maintenance and cleaning ditches on Wilkins Road in north Durham County. In an isolated area about a mile and a half north of the Bahama and Wilkins Roads intersection he came across a body of a black female, which was lying generally face down on its left side, in a ditch on the west side of the road. Mangum walked up to the body, ascertained that she was dead, and immediately called the sheriff's department. Investigators who arrived at the site discovered a partial dental plate underneath weeds in the ditch, under the head of the partially decomposed body. Other physical evidence at the scene included an empty pint bottle of Relska vodka.\n\nAn autopsy performed on the body of Anna Quick on 21 June 1982 by Dr. Page Hudson, Chief Medical Examiner for the state of North Carolina, revealed that Mrs. Quick had been shot five times. In his opinion, Anna Quick died of multiple gunshot wounds. In addition to the three bullets which Dr. Hudson recovered from the body, a loose bullet found in the victim's clothing was recovered at the time of the autopsy and turned over to the state as evidence.\n\nThe evidence presented by the state also tended to show that on Friday, 18 June 1982, eighteen-year-old Darryl Wade Williams left his house between 8:15 and 8:30 p.m. in his light blue 1970 Plymouth Duster with gold racing stripes. At the time he was last seen by his father, an analytical chemist, Darryl was wearing brown slacks, a white shirt, a brown necktie, brown shoes, a tie clip from Garner High School which he had received for being manager and statistician of the basketball team, a Garner High School ring with the initials \"D.W.W.\" engraved inside, and a gold watch. He had just been paid that afternoon and had deposited some of his earnings in the bank. His father estimated that Darryl had between $30 and $80 in his wallet, in which he also carried his driver's license, his high school identification card, his Social Security card, and some photographs of his two sisters. Darryl\n\nwas described by his father at trial as \"quiet . . . religious, mannerable, and just a good kid. He had an interest in drama, sports, church, religion and stuff like this.\" Mr. Williams testified that he had instructed Darryl and his two daughters that \"if they were ever confronted by anyone with a knife or a handgun or any type weapon that could do them some harm that they should obey the orders that were given. Their life was more important than a car, money or whatever.\" Mr. Williams said he had last told Darryl that about two months previously.\n\nOn the late night of 18 June 1982 and the early morning of 19 June, Leonard Hawes and his girlfriend were visiting Hawes' sister, Cynthia Webb, and her boyfriend at Ms. Webb's apartment in Durham County. Hawes and Ms. Webb had known the defendant since childhood. Between midnight and 12:30 a.m. according to Ms. Webb, Jackie Robbins arrived at Webb's apartment. They invited him in, and he was given a beer. About five minutes later, defendant went back outside and returned with a \"young dude\" who was neatly dressed and wearing tinted glasses. The stranger was offered a seat and, after thanking them, he sat down. Then defendant told Hawes he wanted to talk to him, and the two men went into the bathroom. At that time, defendant pulled a black .22-caliber nine-shot target pistol out of his belt and showed it to Hawes. When Hawes asked defendant if he wanted to sell the gun, defendant said no, that it was hot, and he returned the gun to his belt. Defendant also asked Hawes if he wanted to go to Greensboro with him. Hawes asked defendant how he was going to get to Greensboro, and defendant told Hawes that \"the guy was going to loan him his car.\" Hawes replied that he was too high to drive to Greensboro but that he would go with defendant the next morning. Defendant came out of the bathroom, announced that he would be back, and he and the young man left. Ms. Webb testified that during the fifteen to twenty minutes defendant and the young man were in her apartment, the young man had a set of keys in his hand. Hawes testified that the young man did not appear to be either frightened or nervous while he was there.\n\nAccording to Ms. Webb, at about 2:30 a.m. defendant returned, alone. He and Hawes again went into the bathroom to talk. Defendant told Hawes that it was important that he go to Greensboro the next morning if he didn't go that night. Defendant and Hawes looked at the gun again; Hawes decided to unload it,\n\nand he removed four bullets from the gun. When he took the bullets out, he noticed that the gun was warm. Hawes testified, \"Yeah, I asked him about it. He said he had just shot it.\" They drank beer a while longer, and Hawes finally said he had to go home to get some sleep. Defendant, Hawes, and Hawes' girlfriend went outside and got into a Plymouth Duster which defendant was driving. Hawes testified that the young man who had been with the defendant earlier was not in the car. Defendant drove them in the Duster to Hawes' residence and then to Hawes' girlfriend's home to spend the night. Defendant slept on the sofa. When Hawes got up sometime between 10:00 and 11:00 a.m. on Saturday morning, defendant was gone.\n\nThough Darryl's parents customarily stayed awake until their children got home, Mr. Williams fell asleep the night of 18 June. At about 4:30 a.m., his wife wakened him to say that Darryl was not home. Darryl had never before stayed out all night and had never failed to call his parents when he was going to get home later than he had planned. Mr. Williams got up, rode out to North Hills and to Darryl's friends' houses looking for Darryl's car, returned home, and then went to the police station to file a report.\n\nOn Saturday morning, 19 June 1982, defendant sold the 1982 Garner High School ring belonging to Darryl Williams to Joe Campbell, who was in the business of buying and selling antique and used furniture, secondhand goods, and gold and silver at his store, General Headquarters, in downtown Greensboro. This transaction will be discussed in detail later in this opinion.\n\nDwight Abrams testified that he saw defendant walking down Dorothy Drive about 8:00 or 9:00 a.m. on Tuesday, 22 June. Defendant was dressed in \"an old dirty jacket, I think it was brown or rust colored or something. I don't know what kind of pants. He didn't have on no shirt.\" Abrams asked defendant where he was going, defendant replied that he was going to the store, and Abrams asked defendant to buy him a beer. Abrams then invited defendant into Sheila Dove's apartment. Once inside, defendant told Abrams he wanted to sell a pistol and asked him if he knew of anyone who wanted to buy it. Abrams said he informed defendant, yes, anybody would buy a pistol if it was some\n\ngood, and the two went to find Kenneth Ray Holloway whom Abrams thought might buy the gun.\n\nAt about 9:30 a.m. on Tuesday, 22 June, Kenneth Ray \"Turf\" Holloway was in his taxicab at the corner of Ridgeway and Simon Streets in Durham talking to two friends. While he was sitting there, defendant and Dwight Abrams approached the cab. Abrams told Holloway, \"We got something to show you,\" so Holloway told them to get in the cab. Holloway's friends stepped back from the cab and defendant got in the passenger seat and Abrams sat in the back. Holloway testified that defendant \"had on a jacket with no shirt zipped about halfway up. The jacket was real dirty-like.\" Defendant then pulled a .22-caliber gun from his pants and asked Holloway if he wanted to buy it. Holloway described the gun as \"a 22 long and shoot nine times. It was built on the 45 frame, a real long gun. . . . It didn't look like a normal 22, a target gun more or less.\" When Holloway asked the price, defendant said $25. Holloway said he could give him $18, plus $2 in change, right then and would pay defendant the rest later. Defendant took the money, handed Holloway the gun, and reached into his pocket and took out about five or six bullets which he also gave to Holloway. Holloway testified that \"some of [the bullets] were dark and some of them were gold, about two of them in gold.\" Defendant and Abrams got out of the cab and proceeded to a store where Abrams bought a quart of beer and defendant bought some wine.\n\nAbrams and defendant returned to Sheila Dove's apartment where they sat and drank the beer and wine. Abrams went out to look for his cousin while defendant and some other people went back to the store to buy some more beer and wine. When Abrams got back to Dove's apartment, defendant tossed him the car keys and told him to move the car to a parking lot in the back of the apartment complex. Abrams got in the car, started it, and began to back up. Meanwhile, defendant had come out into the yard, pointed at a police car which was coming up the street, and began running back into the apartment. Abrams pulled back in the driveway to let the police car drive by. As Abrams again started out, the first police car had turned around, several more police cars had arrived, and the officers, with guns drawn, ordered Abrams out of the car. They made Abrams lie down in the street and searched him. Durham County Sheriff's Department Investigator\n\nC. J. Dobies asked Abrams why he was driving that vehicle, and Abrams said that he was just moving it for a friend. When Dobies asked him what friend, Abrams replied, \"Jackie.\" Dobies then showed him a photograph of the defendant and asked, \"is this who you're talking about?\" Abrams responded, \"yeah, Jackie Robbins.\" Abrams told them that he had been with defendant since that morning, that he had had a few drinks with defendant, that he had gone with defendant to sell a gun to \"Turf\" Holloway, and that defendant was in Dove's apartment. Officers searched the apartment and surrounding area but did not find defendant. Abrams did not see defendant again that day. Abrams then accompanied officers to retrieve the gun from Holloway.\n\nThe officers, with Abrams in the car, later stopped Holloway in his cab. Dobies approached Holloway and asked him if he had bought a gun, and Holloway told him that he had. Dobies asked Holloway if he could get the gun, and Holloway said he could and told him it was under the front seat of the cab. Dobies reached under the seat and got the gun.\n\nDefendant was taken into custody on 22 June by Durham law enforcement officers on an Orange County warrant for another murder for which he was later convicted. (See State v. Robbins, 309 N.C. 771, 309 S.E.2d 188 (1983).) Dobies testified that at about 10:30 p.m. while he and defendant were in the magistrate's office, Dobies reminded defendant that he had been advised of his rights and that defendant had executed a written waiver of his rights regarding the Orange County warrant. Dobies then told defendant that he wanted to talk to him about Anna Quick. Dobies informed defendant that the body of Anna Quick had been found on Wilkins Road and that she had been shot. Defendant pointed to the Orange County warrant and said, \"I didn't do this,\" and when Dobies asked, \"What about Anna Quick?\" defendant said, \"I did that.\" The magistrate then called for defendant, who was processed. Later, defendant was taken into the ID room, where he was fingerprinted by Durham Crime Scene Investigator Michael Byers. While Byers was rolling defendant's fingerprints, defendant said, \"I know where's one at they don't know about yet.\" Byers inquired, \"One what?\" and defendant replied, \"Another body.\" Byers said nothing more to defendant at that point, nor did defendant volunteer any further information. Shortly before\n\nmidnight on that day, Orange County Deputy Sheriff Charles Gentry and Deputy Investigator Liner arrived in Durham to pick up defendant on the outstanding warrant. Liner and Gentry began talking with some of the Durham County Sheriff's Department personnel and, Gentry testified, \"in the course of events Jackie said that he would carry us to a car that Durham was looking for in Raleigh.\" Liner and Durham County Sheriff's Department Investigator Clarence Gooch got in the front seat of the Orange County car while Gentry and defendant got in the backseat, and they started towards Raleigh on Roxboro Road, followed by a Durham police vehicle occupied by Dobies and Detective McCorkle. When the cars were almost at Interstate 85, defendant said, \"While we're out, we might as well go get the other body.\" Liner stopped the car and talked to defendant. Gooch went back and notified Dobies of the new development. Dobies approached the Orange County car, asked defendant, \"[w]hat about this other body,\" and defendant replied, \"there is another body in Durham County.\" Defendant subsequently directed them to Bivins and Umstead Roads. Liner positioned the Orange County car with the headlights shining across a field to the rear in which defendant said the body could be found. Dobies testified that as soon as he got out of the car, he detected an odor of a decomposed body. Pursuant to defendant's directions, Gooch and Liner went into a field and came across the body of a young black male, fully clothed and lying face down in a drainage ditch. The body was later identified as that of Darryl Williams. While defendant and the officers were still in the Bivins Road area, defendant admitted to killing one woman and said, \"but I didn't do the others. Somebody else did.\" Defendant acknowledged that he was present but denied having killed Annie Carroway in Orange County. However, he never indicated who allegedly killed Carroway.\n\nAfter notifying other units from Durham, Gooch, Liner, Gentry, and defendant proceeded to Raleigh and, at defendant's direction, went to the post office parking lot behind the movie theatre at North Hills Shopping Center where they found the black-overred Dodge Dart belonging to Anna Quick. While in Raleigh, defendant said that there was another car involved and that it was behind the \"Station,\" a night spot in Hillsborough. The officers radioed the Hillsborough Police Department and asked Lieutenant Larry Biggs to proceed to that location. Biggs did so, pursuant\n\nto defendant's directions, and found Darryl Williams' Plymouth Duster on McAdams Road. Upon their return to Durham, defendant directed the officers to Lakeland Road and to other areas from which they recovered various items of evidence, such as Anna Quick's pocketbook and an identification card belonging to Darryl Williams.\n\nThe Greensboro Police Department contacted Joe Campbell about Darryl Williams' high school ring on Tuesday, 22 June. Detective J. R. Evans with the Raleigh Police Department subsequently came to Campbell's store to pick up the ring. When Evans arrived, Campbell gave him the Garner High School ring and described the person who had sold him the ring. Among other things, Campbell said that the man was \"unruly looking at the time. He was actually dirty, his hair was not combed in any fashion at all and he had a beard and somewhat of a mustache.\" The ring was introduced into evidence at trial and Campbell identified the ring as the one the customer sold him on that date. Also from the witness stand, Campbell identified the defendant as that customer.\n\nOn 26 June 1982, Mrs. Pat Walker, a resident of Bivins Road, found the tinted prescription eyeglasses belonging to Darryl Williams in some heavy undergrowth on Bivins Road about five yards east of where Williams' body had been found and turned them in to Dobies.\n\nDr. Page Hudson performed an autopsy on the body of eighteen-year-old Darryl Wade Williams on 23 June 1982. The clothing on the body consisted of a short-sleeve shirt and a necktie, boxer shorts and brown pants, tan loafers and dark socks. There were, in the medical examiner's opinion, five gunshot entrances to the body. Dr. Hudson determined that Darryl Williams died of a gunshot wound to the back.\n\nOn redirect, Dr. Hudson testified to the similarities in the wound patterns on the bodies of Anna Quick and Darryl Williams. Dr. Hudson responded, \"They each had a cl -- a very close-up contract wound in the back of the head. Each had a shot in the side of the face, and each had a perforating wound in the upper part of the chest or lower neck, and each had a shot in the back.\"\n\nState Bureau of Investigation Special Agent Steven Thomas Carpenter, an expert in the field of firearm identification, testified that in his opinion one bullet taken from the body and another bullet taken from the body or clothing of Anna Quick were fired by the nine-shot .22-caliber Harrington and Richardson revolver which was seized from the taxicab of \"Turf\" Holloway. Carpenter also examined the four bullets and some bullet fragments recovered from the body of Darryl Williams. Three of these bullets did not contain sufficient markings to enable Carpenter to make comparisons with test bullets, and the bullet fragments were similarly unidentifiable, but Carpenter testified that in his opinion one bullet was fired by the revolver which defendant sold to Holloway. No latent fingerprints of comparative value were recovered from the gun itself.\n\nOn 23 June, SBI Special Agent Steven R. Jones processed both Anna Quick's and Darryl Williams' automobiles for prints and other evidence. From Quick's Dodge Dart, he obtained forty-eight fingerprint lifts from the car itself, and he also obtained fourteen fingerprint lifts off a Wild Irish Rose wine bottle found in the car. He submitted these lifts to SBI Agent Richard L. Crivello, who testified as an expert in the field of identification and comparison of fingerprints. Of the prints he received, Agent Crivello determined that one print from the wine bottle was made by the right index finger of the defendant. A latent right palm print on the bottle and another latent right palm print on the automobile were also determined to have been made by defendant. In addition, a latent palm print on one paper bag and a latent fingerprint on another bag found in the car were, in Crivello's opinion, made by defendant's left palm and left ring finger, respectively. Agent Crivello found no fingerprints or palm prints of John Dwight Abrams from the latent lifts taken from Quick's car and submitted by Agent Jones. From the Duster, Jones obtained thirty-seven latent print lifts, including four latent lifts which were on the outside left front door glass on the driver's side. Of these four latent prints, one lift was pointed downward on the top edge of the outside of the driver's door window. Agent Crivello testified that this print matched the left index fingerprint on an inked impression card of the defendant. Agent Crivello further testified that there were no prints of value taken from the Duster in which he could identify the known impressions of John Dwight Abrams; all of his identifications were of the prints of the defendant.\n\nDefendant presented two witnesses in his behalf at trial. The defense first presented the testimony of Investigator Gooch to the effect that upon Gooch's suggestion to defendant's brother that defendant surrender himself, defendant turned himself in to the sheriff's department on 22 June at 8:30 p.m., and that defendant was cooperative with law enforcement officers in volunteering to show them, and in directing them to, Quick's and Williams' cars and to the I-40 crossover where Williams' identification card was found. Gooch further testified that at first defendant admitted that he had shot Anna Quick and that Dwight Abrams had shot Darryl Williams, but later that same night defendant said that he had shot Darryl Williams and Dwight Abrams had shot Anna Quick. Defendant also called Martha Trice as a witness. Ms. Trice testified that she had known the defendant for ten to fifteen years. She said that about a week before she heard of defendant's arrest, defendant and another man whom she had never seen before came to visit her at her house and that they stayed for fifteen to twenty minutes. She identified John Dwight Abrams, who was seated in the courtroom, as that other man. The defendant did not take the stand.\n\nOn 9 November 1983, the jury found defendant guilty of murder in the first degree of both Darryl Wade Williams and Anna Quick on the basis of premeditation and deliberation as well as under the felony murder rule in each case. The jury also found defendant guilty of kidnapping in the first degree of Darryl Williams and guilty of armed robbery of both Darryl Williams and Anna Quick.\n\nIn the sentencing phase of the trial, defendant offered the testimony of Clarence Dunn, his stepfather. Dunn testified that defendant was \"a good boy . . . until he met this young lady, then he started goin' down.\" He related a drastic behavior change in defendant beginning about six months before defendant was arrested; Dunn told the jury that defendant \"started drinking a lot, runnin' around with a bad crowd . . . stopped going to church.\" Dunn said that he knew defendant \"was kind of off a little bit and needed help.\" He also said that he knew that defendant's father had mental problems and had been \"in and out of\" the state hospital at Butner. James Robbins, defendant's half brother, testified that defendant's natural father \"was sort of a violent type person\" who had drinking problems. James said that when defendant's\n\nfather got angry, \"he'd just started beatin' on the first person he got to\" and that he himself had left home when defendant was about ten or eleven years old because he got tired of being physically beaten. He said that in 1982 he saw defendant every day, and echoed Dunn's testimony that defendant's behavior began to change. James testified that defendant started \"drinkin', runnin' around, wouldn't stay at home. . . . He just didn't take the responsibility for nothin', hangin' out. . . . He just let himself go.\" James told the jury that defendant became \"raggedy, dirty . . . [h]e didn't shave or he didn't change clothes or he didn't care how he looked or wouldn't work.\" He said that defendant started acting \"weird\" and withdrawn, and that James and his mother discussed the problems and the possibility of getting help for defendant; in fact, he said, he even considered taking defendant to Butner. Shortly before he knew of the charges against defendant, James testified, he went looking for defendant and saw defendant walking up the road. Although it was about eighty or ninety degrees that day, he remarked, defendant \"was walking down the road and he just stopped and he was staring up in the air with a leather coat on and an umbrella, and that's the way he had been out there, for a week like that.\" He said that when defendant saw his car, defendant ran into the woods and he could not catch him. One afternoon a few days later, Gooch and another man came to serve a warrant on defendant. James agreed to help find his half brother. When he finally found defendant, he described him as being \"[j]ust like a wild man.\" James first took defendant to Butner, but it was after hours and defendant could not be admitted, he said, so James finally persuaded defendant to accompany him to the sheriff's department. Alberta Dunn, a longtime friend of defendant, described him as a \"very intelligent, very nice person.\" Karen McQuaig testified that in mid-1982, defendant had \"changed\" in that he had \"started drinking, sleeping in the truck, not taking a bath, not caring about hisself.\" Betty Satterfield, defendant's half sister, also testified that beginning about May 1982, defendant, who had previously been well-dressed and neat, had started drinking and began to neglect himself. He became withdrawn and kept to himself.\n\nThe state offered evidence at the sentencing hearing that defendant had pleaded guilty to the crime of rape in 1967 in Durham County.\n\nAs to the murders of Darryl Williams and Anna Quick, the jury found the following circumstances in aggravation: the defendant had been previously convicted of a felony involving the use of threat of violence to the person, N.C.G.S. § 15A-2000(e)(3), and the murder of Darryl Williams (Anna Quick) was committed while defendant was engaged in the commission of robbery with a firearm of Darryl Williams (Anna Quick). N.C.G.S. § 15A-2000(e)(5) (1983). The following circumstances were submitted to the jury to be considered in mitigation in each case:\n\n(1) The murder of Darrel [sic] Wade Williams (Anna Quick) was committed while Phillip Thomas Robbins, Jr. was under the influence of mental or emotional disturbance.\n\n(2) The capacity of Phillip Thomas Robbins, Jr. to appreciate the criminality of his conduct or to conform his conduct to the requirements of the law was impaired.\n\n(3) Any other circumstance or circumstances arising from the evidence which you the jury deem to have mitigating value.\n\nThe jury found at least one of these circumstances to exist but did not specify which one(s). Upon unanimously finding beyond a reasonable doubt that the mitigating circumstance(s) were insufficient to outweigh the aggravating circumstances and that the circumstances in aggravation were sufficiently substantial to call for the imposition of the death penalty, the jury recommended a sentence of death in each case. Judgments of execution were entered on 11 November 1983. Defendant was also sentenced to a term of imprisonment for eighteen years for the armed robbery of Anna Quick, eighteen years for the armed robbery of Darryl Williams, and twenty years for the kidnapping in the first degree of Williams, all sentences to run consecutively.\n\nI. Guilt-Innocence Phase\n\nDefendant first argues that the trial court erred in denying his motion to dismiss the kidnapping charge at the close of all the evidence. It was alleged in the indictment on this charge that defendant kidnapped Darryl Williams \"by unlawfully confining him, restraining him, and removing him from one place to another, without his consent and for the purpose of facilitating the commission\n\nof the following felonies; robbery with a dangerous weapon and murder.\" See N.C.G.S. § 14-39 (1986). The trial judge instructed the jury that in order to find defendant guilty of kidnapping Darryl Williams, it must find that defendant \"unlawfully restrained Darryl Wade Williams by use of a twenty-two caliber pistol or carried Darryl Wade Williams from North Hills Shopping Center in Raleigh to Bivins Road in Durham County, and that Darryl Wade Williams did not consent to this restraint or removal . . . .\" Defendant contends that the state failed to prove that he restrained or removed Darryl Williams by force or fraud against his will. We agree that the evidence was insufficient to support a kidnapping charge, and for this reason we reverse the kidnapping conviction.\n\nThe evidence in the record tends to show that Darryl Williams left his house at 8:30 p.m. on the night of 18 June to go to see a movie at North Hills Shopping Center. Anna Quick's black-over-red Dodge Dart, in which defendant had been seen earlier, was subsequently found in that same shopping center. Later on that night, Williams and defendant appeared at Cynthia Webb's apartment in Durham. The evidence is somewhat conflicting on whether, when defendant first came to Ms. Webb's door, Williams was with him or not. State's witness Webb testified that defendant came over to her apartment sometime after midnight on 18 June 1982, and she thereafter testified as follows:\n\nQ. And did [defendant] have any one with him?\n\nA. He had Darryl Williams, a young guy with him.\n\nQ. At that time did you know who Darryl Williams was?\n\nA. No, I didn't.\n\nQ. Go ahead in your own words, if you would, and describe what happened when this defendant came in with Darryl Williams.\n\nA. They came in and Jackie and my brother went in the rest room and talked and -- . . . And we offered Darryl a seat and he sat down and they talked in the bathroom for about fifteen minutes and then [defendant] came out and said he was leaving, but he was going to come back and that he was coming back.\n\nHowever, Leonard Hawes, Ms. Webb's brother, testified on direct examination by the state that defendant knocked at the door, came in, sat down, asked for a beer, began drinking it, told Hawes he wanted to talk with him for a minute, and the two men went into the bathroom. Hawes was then asked, \"Now, at this time, before you went in the bathroom, was anybody else in -- was anybody else with Mr. Robbins?\" Hawes answered, \"No.\" Soon thereafter, Hawes was asked:\n\nQ. Was there another person there with him at the house?\n\nA. Yes.\n\nQ. All right, now, when did that person come in the house?\n\nA. Before we went into the bathroom.\n\nQ. Before you went into the bathroom?\n\nA. Yes.\n\nQ. [D]id that person come through the door or did Mr. Robbins go get him or how did he get in the house?\n\nA. He went back outside and got him.\n\nQ. When you say, \"he went back outside,\" who are you referring to?\n\nA. Jackie went back outside and got him.\n\nEven taking the evidence in the light most favorable to the state, that is, that defendant and Williams initially entered the apartment at the same time, there is nothing in this testimony to indicate that Darryl was forced or tricked into the apartment. Cynthia Webb also testified that Darryl was offered a seat and that he sat down while defendant and Hawes talked in the bathroom. She said that the bathroom door was within eyeshot of the living room where Darryl and the others were sitting, but that she believed the bathroom door was closed while the two men were in there. Webb could not remember Darryl having said anything at all while he was there, except possibly that he thanked them after they invited him to sit down. On cross-examination Webb testified that of the fifteen to twenty minutes Darryl and\n\ndefendant were there, defendant and Hawes spent \"almost the whole time\" talking in the bathroom. She went on to testify on cross-examination as follows:\n\nQ. And during the time that he [defendant] was in the bathroom with your brother, Mr. Williams was seated on the couch in your living room?\n\nA. Yes.\n\nQ. And other people were seated around there talking?\n\nA. Right.\n\nQ. Do you know what kind of car they arrived in?\n\nA. Well, when I opened the door for them I didn't see the -- I saw the shape of the car, but I didn't see the color or anything like that, because it was at night and it was late.\n\nQ. And I believe at that time Darryl Williams had the car keys, is that correct?\n\nA. Right.\n\nQ. And during the time that Darryl Williams was seated in your living room he did not appear to be frightened or scared, upset or anything like that?\n\nA. No. He just sat there.\n\nQ. And he was quiet?\n\nA. Right.\n\nQ. To your knowledge, was there any reason he could not have gotten up and left the apartment after that time?\n\nA. No, I don't think -- He could have left, I guess, you know, if he wanted to.\n\nOur holding is supported by our decision in State v. Jackson, 309 N.C. 26, 305 S.E.2d 703 (1983). In Jackson, the defendant, intending to rob the victim, feigned engine difficulty as a ruse to get the victim to give him a ride in his automobile. Jackson, who was armed with a pistol, got into the victim's car and they drove away. The victim was later found in his car on a side road. He had been robbed and shot twice in the head. We held in that case that\n\nthe evidence supported only a mere conjecture that Jackson used the misrepresentation to confine, restrain, or remove the victim against his will from the time the defendant entered the victim's car until the time the victim was shot. The state failed to prove beyond a reasonable doubt that the defendant had confined, restrained, or removed the victim within the meaning of N.C.G.S. § 14-39. Similarly, in the present case the record is barren of evidence indicating how or why defendant got up with Williams, under what circumstances they went to Durham, or what occurred between the time Williams and defendant left Webb's apartment and the time Williams was shot. Indeed, we do have testimony indicating that Williams was left outside Webb's apartment, apparently alone and in possession of his car keys, for five minutes; that Williams sat quietly on Webb's sofa and made no effort to leave while defendant was in the bathroom with the door closed; that Williams did not appear to be afraid or nervous; and that there was no apparent reason that Williams could not have left the apartment. Any determination that defendant restrained or removed Williams by force or fraud against his will would be based on mere speculation. Thus, we conclude that the state failed to prove beyond a reasonable doubt that defendant restrained, confined, or removed Darryl Williams within the meaning of N.C.G.S. § 14-39. The conviction of defendant on the charge of kidnapping is reversed.\n\nDefendant also argues that his being convicted and sentenced for both murder in the first degree and kidnapping in the first degree placed him in double jeopardy. See State v. Freeland, 316 N.C. 13, 340 S.E.2d 35 (1986). Because we have reversed the conviction on the kidnapping charge, this assignment of error is moot.\n\nThe defendant next argues that the evidence in this case establishes a prima facie case of purposeful racial discrimination in selection of the petit jury under the standards enunciated in Batson v. Kentucky, 476 U.S. , 90 L. Ed. 2d 69 (1986). Although the case sub judice was tried prior to the date the rule in Batson was announced, the applicability of Batson to this case has since been settled by Griffith v. Kentucky, 479 U.S. , 93 L. Ed. 2d 649 (1987), which mandates that the rule has retrospective application to all cases pending on direct appeal or which were not yet\n\nfinal when Batson was decided. Thus, the rule in Batson applies to this case.\n\nInitially we note that whereas in Batson the defendant entered a timely objection at trial to the prosecutor's removal of all black persons on the venire, defendant here neither objected to the use of the district attorneys' peremptory challenges to remove black jurors nor made a challenge to the petit jury before the jury was empanelled. Normally, failure to object at trial would preclude our consideration of this issue. N.C.G.S. §§ 15A-1446(a), (b) (1983 \u0026 Cum. Supp. 1985); see State v. McDougall, 308 N.C. 1, 301 S.E.2d 308, cert. denied, 464 U.S. 865, 78 L. Ed. 2d 173 (1983); Miller v. State, 237 N.C. 29, 74 S.E.2d 513, cert. denied, 345 U.S. 930, 97 L. Ed. 1360 (1953). However, defendant claims that any such objection would have been futile under the law of North Carolina as it existed at the time. Although the futility of presenting an objection at trial cannot alone constitute cause for a failure to object, Engle v. Isaac, 456 U.S. 107, 130, 71 L. Ed. 2d 783, 802 (1982), we find it difficult to hold that defendant has waived a right which he did not know existed at the time of trial. Moreover, where the defendant was, as here, on trial for his life, we ordinarily feel compelled to consider his argument.\n\nIn Batson, the Supreme Court held that a prosecutor's challenges to potential jurors solely on account of their race or on the assumption that jurors of defendant's race would be partial to the defendant is violative of the equal protection clause. U.S. Const. amend. XIV, § 1. Specifically, the Court held that a defendant may establish a prima facie case of invidious discrimination upon evidence concerning the prosecutor's use of peremptory challenges at trial. The assessment standards were set out by the Court as follows:\n\nTo establish such a case, the defendant first must show that he is a member of a cognizable racial group, Castaneda v. Partida, supra, at 494, and that the prosecutor has exercised peremptory challenges to remove from the venire members of the defendant's race. Second, the defendant is entitled to rely on the fact, as to which there can be no dispute, that peremptory challenges constitute a jury selection practice that permits \"those to discriminate who are of a mind to discriminate.\" Avery v. Georgia, supra, at 562. Finally, the\n\ndefendant must show that these facts and any other relevant circumstances raise an inference that the prosecutor used that practice to exclude the veniremen from the petit jury on account of their race. This combination of factors in the empanelling of the petit jury, as in the selection of the venire, raises the necessary inference of purposeful discrimination.\n\n476 U.S. at , 90 L. Ed. 2d at 87-88. In its holding, the Court directed that \"all relevant circumstances\" should be considered by the trial court in determining whether the defendant has raised the required inference of discriminatory purpose. These circumstances may include, but are not limited to, such things as a \"pattern\" of strikes against jurors in the venire who are of the same race as the defendant, or questions and statements made by the prosecutor during voir dire examination and in exercising his peremptories which may either lend support to or refute an inference of discrimination. If a defendant is able to make the necessary showing, the burden then shifts to the state to come forward with a neutral explanation of its challenges to those jurors. Such explanation \"need not rise to the level justifying exercise of a challenge for cause,\" id. at , 90 L. Ed. 2d at 88, but the prosecutor may not rebut the prima facie case simply by denying any discriminatory motive or by saying that he challenged those jurors on a hunch -- a \"feeling in his bones\" -- that they might be biased in favor of the defendant because they were of defendant's race; rather, the prosecutor must actually \"articulate a neutral explanation related to the particular case to be tried.\" Id.\n\nOur task is to decide whether defendant has made out a prima facie case under the ruling in Batson which would require the state to go forward and produce neutral reasons for the challenging of the jurors. Under the facts of this case, we are constrained to view the jury at the time of empanelling.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nIn Batson, the Supreme Court did not specify the showing necessary to establish a prima facie case of discrimination, stating, \"We have confidence that trial judges, experienced in supervising voir dire, will be able to decide if the circumstances concerning the prosecutor's use of peremptory challenges creates a prima facie case of discrimination against black jurors.\" 476 U.S. at , 90 L. Ed. 2d at 88. We have looked to the applicable case law in the federal courts and other state jurisdictions which have applied the Batson rule to determine whether a prima facie case has been made. See, e.g., Clay v. State, 290 Ark. 54, 716 S.W. 2d 751 (1986); People v. Cannon, 150 Ill. App. 3d 1009, 502 N.E. 2d 345 (1986); People v. Lester, 145 Ill. App. 3d 720, 495 N.E. 2d 1278 (1986); Wilder v. State 498 N.E. 2d 1295 (Ind. Ct. App. 1986); State v. Newman, 491 So. 2d 174 (La. App. 1986); State v. Gilmore, 103 N.J. 508, 511 A. 2d 1150 (1986); Commonwealth v. McKendrick, 356 Pa. Super. 64, 514 A. 2d 144 (1986), appeal denied, 522 A. 2d 558 (Pa. 1987). We conclude that the defendant must show the following in making out his prima facie case when the Batson issue is raised for the first time after the jury has been empanelled, as in this case: First, that the defendant is a member of a cognizable racial group victimized by discrimination. This criterion is clearly met here, as blacks have been held to be such a group, Batson; Castaneda v. Partida 430 U.S. 482, 51 L. Ed. 2d 498 (1977), and the defendant in the case before us is black. Second, that the prosecutor used peremptory challenges to exclude members of defendant's race. In the present case, the prosecution peremptorily challenged seven black persons. Third, that these and other relevant facts and circumstances, as they are set out in the record, raise an inference of racially discriminatory intent on the part of the state. Such \"relevant circumstances,\" or special facts and circumstances, may be, but are not limited to, the following: the fact that peremptory challenges are prone to discriminatory use, Batson, 476 U.S. at , 90 L. Ed. 2d at 89; United States v. Erwin, 793 F.2d 656 (5th Cir. 1986), cert. denied, U.S. , 93 L. Ed. 2d 590 (1986); an intentional, regular, and repeated use of peremptory challenges to blacks which would tend to establish a \"pattern\" of strikes against blacks in the venire (see United States v. Hunter, 459 F.2d 205 (4th Cir. 1972), cert. denied, 409 U.S. 934, 34 L. Ed. 2d 189, reh'g denied, 413 U.S. 923, 37 L. Ed. 2d 1045 (1972), for a definition of \"pattern\"); the prosecution's use of a disproportionate number of peremptory\n\nchallenges to strike black jurors in a single case; questions and remarks by the prosecutor during the examination of the jurors and the exercise of his peremptory challenges, Batson, 476 U.S. at , 90 L. Ed. 2d at 88; see State v. Gilmore, 103 N.J. 508, 511 A. 2d 1150 (assistant prosecutor's explanation that he exercised his peremptory challenges to exclude all seven black venirepersons from the petit jury because he assumed that they were predominately Baptists was a belatedly contrived excuse for acts of both racial and religious group discrimination); the fact that the victim(s) and the defendant(s) are of different races, see, e.g., Turner v. Murray, 476 U.S. , 90 L. Ed. 2d 27 (1986); United States ex rel. Kyles v. O'Leary, 642 F. Supp. 222 (N.D. Ill. 1986) (held: prima facie case under Batson had been demonstrated); where racial issues are inextricably bound up with the conduct of the trial, e.g., Ham v. South Carolina, 409 U.S. 524, 35 L. Ed. 2d 46 (1973); \"systematic exclusion [of cognizable racial group] in case after case over an extended period of time,\" Gilmore, 103 N.J. 508, 536, 511 A. 2d 1150, 1165. A finding of invidious discriminatory intent may be raised either by direct or circumstantial evidence. Arlington Heights v. Metropolitan Housing Corp., 429 U.S. 252, 266, 50 L. Ed. 2d 450, 465 (1977); Clark v. City of Bridgeport 645 F. Supp. 890 (D. Conn. 1986). Even a single act of invidious discrimination may form the basis for an equal protection violation.\n\nWe have closely scrutinized the record and transcript of the jury voir dire in order to determine this issue. From the evidence as we have reviewed it, we have concluded that defendant has failed to establish a prima facie case of purposeful discrimination. Although defendant, a black, has clearly met the first criterion of the Batson test, that is, that he is a member of a cognizable racial group, and while we have borne in mind the Supreme Court's admonition that peremptory challenges lend themselves to be used in a discriminatory fashion by those inclined to do so, we are not convinced that these facts and the attendant circumstances surrounding the prosecution's exercise of peremptories raise the necessary inference of racial discrimination.\n\nOur examination of the record in this case reveals that the trial jury was composed only of white persons. One of the two alternate jurors was black. Of the seventy-six potential jurors, who were individually questioned on voir dire in order to fill a\n\ntotal of fourteen seats, twenty-one were black. Of these, ten were successfully challenged for cause by the state under N.C.G.S. § 15A-1212(8) due to their unequivocal opposition to the death penalty (one after the first twelve jury panel members had been selected); two were excused for cause by the court on its own motion: Dennis Harris, because he and victim Anna Quick's sons were \"school buddies,\" and Wanda Kendall, because she apparently was aware from publicity that defendant had been charged with another murder which occurred in Orange County (see Robbins, 309 N.C. 771, 309 S.E.2d 188); seven were peremptorily challenged by the state; one who was considered as an alternate was passed by the state but was peremptorily challenged by the defendant; and defendant requested but was denied an additional challenge to another black who was ultimately seated as the second alternate juror.\n\nTurning to the state's use of its peremptory challenges, we discern from the transcript that the prosecution exercised a total of thirteen such challenges, seven against blacks and six against whites. The first black to be peremptorily challenged by the state was the thirty-fourth person examined. In selecting the panel of twelve, the prosecution exercised five peremptory challenges against persons who expressed serious reservations about their ability to return a recommendation of death; three of these persons were white and two were black. One black female was a relative of two of the defendant's witnesses; one elderly white woman was excused after she stated she wasn't sure she could sit through a protracted trial; and two blacks were dismissed by the state after being questioned, as were the other potential jurors, about their exposure to pretrial publicity, their personal backgrounds, and their feelings about the death penalty. Nothing in the prosecutor's questions or statements in the exercise of any of these challenges evinced any discriminatory motive.\n\nIn selecting the two alternate jurors, the state used three peremptory challenges against persons who expressed opposition to the death penalty, one being black and two being white, and Assistant District Attorney (now Judge) Orlando Hudson, himself black, peremptorily challenged one additional black male after some questioning.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The state passed John Rowland, a black male,\n\nbut the defendant struck him peremptorily after Rowland indicated that he had lived two houses down from Investigator Gooch for ten years, that he had read newspaper accounts of the case and had discussed it with various persons, and that he believed in the death penalty. Clarence Walker, a black male, was passed by the state and ultimately seated as the second alternate juror. Not only did the state pass to the defendant for approval two black jurors during the selection of the alternate jurors, we also perceive nothing in the prosecutors' questions or statements to any of these potential jurors which would indicate that they were peremptorily challenged pursuant to a discriminatory intent.\n\nWe have carefully scrutinized and considered the evidence in this case in order to discern whether there is any indication whatsoever that the prosecutors exercised peremptory challenges to strike blacks from the petit jury because of their race. In addition to the facts set out above, we note that the victims were black, as is defendant. We also take notice of the facts that the first black to be peremptorily challenged by the state was the thirty-fourth person examined and that defendant had used only eleven of the fourteen peremptories allotted him at the time he accepted a white male to fill the twelfth seat on the petit jury. The jurors in this case were selected one at a time, upon individual voir dire. The record indicates that the venire was kept in the grand jury room and potential jurors were brought into the courtroom one at a time, so neither the state nor the defendant knew how many blacks were present in the venire or which juror would be examined next and whether he or she was black or white. The state's examination of each potential juror was conducted in the same format: introduction of the district attorney and assistant district attorney; summary of the charges against the defendant; questions seeking general information about the examinee (employment, education, family, memberships in organizations, and so forth); questions to determine if the juror was familiar with the defendant, the victims, or any of the witnesses in the trial; questions about exposure to pretrial publicity; a general explanation of the law to be applied in capital cases, followed by death-qualification; questions about the juror's prior experience with\n\nthe judicial system; questions concerning whether the juror had ever been a victim of a crime. The state posed essentially the same questions to all seventy-six potential jurors examined and asked those questions in virtually the same order. In the exercise of each peremptory challenge, both prosecutors employed basically the same language: \"Your Honor, without further questions and with thanks of the State we would excuse [juror's name],\" or \"Your Honor, for the purposes of this trial the state would excuse this juror.\" No reasonable inference can arise on these facts that the state was racially motivated in striking any of the black jurors.\n\nAs Justice White wrote in his concurring opinion in Batson, \"it is not unconstitutional, without more, to strike one or more blacks from the jury.\" 476 U.S. at , 90 L. Ed. 2d at 91. Accord United States v. Ratcliff, 806 F.2d 1253 (5th Cir. 1986), cert. denied, U.S. , L. Ed. 2d (1987). This was echoed by Justice O'Connor in her concurrence to the denial of certiorari in Brown v. North Carolina, U.S. , 93 L. Ed. 2d 373 (1986), where she wrote:\n\nBatson does not touch, indeed, it clearly reaffirms . . . the ordinary rule that a prosecutor may exercise his peremptory strikes for any reason at all.\n\nU.S. , 93 L. Ed. 2d at 374. She went on to note that prosecutors may \"take into account the concerns expressed about capital punishment by prospective jurors, or any other factor, in exercising peremptory challenges . . . .\" Id. We detect nothing in the prosecutors' questions or comments to any of the blacks peremptorily challenged to give rise to an inference of discriminatory purpose. There were no intentional, regular, and repeated challenges to blacks which would tend to establish a \"pattern of strikes\" against black jurors included in the particular venire. No other factors or circumstances either support or refute the notion that black jurors were challenged pursuant to a racially discriminatory purpose. Defendant gives us no specific examples in his brief of instances of the discriminatory use of peremptories on the part of the prosecution, nor does he present us with any evidence of discriminatory intent. The mere naked allegation of constitutional infirmity asserted by defendant -- that prospective black jurors were excluded from the petit jury by the state's selective\n\nuse of its peremptory challenges in violation of Batson, evidenced by the fact that the panel of twelve in defendant's case was composed entirely of whites -- is not enough. Merely showing that defendant is of a cognizable racial group, that members of his race were peremptorily challenged, and that no members of his race sat on the panel of twelve does not establish a prima facie case, see Esquivel v. McCotter, 791 F.2d 350 (5th Cir. 1986) (defendant Mexican-American). The defendant should have articulated \"other relevant circumstances,\" if any such circumstances were present, which raise an inference of discriminatory intent. See United States v. David, 803 F.2d 1567 (11th Cir. 1986). Moreover, when the twelfth juror was accepted by defendant, he had not exhausted all of his peremptory challenges. He has therefore failed to show prejudice. State v. Wilson, 313 N.C. 516, 330 S.E.2d 450 (1985). The defendant has failed to satisfy us that the circumstances concerning the prosecutors' use of peremptory challenges create a prima facie case of discrimination against black prospective jurors. As he has failed to meet his evidentiary burden, this assignment of error is overruled.\n\nThe next argument advanced by defendant is that the trial court erred in refusing to suppress the incriminatory statements defendant made to law enforcement officers because defendant had invoked his right to silence.\n\nOn the evening of 22 June, defendant appeared at the Durham County Sheriff's Department and executed a waiver of rights form. Investigator Gooch then commenced asking defendant about the Orange County homicide of Annie Carroway for which a warrant had already been issued. He also questioned defendant about the Anna Quick murder. Defendant denied any knowledge of the Quick case. At that point, Gooch began escorting defendant to the magistrate's office to execute the Orange County warrant. En route, defendant stated, \"I told you everything I know.\" Defendant contends that this statement was equivalent to an assertion of his right to remain silent and that any questioning after this statement was made was in violation of his fifth amendment rights.\n\nDefendant filed a motion to suppress the statements obtained from him on the night of 22 June, alleging that his rights waiver\n\nwas invalid because he had consumed a large amount of alcohol and had exhibited \"unusual and bizarre behavior\" prior to being questioned. After an evidentiary hearing on the suppression motion, the trial judge made findings of fact and conclusions of law and overruled the defendant's motion to suppress. In both his motion to suppress and at the suppression hearing in the trial court, the defendant argued that his statements were inadmissible on the grounds that he was intoxicated and not mentally competent to make the statements to the officers. As evidence of the claim that defendant was drunk and disoriented and that his signature on the rights waiver form was ineffective, defendant points to the fact that he misspelled his own name when he signed the form. Judge Hobgood found as a fact that defendant never stated that he did not want to answer any further questions, nor did he at any time request the presence of an attorney, and denied defendant's motion to suppress, specifically concluding that at the time defendant waived his rights, he was not so intoxicated or mentally incompetent as to render the waiver involuntary. Defendant neither raised the theory nor argued in the trial court that by telling Gooch he had told him everything he knew, he had manifested his desire that all questioning cease, thereby invoking his right to remain silent. Because the fifth amendment theory of inadmissibility was not presented to the trial court and has been raised for the first time on appeal, it is not properly before us. State v. Williams, 308 N.C. 47, 301 S.E.2d 335, cert. denied, 464 U.S. 865, 78 L. Ed. 2d 177, reh'g denied, 464 U.S. 1004, 78 L. Ed. 2d 704 (1983); State v. Hunter, 305 N.C. 106, 286 S.E.2d 535 (1982). For this reason, we reject defendant's contention.\n\nEven were we to assume, arguendo, that defendant had not waived his right to attack the admissibility of his statements on the fifth amendment theory he now advances, we do not consider the defendant's statement, \"I told you everything I know,\" to have been an indication of his desire that all questioning cease and thus an invocation of his fifth amendment right to remain silent under Edwards v. Arizona, 451 U.S. 477, 68 L. Ed. 2d 378 (1981), and Miranda v. Arizona, 384 U.S. 436, 16 L. Ed. 2d 694 (1966). We do not accept defendant's argument that his assertion suggests that defendant felt he had said all that he had to say and all that he wished to say; although the statement may well have conveyed the message that defendant had nothing else to tell, the\n\nremark could not reasonably be interpreted as indicating that he had said all he wished to say. We also disagree with defendant that the statement was ambiguous. The case on which defendant relies in support of this contention, State v. Klimczak, 159 Conn. 608, 268 A. 2d 372 (1970), is inapposite. In that case, the defendant, when asked by law enforcement officers whether he knew either of the alleged perpetrators of a theft, replied, \"Don't bother me.\" The Connecticut Supreme Court held defendant's comment to be \"equivalent to an assertion of the fifth amendment privilege.\" Such is not the situation here. In contradistinction to the Connecticut case in which the defendant's words were susceptible of being interpreted as meaning, \"Leave me alone,\" or \"Don't say anything else to me,\" and thereby effecting his right to have further questioning cease, defendant's words here, \"I told you everything I know,\" mean what they say and nothing more; they do not preclude further conversation or questioning. This assignment of error is without merit.\n\nDefendant next maintains that the admission of the identification of defendant by Joe Campbell ran afoul of both the federal and state constitutions, thereby violating his right to due process of law. Manson v. Brathwaite, 432 U.S. 98, 53 L. Ed. 2d 140 (1977); Neil v. Biggers, 409 U.S. 188, 34 L. Ed. 2d 401 (1972); Stovall v. Denno, 388 U.S. 293, 18 L. Ed. 2d 1199 (1967). He charges that the pretrial photographic lineup procedure was \"extremely suggestive and unnecessarily designed to ensure that Campbell selected the defendant,\" and that because of the alleged suggestibility, it created a substantial likelihood of irreparably mistaken identification and thus was inadmissible. Simmons v. United States, 390 U.S. 377, 19 L. Ed. 2d 1247 (1968); State v. Thompson, 303 N.C. 169, 277 S.E.2d 431 (1981). He also contends that the in-court identification made of defendant by Campbell did not comport with due process standards, State v. Corbett, 309 N.C. 382, 307 S.E.2d 139 (1983), arguing that there was not competent evidence that Campbell's in-court identification of the defendant was of independent origin from the pretrial procedures which he challenges, State v. Grimes, 309 N.C. 606, 308 S.E.2d 293 (1983).\n\nFollowing a voir dire hearing on the admissibility of Campbell's identification of defendant, Judge Hobgood made extensive findings of fact. From these findings of fact, he concluded that the\n\npretrial identification procedure with respect to the photographic lineup was not \"so unnecessarily suggestive and conducively irreparable with respect to identification as to violate the defendant's right to due process of law.\" He also determined that \"based on clear and convincing evidence, the in-court identification of the defendant, Phillip Thomas Robbins, by the witness, Joe Campbell, is of independent origin, based solely upon what the witness saw in viewing the male customer in his business on June 19, 1982, and is not tainted by any pretrial identification procedure in any form or fashion.\" The trial judge further concluded \"that none of the pretrial identification procedure was so unnecessarily suggestive and conducive to irreparable [sic] with respect to identification as to constitute a denial of due process of law.\" We find no error in the trial court's rulings.\n\nJoe Campbell testified that on Saturday, 19 June, a young black male in his early thirties, who \"looked sort of rough; not clean by any means,\" came into Campbell's place of business shortly before 11:00 a.m. It had been a slow morning and the man was the only customer in Campbell's shop. The customer browsed around for about three or four minutes, then approached the counter and inquired as to whether Campbell bought rings and things. When Campbell replied affirmatively, the man produced a gold ring. After Campbell had weighed it and told the man that he could pay $28 for it, the man said that he had paid much more for the ring. Campbell responded that he did not resell class rings but, instead, sent them to be melted down and that was all he could give for it. When the man \"didn't seem very pleased with the price,\" Campbell referred him to a nearby pawnshop. The customer, who had been in the store for a total of about ten minutes, exited. Ten to fifteen minutes later, the same man returned, went up to the counter, stood about three feet away from Campbell and directly across from him, and said he would like to go ahead and sell the ring. He handed Campbell the ring, which was a ten-karat white gold 1982 class ring and was engraved inside with the initials \"D.W.W.\" Campbell asked the customer if he had identification, and the man produced an identification card and a blood donor card. The name on the identification card was Darryl Williams. There was no photograph on the card. Campbell used this information, along with the person's description, name, address, the item sold, the amount paid, and\n\nthe date and time of the transaction, in filling out a precious metal transaction sheet which he was required by law to complete and turn in to the Greensboro Police Department. While Campbell was filling out the transaction sheet, he noticed that the date on the class ring was inconsistent with the apparent age of the customer. Campbell questioned the man about the obvious discrepancy, and the man said, \"well, this is my class ring and it's my ring.\" Since the identification and the initials on the ring matched, Campbell decided to go ahead and purchase the ring for $28. The customer signed the form in the name of Darryl W. Williams. Campbell paid the man in cash, and the man again left the store. On this second occasion, the customer remained in the store from five to seven minutes. At all times during the business transaction, the customer stood only three feet away from Campbell, who was able to get a full and complete view of him. Campbell turned in the precious metal transaction sheet to the Greensboro Police Department on Monday, 21 June.\n\nOn either Tuesday or Wednesday, Raleigh Police Detective J. R. Evans approached Campbell about the ring. Evans had just taken a photograph of defendant on the previous day, and upon finding out that a ring matching the description of Darryl Williams' class ring was being held in Greensboro, Evans had five additional photographs taken of black male inmates of the Wake County Jail. The trial court examined these photographs and found the following: that these men were photographed, as was defendant, from the chest up, barechested and standing against a cinder-block wall; that the defendant and four other men had facial hair; that the defendant and three others had similar body size; and that the defendant and two others had an Afro haircut, while the other three had hair \"which is not exceptionally short\"; that all photographs were frontal views. Evans placed these photos in a manila folder and numbered them from one to six. Campbell testified on voir dire that he first gave Evans a general description of the man from whom he'd bought the ring. Evans then asked Campbell if he thought he could pick out the picture of the person who had sold the ring if he were to see it, and Campbell replied affirmatively. Campbell also testified that Evans told him that there were six pictures in the photographic lineup and \"that one of the pictures there should contain the person that I did buy the ring from.\" Evans thereupon presented the folder to\n\nCampbell, and Campbell identified in \"a matter of a few seconds\" the person in photograph number five -- the picture of the defendant -- as the man who had sold him the ring. Evans then told Campbell that that was the individual he had hoped Campbell would select. Campbell was again shown the photo lineup on the morning of 4 November 1983, before he testified at defendant's trial. Campbell once more selected the photograph of the defendant. At the voir dire hearing, in open court Campbell pointed to the defendant and said that he recognized him as the man from whom he purchased the ring on 19 June 1982. Judge Hobgood found that Campbell's in-court identification of the defendant was made in a \"positive unequivocal manner,\" and also that Campbell \"testified in a positive unequivocal manner that he recognized the defendant as being the same person who sold him the ring without regard to any photographs which he might have seen between the date of the purchase [19 June 1982] and today [4 November 1983].\"\n\nOur review of the record confirms the trial court's findings. Campbell testified that there were similarities between the black males in the pictures in the folder but said, \"I pinpointed the picture as the person who did business in my shop right away.\" He further said, \"I looked at [the other photographs] but I immediately recognized the person.\" He testified that he premised his identification on the fact that \"the person himself was very unruly looking at the time. He was actually dirty, his hair was not combed in any fashion at all and he had a beard and somewhat of a mustache.\" He also based his selection on \"the actual hair, facial expression of the person. . . . [T]he person looked very much that day like they did the day that they entered my shop.\" Campbell went on to say, \"plus also the facial expression is one that I didn't forget either. Sort of a troubled look.\" Campbell further commented, \"I had a very good recollection of the person who sold me the ring.\" Moreover, after Campbell pointed to defendant in court, he stated, \"I recognize the man here as the person who sold me the ring.\" Campbell also denied that having seen a photograph after his initial encounter with the defendant influenced his identification in any way.\n\nWe find substantial evidence supporting the trial court's findings of fact and the conclusion of law that the pretrial identification procedures were not unnecessarily suggestive and conducive\n\nto irreparable misidentification. We also find that the trial judge's determination that Campbell's in-court identification of defendant was of independent origin was based on substantial evidence. Defendant's assignment of error is wholly without merit.\n\nThe trial court overruled defendant's objections to certain testimony at trial which defendant alleges was irrelevant, inadmissible, and prejudicial. Because of the trial judge's rulings on this evidence, defendant contends he is entitled to a new trial. Defendant first challenges the admission of the following testimony of Investigator C. J. Dobies, to whom Mrs. Pat Walker, a resident of the Bivins Road area, turned over Darryl Williams' glasses:\n\nQ. [Mr. Stephens] Did she tell you where she got those glasses?\n\nA. She showed me.\n\nQ. She showed you?\n\nA. Yes, sir.\n\nQ. Where was that?\n\nA. It was at -- Bivins Road runs north and south from Umstead, and the body was laying in the --\n\nMr. Chaney: Your Honor, I believe I'll object to anything she told him.\n\nCourt: Sustained as to anything she said.\n\nQ. (Mr. Stephens) Did you go out to the location?\n\nA. We went to the location, and these glasses were -- the area where these glasses were found were pointed out to me just east --\n\nMr. Chaney: (Interposing) Objection.\n\nCourt: Overruled.\n\nA. -- just east of where the body was lying about -- about five yards in some heavy undergrowth.\n\nDefendant maintains that Mrs. Walker's conduct in pointing to the location where she found the glasses constituted a verbal act,\n\nor assertive nonverbal conduct, and thus Dobies' testimony was inadmissible nonverbal hearsay. E.g., State v. Suits, 296 N.C. 553, 251 S.E.2d 607 (1979). He claims that he was prejudiced because the admission of the testimony that Williams' glasses were found some distance from the body buttressed the state's theory that Williams was first robbed and then shot as he walked away and supported the state's insistence on findings of a robbery as well as of premeditation and deliberation.\n\nEven assuming for the sake of argument that Dobies' testimony was properly objected to and constituted inadmissible hearsay, defendant has failed to show prejudice. State v. Powell, 306 N.C. 718, 295 S.E.2d 413 (1982). Defendant did not object to or move to strike the testimony that Williams' glasses were recovered from a location about five yards from which his body had been found. Moreover, the state did not question Dobies about the glasses on direct examination. Rather, on cross-examination of this witness, defense counsel asked a series of questions relating to the search for evidence conducted by officers at the crime scene on Bivins Road. Defense counsel then asked, \"So you . . . looked quite thoroughly at that time?\" Dobies replied, \"Yes, sir, on both sides of the adjacent road and up and down the road several hundred feet.\" \"And didn't find any evidence?\" defense counsel inquired. \"No, sir,\" Dobies answered. Defense counsel then asked, \"Did you find any glasses?\" to which the witness replied, \"I didn't find any glasses.\" Thus, it was only after defense counsel asked the question about the glasses on cross-examination that the door was opened for the state, on redirect, to elicit the testimony as to how and where Darryl Williams' prescription eyeglasses were found. Defendant can hardly assert that he was prejudiced by admission of testimony that Mrs. Walker pointed out the location of the glasses to Dobies. Finally, given the considerable evidence of defendant's guilt, we do not believe that there is a reasonable possibility that the outcome of the trial would have differed had the evidence complained of not been admitted. Id. ; N.C.G.S. § 15A-1443(a) (1983).\n\nDefendant also assigns as error the admission of certain testimony by defense witness Investigator Gooch. On direct examination, Gooch testified that on the night of 22 June 1982, the defendant made statements indicating that John Dwight Abrams had been a participant in the crimes. Defendant at one point said\n\nthat Abrams had killed Quick but that he had killed Williams, and at another time, defendant said it was the other way around. On cross-examination of Gooch, the following transpired:\n\nQ. Now, that night with Mr. Robbins, that's not the first time, is it, that someone's ever told you that somebody else did it?\n\nMr. Chaney: Objection.\n\nCourt: Overruled.\n\nA. No, sir, it's not the first time.\n\nQ. You've had suspects and people charged with crimes before tell you that somebody else did it, haven't you?\n\nMr. Chaney: Objection.\n\nCourt: Overruled.\n\nA. Yes, sir.\n\nQ. Is that fairly usual?\n\nMr. Chaney: Objection.\n\nCourt: Sustained.\n\nQ. (Mr. Stephens) But it has happened before, thought [sic], hasn't it?\n\nMr. Chaney: Objection.\n\nCourt: Overruled.\n\nA. Yes, sir.\n\nDefendant contends that this testimony was totally irrelevant, lacked any probative value, and constituted an improper attempt to impeach the defendant's implication of Dwight Abrams as a perpetrator of the crimes and that the testimony prejudiced him.\n\nDefendant correctly characterizes this line of questioning as totally irrelevant, incompetent, and lacking in probative value. However, assuming arguendo that the trial court committed error in permitting these questions and answers, we fail to see how their admission could have influenced the jury's verdict in any way for the very reason that they were completely irrelevant to\n\nthe case. We do not find, therefore, that the testimony at issue was prejudicial to the defendant.\n\nThe last segment of testimony to which the defendant objects involves questions and answers concerning the physical appearance and disposition of both Anna Quick and Darryl Williams. Anna Quick's daughter, Phyllis Melton, was asked by the district attorney, \"Could you describe [Anna Quick's] physical appearance and her nature and mannerisms?\" After defendant's objection to this question was overruled, the witness responded, \"She had a very mild manner and very nice and respected and she had lots of friends.\" Later in the trial, A. L. Williams, Darryl's father, was asked whether he could use a photograph to illustrate his testimony as to how Darryl appeared. The district attorney then asked, \"Does that depicts [sic] him as happy, contented, rather a nice young man?\" The trial court also overruled defense counsel's objection to this question. The district attorney did not wait for Mr. Williams to answer and instead went on to ask a different question. Defendant insists that such evidence of a victim's general character is immaterial and incompetent and was prejudicial. E.g., State v. Stevens, 295 N.C. 21, 243 S.E.2d 771 (1978); N.C.R. Evid. 404(a)(2). We disagree. First, Mr. Williams never answered the district attorney's question. Further, by failing to object to earlier testimony by Mr. Williams that Darryl was \"very religious, mannerable, and just a good kid,\" defendant is deemed to have waived his objection to the testimony complained of here. State v. Wilson, 313 N.C. 516, 330 S.E.2d 450; State v. Maccia, 311 N.C. 222, 316 S.E.2d 241 (1984). In a similar vein, the district attorney's request to Ms. Melton was for a description of her mother's physical appearance, nature, and mannerisms which did not necessarily call for a response regarding Ms. Quick's good character; moreover, defendant did not move to strike Ms. Melton's answer. We do not find that defendant was prejudiced by these questions and answers. These assignments of error are overruled.\n\nBy his next assignment of error, defendant challenges a segment of the prosecutor's closing argument which he contends amounted to a violation of his right to a fair trial. Defendant alleges that he is entitled to a new trial because the prosecutor, during his jury argument at the close of the guilt phase, was allowed to distort the law on felony murder in a manner calculated\n\nto prejudice the defendant. Specifically, defendant excepts to the following comments by the district attorney:\n\nThere were two witnesses during that time. They are both dead, Anna Quick and Darryl Williams. And that's the reason we've got the felony murder rule in this State, because criminals sometime take care of their witnesses so they will not be around --\n\nMr. Chaney: Objection.\n\nCourt: Overruled.\n\nMr. Stephens: So they will not be around to testify. You know, if you kill a witness, then you don't have -- you don't have an eyewitness, and so sometimes you have to rely on circumstantial evidence to prove a case. So, under our law, if you kill a witness in the perpetration of a felony, then you're guilty of first degree murder. . . . You're not going to have a police officer in a uniform with white socks and black shoes taking notes it [sic] every crime scene. You have to work with what you have, and that circumstantial evidence points unerringly to the guilt of a defendant, as it does in this case, and it's your duty as jurors to find him guilty.\n\nDefendant complains that the argument was inaccurate as a matter of law, was unsupported by the evidence, and was calculated to provoke the jurors to find defendant guilty under the felony murder rule because the state's evidence against defendant was weak. Defendant maintains that the theme that this defendant was a \"cold-blooded witness-eliminator\" was \"rife with prejudice,\" and that he is entitled to a new trial. We are unpersuaded by defendant's argument. Arguments of counsel are largely within the control and discretion of the trial judge, and counsel is to be afforded wide latitude in argument, particularly in cases which are strongly contested. E.g., State v. Riddle, 311 N.C. 734, 319 S.E.2d 250 (1984); State v. Adcock,, 310 N.C. 1, 310 S.E.2d 587 (1984). Counsel is entitled to argue all reasonable inferences which may be drawn from the facts presented. E.g., State v. Hamlet, 312 N.C. 162, 321 S.E.2d 837 (1984); State v. Murray, 310 N.C. 541, 313 S.E.2d 523 (1984); State v. Lynch, 300 N.C. 534, 268 S.E.2d 161 (1980). However, counsel may not argue facts finding no support in the evidence, e.g., State v. Williams, 317 N.C. 474, 346 S.E.2d 405 (1986); Lynch, 300 N.C. 534, 268 S.E.2d 161, and counsel may neither make erroneous statements of law, State v. Cole, 241 N.C. 576, 86 S.E.2d 203 (1955), nor argue principles of law not relevant to the case, State v. Harris, 290 N.C. 681, 228 S.E.2d 437 (1976); State v. Britt, 288 N.C. 699, 220 S.E.2d 283 (1975).\n\nWe conclude that the objected-to argument does not fall within the aegis of Williams, 317 N.C. 474, 346 S.E.2d 405; rather, here the district attorney was arguing to the jury the reasons for the felony murder rule. It is a fact that one of the reasons for the enactment of the felony murder rule is that often criminals do kill potential witnesses in the course of the commission of a felony. Within the context of the whole argument, then, we do not find the prosecutor's remarks to have been so egregious as to have resulted in prejudice to the defendant. Moreover, we note that early in his closing argument the prosecutor advised the jury that it would receive instructions from the trial court in the charge. Subsequently, in its charge to the jury, the trial court directed the jury that it must decide the facts from the evidence and \"apply the law which I am about to give you to those facts.\" The trial judge further instructed, \"It is absolutely necessary that you understand and apply the law as I give it to you, and not as you think it is, or as you might like it to be.\" Judge Hobgood later instructed completely and accurately on the felony murder rule. Further, we cannot say that there is a reasonable possibility that had the argument not been made, a different result would have been reached at trial. N.C.G.S. § 15A-1443(a) (1983). Nor do we find that the argument so infected the trial with unfairness as to make the resulting conviction a denial of due process. Darden v. Wainwright, U.S. , 91 L. Ed. 2d 144 (1986); Donnelley v. DeChristoforo, 416 U.S. 637, 40 L. Ed. 2d 431 (1974). We hold that the failure to sustain the defendant's objection to this argument was not prejudicial error.\n\nDefendant's next several assignments of error relate to alleged errors in the trial court's instructions. The first of these concerns the trial court's denial of his request to instruct the jury that in order to find defendant guilty of the armed robbery charges the jury must find that at the time defendant endangered or threatened the lives of Darryl Williams and Anna Quick he did so with the intent to steal their property. The trial court instead gave the pattern jury instructions on armed robbery. Defendant\n\ncontends that there is no direct evidence that he had formed the intent to steal at the time he shot his victims and that the jury should have been required to make such a finding in order to find defendant guilty of the armed robbery offenses.\n\nWe rejected this argument in State v. Fields, 315 N.C. 191, 337 S.E.2d 518 (1985). In that case, we held that\n\nwhen the circumstances of the alleged armed robbery reveal defendant intended to permanently deprive the owner of his property and the taking was effectuated by the use of a dangerous weapon, it makes no difference whether the intent to steal was formulated before the use of force or after it, so long as the theft and the use or threat of force can be perceived by the jury as constituting a single transaction.\n\nId. at 203, 337 S.E.2d at 525. It was also settled in State v. Wooten, 295 N.C. 378, 245 S.E.2d 699 (1978), that if a person kills another with the intent to rob the victim and takes property from the victim's person or presence immediately after the killing, the defendant has committed armed robbery regardless of the fact that the taking of the property occurred after the death of the victim. In the case of Anna Quick, defendant was caught rummaging through her purse, where she kept her money. The last time Quick was seen alive, defendant was in her car with her in Durham. Quick's body was found in Durham, but her automobile was found in Raleigh. The evidence is sufficient to support a finding by the jury that defendant had formed the intent to steal Quick's car either before or immediately after killing her. The evidence is even stronger in the case of Darryl Williams. In the early morning hours of 19 June, defendant requested that Leonard Hawes go to Greensboro with him and he told Hawes that Williams was going to loan him his car. Defendant left Webb's apartment with Williams. A few hours later, defendant returned, alone, in Williams' car. The next day, defendant sold Williams' ring in Greensboro. Again, there is sufficient evidence on which to base a reasonable inference that defendant intended to steal and took possession of Williams' automobile and ring either before, immediately after, or shortly after Williams was killed. Pursuant to our holdings in Fields and Wooten, then, the jury was not required to find as an element of armed robbery that the defendant\n\nformulated the intent to steal from his two victims before shooting them. This assignment of error is overruled.\n\nDefendant next complains that the trial court erred in refusing his request that the jury be instructed to consider the evidence of defendant's alleged intoxication and its bearing on the essential element of specific intent to kill in the charges of murder in the first degree. The trial court denied defendant's written requests that the evidence tending to show intoxication be summarized and that the jury be instructed that if it found that the defendant was intoxicated, it \"should consider whether this condition affected his ability to formulate the specific intent.\" Defendant now argues that because of the alleged error in instructions regarding intoxication, the verdicts finding defendant guilty of murder in the first degree on the basis of premeditation and deliberation cannot stand. We find no error in the trial court's failing to instruct the jury concerning the effect of voluntary intoxication upon the element of the specific intent to kill. We do not find that the evidence was sufficient to warrant such a charge. In State v. Goodman, 298 N.C. 1, 257 S.E.2d 569 (1979), the defendant argued that the trial court erred in failing to instruct the jury on the effect of voluntary intoxication upon the elements of premeditation, deliberation, and intent. Although there was evidence that Goodman had been drinking before the murder was committed, no evidence was offered showing that his capacity to think and plan was affected by the inebriation. We held that under the circumstances the trial court was not required to instruct on the defense of intoxication. In the present case, the only evidence offered relating to alcoholic beverages was that Anna Quick asked defendant if he wanted a drink and defendant said yes; that defendant purchased a pint bottle of Relska vodka with Quick's money and that defendant poured some of this vodka in a plastic cup for Earlie Mae Williams at her house; that an empty Relska bottle was found in the road near Quick's body; that a half-full bottle of Wild Irish Rose wine was found in Quick's car when it was located at North Hills Shopping Center and that defendant's palm print was on it; that defendant was given a beer in Webb's apartment and did not finish it; and that \"Turf\" Holloway testified that defendant smelled of wine and \"appeared to have been drinking\" on Tuesday, 22 June. Investigator Dobies testified that at no time during his conversations\n\nwith defendant on 22 June, either at the Durham County Sheriff's Department or in the car as defendant was directing officers to the locations of Williams' body and Quick's car, did he detect any odor of alcohol about defendant. Dobies also testified that defendant \"appeared to be in control, coherent. I didn't have any difficulty understanding his directions or his meanings.\" In this case, as in Goodman, no evidence was presented showing that the defendant's capacity to think and plan was affected or impaired by intoxication. Moreover, the trial judge included in his summary of the evidence most of the testimony which the defendant requested. The trial court also repeatedly instructed the jury that it had to find beyond a reasonable doubt that the defendant intentionally killed Anna Quick and Darryl Williams. This assignment of error is overruled.\n\nNext, defendant argues that the trial court committed error in failing to allow his written request that the jury be instructed that John Dwight Abrams might be an interested witness, contending that there was evidence that Abrams may have been the perpetrator of the crimes with which defendant was charged. By way of example, defendant cites the testimony of Investigator Gooch that defendant made statements to him which implicated Abrams -- in one instance, defendant said that Abrams killed Quick and that he killed Williams, while at another point defendant said that Abrams killed Williams and that he killed Quick. Martha Trice placed defendant and Abrams together during the week of the crimes, in contradiction of Abrams' assertion that he had not seen defendant for four to five months prior to the time he saw defendant riding up Dorothy Drive at dusk on 21 June, and \"Turf\" Holloway's, as well as Abrams' own testimony, established that Abrams assisted defendant on 22 June in selling Holloway the revolver used to kill Quick and Williams, giving rise to an inference that Abrams was in recent possession of the murder weapon. State v. Cabey, 307 N.C. 496, 299 S.E.2d 194 (1983). Even if the jury did not find Abrams to be the perpetrator of the offenses, it could have determined that Abrams was an accomplice, so an instruction on the special scrutiny to be given the testimony of an accomplice would have been appropriate, defendant asserts. See State v. Bailey, 254 N.C. 380, 119 S.E.2d 165 (1961). Defendant contends that even though an interested witness instruction involves a subordinate feature of the case, it was nevertheless reversible\n\nerror to fail to give an instruction properly requested by the defendant. E.g., State v. Eakins, 292 N.C. 445, 233 S.E.2d 387 (1977).\n\nWe begin by noting that the trial judge gave the following instruction to the jury:\n\nYou may find that a witness is interested in the outcome of this trial. In deciding whether or not to believe such a witness, you may take his or her interest into account. If, after doing so, you believe his or her testimony in whole or in part, you should treat what you believe the same as any other believable evidence.\n\nJudge Hobgood also instructed the jury as follows:\n\nYou are the sole judges of the credibility of each witness. You must decide for yourselves whether to believe the testimony of any witness. You may believe all or any part or none of what a witness has said on the witness stand. In determining whether to believe any witness, you should apply the same tests of truthfulness which you apply in your everyday affairs . . . [including] any interest, bias or prejudice the witness may have . . . .\n\nThese general instructions on interested witnesses and credibility adequately apprised the jury as to the weight to be accorded the testimony of any witness whom the jury might find to be biased or have an interest in the trial's outcome, including Abrams. State v. Moore, 301 N.C. 262, 271 S.E.2d 242 (1980). Furthermore, we do not find from our review of the transcript any credible evidence to support defendant's allegation that Abrams was either the perpetrator of or an accomplice in the crimes; the only evidence at all which suggested any involvement by Abrams was defendant's self-serving and contradictory statements to Gooch, and the evidence that Abrams helped defendant sell the murder weapon two days after Williams was killed. The case relied upon by defendant, Cabey, 307 N.C. 496, 299 S.E.2d 194, is distinguishable. In that case we held that a person was an interested witness who was found in recent possession of property taken in a robbery and who admitted receiving it from the defendant. Although a more detailed instruction on interested witnesses would have been preferable, the trial judge's general instruction on the\n\ncredibility of witnesses was held to be adequate. In the present case, where there is no evidence to indicate that Abrams was charged with any offense relating to these crimes, that he was testifying pursuant to a plea agreement with the state or a grant of immunity from the state, or otherwise was a clearly interested witness, whether Abrams should be regarded as an interested witness was for the jury to resolve. E.g., State v. Moore, 301 N.C. 262, 271 S.E.2d 242. Moreover, as defendant concedes, the interested witness instruction relates to a subordinate feature of the case. In short, we do not find that defendant has shown he was prejudiced by the trial court's refusal to give the specific instruction he requested. We find this assignment of error to be meritless.\n\nBy way of supplemental brief to this Court, defendant, pro se, brings forth three assignments of error concerning the trial court's denial of his motions to dismiss all the charges against him. He first argues that the trial court erred in denying at the close of the state's evidence his motion to dismiss the charges of murder in the first degree of both victims. He does not argue that the evidence was insufficient to sustain his convictions of murder in the first degree under the felony murder rule; however, he does challenge the sufficiency of the evidence to support a theory of first-degree murder based on premeditation and deliberation. Defendant premises his contention on the grounds that there was no evidence of the use of excessive force nor was there evidence that shots were fired after the victims were felled as might support an inference of premeditation and deliberation. The law is well settled as to the legal meaning of premeditation and deliberation. E.g., State v. Jackson, 317 N.C. 1, 343 S.E.2d 814 (1986), vacated on other grounds, U.S. , 94 L. Ed. 2d 133 (1987); State v. Brown, 315 N.C. 40, 58-59, 337 S.E.2d 808, 822-23 (1985), cert. denied, U.S. , 90 L. Ed. 2d 733 (1986). We find that the evidence was sufficient to support a reasonable inference of premeditation and deliberation as to each victim. The evidence in the light most favorable to the prosecution shows that both victims, whose bodies were found in isolated areas of north Durham County, had been shot multiple times at close range; autopsies revealed that both had close or contact wounds to the back, neck, face, and head behind the left ear. We have previously held that the nature and number of the victim's wounds is a circumstance\n\nfrom which premeditation and deliberation can be inferred. State v. Brown, 315 N.C. 40, 337 S.E.2d 808; State v. Bullard, 312 N.C. 129, 322 S.E.2d 370 (1984). There was no evidence of any provocation by either victim. In short, the brutal method of these killings provides substantial evidence that the killer premeditated and deliberated. Brown, 315 N.C. 40, 337 S.E.2d 808; State v. Williams, 308 N.C. 47, 301 S.E.2d 335.\n\nRegarding defendant's subargument alleging that the state's evidence was sufficient to raise only a mere suspicion or conjecture as to his identity as the perpetrator of either murder, see State v. Evans, 279 N.C. 447, 183 S.E.2d 540 (1971); State v. Cutler, 271 N.C. 379, 156 S.E.2d 679 (1967), we observe that the evidence at trial indicated, inter alia, the following: both victims were in the company of defendant the last time they were seen alive; defendant and Williams arrived at Cynthia Webb's apartment together; defendant asked Leonard Hawes to accompany him to Greensboro, he and Williams left, and when defendant returned to Webb's apartment later, he was driving Williams' car and Williams was not with him; defendant told Leonard Hawes that the gun he had showed him earlier was warm because he had just shot it; defendant was identified as the person who represented himself as Darryl Williams and sold Williams' class ring in Greensboro; Quick's car was taken to North Hills Shopping Center in Raleigh and abandoned, and the car belonging to Williams, whose destination had been that same shopping center, was later found in Hillsborough; defendant led officers to Williams' body, the site of some of the victims' belongings, and to Quick's car and told them where to find the car belonging to Williams; defendant's palm- and/or fingerprints were found in both victims' cars; defendant sold the murder weapon to \"Turf\" Holloway; defendant made incriminating statements to investigating officers which implicated him in both murders. We find substantial evidence indicating that defendant was the murderer of both victims. Id. As to the defendant's argument that John Dwight Abrams could have been the perpetrator of the murders, there is absolutely no evidence whatsoever to support that contention, and the issue was resolved at trial against defendant by the jury. This assignment of error is completely meritless.\n\nDefendant also challenges the sufficiency of the evidence as to his convictions of the robberies with a firearm of Quick and\n\nWilliams. His argument in this regard appears to be that because the evidence presented as to the robberies was entirely circumstantial rather than direct, such evidence could not prove guilt beyond a reasonable doubt. Specifically, he argues that there was no direct evidence that he drove Quick's car to Raleigh or that he drove Williams' car to Hillsborough, nor is there direct evidence that he took the cars by endangering or threatening the lives of the victims or that he intended to permanently deprive the victims of their cars. Again, the evidence shows that both victims had cashed their employment checks and had last been seen with defendant on the days they were killed; defendant had been seen rummaging through Quick's handbag earlier in the day; defendant was driving Williams' car on the morning of the killing after having told Hawes that Williams was going to let him \"borrow\" it; defendant's prints were later found on several items inside Quick's car and on the car itself, which had been left at the same location from which Williams likely disappeared; when Williams' body was found, the left rear pocket on his trousers was unbuttoned and the other pocket had been turned inside out, and his wallet and class ring were missing; defendant sold Williams' high school ring in Greensboro and led officers to a location where they found several items which had been in Williams' wallet. The brutal killings of both victims in addition to defendant's recent possession of both Quick's and Williams' stolen cars raise the presumption of fact that he is guilty of armed robbery. State v. Bell, 270 N.C. 25, 153 S.E.2d 741 (1967). In addition, the killing of Williams and defendant's recent possession of the high school ring which belonged to Williams was sufficient evidence to support the verdict of guilty of the armed robbery of Williams. Id.\n\nDefendant also contends that the trial court erred in denying his motion to dismiss the kidnapping charge. For the reasons discussed earlier in this opinion, we have already resolved this issue in favor of the defendant.\n\nDefendant's last pro se contention is that his convictions of murder in the first degree and his death sentences were obtained by the state's knowing use of the perjured testimony of the Chief Medical Examiner, Dr. Page Hudson. In support of his accusation, he points to certain alleged inconsistencies between Dr. Hudson's testimony concerning the number of wounds from the victims' bodies and Dr. Hudson's testimony in an earlier Orange County\n\nsentencing hearing for defendant's conviction for the murder in the second degree of Annie Carroway. State v. Robbins, 309 N.C. 771, 309 S.E.2d 88. All of these inconsistencies are minor, insubstantial differences concerning the number of wounds he found and the number of bullets or fragments discovered. This testimony would not support a perjury charge.\n\nIn order to prevail on a claim of perjured testimony, defendant must show that the testimony was in fact false, material, and knowingly and intentionally used by the state to obtain his conviction. McBridge v. United States, 446 F.2d 229 (10th Cir. 1971), cert. denied, 405 U.S. 977, 31 L. Ed. 2d 252 (1972). Minor variations in testimony are insufficient to establish that a witness is perjuring himself, State v. McDowell, 310 N.C. 61, 310 S.E.2d 301 (1984), and it is for the jury to determine the weight, if any, to be given to testimony where alleged inconsistencies are before the jury. See State v. Montgomery, 291 N.C. 235, 229 S.E.2d 904 (1976). Defendant has not met his burden of showing that the testimony was in fact false, material, and knowingly and intentionally used to obtain his conviction. Such minor inconsistencies in testimony do not compel a finding that Dr. Hudson committed perjury and that the government knew it. Moreover, defendant had the opportunity to impeach Dr. Hudson's testimony at trial had he been of a mind to do so. This assignment of error is without merit.\n\nWe reverse the conviction of defendant on the charge of kidnapping in the first degree. Because armed robbery, not kidnapping, constituted the predicate felony for the verdicts of defendant's guilt of murder in the first degree based on felony murder, defendant's convictions for felony murder remain undisturbed. We find no error in defendant's other convictions.\n\nDefendant brings forth several assignments of error as preservation issues. His first argument -- that the constitution prohibits the death qualification of prospective jurors -- has been firmly decided adversely to defendant. Lockhart v. McCree, 476 U.S. 162, 90 L. Ed. 2d 137 (1986); State v. Jackson, 317 N.C. 1, 343 S.E.2d 814. See also State v. Avery, 299 N.C. 126, 261 S.E.2d 803 (1980). This assignment of error is overruled.\n\nNext defendant argues that the trial court erred in denying defendant's motion to quash the bills of indictment because of\n\nsystematic exclusion of nonwhites from the jury pool from which the grand jury was drawn and also that the trial court erred in denying defendant's motion to quash the petit jury venire and master jury list because the pool from which it was selected is unconstitutionally unrepresentative. In so doing, defendant requests that we reexamine our decision in State v. Avery, 315 N.C. 1, 337 S.E.2d 786 (1985). Defendant acknowledges that both he and Avery are black and were indicted and convicted in Durham County and that the issues in the two cases are identical. Defendant has presented us with no persuasive reasons as to why we should reconsider Avery, and we decline to do so. Defendant's assignment of error is therefore overruled.\n\nDefendant asserts that the North Carolina death penalty statute, N.C.G.S. § 15A-2000, is imposed in a discriminatory manner, is vague and overbroad, and involves subjective discretion, and thus violates the eighth and fourteenth amendments to the United States Constitution and article I, sections 19 and 27 of the Constitution of North Carolina. We have repeatedly upheld the constitutionality of the statute, e.g., State v. Gladden, 315 N.C. 398, 340 S.E.2d 673, cert. denied, U.S. , 93 L. Ed. 2d 166 (1986); State v. Boyd, 311 N.C. 408, 319 S.E.2d 189 (1984), cert. denied, 471 U.S. 1030, 85 L. Ed. 2d 324 (1985), and do so again here. See McCleskey v. Kemp, 481 U.S. , 95 L. Ed. 2d 262 (1987). We overrule this assignment of error.\n\nDefendant next contends that the trial court erred in instructing the jury that it would be the jury's duty to recommend a sentence of death if the jury found that the mitigating circumstances were insufficient to outweigh the aggravating circumstances and that the aggravating circumstances were sufficiently substantial to call for the imposition of the death penalty. Defendant concedes that the instructions in the present case were in substantial conformity with those upheld in State v. McDougall, 308 N.C. 1, 301 S.E.2d 308, and State v. Pinch, 306 N.C. 1, 292 S.E.2d 203, cert. denied, 459 U.S. 1056, 74 L. Ed. 2d 622 (1982), reh'g denied, 459 U.S. 1189, 74 L. Ed. 2d 1031 (1983). This Court has consistently rejected this argument and here does so once more. This assignment of error is overruled.\n\nLast, defendant charges that the trial court erred in failing to instruct the jury that the state had the burden of proving the\n\nnonexistence of each mitigating circumstance beyond a reasonable doubt and in placing the burden on the defendant to prove each mitigating circumstance by a preponderance of the evidence. Defendant has presented us with no compelling reasons as to why we should overrule our prior holdings on this issue, e.g., State v. Gladden, 315 N.C. 398, 340 S.E.2d 673; State v. Barfield, 298 N.C. 306, 259 S.E.2d 510 (1979), cert. denied, 448 U.S. 907, 65 L. Ed. 2d 1136, reh'g denied, 448 U.S. 918, 65 L. Ed. 2d 1181 (1980), and we decline to reexamine them. Defendant's assignment of error is therefore overruled.\n\nII. Sentencing Phase\n\nThe following aggravating circumstance was submitted to the jury during the sentencing phase of the trial: \"Was the murder of Darrel [sic] Wade Williams committed while Phillip Thomas Robbins, Jr. was engaged in the commission of robbery with a firearm of Darrel Wade Williams, or first degree kidnapping of Darrel Wade Williams?\" The jury answered the issue, \"yes,\" and indicated that its finding was on the basis of \"[b]oth robbery with a dangerous weapon and first degree kidnapping.\" In this opinion we have reversed the conviction of defendant on the charge of kidnapping in the first degree because of the insufficiency of the evidence to support that charge. Therefore, the submission of kidnapping as one of the bases supporting the above aggravating circumstance was error. We must next determine whether the error was prejudicial. The test to be applied was first announced by this Court in State v. Goodman, 298 N.C. 1, 257 S.E.2d 569 (1979), as being whether there is a reasonable possibility that the error complained of might have contributed to the ultimate decision of the jury to recommend the death penalty. N.C.G.S. § 15A-1443(a) (1983).\n\nIn this case the evidence of defendant's guilt was strong, although there were no eyewitnesses to the killing. The evidence as to punishment was hotly contested. An indication of the difficulty the jurors had in arriving at a recommendation of punishment was their inquiry of the judge whether they could return a recommendation of life imprisonment without parole, later discussed in this opinion.\n\nThrough several witnesses defendant developed evidence about his prior life and how he had undergone drastic behavioral\n\nchanges in the six months before he was arrested. Three mitigating circumstances were submitted to the jury: (1) Defendant was under the influence of mental or emotional disturbance at the time of the murder; (2) his ability to appreciate the criminality of his conduct or conform his conduct to the requirements of the law was impaired; (3) other mitigating circumstances. The jury responded that it found one or more of these circumstances to exist, without specification. For this discussion, we assume that the jury found all three.\n\nOf course, we have no way of knowing if submission of the erroneous kidnapping basis for the aggravating circumstance tipped the scales in favor of the jury recommending the death penalty for the murder of Williams. The jury also recommended the death sentence for the murder of Anna Quick, where kidnapping was not submitted as a basis for the same aggravating circumstance. However, we can only speculate as to what weight or consideration the jury gave to the kidnapping as an additional basis for the aggravating circumstance. Surely it would seem reasonable that a jury might treat a defendant more harshly where the aggravating circumstance was supported by armed robbery and kidnapping than where only armed robbery formed the basis for the aggravating circumstance. There is a reasonable possibility that the consideration by the jury of the kidnapping charge might have contributed to the recommendation of the death penalty. We so hold, and vacate the death sentence of defendant for the murder of Darryl Williams. The case will be remanded to the Superior Court of Durham County for a new sentencing hearing on defendant's conviction of murder in the first degree of Darryl Williams. See State v. Cherry, 298 N.C. 86, 257 S.E.2d 551 (1979), cert. denied, 446 U.S. 941, 64 L. Ed. 2d 796 (1980).\n\nBy his next several assignments of error, defendant argues that North Carolina's death penalty statute, N.C.G.S. § 15A-2000 (1983), is unconstitutional as construed by this Court and as applied in this case because it prohibits the jury from considering a defendant's eligibility for parole. Specifically, defendant contends that the jury should have been instructed concerning defendant's eligibility for parole and should not have been prohibited from considering parole on the question of its sentencing recommendation on the grounds that it \"is relevant to a mitigating circumstance at sentencing -- the defendant's non-dangerousness -- and\n\nbecause it does not sufficiently dispel the jury's arbitrary and capricious misconceptions about parole.\" For the trial court's failure to so instruct, defendant contends that his rights were violated under the eighth and fourteenth amendments and he is thus entitled to a new sentencing hearing.\n\nInitially, defendant points out that in the course of its deliberations during the sentencing phase, the jury returned to the courtroom with two written questions:\n\nDoes the Court grant the jury the right to recommend a life sentence without possibility of parole? And, if so, whether that stipulation is binding on the Court.\n\nTo the jury's inquiry, Judge Hobgood responded in the language of the North Carolina pattern jury instruction which evolved from our decision in State v. Conner, 241 N.C. 468, 85 S.E.2d 584 (1955):\n\nIn answer to the question, my answer is as follows: The question of eligibility for parole is not a proper matter for you to consider in recommending punishment, and it should be eliminated entirely from your consideration and dismissed from your minds.\n\nIn considering whether to recommend death or life imprisonment, you should determine the question as though life imprisonment means exactly what the statute says, imprisonment in the State's prison for life. You should decide the question of punishment according to the issues submitted to you by the Court, wholly uninfluenced by consideration of what another arm of the government might or might not do in the future. That is the ques- -- that is the Court's answer to the question.\n\nN.C.P.I. -- Crim. 150.10 n.2. Defendant correctly observes that this Court has consistently held that a criminal defendant's status under the parole laws is irrelevant to a sentencing determination and, as such, cannot be considered by the jury during sentencing, whether in a capital sentencing procedure under N.C.G.S. § 15A-2000 or in an ordinary case. State v. Brown, 306 N.C. 151, 293 S.E.2d 569, cert. denied, 459 U.S. 1080, 74 L. Ed. 2d 642 (1982); State v. Jones, 296 N.C. 495, 251 S.E.2d 425 (1979). Consequently, we have also held that the trial judge has a duty upon inquiry by the jury\n\nto admonish the jurors to disregard the possibility of parole and to dismiss it from their minds. The trial judge is also forbidden from informing them of the laws and practices governing parole. Brown, 306 N.C. 151, 293 S.E.2d 569; Conner, 241 N.C. 468, 85 S.E.2d 584. Accord, e.g., Brannon v. State, 188 Ga. 15, 2 S.E.2d 654 (1939); Gaines v. Commonwealth, 242 Ky. 237, 46 S.W. 2d 75 (1932); Commonwealth v. Carey, 368 Pa. 157, 82 A. 2d 240 (1951); Jones v. Commonwealth, 194 Va. 273, 72 S.E.2d 693 (1952). See generally Note, Munroe v. State: Jury Discussions of Parole Law in Texas, 20 Hous. L. Rev. 1491 (1983); Comment, Criminal Law -- Improper Court Response to Spontaneous Jury Inquiry as to Pardon and Parole Possibilities, 33 N.C.L. Rev. 665 (1955). Here, defendant did not object to the trial court's instruction pursuant to Conner nor did he ask the judge to inform the jury about North Carolina's parole laws. Generally, a defendant's failure to enter an appropriate and timely motion or objection results in a waiver of his right to assert the alleged error on appeal. State v. McDougall, 308 N.C. 1, 301 S.E.2d 308. Even assuming arguendo that defendant had properly preserved this issue for appeal, we would not overrule our prior holdings on this issue for the reasons which follow.\n\nDefendant's contentions on this point are twofold. His principal argument is based on California v. Ramos, 463 U.S. 992, 77 L. Ed. 2d 1171 (1983), in which the United States Supreme Court acknowledged that the existence of a convict's future dangerousness is a relevant concern to the jury. Extending this holding to the situation at hand, defendant argues that his future nondangerousness was also a relevant concern to the jury in his case and that this nondangerousness may be a mitigating circumstance which the jury was entitled to consider during sentencing. In Ramos, the Supreme Court found no constitutional defect in a California state law requiring the trial judge to inform a capital sentencing jury that the governor possesses the power to commute a sentence of life imprisonment without possibility of parole (the \"Briggs Instruction\"). It is important to note, however, that while the instruction upheld in Ramos was held not to be prohibited by the Federal Constitution, it was not held, conversely, to be constitutionally required. Id. at 1014, 77 L. Ed. 2d at 1189. Additionally, in Ramos, the Supreme Court rejected the contention of the defendant that the Briggs Instruction was unconstitutional\n\nbecause it does not inform jurors that the governor also is empowered to commute a death sentence, on the grounds that \"an instruction disclosing the Governor's power to commute a death sentence may operate to the defendant's distinct disadvantage.\" Id. at 1011, 77 L. Ed. 2d at 1187. In arriving at its determination, the Court, by Justice O'Connor, wrote: \"Our conclusion is not intended to override the contrary judgment of state legislatures that capital sentencing juries in their States should not be permitted to consider the Governor's power to commute a sentence,\" id. at 1013, 77 L. Ed. 2d at 1188, and also remarked that \"[m]any state courts have held it improper for the jury to consider or to be informed -- through argument or instruction -- of the possibility of commutation, pardon or parole.\" Id. at 1013 n.30, 77 L. Ed. 2d at 1188 n.30 (citing State v. Jones, 296 N.C. 495, 502-03, 251 S.E.2d 425, 429). The opinions of several federal circuit courts are in accord with our holding. Turner v. Bass, 753 F.2d 342 (4th Cir. 1985), rev'd and death sentence vacated on other grounds sub nom. Turner v. Murray, 476 U.S. , 90 L. Ed. 2d 27 (1986); O'Bryan v. Estelle, 714 F.2d 365 (5th Cir. 1983), cert. denied, 465 U.S. 1013, 79 L. Ed. 2d 245 (1984). We do not find in Ramos any support for defendant's contentions.\n\nDefendant's second argument on this issue is that the Constitution requires that the trial court inform the jury of facts about parole in order to dispel the alleged prejudicial misconceptions about parole which he contends most jurors harbor. Defendant contends that such alleged misconceptions raise the possibility of the jury acting in an arbitrary and capricious manner when sentencing without the benefit of accurate information concerning parole. In support of this argument, defendant refers us to the cases of Godfrey v. Georgia, 446 U.S. 420, 64 L. Ed. 2d 398 (1980); Green v. Georgia, 442 U.S. 95, 60 L. Ed. 2d 738 (1979); and Gardner v. Florida, 430 U.S. 349, 51 L. Ed. 2d 393 (1977), and concludes that the use of the Conner rule in his trial was unconstitutional because it failed to sufficiently minimize the risk that jurors' misconceptions about parole will affect the sentencing hearing.\n\nWe are unconvinced that due process requires an instruction on parole procedures out of concern that a jury may have misconceptions about parole eligibility. Defendant's contention that most lay jurors harbor prejudicial misconceptions about parole can be\n\nbased only on sheer speculation; there is no evidence in the record of any such prejudicial misconceptions harbored by jurors in the present case. Though the jurors did inquire whether they had the option of recommending a life sentence without the possibility of parole, there is absolutely no evidence that the jurors sentenced the defendant while under the mistaken impression that if they recommended life imprisonment, defendant would be released on parole. Moreover, providing the jury with information on parole eligibility is a double-edged sword. We are convinced that our present law under Conner and the assumption that jurors obey their oaths and instructions provide the best protection for criminal defendants. The recent United States Supreme Court case of California v. Brown, 479 U.S. , 93 L. Ed. 2d 934 (1987), further bolsters our position. In that case, an instruction cautioning the jury that it \"must not be swayed by mere sentiment, conjecture, sympathy, passion, prejudice, public opinion, or public feeling,\" in the penalty phase of a capital murder trial was held not violative of the eighth and fourteen amendments. The Court held that the instruction merely served to admonish the jury \"to ignore emotional responses that are not rooted in the aggravating and mitigating evidence introduced during the penalty phase.\" Id. at , 93 L. Ed. 2d at 940. Justice Rehnquist, writing for the majority, explained:\n\nAn instruction prohibiting juries from basing their sentencing decisions on factors not presented at the trial, and irrelevant to the issues at the trial, does not violate the United States Constitution. It serves the useful purpose of confining the jury's imposition of the death sentence by cautioning it against reliance on extraneous emotional factors which, we think, would be far more likely to turn the jury against a capital defendant than for him.\n\nId. at , 93 L. Ed. 2d at 941.\n\nSimilarly, the matter of parole is a factor not presented at trial and is completely irrelevant to the issues at trial. The Supreme Court's rationale, then, would seem to encompass the subject of parole eligibility, and thus our Conner instruction, which reflects our holding that the possibility of future interference with the sentence imposed on the defendant by parole is not a proper matter for the consideration of a jury charged\n\neither with a determination of guilt or a recommendation as to punishment. We detect no constitutional defect in the Conner instruction and therefore stand by our prior holdings on this issue. Accordingly, we overrule defendant's assignments of error.\n\nIn a related argument, defendant contends that even assuming that this Court adheres to its precedent on this issue, where a sentencing jury indicates that parole eligibility has become a factor in its deliberations, a mere instruction to disregard parole as a factor -- without also instructing the jury so as to correct alleged prejudicial misconceptions about parole -- is not adequate to dispel an arbitrary and capricious factor in the sentencing decision. He urges us to modify the Conner instruction and to adopt the minority view, see Annotation, Procedure to be followed where jury requests information as to possibility of pardon or parole from sentence imposed, 35 A.L.R. 2d 769 (1954); see, e.g., State v. White, 27 N.J. 158, 142 A. 2d 65 (1958), which would require the trial court, in addition to admonishing the jury under Conner to disregard parole in its deliberations as to punishment, to \"instruct the jury about the truth concerning parole.\" Defendant reasons that \"[b]y both admonishing and educating the jury, there is greater assurance that the prejudicially erroneous notions held by jurors will be dispelled . . . [and that a] defendant for whom life would be an appropriate punishment would not be sentenced to death upon a mistaken understanding.\" Again we note that defendant did not object to the Conner instruction at trial and has thereby waived his right to appellate review of this issue. N.C.G.S. § 15A-1446(b) (1983). Even were we to consider defendant's contentions in this regard, for the reasons set forth in our discussion above we decline to depart from our longstanding rule that a defendant's eligibility for parole is not under any circumstances a proper matter for consideration by a jury. Conner; Brown, 306 N.C. 151, 293 S.E.2d 569.\n\nBy way of summary, we note our concurrence with Justice Marshall who, in his dissenting opinion in Ramos, wrote that the \"possibility [of eventual release through commutation and parole] bears no relation to the defendant's character or the nature of the crime, . . . .\" 463 U.S. at 1021, 77 L. Ed. 2d at 1194. Accord Lockett v. Ohio, 438 U.S. 586, 604 n.12, 57 L. Ed. 2d 973, 990 n.12 (1978). Any instruction relating to parole eligibility is not constitutionally required, and our law on the matter is not constitutionally\n\ninfirm. We adhere to our mandate first espoused in Conner. The trial judge did not err in refusing to instruct the jury as defendant requested.\n\nDefendant next challenges certain remarks made by the prosecutor in his closing argument, alleging that the argument \"was replete with improprieties that rendered the sentencing process unreliable\" and entitles defendant to a new trial.\n\nDefendant first accuses the prosecutor of asking the jury \"to decide something from the heart and not the head . . . a stirring of the emotions from you, this segment of the community.\" Defendant has lifted this phrase out of its proper context. A reading of the transcript reveals that this comment came in the midst of some speculation on the part of the district attorney that defense counsel would likely accuse him of playing on the jurors' emotions and of asking them \"to decide something from the heart and not from the head, something that [they] may regret at a later time.\" The prosecutor then went on to tell the jurors merely that it was natural and normal to feel \"genuine emotion, empathy, during the course of [the] trial.\" We disagree with defendant's characterization of this remark as an improper attempt to influence the jury to decide defendant's sentence based solely on their emotions, and thus find no gross impropriety in these remarks. State v. Oliver, 309 N.C. 326, 307 S.E.2d 304 (1983). Defendant also urges us to find gross impropriety in the district attorney's remarks asking the jury to consider the case \"in the light of what you determine the law to be in this state.\" Though we find the remark to have been legally inaccurate and thus improper, we reject defendant's contention that the prosecutor was urging the jurors to \"set aside the law and give free play to a 'stirring of emotions.'\" The trial judge instructed the jury to apply only the law which he gave to them. We do not find that this statement amounted to prejudicial error. Id.\n\nThe district attorney observed that people are exposed to \"things\" via the mass media and asked, \"and don't you catch yourselves a lot of times saying, my goodness, how terrible that is, how atrocious that is, they ought to do something about that.\" Defendant contends that these remarks improperly invited the jurors to ignore the evidence and make a sentencing determination based on public sentiment instead of on a rational consideration of\n\nthe factors permissible under N.C.G.S. § 15A-2000. State v. Scott, 314 N.C. 309, 333 S.E.2d 296 (1985). These remarks are distinguishable from those held improper in Scott (in which the prosecutor appealed to the jury to convict the defendant because impaired drivers had caused other accidents) in that in the case sub judice, the district attorney did not argue outside the record that other murderers had killed other victims, nor did he encourage the jury to disregard the evidence and to base its determination on public sentiment. See State v. Forney, 310 N.C. 126, 310 S.E.2d 20 (1984). Defendant did not object at trial to these remarks, and we do not find such gross impropriety as to have required corrective action by the trial judge. State v. Oliver, 309 N.C. 326, 307 S.E.2d 304; State v. Craig, 308 N.C. 446, 302 S.E.2d 740, cert. denied, 464 U.S. 908, 78 L. Ed. 2d 247 (1983).\n\nNext, defendant complains about the prosecutor's references to the defendant's having had \"his day in court\" and to the rights of crime victims, saying that this was an \"invitation to a vigilante brand of justice in capital sentencing.\" On numerous occasions we have stated that emphasis is on the circumstances of the crime and the character of the criminal during sentencing, and therefore arguments regarding victims' rights are relevant. See, e.g., State v. Moose, 310 N.C. 482, 313 S.E.2d 507 (1984); State v. Oliver, 309 N.C. at 360, 307 S.E.2d at 326. We find no gross impropriety in these closing remarks by the prosecutor.\n\nDefendant next contends the district attorney in his closing remarks said that the death penalty should be imposed on this defendant as a deterrent, in violation of our holding in State v. Kirkley, 308 N.C. 196, 302 S.E.2d 144 (1983). In truth, the district attorney generically argued that there were four reasons for the sentencing process and deterrence was among the reasons enumerated. These remarks by the prosecutor were not improper.\n\nDefendant also challenges comments by the prosecutor that Darryl Williams \"must have been in great fear\" for his life and that both Williams and Anna Quick knew that they were going to die, which defendant alleges consisted of unreasonable and unsupported inferences and which invited the jury to \"speculate wildly.\" Defendant argues that there was no evidence that either or both victims knew that death was imminent, that they feared for their lives, or that they begged for their lives. Defendant additionally\n\nalleges that by this argument the prosecutor interjected the additional aggravating circumstance that the murders were especially heinous, atrocious and cruel. We feel that the evidence gives rise to reasonable inferences that both victims feared for their lives. The fact that both bodies were found in isolated areas of north Durham County and that no trails of blood led to the bodies nor was any blood found in either automobile gives rise to a reasonable interpretation of the evidence, which the prosecutor argued, that the victims were forced at gunpoint out of their cars and were shot as they walked away. We do not find any gross improprieties in the prosecutor's argument which would have required the trial court to intervene ex mero motu. These assignments of error are overruled.\n\nDefendant contends it was error for the trial court to have submitted the aggravating circumstances to the jury that the murders of Anna Quick and Darryl Williams were committed while the defendant was engaged in the commission of robberies with a firearm of both victims, N.C.G.S. § 15A-2000(e)(5), and he is thus entitled to a new sentencing hearing. For the reasons discussed in the guilt-innocence phase of this opinion, we have found no error in either of the armed robbery convictions; therefore, the armed robbery offenses could properly be submitted to the jury as aggravating circumstances. State v. Fields, 315 N.C. 191, 337 S.E.2d 518. This assignment of error is without merit.\n\nDefendant also assigns as error the trial court's failure to find a circumstance in mitigation for his sentences for armed robbery and kidnapping which he contends was established by the evidence, namely, that prior to arrest or at an early stage of the criminal process he voluntarily acknowledged wrongdoing in connection with the offenses to law enforcement officials. N.C.G.S. § 15A-1340.4(a)(2)(l) (1983). Because we have vacated defendant's conviction for kidnapping, we need not address this issue as it relates to that offense. Regarding the armed robbery conviction, defendant has waived appellate review of this issue by failing to make a timely motion requesting this mitigating circumstance and failing to object to the trial court's failure to find it after having been given ample opportunity by the trial judge to do so, N.C.G.S. § 15A-1446(a). Moreover, defendant was not entitled to a finding of this mitigating circumstance. Although defendant did acknowledge the murder of Anna Quick on the night he was taken into\n\ncustody and although he did voluntarily take officers to the site of Darryl Williams' body, he at no time acknowledged the robbery of Quick or of Williams. Defendant later equivocated and gave investigating officers conflicting and contradictory accounts of the murders. Furthermore, defendant made a motion to suppress these statements. This Court has held that if a defendant repudiates his incriminatory statement, he is not entitled to a finding of this mitigating circumstance. State v. Hayes, 314 N.C. 460, 334 S.E.2d 741 (1985). This assignment of error is meritless.\n\nIII. Proportionality\n\nWe have concluded that defendant is entitled to a new sentencing hearing with respect to his conviction for the murder of Darryl Williams. Therefore, this Court's proportionality review is only addressed to defendant's conviction for the murder of Anna Quick.\n\nAs a final matter in every capital case, we are directed by N.C.G.S. § 15A-2000(d)(2) to review the record and determine (1) whether the record supports the jury's findings of any aggravating circumstance or circumstances upon which the sentencing court based its sentence of death; (2) whether the sentence was imposed under the influence of passion, prejudice, or any other arbitrary factor; and (3) whether the sentence of death is excessive or disproportionate to the penalty imposed in similar cases, considering both the crime and the defendant. After an exhaustive review of the transcript, record on appeal, briefs, and oral arguments, we find that the evidence supports the two aggravating circumstances found by the jury. The aggravating circumstances were: (1) the defendant had been previously convicted of a felony involving the use or threat of violence to a person, N.C.G.S. § 15A-2000(e)(3), and (2) the capital felony was committed while the defendant was engaged in the commission of robbery with a firearm of Anna Quick, N.C.G.S. § 15A-2000(e)(5).\n\nWe also conclude that there is nothing in the record which suggests that the sentence of death was influenced by passion, prejudice, or any other arbitrary factor. We thus turn to our final statutory duty of proportionality review.\n\nIn determining whether the death sentence in this case is disproportionate to the penalty imposed in similar cases, we first\n\nrefer to the now familiar \"pool\" of cases established in State v. Williams, 308 N.C. 47, 301 S.E.2d 335.\n\nIn comparing \"similar cases\" for purposes of proportionality review, we use as a pool for comparison purposes all cases arising since the effective date of our capital punishment statute, 1 June 1977, which have been tried as capital cases and reviewed on direct appeal by this Court and in which the jury recommended death or life imprisonment or in which the trial court imposed life imprisonment after the jury's failure to agree upon a sentencing recommendation within a reasonable period of time.\n\nId. at 79, 301 S.E.2d at 355. The pool includes only cases which have been affirmed as to both phases of the trial. State v. Jackson, 309 N.C. 26, 45, 305 S.E.2d 703, 717.\n\nWe have held that our task on proportionality review is to compare the case \"with other cases in the pool which are roughly similar with regard to the crime and the defendant . . . .\" State v. Lawson, 310 N.C. 632, 648, 314 S.E.2d 493, 503 (1984), cert. denied, 471 U.S. 1120, 86 L. Ed. 2d 267 (1985).\n\nIf, after making such comparison, we find that juries have consistently been returning death sentences in the similar cases, then we will have a strong basis for concluding that a death sentence in the case under review is not excessive or disproportionate. On the other hand if we find that juries have consistently been returning life sentences in the similar cases, we will have a strong basis for concluding that a death sentence in the case under review is excessive or disproportionate.\n\nId. at 648, 314 S.E.2d at 503.\n\nWe note that defendant was convicted of the murder of Anna Quick on the theories of premeditated and deliberate murder and felony murder. With the magnitude and seriousness of our task in mind, we have reviewed the facts and circumstances of this case and compared them to all cases in the proportionality pool. Our careful comparison of the cases has led us to conclude that we cannot hold as a matter of law that the death sentence of defendant for the murder of Anna Quick was disproportionate.\n\nThe evidence in summary showed that on successive nights in June 1982 the defendant took Anna Quick, aged fifty-three, and Darryl Williams, aged eighteen, to isolated areas of Durham County where he shot them multiple times in the head, back, face, and chest. According to Dr. Hudson, the medical examiner, not all the wounds were lethal, raising a reasonable inference that the victims could have consciously suffered before dying. The bodies of the victims were hidden in ditches. Shortly after defendant left the apartment with Williams, he returned and acknowledged that he had just fired the pistol, which was still warm. The evidence showed that this pistol was used to kill Anna and Darryl. Defendant stole the automobiles of Anna and Darryl, as well as other personal property. Two motives for these deliberate killings are supported by the evidence: (1) to allow defendant to steal the property of the victims; (2) to eliminate all witnesses to the robberies.\n\nIn carrying out our duties under proportionality review, we have carefully considered the record, briefs, arguments and transcript. We must consider the circumstances of the offense and the character and propensities of the defendant. N.C.G.S. § 15A-2000(d)(2) (1983). With respect to the crimes committed by defendant, all the circumstances point to two brutal, senseless killings. With respect to the defendant, the circumstances disclose him to be a cold-blooded killer who within a span of four days murdered three human beings: Anna, Darryl, and Annie Carroway. This Court has determined the guilt of defendant as to all three murders to be without prejudicial error. Although the Carroway murder was not used as an aggravating circumstance in the present case, there is no doubt that the three murders were all part of a continuing course of conduct by defendant. Particularly, the two murders in the present case were on successive days, involved the same modus operandi, and were motivated by the same reasons. Of all the cases in which this Court has performed proportionality review, this defendant stands alone with Hutchins, 303 N.C. 321, 279 S.E.2d 788 (1981), as the only defendants convicted of three murders.\n\nAs defendant here was convicted on the basis of both premeditated and deliberate murder and felony murder, perhaps the most similar case is State v. Brown, 315 N.C. 40, 337 S.E.2d 808. Brown sought out and robbed a convenience store during the early\n\nmorning hours when the female clerk was alone. He then forced her into his car and took her to an isolated area where he killed her by shooting her six times. The principal cause of death was a gunshot wound to her back. The facts in the present case are remarkably similar. Both cases raise the inference of killing to eliminate a witness; in addition Robbins killed for the purpose of robbing his victims. A heavy factor against Robbins is that he is a multiple killer. Although the jury found that defendant was under the influence of a mental or emotional disturbance at the time of the murders and that the capacity of defendant to appreciate the criminality of his acts was impaired, it is clear from his convictions of premeditated and deliberate murder that human life meant little to Robbins.\n\nOur reference to the Brown decision does not suggest that we have overlooked other cases in the pool, such as State v. Young, 312 N.C. 669, 325 S.E.2d 181 (1985). Suffice it to say that we find the present case much more similar to Brown than to Young. We do not find it necessary to extrapolate or analyze in our opinions all, or any particular number, of the cases in our proportionality pool. State v. Williams, 308 N.C. 47, 301 S.E.2d 335. Upon our review of the entire proceedings in this case, together with our consideration and comparison of it with the cases in the proportionality pool, we cannot hold the death sentence for the murder of Anna Quick to be disproportionate. In so doing, we are mindful that almost any desired result can be supported by the selective use of discrete circumstances and statistics. Such methods, however, are foreign to our duties under the statute.\n\nWe hold as a matter of law that the death sentence imposed in this case for the murder of Anna Quick is not disproportionate within the meaning of N.C.G.S. § 15A-2000(d)(2). Upon this holding, the death sentence is affirmed. This Court has no discretion in determining whether a death sentence should be vacated. State v. Jackson, 309 N.C. 26, 305 S.E.2d 703; see Lockett v. Ohio, 438 U.S. 586, 57 L. Ed. 2d 973.\n\nConclusion\n\nThe conviction on the charge of kidnapping Darryl Williams is reversed. We find no error in the charge of armed robbery of Williams. On the charge of murder of Darryl Williams, we find no error in the guilt phase of the trial, but this charge is remanded\n\nto the Superior Court, Durham County, for a new sentencing hearing.\n\nWe find no error in the charge of armed robbery of Anna Quick. We hold the murder charge of Anna Quick to be without error and the death sentence on this charge is affirmed.\n\nNo. 83CRS10237 -- kidnapping -- reversed.\n\nNo. 83CRS10238 -- armed robbery -- no error.\n\nNo. 82CRS13882 -- murder of Williams -- no error in guilt phase; remanded for new sentencing hearing.\n\nNo. 83CRS12055 -- armed robbery -- no error.\n\nNo. 82CRS13883 -- murder of Quick -- no error.\n\nDisposition\n\nNo. 83CRS10237 -- kidnapping -- reversed. No. 83CRS10238 -- armed robbery -- no error. No. 82CRS13882 -- murder of Williams -- no error in guilt phase; remanded for new sentencing hearing. No. 83CRS12055 -- armed robbery -- no error. No. 82CRS13883 -- murder of Quick -- no error.\n\nJustice Meyer concurring in part and dissenting in part.\n\nI concur in the majority opinion except as to that part entitled \"II. Sentencing Phase,\" which holds that defendant is entitled to a new sentencing hearing because the kidnapping judgment has been arrested. I believe that portion of the majority opinion to be in error, and I would vote to affirm the judgment of the trial court.\n\nThe defendant was convicted of the first-degree murder of Darryl Williams on both the theories of premeditation and deliberation and of the felony murder rule. The underlying felony submitted was armed robbery. The kidnapping was not submitted as an underlying felony in the guilt phase. In such cases, this Court has held that the underlying felonies may also be considered as an aggravating circumstance at sentencing. State v. Rook, 304 N.C. 201, 230-31, 283 S.E.2d 732, 750 (1981), cert. denied, 455 U.S. 1038, 72 L. Ed. 2d 155 (1982). During the sentencing phase of the trial, Judge Hobgood submitted to the jury as one of the aggravating circumstances, pursuant to N.C.G.S. § 15A-2000(e)(5), that the murder of Darryl Williams was committed while the defendant was engaged in the commission of the armed robbery, or the kidnapping of Williams, or both. Judge Hobgood also instructed the jury that, on the issues and recommendation form, it should answer whether its finding of this aggravating circumstance\n\nwas \"on the basis of the defendant's commission of robbery with a dangerous weapon of Darrel [sic] Wade Williams, or first-degree kidnapping of Darrel Wade Williams, or both.\" Judge Hobgood gave the jury three choices:\n\nYour answer will be one of the following choices: one, robbery with a firearm; or, two, first-degree kidnapping; or three, both robbery with a firearm and first-degree kidnapping.\n\nWhen the jury returned its verdicts as to the first-degree murder of Darryl Wade Williams, the jury answered that it had found two aggravating circumstances: (1) that the defendant previously had been convicted of a felony involving the use or threat of violence to the person, N.C.G.S. § 15A-2000(e)(3); and (2) that the murder of Darryl Wade Williams was committed while the defendant was engaged in the commission of robbery with a firearm of Darryl Wade Williams or first-degree kidnapping of Darryl Wade Williams, N.C.G.S. § 15A-2000(e)(5). The jury also answered that its finding of the second aggravating circumstance was based on the defendant's commission of \"[b]oth robbery with a dangerous weapon and first degree kidnapping.\"\n\nThe majority holds that since the evidence was insufficient to support the first-degree kidnapping conviction, the trial court erred in submitting the kidnapping offense as an alternative theory for the aggravating circumstance under N.C.G.S. § 15A-2000(e)(5). I agree.\n\nIt should be noted that the defendant made no objection, when given the opportunity, to the State's request for an instruction on kidnapping as an aggravating circumstance. The defendant also made no objection to Judge Hobgood's framing of the issue as to whether the jury found the aggravating circumstance of N.C.G.S. § 15A-2000(e)(5) on the basis of the armed robbery or kidnapping or both. Here, under N.C.G.S. § 15A-2000(e)(5), there were alternative theories in a single enumerated aggravating factor:\n\n(5) The capital felony was committed while the defendant was engaged, or was an aider or abettor, in the commission of, or an attempt to commit, or flight after committing or attempting to commit, any homicide, robbery, rape\n\nor a sex offense, arson, burglary, kidnapping, or aircraft piracy or the unlawful throwing, placing, or discharging of a destructive device or bomb.\n\nN.C.G.S. § 15A-2000(e)(5) (1983) (emphasis added). The majority has correctly held that though the kidnapping as an alternative theory for the aggravating circumstance was erroneously submitted, the aggravating factor survived because it was also based on the armed robbery.\n\nThe majority distinguishes between the \"strong\" evidence of defendant's guilt and the \"hotly contested\" evidence as to punishment. I must say that the significance of that distinction escapes me. In every death case, the evidence as to punishment is \"hotly contested\" -- and even if it is not as a matter of fact, we treat it as such -- because a life hangs in the balance. Without question, when a juror weighs a recommendation of punishment in a capital case, the strength of the evidence of guilt is still in his or her mind and is of significant importance. Here, the evidence of defendant's guilt was overwhelming, and the manner of the killing was brutal.\n\nThe majority says \"we can only speculate as to what weight or consideration the jury gave the kidnapping.\" Is that not true in every case in which an aggravating factor has erroneously been submitted? That is precisely why this Court is compelled to make the harmless error analysis. By making the analysis, we direct and focus our attention on the precise question of whether we are able to say that, absent the offending circumstance, there is a reasonable possibility that the jury would have reached a different result.\n\n\"In capital sentencing procedures, erroneous submission of an aggravating circumstance . . . is not reversible per se ; [such] error [is] subject to a harmless error analysis.\" State v. Daniel, 319 N.C. 308, 315 n.2, 354 S.E.2d 216, 220 n.2 (1987). Where the evidence against a defendant is overwhelming, as here, the Court has not hesitated to say that:\n\n[W] are here convinced that the error was harmless beyond a reasonable doubt and that the result of the weighing process used by the jury would not have been different had the impermissible aggravating circumstance not been present. Our review of the voluminous evidence offered by the State\n\nconvinces us that submission of the aggravating circumstance that the murder was committed while committing the robbery was not prejudicial error.\n\nIn addition to considering the evidence supporting the proffered aggravating circumstances, the jury was of course aware of the evidence offered at the guilt/innocence phase of the trial. Thus, even though the submission of the underlying felony was error, overwhelming evidence supporting other statutory aggravating factors convinces us that the weighing process has not been compromised.\n\nState v. Taylor, 304 N.C. 249, 286, 288, 283 S.E.2d 761, 784, 785, cert. denied, 463 U.S. 1213, 77 L. Ed. 2d 1398, reh'g denied, 463 U.S. 1249, 77 L. Ed. 2d 1456 (1983).\n\nThe jury specifically found that it based its finding of the aggravating circumstance of N.C.G.S. § 15A-2000(e)(5) on the alternative ground that the defendant committed the murder of Darryl Williams during the commission of the armed robbery of Williams. Therefore, even though the jury could not properly find that the murder of Williams was committed during the kidnapping, there still remains the unchallenged finding that the murder was committed during the armed robbery of Williams. Here, the aggravating circumstance survives even though there was error in submitting the kidnapping offense as an alternative basis for the aggravating circumstance. Therefore, a determination that it was error to submit the kidnapping as an alternative theory for the aggravating circumstances does not invalidate the jury's finding of the aggravating circumstance under N.C.G.S. § 15A-2000(e)(5).\n\nIt is completely inconsistent for this Court to let a death sentence stand where an entire aggravating factor is erroneous (as in Taylor) and grant a new sentencing hearing when the aggravating factor survives but contains one erroneous theory.\n\nEven the majority characterizes the evidence of defendant's guilt as \"strong.\" The majority also concedes that the jury returned a recommendation of death for the murder of Anna Quick, where kidnapping was not submitted as a possible basis for an aggravating factor. The evidence of defendant's guilt of two brutal\n\nmurders is overwhelming. We also know the defendant killed a third person in the same manner as a part of the same course of conduct. See State v. Robbins, 309 N.C. 771, 309 S.E.2d 188 (1983). The wounds in each killing were similar; all three murders were execution-style killings with, in each case, shots behind the ear and in the back.\n\nI am convinced that the error in the submission of the kidnapping offense as a theory of the aggravating circumstance to the first-degree murder of Darryl Williams was harmless and does not entitle the defendant to a new sentencing hearing.\n\n\u003cspan class=\"fn\"\u003e1. We emphasize here that we are not articulating the applicable rule in a case where the defendant has objected on the grounds of alleged Batson violations at trial during the selection of the jury and prior to its being empanelled, nor are we commenting on the procedures to be followed by the trial court when such an objection is raised; the United States Supreme Court in Batson expressed no view on such procedures and expressly declined to formulate any such procedures. 476 U.S. at n.24, 90 L. Ed. 2d at 90 n.24.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. As the state notes in its brief to this Court, \"it was District Attorney Orlando Hudson, himself a black, who exercised two of the State's peremptory challenges to excuse two black jurors during the selection of the alternate jurors. It cannot in good faith be argued by the Defendant that Assistant District Attorney Hudson is 'of a mind to discriminate' against members of his own race.\"\u003c/span\u003e\n\n",
    "body_length": 148451,
    "citedas": [
      "319 N.C. 465",
      "356 S.E.2d 279"
    ],
    "attorneys": "Lacy H. Thornburg, Attorney General, by Barry S. McNeill, Assistant Attorney General, for the state. Malcolm Ray Hunter, Jr., Appellate Defender, and Louis D. Bilionis, Assistant Appellate Defender, for defendant.",
    "category": [],
    "judges": "Martin, Justice. Justice Meyer concurring in part and dissenting in part.",
    "citation_count": 83
  }
}
