{
  "id": "KaFeR2YBTlTomsSBZ_7U",
  "document": {
    "title": "People v. Fauber",
    "full_title": "THE PEOPLE AND v. CURTIS LYNN FAUBER AND .",
    "jurisdiction": "California Supreme Court",
    "date": "1992-06-18T00:00:00.000Z",
    "docket": "No. S005868",
    "body": "A jury convicted Curtis Lynn Fauber of robbery (Pen. Code, § 211),\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e burglary (§ 459, 460, 462, subd. (a), 667) and first degree murder (§ 187), finding true the special allegations that he intentionally committed the murder while engaged in the commission of the robbery and burglary (§ 190.2, subd. (a)(17)) and that he personally used a deadly weapon (an ax) in committing the offenses (§ 12022, subd. (b)). Following a penalty trial, the jury returned a verdict of death. This appeal is automatic. (§ 1239, subd. (b).)\n\nThe judgment is affirmed.\n\nI. GUILT PHASE FACTS\n\nA. Prosecution Case\n\nEarly in the summer of 1986, defendant travelled from New Mexico, where he had grown up, to Ventura to visit Brian Buckley, whom he had befriended in 1985 while both were serving in the Army. Buckley was living in his mother's apartment on Crimea Street. Defendant stayed either in the apartment or in a trailer, which Buckley's mother kept in the lot near the apartment.\n\nWhile Buckley's mother was away on a trip to Illinois, defendant and Buckley socialized with Buckley's neighbors, Jan Jarvis and Mel Rowan. (Rowan, who had been convicted of delivery of a controlled substance and burglary of a habitation in Texas, and had violated his parole, was using the name \"Tim Johnson\" to escape detection by law enforcement authorities.) Jarvis, Rowan, Buckley, and defendant used drugs together.\n\nIn June or July 1986, defendant and Buckley visited Rowan's apartment, bringing a shotgun and a gram scale. Defendant borrowed a hacksaw and began to saw off the barrel of the shotgun. In the course of conversation, Jarvis mentioned she had a former boyfriend, named Tom Urell, who sold cocaine. Defendant or Buckley asked where he lived. She drew a map showing the location and layout of Urell's house and said he had a lot of cocaine in a safe. Buckley, Rowan, and defendant discussed burglarizing the house.\n\nA week later, Rowan and Jarvis drove by Urell's beachfront house in Oxnard with defendant and Buckley, on a motorcycle, following. Rowan or\n\nJarvis pointed out the house. Rowan told defendant to \"rip off\" Urell \"now,\" but defendant said they wanted to check it out some more. They saw a Chevrolet El Camino pickup truck parked in Urell's driveway. At defendant's suggestion, he and Buckley twice returned to \"scope out\" the house.\n\nDefendant did not testify at trial, and the only account of the murder was provided by the testimony of Brian Buckley. Between four days and one week after the initial drive-by, defendant and Buckley went on defendant's motorcycle to Urell's house. It was about midnight. Defendant parked the motorcycle about half a block from the house. Defendant brought a backpack or bag containing a bandanna, gloves, a hat, and the shotgun he had been sawing at Rowan's apartment. Buckley brought a bag containing a .22-caliber pistol, a bandanna, gloves, and a knit stocking hat. One of them had a roll of duct tape. They walked down to the beach, donned hats, gloves and bandannas, and loaded their weapons. It was defendant's idea to bring the weapons and to wear the bandannas so that they would not be identified. Defendant told Buckley he might have to kill Urell to prevent him from being a witness.\n\nThey entered the house and defendant led the way to the bedroom. Urell, who was asleep in bed, woke when they approached. Using a false Mexican accent, defendant told Urell not to move. Urell told them to take anything they wanted and not to hurt him. Defendant directed Urell to lie on his stomach. While Buckley held the shotgun, defendant taped Urell's wrists behind his back. Defendant and Buckley searched the drawers in the room, and defendant asked Urell for the combination to the safe. Urell said he did not know the combination and the safe contained nothing valuable. Buckley found cocaine paraphernalia, rolls of quarters, and a few silver dollars in Urell's bedroom. He put these items in his bag. Defendant took a baggie of cocaine and a calculator.\n\nDefendant found an ax under the bed and asked Urell what he was doing with it. Then he raised the ax, turned it in his hands, and hit Urell in the back of the neck. Buckley, who was holding the shotgun, heard the thud of the blow and a hissing sound coming from Urell as if he were having a hard time breathing. Buckley left the bedroom and went into the kitchen. Defendant hit Urell again and the hissing noise became quieter or stopped. Only a second or two elapsed between the first and second blows. Defendant may have hit Urell a third time while Buckley was in the kitchen. Defendant emerged from the bedroom. He and Buckley discussed putting the safe into Urell's pickup truck. Buckley asked defendant if Urell were dead. Defendant responded that he did not know. Defendant returned to the bedroom, and Buckley heard two more hits.\n\nThey loaded the safe onto the truck. Defendant drove back to Buckley's apartment, while Buckley drove defendant's motorcycle. Defendant knocked on Rowan's door about 1 a.m., asking for the key to the storeroom underneath the apartment. Rowan gave it to him, got dressed, and went downstairs. He helped defendant unload the safe from the El Camino.\n\nDefendant told Rowan that Urell had not been at home. Rowan returned to his apartment to talk to Jarvis. Later, Rowan went back downstairs and noticed the outer door of the safe was open. Defendant told him he had found the combination in a jewelry box. Buckley went to the trailer and was joined by defendant and Rowan. Buckley was putting a .22-caliber pistol and shotgun in the trailer and opening a briefcase that had been in the El Camino. Rowan asked if they had got any cocaine; defendant said they had not. Rowan again returned to his apartment.\n\nDefendant and Buckley took everything into the trailer. Defendant then drove away in the El Camino, while Buckley left on defendant's motorcycle. Defendant disposed of the El Camino over a cliff in an area called \"The Cross\" and returned to the apartment on the motorcycle with Buckley.\n\nDefendant began to try to open the inner door of the safe, but presently stopped due to the noise he was making. He and Buckley injected the cocaine they had found at Urell's house.\n\nRowan appeared and again asked if anyone had been at Urell's house. Eventually defendant admitted that Urell had been at home and that he thought he had killed him. He said he had hit Urell because Urell had seen his face, telling Rowan he was not ready to leave Ventura yet. Rowan advised defendant and Buckley to throw away everything except the cash.\n\nThe next day, defendant succeeded in opening the inner door of the safe. Inside were jewelry, old silver dollars, gold nuggets, and coin books. Rowan tore up the coin books and threw them away. Jarvis took the jewelry and gold and was directed to throw them away. Defendant and Buckley took the safe to Ojai and dumped it near Lake Matilija.\n\nUrell's body was discovered by his friend, Ronald Siebold. Siebold found Urell lying on his bed, apparently dead, with his hands taped behind his back and a pillow on his head. Siebold yelled Urell's name, pulled the pillow off, and dialed 911.\n\nThe police arrived 10 minutes later. Urell's room appeared to have been ransacked. Leaning against the foot of the bed was a wooden-handled ax. A subsequent search of the house yielded narcotics paraphernalia.\n\nDr. Frederick Warren Lovell, the Chief Medical Examiner for Ventura County, examined the body at the scene at 7:54 p.m. on July 16, 1986. He estimated that death had occurred some 14 to 22 hours earlier. A subsequent autopsy showed that the neck bore a series of four overlapping premortem blows from a rectangular object consistent with the blunt side of an ax. The blows broke the victim's neck and caused paralysis that inhibited or possibly cut off his breathing. Dr. Lovell determined the cause of death to be asphyxia, caused in one of the following ways: (1) someone held a pillow over the victim's face for two to five minutes; (2) after the blows to the head, the victim was unable to move his head while lying face down and died of suffocation over the course of two to four minutes; or (3) the blows destroyed the nerve system that causes breathing.\n\nOn July 16, 1986, Buckley sold the silver dollars taken from Urell's house to a coin shop in Ventura, sharing the proceeds with defendant. Barbara Adams, employed by the shop, testified that she bought the silver dollars from Buckley, who showed military identification.\n\nUrell was a construction supervisor employed by Bianco Corporation, located in Camarillo, and had been assigned an El Camino as a company car. He also had been assigned company credit cards, including a telephone card.\n\nOnly July 19, 1986, police searched the trailer belonging to Buckley's mother and found a book of maps stamped with Bianco Corporation's name and address.\n\nOn July 20, 1986, Paul Wolny found Urell's El Camino and reported his discovery to the police. The El Camino was impounded and found to be registered to Bianco Corporation.\n\nDefendant gave a friend, Hal Simmon, the telephone calling card he had taken from Urell's briefcase. Simmon used the card 20 to 25 times. Simmon knew the card was stolen because he discovered the number was registered to a business. When police found Simmon in Tampa, Florida, in September or October 1986, they seized his address book, in which he had written the calling card number.\n\nIn September 1986, Buckley was arrested for a traffic violation and gave statements about the Urell killing with the understanding that they would not be used against him. In November 1987, Buckley was arrested for Urell's murder. The following month, the district attorney's office agreed to move the court to declare the murder to be of the second degree if Buckley testified truthfully against defendant in the Urell case and against Christopher Caldwell in another case. On December 21, 1987, Buckley talked with\n\na deputy district attorney and representatives of the sheriff's department regarding the case; a portion of the conversation was tape-recorded. On January 4, 1988, Buckley entered his plea of guilty of Urell's murder.\n\nIn September 1986, Rowan was arrested on a parole violation and talked to the police about the Urell case. Rowan was returned to the Texas Department of Corrections. Rowan testified against defendant under a grant of immunity.\n\nAlso in September 1986, defendant was arrested in Espanola, New Mexico, on a warrant issued out of Ventura County. At that time, police seized defendant's wallet, which contained, among other things, a piece cut from Urell's telephone calling card. Defendant waived his Miranda rights (Miranda v. Arizona (1966) 384 U.S. 436 [16 L.Ed 2d 694, 86 S.Ct. 1602, 10 A.L.R.3d 974]) and was interviewed by Sergeant Larry Robertson. Defendant said he remembered Jarvis had told him about someone in Oxnard who had a lot of drugs; she drew a diagram of the man's house. Defendant said he and Buckley, on a motorcycle, followed her and Rowan as they drove past the house. According to defendant, Jarvis pointed it out and wanted him and Buckley to rip it off.\n\nSergeant Robertson and Detective Velasquez went to Buckley's mother's apartment in October 1986. She turned over to police a .22-caliber gun.\n\nB. Defense Case\n\nAttacking Buckley's credibility, the defense presented the testimony of John Frisilone, an inmate at the Ventura County jail, who testified that he was housed in a cell next to Buckley and talked to him through the cell vents. Frisilone testified that Buckley told him two handguns and a shotgun were involved, but that Buckley did not tell the prosecutor about the two handguns because he did not want his testimony doubted. Buckley also said he had placed the pillow over the victim's head because of the noises he was making. Frisilone also testified Buckley believed if he did not testify, the prosecutor had enough evidence to charge him with first degree murder and possibly seek the death penalty.\n\nFrisilone had been convicted of four felonies, including forgery and grand theft. Frisilone testified he read newspapers in jail and had read about the Urell case. He had previously offered the district attorney's office information about other inmates in return for a more lenient sentence.\n\nC. Prosecution's Rebuttal\n\nBuckley denied telling Frisilone that he had placed a pillow on the victim's head. He testified Frisilone was known as a \"rat\" who would\n\nexchange information for a deal with the district attorney. An investigator and a deputy in the district attorney's office each testified about instances in which Frisilone had sought favorable treatment in return for information; after interviewing Frisilone, they did not use his information.\n\nII. JURY AND VENUE ISSUES\n\nA. Exclusion of Hearing-impaired Juror\n\nDefendant contends he was denied his right to trial by a jury chosen from a representative cross-section of the community in that hearing- impaired individuals were systematically excluded from the jury panel because courtroom facilities made it impossible for such persons to serve as jurors. Defendant has failed to establish he is entitled to relief.\n\nAlthough five prospective jurors who identified themselves as hearing- impaired were questioned and not excused due to the impairment, defendant claims systematic exclusion of hearing-impaired jurors due to the excusal of one prospective juror, who was unable to hear out of his left ear and suffered from Meniere's disease and vertigo, for which he took medication. After testing the prospective juror's ability to hear while seated in the jury box, the trial court declined to accept his hearing-impairment hardship excuse. However, defense counsel questioned whether it was practicable for the prospective juror to serve, and the trial court excused him.\n\nA criminal defendant is entitled to trial by an impartial jury drawn from a representative cross-section of the community. (People v. Harris (1984) 36 Cal. 3d 36, 48 [201 Cal. Rptr. 782, 679 P.2d 433]; U.S. Const., Amends. VI, XIV; Cal. Const., art. I, § 16.) To establish a prima facie violation of the fair cross- section requirement, a defendant must show that: (1) the group allegedly excluded is a \"distinctive\" group in the community; (2) the group's representation in jury venires is not fair and reasonable in relation to the number of such persons in the community; and (3) the under-representation is due to the systematic exclusion of such persons in the jury selection process. (Duren v. Missouri (1979) 439 U.S. 357, 364 [58 L.Ed.2d 579, 586-587, 99 S.Ct. 664].) Defendant did not object to the panel or move to quash the venire on the basis that he had been denied his right to a jury drawn from a representative cross-section of the community; accordingly, the point is waived. (People v. Howard (1992) 1 Cal. 4th 1132, 1159 [5 Cal. Rptr. 2d 268, 824 P.2d 1315]; Code Civ. Proc., § 225, subd. (a)(1); see former § 1060, repealed by Stats. 1988, ch. 1245, § 21, p. 4155.) Even if he had made a timely objection, however, he would not be entitled to relief because he has failed to meet his burden of establishing any of the elements of the Duren test.\n\nFirst, he does not demonstrate that hearing-impaired persons constitute a \"distinctive\" group within the community. Although he notes the Legislature has recognized that persons with hearing loss are competent to serve as jurors (Code Civ. Proc., § 203, subd. (a)(6)), he does not persuasively link that characteristic with the purposes of the fair cross- section requirement. (Lockhart v. McCree (1986) 476 U.S. 162, 174-175 [90 L.Ed.2d 137, 148-149, 106 S.Ct. 1758].) Second, he fails to demonstrate that the representation of hearing-impaired persons in the venire was unreasonably small in proportion to the number of such persons in the community. Finally, he falls short of establishing that the lack of hearing-impaired persons on the jury resulted from systematic exclusion. He fails to address the five prospective jurors with hearing impairments who were not challenged on the basis of their impairments. Indeed, it was defense counsel who asked that the only identified hearing-impaired prospective juror to be seated in the jury box be excused. Defendant's claim that he was denied his right to a jury chosen from a representative cross- section of the community must fail.\n\nB. Denial of Motion for Change of Venue\n\nDefendant contends that the trial court erred in denying his motion for a change of venue based on pretrial publicity. The error, he contends, deprived him of his rights to due process, to a fair trial by an impartial jury, and to a penalty determination that is not arbitrary or unreliable, as guaranteed him by the Fifth, Sixth, Eighth, and Fourteenth Amendments of the federal Constitution.\n\nChange of venue is warranted when it appears there is a reasonable likelihood that a fair and impartial trial cannot be held in the county. (§ 1033, subd. (a).) The determination requires consideration of such factors as the nature and gravity of the offense, the size of the community, the status of the defendant, the popularity and prominence of the victim, and the nature and extent of the publicity. \"On appeal after a judgment following the denial of a change of venue, the defendant must show both that the court erred in denying the change of venue motion, i.e., that at the time of the motion it was reasonably likely that a fair trial could not be had, and that the error was prejudicial, i.e., that it was reasonably likely that a fair trial was not in fact had. The trial court's essentially factual determinations as to these factors will be sustained if supported by substantial evidence. We independently review the trial court's ultimate determination of the reasonable likelihood of an unfair trial. [Citations.]\" (People v. Edwards (1991) 54 Cal. 3d 787, 807 [1 Cal. Rptr. 2d 696, 819 P.2d 436].)\n\nConsideration of the gravity and nature of the offense does not compel the Conclusion that venue should have been changed. Although\n\ndefendant was charged with capital murder, the most serious of offenses, this case lacked \"the sensational overtones of other killings that have been held to require a change of venue, such as an ongoing crime spree, multiple victims often related or acquainted, or sexual motivation.\" (People v. Green (1980) 27 Cal. 3d 1, 46 [164 Cal. Rptr. 1, 609 P.2d 468].) We have often upheld denial of venue change in capital cases. (See, e.g., People v. Edwards, supra, 54 Cal. 3d at pp. 806-809.)\n\nThe size and nature of the community do not support a venue change. The population of Ventura County in 1987 was 619,300, making it the 13th largest county in the state. (Cal. Statistical Abstract (27th ed. 1987) Dept. of Finance, sec. B, p. 20.) Venue changes are seldom granted from counties of such a large size; the larger the local population, the less likely it is that preconceptions about the case have become embedded in the public mind. (People v. Balderas (1985) 41 Cal. 3d 144, 178 [222 Cal. Rptr. 184, 711 P.2d 480] [motion to change venue from Kern County, 14th largest in state, properly denied].) Defendant argues for a different Conclusion because death penalty trials are not very common in Ventura County, and because Ventura is less urban in character than, for example, Los Angeles. We reject defendant's argument. (See Odle v. Superior Court (1982) 32 Cal. 3d 932, 938 [187 Cal. Rptr. 455, 654 P.2d 225] [upholding denial of venue change from Contra Costa County, \"as much suburban as rural\"].) Although we have observed that \"the 'adversities of publicity are considerably offset if trial is conducted in a populous metropolitan area' \" (People v. Harris (1981) 28 Cal. 3d 935, 949 [171 Cal. Rptr. 679, 623 P.2d 240], quoting People v. Manson (1976) 61 Cal. App. 3d 102, 189 [132 Cal. Rptr. 265]), defendant fails to support his implicit contention that capital trials should be held exclusively in major metropolitan centers experienced in such cases.\n\nThe third and fourth factors, the community status of the defendant and the victim, do not suggest a change of venue should have been granted. Defendant makes much of the fact that he is, and was reported in local media as, a new Mexico resident. However, he fails to show that he was associated with any organization or group that aroused community hostility. (People v. Adcox (1988) 47 Cal. 3d 207, 233 [253 Cal. Rptr. 55, 763 P.2d 906].) The victim, although a longtime resident of Oxnard, was not prominent, and his death did not engender unusual emotion in the community. (People v. Balderas, supra, 41 Cal. 3d at p. 179.) One juror \"knew of\" Urell, but his \"hazy\" recollections of Urell dated back some 10 to 15 years. The juror stated that his knowledge of Urell would not affect his decision in the case. (See People v. Ainsworth (1988) 45 Cal. 3d 984, 1002 [248 Cal. Rptr. 568, 755 P.2d 1017].) As defendant left that juror as an alternate on the jury, defendant apparently agreed. We are unable to conclude that the juror's\n\nvague knowledge of Urell made it unlikely that defendant would receive a fair trial in Ventura County.\n\nThe most significant factor in the venue determination, for purposes of this case, is the nature and extent of news coverage. In support of his venue change motion, trial counsel submitted seven newspaper articles and several transcripts of media news broadcasts covering November 11-13, 1987.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The articles and broadcasts discussed the crime, defendant's confession and the district attorney's decision to pursue the death penalty despite its suppression, and the arrest of Brian Buckley. Media coverage continued during trial, with cameras from local television stations present during the arraignment, preliminary examination, and portions of the trial. Additionally, Oxnard and Ventura newspapers obtained permission to use still cameras in the courtroom.\n\nPosttrial review of the denial of a motion for change of venue is retrospective, taking into account prospective jurors' exposure to pretrial publicity as revealed in voir dire. (People v. Harris, supra, 28 Cal. 3d at p. 949.) Our examination of the record persuades us that pretrial publicity had no prejudicial effect. Few of the 186 prospective jurors had any recollection of the media coverage. Of those who reported hearing or seeing coverage of the case, most had read only a headline or part of an article. Only two prospective jurors had heard about defendant's confession in the media; they were excused.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Of the 12 jurors who decided this case, 9 had heard nothing in the media. The remaining three jurors reported minimal exposure to media coverage. One said she saw an article, but on seeing the name of the case, she avoided reading it. Another said he read a part of an article, but stopped when he realized it was about this case. The remaining juror said he had read something about another person being implicated, but was unsure whether it was about the same case. In summary, the jurors' exposure to pretrial publicity in this case was considerably less than that found in other cases in which we have held venue change to be unnecessary. (See People v. Howard, supra, 1 Cal. 4th at p. 1168.) It is not necessary that jurors be totally ignorant of the facts and issues involved in the case; it is sufficient if they can lay aside their impressions and opinions and render a verdict based on the evidence presented in court. (People v. Ainsworth, supra, 45 Cal. 3d at p. 1002.) Nothing in the record suggests the few jurors who had any exposure to pretrial publicity did not do so. Further, defendant used only 17 of his 26 available peremptory challenges to select the jury and expressed no\n\ndissatisfaction with the jury as selected. The failure to exhaust peremptories is a strong indication that \"the jurors were fair, and that the defense itself so concluded.\" (People v. Balderas, supra, 41 Cal. 3d at p. 180.)\n\nThe record thus shows that pretrial publicity did not deny defendant his right to a fair and impartial jury. (People v. Harris, supra, 28 Cal. 3d at p. 950.) Defendant's assertions of other constitutional error in the denial of his venue change motion must likewise fail.\n\nIII. CLAIMS OF ERROR AFFECTING GUILT PHASE\n\nA. Testimony of Buckley and Rowan\n\n1. Summary\n\nDefendant contends that the prosecutor and trial Judge improperly vouched for the credibility of witnesses Buckley and Rowan and misled the jury about the inducements they received for their testimony. Their actions, he claims, violated various rights guaranteed him by the Fifth, Sixth, Eighth, and Fourteenth Amendments.\n\n2. Admission of Buckley Plea Agreement\n\nAt the outset of Brian Buckley's testimony, and again in closing argument, the prosecutor read to the jury the text of Buckley's plea agreement. We reproduce it in the margin.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Defendant contends that the agreement told the jury that the prosecutor and the Judge were making all necessary\n\nfindings regarding Buckley's credibility. This, he argues, improperly vouched for Buckley's credibility.\n\nDefense counsel made no objection to the reading of the plea agreement. Accordingly, defendant may not complain about it on appeal. (Evid. Code, § 353.) Defendant suggests that for various reasons he should be relieved of the requirement of contemporaneous objection. He does not persuade us. Nonetheless, even if the claim were properly before us, we would find no reversible error.\n\nAs defendant acknowledges, the existence of a plea agreement is relevant impeachment evidence that must be disclosed to the defense because it bears on the witness's credibility. (Giglio v. United States (1972) 405 U.S. 150, 153-155 [31 L.Ed.2d 104, 108-109, 92 S.Ct. 763].) Indeed, we have held that \"when an accomplice testifies for the prosecution, full disclosure of any agreement affecting the witness is required to ensure that the jury has a complete picture of the factors affecting the witness's credibility.\" (People v. Phillips (1985) 41 Cal. 3d 29, 47 [222 Cal. Rptr. 127, 711 P.2d 423].)\n\nDefendant's objection is not to admission of the agreement per se, but to the failure to excise certain portions that he views as \"vouching\" for Buckley's credibility and as placing on the trial court rather than the jury the responsibility to determine whether Buckley was telling the truth.\n\nDefendant first argues that reference to the district attorney's preliminary determination of Buckley's credibility as a condition of the plea agreement was improper because it implied the existence of information, known to the prosecutor but undisclosed to the jury, that proved Buckley was telling the truth. (United States v. Roberts (9th Cir. 1980) 618 F.2d 530, 536.) Defendant correctly notes that a prosecutor may not express a personal opinion or belief in a witness's credibility when there is \" 'substantial danger that jurors will interpret this as being based on information at the prosecutor's command, other than evidence adduced at trial.' \" (People v. Adcox, supra, 47 Cal. 3d at p. 236 (quoting People v. Bain (1971) 5 Cal. 3d 839, 848 [97 Cal. Rptr. 684, 489 P.2d 564)].) We agree that the plea agreement's reference to the district attorney's preliminary determination of Buckley's credibility had little or no relevancy to Buckley's veracity at trial, other than to suggest that the prosecutor found him credible. Thus, the reference should have been excised on a timely objection on the ground of irrelevancy.\n\nWe conclude, however, that its presentation to the jury was harmless under these circumstances. (People v. Watson (1956) 46 Cal. 2d 818, 836 [299 P.2d 243].) The prosecutor argued for Buckley's credibility based on the evidence adduced at trial, not on the strength of extrajudicial information obliquely referred to in the plea agreement. Moreover, common sense suggests that the jury will usually assume--without being told--that the prosecutor has at some point interviewed the principal witness and found his testimony believable, else he would not be testifying. We note, too, that the requirement that Buckley preliminarily satisfy the prosecutor as to his credibility \"cuts both ways\": it suggests not only an incentive to tell the truth but also a motive to testify as the prosecutor wishes. (United States v. Henderson (4th Cir. 1983) 717 F.2d 135, 137.) Thus, even if defendant had preserved an objection to admission of the challenged portion of the Buckley plea agreement, we would decline to reverse his conviction.\n\nDefendant further argues that the plea agreement made the trial court a monitor of Buckley's truthfulness, and thereby placed its prestige behind Buckley's testimony, by providing that \"[i]n the event of a dispute, the truthfulness of Mr. Buckley's testimony will be determined by the trial Judges who preside over these hearings.\" He contends this provision caused the jury to feel a lesser responsibility to make an independent determination of Buckley's truthfulness.\n\nOur decision in People v. Phillips, supra, 41 Cal. 3d 29, requires full disclosure to the jury of any agreement bearing on the witness's credibility, including the consequences to the witness of failure to testify truthfully. Full disclosure is not necessarily synonymous with verbatim recitation, however. Portions of an agreement irrelevant to the credibility determination or potentially misleading to the jury should, on timely and specific request, be excluded. Here, it was crucial that the jury learn what would happen to Brian Buckley in the event he failed to testify truthfully in defendant's trial. But the precise mechanism whereby his truthfulness would be determined was not a matter for its concern. The provision detailing the Judge's determination of Buckley's credibility in the event of any dispute arguably carried some slight potential for jury confusion, in that it did not explicitly state what is implicit within it: that the need for such a determination would arise, if at all, in connection with Buckley's sentencing, not in the process of trying defendant's guilt or innocence. For these reasons, had defendant objected to its admission, the trial court would have acted correctly in excluding it on a relevancy objection.\n\nNonetheless, we see no possibility that defendant was prejudiced by its admission. The jury could not reasonably have understood Buckley's plea agreement to relieve it of the duty to decide, in the course of reaching its verdict, whether Buckley's testimony was truthful. Nor could the jury have been misled by prosecutorial argument. The prosecutor argued that Buckley had nothing to gain by lying because the trial court would make a determination of his credibility in the event of a dispute. The context of the remarks made it clear that determination would occur if the prosecutor sought to repudiate its agreement with Buckley after trial in defendant's case.\n\nOur Conclusion is reinforced by the fact that the trial court instructed the jury, before the start of the prosecution's case and after closing argument, that \"[e]very person who testifies under oath is a witness. You are the sole Judges of the believability of a witness and the weight to be given to his testimony ....\"\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e (CALJIC No. 2.20.) We presume, in the absence of any contrary indication in the record, that the jury understood and followed this instruction. (People v. Modesto (1963) 59 Cal. 2d 722, 755 [31 Cal. Rptr. 225, 382 P.2d 33].) The prosecutor, in his opening statement,\n\nlikewise emphasized the jurors' role as sole Judges of credibility. In sum, the reading of Buckley's plea agreement did not constitute reversible error.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\n3. Claim That Prosecutor Misrepresented Buckley's Immunity\n\nBuckley's credibility was the most significant issue in the guilt phase of defendant's trial. The prosecutor urged the jury to believe Buckley because, under the terms of his plea agreement, he had nothing to fear as long as he told the truth. Defendant contends that the prosecutor misled the jury as to Buckley's incentives to testify because the plea agreement said nothing about other crimes of which Buckley was suspected and failed to specify what, if any, arrangement Buckley had with the prosecutor regarding those crimes. This, defendant contends, denied him his rights to due process of law, to protection from cruel and unusual punishment, to freedom from arbitrary and unreliable imposition of the death penalty, and to trial by a fair and impartial jury.\n\nApart from the Urell matter, defendant contends, Buckley was subject to prosecution for his role in (1) a commercial burglary and theft of motorcycles, (2) an assault with a vehicle in a parking lot, and (3) the murder of David Church. If there was an agreement with the prosecutor regarding these episodes, defendant reasons, it was never disclosed to the jury; if there was no such agreement, the jury never learned that Buckley had other incentives to testify against defendant.\n\nThe flaw in defendant's argument is the absence of evidence that Buckley in fact feared prosecution for the other offenses. Nothing in the record indicates that Buckley was ever charged in connection with any of these crimes, and there is insufficient evidence before us to warrant the belief that prosecution was a reasonable probability.\n\nAs to the motorcycle theft incident, Buckley admitted on cross-examination in the penalty phase that in the summer of 1986 he and Christopher Caldwell stole two motorcycles and that Caldwell was convicted of the offense, but that he himself was not charged. Defendant suggests no reason why his counsel could not have argued, at either phase of trial, that Buckley remained vulnerable to charges arising out of this incident. In any event, the record contains insufficient evidence to enable us to conclude that he feared prosecution.\n\nAs to the parking lot incident, the record indicates that during the guilt phase of trial, defense counsel was aware that Buckley had been accused of trying to run down an individual in a parking lot, but that nothing had come of the incident. The trial court properly refused to allow counsel to use the evidence to impeach Buckley's testimony by showing that he had a violent character (Evid. Code, § 787), but permitted counsel to use it as impeachment in the event Buckley claimed to be a nonviolent person. Counsel did not bring up the subject by asking Buckley whether he hated violence or was sickened by seeing Urell beaten, so no evidence of the automobile assault came before the jury. As with the motorcycle incident, defense counsel was not precluded from attempting to present the evidence and arguing that Buckley was subject to prosecution, and the record lacks evidence from which we can confidently say Buckley could have been prosecuted.\n\nFinally, as to the murder of David Church, the evidence does not support the Conclusion that Buckley was subject to prosecution. Evidence at the penalty phase indicated that defendant and Caldwell removed Church from Buckley's apartment and killed him with an ax handle. Defendant cites drug use during Buckley's party and Buckley's desire to rid himself of an obnoxious gatecrasher as possible motives for murder. He also notes that the murder weapon belonged to Buckley. The inference is far from compelling, however, that Buckley had reason to fear prosecution for Church's killing.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Defense counsel could have questioned Buckley during the guilt phase about his involvement in the Church murder, but for obvious tactical reasons chose not to do so.\n\nThe lack of evidence that Buckley either feared prosecution for other crimes or had some undisclosed agreement regarding those offenses leads us to conclude that defendant has failed to prove that the prosecutor misled the jury. We also conclude--contrary to defendant's claim--that he was not denied due process, his rights of confrontation and cross-examination, his right to be protected against cruel and unusual punishment,\n\nhis right to a reliable penalty determination, or his right to trial by a fair and impartial jury in the presentation of Buckley's plea agreement to the jury.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\n4. Use of Rowan Preliminary Hearing Transcript as Visual Aid to Prosecutor's Opening Statement\n\nMel Rowan, testifying under a grant of immunity, provided significant corroborative evidence. While outlining Rowan's expected testimony during his opening statement, the prosecutor displayed a poster consisting of an enlarged page from the transcript of Rowan's preliminary hearing testimony containing incriminating statements defendant made to Rowan. The prosecutor read aloud the following portion of Rowan's preliminary hearing testimony:\n\n\"As the conversation took place, Mel Rowan asked Curtis Fauber, 'You didn't hurt him, did you?' And Curtis said, 'I think I killed him.' 'Are you sure? You got to be kidding.' 'Yeah, I'm pretty sure.' 'Are you positive he's dead? Just don't tell me he's dead.' And Fauber said, 'Well, when I left, he was having a hard time breathing.' 'And I said, \"Well, why did you do it?\" And he said, 'Well, he--he saw my face, and I'm not in any hurry to leave Ventura County.' \"\n\nDefense counsel objected to the form of the poster, specifically to highlighting of some portions. He contended it took parts of Rowan's preliminary hearing testimony out of context and was prejudicial to defendant. The trial court ruled that the poster could be used as an illustrative aid in the prosecutor's opening statement.\n\nDefendant contends the ruling constituted error because the poster \"preconditioned\" the jury to believe Rowan's testimony. He also now advances the new ground that the poster contained hearsay and was for that\n\nadditional reason improper. The error, he contends, violated his Fifth, Sixth, Eighth, and Fourteenth Amendment rights.\n\nWe find no error in the trial court's ruling, as use of the poster neither violated the rule against hearsay nor constituted any species of vouching. The purpose of the opening statement \" 'is to prepare the minds of the jury to follow the evidence and to more readily discern its materiality, force and effect' [citation]. ...\" (People v. Green (1956) 47 Cal. 2d 209, 215 [302 P.2d 307].) The use of photographs and tape recordings, intended later to be admitted in evidence, as visual or auditory aids is appropriate. (; People v. Kirk (1974) 43 Cal. App. 3d 921, 929 [117 Cal. Rptr. 345].) Similarly, the illustrative use of an enlarged page of transcript was not improper, as Rowan ultimately testified consistently with the transcript. It is axiomatic that nothing the prosecutor says in an opening statement is evidence. Had the prosecutor, instead of preparing a poster, simply recited Rowan's preliminary hearing testimony in his opening statement to the jury, defendant could not urge a hearsay objection. Additionally, we cannot agree with defendant that the mere appearance of the poster could have been so \"official\" that it caused the jury to preJudge Rowan's credibility.\n\n5. Claim That Prosecutor Misled Jury About Rowan's Credibility\n\nDefendant contends that the prosecutor improperly emphasized Rowan's immunity in his guilt phase argument. The prosecutor said, \"Mel Rowan received immunity in this case. Mr. Farley [defense counsel] has told us that he has every motive to lie to you, but the fact remains that once Mel Rowan received that immunity, he could come up here and testify as to what happened during the course of those crimes and go completely protected from any prosecution.\" Defendant contends this argument was misleading because Rowan was obliged to testify consistently with his preliminary hearing testimony or risk prosecution for perjury.\n\nFor the same reasons we rejected this argument as applied to Brian Buckley, we reject it as to Mel Rowan. (See, ante, at p. 826, fn. 8.) (People v. Allen, supra, 42 Cal. 3d at p. 1254.) Defendant relies on People v. Morris (1988) 46 Cal. 3d 1 [249 Cal. Rptr. 119, 756 P.2d 843] for a contrary result, but that case is inapposite. In Morris, the prosecutor argued that the witness had received no benefit from testifying, and that the jury would have heard about it had any evidence of such a benefit existed. In fact, however, the witness had benefited from his preliminary hearing testimony, in that a parole violation and other charges had been favorably disposed of a year before trial. ( at p. 33.) We noted that the nondisclosure rendered the prosecutor's argument misleading. We rejected the People's contention that\n\nthe argument was accurate because the witness had received a benefit not for his trial testimony but for his preliminary hearing testimony: the witness, we noted, reasonably could have believed he owed an ongoing debt to the prosecution in return for his freedom. Here, by contrast, the prosecutor fully disclosed the benefit Rowan received. In any event, defense counsel was free to point out the possibility that Rowan might have been subject to perjury charges if he testified inconsistently with his preliminary hearing testimony.\n\nB. Prosecutor's Failure to Tape-record Buckley Interview\n\nDefendant unsuccessfully moved to suppress Buckley's testimony at trial, contending that the prosecutor's failure to tape-record an entire interview he conducted with Buckley interfered with defendant's access to information to be used for impeachment and cross-examination.\n\nAfter Buckley entered into his plea agreement, Don Glynn, the prosecutor, conducted an interview with him. Present with Buckley and Glynn were Wiksell, Buckley's attorney; Jarosz, Buckley's investigator; district attorney investigator Troxel; Deputy Sheriff Rudd; and Ventura County Sheriff's Detective Odle. Fauber's defense counsel had previously requested that the interview be taped. Wiksell too wished to tape-record the entire interview. Glynn, however, wanted to leave unrecorded the first part of the interview and tape only a summary. In order to obtain a Disposition for his client, Wiksell did not object. Buckley's interview lasted two and one-half or three hours. One and one-half hours were taped, according to the trial Judge, who listened to the tape.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nRudd, Odle, Troxel, and Glynn took notes of the interview; Troxel prepared a written report and destroyed his notes.\n\nDuring the unrecorded part of the interview, Buckley was asked \"broad\" questions, which he answered in \"narrative\" form, according to Wiksell. On a number of occasions, Buckley was unable to remember clearly who made a statement, but after some conversation was able to attribute it to a particular person. At least one fact concerning Buckley's personal background was discussed during the initial part of the interview but omitted during the taped portion: Buckley said he obtained a discharge from the Army by falsely stating he was a homosexual, but this statement does not appear in the recording. The taped portion of the interview was concise, lacking some of the hesitations evident in the unrecorded portion.\n\nDefendant moved to suppress Buckley's testimony at trial, contending that the prosecutor's refusal to tape the entire interview interfered with his access\n\nto information to be used for impeachment and cross- examination. At the hearing on the motion, the trial court stated it had listened to the tape and read Troxel's summary and the notes taken by Odle and Rudd. Comparing the notes with the tape, the trial court concluded that the tape was not a \"sanitized\" version of the earlier portion of the interview; rather, it covered generally the same topics in the same chronological order. The trial court also found that, in not taping the initial portion of the interview, the prosecution had followed a reasonable investigation procedure. The court reasoned that since the prosecution has no duty to tape-record witness interviews, and the defense has no right to dictate the course of the prosecution's investigation, the prosecutor was not required to grant defense counsel's request to tape Buckley's entire interview.\n\nDefendant characterizes the prosecutor's refusal to allow recording of the entire interview as a denial of his Fourteenth Amendment right to disclosure of all exculpatory evidence and as suppression of favorable evidence within the prohibition of California v. Trombetta (1984) 467 U.S. 479 [81 L.Ed.2d 413, 104 S.Ct. 2528]. Defendant also contends the prosecution did not act in good faith. (Arizona v. Youngblood (1988) 488 U.S. 51 [102 L.Ed.2d 281, 109 S.Ct. 333].)\n\nHe first suggests that the prosecutor should have turned on the tape recorder, or permitted Buckley's counsel to do so, at the beginning of the interview simply because defense counsel's request was timely and not burdensome. He does not, and cannot, cite direct authority for that proposition.\n\nNext, defendant contends that the prosecutor's actions were tantamount to willful suppression of evidence he knew would be helpful to the defense, and thus violated the rule of United States v. Agurs (1976) 427 U.S. 97, 111-113 [49 L.Ed.2d 342, 354-355, 96 S.Ct. 2392].\n\nWe cannot agree with defendant that hesitations and difficulties of recollection in the unrecorded portion of the interview amount to material, substantial evidence, the loss of which deprived him of a fair trial. (People v. Ruthford (1975) 14 Cal. 3d 399, 409 [121 Cal. Rptr. 261, 534 P.2d 1341, A.L.R.4th 3132].) \"The mere possibility that an item of undisclosed information might have helped the defense, or might have affected the outcome of the trial, does not establish 'materiality' in the constitutional sense.\" (United States v. Agurs, supra, 427 U.S. at pp. 109-110 [49 L.Ed.2d at p. 353].) To meet this standard of constitutional materiality, evidence must \"both possess an exculpatory value that was apparent before the evidence was destroyed, and be of such a nature that the defendant would be unable\n\nto obtain comparable evidence by other reasonably available means.\" (California v. Trombetta, supra, 467 U.S. at p. 489 [81 L.Ed.2d at p. 422].) Assuming, without deciding, that Trombetta applies in the context of a failure to tape-record a portion of an interview of a prosecution witness, we find no deprivation of material evidence. The trial court's finding that the substance of the taped and untaped portions of Buckley's statement was similar leads us to infer that the untaped portion did not possess apparent, independent exculpatory value. Defendant has essentially demonstrated only that a record of Buckley's unrecorded remarks might have helped him attack Buckley's credibility; consequently, he falls short of establishing materiality under the constitutional standard.\n\nIn any event, defense counsel's cross-examination of Buckley elicited numerous instances of difficulty in recollection, a fact he pointed out in closing argument. Moreover, evidence of Buckley's hesitations was available through the testimony of persons present during the interview.\n\nWe are unpersuaded that the loss of Buckley's untaped remarks resulted in error.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nC. Restriction on Cross-examination of Buckley; Ineffective Assistance of Counsel\n\nDefendant argues that the trial court improperly restricted cross-examination of Brian Buckley concerning the latter's involvement in an assault with an automobile. Defense counsel argued that if Buckley were to testify that he had an aversion to violence, then counsel should be allowed to impeach him with evidence that he had once attempted to run down an individual in a parking lot. As noted above, the trial court properly ruled the assault inadmissible if offered merely to establish a character trait of violence and thereby to invite the inference that Buckley behaved violently on the occasion of the Urell killing. However, the court ruled that the assault could be used to impeach Buckley's credibility depending on the content of his testimony. Thus, defense counsel was free to elicit from Buckley testimony as to his nonviolent nature and then to introduce evidence of the assault as impeachment. He did not do so.\n\nDefendant now urges that the fact that Buckley had never been prosecuted for the assault showed the willingness of the police and prosecutor to\n\noverlook his wrongdoings, which in turn showed Buckley's bias and willingness to testify for the prosecutor in the Urell case. He did not raise this ground of admissibility--which we find highly speculative in light of the paucity of evidence concerning the incident--at trial, and cannot be heard to do so for the first time on appeal. (Lorenzana v. Superior Court (1973) 9 Cal. 3d 626, 640 [108 Cal. Rptr. 585, 511 P.2d 33]; People v. Frye (1985) 166 Cal. App. 3d 941, 950 [213 Cal. Rptr. 319].) In any event, since the jury was well aware of the terms under which Buckley was testifying, and in particular of the differential between the sentences for first and second degree murder, the jury was perforce aware of Buckley's bias and willingness to testify for the prosecution. We are unpersuaded that evidence of the parking lot incident would have had a significant impact on the jury's assessment of Buckley's credibility. (People v. Belmontes (1988) 45 Cal. 3d 744, 781 [248 Cal. Rptr. 126, 755 P.2d 310] [citing Delaware v. Van Arsdall (1986) 475 U.S. 673, 680 (89 L.Ed.2d 674, 680, 106 S.Ct. 1431)].) We cannot agree, therefore, with defendant's belated assertions that the trial court's ruling on the scope of Buckley's cross-examination deprived defendant of a trial by a fair and impartial jury, due process, or the right to confront witnesses, or that it subjected him to an arbitrarily or unreliably imposed sentence of death.\n\nDefendant contends counsel's failure to bring evidence of the assault before the jury constituted ineffective representation. A defendant claiming ineffective assistance of counsel has the burden of showing that counsel failed to act in a manner to be expected of a reasonably competent attorney acting as a diligent advocate. (People v. Pope (1979) 23 Cal. 3d 412, 425 [152 Cal. Rptr. 732, 590 P.2d 859, 2 A.L.R.4th 1].) The defendant must also show that it is reasonably probable a determination more favorable to the defendant would have resulted in the absence of counsel's failings. (People v. Ledesma (1987) 43 Cal. 3d 171, 217-218 [233 Cal. Rptr. 404, 729 P.2d 839].) Defendant's ineffective- assistance claim fails because it is not reasonably probable a determination more favorable to him would have resulted had counsel brought the parking lot incident to the jury's attention. The jury was already aware of the terms under which Buckley was testifying, he was subjected to extensive cross- examination, and the probative value of the evidence counsel possessed was limited. As counsel explained it, \"[Buckley] got angry at an individual down by Chuck E. Cheese and tried to run him down with a car and was a suspect in a hit and run. The guy was a transient so nothing ever came of it.\" Because the incident counsel related does not support an inference that Buckley feared prosecution, we are unpersuaded the jury would have formed a significantly different impression of Buckley's credibility had defense counsel used it to impeach him.\n\nD. Trial Court's Refusal to Admonish Jury Regarding Prosecutor's Guilt Phase Argument\n\nDefendant contends that the prosecutor engaged in misconduct during closing argument, and that the trial court's refusal to admonish the jury to disregard it was error. We conclude that the prosecutor's comments were not misconduct, and consequently that no admonition was needed.\n\nThe principal thrust of defense counsel's closing argument was, of course, that the jury should not credit the testimony of Buckley and Rowan. He argued that each was more deeply involved in the Urell killing than he was willing to admit. He contended each had a selective memory of the events in question, and cited other reasons to disbelieve their testimony. In rebuttal, the prosecutor argued that defense counsel had failed to address certain points the prosecutor had emphasized in urging the jury to believe Buckley and Rowan. Defense counsel objected, calling the prosecutor's comments a \"personal attack.\" The trial court determined the comments were merely a rehash of the prosecutor's opening argument, directed to what defense counsel did not say, rather than what he did say, and thus were not proper rebuttal. The prosecutor acceded to the trial court's ruling. Later, the court declined to admonish the jury, saying \"I attribute again no bad faith and I really don't feel that there was a whole lot of harm, if any ....\"\n\nWe find it clear that the prosecutor's repeated reference to defense counsel's failure to address various points in no way amounted to a personal attack on defense counsel, but was in the nature of a rhetorical device. The prosecutor did not accuse defense counsel of lying or misleading the jury; he merely pointed out omissions from the latter's argument. It hardly need be said that the prosecutor is entitled to comment on the content of defense counsel's argument. Since there was no prosecutorial misconduct, there was no basis for an admonition to the jury.\n\nDefendant also contends the trial court should have admonished the jury to disregard a statement the prosecutor made concerning defense witness Frisilone. It will be recalled that Frisilone met Buckley in jail while the former was waiting to be sent to prison for the latest of his four felony convictions. Frisilone testified that Buckley said he had placed a pillow over Urell's head after defendant hit him with the ax. At trial, Buckley denied doing so. Defense counsel argued that Frisilone should be believed because he must have learned that detail from Buckley. The record reflects that the prosecutor countered: \"He [defense counsel] asked us how do we know--or how did Frisilone know what happened in the courtroom? [P] Well, he told us that he read it in the newspapers.\" Defense counsel made a speaking\n\nobjection, arguing that although Frisilone testified he had access to newspapers in jail, he did not say he had read about what he testified to. The court stated that it shared defense counsel's recollection of the testimony, but that \"the final word will be with the reporter, if the jury feels it's necessary for that portion of Mr. Frisilone's testimony to be read back.\" The prosecutor responded, perhaps inaccurately, that he \"did not say that [Frisilone] read any particular item, but he had access to the newspapers as to this trial.\" Later, the court declined to admonish the jury, finding the prosecutor had not acted in bad faith and no harm had been done.\n\nWe cannot accept defendant's contention that the jury was left to suppose the prosecutor somehow knew, from extrajudicial evidence, that Frisilone had based his testimony on what he read in the newspaper. The exchange between court and counsel made it plain to the jury that the record of Frisilone's testimony would speak for itself. The prosecutor's implication that Frisilone had fabricated his testimony from items reported in the paper was, however, a fair inference from the evidence. The trial court's refusal to admonish the jury was not erroneous.\n\nE. Refusal to Instruct That Rowan Was an Accomplice as a Matter of Law\n\nThe trial court read a series of instructions on accomplice testimony, informing the jury that Brian Buckley was an accomplice as a matter of law and that his testimony required corroboration.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e (CALJIC Nos. 3.10, 3.11, 3.12, 3.13, 3.14, 3.16, 3.18.) Defense counsel requested that the jury be instructed Mel Rowan, too, was an accomplice as a matter of law. The trial court refused, instead instructing the jury to decide Rowan's status. This, defendant contends, was error.\n\nSection 1111 defines an accomplice as \"one who is liable to prosecution for the identical offense charged against the defendant on trial in the cause in which the testimony of the accomplice is given.\" (§ 1111.) In order to be chargeable with the identical offense, the witness must be considered a principal under section 31. (People v. Hoover (1974) 12 Cal. 3d 875, 879 [117 Cal. Rptr. 672, 528 P.2d 760].) That section defines principals to include \"[a]ll persons concerned in the commission of a crime ... whether they directly commit the act constituting the offense, or aid and abet in its commission, or, not being present, have advised and encouraged its commission ....\" (§ 31.) An accessory, however, is not liable to prosecution for\n\nthe identical offense, and so is not an accomplice. (People v. Hoover, supra, 12 Cal. 3d at p. 879; § 32.)\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nWhether a person is an accomplice is a question of fact for the jury unless there is no dispute as to either the facts or the inferences to be drawn therefrom. (People v. Tewksbury (1976) 15 Cal. 3d 953, 960 [127 Cal. Rptr. 135, 544 P.2d 1335].) The burden is on the defendant to prove by a preponderance of the evidence that a witness is an accomplice. ( at p. 963.)\n\nAlthough the testimony of both Rowan and Buckley indicated that Rowan participated in Discussions preceding the burglary, pointed out to defendant and Buckley the location of the Urell residence and urged them either to \"do it\" at that moment or \"blow it off,\" and helped dispose of the robbery proceeds, to say that the inferences from these facts are undisputed would be an overstatement. (People v. Tewksbury, supra, 15 Cal. 3d at p. 960.) The record certainly supports, but does not dictate, the Conclusion that Rowan acted with \" 'guilty knowledge and intent with regard to the commission of the crime,' \" as is required for accomplice liability. ( [quoting People v. Duncan (1960) 53 Cal. 2d 803, 816 (3 Cal. Rptr. 351, 350 P.2d 103)].) As to the murder, there is no suggestion that Rowan had any prior knowledge; he expressed surprise when told of the killing. Even as to the burglary and robbery, the record does not compel a finding that Rowan shared liability as an accomplice. After the initial drive past Urell's residence, when Rowan urged defendant to \"do it\" or \"blow it off,\" it is not clear that Rowan knew when, how, or even if a burglary would in fact take place. Thus, defendant failed to sustain his burden of establishing Rowan's liability as an accomplice as a matter of law, and the trial court properly instructed the jury to decide the question.\n\nIn any event, even if Rowan were an accomplice to the burglary and robbery, his testimony was adequately corroborated. Corroborative evidence must come in by means of the testimony of a nonaccomplice witness. (People v. Tewksbury, supra, 15 Cal. 3d at p. 958.) It need not corroborate every fact to which the accomplice testified or establish the corpus delicti, but is sufficient if it tends to connect the defendant with the crime in such a way as to satisfy the jury that the accomplice is telling the truth. (People v. Szeto (1981) 29 Cal. 3d 20, 27 [171 Cal. Rptr. 652, 623 P.2d\n\n213].) Corroborative evidence may be slight and entitled to little consideration when standing alone. (; People v. Wade (1959) 53 Cal. 2d 322, 329 [1 Cal. Rptr. 683, 348 P.2d 116].) Rowan's testimony was corroborated by (1) Hal Simmons's testimony that defendant gave him a telephone credit card number which was proved to have belonged to Urell and (2) Investigator Velasquez's testimony that a search of the camper, owned by Brian Buckley's mother and used by defendant, yielded a book of maps stamped with the name and address of Urell's employer.\n\nF. Special Circumstance Instruction on Intent to Kill\n\nDefendant complains that the jury was erroneously instructed on the requirement of intent to kill in connection with the robbery and burglary special circumstances. In People v. Anderson (1987) 43 Cal. 3d 1104, 1141-1147 [240 Cal. Rptr. 585, 742 P.2d 1306], we overruled our earlier decision in Carlos v. Superior Court (1983) 35 Cal. 3d 131 [197 Cal. Rptr. 79, 672 P.2d 862] and held that proof of intent to kill is not required under the provisions of section 190.2, subdivision (a)(17), when those provisions are read standing alone. When there is evidence from which the jury could find that defendant was an aider or abettor rather than the actual killer, however, the court must instruct the jury on intent to kill. (43 Cal. 3d at pp. 1147, 1149-1150; § 190.2, subd. (b).) The murder in this case was committed after our decision in Carlos but before that in Anderson ; consequently, the trial court had to instruct the jury that in order to find the special circumstance true it must find defendant intended to kill, whether it found he acted as a principal or as an aider or abettor. (People v. Duncan (1991) 53 Cal. 3d 955, 973, fn. 4 [281 Cal. Rptr. 273, 810 P.2d 131].)\n\nThe jury was instructed that \"To find the special circumstance referred to in these instructions as murder in the commission of robbery or burglary is true, it must be proved, one, that the murder was committed while the defendant was engaged in, was an accomplice or an aider and abettor in the commission of a robbery or burglary; two, that the defendant intended to kill a human being or intended to aid another in the killing of a human being; three, that the murder was committed in order to carry out or advance the commission of the crimes of burglary or robbery or to facilitate the escape therefrom or to avoid detection.\" (CALJIC No. 8.81.17.) Defendant contends this instruction allowed the jury to find the special circumstance allegations true without clearly determining whether defendant intended to kill, and was therefore deficient. He interprets the instruction to permit a true finding if the jury merely believed defendant intended to help Buckley, such as by letting him into Urell's house, or holding his gun while Buckley struck Urell with the ax.\n\nWe do not believe there is a reasonable likelihood that the jury would have understood the instruction as defendant interprets it. (Estelle v. McGuire (1991) 502 U.S. 62, 116 L.Ed.2d 385, 399, 112 S.Ct. 475. In order to find true the special circumstance allegations, the jury had to find \"that the defendant intended to kill a human being or intended to aid another in the killing of a human being.\" As defendant reads the instruction, the phrase \"in the killing of a human being\" is reduced to a parenthesis, or ignored. We have previously upheld a similar instruction in People v. Warren (1988) 45 Cal. 3d 471, 486-488 [247 Cal. Rptr. 172, 754 P.2d 218], and subsequent cases (see, e.g., People v. Pinholster (1992) 1 Cal. 4th 865, 954- 955 [4 Cal. Rptr. 2d 765, 824 P.2d 571]). In essence, defendant's argument is a disagreement with Warren. He presents us, however, with no convincing reason to depart from that decision.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nDefendant contends that the instructions on liability for aiding and abetting further diminished the possibility that the jurors would appreciate the intent requirement for the special circumstance allegation, and that certain portions of the prosecutor's argument made that improper outcome more probable. To the contrary, we do not believe it reasonably likely that either the instruction on aiding and abetting or the argument would have had such an effect. His claims of error in the giving of the intent-to-kill and aiding-and-abetting instructions must, therefore, be rejected.\n\nG. Defendant's Absence From Rereading of Testimony\n\nDuring its deliberations, the jury asked for a rereading of two pages of Mel Rowan's testimony. Defense counsel stipulated that the court reporter could enter the jury deliberation room with the transcript and read the two pages to the jury. The court reporter did so. Defendant was not present. He now contends this procedure deprived him of a complete record of the proceedings, in violation of section 190.9.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e He further argues that trial counsel's stipulation denied him his rights of confrontation and representation by competent counsel. In his reply brief, he adds that he thereby lost his rights to meaningful appellate review of his death sentence and to be free from a death sentence arbitrarily and unreliably imposed.\n\nHis contentions are without merit. Although the record contains no personal waiver of presence during the rereading, defendant has failed to show\n\nthat his absence in any way prejudiced him or resulted in the denial of a fair and impartial trial. Unless defendant makes such a showing, his absence from a rereading of testimony does not raise due process concerns. (People v. Ainsworth, supra, 45 Cal. 3d at p. 1021.) Finally, failing any prejudice, there can be neither a denial of effective representation nor impairment of Eighth Amendment rights. Defendant acknowledges these principles, but argues that he should be relieved of the burden of establishing prejudice. He articulates no persuasive reasons to reject our precedents.\n\nH. Alleged Juror Misconduct\n\nDefendant argues that jury misconduct occurring in both phases of the trial deprived him of due process, a fair trial by an impartial jury, a unanimous verdict, and protection against arbitrary and unreliable imposition of a death judgment. The trial court rejected defendant's claims of prejudicial misconduct in ruling on his motion for new trial. (§ 1181, subd. 3.) Our review of the record supports the trial court's determination.\n\nDefendant's first claim of misconduct centers on the fact that during both phases of the trial, a juror brought a cellular telephone into the deliberation room. Before doing so, the juror sought permission from the bailiff, who approved the request in order to accommodate the juror's need to contact his office periodically. The bailiff testified he asked the trial Judge before giving approval, although the Judge did not recall the request. The juror used the telephone during recesses and breaks, mainly to make business calls. Two other jurors used the telephone, one to check on her child and the other to cancel an appointment. There was no indication that the case or any subject relating to it was ever discussed on the telephone.\n\nAt the outset, we express in no uncertain terms our disapproval of the practice of allowing a cellular telephone into the jury deliberation room. Such a practice carries with it obvious potential for mischief, against which section 1128 seeks to guard.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThat said, however, we do not find misconduct on these facts. The juror brought the telephone into the deliberation room only after he believed he had permission to do so, and defendant offers no evidence to suggest either\n\nthat the telephone was ever used for an improper purpose or that its presence distracted jurors. No presumption of prejudice, therefore, arises. (See People v. Holloway (1990) 50 Cal. 3d 1098, 1108 [269 Cal. Rptr. 530, 790 P.2d 1327].)\n\nDefendant next claims misconduct in the form of sexual harassment by a male juror of a female juror. At the hearing on the new trial motion, the female juror testified that once, in the crowded deliberation room, a male juror placed a hand on her rib cage as he squeezed past her. She was wearing a cropped shirt, and his hand accidentally slipped underneath the shirt. She did not feel he had made a pass at her. She told a defense investigator she felt uncomfortable being alone in the room with the juror, but she testified she would have felt uncomfortable being alone with any of the others jurors. The evidence defendant offered entirely fails to establish sexual harassment. Even if it did rise to the level of harassment, defendant fails to cite any evidence indicating the incident might have interfered with the female juror's participation in deliberations.\n\nFinally, defendant contends that prejudicial misconduct occurred during deliberations when several jurors related personal anecdotes concerning drug use. Defendant submitted declarations by two jurors stating that another juror commented on his son's past use of drugs and opined that the memory of some of the witnesses may have been affected by drug use; that another juror said he had used drugs in his youth; and that a third juror mentioned he had a family member who was an alcoholic. These comments, defendant urges, showed that the jurors relied on extrajudicial information relating to the issues pending before them. He observes that drug use was a recurrent theme at trial, and that questions of witness credibility permeated the case. He contends he suffered prejudice if even a single juror used extrajudicial information regarding drug use and its effect on the ability to recall events.\n\nWe find defendant's argument unpersuasive. He does not attempt to show how the jurors' statements regarding drug and alcohol use by family members might relate to any of the issues in this case, and no connection is apparent. None of the cited statements therefore rises to the level of misconduct. \"Jurors bring to their deliberations knowledge and beliefs about general matters of law and fact that find their source in everyday life and experience. That they do so is one of the strengths of the jury system. It is also one of its weaknesses: it has the potential to undermine determinations that should be made exclusively on the evidence introduced by the parties and the instructions given by the court. Such a weakness, however, must be tolerated. '[I]t is an impossible standard to require ... [the jury] to be a\n\nlaboratory, completely sterilized and freed from any external factors.' (Rideau v. Louisiana (1963) 373 U.S. 723, 733 [10 L.Ed.2d 663, 669, 83 S.Ct. 1417] (dis. opn. of Clark, J.).)\" (People v. Marshall (1990) 50 Cal. 3d 907, 950 [269 Cal. Rptr. 269, 790 P.2d 676].) To say, for example, that the memory of some of the witnesses may have been affected by drugs is to say no more than the common knowledge that ingestion of drugs affects perception. Jurors cannot be expected to shed their backgrounds and experiences at the door of the deliberation room. Defendant does not persuade us that any of the jurors' statements could adversely have affected the verdict.\n\nIV. PENALTY PHASE EVIDENCE\n\nA. Prosecution Evidence\n\nThe prosecution presented evidence that defendant had committed two additional murders and three assaults, all uncharged.\n\n1. Killing of Jack Dowdy, Jr.\n\nJack Dowdy, Jr., was a longtime friend of defendant's. Dowdy married Kim Dowdy in 1984, became romantically involved with Pam Lester in 1985, and left his wife in February 1986 to live with Lester. Kim took care of their son.\n\nOn Sunday, May 11, 1986, at Dowdy's parents' home in Espanola, New Mexico, Lester overheard a conversation between defendant and Dowdy. Defendant accused Dowdy of ruining things for him because Dowdy had Kim's son with him, so Kim would not go with defendant to Albuquerque. Defendant said he was going to take Kim to Albuquerque and kill her the following afternoon. After this incident, Dowdy and Lester drove to Albuquerque, where Dowdy was to attend a union trade school for five days.\n\nDowdy had arranged to stay with his cousin, Jackie Sumner, from May 11 to May 15 while he attended school. Dowdy dropped Lester off at her mother's house in Albuquerque on the evening of May 11 and stayed with Sumner that night. On May 12, Dowdy attended school. He never returned to Sumner's house, where he had left two boxes of clothes, nor did he ever contact Lester again. On May 13, Lester found Dowdy's car parked at the Penguin Lounge, across from the union school. His school books were in the car. Lester had a key made for the car and drove it back to Espanola. Dowdy never finished school; he would have received $447.42 for attending five days' training.\n\nJane Davis, Jack Dowdy, Jr.'s, sister, had a close relationship with her brother. In April 1986 their grandfather died, and the family gathered at their\n\nfather's house in Espanola. Defendant, Dowdy's best friend, arrived; Dowdy left with him. Davis later saw defendant with Dowdy. The two men were arguing, and defendant stuck his hand in his left pocket, pulling it around to his front. Months earlier, Davis had seen defendant with a small pistol, which he said he was going to carry with him. After the incident at the funeral, Davis asked defendant if he had pulled a gun on Dowdy. Defendant replied that he had. Davis never heard from Dowdy after the Friday before he went to attend school in Albuquerque. He would have told her had he planned to leave the area for a long time. Only once before had Dowdy gone away--for three weeks--without telling anyone.\n\nTwo or three weeks after Dowdy disappeared, defendant told Davis he had tried to strangle Kim Dowdy with a bandanna because he had had a blackout.\n\nAfter Dowdy's disappearance, a man called Ted told Lester that he had seen Dowdy. Lester gave the information to a detective.\n\n2. Killing of David Church\n\nAround Memorial Day, 1986, David Church and several of his friends attended a party at a ranch near Camarillo State Hospital. At 12:30 or 1 a.m., Church and three others (Fred Helmuth, Laurie Jansen, and Grace Medrano) left the ranch party and went to Brian Buckley's apartment. Buckley was having a party in honor of defendant's arrival. About six other people were in the apartment, including Pam \"Alex\" McCormick, Chris Caldwell, Grace's boyfriend, and defendant. Church and his friends discussed buying cocaine, and smoked some cocaine in a cigarette. After 30 minutes, Church, Jansen, and Helmuth left; Grace stayed overnight in the trailer with her boyfriend. Helmuth never heard from Church again.\n\nChurch later returned to Buckley's apartment on his bicycle. He appeared to be drunk and repeatedly tried to enter, demanding drugs. Defendant and Caldwell took Church outside, telling Buckley to go back into his apartment. Buckley complied. After a while, defendant and Caldwell came back inside. Defendant told Buckley they had slashed Church's bicycle tires and had so scared him that he was waiting at the bottom of the stairs. Defendant and Caldwell then left again, Caldwell taking the keys to Church's mother's car and an ax handle, defendant taking some cocaine. Buckley never saw Church again.\n\nSeveral hours later, around daybreak, defendant and Caldwell returned to Buckley's apartment. Pam McCormick, who had been sleeping in Buckley's bedroom after using a lot of cocaine, overheard a conversation among\n\ndefendant, Caldwell, and Buckley. They talked about having to get rid of a body. They said something about ammonia and about throwing it in the ocean. They also talked about finding cocaine on his body and having to get rid of his bicycle.\n\nBuckley testified that he saw defendant and Caldwell in the morning, four or five hours after they had left. He also saw a 10-speed bicycle with its tires slashed and its wheels removed. Defendant stated they had to get rid of the bicycle because the tires had been cut with his knife, and the police could trace the knife. Later, Caldwell or defendant said he had put the bicycle in a dumpster.\n\nTwo or three days later, defendant told Buckley they had to kill Church because he would have gone to the police if he did not get cocaine. Buckley told defendant Caldwell had already told him about the killing. Four or five days after the party, defendant and Caldwell spoke to Buckley, describing how hard Church was to kill. Still later, defendant said he had to throw away the ax handle because there was blood on the end of it. Defendant also talked about a killing in New Mexico, saying he had killed the husband of a girl named Kim because Kim was afraid of her husband, who had been a friend of defendant's. Defendant wanted Buckley to go back to New Mexico with him to dig up the body of the husband and rebury it so the animals would not get to it. Defendant told Buckley he could kill someone and have no conscience about it.\n\nEddie Denton Church, David Church's father, testified that David owned a blue 10-speed bicycle, a KHS Winner model, with thin tires and straight handlebars. He had purchased the bicycle for David from California International Cycles. The senior Church never saw his son after the Saturday of Memorial Day weekend in 1986.\n\nOn July 29, 1986, Daniel Berg was walking in a creekbed along Aliso Canyon Road. A strong odor drew his attention to a large pile of rocks. Berg uncovered a shoe, a pants leg, and the shoulder of a sweater, and called the sheriff's department. Sheriff's Sergeant Gary Backman investigated. The grave was a mound of rocks above a dry creek bottom off a dirt road in the canyon. Papers scattered near the grave included a Ventura County Medical Center identification card.\n\nDr. Frederick Warren Lovell inspected the grave site and subsequently performed an autopsy. The body was markedly decomposed, with the skin mummified and most of the face, muscle mass, and internal organs gone. In Dr. Lovell's opinion, the body had been in the canyon more than six weeks\n\nand less than ten months. He was unable to determine the cause of death. Dr. Lovell testified that a blunt-force blow to the skull sufficient to cause unconsciousness would not necessarily leave a recognizable mark or damage to the skull.\n\nDr. Lovell compared X-rays of the skull with an X-ray from the Ventura County Medical Center Hospital files for David Church. Distinctive patterns in both X-rays established that the body found in the canyon was that of David Church.\n\nOn August 7, 1986, Sergeant Backman recovered a blue 10-speed KHS Winner bicycle which had been found leaning against a fence near the intersection of Church and Ann Streets in Ventura County. The serial number of the bicycle matched that listed on the sales slip from International Cycles.\n\n3. Assaults on Kim Dowdy\n\nIn March 1986, Kim Dowdy went with defendant and another couple from Espanola on a week-long motorcycle trip to California. They all shared sleeping quarters on the trip, but Kim testified she had no romantic involvement with defendant. On their return to Espanola, she moved her belongings into her aunt's house with defendant's assistance. A week later, he moved into a spare room in the same house. She testified to three separate assaults occurring after that time.\n\ni. Assault With Gun\n\nIn mid-April 1986, defendant took Kim to a drive-in for a soda and then drove to another establishment so that she could use the restroom. As she came out of the restroom, she saw a male friend whom she had not seen in a long time. They hugged each other, and Kim got back into defendant's truck. Defendant drove to a motorcycle track in Arroyo Seco, pulled a gun on her, and told her that he would kill her because if he could not have her, no one would. She told no one about this assault because defendant threatened to harm her son.\n\nii. Assault With Silk Belts\n\nOne night at the end of April 1986, Kim was sleeping in her aunt's house. (She seldom slept there, generally staying at her grandmother's instead.) That night she awoke to find defendant above her, pulling on three silk belts around her neck and trying to choke her. Kim believed she must have passed out because she later awoke and found she had wet the bed.\n\niii. Assault With Knife\n\nOne evening in the early part of May 1986, defendant came into Kim's grandmother's house. He tossed a set of car keys around and told her Jack wouldn't bother her any more.\n\nA couple of days later, on May 14, 1986, defendant pulled up on his motorcycle at her grandmother's house, entered, and said Kim had to leave with him or he would kill everyone in the house. Defendant followed Kim into the kitchen, picked up a knife, and held it to her throat. She agreed to go with defendant because her grandmother and her son were in the house. She told her grandmother, in Spanish, to go to the flower shop at the front of the house and call her uncle, Tony Maestas. Her grandmother did so. Defendant and Kim left the house. Maestas ran out of the flower shop, demanding to know what was going on. Defendant jumped on his motorcycle and drove off. Kim and her uncle returned to her grandmother's house.\n\nDefendant telephoned and arranged to meet Kim at a Burger King. She was accompanied by her uncle, who carried a gun for protection. Defendant approached their vehicle and told Kim to go inside the restaurant because he wanted to talk to Maestas. Defendant flipped his butterfly knife open and closed, then threw it on the passenger seat to indicate he was unarmed. Maestas told him his 81-year-old mother was scared to death of him and asked how he would feel if she dropped dead of fright of him coming over to terrorize her. Defendant replied he had no feelings and didn't care if she dropped dead. He said, \"I even killed Bubs.\" (Jack Dowdy, Jr., was nicknamed Bubs.) Defendant went into the Burger King to talk to Kim. When they emerged, defendant ordered Kim to go to the back of her uncle's truck so that he could talk with Maestas. He told Maestas not to tell Kim anything of what he had told him, and that Maestas was the only one whom defendant had told about Bubs.\n\nDefendant took his knife from Maestas's truck and left. Later that day, he moved out of Kim's aunt's house and admitted himself to the Veterans' Administration hospital.\n\nB. Defense Evidence\n\nThe defense tried to cast doubt on the prosecution's evidence regarding the Church killing. Detective Ray Bustillos testified that Pam McCormick told him she overheard defendant and Brian Buckley talking about having dumped Church's body in the ocean. Linda Wade testified that she received a telephone call from David Church after he was supposed, according to the\n\nprosecution's theory, to have been killed; the call came in the early morning hours, Church's voice was slurred, and another person, David Ruiz, was also on the line. Tonya Bennett had known David Church for three years and testified that she saw him on June 17, 1986, although it was possible her sighting of him had actually been weeks earlier.\n\nNumerous friends of defendant testified that he was loyal, caring, forgiving, and helpful, although Amy Koetter conceded defendant had admitted trying to kill Kim Dowdy.\n\nSeveral of defendant's siblings and neighbors testified about conditions prevailing in the Fauber household while defendant was growing up. The Fauber family lived in Espanola, New Mexico, in a small, messy house lacking indoor plumbing. Defendant was the youngest of 11 children, 7 of whom survived into adulthood. Their father was unemployed and stayed in bed most of the time. He was verbally abusive and disciplined his children with razor straps, belts, and belt buckles. Defendant did not finish high school. Defendant and his brother Pete were involved in a motorcycle accident in which Pete was killed. After that, defendant became withdrawn. Following her husband's death, Mrs. Fauber married a man who drank heavily. Later, she divorced him and remarried.\n\nIsabel Anne Wright, a social anthropologist, researched the community and school system of Espanola. She testified that defendant lived in extreme poverty and suffered abuse and neglect during his childhood. Also, he was unsettled by the family's moves and deaths. Espanola's unemployment rate was 20 percent.\n\nJohn Irwin, a criminologist and former convict, testified about the effects of life imprisonment on convicted persons and on conditions of life in California prisons.\n\nEdward Vann Grover, a psychologist, visited defendant in jail for three hours and reviewed hospital reports on defendant written after a motorcycle accident and after defendant's self-referral to the Veterans' Administration hospital. Dr. Grover also administered six psychological tests. The tests disclosed that defendant was of average intelligence and had not been very involved in his schooling. They showed no neuropsychological deficits, central nervous system damage, or acquired cognitive deficit. One test indicated that defendant had impaired interpersonal skills and some difficulty keeping reality and fantasy separated. Dr. Grover thought there might be an organic brain deficit, but could not establish that. He could not rule it out, however, because the tests he administered would only show such a\n\ndeficit 70 percent of the time. An electroencephalogram administered on May 2, 1986, showed defendant's brain wave patterns to be normal.\n\nIt was stipulated that, while an inmate at the Ventura County jail, defendant had not engaged in any acts of violence.\n\nC. Prosecution's Rebuttal\n\nThe prosecution attempted to impeach Tonya Bennett's testimony that she had seen David Church after the night he was supposed to have been murdered. David Jamerson, Tonya's father, testified that his daughter often lied and exaggerated. He had only occasional contact with her and they did not enjoy a close relationship.\n\nV. CLAIMS OF ERROR AFFECTING PENALTY PHASE\n\nA. Refusal to Reopen Voir Dire\n\nAfter the jury returned its verdict in the guilt phase of trial, but before the penalty trial began, defendant moved, under section 190.4, subdivision (c)\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e (hereafter section 190.4(c)), to reopen voir dire or for impanelment of a new jury for the penalty phase. Defense counsel stated he did not know, when the jury was selected, that Brian Buckley would be testifying against defendant. As a consequence, counsel contended, he had not had an adequate opportunity to question prospective jurors about bias associated with a coperpetrator's testimony. The trial court denied the motion, ruling that even if defense counsel would have conducted voir dire differently knowing that Buckley was to testify, any claim of prejudice was purely speculative and did not establish good cause for relief. Defendant now contends the ruling denied him his rights under the Fifth, Sixth, Eighth, and Fourteenth Amendments of the Federal Constitution. We conclude that the trial court did not err.\n\nWe have often observed that section 190.4(c) reflects the long-standing legislative preference for a single jury to determine both guilt and penalty. (People v. Nicolaus (1991) 54 Cal. 3d 551, 572 [286 Cal. Rptr. 628, 817 P.2d 893]; People v. Taylor (1990) 52 Cal. 3d 719, 738 [276 Cal. Rptr. 391, 801 P.2d 1142]; People v. Ainsworth, supra, 45 Cal. 3d at p. 1029; People v. Gates (1987) 43 Cal. 3d 1168, 1199 [240 Cal. Rptr. 666, 743 P.2d 301].) Defendant\n\nsuggests that the efficiency concerns in which this preference is (at least in part) rooted should have given way in his case, because reopening voir dire would not have consumed much time. His argument reflects a misunderstanding of our decisions applying section 190.4(c). Voir dire is not to be reopened on speculation that good cause to impanel a new jury may thereby be discovered; rather, a showing of good cause is a prerequisite to reopening. (People v. Gates, supra, 43 Cal. 3d at p. 1199.) Defendant has raised only speculation that some jurors may have entertained some hidden bias regarding the testimony of a coperpetrator or that they may have preJudged the issue of penalty. He fails to establish error, constitutional or otherwise.\n\nDefendant also complains that prosecutorial misconduct--in the form of concealment of Buckley's status as a witness--prevented defense counsel from conducting appropriate voir dire. We disagree. Although the trial court accepted, for purposes of argument, defense counsel's representation that he was \"surprised\" that Buckley became a prosecution witness, a review of the chronology of pertinent events lessens the weight that might otherwise be accorded to the trial court's statement. Buckley was arrested and arraigned before the Conclusion of Hovey (People v. Hovey (1988) 44 Cal. 3d 543 [244 Cal. Rptr. 121, 749 P.2d 776]) voir dire in defendant's case; Buckley's preliminary hearing was held before counsel began to question the first 12 seated jurors; and defense counsel acknowledged that he had heard, even before Buckley's arraignment, that the prosecution was going to offer to let Buckley plead guilty to second degree murder if he would testify against defendant. It is also noteworthy that, shortly before the commencement of voir dire, the trial court granted defendant's motion to exclude his confession on the basis of Miranda v. Arizona, supra, 384 U.S. 436. Defendant points out that the prosecution moved to prevent him from calling Buckley as a witness in order to assert his Fifth Amendment privilege against self- incrimination in the presence of the jury, and that the motion remained pending until after the jury was seated. He also notes that Buckley signed his plea agreement on the day the prosecutor made his opening statement, although the prosecutor had not disclosed the existence of any negotiations with Buckley. However, in light of the other circumstances known to defense counsel, these facts cannot be deemed controlling. Nothing prevented defense counsel from conducting voir dire in light of what seems in hindsight to have been a realistic possibility that Buckley would testify against defendant. He may not now complain about his decision not to do so.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nB. Trial Court's Statement That Jurors Would \"Recommend\" Penalty\n\nDefendant contends he was deprived of due process, a fair and impartial jury, protection against cruel and unusual punishment, and a\n\nreliable penalty determination because the trial Judge told six of the twelve jurors who decided the guilt and penalty phases, during individual Hovey voir dire, that they would be asked to make a \"recommendation\" as to the appropriate penalty. (All other jurors were told they would be asked to \"determine\" or \"decide\" the penalty.) He also contends that the word \"determination\" is itself insufficient to convey the ultimacy of the jury's task. We disagree.\n\nA death sentence may not constitutionally rest on a determination made by a sentencer who has been led to believe that the responsibility for determining the appropriateness of the defendant's execution lies elsewhere. (Caldwell v. Mississippi (1985) 472 U.S. 320, 328-329 [86 L.Ed.2d 231, 239-240, 105 S.Ct. 2633].) However, our review of the record establishes that none of the jurors could have been under any misapprehension as to the nature of their duty. Portions of Hovey voir dire not cited by defendant, the trial court's instructions, and arguments of counsel emphasized that the decision as to life or death was for the jury alone. Neither the prosecutor nor the trial court suggested that the jury's decision would be reviewed for correctness and appropriateness. We do not believe that the trial court's comments during Hovey voir dire could have had a greater impact on the jurors than its penalty phase instructions and the arguments of counsel. We also find no merit in defendant's contention that the word \"determine\" conveyed to the jurors the impression that their task was mediate rather than final. Webster's New International Dictionary (2d ed. 1957), at page 711, includes among the definitions of \"determine\" that of \"to fix conclusively or authoritatively.\" Defendant was not deprived of his constitutional right to a sentencing body fully apprised of its weighty responsibility.\n\nC. Jury's Consideration of Unadjudicated Crimes Evidence\n\n1. Summary\n\nDefendant contends that the way in which the jury considered evidence of previously unadjudicated crimes he allegedly committed violated his rights under the Fifth, Sixth, Eighth, and Fourteenth Amendments to the federal Constitution. Specifically, he asserts that: (1) the jury should have been required to unanimously find each of the allegations of criminal activity true beyond a reasonable doubt before considering them in aggravation; and (2) the trial court erred in admitting evidence of the unadjudicated crimes without first finding beyond a reasonable doubt that defendant committed those crimes.\n\n2. Refusal to Require Jury to Make Findings Determining Whether Unadjudicated Crimes Were Proved Beyond Reasonable Doubt\n\nDefense counsel argued that the jury should be instructed to deliberate and make findings as to each of the five unadjudicated crimes in evidence. The trial court disagreed, instructing that the determination whether to consider unadjudicated criminal activity as an aggravating circumstance is made individually by each juror. Defendant contends the court erred.\n\nWe have rejected defendant's argument in the past, and he does not persuade us to depart from our prior decisions. Although defendant is entitled to a unanimous jury verdict in the final determination of penalty, the law does not require a unanimous finding as to any unadjudicated crime offered in aggravation. (People v. Miranda (1987) 44 Cal. 3d 57, 99 [241 Cal. Rptr. 594, 744 P.2d 1127].) The trial court correctly instructed that each juror must make an individual determination whether the prosecution proved other criminal activity beyond a reasonable doubt before considering that activity in aggravation. (; see People v. Robertson (1982) 33 Cal. 3d 21, 53 [188 Cal. Rptr. 77, 655 P.2d 279].) Contrary to defendant's argument, neither the instruction nor the prosecutor's argument that it was unnecessary for the jurors to take a vote on each unadjudicated crime discouraged deliberation. Defendant argues that the jurors' tasks were complicated and difficult. Indeed, they were, as the deliberative processes in penalty trials not uncommonly are. But the jurors received the instructions necessary to ensure the reliability of their determination. Defendant contends he is denied meaningful appellate review of his sentence because we cannot know how the jury viewed the evidence. His argument proves too much; reviewing courts can never probe jurors' deliberations, but this inescapable fact does not vitiate the appellate process.\n\nFor the first time in his reply brief, defendant makes the argument that the refusal to require specific written findings on unadjudicated offenses in the penalty phase violated his right to equal protection of the laws. A defendant subject to the imposition of a sentence enhancement under section 12022.5 is entitled to such a finding, he argues, while a capital defendant against whom unadjudicated offenses are alleged is not. He fails to recognize that the capital defendant and the defendant subject to the section 12022.5 enhancement are not similarly situated. The latter receives enhanced punishment for his use of a firearm in the commission of a crime; the former receives punishment not for the unadjudicated crimes but for the murder with special circumstances of which he has been found guilty.\n\n3. Sufficiency of Proof of Unadjudicated Murders\n\nDefendant contends the trial court erred in admitting evidence of the Church and Dowdy killings to show prior violent criminal activity. (§ 190.3, factor (b).) His involvement in the killings was shown by circumstantial evidence and by his own admissions to Brian Buckley and Tony Maestas. He urges that the evidence should have been excluded because the prosecution did not first prove beyond a reasonable doubt that defendant committed each crime. We disagree.\n\nIn People v. Phillips, supra, 41 Cal. 3d 29, we observed that when the prosecution seeks to introduce evidence of other criminal activity in the penalty phase of trial, it may be advisable for the trial court to conduct a preliminary inquiry (out of the presence of the jury) to determine whether there is \"substantial evidence to prove each element of the other criminal activity.\" ( at p. 72, fn. 25.) Such a procedure is strictly a matter of trial court discretion. The trial court in this case, in its discretion, conducted such a hearing, at which the corpus delicti of each killing was amply established.\n\nAs to the murder of David Church, evidence adduced at the Phillips hearing--which was largely similar to that later introduced before the jury--showed that during the early part of the summer of 1986, while defendant was staying at Brian Buckley's apartment, Buckley gave a party attended by defendant, Chris Caldwell, and others. Church was among a group of people who arrived at the party about 10 p.m. and stayed for 10 to 20 minutes. A half hour later, Church returned alone. Because he was drunk, Buckley did not want him around. Defendant, Buckley, and Caldwell took Church downstairs. At Caldwell's direction, Buckley then returned to the party. Fifteen minutes later, defendant and Caldwell reentered Buckley's apartment. Defendant said he had scared Church and slashed his bicycle tires with a knife. Caldwell took an ax handle and the keys to Buckley's mother's car and, with defendant, went downstairs. Buckley saw Church sitting at the bottom of the stairs. After midnight, he did not see Church again. The next morning, Buckley saw a 10-speed bicycle with slashed tires at the apartment. Defendant and Caldwell said they were going to get rid of the bicycle because defendant's knife could be traced from the slashes. By the third day after the party, the bicycle was gone. Three days after the party, defendant told Buckley that he and Caldwell had killed Church. Caldwell had already told Buckley that. A couple of days later, defendant, Caldwell, and Buckley had another conversation about the Church killing. Defendant said he hit Church across the head with the ax handle, that Church was \"pretty tough.\" Caldwell told Buckley how hard Church was to kill. A week later, defendant and Buckley were standing outside Buckley's apartment. Defendant was holding\n\nthe ax handle, stating that he had to throw it away because there was blood on it.\n\nFred Helmuth, a friend of David Church, testified that after the evening of the visit to Buckley's apartment, he never saw Church again.\n\nDr. Frederick Lovell testified that he examined human remains found under a mound of rocks in a riverbed in Aliso Canyon near Santa Paula on July 29, 1986. The body was decomposed, the little remaining skin being mummified. Dr. Lovell estimated that the deceased had been dead more than six weeks, to an upper limit of six to ten months. After performing an autopsy, Dr. Lovell was unable to determine the cause of death. A comparison study of X-rays established that the dead man was David Church.\n\nClearly, the proof adduced at the Phillips hearing (supra, 41 Cal. 3d 29), apart from defendant's extrajudicial statements to Brian Buckley, created a reasonable inference that David Church died by criminal agency, and thus sufficed to permit the admission into evidence of those statements. (People v. Towler (1982) 31 Cal. 3d 105, 115 [181 Cal. Rptr. 391, 641 P.2d 1253].) Just as clearly, the weight of the proof, including the statements, must be described as substantial. The trial court correctly allowed the evidence to go to the jury.\n\nAs to the killing of Jack Dowdy, Jr., the proof adduced at the Phillips hearing likewise sufficed to permit the introduction of defendant's extrajudicial admissions and to warrant presentation of the evidence to the jury. Dowdy's father testified that he never saw his son after the latter left for Albuquerque, where he was to attend a union- sponsored trade school. Kim Dowdy, whose marriage to Jack Dowdy had not been dissolved, testified about defendant's violently possessive behavior toward her. Jane Davis, Dowdy's sister, testified that after a family gathering she saw defendant make a motion toward Dowdy with his hand inside his pocket, where Ms. Davis knew defendant kept a gun. Pam Lester, Dowdy's girlfriend, overheard the victim and defendant talking about Kim Dowdy shortly before Dowdy's disappearance. Dowdy was supposed to call Lester after the first day of his trade school, but did not. Jackie Sumner, the cousin with whom Dowdy was staying while attending school, last saw him early on the morning of the first day of his classes; he never returned to her home to pick up his clothes. The trade school records showed that Dowdy attended his first scheduled day of a week of classes, but did not return thereafter. He would have received $447.42 for completing his classes.\n\nBased on this evidence, the trial court did not err in admitting defendant's statements to Brian Buckley about his role in Dowdy's killing. That Dowdy\n\nwas murdered was a reasonable inference from the evidence that he left his property behind and disappeared, without completing trade school and without ever contacting his girlfriend or the relatives with whom he enjoyed a close relationship. (See People v. Johnson (1991) 233 Cal. App. 3d 425, 439-442 [284 Cal. Rptr. 579] [to establish corpus delicti, evidence need not negate all possibilities of the victim's death by noncriminal agency or of the victim's continued existence].) The court also correctly concluded that the evidence of defendant's guilt, including his admissions to Buckley, his relationship with Kim Dowdy and his apparent assault on Jack Dowdy, was substantial enough to go to the jury.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nD. Adoptive Admissions\n\nDefendant contends that the trial court erred in relying on the doctrine of adoptive admissions to admit testimony by Pamela McCormick linking him to the Church murder.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Over defense counsel's hearsay objections, the trial court allowed McCormick to testify that, on the morning after the party to which Church repeatedly had attempted to gain entrance, she was asleep in Brian Buckley's apartment until voices awakened her. Feigning sleep, she recognized three participants in the conversation: Chris Caldwell, Brian Buckley, and defendant. She heard them say that they had to \"get rid of his body,\" something about ammonia, and something about finding a half-gram of cocaine on his body. She also heard them talk about having to get rid of his bicycle. She did not open her eyes during the conversation and could not identify which man made any of the statements she related. However, she heard defendant's voice, as well as Caldwell's and Buckley's, during the conversation.\n\nThe adoptive admission exception to the hearsay rule is expressed in Evidence Code section 1221. That statute provides that \"[e]vidence of a statement offered against a party is not made inadmissible by the hearsay rule if the statement is one of which the party, with knowledge of the content thereof, has by words or other conduct manifested his adoption or his belief in its truth.\" (Evid. Code, § 1221.) A leading case explicating adoptive admissions is People v. Preston (1973) 9 Cal. 3d 308 [107 Cal. Rptr. 300, 508\n\nP.2d 300]. In Preston, we held that \"[i]f a person is accused of having committed a crime, under circumstances which fairly afford him an opportunity to hear, understand, and to reply, and which do not lend themselves to an inference that he was relying on the right of silence guaranteed by the Fifth Amendment to the United States Constitution, and he fails to speak, or he makes an evasive or equivocal reply, both the accusatory statement and the fact of silence or equivocation may be offered as an implied or adoptive admission of guilt.\" ( at pp. 313-314.)\n\nDefendant contends that the statements McCormick related cannot properly come in as adoptive admissions because they were not accusatory statements and called for no particular reply. For the adoptive admission exception to apply, however, a direct accusation in so many words is not essential. In Preston, for example, the defendant was charged with the murders of the witness's mother and stepfather. The witness testified that she and the defendant, along with his coperpetrator, were in the defendant's room. The coperpetrator said to the witness, \" 'Suzanne, we went down to your mother's trailer house, and we broke in, and as we were leaving, we had everything ready to go out, and they came in, and there was an accident and ... but they won't talk.' \" (People v. Preston, supra, 9 Cal. 3d at p. 314.) The defendant then looked at the witness and said, \" 'There wasn't much money.' \" () Although the statements were not accusatory on their face, we concluded they accused the defendant of being in the victims' trailer with the coperpetrator when the killings took place. We noted the statements were voluntarily made in the course of a private conversation in a private home. These circumstances supported the inferences that the defendant heard and understood the statements and had the opportunity to deny them, and that he chose to remain silent except for an evasive and equivocal statement. They were, therefore, properly allowed as adoptive admissions. (See also People v. Medina (1990) 51 Cal. 3d 870, 889-891 [274 Cal. Rptr. 849, 799 P.2d 1282] [silence and evasive statements by defendant in response to his sister's query why he shot victims were properly allowed in evidence as adoptive admissions, although conversation took place while defendant was in custody].)\n\nSimilarly, in this case the testimony indicated that defendant participated without demur in a private conversation during which the Disposition of Church's remains and his bicycle was discussed. The circumstances afforded defendant the opportunity to deny responsibility, to refuse to participate, or otherwise to dissociate himself from the planned activity; he did not do so. Defendant complains that McCormick did not testify as to whether he actually heard the statements, but we find it entirely reasonable to infer that preliminary fact from her testimony that he participated in the conversation. This case is thus distinguishable from People v. Lebell (1979) 89 Cal. App. 3d 772, 779-780\n\n[152 Cal. Rptr. 840], on which defendant relies. In Lebell, a police officer testified about his telephone conversation with a murder suspect. The suspect called from Lebell's home and the officer heard Lebell's voice in the background while the suspect made his incriminating statements. The Court of Appeal held that the trial court erred in determining that Lebell's presence was sufficient to support a finding of adoptive admission. The preliminary facts--that Lebell heard the suspect's admissions, and that there was reason or opportunity to respond--were inadequately established. ( at p. 780.) The same cannot be said in this case. Defendant also notes that McCormick, who kept her eyes shut during the conversation, would have been unable to observe a silent response by defendant, such as a shocked look, that she was unable to tell which of the participants said what, and that she had ingested a lot of cocaine the preceding night. His observations go to the weight rather than the admissibility of her testimony.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nMoreover, the court appropriately instructed the jury on adoptive admissions, warning it to view them with caution.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Contrary to defendant's assertion, the jury was not told to view the statements to which McCormick testified as admissions by defendant; rather, after defining adoptive admissions, the trial court instructed the jurors that they were the exclusive Judges of whether an adopted admission was made and of its truth. Defendant argues that the trial court's instruction was deficient for failure to require the jury to consider whether there were admissions made that defendant could adopt. Examination of the instruction compels us to disagree.\n\nE. Exclusion of Evidence\n\n1. Summary\n\nDefendant contends the trial court erred prejudicially in excluding certain evidence at the penalty phase. He argues that Jackie Sumner should have been permitted to testify that Dowdy had confided in her that: (1) he had heard that Kim Dowdy had put out a contract on his life; (2) there was\n\nenmity between Kim and himself; and (3) he anticipated a custody battle over their infant son. He also argues that the trial court erred in sustaining the prosecutor's hearsay objection to a question asking Pam Lester whether an individual called \"Ted\" had told her he had seen Dowdy after the latter was supposed to have disappeared. Finally, defendant contends that the trial court erred in refusing to allow him to testify that he had refused an offer to plead guilty in exchange for a sentence of life without possibility of parole. We consider each of these contentions separately.\n\n2. Dowdy's Statements to Sumner\n\nDowdy spent the night before he disappeared with his cousin, Jackie Sumner, at her home in Albuquerque. On cross-examination, defense counsel asked Sumner if Dowdy had talked with her about a custody battle over his son. The trial court sustained hearsay and relevancy objections. To demonstrate relevancy, defense counsel made an offer of proof that Jack Dowdy had heard that Kim Dowdy put a contract out on his life, that there was a great deal of enmity between Jack and Kim Dowdy, and that Dowdy was concerned about a custody battle over his son. Regarding the hearsay objection, defense counsel offered the statements to impeach Kim Dowdy, who, he represented, had earlier testified that there was no problem between her and Jack and that they maintained a relationship because of their son. Finding the statements \"unreliable,\" the trial court sustained the objection on both grounds advanced by the prosecutor.\n\nDefendant now contends that the statements were not hearsay, but rather went to Dowdy's state of mind shortly before he disappeared. We agree. The statements could not have been offered to prove that Kim Dowdy had in fact put a contract out on Jack, or that there was enmity between Jack and Kim, or that a custody battle was imminent; they were, however, relevant to suggest attitudes or beliefs that might have led Jack to choose to disappear without a trace. (See Evid. Code, § 1200, subd. (a).) As nonhearsay evidence relevant to a disputed issue (i.e., whether Dowdy was murdered or had voluntarily disappeared), it should have been admitted unless some other rule dictated its exclusion. (Evid. Code, § 351.) No such rule is suggested to us.\n\nDefendant's trial counsel did not, however, specifically raise this ground of admissibility. In these circumstances he is precluded from complaining on appeal. (Evid. Code, § 354, subd. (a); Lorenzana v. Superior Court, supra, 9 Cal. 3d at p. 640; People v. Frye, supra, 166 Cal. App. 3d at p. 950.) Defendant also suggests his trial counsel's performance was in this respect constitutionally inadequate. (See People v. Pope, supra, 23 Cal. 3d at p. 425.) We\n\nneed not decide whether trial counsel was deficient, however, because defendant cannot in any event establish the prejudice requisite to relief. (People v. Stankewitz, supra, 51 Cal. 3d at p. 113.) In light of the evidence that defendant in effect admitted to three witnesses his responsibility for Dowdy's death, it is not reasonably probable that a result more favorable to him would have resulted from presentation of the excluded testimony.\n\n3. Pam Lester's Conversation With \"Ted\"\n\nDefendant claims error in trial court rulings that sustained hearsay and relevancy objections to questions aimed at eliciting the out-of- court statements of a man who claimed to have seen Dowdy after the latter's disappearance. Asked \"Did you ever hear from anyone that they had seen Mr. Dowdy?,\" Pam Lester responded in the affirmative. She testified that about two weeks after Dowdy was last seen, a man calling himself Ted visited her. She described Ted, whom she had never before seen, in some detail, and stated she gave this information to a detective. When defense counsel asked Lester what exactly Ted told her, the trial court sustained the prosecutor's hearsay objection.\n\nDefendant does not deny that defense counsel's question called for hearsay, but contends he is entitled to a relaxation of the rules of evidence. We disagree. The proffered testimony lacks indicia of reliability sufficient to compel its admission under the authority of Green v. Georgia (1979) 442 U.S. 95 [60 L.Ed.2d 738, 99 S.Ct. 2150], especially in the absence of any showing as to Ted's identity or relationship to Dowdy. Consequently, we find no error, constitutional or otherwise, in the trial court's ruling. In any event, on cross-examination Lester stated she had met a man who claimed to have seen Dowdy after his disappearance and that she had so informed a detective. Defense counsel thus succeeded in suggesting to the jury that, contrary to the prosecution's theory, Dowdy was still alive.\n\n4. Evidence of Plea Offer and Defendant's Refusal\n\nDefendant urges the trial court erred in excluding evidence that the prosecutor had offered, and defendant had refused, the opportunity to plead guilty to murder and testify against Caldwell and Buckley in return for a sentence of life without possibility of parole.\n\nDefense counsel sought to introduce evidence of defendant's refusal as mitigating character evidence showing loyalty to his friends. After a series of hearings, the trial court ruled the evidence inadmissible under Evidence Code section 352. The trial court reasoned that the low probative value of\n\nthe evidence was outweighed by the danger of its confusing and misleading the jury. The trial court also found a possibility of undue consumption of time.\n\nWe find no abuse of discretion and no violation of constitutional guarantees in the ruling. While it is true, as defendant contends, a capital defendant must be allowed to present all relevant mitigating evidence to the jury (Skipper v. South Carolina (1986) 476 U.S. 1, 4 [90 L.Ed.2d 1, 6-7, 106 S.Ct. 1669]; Lockett v. Ohio (1978) 438 U.S. 586, 604 [57 L.Ed.2d 973, 989-990, 98 S.Ct. 2954]), the trial court determines relevancy in the first instance and retains discretion to exclude evidence whose probative value is substantially outweighed by the probability that its admission will create substantial danger of confusing the issues or misleading the jury. (Evid. Code, § 352; see, e.g., People v. Allen (1986) 42 Cal. 3d 1222, 1284- 1285 [232 Cal. Rptr. 849, 729 P.2d 115].) The trial court's determination that defendant's refusal of a plea offer fell into the category of excludable evidence was not clearly wrong.\n\nAs an indication of defendant's character, the refusal in itself was meaningless. Defendant disputes this Conclusion. Trial counsel argued that the mere fact of defendant's refusal tended to show that he was loyal to friends. Appellate counsel now suggests the evidence additionally showed that defendant would get along well in prison, that he believed in his own innocence, and that he was willing to trust the judicial system.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e While it is true that any of the characteristics defendant posits may have been a factor in his refusal, it is also possible to infer other reasons not reflecting so favorably on defendant's character. The mere fact that defendant declined the plea offer could not have significantly helped the jury determine the appropriate penalty.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nTo supply meaning to the bare fact of the refusal, additional inquiry regarding the underlying reasons would have been required. Such examination, as the trial court concluded, had the potential to mislead and confuse the jury. Consequently, we cannot agree that the trial court abused its discretion in excluding the evidence that defendant refused the plea offer.\n\nDefendant contends that exclusion of the evidence was improper because his refusal of the plea offer was part of his \"record\" and \"background,\" inasmuch as it happened and involved him. As such, he urges, it could not be excluded as cumulative. He reads too much into section 190.3, factor (k), in implying that a defendant is entitled to put before the jury evidence of every event that has ever happened to him.\n\nDefendant also argues that the fact that the prosecution made the offer was relevant and admissible character evidence. We do not agree. The fact that the offer was made, like the fact that it was refused, is susceptible of numerous inferences. Standing alone, it sheds no light on defendant's character, and would likely mislead rather than assist the jury in its determination. As the People point out, such an offer may reflect leniency rather than a belief that the defendant is less culpable for the crime charged. Defendant notes that the prosecutor could have testified as to his reasons for making the offer. However, the trial court could, as it did, properly conclude that such testimony would have unduly prolonged the trial and drawn the jury's attention to issues having no bearing on aggravating and mitigating factors.\n\nDefendant asserts that the California Constitution favors allowing defendants to present evidence of plea offers, since plea bargains are disfavored. (See § 1192.7.) A rule allowing admission of rejected plea offers by which defendants in capital cases could have avoided the death penalty might indeed deter prosecutors from using threats of death penalty charges to coerce plea bargains. However, defendant cites no authority for the notion that such extrinsic policy concerns should inform the trial courts' rulings under Evidence Code section 352.\n\nDefendant argues that in excluding the evidence of his refusal, the trial court erroneously placed on him the burden of producing evidence sufficient to persuade the jury to return a sentence other than death. His interpretation of the trial court's ruling is unsupported by the record.\n\nF. Claimed \"Multiple Counting\" of Aggravating Factors\n\nDefendant complains that CALJIC No. 8.84.1, as read to the jury, invited improper \"multiple counting\" of the unitary course of conduct\n\ninvolved in his murder of Thomas Urell. He contends a reasonable juror would have considered the facts of the Urell murder first as circumstances of the crime, second as special circumstances (§ 190.3, factor (a)), and third as instances of other criminal activity (§ 190.3, factor (b)). He also argues a reasonable juror would have improperly \"stacked\" the robbery and burglary special circumstances of the Urell crime. These defects in the instruction, he contends, violated his rights under the Fifth, Sixth, Eighth, and Fourteenth Amendments.\n\nWe have rejected the same arguments in the past, holding that the instructions as a whole invite reasonable jurors neither to \"weigh\" each special circumstance twice (People v. Melton (1988) 44 Cal. 3d 713, 768-769 [244 Cal. Rptr. 867, 750 P.2d 741]) nor to count the circumstances of the present crime under both factors (a) and (b) of section 190.3 (People v. Bonin (1988) 46 Cal. 3d 659, 703 [250 Cal. Rptr. 687, 758 P.2d 1217]). This case is governed by our earlier decisions, since nothing in the prosecutor's arguments invited the jury to make the type of improper use of the Urell evidence that defendant suggests.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e\n\nG. Denial of Motion to Limit Cross-examination of Defendant\n\nDefendant contends the trial court erred in denying his motion to limit cross-examination of himself, at the penalty phase, to his reasons for his rejection of the plea bargain. Of course, since we have determined that evidence of the plea offer was properly excluded, this claim is largely moot. However, since defendant contends this ruling denied him his right to testify, we make the following observations.\n\nDefendant wished to testify regarding his refusal of the offer only if he could be shielded from cross-examination. In response to the trial court's ruling that he would have to explain why he rejected the offer, defendant offered to testify that the offer was made, that he rejected it, and that there were three reasons for rejecting it: (1) that he did not want to stipulate to spending the rest of his life in prison without possibility of parole; (2) that he did not want to testify against people he considered to be his friends; and (3) that he would be extremely concerned about spending the rest of his life in state prison labelled an informant. The trial court ruled that if defendant so testified, then the prosecutor would be entitled to cross-examine defendant on his character traits of loyalty and helpfulness to his friends, including Jack Dowdy, Jr. Defendant did not testify, and now contends the trial court's ruling denied him his right to testify in his own defense.\n\nIt is true, of course, that when a defendant chooses to testify on his own behalf, the privilege against self-incrimination serves \" 'to prevent the prosecution from questioning [him] upon the case generally, and in effect making him its own witness.' \" (People v. Schader (1969) 71 Cal. 2d 761, 770 [80 Cal. Rptr. 1, 457 P.2d 841], quoting People v. Gallagher (1893) 100 Cal. 466, 475 [35 P. 80]; Cal. Const., art. I, § 15; U.S. Const., Amends. V, XIV; see also Evid. Code, § 773, subd. (a).) \"Such general compelled cross-examination would not only pose the same 'cruel trilemma of self-accusation, perjury or contempt' recognized in Murphy v. Waterfront Com., [(1964)], 378 U.S. 52, 55 [12 L.Ed.2d 678, 681, 84 S.Ct. 1594]; it would also penalize and thereby deter a defendant's assertion of his right to take the witness stand to explain or contradict a particular aspect of the case against him.\" (People v. Schader, supra, 71 Cal. 2d at p. 770, fn. omitted.) As defendant asserts, the breadth of the waiver of his privilege is determined by the scope of the testimony he presents. Had he testified, as he proposed, regarding his reluctance to testify against his friends, the prosecution would have been entitled to introduce evidence through cross-examination that explained or refuted his statements or the inferences necessarily to be drawn from them, or that tended to overcome or qualify the effect of the testimony given on direct examination. ( at pp. 770-771.) An inference naturally and necessarily to be drawn from the fact of defendant's reluctance to testify against his friends is that he possessed traits of loyalty, helpfulness, or concern toward them. Given the testimony that defendant and Jack Dowdy were longtime friends, the trial court properly ruled that the defendant could be cross-examined regarding matters bearing on his loyalty, helpfulness, or concern toward Dowdy, although he could not be cross-examined regarding the Urell or Church killings.\n\nH. Lack of Requirement That Jury Return Written Findings\n\nDefendant contends that the trial court's failure to require the jury to make written findings regarding the truth of the alleged aggravating circumstances and other determinations implicit in its sentencing choice violated his rights under the Fifth, Sixth, Eighth, and Fourteenth Amendments to the federal Constitution. We reject his contention; written findings disclosing the reasons for the jury's penalty determination are not required. (People v. Belmontes, supra, 45 Cal. 3d 744, 805; see also Harris v. Pulley (9th Cir. 1982) 692 F.2d 1189, 1195-1196, vacated and remanded on other grounds, Pulley v. Harris (1984) 465 U.S. 37 [79 L.Ed.2d 29, 104 S.Ct. 871].)\n\nI. Prosecutor's Alleged Allusion to Penalty Phase During Guilt Phase Opening Statement\n\nDefendant complains that impropriety in the prosecutor's guilt phase opening statement tainted the jury's penalty determination. Near the\n\nend of his statement, after outlining what he expected the evidence to prove, the prosecutor said: \"Based on that evidence, ladies and gentlemen, at the end of the guilt phase, I will ask you to find Curtis Fauber guilty of first degree murder.\" Defendant asserts that the use of the words \"guilt phase\" implied that there inevitably would be a penalty phase, that the guilt phase was merely a formality. Defendant waived the point by failure to object. (People v. Green, supra, 27 Cal. 3d 1, 27.) In any event, we find it meritless. Nothing in the prosecutor's statement remotely suggested that a verdict of guilt was a foregone Conclusion. And, after voir dire, the jurors were well inured to the concept that the initial part of any capital case is called the guilt phase.\n\nJ. Prosecutor's Use of Chart During Penalty Phase Argument\n\nCiting People v. Brown (1985) 40 Cal. 3d 512 [220 Cal. Rptr. 637, 709 P.2d 440], defendant contends his constitutional rights were violated by the prosecutor's use of a chart during penalty phase closing argument.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e The chart graphically set forth the various statutory categories of murder, with a\n\nline separating those for which the death penalty is legally unavailable from those for which it is legally available, and listed aggravating and mitigating factors. The prosecutor drew a second line through the section of the chart depicting first degree murders with special circumstances, to separate cases in which he argued the death penalty would be appropriate from those in which it would be legally available but inappropriate.\n\nThe prosecutor argued that the jury's function was to consider the circumstances of the Urell crime, the other-crimes evidence adduced at the penalty phase if it believed such evidence proved defendant's guilt beyond a reasonable doubt, and the defendant's background. From all of that information, the prosecutor stated, the jury was to decide the appropriate penalty.\n\nDefendant complains that the very use of a chart implied that scales and lines should be used in determining penalty, and that the process is one of numerical computation rather than evaluation and judgment. We disagree. Taking the argument as a whole, we find it readily apparent that the prosecutor took care to avoid any such mechanistic approaches to the sentencing decision. Over and over, he spoke of the necessity of considering all relevant factors. Repeatedly he emphasized the individual, subjective nature of the penalty determination. Defendant isolates the prosecutor's exhortation to \"subtract out the mitigating from the aggravating and see where you end up on this chart,\" claiming the jury must have been misled. The language he cites, however, was immediately followed by reference to the standard embodied in section 190.3 (\"And if you find that the aggravating factors substantially outweigh the mitigating factors, then you may impose the death penalty.\") and by a reminder that the law does not mandate\n\nthe imposition of death (\"But again, even that's discretionary. You don't have to.\"). The prosecutor's argument was not erroneous under People v. Brown, supra, 40 Cal. 3d 512, or any other decision cited to us.\n\nK. Claimed Boyd Error\n\nDefendant contends that the jury was improperly permitted to consider nonstatutory aggravating evidence. (People v. Boyd (1985) 38 Cal. 3d 762, 775 [215 Cal. Rptr. 1, 700 P.2d 782].) The prosecutor alleged and presented evidence of three assaults by defendant on Kim Dowdy. The jury was instructed that \"Evidence has been introduced for the purpose of showing that the defendant committed the following criminal activity:\n\n\"\n\n\"(3) In April 1986, he did assault and threaten Kim Dowdy with a gun;\n\n\"\n\n\"(5) On or about May 14, 1986, he did assault and threaten Kim Dowdy with a knife ...\"\n\nDefendant points out that, to be admissible under section 190.3, factor (b), evidence must show conduct that both violates a criminal statute and involves force or violence. (People v. Belmontes, supra, 45 Cal. 3d 744 at pp. 808-809.) He complains these instructions required only a finding of threats to Kim Dowdy, not a violation of a penal statute. This, he urges, deprived him of protections under the Fifth, Sixth, Eighth, and Fourteenth Amendments.\n\nDefendant misreads the instructions. Quite plainly, they contemplate a finding that defendant both assaulted and threatened Kim Dowdy. They did not allow mere threats to be considered in aggravation. The instructions recited the specific assaults alleged in aggravation, directing the jury not to consider any evidence of any criminal activity, other than that enumerated, as an aggravating factor. Accordingly, the instructions could not have misled the jury into considering additional threatening conduct not amounting to a violation of a penal statute.\n\nDefendant also notes that the jury heard testimony by Tony Maestas, Kim Dowdy's uncle, relating defendant's threats against Kim and her family; he argues the testimony was hearsay and should have been excluded, and that trial counsel was ineffective in not objecting to its admission. Further, he\n\ncontends the instructions improperly told the jury to consider those threats as aggravating evidence. We reject the contentions. Since defendant's threats were admissions by a party, the hearsay rule would not require their exclusion. (Evid. Code, § 1220.) And, as noted above, the jury was instructed not to consider in aggravation any criminal conduct other than the enumerated assaults and murders.\n\nL. CALJIC No. 2.11.5\n\nDefendant contends that the trial court erred in instructing the jury with a modified version of CALJIC No. 2.11.5 at the penalty phase.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e As given, the instruction read as follows: \"There has been evidence in this case indicating that a person other than the defendant was or may have been involved in the criminal activity which it is alleged that the defendant committed. [P] You must not discuss or give any consideration as to why the other person is not being prosecuted or whether he has or will be prosecuted.\" As the accompanying use note cautions, this instruction should not be given when the person to whom it refers is a witness; alternatively, a limiting instruction may be appropriate to eliminate any possible confusion as to which person is referred to. Defendant contends that the giving of this instruction was error, as it misled the jury into believing that it could not consider the fact that Buckley was not being prosecuted for the Church killing in assessing his credibility.\n\nWe do not believe the jury could have been misled. The instruction was directed at Caldwell's involvement in the murder of David Church. To accept defendant's contention that the jury might have understood the instruction as applying to Buckley, we would have to find that it ignored the court's instructions on accomplice testimony and credibility, and disregarded counsel's efforts to discredit Buckley in his closing argument. (People v. Belmontes, supra, 45 Cal. 3d at p. 783; see also People v. Sully (1991) 53 Cal. 3d 1195, 1218- 1219 [283 Cal. Rptr. 144, 812 P.2d 163].) Reading the instructions as a whole, we do not believe a reasonable juror would have understood them in the way defendant suggests.\n\nM. Refusal of Instructions Requested by Defense\n\n1. Refusal of Instruction on Lingering Doubt\n\nCiting People v. Terry (1964) 61 Cal. 2d 137 [37 Cal. Rptr. 605, 390 P.2d 381], defendant proposed that the jury be instructed as follows: \"Possible innocence is a mitigating factor which you may consider in determining\n\nthe appropriate penalty in this case. You are permitted to demand a greater degree of certainty of guilt for the imposition of the death penalty. Therefore, any lingering doubt you may have concerning the guilt of the Defendant may be considered by you as a mitigating factor upon which to base a sentence less than death.\" The trial court refused to give the requested instruction, but commented that \"this is appropriate argument.\" Defendant contends that the refusal to give his lingering doubt instruction violated his rights to due process of law, to protection against cruel and unusual punishment, to freedom from a death sentence that is arbitrarily and unreliably imposed, and to trial by a fair and impartial jury.\n\nIn People v. Cox (1991) 53 Cal. 3d 618 [280 Cal. Rptr. 692, 809 P.2d 351], we concluded that while a defendant may not be precluded from offering evidence on or arguing the relevance of lingering doubt in mitigation at the penalty phase, neither the Eighth and Fourteenth Amendments to the federal Constitution nor the California Constitution require that the jury be instructed to consider residual doubt as to the extent of defendant's participation in the offense, except as statutorily provided. (53 Cal. 3d at p. 677.) We noted that our holding in People v. Terry, supra, 61 Cal. 2d 137, on which defendant here relies, neither imposed nor contemplated an obligation to instruct on lingering doubt. \" Terry established no constitutional mandate to do so; and defendant offers no rationale for interpreting our state guaranties any more stringently than comparable federal provisions.\" (People v. Cox, supra, 53 Cal. 3d at p. 678.) We did, however, observe that \"[a]s a matter of statutory mandate, the court must charge the jury 'on any points of law pertinent to the issue, if requested' [citations]; thus, it may be required to give a properly formulated lingering doubt instruction when warranted by the evidence.\" (People v. Cox, supra, 53 Cal. 3d at p. 678, fn. 20.) We rejected the defendant's proffered instruction in Cox because it erroneously prescribed that the jury evaluate lingering doubt in a particular manner. () Assuming for the sake of argument that defendant's proffered instruction suffered no similar infirmity, we are still unable to conclude that the court's refusal to give the proffered instruction caused prejudice. Trial counsel did not argue that the jury should base its decision on any residual doubt as to defendant's guilt of the murder of Urell. In fact, counsel--perhaps mindful of the pitfalls of lingering doubt arguments (see People v. Webster (1991) 54 Cal. 3d 411, 455 [285 Cal. Rptr. 31, 814 P.2d 1273] [\" 'Lingering doubt' arguments are often unwise, for they risk antagonizing a jury that has already found defendant guilty.\"])--twice specifically stated that that issue had already been decided. Even so, without comment and without objection, he read the text of his proposed lingering doubt instruction to the jury. Under these circumstances, we do not believe defendant would have derived any additional benefit had the requested instruction been given.\n\n2. Refusal of Instruction on Specific Mitigating Facts.\n\nDefendant contends the trial court violated his rights under the Fifth, Sixth, Eighth, and Fourteenth Amendments to the federal Constitution by refusing a special jury instruction he proffered. The instruction read as follows: \"Defendant request [ sic ] that added to the mitigating factors in CALJIC 8.84.1: [P] 1. Defendant's loving family ties. [P] 2. Personal difficulties or deprivations. [P] 3. His waiver of extradition to come to California to stand trial. [P] 4. His caring and sensitivity towards his friends. [P] 5. The absence of any criminal conduct prior to or after the incidences [ sic ] alleged in this trial.\" The trial court instead instructed the jury in the language of CALJIC No. 8.84.1.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e The trial court also read the following instructions requested by defendant:\n\n\"Mercy, pity and sympathy for the defendant are proper considerations in determining the penalty in this case, should you find them to be warranted under the circumstances. [P] Evidence of mitigating factors related solely to the defendant's background and character must be carefully weighed and may serve as a basis for a sentence less than death.\"\n\nAlthough the court was not obliged to do so, it also read the following special instructions requested by defendant:\n\n\"In determining the penalty in this case, you are obligated to weigh and consider evidence that the defendant, quote, 'was a loving and helpful man in his relationships with his relatives and friends,' end quote. Such evidence is proper for your consideration as to whether or not you determine to spare the defendant's life.\"\n\nThe trial court did not err in refusing to give defendant's special instruction. In large part it duplicated other instructions given (People v. Wright (1988) 45 Cal. 3d 1126, 1134 [248 Cal. Rptr. 600, 755 P.2d 1049]); it was also flawed in that it was argumentative, i.e., it merely highlighted certain aspects\n\nof the evidence without further illuminating the legal standards at issue (People v. Howard (1988) 44 Cal. 3d 375, 442 [243 Cal. Rptr. 842, 749 P.2d 279]; see also People v. Benson (1990) 52 Cal. 3d 754, 804-806 [276 Cal. Rptr. 827, 802 P.2d 330]; People v. Gordon (1990) 50 Cal. 3d 1223, 1276-1277 [270 Cal. Rptr. 451, 792 P.2d 251]). The instructions given, in our view, adequately covered the defense theory and provided sufficient guidance to the jury.\n\nTo the extent that defendant is complaining that inapplicable sentencing factors were not deleted from the jury instructions, we have already resolved that issue unfavorably to him. (People v. Bell (1989) 49 Cal. 3d 502, 551 [262 Cal. Rptr. 1, 778 P.2d 129].)\n\nN. Automatic Application to Modify Verdict\n\nDefendant urges his sentence be reversed because the trial court read and considered materials outside the record before denying his automatic application to modify the verdict. (§ 190.4, subd. (e).) The record shows that the hearing on the application was held on May 16, 1988. The probation report had previously been filed. Although the trial court did not expressly state it had read the probation report before ruling on the application to modify the verdict, the record supports the inference that it had done so. The trial court had certainly read the letters attached to the report (most of which were written in support of defendant, although two had been submitted by a relative and friends of David Church).\n\nThe trial court must decide the application for modification of the verdict on the basis of the evidence--which, of course, does not include the probation report. (§ 190.4, subd. (e); People v. Williams (1988) 45 Cal. 3d 1268, 1329 [248 Cal. Rptr. 834, 756 P.2d 221].) Consideration of the probation report or victim-impact statements before ruling on the application for modification is, therefore, error. (People v. Lewis (1990) 50 Cal. 3d 262, 287 [266 Cal. Rptr. 834, 786 P.2d 892].) But even when the trial court has considered such extraneous information in ruling on the application, we assume there has been no improper influence on the court, absent specific evidence to the contrary. (People v. Bacigalupo (1991) 1 Cal. 4th 103, 150 [2 Cal. Rptr. 2d 335, 820 P.2d 559]; People v. Adcox, supra, 47 Cal. 3d at p. 274.)\n\nThe record in this case demonstrates that the trial court's review of the extraneous information resulted in no prejudice to defendant. The court indicated through its remarks that it was well aware section 190.4, subdivision (e), required that the determination be based on the evidence and guided by the aggravating and mitigating circumstances referred to in section 190.3.\n\nFrom the court's statement of reasons for denying modification, we find it clear that the court gave greatest weight to the evidence of the Urell murder and the Church and Dowdy killings. Acknowledging the feelings expressed in the probation report and the letters from Church's relative and friends, the court said, \"I'm persuaded by the evidence that I heard more than I am by letters from family members, comments from family members on the one side and letters in support of Mr. Fauber on the other.\" Defendant complains that this statement indicates the trial court was in fact influenced by the probation report and letters. Although the remark indicates some small quantum of improper influence, we find no reasonable possibility that the trial court's error affected its decision. (People v. Benson, supra, 52 Cal. 3d at p. 812.)\n\nDefendant complains that, even after the United States Supreme Court's decision in Payne v. Tennessee (1991) 501 U.S. [115 L.Ed.2d 720, 111 S.Ct. 2597], which overruled the bar to presentation of certain forms of victim-impact evidence at the penalty phase recognized in Booth v. Maryland (1987) 482 U.S. 496 [96 L.Ed.2d 440, 107 S.Ct. 2529] and South Carolina v. Gathers (1989) 490 U.S. 805 [104 L.Ed.2d 876, 109 S.Ct. 2207], use of the opinions of victims' families regarding punishment in a verdict modification proceeding violates the Eighth Amendment. We disagree. Even if we were able to say, on this record, that the trial court \"used\" the opinions of the victims' families, \"the broad holding of Booth and Gathers does not extend to proceedings relating to the application for modification of a verdict of death under section 190.4(e).\" (People v. Benson, supra, 52 Cal. 3d at p. 812.)\n\nO. Reliability of Penalty\n\nFinally, defendant complains that the process by which he was sentenced to death was arbitrary and unreliable, violating the Eighth Amendment of the Federal Constitution. In essence, he argues that the prosecutor acted arbitrarily in seeking the death penalty against him rather than Brian Buckley, and that a conviction and sentence based largely on the bargained-for testimony of a coperpetrator is constitutionally unreliable and cannot stand. He also reiterates his claims that various errors occurring in both phases of trial undermined the validity of his sentence. We have rejected his claims of prejudicial error elsewhere in this opinion. We here reject defendant's contention that the disparity between his sentence and Buckley's, in itself, or the fact that Buckley testified pursuant to agreement, reflects an arbitrary application of the law. That Buckley received a lesser sentence cannot mitigate the gravity of defendant's wrongdoing. (People v. Belmontes, supra, 45 Cal. 3d at pp. 811-812.) The jury in this case heard the evidence of defendant's crimes and determined that in light of his background and his\n\nrole in the murder of Thomas Urell death was the appropriate penalty. He received the individualized consideration guaranteed him by the Eighth Amendment. We find no constitutional infirmity in the process by which his sentence was imposed.\n\nDisposition\n\nThe judgment is affirmed.\n\nLucas, C. J., Kennard, J., Arabian, J., Baxter, J., and George, J., concurred.\n\nDisposition\n\nThe judgment is affirmed.\n\nI concur in the judgment. After review, I have found no reversible error or other defect.\n\nI write separately because I believe that the trial court may have erred when it granted the People's motion to exclude evidence of plea bargaining at the penalty phase--specifically, evidence that they had offered, and defendant had rejected, an opportunity to plead guilty to first degree murder under special circumstances and receive a sentence of life imprisonment without possibility of parole in exchange for testimony against Brian Buckley and Christopher Caldwell. The court found the People's offer irrelevant in and of itself. By contrast, it found defendant's rejection relevant, but substantially more prejudicial than probative. In my view, each determination is open to question.\n\nTo begin with, the People's offer of the plea bargain is arguably relevant: it bears on the circumstances of the offense broadly defined. This Conclusion is plainly consistent with the Eighth Amendment of the Federal Constitution. It appears practically compelled under Penal Code section 190.3. The statutory provision declares that evidence of the \"circumstances\" of the offense are admissible at the penalty phase. In People v. Edwards (1991) 54 Cal. 3d 787, 833 [1 Cal. Rptr. 2d 696, 819 P.2d 436], this court held that the scope of the term extends beyond the \"immediate temporal and spatial\" context of the crime to \" '[t]hat which surrounds [it] materially, morally, or logically' ....\" A plea bargain involving a crime must \"logically surround\" the crime. The proposition is virtually tautological: a Disposition concerning an offense concerns the offense. To be sure, the evidence does not seem strongly relevant. But it does seem relevant to some degree.\n\nNext, defendant's rejection of the plea bargain is arguably not substantially more prejudicial than probative. As the trial court itself recognized, the evidence is indeed relevant: in conjunction with testimony defendant proffered on his reasons for refusing the offer, it has some tendency to show his character for loyalty to those he considered his friends. Character, of course,\n\nis a material issue in mitigation under Penal Code section 190.3 (see, e.g., People v. Boyd (1985) 38 Cal. 3d 762, 772-776 [215 Cal. Rptr. 1, 700 P.2d 782]) and the Eighth Amendment (see, e.g., Skipper v. South Carolina (1986) 476 U.S. 1, 4 [90 L.Ed.2d 1, 6-7, 106 S.Ct. 1669]). This evidence, too, does not seem strongly relevant. But neither does it appear particularly mischievous. Therefore, it cannot be deemed more prejudicial than probative--and certainly not substantially so.\n\nAlthough the trial court may have erred under both California law and the United States Constitution when it granted the People's motion to exclude the evidence of plea bargaining, reversal would not be required. The actual--and proper--focus of the penalty phase was defendant and his capital crime. As noted, the evidence in question does not seem strongly relevant. Hence, it would have added little, if anything, of marginal value. Therefore, any error could not have affected the outcome within any reasonable possibility, and must be held harmless beyond a reasonable doubt. (People v. Ashmus (1991) 54 Cal. 3d 932, 965 [2 Cal. Rptr. 2d 112, 820 P.2d 214] [stating the standards for prejudice for federal constitutional error and for state-law error bearing on penalty in a capital case].)\n\nIn Conclusion, having found no reversible error or other defect, I concur in the judgment.\n\nAppellant's petition for a rehearing was denied September 3, 1992.\n\n\u003cspan class=\"fn\"\u003e1. Further unspecified statutory references are to the Penal Code.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Jury selection began on November 12, one day after the media coverage submitted by defendant began.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. One additional prospective juror, likewise excused, stated he learned of defendant's confession from friends of the victim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. \" 'This letter is to memorialize the District Attorney's position on the above-numbered case against your client, Brian A. Buckley. It is based on our recent conversation regarding a possible agreement. \" 'One, Mr. Buckley is charged in the above-entitled complaint as follows: Count 1, murder of Thomas C. Urell on July 16, 1986, in violation of Section 187 of the Penal Code. \" 'Count 2, robbery of Thomas C. Urell on July 16, 1986, in violation of Section 211 of the Penal Code. \" 'Count 3, burglary of the residence of Thomas C. Urell on July 16, 1986, in violation of Section 459 of the Penal Code within the meaning of Sections 460.1, 460(2) and 667 of the Penal Code. \" 'Item two: The District Attorney's office offers to move the Court to declare the murder to be murder in the second degree. In turn, Mr. Buckley must testify truthfully as a witness against Curtis Fauber and testify truthfully as a witness in any proceedings concerning Christopher A. Caldwell. \" 'Item three: Before any agreement can be reached, Mr. Buckley must submit to a preliminary interview by members of the District Attorney's office to assess his credibility. \" 'In the event that the District Attorney's office decides that Mr. Buckley is not telling the truth, then no agreement will be reached and the above-entitled case will proceed to trial. \" 'Any statements by Mr. Buckley during this preliminary interview, of course, will not be used against him in any subsequent trial. \" 'In the event that the District Attorney's office decides that Mr. Buckley is telling the truth, the District Attorney's office will enter into an agreement with itemized terms 4 through 7 as set out below. \" 'Item four: Mr. Buckley will plead guilty to Count 1 in the above- entitled information. He will waive time for sentencing, and his sentencing will be continued until the completion of both the trial of Curtis Fauber and the preliminary hearing for Christopher A. Caldwell. \" 'Mr. Buckley'--I'm sorry. 'Item five: Mr. Buckley will make himself available and will testify truthfully in any proceedings in the prosecution against Curtis L. Fauber and in any proceedings in the prosecution against Christopher A. Caldwell. \" 'In the event of a dispute, the truthfulness of Mr. Buckley's testimony will be determined by the trial Judges who preside over these hearings. \" 'Following the Conclusion of the trial against Curtis L. Fauber and the preliminary hearing against Christopher A. Caldwell, Mr. Buckley will be sentenced on case number'--that's left blank. \" 'If Mr. Buckley has complied with the terms of this agreement as fully as possible as of that date, the District Attorney's office will move the Court to declare the murder to be murder in the second degree, and Mr. Buckley will be sentenced on that charge. At that time, the remaining counts will be dismissed. \" 'Mr. Buckley will remain obligated to testify in the remaining proceedings as specified above. \" 'Item seven: If, however'--if, however, Mr. Buckley has not complied with the terms of this agreement, the District Attorney's office will not be bound to move the Court to declare the murder to be murder in the second degree nor will the District Attorney's office be bound to dismiss the other counts. \" 'At that time, Mr. Buckley will be allowed to withdraw his plea and case number'--left blank--'will proceed to trial. \" 'As stated in Item five, the trial Judges will hear Mr. Buckley's testimony in the various proceedings, will make any necessary findings as to his truthfulness. \" 'This offer expires at the close of the People's case in the trial against Curtis L. Fauber, approximately January 8, 1988.' \"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. We reject the contention, raised in defendant's reply brief, that CALJIC No. 2.20 is improper because it states that the jury may consider \"[t]he existence or nonexistence of a bias, interest, or other motive\" and \"[t]he attitude of the witness toward this action or toward the giving of testimony.\" Defendant argues that the instruction permits the jury to consider extrajudicial facts. However, bias is simply another fact subject to proof. We further reject his contention that CALJIC No. 2.20 was faulty because it did not prevent the jury from relying on the prosecutor and the trial court to assess Buckley's credibility; as we concluded above, the plea agreement could not reasonably have led the jury into such reliance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Defendant contends that the reading of Buckley's plea agreement tainted the penalty phase as well. Because the reading of the plea agreement in the guilt phase was not prejudicial, and because Buckley testified again pursuant to its terms at the penalty phase, it follows that the prosecutor's reference to it during penalty phase argument did not violate defendant's Eighth Amendment rights.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Defendant also observes that after testifying against Christopher Caldwell in the latter's preliminary hearing, Buckley refused to testify at Caldwell's trial, citing his Fifth Amendment privilege against self- incrimination. (People v. Caldwell (Sept. 7, 1989) B036699 [nonpub. opn.].) Notably, however, before asserting his Fifth Amendment privilege, Buckley indicated his willingness to testify if his name could be kept out of the newspapers and elected to assert the privilege only after the trial court declined to issue a \"gag order\" to protect Buckley's privacy. The Court of Appeal, in affirming Caldwell's conviction over a claim of error in the admission of Buckley's preliminary hearing testimony, concluded there was a possibility Buckley's testimony could have implicated him in the Church killing. We need not revisit the validity of Buckley's claim of privilege, however, since the record in the present case does not, as discussed above, support the Conclusion that Buckley feared prosecution for Church's murder.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Defendant also contends it was inaccurate to argue, as the prosecutor did at the penalty phase, that Buckley had no motive to lie, because Buckley would have been subject to perjury charges if he recanted any prior testimony. We rejected a similar argument in People v. Allen (1986) 42 Cal. 3d 1222, 1254 [232 Cal. Rptr. 849, 729 P.2d 115], holding that trial testimony pursuant to a plea agreement conditioned on truthful testimony is not coerced or unreliable simply because a witness who recants his preliminary hearing testimony at trial is subject to perjury charges. Assuming the witness lied at the preliminary hearing, we reasoned, any pressure on the witness to repeat the lie at trial stemmed from his own conduct in giving perjured testimony, rather than the plea agreement. () Here, if Buckley had lied in his guilt phase testimony, his motive to repeat the lie in the penalty phase would likewise be attributable to his own conduct, rather than the plea agreement. We also reject defendant's contention that, at the start of the penalty phase, the prosecutor \"preconditioned\" the jury to believe Buckley's penalty phase testimony by thanking the jury for its guilt phase verdict. Any potential harm resulting from the remark was cured by the court's admonition to the jury to disregard it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Wiksell testified that only the final one-quarter or one-third of the interview was taped.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. We also disagree with defendant's contention that the prosecution acted in bad faith in not taping the entire Buckley interview. The trial court found that the procedure employed in this investigation was reasonable, and the record supports that Conclusion. Assuming, without deciding, that the rule of Arizona v. Youngblood, supra, 488 U.S. 51, applies to statements of material witnesses (see People v. Valencia (1990) 218 Cal. App. 3d 808, 823 [267 Cal. Rptr. 257]), defendant has not established the necessary predicate for relief.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Section 1111 provides in part that \"[a] conviction cannot be had upon the testimony of an accomplice unless it be corroborated by such other evidence as shall tend to connect the defendant with the commission of the offense; and the corroboration is not sufficient if it merely shows the commission of the offense or the circumstances thereof.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Section 32 defines accessory as \"[e]very person who, after a felony has been committed, harbors, conceals or aids a principal in such felony, with the intent that said principal may avoid or escape from arrest, trial, conviction or punishment, having knowledge that said principal has committed such felony or has been charged with such felony or convicted thereof ....\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. The fact that the jury found defendant personally used an ax in committing the crimes further suggests that it could not have interpreted the instruction in the way defendant claims. (§ 12022, subd. (b).)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. At the time of trial in this case, section 190.9 provided in relevant part as follows: \"(a) In any case in which a death sentence may be imposed, all proceedings conducted after the effective date of this section in the Justice, municipal, and superior courts, including proceedings in chambers, shall be conducted on the record with a court reporter present.\" (Former § 190.9, Stats. 1987, ch. 468, § 1, pp. 1709-1710, amended by Stats. 1989, ch. 379, § 2.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Section 1128 provides in relevant part, \"After hearing the charge, the jury may either decide in court or may retire for deliberation. If they do not agree without retiring for deliberation, an officer must be sworn to keep them together for deliberation in some private and convenient place, and, during such deliberation, not to permit any person to speak to or communicate with them, nor to do so himself, unless by order of the court, or to ask them whether they have agreed upon a verdict, and to return them into court when they have so agreed, or when ordered by the court.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Section 190.4, subdivision (c), provides in relevant part as follows: \"If the trier of fact which convicted the defendant of a crime for which he may be subject to the death penalty was a jury, the same jury shall consider ... the penalty to be applied, unless for good cause shown the court discharges that jury in which case a new jury shall be drawn. The court shall state facts in support of the finding of good cause upon the record and cause them to be entered into the minutes.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. Appellate counsel suggests that trial counsel's failure to conduct voir dire in light of the Buckley plea bargain, if knowing, was ineffective assistance of counsel. Due to the entirely speculative nature of any detriment to defendant resulting from trial counsel's alleged shortcoming, he fails to show entitlement to relief. (People v. Stankewitz (1990) 51 Cal. 3d 72, 113 [270 Cal. Rptr. 817, 793 P.2d 23].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. There is no merit to defendant's unsupported contentions that the admission of other-crimes evidence in the penalty phase denied him his rights to due process of law, to a speedy trial by a fair and impartial jury, to protection against an arbitrarily and unreliably imposed sentence of death, and to a trial by a jury of the vicinage of the New Mexico offenses. Nor is there merit to his claim that the procedures employed in this trial violated the constitutional prohibitions against double jeopardy and cruel and unusual punishment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The trial court rejected the prosecutor's alternative theory of admissibility--that the statements were made by coconspirators--because it concluded that the prosecution had failed to produce independent evidence of a conspiracy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Defendant also urges that, to the extent McCormick testified to statements that might have been made by Caldwell, he was denied his Sixth Amendment rights of confrontation and cross-examination. Because defendant cannot identify any statement that McCormick attributed to Caldwell, his claim lacks merit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The trial court instructed the jury as follows: \"A statement made by someone other than the defendant may be an adopted admission of the defendant. An adopted admission is a statement which the defendant, with knowledge of the content thereof, has by words or other conduct manifested his adoption or belief in the truth thereof. [P] You are the exclusive Judges as to whether an adopted admission was made and, if so, whether such admission is true in whole or in part. [P] If you should find that the statement was not made, you must reject it. If you find that it is true in whole or in part, you may consider that part which you find to be true. [P] Evidence of an adopted admission should be viewed with caution.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. He further asserts it provides some insight into the circumstances of the offense, but fails to explain how this might be so. Additionally, he contends his refusal points up the difference between his character and Buckley's. Penalty phase deliberations, however, do not involve a comparison of coperpetrators or their sentences. (See People v. Johnson (1989) 47 Cal. 3d 1194, 1249 [255 Cal. Rptr. 569, 767 P.2d 1047] [\"The focus in a penalty phase trial of a capital case is on the character and record of the individual offender.\"].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Defendant compares his refusal of the prosecutor's plea offer with the prosecutor's refusal of defense witness Frisilone's offers to testify against defendants in other cases. He claims that if the latter was relevant to show Frisilone's bias (as the trial court instructed the jury) and was not excessively confusing when a limiting instruction was given, so too was defendant's refusal of the plea offer relevant to show his character, and not unduly confusing. The comparison is unpersuasive. The fact that a prosecutor denies a would-be witness the expected benefits of proprosecution testimony is relevant because the denial makes it more likely than otherwise would be the case that the witness will be biased against the prosecution. (Evid. Code, § 780, subd. (f).) The mere fact that a defendant refuses a plea offer is not similarly probative of any proposition related to mitigation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. We cannot agree with defendant that the prosecutor's use of a chart, listing various types of murders for which the death penalty may or may not be appropriate, improperly implied that section 190.3 factors are to be counted. (See Discussion, post, at p. 860 et seq.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. The chart itself was not made a part of the record, and the parties could not prepare a settled statement regarding its contents because the trial Judge never saw the chart. However, the prosecutor referred in some detail to its contents during his argument. The relevant portions of the argument are as follows: \"Now, let me start with some guidelines. In 1977 and 1978, the People of the State of California voted that the death penalty was an appropriate penalty for some crimes. That initiative was later enacted into law and the law provides that the death penalty is appropriate for first degree murder with special circumstances. The law provides also that the death penalty is not appropriate for murders less than that. Second degree murder, for instance, is not appropriate for the death penalty. First degree murder without special circumstances does not have the death penalty available. Only murders committed with special circumstances. \"And those crimes have the death penalty available, but the law further provides that the death penalty is not always appropriate even for murders with special circumstances. For instance, I think you would all agree that a young man committing a robbery of a supermarket who panics when the clerk goes for a gun and kills the clerk, that that probably would not fall into the--into the type of crimes where the death penalty would be appropriate even though it's available. \"So to graphically demonstrate this, I have drawn a little chart here. And this line in the middle indicates that point at which the death penalty is available. All of the crimes above this line would be crimes where the death penalty is available. And it starts with murder special circumstances. Crimes below this line are crimes where the death penalty is not available. By law you could not impose the death penalty. \"First degree murder. Premeditated deliberate murder without special circumstances does not have the death penalty available. Second degree murder is a notch below that and the death penalty is not available for that crime. \" Now, as I said, that even if the death penalty is available for murders with special circumstance, it's not always appropriate. Now, I put that line up here somewhere, that all murders with special circumstances above this line, the death penalty is appropriate, and below this line it's not appropriate. And over here on the left I have drawn--I have written out aggravating factors pointing toward the top and mitigating factors pointing toward the bottom. \"What the law wants you to do is to consider all of these aggravating factors and consider all these mitigating factors and subtract out the mitigating from the aggravating and see where you end up on this chart. And if you find that the aggravating factors substantially outweigh the mitigating factors, then you may impose the death penalty. But again, even that's discretionary. You don't have to. \"Now, I think that there are obviously people in history that are way up here on the chart way out of sight. Genghis Khan or Doctor Mengele or somebody like that. But in this courtroom, you are to decide whether the death penalty is appropriate for Curtis Fauber and you are to consider the crimes--the crime that he was convicted of in the guilt phase, the circumstances of that crime. You are to consider the crimes that you heard about in the penalty phase if you find them true beyond a reasonable doubt, and you are to also consider all of this background about the defendant. So you are making your decision based on the crime itself and the background of the defendant. \" Now, this line up here is obviously a very subjective thing. Each of you will have a different point in your mind where you feel that a particular defendant and a particular crime deserves the death penalty, that the death penalty is appropriate. Not all of you will have that same point. But when we reach that point where all of you agree that a particular defendant with a particular background and a particular crime deserved the death penalty, then you will be speaking as the moral conscience of the community for that particular situation.\" (Italics added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Defendant also contends it was error to read CALJIC No. 2.11.5 to the jury at the guilt phase; however, a search of the record reveals that instruction was not given at the guilt phase.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Pertinent portions of CALJIC No. 8.84.1, as read to the jury in this case, provide as follows: \"In determining which penalty is to be imposed on the defendant, you shall consider all of the evidence which has been received during any part of the trial of this case except as you may be hereinafter instructed. \"You shall consider, take into account and be guided by the following factors, if applicable: \" \"(k) Any other circumstance which extenuates the gravity of the crime even though it is not a legal excuse for the crime and any sympathetic or other aspect of the defendant's character or record that the defendant offers as a basis for a sentence less than death, whether or not related to the offense for which he is on trial. \"You must disregard any jury instruction given to you in the guilt or innocence phase of this trial which conflicts with this principle.\"\u003c/span\u003e\n\n",
    "body_length": 166200,
    "citedas": [
      "9 Cal. Rptr. 2d 24",
      "2 Cal. 4th 792",
      "831 P.2d 249"
    ],
    "attorneys": "L. Marshall Smith, under appointment by the Supreme Court, and Maureen DeMaio for Defendant and Appellant. Daniel E. Lungren, Attorney General, George Williamson, Chief Assistant Attorney General, Edward T. Fogel, Jr., Assistant Attorney General, John R. Gorey, William T. Harter and Pamela C. Hamanaka, Deputy Attorneys General, for Plaintiff and Respondent.",
    "category": [
      "36",
      "78"
    ],
    "judges": "Opinion by Panelli, J., with Lucas, C. J., Kennard, Arabian, Baxter and George, JJ., Concurring. Separate opinion by Mosk, J., Concurring in the judgment.",
    "citation_count": 12
  }
}
