{
  "id": "V6FbR2YBTlTomsSBYfU_",
  "document": {
    "title": "People v. Sanders",
    "full_title": "THE PEOPLE AND v. RONALD LEE SANDERS AND",
    "jurisdiction": "California Supreme Court",
    "date": "1990-09-27T00:00:00.000Z",
    "docket": "No. S004439, Crim. No. 22512",
    "body": "Ronald Lee Sanders was convicted of first degree murder, attempted murder, robbery, burglary, and attempted robbery. Two allegations that he was armed with a firearm were found true. The jury also found true four special circumstance allegations: the murder was committed while defendant was engaged in the commission or the attempted commission of the robbery and burglary (Pen. Code, § 190.2, subd. (a)(17)(i) \u0026 (vii));\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e the victim was intentionally killed to prevent her testimony in a criminal proceeding (§ 190.2, subd. (a)(10)); and the murder was especially heinous, atrocious and cruel (§ 190.2, subd. (a)(14)). After the penalty phase of the trial, the jury set the penalty at death. This appeal is automatic. (§ 1239, subd. (b).)\n\nFor the reasons stated below, we set aside the special circumstance findings based on the commission of a burglary and on the jury's conclusion that the murder was heinous, atrocious and cruel, but otherwise affirm the judgment in its entirety.\n\nI. Facts\n\nGuilt Phase\n\nIn 1981, Dale Boender and Janice Allen moved to Bakersfield from Oildale. Boender supported the couple by selling cocaine and marijuana. One of his customers was Brenda Maxwell, but he stopped selling to her because she owed him money from prior transactions. On the morning of January 21, 1981, Maxwell's aunt, Donna Thompson, and defendant Ronald Lee Sanders visited Maxwell. The three decided to rob Boender of drugs and money and agreed to the following plan: Maxwell would entice Boender to her home by claiming she had a friend who wanted to buy a large quantity of cocaine. When Boender arrived, defendant would knock him out and they would rob him. Defendant would then bind Boender with duct tape before leaving. According to their plan, defendant would similarly bind\n\nMaxwell so she would appear to also have been a victim. Thompson would arrive later to \"discover\" and free the pair.\n\nMaxwell's friend, Glen Blackford, was also visiting her at the time but was left in the living room while Maxwell, Thompson, and defendant planned the crime in the bedroom. When they returned to the living room after their planning session, Maxwell told Blackford \"[s]omething is going to happen [so] get out of here.\" Blackford and Thompson then left (as planned) and Maxwell placed several calls to Boender to arrange the deal.\n\nEnticed by the promise of a large cocaine sale, Boender and Allen drove to Maxwell's mobilehome. Allen entered the home and began to sit down next to Maxwell. As Boender stepped through the doorway, defendant emerged from the kitchen and began beating Boender with a two-foot long piece of a pool stick. A struggle ensued but Boender and Allen eventually managed to exit the mobilehome, at which point defendant fled. Boender and Allen then drove off, first to a friend's house but later to a hospital to attend to Boender's injuries. They stayed at a relative's home until Friday, January 23, 1981.\n\nMeanwhile, Thompson and defendant returned to Maxwell's mobilehome to discuss the aftermath of the botched robbery attempt. Maxwell was concerned that Boender would realize she had \"set him up,\" and defendant was worried Boender could identify him. The three drove to a house on Jefferson Street where defendant engaged the assistance of John Cebreros. The group then went to Thompson's house where Maxwell called mutual friends of hers and Boender's to tell them she had been robbed and raped so as to enhance her claim that she had been victimized along with Boender.\n\nOn Friday, Boender and Allen decided to return to Boender's apartment. They arrived in the afternoon and told Boender's two roommates, Haney and Weinman, about the earlier assault. Later, Boender and Allen met Boender's former roommate, George Littleton, at a bar; the three of them went to Littleton's apartment around 7 p.m. and shared a small bottle of wine. After shopping for groceries, Boender and Allen returned home. Haney and Weinman were gone for the evening.\n\nWhile Boender and Allen were preparing dinner, there was a knock at the door. Leaving Allen in the kitchen, Boender went to the front door and opened it, finding Cebreros and defendant standing there, the latter armed with a gun. Although he believed he had only seconds to live, Boender concentrated on their faces so he could remember them if he should see them again. Defendant spun Boender around and pushed him to the floor, face down. He felt someone's knee in his back and something pressed\n\nagainst his neck. Allen emerged from the kitchen and was also made to lie on the floor. Boender's glasses were ripped from his face and both he and Allen were bound and blindfolded.\n\nOne of the assailants demanded that Boender tell them where he kept his cocaine, and he directed them to Allen's purse. After he told them his money was in his shirt pocket, someone removed it. Boender heard the two assailants rummaging through the apartment but could not tell what was going on. After a few minutes, he was dragged to what seemed like his bedroom. He heard more footsteps, muffled talking, and more banging around the apartment. One of the assailants said he wanted to leave but the other said he wanted to stay. Boender then heard someone approach, felt a blow to the head, and recalled nothing further.\n\nBoender's roommates returned to the apartment in the early morning and discovered the apartment full of smoke. A search revealed food burning in the oven. On further investigation, they discovered Boender in his bedroom, lying in a pool of blood. After calling an ambulance, they noticed that the apartment was in disarray, there were spots of blood around, and a baggie of marijuana was missing. When Haney found Allen's body in his bedroom, he called the police.\n\nBoth Boender and Allen had been bound by lengths of electrical cord cut from Boender's vacuum cleaner. Allen sustained a fatal head wound which fractured her skull and lacerated her brain. Boender suffered a skull fracture but was conscious and semicoherent when police arrived. He was not questioned until the next day.\n\nHaney and Weinman told police about Boender's story of the attempted robbery two days earlier, prompting police to contact Maxwell. She falsely told police that Cebreros came to her home, forced her to call Boender, and then beat him up when he arrived. However, she gave them accurate descriptions of defendant and Cebreros as well as the address of the Jefferson Street house where defendant met Cebreros. From his hospital bed, Boender gave descriptions of defendant and Cebreros that matched Maxwell's descriptions.\n\nCebreros was arrested the next day in front of the Jefferson Street house. In his car, police found a gun similar to that which Boender described as the one used in the attempt to murder him. In Cebreros's boot, police found a baggie of marijuana which was identical to the one taken in the robbery. Both Maxwell and Boender positively identified Cebreros as one of the assailants.\n\nA few days later, Maxwell recanted her story and told police the truth about the bungled robbery attempt. She also told police about the duct tape defendant intended to use to bind Boender. Police found a roll of such tape in Maxwell's home and tests revealed defendant's fingerprints on it. He was arrested and positively identified by Boender in a photographic lineup later that week.\n\nDefendant and Cebreros were tried jointly and they presented an alibi defense. Three defense witnesses testified that on the night of the murder, both defendant and Cebreros were at the home of Cebreros's brother, Salvador, talking, playing chess, and drinking beer. There was also evidence from Boender's neighbors that although two men were seen outside Boender's apartment on the night of the murder, neither one looked like Cebreros or defendant. Finally, there was evidence that defendant had used Maxwell's roll of duct tape for an innocent purpose a few days earlier.\n\nDefendant's first trial ended in a mistrial when the jury could not reach a verdict. On retrial, both he and Cebreros were convicted on all counts. The prosecutor declined to seek the death penalty against Cebreros and he was sentenced to life without the possibility of parole.\n\nPenalty Phase\n\nThe prosecution produced several witnesses at the penalty phase who described five armed robberies defendant committed in Orange County in 1970. Although none of the witnesses could positively identify defendant at trial, a police expert testified that the fingerprints of the gunman in the five Orange County robberies matched defendant's fingerprints.\n\nJames Quinn testified that on October 1, 1970, he was working late at the Allstate Motel in Santa Ana when defendant and a crime partner robbed him at gunpoint. Thomas Ferguson testified that defendant, brandishing a revolver, robbed him on September 12, 1970, while Ferguson was employed as a clerk at the Station Liquor Store in Tustin. Defendant committed an armed robbery in the same establishment on November 20, 1970, this time robbing clerk Fred Turnbull.\n\nSammy Mitchell testified that he was working in Mitchell's Market in Tustin on October 6, 1970, when defendant robbed him at gunpoint. Defendant was finally arrested after this crime spree while fleeing from yet another armed robbery, this one occurring in a 7-Eleven convenience store, also in Tustin. Defendant confessed his guilt to all five robberies and the police officers to whom he confessed testified at the penalty phase. Defendant was sentenced to state prison and was granted parole in 1973.\n\nDefendant declined to present any evidence in mitigation or make a closing argument. The jury returned a verdict of death within a few hours.\n\nII. Discussion\n\nA. Jury Selection Issues\n\n1. Systematic Underrepresentation in the Jury Pool\n\nBefore trial, defendant moved to quash the petit jury, arguing that the manner in which Kern County assembled its master jury list violated his right to an impartial jury drawn from a fair cross-section of the community.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e In support, he presented evidence that he claimed demonstrated a prima facie case that Hispanics were systematically underrepresented in the jury pool. The trial court denied the motion, and defendant now renews the contention.\n\na. The Evidence Supporting the Motion to Quash\n\nAt the time of defendant's trial, Kern County assembled its master jury list by randomly drawing names from the county's voter registration list. Questionnaires were then sent to those chosen to determine eligibility to serve as jurors. There was no attempt to ensure that the ethnic composition of the group selected for jury service approximated that of the county as a whole. Although there were plans in the future to use names of those holding driver's licenses to supplement those names from the voter registration lists when assembling the master jury list, such plans had not yet been implemented at the time defendant was tried.\n\nThe parties stipulated that defendant could rely, in support of his motion to quash, on the expert testimony presented in three other recent Kern County Superior Court cases. (See People v. Cantu, Nos. 21891, 22229 (Cantu); People v. Robinson, No. 21518 (Robinson); People v. Streeter, Nos. 22346, 22056, 21910, 21368 (Streeter).) Dr. Newell, an expert in psychology and statistics, testified in the Cantu and Robinson cases (and his testimony was admitted in the Streeter case). He stated that he had scrutinized the available data from the 1980 census and had analyzed jury panels in Kern County between October 1980 and February 1981, as well as panels in May 1981. In Cantu, he testified that the government census reported\n\nthat Kern County was 21.59 percent Hispanic, and estimated that 17.76 percent of the county was both Hispanic and at least 18 years old, i.e., presumptively jury eligible.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e To determine the ethnic makeup of the group summoned for jury duty during the period in question, Dr. Newell scrutinized the master jury list, presumably noting those with Spanish surnames. He also conducted telephone surveys to confirm the number of those on the list who were Hispanic. He concluded that 8.3 percent of those appearing for jury duty were Hispanic.\n\nIn the Robinson case a few months later, Dr. Newell presented even more refined statistics. From the Immigration and Naturalization Service, he obtained the information that 14,387 Hispanic resident aliens resided in Kern County in 1978. (Such evidence was not available for 1980.) Deducting that number from the total number of Hispanics in the county (based on 1980 census figures), Dr. Newell opined that 19.81 percent of Kern County residents were Hispanic. (See fn. 4.) Using the same methodology as in the Cantu case (see fn. 3, ante), he estimated that 16.3 percent of the county was made up of adult Hispanics.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e He reiterated that 8.3 percent of those appearing for jury duty were Hispanic. He concluded that the likelihood the exhibited disparity would occur by chance was one in one million.\n\nAfter reading the transcripts of the Cantu, Robinson, and Streeter cases and hearing argument on the issue, the trial court denied without prejudice defendant's motion to quash, stating, \"I do believe that there has been a prima facie showing that there is a disproportionate number of people with Hispanic surnames called for jurors, but I am not sure that that means a thing, and everybody knows by reading the Los Angeles Times and any other publication that there are an enormous number of people in this country illegally or green card-wise [ sic ] who are not even citizens. [para.] So, I don't think that really in and of itself means anything.\" Defendant renewed the motion later and it was again denied.\n\nb. The Fair Cross-section Principle\n\n\"In California, the right to trial by jury drawn from a representative cross-section of the community is guaranteed equally and independently by the Sixth Amendment to the federal Constitution (Taylor v. Louisiana (1975) 419 U.S. 522, 530 [42 L.Ed.2d 690, 698, 955 S.Ct. 692]) and by article I, section 16 of the California Constitution. (People v. Wheeler (1978) 22 Cal. 3d 258, 272 [148 Cal. Rptr. 890, 583 P.2d 748].) \" (Williams v. Superior Court (1989) 49 Cal. 3d 736, 740 [263 Cal. Rptr. 503, 781 P.2d 537].) \"In order to establish a prima facie violation of the fair-cross-section requirement, the defendant must show (1) that the group alleged to be excluded is a 'distinctive' group in the community; (2) that the representation of this group in venires from which juries are selected is not fair and reasonable in relation to the number of such persons in the community; and (3) that this underrepresentation is due to systematic exclusion of the group in the jury selection process.\" (Duren v. Missouri (1979) 439 U.S. 357, 364 [58 L.Ed.2d 579, 99 S.Ct. 664]; see also Bell, supra, 49 Cal. 3d at p. 525; People v. Morales (1989) 48 Cal. 3d 527, 543 [257 Cal. Rptr. 64, 770 P.2d 244].) If a defendant demonstrates a prima facie case of systematic underrepresentation under this tripartite test, the burden shifts \"to the state to come forward with either a more precise statistical showing that no constitutionally significant disparity existed or that there was a compelling justification for the procedure which results in the disparity in the jury pool.\" (Harris, supra, 36 Cal. 3d at p. 50.)\n\nc. Application\n\nThe first prong of the Duren test is clearly satisfied; Hispanics, or those with Spanish surnames, constitute a distinctive group for purposes of a fair cross-section analysis. (Morales, supra, 48 Cal. 3d at p. 543.)\n\nThe second prong may be satisfied by showing \"that the number of members of the cognizable group is not fair and reasonable in relation to the\n\nnumber of members in the relevant community.\" (Bell, supra, 49 Cal. 3d at p. 526.) Working from defendant's most refined statistics, adult Hispanic citizens made up 16.3 percent of Kern County, whereas only 8.3 percent of those appearing for jury duty were Hispanic. Thus, there was an 8 percent absolute disparity and a 49 percent comparative disparity.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nWe have previously noted that \"the [United States] Supreme Court has not yet spoken definitively on either the means by which disparity may be measured or the constitutional limit of permissible disparity.\" (Bell, supra, 49 Cal. 3d at pp. 527-528, fns. omitted.)\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e As in Bell, however, we need not resolve this difficult line-drawing question because defendant fails to establish a prima facie case under Duren 's third prong by showing the disparity is caused by \"systematic\" exclusion of Hispanics from Kern County juries.\n\nBy basing his motion to quash on the expert statistical evidence given in the Cantu, Robinson, and Streeter cases, defendant sought to show a statistical disparity occurred over time and was thus the result of a \"systematic exclusion\" of Hispanics. As we recently explained in Bell, supra, however, such a showing is insufficient, standing alone, to make out a prima facie case of a Sixth Amendment violation. When, as here, \"a county's jury selection criteria are neutral with respect to race, ethnicity, sex, and religion, more is required to shift the burden to the People. The defendant must identify some aspect of the manner in which those criteria are being applied that is: (1) the probable cause of the disparity, and (2) constitutionally impermissible.\" (Bell, supra, 49 Cal. 3d at p. 524.) Evidence that \"race/class neutral jury selection processes may nonetheless operate to permit the de facto exclusion of a higher percentage of a particular class of jurors than would\n\nresult from a random draw\" is insufficient to make out a prima facie case. (Morales, supra, 48 Cal. 3d at p. 546, italics in original.)\n\nDefendant claims he has satisfied this requirement in Bell (supra, 49 Cal. 3d 502) by relying not only on the statistical disparity, but on the fact that at the time of defendant's trial, Kern County assembled its master jury list solely from the voter registration list. Not only does he argue this is the \"probable source\" of the disparity, he contends the practice is \"constitutionally impermissible,\" citing People v. Harris, supra, 36 Cal. 3d 36. Our concern here is with the latter requirement: because the county's juror selection procedures were facially neutral, has defendant shown that procedure is nevertheless \"constitutionally impermissible\" within the meaning of Bell ?\n\nThere is some language in the lead opinion in Harris suggesting that sole reliance on voter registration lists in assembling the master jury list is constitutionally prohibited. We do not, however, read Harris so broadly. In that divided opinion, a three-justice plurality held the defendant made a prima facie showing of a fair cross-section violation based on a statistical showing of racial disparity and the fact that the county assembled its master jury list using only voter registration lists. (36 Cal. 3d at p. 58 [plur. opn. by Broussard, J., joined by Bird, C. J., \u0026 Reynoso, J.].) Although the trial court did not find the defendant made a prima facie case -- and thus the People were never asked to present any rebuttal evidence -- the plurality reversed the judgment. Three other justices dissented on this point. (Id. at pp. 72 [dis. opn. by Mosk, J., joined by Richardson, J.], 75 [dis. opn. by Kaus, J.].)\n\nIn a pivotal separate opinion, Justice Grodin provided a reluctant fourth vote to reverse. He expressly agreed with the plurality that defendant made a prima facie case, despite relying on total population statistics. Justice Grodin further stated that \"in light of published studies which point to the exclusive reliance upon voter registration lists as a likely source of racial and ethnic disparity in the composition of juries, I am prepared to say that defendant's showing should be regarded as sufficient to trigger further inquiry.\" (Harris, supra, 36 Cal. 3d at p. 71 [conc. opn. by Grodin, J.].)\n\nSignificantly, he further explained that he \" would not reverse the judgment on that account.\" (Harris, supra, 36 Cal. 3d at p. 71, italics added.) Because the People had no occasion to present rebuttal evidence, he opined the case should be remanded to allow them to do so. (Id. at pp. 71-72.) \"Upon full consideration of the relevant evidence it might be concluded that 'no disparity of constitutional significance exists,' or that 'even with the use of multiple sources and all other practical means, a certain level of\n\ndisparity is unavoidable,' or that the underrepresentation which does exist is justified by a showing of overriding state interest.\" (Id. at p. 72, quoting plur. opn. at p. 59.) Justice Grodin then explained that although he preferred the remand option, there would be no disposition of the case were he to insist on that alternative. Finding this an \"intolerable\" result, and concluding that he \"fundamentally\" disagreed with the dissenting opinions, he reluctantly joined the plurality opinion's disposition to reverse. (Ibid.)\n\nAs is clear, Justice Grodin did not join the Harris plurality's far-reaching conclusion that sole reliance on voter registration lists was itself constitutionally prohibited.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Indeed, he twice stated his position that identification of that fact, coupled with an adequate statistical showing of racial disparity, merely established a prima facie case of a constitutional violation, and should not itself require reversal.\n\nSince Harris, supra, 36 Cal. 3d 36, however, this court has refined the procedure by which a criminal defendant can establish a prima facie case of a fair cross-section violation. Unlike in Harris, a defendant attacking facially neutral procedures as the \"probable cause\" of the statistical disparity must now demonstrate that such procedures are either \"constitutionally impermissible\" or are being implemented in a constitutionally objectionable manner. (Bell, supra, 49 Cal. 3d at p. 524.) As explained above, Harris does not constitute controlling authority for this latter point. Resort to other authority is similarly unhelpful to defendant's position.\n\nWe begin our analysis by noting that, at the time of defendant's trial, our state Legislature permitted sole reliance on voter registration lists to assemble the master jury list. As explained below, former Code of Civil Procedure section 204.7 stated that source lists for jurors \"shall include those who are registered voters.\" The section also provided that the list should be supplemented from lists from the Department of Motor Vehicles (DMV) in those counties where such supplementation was practical and would not entail \"significant cost.\" The negative implication of this statutory language was\n\nthat sole reliance on voter registration lists was permissible where supplementation was impractical or costly.\n\nWe presume this statute was constitutional. \"'In considering the constitutionality of a legislative act we presume its validity, resolving all doubts in favor of the Act. Unless conflict with a provision of the state or federal Constitution is clear and unquestionable, we must uphold the Act. [Citations.]'\" (County of Sonoma v. State Energy Resources Conservation etc. Com. (1985) 40 Cal. 3d 361, 368 [220 Cal. Rptr. 114, 708 P.2d 693], quoting California Housing Finance Agency v. Elliot (1976) 17 Cal. 3d 575, 594 [131 Cal. Rptr. 361, 551 P.2d 1193].)\n\nOur past decisions, and those of other courts, are in accord. As discussed, ante, at page 494 footnote 7, we held in 1972 that sole reliance on voter registration lists was not itself constitutionally invalid. (Sirhan, supra, 7 Cal. 3d at pp. 749-750.) Moreover, the federal circuits are unanimous on this point. Interpreting the Jury Selection and Service Act of 1968 (28 U.S.C. §§ 1861-1867), circuit courts of appeal have routinely held sole reliance on voter registration lists does not violate the fair cross-section rule absent some evidence of active discrimination.\n\nUnited States v. Cecil (4th Cir. 1988) 836 F.2d 1431 (cert. den. (1988) 487 U.S. 1205 [101 L.Ed.2d 883, 108 S.Ct. 2846]), is illustrative. In that case, the United States Court of Appeals for the Fourth Circuit opined that sole use of voter registration lists \"cannot be described 'as \"systematically\" excluding classes that do not register in proportion to their numbers'; it is a process that comports with the 'need for efficient jury selection' even though it may not 'perfectly reflect population.' Nor does it follow that the voter registration lists do not satisfy the fair cross-section . . . [requirement] simply because . . . members of one group neglected to register in the same proportion as was their share in the overall population. The Constitution and the [federal] statute do not require such perfection. It is sufficient that the system adopted provides a fair cross-section and we find both common sense and precedent establish that if the voter registration lists do this they are not tainted by some affirmative form of discrimination.\" (Id. at pp. 1448-1449; see generally id. at pp. 1444-1451, and cases cited; Annot., Construction and Application of Provisions of Jury Selection and Service Act of 1968 (28 USCS §§ 1861-1867) Governing Plans for, and Manner of, Selecting Federal Grand and Petit Jurors (1973) 17 A.L.R.Fed. 590, 608, § 7[a] and cases cited.)\n\nSignificantly, the rule laid down in Sirhan, supra, 7 Cal. 3d at pages 749-750, as well as the complementary rule of law in numerous federal cases, existed before and during defendant's trial. Former Code of Civil Procedure\n\nsection 204.7 was also in force at that time. In light of these persuasive authorities, we conclude defendant fails to demonstrate the county's raceneutral procedures for using voter registration lists to assemble the county's master jury list was constitutionally impermissible and, accordingly, we conclude the trial court correctly denied the motion to quash.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\n2. Former Code of Civil Procedure Section 204.7\n\nIn conjunction with his pretrial challenge to the composition of the jury venire, defendant also claimed the master jury list was assembled in violation of former Code of Civil Procedure section 204.7, at the time a relatively new statute. (Stats. 1980, ch. 81, § 35, p. 207, eff. July 1, 1981.)\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The evidence produced in support of the motion showed that at the time of his 1981 trial, Kern County relied solely on voter registration rolls to compile its jury lists. Although an attempt was made to incorporate and integrate the names of those holding driver's licenses and identification cards from the DMV, the county intended to complete this project only in time to select the 1982 master jury list. The jury list was assembled once a year and the list in use at the time of defendant's motion (November 1981) had been compiled the previous year. For Kern County to expand and use multiple source lists any sooner would have cost between $15,000 and $40,000 for a computer program to eliminate duplicate names (in order to maintain the randomness of the selection procedure).\n\nAt the time of defendant's trial, former Code of Civil Procedure section 204.7 provided that \"(a) Source lists of jurors shall identify persons who reside in the county, and who are 18 years of age or older, shall include those who are registered voters, and to the extent that systems for producing jury lists can be practically modified, without significant cost, shall also include those who have been licensed or issued an identification card pursuant to Article 3 . . . and Article 5 . . . of Chapter 1 of Division 6 of the Vehicle Code. Qualified jury lists and master jury lists derived from the source lists shall be prepared so as to reasonably minimize duplication of names.\" (Italics added.)\n\nThe trial court denied defendant's motion at a November 1981 hearing, concluding that the section did not become effective until January 1982, \"if then.\" In addition, the court specifically declined to make a finding on the financial feasibility of the immediate use of multiple source lists. Although the trial court did not explain its decision regarding the effective date of the newly enacted statute, it appears the court believed that because Kern County assembled its master jury list only once each year and the list for 1981 had already been chosen, the new statute would affect only the master jury list for 1982, which would supplant the previous year's jury list in January 1982.\n\nThe trial court did not cite any authority for its interpretation of the former code section, making it difficult to evaluate the correctness of its ruling. However, even assuming arguendo the trial court erred, defendant cannot prevail. As the evidence below made clear, Kern County was, at the time defendant made his motion, in the process of complying with the statutory requirement to integrate DMV lists into the master jury list. Recognizing that mandating overnight changes was unwise, the Legislature only required that \"systems for producing jury lists\" be modified to include DMV lists if such changes could be done \"without significant cost.\" Because the record shows the cost of immediate compliance would have been several thousand dollars, and that compliance would occur shortly, we conclude the motion was properly denied because the record shows the master jury list could not be \"practically modified, without significant cost . . . .\" (Former Code Civ. Proc., § 204.7.)\n\n3. Wheeler Error\n\nDuring voir dire, all but four Spanish surnamed persons were excused for cause by either the prosecution or the defense. When the remaining four were peremptorily challenged by the prosecutor, defendant objected, claiming the prosecutor was exercising his peremptory challenges to improperly exclude Spanish surnamed persons from the jury. (People v. Wheeler (1978) 22 Cal. 3d 258 [148 Cal. Rptr. 890, 583 P.2d 748].) The trial court denied the motion, finding defendant failed to demonstrate a prima facie showing that the prosecutor was relying on group rather than specific bias. We agree the court properly denied the motion.\n\nIt is now well established that \"peremptory challenges may not be used to exclude from a jury, solely because of a presumed 'group bias,' all or most members of an identifiable group of citizens distinguished on racial, religious, ethnic, or similar grounds.\" (People v. Snow (1987) 44 Cal. 3d 216, 222 [242 Cal. Rptr. 477, 746 P.2d 452].) Such improper exercise of peremptory challenges violates article I, section 16, of the California Constitution\n\n(People v. Turner (1986) 42 Cal. 3d 711, 716 [230 Cal. Rptr. 656, 726 P.2d 102]; Wheeler, supra, 22 Cal. 3d at pp. 276-277), as well as the equal protection clause of the United States Constitution. (Batson v. Kentucky (1986) 476 U.S. 79 [90 L.Ed.2d 69, 106 S.Ct. 1712].)\n\n\"If a party believes his opponent is using his peremptory challenges to strike jurors on the ground of group bias alone, he must raise the point in timely fashion and make a prima facie case of such discrimination to the satisfaction of the court. First, . . . he should make as complete a record of the circumstances as is feasible. Second, he must establish that the persons excluded are members of a cognizable group within the meaning of the representative cross-section rule. Third, from all the circumstances of the case he must show a strong likelihood that such persons are being challenged because of their group association rather than because of any specific bias.\" (Wheeler, supra, 22 Cal. 3d at p. 280; see also Snow, supra, 44 Cal. 3d at p. 222.) If the trial court finds the moving party has made a prima facie case, the burden shifts to the opponent to explain its peremptory challenges. (People v. Johnson (1989) 47 Cal. 3d 1194, 1216 [255 Cal. Rptr. 569, 767 P.2d 1047].)\n\nDefendant clearly raised the issue in timely fashion and made as complete a record as possible. Moreover, contrary to the People's argument, defendant's reliance on Spanish surnamed persons as a category of excluded jurors is permissible. (See Morales, supra, 48 Cal. 3d at p. 543.) We conclude, however, that the trial court properly found defendant failed to demonstrate \"from all the circumstances of the case\" a \"strong likelihood\" that the prosecutor's use of peremptory challenges to excuse the four Spanish surnamed jurors was based on group, rather than specific, bias. Because defendant thus failed to make a prima facie showing of a constitutional violation, the prosecutor's burden of justification never arose.\n\nAn examination of the voir dire proceedings supports this conclusion. Mrs. Sosa was the first Spanish surnamed person peremptorily challenged by the prosecutor. She stated she was a cook for the Child Development Center and that her husband was director of maintenance and transportation at a local school. She had three adult children and had lived in Kern County for eleven years. When asked about the death penalty, she replied, \"That is kind of scary\" and that she was \"absolutely\" opposed to the death penalty on religious grounds. On later questioning, she was asked whether she would impose the death penalty in a proper case under proper instructions; she said, \"Yes, I guess.\"\n\nMr. Arrambide was questioned shortly after Mrs. Sosa. He was a labor contractor, married, and had five children. He had lived in Kern County\n\nsince 1948 and did not read a newspaper. He seemed distracted because he had lost a job that day due to his jury duty and was concerned that he would lose more jobs. He operated five work crews and explained that \"if I am not there, well, they say that guy is not interested in the job . . . . Some farmers understand, but some don't.\" Later, when asked whether he would lose many jobs by serving on defendant's jury, he admitted he did not know. When asked about the death penalty, Mr. Arrambide stated his belief that only God could take a man's life, but that he could vote to impose the death penalty. Later, he said he could not, and appeared confused by the questioning. There was some suggestion of a language problem.\n\nDefendant first raised the Wheeler issue after Sosa and Arrambide were excused. The trial court denied the motion, stating, \"I certainly don't think there is at this particular point an indication that there is an intention to rid this jury of all Spanish surnamed individuals. [para.] I tell you now that I do not know the reason for the excusing of [Mrs.] Sosa but it's very obvious why Mr. Arrambide was excused. Motion is denied at this point. But I want to find that there is no obvious reason for the excusing of Mrs. Sosa.\"\n\nA few days later, Mr. Lara was questioned. A mechanic, Lara was married, had no children, and had lived in the county for 19 years. He initially stated he would always choose life over death and was absolutely opposed to the death penalty. The prosecutor interposed a challenge for cause which was ultimately denied after Lara was questioned by defense counsel. Lara admitted he could conceive of a crime for which death might be appropriate and, after some pointed questioning, he eventually conceded he could vote for the death penalty if he were retained on the jury.\n\nAfter Mr. Lara was questioned, counsel for both defendant and Cebreros announced they were satisfied with the panel. The prosecutor then exercised one of his remaining peremptory challenges to excuse Juror Lara. Defendant renewed his Wheeler motion but the trial court again denied it, stating, \"I am keeping [track] of it and I made a finding that I couldn't see any reason with Mrs. Sosa. But with Mr. Lara, it's very obvious when I first asked him about the death penalty he indicated he was opposed to it. I don't think [the prosecutor's challenge] was done for any racist reason whatsoever and the court will make such a finding.\" Counsel argued briefly but to no avail that although Mr. Lara initially expressed personal opposition to the death penalty, his later responses on voir dire showed he had modified his position in that regard.\n\nMr. Mercado was the final Spanish surnamed person on the panel. At the beginning of the voir dire, the trial judge admitted that he knew Mr. Mercado due to a prior association between the judge's wife and Mercado's mother.\n\nMr. Mercado affirmed that the connection would not affect his ability to be impartial.\n\nMr. Mercado was a high school math teacher, having graduated from Fresno State. His wife was a junior high school teacher and they had one child, then two years old. He stated he read the local paper regularly but not thoroughly, and had no recollection of defendant's case, although he knew the brother of one of the witnesses (Glen Blackford). He stated he was in favor of the death penalty but could keep an open mind. Although his cousin worked for the California Highway Patrol and he had a few friends who were deputy sheriffs, he claimed that he would not accord a law enforcement officer's testimony undue weight. He admitted that while sitting as an alternate, he might be thinking about his high school baseball team because they were due to begin preconditioning, but he would probably be able to set those thoughts aside.\n\nMr. Mercado then admitted he had suffered two arrests in his life. In the first, he was arrested for \"grand theft auto\" when he was 18 years old. The matter was reduced to misdemeanor joyriding and he received probation. In the second, he recounted that while in college, he and a Black friend were confronted by eight college football players. The players made some racially derogatory remarks and a fight ensued. When the police arrived, the eight players had fled but police arrested Mercado's friend for being drunk in public. When Mercado attempted to intervene by offering to drive his friend home, he was arrested for obstructing an officer in the performance of his duties. The charges were later dropped.\n\nAfter the prosecutor used a peremptory challenge to remove Mr. Mercado, the fourth and final Spanish surnamed juror, defendant renewed his Wheeler motion a second time. The trial judge stated \"Gentlemen, this young man, and I have known [Mercado] a long time. I was shocked to hear about his run ins with the police. I was unaware of it. I think the district attorney has ample grounds under those circumstances.\"\n\nDefendant first contends that the fact that the prosecutor struck all four of the remaining Spanish surnamed potential jurors from the panel demonstrates a strong likelihood of an impermissible motivation. Although the removal of all members of a certain group may give rise to an inference of impropriety (Wheeler, supra, 22 Cal. 3d at p. 280), we cannot say this factor was dispositive on this record. It is clear the trial court was \"aware of [its] duty under Wheeler to be sensitive to the manner in which peremptory challenges were used.\" (Johnson, supra, 47 Cal. 3d at p. 1221.) After carefully scrutinizing the voir dire proceedings, the trial court -- clearly aware the prosecutor had removed the remaining Spanish surnamed venirepersons --\n\nheld defendant failed to demonstrate a strong likelihood based on \"all the circumstances of the case\" that the prosecutor's exercise of his peremptory challenges were based on group bias.\n\nWe reiterate that ruling on Wheeler motions \"'requires trial judges to make difficult and often close judgments. They are in a good position to make such determinations, however, on the basis of their knowledge of local conditions and of local prosecutors.' [Citation.] They are also well situated to bring to bear on this question their powers of observation, their understanding of trial techniques, and their broad judicial experience. We are confident of their ability to distinguish a true case of group discrimination by peremptory challenges from a spurious claim . . . .\" (Wheeler, supra, 22 Cal. 3d at p. 281, quoting Kuhn, Jury Discrimination: The Next Phase (1968) 41 So.Cal.L.Rev. 235, 295, fn. 5; see also Johnson, supra, 47 Cal. 3d at pp. 1219-1222.) Applying this standard of giving considerable deference to the determination of the trial court, \"we see no good reason to second-guess [the trial court's] factual determination\" (Johnson, supra, at p. 1221) that the prosecutor was not motivated by bias against Hispanics.\n\nDefendant also contends the trial court should have found he made a prima facie showing because aside from their ethnicity, the four excused jurors were otherwise \"as heterogeneous as the community as a whole.\" (Wheeler, supra, 22 Cal. 3d at p. 280.) While this fact may, under some circumstances, support a finding of a prima facie case, comparisons between jurors is not often a fruitful exercise. \"[T]he very dynamics of the jury selection process make it difficult, if not impossible, on a cold record, to evaluate or compare the peremptory challenge of one juror with the retention of another juror which on paper appears to be substantially similar.\" (Johnson, supra, 47 Cal. 3d at p. 1221.) Such a comparison \"is highly speculative and less reliable than the determination made by the trial judge who witnessed the process by which the defendant's jury was selected.\" (Ibid.)\n\nAlthough defendant argues the prosecutor's voir dire of the jurors in question was \"superficial if not exactly desultory\" (see Wheeler, supra, 22 Cal. 3d at p. 281), the record does not support this assertion; our independent examination of the record does not reveal the voir dire of the four potential jurors was either limited or desultory, or was in any way different from the other jurors on the panel.\n\nDefendant thus fails to convince us that our traditional deference to a trial court's ruling on a Wheeler motion is inappropriate. (See fn. 10.) We conclude the trial court properly found defendant failed to make a\n\nprima facie showing of a strong likelihood that the prosecutor's challenges were motivated by group, rather than specific, bias.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\n4. Witherspoon/Witt Error\n\nDuring routine questioning on voir dire, venireman Giangregorio volunteered that he did not believe in capital punishment. Later, when questioned about that topic by the trial judge, the following colloquy occurred:\n\n\"Q: How do you feel about the death penalty?\n\n\"A: I am against it, your Honor.\n\n\"Q: Are you against it in every case?\n\n\"A: Every instance. I do not believe in it.\" The prosecutor's motion to exclude for cause was thereafter granted over a defense objection.\n\nDefendant now contends Giangregorio's excusal violated the precepts laid down in Witherspoon v. Illinois (1968) 391 U.S. 510 [20 L.Ed.2d 776, 88 S.Ct. 1770] (Witherspoon). As he recognizes, however, the high court limited Witherspoon, establishing a less stringent standard, in part because of the modern trend against permitting a capital jury to act with unfettered discretion. (Wainwright v. Witt (1985) 469 U.S. 412, 422 [83 L.Ed.2d 841, 850, 105 S.Ct. 844] (Witt).) Witt requires that the trial court determine \"whether the juror's views would 'prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.'\" (Id. at p. 424 [83 L.Ed.2d at pp. 851-852].) \"Under Witt, therefore, our duty is to 'examine the context surrounding [the juror's] exclusion to determine whether the trial court's decision that [the juror's] beliefs would \"substantially impair the performance of his duties . . .\" was fairly supported by the record.'\" (People v. Miranda (1987) 44 Cal. 3d 57, 94 [241 Cal. Rptr. 594, 744 P.2d 1127], quoting Darden v. Wainwright (1986) 477 U.S. 168, 176 [91 L.Ed.2d at p. 154].)\n\nDefendant first contends we should retain the stricter Witherspoon standard as a matter of state constitutional law. (See Cal. Const., art. I, § 16\n\n[right to trial by jury].) However, we have already adopted the Witt standard, because it \"'make[s] good sense, and because California courts have generally followed the teachings of the high court in determining when a prospective juror properly may be excused for cause because of his views regarding capital punishment . . . .'\" (People v. Guzman (1988) 45 Cal. 3d 915, 955 [248 Cal. Rptr. 467, 755 P.2d 917], quoting People v. Ghent (1987) 43 Cal. 3d 739, 767 [239 Cal. Rptr. 82, 739 P.2d 1250].)\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nHe next argues that Giangregorio's excusal was improper even under the Witt standard. Giangregorio's expressed antipathy to the death penalty in \"every instance,\" however, would undoubtedly \"substantially impair the performance of his duties as a juror . . . .\" (Witt, supra, 469 U.S. at p. 424 [83 L.Ed.2d at p. 851].) Although defendant submits the trial court should have explained to Giangregorio that it was his civic duty to set aside his personal feelings and obey the law, we have previously rejected that notion, finding nothing in Witherspoon that obligates a trial court to so instruct a juror. (Miranda, supra, 44 Cal. 3d at p. 96.)\n\nWe conclude prospective juror Giangregorio was properly excused from the jury.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nB. Guilt Phase Issues\n\n1. Exclusion of Expert Testimony Regarding Eyewitness Identification\n\nAt trial, defendant offered the testimony of Dr. Elizabeth Loftus, an expert on eyewitness identifications. Dr. Loftus would have testified to\n\nthe following:\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e To provide a basis for her expert opinion, she read the police reports in the case as well as the transcript of the preliminary examination. In addition, she viewed the photographic lineup and discussed the case with defense counsel. Based on this information, she determined the following factors could have influenced the eyewitness identification in this case: (1) stress or fear; (2) violence; (3) weapon focus; (4) retrograde amnesia; (5) ingestion of drugs or alcohol; and (6) a photo-biased identification. She did not intend to give an opinion as to whether any particular identification was accurate but only that these six factors are known to affect the accuracy of eyewitness identifications in general. Moreover, she opined that the information she would provide was beyond the common experience of most jurors and that her testimony could be of assistance to the jury.\n\nThe prosecutor objected to Dr. Loftus's proposed testimony, contending that the accuracy of eyewitness identifications was a matter of common sense for the jury, that Dr. Loftus could not testify as to the accuracy of any particular identification, and that cross-examination coupled with appropriate jury instructions would form an adequate basis from which the jury could decide whether or not to rely on Boender's identification of defendant. In addition, the prosecutor cited several cases in which the type of expert testimony the defense offered had been excluded. The trial court, although finding Dr. Loftus qualified to testify as an expert and that her testimony would not consume an undue amount of time, sustained the prosecution's objection.\n\nAs both defendant and the People acknowledge, the resolution of this issue is controlled by People v. McDonald (1984) 37 Cal. 3d 351 [208 Cal. Rptr. 236, 690 P.2d 709, 46 A.L.R.4th 1011], filed after defendant's trial. McDonald involved the murder of Jose Esparza on a public sidewalk, viewed from varying distances by seven witnesses who identified McDonald as the killer. McDonald offered the testimony of Dr. Shomer, who \"proposed to inform the jury of various psychological factors that may affect the reliability of eyewitness identification, and to 'help to counter some common misconceptions' about the process.\" (Id. at p. 361.) Specifically, Dr. Shomer would have testified that the following factors affected the reliability of eyewitness identifications: \"the observer's state of mind, his expectations, his focus of attention at the time, the suddenness of the incident, the stressfulness of the situation, and the differences in the race and/or age of the observer and the observed.\" (Ibid.) Following a line of appellate decisions\n\nthat upheld the exclusion of such evidence,\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e the trial court in McDonald excluded Dr. Shomer's testimony. The defendant was convicted of murder and sentenced to death.\n\nWe reversed. \"When an eyewitness identification of the defendant is a key element of the prosecution's case but is not substantially corroborated by evidence giving it independent reliability, and the defendant offers qualified expert testimony on specific psychological factors shown by the record that could have affected the accuracy of the identification but are not likely to be fully known to or understood by the jury, it will ordinarily be error to exclude that testimony.\" (McDonald, supra, 37 Cal. 3d at p. 377.) However, exclusion of such evidence requires reversal only if it results in a miscarriage of justice. (People v. Brown (1985) 40 Cal. 3d 512, 526-527 [220 Cal. Rptr. 637, 709 P.2d 440]; McDonald, supra, at p. 376; see also People v. Watson (1956) 46 Cal. 2d 818, 836 [299 P.2d 243].)\n\nAlthough an appellate court should, in the usual case, defer to a trial court's decision admitting or excluding expert testimony (McDonald, supra, 37 Cal. 3d at p. 377), the trial in defendant's case took place prior to our decision in McDonald and the trial court took no guidance from the reasoning therein. Even assuming arguendo the trial court erred in excluding the proffered expert testimony, however, we find the error was harmless.\n\nWe begin by noting that several of the critical factors identified in McDonald are present in this case. Boender's identification of defendant was indisputably a \"key element\" of the People's case. Also, there is no dispute that Dr. Loftus was a qualified expert on the subject of eyewitness identifications. We thus must examine whether Boender's identification was \"substantially corroborated\" such that it had \"independent reliability.\" Once again, McDonald is instructive.\n\nIn McDonald, supra, 37 Cal. 3d 351, no evidence linked the defendant to the crime other than the eyewitness identifications. The eyewitnesses in McDonald were equivocal, voicing various degrees of certainty, with one actually asserting that the defendant was definitely not the killer. Finally, the defendant had a strong alibi defense: several witnesses testified that he was in Alabama on the day of the killing and their testimony was supported by physical evidence in the form of dated postcards and phone bills. The\n\nidentifications therefore were not corroborated by evidence giving them independent reliability.\n\nIn the present case, by contrast, Boender was positive that defendant was one of the two assailants and his identification was bolstered by (1) his recognition of defendant from the botched robbery attempt two days earlier; (2) Maxwell's statement to police, which dovetailed with Boender's description of the crimes and gave defendant a motive to kill Boender; and (3) Maxwell's descriptions of defendant and Cebreros, which matched Boender's descriptions of the assailants given to police the day after Allen's murder. Although Maxwell was admittedly not the most veracious witness, we cannot agree with defendant that her testimony must be wholly disregarded. To the extent Maxwell's testimony was consistent with Boender's version of events, it provides some corroboration for Boender's eyewitness identification of defendant.\n\nMoreover, unlike in McDonald, physical evidence linked defendant to the crime. The baggie of marijuana found in Cebreros's possession was identical to that taken from Boender's apartment. In addition, the gun found in his possession was similar to the one that Boender described as having been wielded by defendant. Finally, the roll of duct tape bore defendant's fingerprints, thus supporting Maxwell's story that defendant planned to use it to bind Boender during the January 21st robbery attempt. Although none of these items points unerringly towards defendant's guilt, they constitute links in the chain of evidence against him and thus provide some corroboration of Boender's identification of defendant as the guilty party.\n\nDue to the strength of the evidence corroborating Boender's eyewitness identification of defendant, we cannot conclude the trial court's exclusion of his proffered expert evidence resulted in a miscarriage of justice. (McDonald, supra, 37 Cal. 3d at p. 376.) Even assuming error, it was harmless.\n\nIn a related claim, defendant contends the trial court abused its discretion when, during voir dire, it sustained the prosecutor's objection to defense questions that sought to elicit the opinions of potential jurors concerning the effects of stress on perception. Defendant argues that these questions would have demonstrated that the information Dr. Loftus sought to impart was not within the common knowledge of the jury, thereby undercutting a potential justification for excluding her testimony.\n\nThe purpose of questioning at voir dire, however, is to assist the attorneys in the exercise of their peremptory challenges, not to provide foundational support for their evidentiary motions. \"[C]ounsel should be allowed to ask questions reasonably designed to assist in the intelligent\n\nexercise of peremptory challenges whether or not such questions are also likely to uncover grounds sufficient to sustain a challenge for cause.\" (People v. Williams (1981) 29 Cal. 3d 392, 407 [174 Cal. Rptr. 317, 628 P.2d 869], italics added.) Because the challenged questions at voir dire were not related to aiding the exercise of peremptory challenges but instead were intended to support defendant's position on an evidentiary question, no abuse of discretion occurred.\n\nDefendant apparently recognizes the weakness of his argument by suggesting that responses to his voir dire questions would have helped him decide which jurors to challenge by exposing whether they were aware of the information Dr. Loftus would have offered. Although defendant thus claims the questions would have assisted in the exercise of his peremptory challenges, he is basically asserting that if the trial court excluded Dr. Loftus's testimony on the ground that it was within the common experience of the jury, then he was entitled to prove through questioning of the jurors that the trial court's assumption was incorrect. As we have explained, this is not a proper subject of questioning on voir dire.\n\n2. Boender's Identification of Cebreros\n\nThe day after the murder, police questioned Boender at the hospital. He described the larger of his assailants as over six feet tall, weighing over two hundred pounds, with dark hair thinning on top and combed straight back. Boender also noticed the man carried his arms noticeably away from his body and looked like a \"biker.\" This description was very similar to Maxwell's description of Cebreros, given to police the night before. After Cebreros was arrested, police displayed a stack of photographs to Boender, who, upon seeing the picture of Cebreros, exclaimed, \"This is the big guy; I'm sure of it.\" Maxwell also identified Cebreros from a photographic lineup. Cebreros is six feet, five inches tall, weighs two hundred and twenty pounds, and has hair as described by Boender. After Cebreros was arrested, Boender identified defendant from a separate photographic lineup.\n\nDefendant moved to suppress Boender's out-of-court identification of him, claiming the circumstances under which Boender selected his photograph were unduly suggestive. Cebreros made a similar motion as to Boender's identification of him. The trial court denied both motions, although it noted that the photographic array that included Cebreros left \"a great deal to be desired\" because his picture was the only one in the display that matched Boender's description of the larger assailant. The court stated, however, that, after considering all the facts and circumstances of the case, it could not conclude that there was \"a very substantial likelihood of irreparable\n\nmisidentification.\" (Simmons v. United States (1968) 390 U.S. 377, 384 [19 L.Ed.2d 1247, 1253, 88 S.Ct. 967].)\n\nDefendant now attacks the validity of the pretrial identification of Cebreros, arguing that because other evidence linked the two men in the commission of the crimes, the prosecution was able to unfairly bolster its case against defendant by using Boender's questionable identification of Cebreros. Defendant's claim fails at the threshold because it does not appear he joined in Cebreros's motion to suppress in the trial court or otherwise objected to the introduction of Boender's identification of Cebreros. (Evid. Code, § 353.) Because the alleged flaw in Cebreros's photographic lineup was that his picture was the only one that matched the witnesses' description, defendant's own motion to suppress cannot be fairly read to encompass the theory on which Cebreros's motion was made.\n\nEven assuming the issue was properly preserved for appeal, reversal is not required. \"[A] violation of due process occurs if a pretrial identification procedure is 'so impermissibly suggestive as to give rise to a very substantial likelihood of irreparable misidentification.' [Citations.] 'Whether due process has been violated depends on \"the totality of the circumstances\" surrounding the confrontation. [Citation.]' The burden is on the defendant to show that the identification procedure resulted in such unfairness that it abridged his rights to due process. [Citation.]\" (People v. Sequeira (1981) 126 Cal. App. 3d 1, 12 [179 Cal. Rptr. 249]; see also People v. Blair (1979) 25 Cal. 3d 640, 659 [159 Cal. Rptr. 818 [602 P.2d 738].)\n\n\"The factors to be considered in determining whether a lineup is impermissibly suggestive include the opportunity of the witness to view the criminal at the scene of the crime, the witness' degree of attention, the accuracy of the prior description of the criminal, the level of certainty demonstrated at the confrontation, and the time between the crime and the confrontation, as well as the suggestiveness of the procedure employed. (Manson v. Brathwaite (1977) 432 U.S. 98, 114.)\" (Sequeira, supra, 126 Cal. App. 3d at pp. 12-13.)\n\nIn this case, Boender testified he clearly viewed his assailants and he focused on his attackers' faces in order to identify them if he survived the attack. He was certain of his identification of Cebreros, who matched both his and Maxwell's descriptions of the larger of the two assailants. Only two days passed between the crime and Boender's selection of Cebreros's picture from the photographic array. Although the Cebreros photographic array was somewhat suggestive, we agree with the trial court that the totality of the circumstances does not demonstrate that there was \"a very substantial\n\nlikelihood of irreparable misidentification.\" (Simmons v. United States, supra, 390 U.S. at p. 384 [19 L.Ed.2d at p. 1253].)\n\n3. Felony-murder Instructions\n\nThe People presented the jury with six potential first degree murder theories. In addition to being instructed that it should return a verdict of first degree murder if it found defendant premeditated and deliberated the killing, or killed during a robbery, the jury was also instructed that it could return a verdict of first degree murder if it found the murder was committed during a burglary in which defendant entered Boender's home with the intent to (1) steal, (2) commit an assault, (3) falsely imprison the victims, or (4) dissuade the victims from testifying.\n\nDefendant correctly contends, and the People now concede, that it was error to instruct the jury that it might convict of first degree murder if it found the killing occurred during a burglary in which defendant's intent was to commit an assault. \"In [ People v.] Ireland [(1969) 70 Cal. 2d 522 [75 Cal. Rptr. 188 (450 P.2d 580, 40 A.L.R.3d 1323)], we rejected the bootstrap reasoning involved in taking an element of a homicide and using it as the underlying felony in a second degree felony-murder instruction. We conclude that the same bootstrapping is involved in instructing a jury that the intent to assault makes the entry burglary and that the burglary raises the homicide resulting from the assault to first degree murder without proof of malice aforethought and premeditation.\" (People v. Wilson (1969) 1 Cal. 3d 431, 441 [82 Cal. Rptr. 494, 462 P.2d 22].) We thus concluded that \"a burglary based on intent to assault . . . cannot support a felony-murder instruction.\" (Ibid.; see also People v. Smith (1984) 35 Cal. 3d 798, 804 [201 Cal. Rptr. 311, 678 P.2d 886].)\n\nAlthough the instruction was erroneous, we agree with the People that the error did not prejudice defendant. The jury was presented with five legally permissible theories of guilt and one legally impermissible theory. In such circumstances, the applicable rule on appeal is clear: reversal is required only if the reviewing court cannot determine from the record on which theory the jury relied. (People v. Green (1980) 27 Cal. 3d 1, 69 [164 Cal. Rptr. 1, 609 P.2d 468].) Two cases illustrate this point.\n\nIn People v. Ainsworth (1988) 45 Cal. 3d 984 [248 Cal. Rptr. 568, 755 P.2d 1017], the jury was instructed on at least three theories of first degree murder: premeditation, robbery-felony-murder, and rape-felony-murder. (Id. at p. 1015 \u0026 fn. 16.) The defendant contended there was insufficient evidence to support the instructions on premeditation and rape-felony-murder and invoked the Green rule in urging that we reverse. He conceded,\n\nhowever, that there was sufficient evidence to support the robbery-felony-murder theory and, significantly, the jury sustained a robbery-murder special-circumstance allegation. Thus, we were \"able to determine from the record -- specifically, the jury's finding of a robbery special circumstance -- that the jurors agreed on that theory at least in reaching their verdict.\" (Id. at p. 1015.) Because the first degree murder verdict was sustainable on the theory that the defendant killed during the commission of a robbery, we affirmed.\n\nPeople v. Boyd (1985) 38 Cal. 3d 762 [215 Cal. Rptr. 1, 700 P.2d 782] is in accord. In Boyd, the jury was presented with alternate theories of murder: felony murder and premeditation. Although the defendant argued there was insufficient evidence to justify an instruction on premeditation (id. at p. 769), we concluded any error was harmless, reasoning that \"the jury which found defendant guilty of first degree murder simultaneously returned a verdict finding as a special circumstance that defendant committed that murder during the commission of attempted robbery. Those findings make it clear that whatever the jurors thought about premeditation, they agreed upon all of the elements necessary for a verdict of first degree murder based on a felony-murder theory.\" (Id. at p. 770.)\n\nIn the instant case, the jury was presented with one legally objectionable theory of first degree murder and several permissible theories. Pursuant to other, properly given instructions, the jury found beyond a reasonable doubt that defendant committed a robbery and that he was guilty of the robbery-felony-murder special circumstance. As in Ainsworth, supra, 45 Cal. 3d 984, and Boyd, supra, 38 Cal. 3d 762, we can conclude that, at the very least, the jury reached its verdict of first degree murder under one legally proper theory. Under such circumstances, there is no miscarriage of justice under article VI, section 13 of the state Constitution and reversal is not required. (Cf. People v. Lee (1987) 43 Cal. 3d 666, 675, fn. 1 [238 Cal. Rptr. 406, 738 P.2d 752].)\n\n4. Accomplice Instructions\n\nThe trial court also read to the jury the standard instructions defining accomplices and detailing the corroboration requirement of section 1111. (See CALJIC Nos. 3.10-3.12.) It then instructed that if anyone was guilty of the January 21 robbery attempt, then Brenda Maxwell was an accomplice as a matter of law (CALJIC No. 3.16) and that the testimony of accomplices should be viewed with distrust (CALJIC No. 3.18). As to the January 23 crimes (i.e., the murder of Allen, the attempted murder of Boender, the robbery and the burglary), the jury was instructed that it must determine\n\nwhether Maxwell was an accomplice and that defendant had the burden of proving that fact by a preponderance of the evidence.\n\nDefendant argues Maxwell was an accomplice to all the crimes and that the trial court erred by leaving to the jury the question of whether she was an accomplice for the January 23 crimes. We disagree. When the evidence concerning whether a witness was an accomplice to a crime is undisputed, it is a question of law for the trial judge to decide. (People v. Hoover (1974) 12 Cal. 3d 875, 880 [117 Cal. Rptr. 672, 528 P.2d 760].) However, \"if the facts are disputed or susceptible of different inferences, the question whether the witness is an accomplice should be submitted to the jury.\" (People v. Mayberry (1975) 15 Cal. 3d 143, 159 [125 Cal. Rptr. 745, 542 P.2d 1337].) Here, the evidence that Maxwell was an accomplice to the January 23 crimes was not strong. Although defendant argues the bungled robbery attempt two days earlier provided her with a motive to commit the January 23 crimes, the most that may be said is that the material facts were in dispute as to whether Maxwell was an accomplice to those crimes. The trial judge thus properly submitted the matter to the jury.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nMoreover, even assuming arguendo that the trial court should have instructed the jury that all of Maxwell's testimony was subject to the corroboration requirement, the record reveals Maxwell's testimony was adequately corroborated in all respects. Her descriptions of defendant and Cebreros were accurate and very similar to Boender's descriptions. Her claim that she, defendant, and Donna Thompson met Cebreros outside a Jefferson Street house checked out: police arrested Cebreros outside that same house. Finally, her story describing the planned robbery was corroborated by defendant's fingerprint on the roll of duct tape the group planned to use to bind Boender after subduing him. Thus, even if the court erred, it is not reasonably probable that the jury would have reached a different result in the absence of the error. (Mayberry, supra, 15 Cal. 3d at p. 159 [applying the Watson (supra, 46 Cal. 2d 818) standard of prejudice].)\n\n5. Miranda Waiver\n\nPrior to his first trial, defendant moved to suppress his statements to police, claiming his Miranda\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e waiver was invalid because Officer Herman failed to inform him of the nature of the charges against him. At the hearing on the motion, Officer Herman testified that on January 29, 1981, he and Officer Vincent located defendant and escorted him to the police station. After entering an interview room, Herman testified he informed defendant that he wished to speak to him about a homicide and read him his Miranda rights. Defendant waived his rights and recounted his whereabouts during the previous seven days.\n\nDefendant testified in support of his motion to suppress and stated that he answered Herman's questions in the interview room for approximately an hour before Herman read him his Miranda rights and informed him that he was being investigated for a homicide. The trial court thereafter denied the suppression motion, and defendant's statements were introduced at trial. In closing argument, the prosecutor noted that defendant's statements to Officer Herman were inconsistent with his defense at trial that he spent the night of the murder at Salvador Cebreros's home playing chess and drinking beer.\n\n(See fn. 17.) Defendant renews his contention that Officer Herman's failure to inform him of the charges against him precludes a finding that he knowingly and intelligently waived his Miranda rights.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Although we are aware that a colorable argument may be made that a Miranda waiver is not knowing or intelligent where the suspect is ignorant of the charges against him (see People v. Boyde (1988) 46 Cal. 3d 212, 240 [250 Cal. Rptr. 83, 758 P.2d 25] [acknowledging the argument]; but see People v. Neely (1979) 95 Cal. App. 3d 1011, 1017 [157 Cal. Rptr. 531] [rejecting the claim]), this very contention was recently considered and rejected by the United States Supreme Court.\n\nIn Colorado v. Spring (1987) 479 U.S. 564 [93 L.Ed.2d 954, 107 S.Ct. 851], the defendant was arrested on a firearms charge, waived his Miranda rights, and agreed to speak to police. He was then questioned about a prior murder. He claimed at trial that the failure to advise him that he was suspected of the murder invalidated his Miranda waiver and required suppression of the statements he made to police about the murder. Although both the Colorado Court of Appeals and the Colorado Supreme Court agreed with him, the United States Supreme Court reversed, holding that \"[t]he Constitution does not require that a criminal suspect know and understand every possible consequence of a waiver of the Fifth Amendment privilege. [Citations.] The Fifth Amendment's guarantee is both simpler and more fundamental: A defendant may not be compelled to be a witness against himself in any respect.\" (Id. at p. 574 [93 L.Ed.2d at p. 966].)\n\nThus, \"a valid waiver does not require that an individual be informed of all information 'useful' in making his decision or all information that 'might . . . affec[t] his decision to confess.' [Citation.] '[W]e have never read the Constitution to require that the police supply a suspect with a flow of information to help him calibrate his self-interest in deciding whether to speak or stand by his rights.'\" (Colorado v. Spring, supra, 479 U.S. at p. 576 [93 L.Ed.2d at 967], quoting Moran v. Burbine, supra, 475 U.S. at p. 422 [89 L.Ed.2d at p. 421].) Finding no evidence that the defendant \"misunderstood the consequences of speaking freely to law enforcement officials\" (Spring, supra, at p. 575 [93 L.Ed.2d at p. 966]), the high court concluded that \"the trial court was indisputably correct in finding that Spring's waiver was made knowingly and intelligently within the meaning of Miranda.\" (Ibid.)\n\nDefendant's claim that his Miranda waiver was invalid thus fails even if we accept his version of the facts. As in Colorado v. Spring, supra, 479 U.S. 564, we conclude defendant was adequately informed of his Fifth Amendment rights and executed a valid waiver of them before speaking to Officer Herman.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e\n\nFinally, we decline defendant's invitation to exclude his extrajudicial statements by relying on our state Constitution. (See Cal. Const., art. I, § 15 [\"Persons may not . . . be compelled in a criminal cause to be a witness against themselves\"].) Although we are not precluded by article I, section 28, subdivision (d) of the state Constitution from establishing a new exclusionary\n\nrule in this case (see People v. Smith (1983) 34 Cal. 3d 251 [193 Cal. Rptr. 692, 667 P.2d 149] [art. I, § 28, subd. (d) only applies to crimes committed after its passage]), we are persuaded by the reasoning of the high court in Colorado v. Spring, supra, 479 U.S. 564, and conclude defendant's statements were properly admitted.\n\n6. Admission of Photographs\n\nDefendant objected at trial to the admission into evidence of two photographs of Allen. The first photograph depicts the victim lying on the bedroom floor as she was found by police. The second photograph was taken during the autopsy and depicts the extent of the victim's head wound. Responding to the objection, the prosecutor asserted the photographs were \"admissible not only on the issue of heinous, atrocious and cruel murder but the circumstances of the killing where it took place in the apartment, the manner in which it was done has some relevance to this case, some substantial relevance to this case I think, and I would offer it on that basis also.\" The trial court overruled the objection, stating, \"I don't think this photograph is outrageous and inflammatory and I think it is relevant and probative.\"\n\n\"The admission of photographs of a victim lies within the discretion of the trial court, and the exercise of that discretion will not be disturbed on appeal unless the probative value of the photographs is clearly outweighed by their prejudicial effect.\" (People v. Carrera (1989) 49 Cal. 3d 291, 329 [261 Cal. Rptr. 348, 777 P.2d 121]; see People v. Phillips (1985) 41 Cal. 3d 29, 54 [222 Cal. Rptr. 127, 711 P.2d 423].)\n\nDefendant first argues reversal is required because admission of the photographs was premised \"primarily\" on their relevance to the now discredited \"heinous, atrocious and cruel\" special circumstance set forth in section 190.2, subdivision (a)(14). (People v. Superior Court (Engert) (1982) 31 Cal. 3d 797 [183 Cal. Rptr. 800, 647 P.2d 76]; see also Maynard v. Cartwright (1988) 486 U.S. 356 [100 L.Ed.2d 372, 108 S.Ct. 1853] [holding a similarly worded aggravating circumstance under Oklahoma law unconstitutionally vague under the Eighth Amendment].) The prosecutor, however, offered the evidence on two distinct theories, namely, that the photographs were relevant to both the special circumstance allegation and to the circumstances of the crime. Although we have since found the \"heinous, atrocious and cruel\" special circumstance constitutionally infirm (Engert, supra), the challenged evidence was clearly admissible on the remaining theory. The first photograph was relevant in indicating \"the manner in which the crime had been committed.\" (People v. Thompson (1988) 45 Cal. 3d 86, 115 [246 Cal. Rptr. 245, 753 P.2d 37]; see also People v. Allen (1986) 42 Cal. 3d 1222, 1256\n\n[232 Cal. Rptr. 849, 729 P.2d 115] [photographs corroborated testimony of a witness as to \"location and manner in which the victims were shot\"].) The second photograph, taken at the autopsy, corroborated the testimony of the medical experts regarding the nature of the fatal blow. (See Carrera, supra, 49 Cal. 3d at p. 329; Thompson, supra, at p. 115.)\n\nWe agree, however, that in ruling on defendant's Evidence Code section 352 objection, the trial court's consideration of the relevance of the photographs to the now invalidated heinous, atrocious and cruel special-circumstance allegation may have prevented an accurate assessment of the probative value of the evidence balanced against the potential prejudice. Even assuming error, however, reversal is not required. That the evidence of guilt was strong is underscored by the dual identifications of both defendant and Cebreros by Boender and Maxwell, corroborated by the physical evidence such as the baggie of marijuana in Cebreros's boot and defendant's fingerprint on the roll of duct tape. In addition, Maxwell's tale of the botched robbery attempt at her mobilehome, corroborated by Boender, provided the motive for the subsequent murder. Finally, we note the trial court found the photographs neither \"outrageous\" nor \"inflammatory.\" As in People v. Poggi (1988) 45 Cal. 3d 306, 323 [246 Cal. Rptr. 886, 753 P.2d 1082], \"we cannot conclude that it is reasonably probable a result more favorable to defendant would have occurred in the absence of the error.\"\n\nFinally, although defendant contends the trial court failed to exercise any discretion, his claim is belied by the trial judge's explicit ruling quoted above.\n\nC. Special Circumstance Issues\n\nThe jury found true four special circumstance allegations against defendant: that the murder was committed while he was engaged in a robbery (§ 190.2, subd. (a)(17)(i)) and a burglary (id., subd. (a)(17)(vii)), that Allen was killed to prevent her testimony (id., subd. (a)(10)), and that the murder was heinous, atrocious, and cruel (id., subd. (a)(14)). As we explain, two of these special circumstance findings must be set aside.\n\n1. The Felony-murder Special Circumstances\n\nIt is now settled that the jury may sustain a felony-murder special-circumstance allegation against the actual killer without finding he acted with the intent to kill. (People v. Anderson (1987) 43 Cal. 3d 1104, 1145-1147 [240 Cal. Rptr. 585, 742 P.2d 1306].) In order to sustain a felony-murder special-circumstance allegation against an aider and abettor, however, the jury must still find he acted with the intent to kill. (Ibid.)\n\nDefendant contends the two felony-based special-circumstance findings must be reversed because the jury was not instructed to determine whether he intended to kill Allen. He argues that the facts of this case do not show whether he or Cebreros was the actual killer. Thus, the jury may have sustained the robbery-murder and the burglary-murder special-circumstance allegations based on his possible role as an aider and abettor. If so, he argues, the failure to instruct on intent to kill requires reversal.\n\nWe disagree. Defendant's jury was given two instructions explaining the theory of aiding and abetting. First, in connection with the general principles of the case, the jury was instructed that \"A person aids and abets the commission of a crime if with knowledge of the unlawful purpose of the perpetrator of the crime he intentionally aids, promotes, encourages, or instigates by act or advice the commission of such crime.\" (Italics added.) Later, in being instructed on the special circumstances, the jury was told: \"If either defendant . . . was not the actual killer, it must be proved beyond a reasonable doubt that he intentionally aided, abetted, counselled, commanded, induced, solicited, requested or assisted the actual killer in the commission of the murder in the first degree before you are permitted to find the alleged special circumstance of that first degree murder to be true as to that defendant.\" (Italics added.)\n\nThis latter instruction is indistinguishable from one this court approved in People v. Warren (1988) 45 Cal. 3d 471 [247 Cal. Rptr. 172, 754 P.2d 218]. In that case, the defendant claimed that the instructions did not adequately require the jury to find he, an aider and abettor, acted with the intent to kill. After stating the rule that intent to kill must be shown before a felony-based special-circumstance allegation can be sustained against an aider and abettor, we concluded that \"a reasonable juror would understand the language of the instructions to declare that very rule: 'the defendant was . . . a person who intentionally aided, abetted, counseled, commanded, induced, solicited, requested or assisted the actual killer in the commission of murder in the first degree.' Therefore, the instructions, so understood, state the law correctly.\" (Id. at p. 487.) Because essentially the same instruction was given in the present case, we conclude that defendant's jury necessarily found defendant, if he was an aider and not the actual killer, acted with the intent to kill.\n\nDefendant focuses on the felony-murder instructions to argue for a contrary conclusion. He notes the jury was also told that, for purposes of the felony-murder rule, the killing can be unintentional or even accidental so long as it occurs while the killer is engaged in an enumerated felony. Thus, defendant claims the jury may only have found he intentionally aided in the\n\nburglary and robbery with Allen's killing being merely accidental. If so, no intent to kill would be present.\n\nWe rejected this precise argument in Warren, supra, 45 Cal. 3d at pages 487-488, finding no reasonable juror would interpret the jury instructions in such a \"hypertechnical manner.\" Moreover, two other reasons support rejection of this contention. First, the special circumstance instruction on aiding and abetting mirrors the language in section 190.2, subdivision (b), and thus unambiguously sets forth the rule that \"the aider and abetter must intentionally aid in a killing.\" (Anderson, supra, 43 Cal. 3d at p. 1145, italics in original.) Thus, the instructions cannot reasonably be interpreted to require only aiding in a felony which forms the basis of a felony murder. Second, as explained post, the jury's verdict on the witness-killing special circumstance precludes a finding that the killing was unintentional. Thus, defendant could not have been convicted of intentionally aiding an accidental killing.\n\nAlthough not raised by defendant, the burglary-murder special circumstance must be set aside for the same merger problems discussed ante, at page 509, i.e., the jury instructions improperly permitted the jury to find a burglary based on defendant's intent to commit an assault. (Wilson, supra, 1 Cal. 3d at p. 441; see generally People v. Garrison (1989) 47 Cal. 3d 746, 788-789 [254 Cal. Rptr. 257, 765 P.2d 419] [striking two burglary-murder special circumstances for the same reasons despite the issue not being raised by defendant].)\n\n2. The Witness-killing Special Circumstance\n\nThe jury sustained the special circumstance allegation set forth in section 190.2, subdivision (a)(10), i.e., that \"[t]he victim was a witness to a crime who was intentionally killed for the purpose of preventing [her] . . . testimony in any criminal proceeding, and the killing was not committed during the commission . . . of the crime to which [s]he was a witness.\" Defendant first contends we must reverse this finding because the jury was not instructed to find he acted intentionally, reiterating his argument that he may have merely aided Cebreros, the actual killer. As explained above, however, the instructions adequately required the jury to find the necessary intent for an aider and abettor.\n\nSecond, defendant claims that before a jury may sustain a witness-killing special-circumstance allegation, there must be a pending criminal proceeding at the time of the killing. We rejected this argument in People v. Weidert (1985) 39 Cal. 3d 836 [218 Cal. Rptr. 57, 705 P.2d 380], explaining that \"if an accused believes himself to be exposed to criminal prosecution\n\nand intentionally kills another to prevent that person from testifying in an anticipated or pending criminal proceeding, the special circumstance may be found true whether or not an actual criminal proceeding was pending or about to be initiated.\" (Id. at pp. 853-854.)\n\nDefendant next claims the trial court confused the jury by delivering an instruction defining the crime of dissuading a witness (§ 136.1) immediately before instructing the jury on the witness-killing special circumstance.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Inasmuch as he was not charged with violating section 136.1, he claims that the instruction \"may\" have created \"serious confusion\" on the part of the jury. We disagree.\n\nBefore the challenged instruction was given, the jury was instructed on burglary, a charged offense. In addition to robbery, assault, and false imprisonment, dissuading a witness was listed as a possible felony that defendant intended to commit when he entered Boender's apartment. Thus, the challenged instruction explained a \"general principle[] of law relevant to the issues raised by the evidence\" and was \"necessary for the jury's understanding of the case.\" (People v. Wickersham (1982) 32 Cal. 3d 307, 323 [185 Cal. Rptr. 436, 650 P.2d 311], quoting People v. Sedeno (1974) 10 Cal. 3d 703, 715-716 [112 Cal. Rptr. 1, 518 P.2d 913], internal quotation marks omitted.)\n\nDefendant also asserts the potential for confusion was great because the crime of dissuading a witness carries different elements from the witness-killing special circumstance. Any potential confusion, however, was dispelled by the explicit instruction on the special circumstance. Thus, the instruction required, \"One, that the person killed was a witness to a crime; two, that the witness was intentionally killed for the purpose of preventing his or her testimony in a criminal proceeding; and three, that the killing was not committed during the commission . . . of the crime to which the person killed was a witness.\" Expressed in such a straightforward manner, we find the possibility that the jury sustained the special circumstance without finding these explicit elements is quite remote.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e\n\nDefendant further argues that the potential for misleading the jury was heightened by the trial court's delivery of the instruction concerning dissuading a witness immediately before instructing on the witness-killing special circumstance. However, \"[t]he general rule is that the order in which instructions are given is immaterial\" (People v. Carrasco (1981) 118 Cal. App. 3d 936, 942 [173 Cal. Rptr. 688]; see also 21 Cal.Jur.3d (Rev.), Criminal Law, § 3052, p. 704), and the jury here was specifically instructed that \"[t]he order in which these instructions are given has no significance as to their relative importance.\" We thus conclude the proximity of the challenged instruction to the instruction explaining the witness-killing special circumstance did not work to defendant's prejudice.\n\nDefendant next claims that section 190.2, subdivision (a)(10) should be read to require the jury to find that \"but for\" the intent to prevent Allen from testifying, she would not have been killed. Stated another way, he urges us to find that the statutory phrase \"for the purpose of preventing his testimony\" should be interpreted to mean \"for the sole purpose of . . . .\" He claims this interpretation is necessary to ensure that the special circumstance is not improperly enlarged to encompass one who kills when the elimination of a witness is merely incidental to the crime. (Cf. Green, supra, 27 Cal. 3d 1 [commission of felony incidental to a killing cannot support felony-murder special circumstance].)\n\nWe reject defendant's attempted analogy to Green, supra. First, nothing in the legislative scheme indicates an intent to limit the scope of the witness-killing special circumstance as defendant suggests. The facts of this case are illustrative. Defendant's intent in killing Allen (and in attempting to kill Boender) was clearly twofold: he intended to rob them and to eliminate witnesses from the robbery attempt at Maxwell's trailer. To hold that the witness-killing special circumstance does not apply because defendant had a second reason to kill would unjustifiably reward him for having a criminal ambition greater than one who kills motivated solely by the desire to eliminate a witness.\n\nSecond, we cannot conceive of a situation in which the motive to kill a witness is merely \"incidental\" to the crime. Unlike the \"technical\" robbery committed by the defendant in Green, supra, 27 Cal. 3d 1, when he took his\n\nvictim's jewelry in order to conceal his identity as the murderer, the motive to kill a witness to a previous crime can never be incidental. We hold the plain meaning of the special circumstance is sufficiently limited: the trier of fact must find that the victim was killed \"for the purpose of preventing his testimony.\"\n\nTo the extent defendant is claiming there is insufficient evidence to support the witness-killing special circumstance, he is mistaken. Shortly after the botched attempt to rob Boender at Maxwell's mobilehome, defendant expressed concern that Boender could identify him. Defendant then sought out Cebreros, who \"owed him a favor.\" A few days later, defendant and Cebreros appeared at Boender's apartment, bound and blindfolded Boender and Allen, moved them to separate rooms, and struck both savagely on the back of the head. Allen died but Boender survived. From this evidence, the jury could infer that defendant intended to kill the two due to their ability to identify him as their assailant at Maxwell's home a few days earlier.\n\n3. The Heinous, Atrocious and Cruel Special Circumstance\n\nDefendant also contends the jury's finding that the murder was heinous, atrocious and cruel (see § 190.2, subd. (a)(14)) must be set aside because the terms of that special circumstance are unconstitutionally vague. We agree. (People v. Superior Court (Engert), supra, 31 Cal. 3d 797.)\n\nD. Penalty Phase Issues\n\n1. Prejudicial Effect of Excessive Special Circumstances\n\nDefendant claims the death penalty must be reversed because all four special circumstance findings are invalid. As explained ante, only two special circumstance findings -- the so-called heinous, atrocious and cruel special circumstance and the burglary-murder special circumstance -- must be set aside. Although we assume defendant would argue that the jury's consideration of even one invalid special circumstance requires reversal of the penalty judgment, we disagree. The United States Supreme Court has upheld a death penalty judgment despite invalidation of one of several aggravating factors (Zant v. Stephens (1983) 462 U.S. 862 [77 L.Ed.2d 235, 103 S.Ct. 2733]), and this court is in accord. (See People v. Silva (1988) 45 Cal. 3d 604, 632-636 [247 Cal. Rptr. 573, 754 P.2d 1070] [affirming despite the jury's consideration of invalid special-circumstance findings]; Allen, supra, 42 Cal. 3d at pp. 1281-1283 [same].)\n\nIn this case, the jury properly considered two special circumstances (robbery-murder and witness-killing) and two improper special circumstances\n\n(heinous-murder and burglary-murder). Although the prosecutor mentioned the heinous-murder special circumstance in closing argument, he did not heavily rely on it, instead choosing to stress the circumstances of the crime itself. (See Allen, supra, 42 Cal. 3d at pp. 1279-1280.) After merely listing the four special circumstances the jury had sustained, the prosecutor addressed the applicable aggravating factors, noting Allen's killing was \"a cold, calculated, callous act. You have already concluded and correctly so that it fell within the special circumstance known as especially heinous, atrocious and cruel murder, that it exhibited exceptional depravity . . . .\"\n\nDespite the latter statement, the prosecutor did not urge the jury to impose the death penalty merely because the crime could be categorized as heinous or atrocious, or because of the sheer number of special circumstances. (See People v. Silva, supra, 45 Cal. 3d 604, 635.) Instead, he described and emphasized the circumstances of the crime, saying it was a \"pitiless act committed against a young, defenseless woman in the prime of her life.\" Later, he argued that the jury could \"also consider not only the brutal murder of Janice Allen, but the vicious attack on Dale Boender two days before and [the] equally vicious attack on him the night of the murder of Janice Allen. Those are circumstances and factors which you certainly should consider in this case.\" (Italics added.) As in Silva, supra, \"we conclude a reasonable juror would not have been swayed by abstract concepts of 'heinous[, atrocious or cruel]' . . . but would instead have focused on the actual circumstances of the offense which formed the foundation for finding those special circumstances to be true.\" (Id. at p. 635.)\n\nConsideration of the invalid burglary-murder special circumstance was similarly benign. Again, the prosecutor did not focus on the bare number of special circumstance findings but urged the jury to consider the brutality of the crimes. Because virtually the same facts underlay both the burglary and robbery, and because the jury properly considered the circumstances of the robbery-murder, there was little chance defendant was prejudiced by consideration of the burglary-murder special circumstance.\n\n2. Alleged Brown Error\n\nDefendant maintains reversal of the penalty judgment is required because the jury was instructed that if it concluded \"the aggravating circumstances outweigh the mitigating circumstances, you shall impose a sentence of death.\" (Italics added.) He claims this instruction impermissibly restricted the jury's sentencing discretion and directed a verdict of death.\n\nIn People v. Brown, supra, 40 Cal. 3d 512, reversed on another issue sub nomine California v. Brown (1987) 479 U.S. 538 [93 L.Ed.2d 934, 107 S.Ct.\n\n837], we concluded use of the word \"outweigh\" in the statute \"connotes a mental balancing process, but certainly not one which calls for a mere mechanical counting of factors on each side of the imaginary 'scale,' or the arbitrary assignment of 'weights' to any of them. Each juror is free to assign whatever moral or sympathetic value he deems appropriate to each and all the various factors he is permitted to consider, including [section 190.3,] factor 'k' as we have interpreted it [in People v. Easley (1983) 34 Cal. 3d 858 (196 Cal. Rptr. 309, 671 P.2d 813)]. By directing that the jury 'shall' impose the death penalty if it finds that aggravating factors 'outweigh' mitigating, the statute should not be understood to require any juror to vote for the death penalty unless, upon completion of the 'weighing' process, he decides that death is the appropriate penalty under all the circumstances.\" (People v. Brown, supra, at p. 541 [fn. omitted]; see also People v. Hamilton (1989) 48 Cal. 3d 1142, 1181 [259 Cal. Rptr. 701, 774 P.2d 730]; Allen, supra, 42 Cal. 3d at pp. 1276-1280.)\n\nWhether the unadorned \"shall\" instruction requires reversal depends on the facts of each individual case. Every case \"must be examined on its own merits to determine whether, in context, the sentencer may have been misled to defendant's prejudice about the scope of its sentencing discretion under the 1978 law.\" (People v. Brown, supra, 40 Cal. 3d at p. 544, fn. 17; Allen, supra, 42 Cal. 3d at p. 1277.) Our inquiry on appeal requires us to consider whether the jury instructions, read in conjunction with the prosecutor's arguments, adequately informed the jury of \"its weighing and decision-making responsibility.\" (People v. Williams (1988) 44 Cal. 3d 1127, 1148 [245 Cal. Rptr. 635, 751 P.2d 901]; see also Guzman, supra, 45 Cal. 3d at pp. 958-959.)\n\nThe jury was instructed with former CALJIC No. 8.84.1, which detailed the various aggravating and mitigating factors in the language of the statute and instructed the jury to \"consider, take into account and be guided by\" the factors. Former CALJIC No. 8.84.2 was also given. That instruction informed the jury it \"shall\" impose the death penalty if it found the aggravating circumstances \"outweigh[ed]\" the mitigating ones. No other instructions explaining the jury's role, such as an \"expanded factor (k)\" instruction (see Guzman, supra, 45 Cal. 3d at pp. 956-958; Easley, supra, 34 Cal. 3d at p. 878, fn. 10), were given.\n\nOur first concern is whether the jury was led to believe it should merely count the various factors instead of evaluating the moral weight of each factor. (Guzman, supra, 45 Cal. 3d at p. 959.) We find nothing in the record supporting this possibility. Nowhere did the prosecutor urge the jury to merely count the number of aggravating and mitigating factors and mechanically or arithmetically impose the death penalty. Although at one\n\npoint the prosecutor stated, \"There is nothing to weigh because everything falls on one side of the weighing process,\" this was a permissible observation of the state of the penalty phase evidence inasmuch as defendant declined to present any mitigating evidence. The clear import of this argument was that because of the great weight of the aggravating evidence compared to the dearth of mitigating evidence, death was the appropriate penalty. It is clear the prosecutor was not urging the jury to merely count the factors.\n\nWe thus turn to the question of \"whether the jury understood that it was responsible for deciding for itself whether death is appropriate for the defendant.\" (Guzman, supra, 45 Cal. 3d at p. 959, italics omitted.) The prosecutor began by stating that \"It is the law of the State of California that in certain cases the penalty for first degree murder with special circumstances shall be the death penalty. [para.] This, ladies and gentlemen, is one of those cases.\" We find nothing improper in this statement. It merely restates the law that, for certain defendants convicted of murder, death is the appropriate penalty. This is true: for those defendants as to which a jury decides the aggravating circumstances outweigh the mitigating circumstances, the Penal Code provides that the appropriate penalty is death.\n\nThe prosecutor also explained the meaning of the word \"shall\" in the instructions, saying, \"I emphasize the word 'shall' there because every single aggravating circumstance that the court will read to you is present in this case and there are no mitigating circumstances.\" He also stated that should the jury find the aggravating circumstances outweigh the mitigating ones, \"then it is your duty as jurors to return the death penalty in this case.\"\n\nThis explanation, however, was qualified by language informing the jury to take the statutory factors into \"consideration.\" The prosecutor also told the jury to \"take into account those factors and be guided\" by them. The prosecutor's argument thus fell short of divesting the jury of discretion or leading them to believe that it had no choice but to impose the ultimate penalty. Although he briefly emphasized the word \"shall,\" that alone is not determinative. (See Allen, supra, 42 Cal. 3d at p. 1279 \u0026 fn. 38.)\n\nDefendant relies on two recent cases in which this court reversed penalty judgments for Brown error (People v. Edelbacher (1989) 47 Cal. 3d 983 [254 Cal. Rptr. 586, 766 P.2d 1]; People v. Crandell (1988) 46 Cal. 3d 833 [251 Cal. Rptr. 227, 760 P.2d 423]), but neither is persuasive. We reiterate that we must examine the entire record in each case to determine whether \"the sentencer may have been misled to defendant's prejudice about the scope of its sentencing discretion under the 1978 law.\" (People v. Brown, supra, 40 Cal. 3d at p. 544, fn. 17; Allen, supra, 42 Cal. 3d at p. 1277.) While both cases cited by defendant have some similarity to the present case, there are significant\n\ndifferences. For example, the prosecutor in Crandell \"portrayed the weighing process as being essentially an inquiry into whether the capital offenses were in any way justified or excused rather than a process for determining . . . which of the two penalties was more appropriate.\" (Crandell, supra, at p. 884.) A similar interpretation was offered by the prosecutor in Edelbacher, supra, at page 1038.\n\nBy contrast, the prosecutor in defendant's case carefully went through each statutory factor, concluding that several were present and that no mitigating factors were apparent. In concluding death was the \"proper\" penalty, the prosecutor did not argue that the jury was divested of its discretion but that after weighing the statutory factors, the \"proper\" penalty was death. As in Guzman, supra, 45 Cal. 3d 915, \"we cannot agree that [the prosecutor's] statements, read as a whole, misinformed the jury about its weighing and sentencing discretion.\" (Id. at p. 960.)\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\n3. Failure to Present Mitigating Evidence\n\nFollowing the jury's verdict of first degree murder with four special circumstances, defense counsel Hoover explained to the trial court that defendant wished that no mitigating evidence be presented on his behalf at the penalty phase of the trial. Mr. Hoover stated that \"I believe [defendant's] position is that life without parole is unacceptable to him. He cannot accept that as an alternative whatsoever; and for that reason does not want me to ask the jury for that alternative. He does not consider it to be viable. He cannot reconcile it in his own mind. [para.] As I explained to the court, this again causes me a dilemma. This attitude is not new. It's something that hasn't just come up between us. [para.] I find that it differs substantially from my advice.\" After observing that he was unsure whether he had the power to present mitigating evidence over the express wishes of his client, Mr. Hoover requested the court appoint a medical expert to examine his client.\n\nThe trial court, concerned that defendant may have been relying on an erroneous belief that his chances for a reversal on appeal would be enhanced if he declined to participate in the penalty phase, asked defendant if that was the basis for his decision. Defendant replied in the negative, explaining\n\nthat he had \"approximately 20 reasons that I believe are my basic fundamental thought processes that I have believed in for most of my adult life and the feelings that I do have about life without parole is [that it is] unacceptable.\" The court then appointed Robert Cook, an experienced criminal defense attorney, to counsel defendant about his decision, as well as Dr. Matychowiak -- apparently a psychiatrist -- to examine him.\n\nThe parties returned to court a week later. Defendant had consulted with both Cook and Matychowiak\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e but had not changed his mind about participating in the penalty phase of the trial. After noting that members of defendant's family were present in court, the court questioned defendant further and discovered that he had instructed Mr. Hoover to refrain from cross-examining the prosecution's penalty phase witnesses. In addition, defendant stated he would not be himself addressing the jury.\n\nWhen defendant was asked whether he desired the death penalty, Mr. Hoover explained: \"[defendant] has indicated that he doesn't want me to do anything which would have the ultimate [effect] of receiving a sentence of life without the possibility of parole, a sentence which he finds to be as objectionable to him as the sentence of death and because of that reason, because of his feeling in this regard he would just as soon not present any evidence at this time.\" Mr. Hoover conceded that he did not believe defendant's position was irrational and that he believed defendant was sincere in his belief. Later, he underscored defendant's position: \"I want to make the record clear that he is not requesting one sentence or the other. He finds both sentences objectionable . . . .\"\n\nThe trial court tried one last time to persuade defendant to change his mind, asking, \"Mr. Sanders, does it continue to be your position that you do not wish your counsel to ask any questions nor present any evidence in this penalty phase of the trial?\" Defendant responded: \"That is correct, your Honor.\" The prosecutor thereafter presented his penalty phase evidence. After the prosecutor gave his closing argument to the jury, Mr. Hoover waived argument and the case was submitted to the jury.\n\nWe have identified two potential theories which may cast doubt on a penalty verdict when a capital defendant decides to forgo presentation of mitigating evidence at the penalty phase. First, the absence of mitigating evidence may undermine \"the state's interest in a reliable penalty determination.\" (People v. Deere (1985) 41 Cal. 3d 353, 364 [222 Cal. Rptr. 13, 710 P.2d 925].) Second, a defense counsel's performance may be deemed constitutionally\n\ninadequate if he or she simply accedes to his client's wishes instead of \"making an independent tactical judgment about the presentation of the mitigating evidence.\" (Williams, supra, 44 Cal. 3d at p. 1151; Deere, supra, at pp. 364-368.) Defendant relies on both theories in urging that we reverse the penalty judgment.\n\nAs to the state's independent interest in achieving a reliable penalty verdict, however, we recently concluded that a defendant's failure to present mitigating evidence generally does not render the verdict unreliable in the constitutional sense. \"[T]he required reliability is attained when the prosecution has discharged its burden of proof at the guilt and penalty phases pursuant to the rules of evidence and within the guidelines of a constitutional death penalty statute, the death verdict has been returned under proper instructions and procedures,\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e and the trier of penalty has duly considered the relevant mitigating evidence, if any, which the defendant has chosen to present. A judgment of death entered in conformity with these rigorous standards does not violate the Eighth Amendment reliability requirements.\" (People v. Bloom, supra, 48 Cal. 3d 1194, 1228; see also People v. Lang (1989) 49 Cal. 3d 991, 1030 [264 Cal. Rptr. 386, 782 P.2d 627] [quoting Bloom with approval].)\n\nWe have also disapproved of the suggestion in Deere, supra, 41 Cal. 3d 353, that counsel necessarily provides constitutionally inadequate representation when he or she accedes to a client's wishes and declines to present available mitigating evidence at the penalty phase of a capital trial. (Lang, supra, 49 Cal. 3d at pp. 1030-1031.) At least in the absence of evidence showing counsel failed to investigate available mitigating evidence or advise defendant of its significance (id. at pp. 1032-1033),\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e we cannot say defendant's trial attorney provided ineffective assistance of counsel.\n\nDefendant notes that in contrast to other cases involving this issue (see e.g., Williams, supra, 44 Cal. 3d at p. 1152; Guzman, supra, 45 Cal. 3d at\n\np. 961), he presented absolutely no mitigating evidence in this case. In addition, there was no defense closing argument and counsel did not even cross-examine the prosecution witnesses. (Defense counsel did register several objections during the questioning of the prosecutor's witnesses, however.) Thus, he argues, the jury was left with nothing to \"weigh\" against the People's penalty phase evidence, thereby effectively foreclosing a verdict of life without the possibility of parole.\n\nIn light of our recent decisions disapproving the reasoning of Deere, supra, 41 Cal. 3d 353, we conclude these circumstances do not support a reversal of the penalty judgment. Defendant's knowing and voluntary decision to forgo his right to present mitigating evidence, cross-examine adverse witnesses, and present closing argument at the penalty phase of his trial estops him from now claiming an entitlement to a reversal based on those decisions. (Lang, supra, 49 Cal. 3d at pp. 1031-1032.)\n\nFinally, defendant claims his decision to forgo presentation of evidence at the penalty phase of his trial was tantamount to a guilty plea without the consent of his counsel in violation of section 1018. That section states in pertinent part: \"No plea of guilty of a felony for which the maximum punishment is death, or life imprisonment without the possibility of parole, shall be received from a defendant who does not appear with counsel, nor shall any such plea be received without the consent of the defendant's counsel.\"\n\nWe reject defendant's argument because we find the premise faulty: his decision to refrain from offering evidence is not tantamount to a guilty plea and is thus not governed by section 1018. His choice did not amount to an admission that he believed death was the appropriate penalty, nor did he give up his right to confront or cross-examine those testifying against him at the penalty phase. (Cf. Boykin v. Alabama (1969) 395 U.S. 238, 243 [23 L.Ed.2d 274, 279, 89 S.Ct. 1709]; In re Tahl (1969) 1 Cal. 3d 122, 130-133 [81 Cal. Rptr. 577, 460 P.2d 449].) Moreover, his decision refusing to take part in the penalty phase did not necessarily make it any more likely that his jury would find death was the appropriate penalty. The jury could, for example, have found mitigating factors from evidence presented at the guilt phase.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e We conclude the scope of section 1018 is not so broad as to embrace defendant's decision of nonparticipation in the penalty phase of his trial.\n\n4. Other issues\n\na. \"No Sympathy\" Instruction\n\nPrior to the guilt phase jury deliberations, the trial court instructed the jury not to be \"swayed by sentiment, conjecture, sympathy, passion, prejudice, public opinion or public feeling.\" (See CALJIC No. 1.00.) Following the penalty phase, the jury was instructed: \"You are reminded that you are to be guided by the previous instructions given in the first phase of the case which are applicable to this particular phase of the case.\" Defendant contends this latter instruction injected the \"no sympathy\" instruction into the penalty phase deliberations and improperly precluded the jury's consideration of any sympathetic factors shown by the evidence. We have rejected this argument in previous cases (People v. Allison (1989) 48 Cal. 3d 879, 899, fn. 11 [258 Cal. Rptr. 208, 771 P.2d 1294]; People v. Gates (1987) 43 Cal. 3d 1168, 1209 [240 Cal. Rptr. 666, 743 P.2d 301]), and defendant presents no reason why we should reconsider those decisions.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nb. Dual Use of Underlying Crimes\n\nDefendant asserts the trial court should have modified the standard penalty phase instruction to make clear that factor (b)\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e pertained to criminal activity other than that for which he was convicted in the present proceeding. By failing to modify the instruction, he claims the jury may have \"double counted\" the circumstances of his crimes against Boender and Allen when weighing the various factors during the penalty phase deliberations. We have previously rejected this argument (People v. Ainsworth, supra, 45 Cal. 3d 984, 1032; People v. Miranda, supra, 44 Cal. 3d at pp. 105-106) and, in any event, we find no possibility the jury was misled here. The record shows the prosecutor, in closing argument, clearly tied factor (b) to the evidence of the five armed robberies defendant committed in 1970.\n\nc. Excessive Special Circumstances\n\nCiting the plurality opinion in People v. Harris, supra, 36 Cal. 3d 36, defendant contends the trial court erred by permitting the jury to consider\n\nboth the robbery-murder and the burglary-murder special circumstances in its penalty deliberations. Harris reasoned that when the robbery and burglary were committed as part of an indivisible transaction, section 654\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e precludes a finding of multiple special circumstances. (36 Cal. 3d at p. 65.)\n\nWe have since rejected the Harris plurality on this point. (People v. Bean (1988) 46 Cal. 3d 919, 954-955 [251 Cal. Rptr. 467, 760 P.2d 996]; People v. Melton (1988) 44 Cal. 3d 713, 765-769 [244 Cal. Rptr. 867, 750 P.2d 741].) Thus, \"any robbery and burglary committed by defendant in the course of his homicidal conduct could properly be considered an independent aggravating factor. Each involved violation of [a] distinct interest that society seeks to protect, and a defendant who commits both offenses in the course of a murder may be deemed more culpable than a defendant who commits only one.\" (Bean, supra, at pp. 954-955.) Thus, the trial court did not err in permitting the jury to consider both special circumstances.\n\n5. Proportionality Review\n\nDefendant submits this court must engage in both intracase and intercase proportionality review. Initially, he complains that because the People declined to seek the death penalty against codefendant Cebreros, and because they never proved which of the two men was the actual killer, death is a constitutionally disproportionate penalty in this case. He also urges this court to undertake comparative sentence review, claiming we will find his crime much less serious than others for which only life terms were imposed.\n\nWe may quickly reject this latter argument: neither the federal nor the state Constitution compels comparative sentence review and we have in numerous cases declined to undertake such review. (People v. Caro (1988) 46 Cal. 3d 1035, 1068 [251 Cal. Rptr. 757, 761 P.2d 680]; People v. Poggi, supra, 45 Cal. 3d 306, 348; People v. Rodriguez (1986) 42 Cal. 3d 730, 777-779 [230 Cal. Rptr. 667, 726 P.2d 113]; see Pulley v. Harris (1984) 465 U.S. 37 [79 L.Ed.2d 29, 104 S.Ct. 871].)\n\nWe also reject defendant's claim for relief based on a comparison of his sentence and the sentence imposed on Cebreros. Although the evidence of guilt was largely the same for the two defendants, the determination of penalty requires the jury to engage in a normative function, weighing \"non-quantifiable\" or intangible aspects of both the crime and the criminal.\n\n(Allen, supra, 42 Cal. 3d at p. 1287.) Thus, \"[t]he peculiarly normative and individualized nature of the jury's sentence determination in each case makes it inappropriate and of no benefit to consider the sentence imposed in superficially similar cases for the purpose of determining the prejudicial effect of error.\" (People v. Malone (1988) 47 Cal. 3d 1, 57, fn. 31 [252 Cal. Rptr. 525, 762 P.2d 1249]; see also People v. Dyer (1988) 45 Cal. 3d 26, 69-71 [246 Cal. Rptr. 209, 753 P.2d 1] [rejecting this precise argument].)\n\nMoreover, we observe that of the two assailants, defendant was the one with the motive to silence Boender and Allen; he -- and not Cebreros -- was the one armed with a firearm. On the state of the evidence he was as likely as Cebreros to have been the actual killer and the jury found, at least impliedly, that he acted with the intent to kill, and that he had committed five prior armed robberies. Thus, even were we disposed to find significance in the fact that Cebreros received a life sentence, we cannot conclude that defendant's death sentence is constitutionally suspect.\n\nFinally, to the extent defendant is claiming his sentence is constitutionally disproportionate under article I, section 17 of the California Constitution (People v. Dillon (1983) 34 Cal. 3d 441, 449-484 [194 Cal. Rptr. 390, 668 P.2d 697]; In re Lynch (1972) 8 Cal. 3d 410, 423-429 [105 Cal. Rptr. 217, 503 P.2d 921]), we conclude that in light of the aforementioned facts of his case, his sentence is not disproportionate to his individual culpability.\n\nIII. Conclusion\n\nThe heinous, atrocious and cruel special circumstance, as well as the burglary-murder special circumstance, is set aside. The judgment as to both guilt and penalty is otherwise affirmed.\n\nDisposition\n\nThe heinous, atrocious and cruel special circumstance, as well as the burglary-murder special circumstance, is set aside. The judgment as to both guilt and penalty is otherwise affirmed.\n\nMOSK, J.\n\nI dissent.\n\nIn my view, the judgment should be reversed in its entirety. I agree with Justice Broussard that defendant's right to trial by a jury drawn from a representative cross-section of the community, which is guaranteed by both the Sixth and Fourteenth Amendments to the United States Constitution and article I, section 16, of the California Constitution, was violated in this case by the systematic underrepresentation of Hispanics. (See dis. opn. of Broussard, J., post, at pp. 538-543.)\n\nFurther, the judgment should be reversed as to penalty on separate and independent grounds. As I shall explain, the verdict of death should be\n\nvacated because of Deere error (People v. Deere (1985) 41 Cal. 3d 353 [222 Cal. Rptr. 13, 710 P.2d 925]) and also because of Brown error (People v. Brown (1985) 40 Cal. 3d 512 [220 Cal. Rptr. 637, 709 P.2d 440], revd. on other grounds sub nom. California v. Brown (1987) 479 U.S. 538 [93 L.Ed.2d 934, 107 S.Ct. 837]).\n\nI\n\nDefense counsel's failure to present available evidence in mitigation at the penalty phase resulted in a verdict of death that does not satisfy the heightened degree of reliability required by the Eighth Amendment to the United States Constitution and article I, section 17, of the California Constitution.\n\nAfter the guilt phase, defense counsel stated in substance that at defendant's request and against his own best judgment, he would not participate in the penalty phase. He made it plain that he had mitigating evidence available: \"[Defendant's] mother, his father, his grandmother and his sister are all here in this courtroom. I can put on the evidence.\" But he also made it plain that at defendant's request, he would not present such evidence.\n\nAt the penalty phase, the prosecution put on a case for death. Other than making a few objections, the defense did nothing at all.\n\nIn People v. Deere, supra, 41 Cal. 3d 353, the court reversed a judgment of death on the ground that defense counsel's failure to present evidence in mitigation -- although in accord with his client's wishes -- rendered the penalty determination constitutionally unreliable. As I stated in my concurring and dissenting opinion in People v. Williams (1988) 44 Cal. 3d 1127, 1158-1159 [245 Cal. Rptr. 635, 751 P.2d 901]:\n\n\"First, the [ Deere ] court determined that counsel's failure to present evidence in mitigation introduced error into the penalty proceeding.\n\n\"'To permit a defendant convicted of a potentially capital crime to bar his counsel from introducing mitigating evidence at the penalty phase . . . would . . . prevent this court from discharging its constitutional and statutory duty to review a judgment of death upon the complete record of the case, because a significant portion of the evidence of the appropriateness of the penalty would be missing.\n\n\"'This deficiency of the record implicates another paramount concern of the state: \"in capital cases . . . the state has a strong interest in reducing the risk of mistaken judgments.\" . . . Since 1976 the United States Supreme Court has repeatedly recognized that the qualitative difference between\n\ndeath and all other penalties demands a correspondingly higher degree of reliability in the determination that death is the appropriate punishment. (Woodson v. North Carolina (1976) 428 U.S. 280, 305 [49 L.Ed.2d 944, 961, 96 S.Ct. 2978] (plur. opn.).) And since 1978 the high court has insisted that the sentencer must be permitted to consider any aspect of the defendant's character and record as an independently mitigating factor. (Lockett v. Ohio (1978) 438 U.S. 586, 604-605 [57 L.Ed.2d 973, 989-990, 98 S.Ct. 2954] (plur. opn. of Burger, C. J.).)\n\n\"'To allow a capital defendant to prevent the introduction of mitigating evidence on his behalf withholds from the trier of fact potentially crucial information bearing on the penalty decision no less than if the defendant was himself prevented from introducing such evidence by statute or judicial ruling. In either case the state's interest in a reliable penalty determination is defeated.' (41 Cal. 3d at pp. 363-364.)\n\n\"Next, the [ Deere ] court determined that so long as 'the record . . . demonstrates \"the possibility that at least someone might have been called to testify on defendant's behalf and to urge that his life be spared\"' (41 Cal. 3d at p. 367, italics in original), the error introduced into the penalty proceeding by counsel's failure to present evidence in mitigation cannot be deemed harmless. The court explained:\n\n\"'When the sentencer in a capital case is deprived of all or a substantial part of the available evidence in mitigation, \"the potential for prejudice is too obvious to require proof.\" [Citation.] Indeed, \"short of substituting a verdict of its own, there is no way for a reviewing court to determine what effect unpresented mitigating evidence might have had on the sentencer's decision.\" [Citation.] We have no doubt that a judgment of death imposed in such circumstances constitutes a miscarriage of justice (Cal. Const., art. VI, § 13): not only did defendant not have a fair penalty trial -- in effect he had no penalty trial at all.' (41 Cal. 3d at p. 368.) \"\n\nI turn now to the case at bar. On the face of the record it is plain that Deere error occurred: at defendant's request, counsel declined to present available evidence in mitigation, and indeed effectively declined to participate in any manner in the penalty phase.\n\nIt is also plain that the error here cannot be deemed harmless. As in Deere, \"the record . . . demonstrates 'the possibility that at least someone might have been called to testify on defendant's behalf and to urge that his life be spared.'\" (People v. Deere, supra, 41 Cal. 3d at p. 367, italics in original.) In this case, such potential witnesses were available, including defendant's father and mother, his grandmother, and his sister.\n\nAccordingly, I would set aside the verdict of death as constitutionally unreliable and would reverse the judgment as to penalty. (See People v. Deere, supra, 41 Cal. 3d at p. 368.)\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nII\n\nThe trial court committed error under People v. Brown, supra, 40 Cal. 3d 512, by instructing the jury in accordance with the mandatory sentencing language of the final paragraph of Penal Code section 190.3 (hereafter section 190.3).\n\nThe statutory provision declares: \"After having heard and received all of the evidence, and after having heard and considered the arguments of counsel, the trier of fact shall consider, take into account and be guided by the aggravating and mitigating circumstances . . ., and shall impose a sentence of death if the trier of fact concludes that the aggravating circumstances outweigh the mitigating circumstances.\" (Italics added.)\n\nThe instruction stated: \"After having heard all of the evidence, and after having heard and considered the arguments of counsel, you shall consider, take into account and be guided by the applicable factors of aggravating and mitigating circumstances . . . . [para.] If you conclude that the aggravating circumstances outweigh the mitigating circumstances, you shall impose a sentence of death.\" (Italics added.)\n\nIn Brown the court construed the final paragraph of section 190.3 as follows. \"In [its] context, the word 'weighing' is a metaphor for a process which by nature is incapable of precise description. The word connotes a mental balancing process, but certainly not one which calls for a mere mechanical counting of factors on each side of the imaginary 'scale,' or the arbitrary assignment of 'weights' to any of them. Each juror is free to assign whatever moral or sympathetic value he deems appropriate to each and all\n\nof the various factors he is permitted to consider . . . . By directing that the jury 'shall' impose the death penalty if it finds that aggravating factors 'outweigh' mitigating, the statute should not be understood to require any juror to vote for the death penalty unless, upon completion of the 'weighing' process, he decides that death is the appropriate penalty under all the circumstances. Thus the jury, by weighing the various factors, simply determines under the relevant evidence which penalty is appropriate in the particular case.\" (40 Cal. 3d at p. 541, fn. omitted.)\n\nStated simply, the jury is \"require[d] . . . to make a moral assessment on the basis of the character of the individual defendant and the circumstances of the crime and thereby decide which penalty is appropriate in the particular case.\" (People v. Bonin (1989) 47 Cal. 3d 808, 856 [254 Cal. Rptr. 298, 765 P.2d 460].) In other words, \"The jury is not simply to determine whether aggravating factors outweigh mitigating factors and then impose the death penalty as a result of that determination, but rather it is to determine, after consideration of the relevant factors, whether under all the circumstances 'death is the appropriate penalty' for the defendant before it.\" (People v. Myers (1987) 43 Cal. 3d 250, 276 [233 Cal. Rptr. 264, 729 P.2d 698] (lead opn. by Grodin, J.).)\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nIn Brown, however, the court recognized that a jury might not understand an instruction incorporating section 190.3's mandatory sentencing language in accordance with the construction of the provision that it had adopted. Specifically, the court acknowledged that the statutory language might mislead the jury as to the scope of their discretion to the defendant's prejudice. (40 Cal. 3d at p. 544, fn. 17.) A juror might reasonably understand that language to define the penalty determination as \"simply a finding of facts\" (id. at p. 540) or \"a mere mechanical counting of factors on each side of the imaginary 'scale'\" (id. at p. 541). In other words, he might be misled as to the nature of the process by which penalty is determined. A juror might also reasonably understand the language to require him to vote for death if he finds that the evidence in aggravation outweighs the evidence in mitigation -- even if he concludes that death is not the appropriate penalty under all the circumstances. (See id. at pp. 540-544.) That is to say, he might be misled as to the character of the ultimate question to be resolved in the process of determining penalty.\n\nIn deciding whether an instruction incorporating section 190.3's mandatory sentencing language would constitute error in a given case, the court has applied the so-called \"reasonable juror\" standard, which was suggested in Brown itself: could a juror have reasonably understood the charge to carry a meaning that was contrary to the governing law?\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nIn this case, the trial court's instruction on the determination of penalty might indeed have misled the jury as to the scope of their discretion to defendant's prejudice. A reasonable juror could have understood the charge\n\nas requiring him simply to determine whether aggravating circumstances outweighed mitigating and then fix the penalty as the mandatory sentencing language directed. Review of the record discloses the following.\n\nTo begin with, the trial court instructed the jury in accordance with the mandatory sentencing language of the final paragraph of section 190.3 without material modification. As noted, the statutory provision declares, \"the trier of fact . . . shall impose a sentence of death if the trier of fact concludes that the aggravating circumstances outweigh the mitigating circumstances.\" (Italics added.) The instruction stated, \"If you conclude that the aggravating circumstances outweigh the mitigating circumstances, you shall impose a sentence of death.\" (Italics added.)\n\nMoreover, in anticipation of the trial court's instruction, the prosecutor in his summation emphasized, and misleadingly explicated, the mandatory sentencing language. Indeed, he used that language to frame the \"major premise\" of his argument: \"If aggravation outweighs mitigation, you must impose death. Aggravation does, in fact, outweigh mitigation. Therefore, you must impose death.\"\n\nThe prosecutor opened his summation thus.\n\n\"Ladies and gentlemen, it now becomes your decision whether the penalty in this case to be imposed on Ronald Lee Sanders shall be death or life in the state prison without possibility of parole.\n\n\". . .\n\n\"I know the decision that you have to make is not a pleasant one and I certainly wouldn't want you to take your job lightly. However, on the other hand, you have a sworn duty as jurors in this case to follow the law of this state as the court gives it to you when I have concluded my remarks.\n\n\"All of you told us during the jury selection process that you would not relish the idea of returning a death penalty verdict, however, you also told us that you could do so in the proper case.\n\n\"It is the law of the State of California that in certain cases the penalty for first degree murder with special circumstances shall be the death penalty.\n\n\"This, ladies and gentlemen, is one of those cases, . . . .\n\n\". . .\n\n\"The court will read to you certain aggravating factors and certain mitigating factors which you should take into consideration in making your decision.\n\n\"The court will tell you that you should take into account those factors and be guided by those factors in your deliberation, and then the court will read you a very important instruction which you cannot ignore because of a duty to the People of the State of California as well as the defendant who is on trial here.\n\n\"This instruction reads as follows:\n\n\" If you conclude that the aggravating circumstances in this case outweigh the mitigating circumstances, you shall impose the death penalty. In other words, you have got to look at the circumstances, the factors that the judge reads to you, make a determination if the aggravating circumstances outweigh the mitigating circumstances.\n\n\" If you conclude that they do, then it is your duty as jurors to return the death penalty in this case.\n\n\" I emphasize the word 'shall' there because every single aggravating circumstance that the court will read to you is present in this case and there are no mitigating circumstances.\n\n\"There is nothing to weigh because everything falls on one side of the weighing process. Therefore, under the law the proper sentence in this case is in fact the sentence of death.\" (Italics added.)\n\nThe prosecutor then reviewed the statutory penalty factors and the evidence he claimed was relevant thereto. The gist of his argument was that aggravation was present and mitigation was absent.\n\nFinally, the prosecutor closed his summation thus: \"I will repeat that instruction to you again. If you would conclude that the aggravating circumstances outweigh the mitigating circumstances, you shall impose the sentence of death. There are no mitigating circumstances in this case, and the proper penalty is the death penalty.\" (Italics added.)\n\nIn arguing as he did, the prosecutor delivered the message that the law required the jury simply to determine whether aggravating circumstances outweighed mitigating circumstances and then fix the penalty as the mandatory sentencing language directed. That message, of course, was erroneous. It incorrectly described the character of the ultimate question to be resolved in the process of determining penalty: \"The jury is not simply to determine\n\nwhether aggravating factors outweigh mitigating factors and then impose the death penalty as a result of that determination . . . .\" (People v. Myers, supra, 43 Cal. 3d at p. 276 (lead opn. by Grodin, J.); see, e.g., People v. Bonin, supra, 47 Cal. 3d at p. 856; People v. Brown, supra, 40 Cal. 3d at p. 541.) To my mind, a reasonable juror could not have ignored the prosecutor's words or missed their import.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nAccordingly, I conclude that the trial court's instruction in accordance with the mandatory sentencing language of the final paragraph of section 190.3 might indeed have misled the jury as to the scope of their discretion to defendant's prejudice. Therefore, I would set aside the verdict of death and reverse the judgment as to penalty. (See, e.g., People v. Farmer (1989) 47 Cal. 3d 888, 931 [254 Cal. Rptr. 508, 765 P.2d 940].)\n\nIII\n\nFor the reasons stated above, I would reverse the judgment in its entirety.\n\nBROUSSARD, J.\n\nI dissent. I agree with Justice Mosk that error relating to the instructions and argument at the penalty trial requires reversal of that verdict. (See People v. Brown (1985) 40 Cal. 3d 512, 538-544 [220 Cal. Rptr. 637, 709 P.2d 440].) Two other errors also affect the judgment. First, the use of voter registration lists as the sole source for the master jury list deprived defendant of his constitutional right to trial by a jury drawn from a representative cross-section of the community (U.S. Const., Amends. VI, XIV; Cal. Const., art. I, § 16). Second, the trial court erroneously excluded for cause a prospective juror because of his generalized opposition to the death penalty, despite the lack of any showing that he could not conscientiously perform his duties as a juror in a capital case. (See Witherspoon v. Illinois (1968) 391 U.S. 510, 519 [20 L.Ed.2d 776, 88 S.Ct. 1770]; Wainwright v. Witt (1985) 469 U.S. 412, 431 [83 L.Ed.2d 841, 856, 105 S.Ct. 844], People v. Stanworth (1969) 71 Cal. 2d 820, 837 [80 Cal. Rptr. 49, 457 P.2d 889].)\n\nI.\n\nDefendant made a prima facie showing that the system by which jury venires\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ea were selected in Kern County at the time of his trial produced venires that were substantially underrepresentative of the Hispanic population of the community. Defendant argues that this system of jury selection violated his right to a jury drawn from a representative cross-section of the community under the Sixth and Fourteenth Amendments to the United States Constitution and article I, section 16, of the California Constitution. The majority opinion rejects this argument, citing People v. Bell (1989) 49 Cal. 3d 502, 520-531 [262 Cal. Rptr. 1, 778 P.2d 129]. But this case is not the same as Bell. That decision required a defendant to prove not only that the system of selecting jurors underrepresented a cognizable group, but also to identify the probable source of the underrepresentation. (See p. 524.) Here defendant has done so, presenting proof that the county selected jurors exclusively from a source -- the voter registration lists -- known to underrepresent Hispanics. When a defendant does identify the source of the underrepresentation, as has the defendant here, the burden should shift to the prosecution to demonstrate that the particular procedure at issue is justified.\n\nIn People v. Harris (1984) 36 Cal. 3d 36 [201 Cal. Rptr. 782 [679 P.2d 433], we held that on the facts of that case, the exclusive use of the voter registration lists as a basis for selecting jurors deprived the defendant of his right to a representative jury. The reason, we explained, is \"that there is a large and increasing proportion of the general population that fails to register to vote, and that the proportion of minorities failing to register is larger than that for the general population.\" (P. 52.) If a minority group fails to register in proportion to its numbers, the county's decision to use the voter registration list as the exclusive source of jurors is a decision that this group will be underrepresented on its juries. Indeed, the Legislature has now recognized that voter registration lists do not yield representative juries, and has mandated counties to supplement those lists in the selection of jury venires.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003ea (See Code Civ. Proc., § 197.)\n\nThe Sixth Amendment to the United States Constitution and article I, section 16 of the California Constitution guarantee a criminal defendant the right to a trial by an impartial jury drawn from a representative cross-section of the community. (Taylor v. Louisiana (1975) 419 U.S. 522, 530 [42 L.Ed.2d 690, 698, 95 S.Ct. 692]; People v. Wheeler (1978) 22 Cal. 3d 258, 272 [148 Cal. Rptr. 890, 583 P.2d 748].) This guaranty means that \"a party is constitutionally entitled to a petit jury that is as near an approximation of the ideal cross-section of the community as the process of random draw permits.\" (22 Cal. 3d at p. 277.)\n\nIn Duren v. Missouri (1979) 439 U.S. 357 [58 L.Ed.2d 579, 99 S.Ct. 664], the United States Supreme Court described a defendant's burden in asserting a fair cross-section challenge to a jury venire. The court held that in order to establish a prima facie violation of the fair cross-section requirement, a defendant must show (1) that the group alleged to be excluded is a \"distinctive\" group in the community; (2) that the representation of this group in venires from which juries are selected is not fair and reasonable in relation to the number such persons in the community; and, (3) that this underrepresentation is due to systematic exclusion of the group in the jury selection process. (P. 364 [58 L.Ed.2d at p. 579]; accord People v. Harris, supra, 36 Cal. 3d 36, 50.)\n\nDefendant in this case based his motion to quash on the testimony presented in three other jury challenges in Kern County Superior Court. (See People v. Cantu, Nos. 21891, 22229; People v. Robinson, No. 21518; People v. Streeter, Nos. 22346, 22056, 21910, 21368.) By stipulation, the evidence in these cases was incorporated into the record, and defendant's motion was submitted on those transcripts.\n\nThe majority concede that defendant's showing establishes that \"the first prong of the Duren test is clearly satisfied.\" (See maj. opn., ante, p. 491.) Defendant has also satisfied the second and third prongs of the Duren test. With regard to the second prong -- that the number of members of the cognizable group in the jury pool is not fair and reasonable in relation to the number of its members in the relevant community -- defendant showed a \"significant disparity based on the use of total population figures.\"\u003cspan class=\"fnref\"\u003e3\u003c/span\u003ea (See Harris, supra, 36 Cal. 3d at p. 54.) Under the calculation in People v. Cantu that Hispanics represented 17.76 percent of the county's adult population (21.95 percent of total population) and 8.3 percent of the jury pool, there is an absolute disparity of 9.46 percent and a comparative disparity of minus 114 percent (or approximately 53 percent).\n\nBut while under Harris the showing based on total population figures is sufficient, defendant here went further and showed that the use of voter registration lists underrepresents the proportion of Hispanics eligible for jury service. The evidence presented in Cantu and Robinson, and incorporated into this case, showed that Hispanics comprised 16.3 percent of the jury eligible population (as compared to 17.76 percent of the total population), but still only 8.3 percent of the registered voters. Using those figures, there is an absolute disparity of 8 percent and a probability of less than one in one million that the disparity could have occurred by chance.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003ea\n\nFinally, defendant has also satisfied prong three of the Duren test, i.e., that the alleged underrepresentation must be due to systematic exclusion of a cognizable group in the jury selection process. (Duren v. Missouri, supra, 439 U.S. at p. 364 [58 L.Ed.2d at p. 587].) It is here that the majority rests its holding, concluding that defendant failed to make the requisite showing of systematic underrepresentation. The majority err. In my opinion, systematic underrepresentation means only that the disparity is inherent in the particular jury selection process utilized, and not the result of random variations in that system. (Bell, supra, 49 Cal. 3d at p. 565 (dis. opn. of Broussard, J., citing Duren v. Missouri, supra, 439 U.S. at p. 367 [58 L.Ed.2d at pp. 588-589].) But even under the majority view in Bell a defendant satisfies this prong by showing a specific element of the selection system which causes that system to underrepresent a cognizable group. Defendant has done so here. Indeed the prosecutor here conceded that if there is underrepresentation of eligible Hispanics on the jury panel -- and the evidence makes it clear that there is -- \"the only explanation must lie in the fact that this group is underrepresented among registered voters.\"\n\nThe majority reply that the county's system is racially neutral (maj. opn., ante, p. 496.) In fact, everyone -- this court, the state Legislature, and the county itself -- has by now recognized that a jury selection system which relies exclusively on voter registration lists is not racially neutral, and has to be changed.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003ea But the change to a multiple list system took time. The county chose to try defendant under the defective former system, even though that system resulted in racially unrepresentative juries, because it would have cost between $15,000 and $40,000 (less than the cost of this appeal) to put a multiple list system into effect earlier.\n\nAs we have explained (see, e.g., People v. Harris, supra, 36 Cal. 3d at p. 58), to make a showing of violation of the fair cross-section requirement, defendant need not show that the jury commissioner intended to discriminate against Hispanics. All that need be shown is that the system of selection results in denial of a jury pool representing a fair cross-section of the community. The constitutionally mandated goal is a representative jury, not an unbiased commissioner or a facially neutral selection method. The decisions requiring the accused to show systematic, purposeful discrimination do not nullify others which condemn discrimination stemming from negligence or inertia. The latter recognize that official compilers of jury lists may drift into discrimination by not taking action to prevent it. In formulating a panel for a jury, officials must adhere to a standard more stringent than mere abstention from intentional discrimination; they have an affirmative duty to develop and pursue procedures aimed at achieving a fair cross-section of the community. (Avery v. Georgia (1953) 345 U.S. 559, 561 [97 L.Ed. 1244, 1247, 73 S.Ct. 891]; Akins v. Texas (1945) 325 U.S. 398, 403 [89 L.Ed. 1692, 1696, 65 S.Ct. 1276].)\n\nEvidence of a regular and notable disparity led the United States Supreme Court in Duren, supra, 439 U.S. 357, and this court in Harris, supra, 36 Cal. 3d 36, to conclude that the cause of the underrepresentation was inherent in the jury selection process. Here defendant showed more than notable disparity. Here defendant demonstrated that the underrepresentation of Hispanics is due to the selection of jurors solely from voter registration lists. I would hold that defendant has adequately met the third prong of the Duren test, showing systematic exclusion of Hispanics in the jury selection process.\n\nThe right to be vindicated here is the right to a trial by a jury drawn from a fair cross-section of the community. It goes to the very heart of the integrity of the fact-finding process -- the impartiality of the jury. As we recognized in People v. Wheeler, supra, 22 Cal. 3d 258, 276, \"[T]he primary purpose of the representative cross-section requirement . . . is to achieve an overall impartiality by allowing the interaction of the diverse beliefs and values the jurors bring from their group experiences.\" When, as here, Hispanics are underrepresented on jury venires, just as when, in Wheeler, Blacks were peremptorily struck, \"such interaction becomes impossible and the jury will be dominated by the conscious or unconscious prejudices of the majority.\" (Ibid.)\n\nNowhere is a representative jury more critical than in a capital case. In such cases the jury not only resolves the question of guilt or innocence but also serves as the conscience of the community in its most compelling role: it decides whether a person shall live or die. In this life or death determination the interplay of diverse values and views is imperative if a fair and impartial judgment is to be rendered. A just decision in a capital case requires that people of all the different ethnic, racial and religious groups in our society have an equal chance at being selected as jurors. Defendant was denied that right in this case.\n\nII.\n\nIn addition to its error in rejecting defendant's prima facie showing of unconstitutionally unrepresentative jury, the trial court also erred in excluding one juror on the basis of his generalized opposition to the death penalty.\n\nAs required by Hovey v. Superior Court (1980) 28 Cal. 3d 1 [168 Cal. Rptr. 128, 616 P.2d 1301], jurors were questioned separately to determine their views on the death penalty. The voir dire to determine whether Juror Giangregorio was eligible to sit on a capital jury was extremely brief:\n\n\"Q: How do you feel about the death penalty?\n\n\"A: I am against it, your Honor.\n\n\"Q: Are you against in it every case?\n\n\"A: Every instance. I do not believe in it.\" Over defense objection and without further questioning, the court then granted the prosecutor's motion to exclude the juror for cause.\n\nUnder Wainwright v. Witt, supra, 469 U.S. 412, a juror may be excluded because of his views on capital punishment only if \"the juror's views would 'prevent or substantially impair the performance of his duties as a juror in accordance with his instructions and his oath.'\" (P. 424 [83 L.Ed.2d at pp. 851-852], quoting Adams v. Texas (1980) 448 U.S. 38, 45 [65 L.Ed.2d 581, 100 S.Ct. 2521].) The burden of showing that the juror should be excluded is on the party seeking exclusion. (Witt, supra, at p. 423 [83 L.Ed.2d at p. 851].) Deference is due to the trial judge who sees and hears the juror (p. 426 [83 L.Ed.2d at p. 853]); thus the issue on review is whether the judge's findings \"are fairly supported by the record.\" (P. 434 [83 L.Ed.2d at p. 858]; see Darden v. Wainwright (1986) 477 U.S. 168, 176 [91 L.Ed.2d 144, 154, 106 S.Ct. 2464].)\n\nThe brief, unsearching colloquy with Juror Giangregorio is wholly insufficient to show that \"[his] views would prevent or substantially impair the performance of his duties in accord with his instructions and his oath.\" (Wainwright v. Witt, supra, 469 U.S. 412.) Instead, it appears that the trial court simply excluded the juror based on the juror's opposition in principle to the death penalty. Witherspoon v. Illinois, supra, 391 U.S. 510, expressly held that political, religious, or philosophical opposition to capital punishment is insufficient to disqualify a juror. While Wainwright v. Witt, supra, 469 U.S. 412, repudiated as dictum the rigid test set out in footnote 21 of Witherspoon, it expressly reaffirmed Witherspoon 's holding that the exclusion of a juror on the bias of a generalized opposition to capital punishment was unconstitutional.\n\nWitherspoon v. Illinois, supra, 391 U.S. 510, involved a statute which provided that in capital cases \"it shall be a cause for challenge of any juror who shall, on being examined, state that he has conscientious scruples against capital punishment, or that he is opposed to the same.\" (P. 512 [20 L.Ed.2d at p. 779], italics added.) Acting pursuant to that statute, the trial court excused six jurors who \"said that they did not 'believe in the death penalty' . . . without any attempt to determine whether they could nonetheless return a verdict of death.\" (P. 514 [20 L.Ed.2d at pp. 780-781].) The United States Supreme Court found the exclusion of these jurors from the penalty jury unconstitutional, declaring that \"[One] who opposes the death penalty, no less than one who favors it, can make the discretionary judgment entrusted to him by the State and can thus obey the oath he takes as a juror . . . . [W]hen [the State] swept from the jury all who expressed conscientious or religious scruples against capital punishment and all who opposed it in principle, the State crossed the line of neutrality. In its quest for a jury capable of imposing the death penalty, the State produced a jury uncommonly willing to condemn a man to die.\" (Pp. 519-521 [20 L.Ed.2d at pp. 783-784].) \"[W]e hold that a sentence of death cannot be carried out\n\nif the jury that imposed or recommended it was chosen by excluding veniremen for cause simply because they voiced general objections to the death penalty or expressed conscientious or religious scruples against its infliction. No defendant can constitutionally be put to death at the hands of a tribunal so selected.\" (Pp. 522-523 [20 L.Ed.2d at pp. 784-785], fn. omitted.)\n\nIn footnote 21 of Witherspoon v. Illinois (supra, 391 U.S. 510), the court proposed a specific test: jurors could be excluded only if they \"made unmistakably clear . . . that they would automatically vote against the imposition of capital punishment without regard to any evidence that might be developed at the trial of the case before them.\" (P. 522, fn. 21 [20 L.Ed.2d at p. 785].) This language became the \" Witherspoon test\" as applied in the courts of this and other states. (See, e.g., People v. Velasquez (1980) 26 Cal. 3d 425 [162 Cal. Rptr. 306, 606 P.2d 341].)\n\nIn Wainwright v. Witt, supra, 469 U.S. 412, the court rejected the Witherspoon test in favor of the one originally set out in Adams v. Texas, supra, 448 U.S. at page 45 [65 L.Ed.2d at pages 589-590]. It acknowledged, however, that its standard \"leaves trial courts with the difficult task of distinguishing between prospective jurors whose opposition to capital punishment will not allow them to apply the law or view the facts impartially and jurors who, though opposed to capital punishment, will nevertheless conscientiously apply the law to the facts adduced at trial.\" (Witt, supra, 469 U.S. at p. 421 [83 L.Ed.2d at p. 850].) This language makes it clear that even after Witt, opposition to capital punishment by itself is still insufficient to justify removal of a juror. Thus, Witt reaffirmed that Witherspoon was correctly decided on the facts of that case.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003ea Confirming this conclusion, Witt described Witherspoon as representing a necessary balance between a defendant's right to a jury drawn from a fair cross-section of the community and the prosecutor's right to remove a biased juror, and stated \"[W]e adhere to the essential balance struck by the Witherspoon decision in 1968 . . .; we simply modify the test stated in Witherspoon 's footnote 21 to hold that the State may exclude from capital sentencing juries that 'class' of veniremen whose views would prevent or substantially impair the performance of the duties in accordance with their instructions or their oaths.\" (P. 424, fn. 5 [83 L.Ed.2d at p. 852].)\n\nThe California cases following Wainwright v. Witt, supra, 469 U.S. 412, illustrate the circumstances under which a juror can be excluded because of\n\nhis views on capital punishment. In People v. Miranda (1987) 44 Cal. 3d 57, 95 [241 Cal. Rptr. 594, 744 P.2d 1127], the juror asserted that she would \"'never vote for a verdict of death.'\" In People v. Guzman (1988) 45 Cal. 3d 915 [248 Cal. Rptr. 467, 755 P.2d 917], one juror said his mind was a \"closed book,\" and that he was not sure he could conceive of a crime so heinous that he would vote for death. (P. 955.) Upon further questioning he affirmed that he would never vote for the death penalty. (Ibid.) Another juror said, \"I guess conscientiously I would have to say that I would absolutely vote for the life without parole.\" Asked if she would ever so vote \"automatically\", she replied, \"'I would have to say that I would.'\" (P. 956.) In People v. Howard (1988) 44 Cal. 3d 375, 418 [243 Cal. Rptr. 842, 749 P.2d 279], each excluded juror \"unqualifiedly stated he or she would not vote to impose death.\" In People v. Coleman (1989) 48 Cal. 3d 112, 137 [255 Cal. Rptr. 813, 768 P.2d 32], the juror, asked if she would automatically vote against first degree murder, replied, \"'I'm afraid I would avoid the death penalty. I would vote so that I wouldn't have the death penalty on my mind.'\" In People v. Walker (1988) 47 Cal. 3d 605, 624 [253 Cal. Rptr. 863, 765 P.2d 70], the juror asserted that she would vote against the death penalty \"'regardless of what the facts might be in this case.'\" In People v. Boyde (1988) 46 Cal. 3d 212 [250 Cal. Rptr. 83, 758 P.2d 25], a juror was asked whether he could under any circumstances return a death verdict; he responded, \"I can't do it, sir.\" (P. 245.) Another juror said he would not impose the death penalty regardless of the severity of the aggravating evidence. (Ibid.) A third juror said the only case in which she might vote for death would be one involving the murder of her own child. (P. 246.) In sum, whenever we have upheld the exclusion of a juror, that juror has said something which indicates that he could not decide the case impartially on the evidence and relevant factors, but instead that his vote was predetermined by his views on the death penalty.\n\nWith these precedents in mind, it is instructive to look again at the voir dire of Juror Giangregorio. He was first asked, \"How do you feel about the death penalty?\" and replied, \"I am against it, your Honor.\" This is the sort of generalized opposition to capital punishment which is clearly insufficient to disqualify a juror under Witherspoon, supra, 391 U.S. 510, Wainwright v. Witt, supra, 469 U.S. 412, or any California precedent. The judge then asked, \"Are you against it in every case.\" The juror replied, \"Every instance. I do not believe in it.\" This second answer adds nothing, because a person who is against the death penalty is, by definition, opposed to it in every instance. One who favors the death penalty in some cases but not in others is considered a supporter of the death penalty. The court asked Giangregorio only whether he was \"against\" the death penalty \"in every instance,\" not whether he could apply the law if he concluded that under the law the death penalty was appropriate. The juror's answer, \"I do not\n\nbelieve in it,\" is again just a general statement of belief, not an expression of whether his ability to apply the law would be impaired.\n\nThe majority opinion, however, asserts that \"Giangregorio's expressed antipathy to the death penalty in 'every instance' . . . would undoubtedly 'substantially impair the performance of his duties as a juror.'\" (Maj. opn., ante, at p. 503.) This assertion is squarely inconsistent with the language in Witherspoon where the court declared that \"[One] who opposes the death penalty, no less than one who favors it, can make the discretionary judgment entrusted to him by the State and can thus obey the oath he takes as a juror.\" (Witherspoon v. Illinois, supra, 391 U.S. 510, 519 [20 L.Ed.2d 776, 783].) As we have seen, this portion of Witherspoon was not overturned by Wainwright v. Witt, supra, 469 U.S. 412, and remains controlling law.\n\nFor the foregoing reasons, I would reverse the judgment and remand this case for a new trial.\n\n\u003cspan class=\"fn\"\u003e1. All further statutory references are to the Penal Code unless otherwise indicated.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Although defendant initially frames this issue in terms of a challenge to the assembly of the master jury list, it appears that, either by stipulation or acquiescence, he, the People, and the trial court understood the basis of the motion to be a challenge to the composition of the jury venires in the county, because defendant's evidence went to the racial composition of those appearing for jury duty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. To arrive at the 17.76 percent figure, Dr. Newell derived a ratio using the available data from the 1970 census. In that year, 16.9 percent of the county was Hispanic and 13.9 percent was both Hispanic and at least 18 years old. Dr. Newell testified that, if anything, this method underestimated the number of jury-eligible Hispanics in the county because of a trend during the 1970's toward smaller families.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. By using such refined statistics, defendant's case does not present the question whether use of total population figures is permissible. Previously, a three-justice plurality of this court concluded a defendant could use total countywide population numbers in making his prima facie case of a constitutional violation. (People v. Harris (1984) 36 Cal. 3d 36, 54-55 [201 Cal. Rptr. 782, 679 P.2d 433].) However, we later held \" Harris should not be applied retroactively to cases in which juries were selected before the Harris decision was rendered.\" (People v. Myers (1987) 43 Cal. 3d 250, 269 [233 Cal. Rptr. 264, 729 P.2d 698].) And recently, this court held that henceforth, \"a defendant who has access to census or other demographic data that reflect adult population figures must base his challenge on that data.\" (People v. Bell (1989) 49 Cal. 3d 502, 526, fn. 12 [262 Cal. Rptr. 1, 778 P.2d 129]; see also id. at p. 556 [conc. opn. by Kaufman, J.].) Because defendant provided refined statistical data and did not rely on Harris 's holding permitting reliance on total population figures, we need not resolve the question of whether this court violated equal protection principles by holding, in Myers, supra, 43 Cal. 3d 250, that the Harris holding should not be applied retroactively. (See Myers v. Ylst (9th Cir. 1990) 897 F.2d 417.) Defendant and the People engage in extended argument concerning whether the record indicates Dr. Newell had calculated the number of noncitizens in the county before arriving at the 16.3 percent figure. We need not decide this point since he clearly presented statistics based on the number of Hispanics in the county over the age of 18 and this refinement is sufficient. (Bell, supra, 49 Cal. 3d at p. 526, fn. 12.) Should a defendant make out a prima facie case, however, the People may rebut that showing with statistics which take into account additional persons \"who are jury ineligible -- noncitizens, ex-felons, etc.\" (Ibid., italics added.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. \"The 'absolute disparity' test measures representativeness by the difference between the proportion of the population in the underrepresented category, and the proportion of those persons in the source or pool in the underrepresented category.\" (Bell, supra, at p. 527, fn. 14; see also Kairys et al., Jury Representativeness: A Mandate for Multiple Source Lists (1977) 65 Cal.L.Rev. 776, 789-790.) It is \"obtained by subtracting the jury representation percentage from the community percentage.\" (Morales, supra, 48 Cal. 3d at p. 544.) The comparative disparity standard is obtained by the following formula: (A - B)/A X 100 = the comparative disparity,where: A = the percentage of the community that makes up the cognizable group in question, here adult Hispanic citizens, and B = the percentage of the jury venire which is composed of the cognizable group in question.(See Kairys, supra, 65 Cal.L.Rev. at pp. 790-791.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Some courts and commentators have expressed the opinion that the comparative disparity approach is superior to the absolute disparity standard. (Bell, supra, at pp. 565-566, and cases cited [dis. opn. by Broussard, J.]; Kairys, supra, 65 Cal.L.Rev. at pp. 793-799.) This court, however, has declined to adopt one approach to the exclusion of the other. (Bell, supra, at p. 527, fn. 14.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The Harris plurality opinion is far from clear on this point as well. That opinion first noted our decision in People v. Sirhan (1972) 7 Cal. 3d 710 [102 Cal. Rptr. 385, 497 P.2d 1121], in which we held that \"[t]he use of voter registration lists as the sole source of jurors is not constitutionally invalid [citations], at least in the absence of a showing that the use of those lists resulted 'in the systematic exclusion of a \"cognizable group or class of qualified citizens.\"'\" (Id. at pp. 749-750.) Although the Harris plurality then suggested that the defendant was trying to make just such a showing, it did not overrule Sirhan on this point. It is thus arguable that Harris did not \"hold\" sole reliance on voter registration lists was itself impermissible, even with Justice Grodin's vote. It appears, however, that the plurality's opinion has been interpreted as holding that sole reliance on voter registration lists is impermissible. (Harris, supra, 36 Cal. 3d at pp. 72-73 [Mosk, J., dis.]; see also United States v. Underwood (N.D.Ala. 1985) 617 F.Supp. 713, 716; Waller v. Butkovich (M.D.N.C. 1984) 593 F.Supp. 942, 958.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The trial court apparently denied defendant's motion to quash because his supporting evidence failed to take account of the number of illegal aliens of Hispanic descent living in Kern County. As discussed ante, at page 490, footnote 4, a defendant need not present such refined statistics to establish a prima facie case. Albeit for the wrong reason, the trial court reached the correct result.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. Former Code of Civil Procedure section 204.7 has since been repealed. (Stats. 1988, ch. 1245, § 1.) It has been supplanted by section 197 of the same code, which states that a master jury list assembled from lists of registered voters and driver's license holders, \"when substantially purged of duplicate names, shall be considered inclusive of a representative cross section of the population.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. In supplemental briefing, defendant claims the prosecutor's use of peremptory challenges violated defendant's right to equal protection of the laws. (See Batson v. Kentucky, supra, 476 U.S. 79.) Although the rule in Batson vindicates a federal constitutional right, whereas Wheeler addresses a state constitutional concern, the procedure for establishing a prima facie case under both cases is similar. (See Johnson, supra, 47 Cal. 3d at p. 1216 [jointly analyzing the issue under both cases].) For the reasons discussed above, we conclude defendant fails to show the \"facts and other relevant circumstances raise an inference that the prosecutor used [his peremptory challenges] to exclude the veniremen from the petit jury on account of their race.\" (Batson, supra, at p. 96 [90 L.Ed.2d at pp. 87-88].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Defendant contends that adoption of the Witt standard over the Witherspoon standard does not comport with this state's expressed preference for \"strict standards in death penalty cases.\" (See, e.g., People v. Bigelow (1984) 37 Cal. 3d 731, 743, fn. 7 [209 Cal. Rptr. 328, 691 P.2d 994, 64 A.L.R.4th 723].) We agree with the high court, however, that \"there is nothing talismanic about juror exclusion under Witherspoon merely because it involves capital sentencing juries. Witherspoon is not grounded in the Eighth Amendment's prohibition against cruel and unusual punishment, but in the Sixth Amendment. Here, as elsewhere, the quest is for jurors who will conscientiously apply the law and find the facts. That is what an 'impartial' jury consists of, and we do not think, simply because a defendant is being tried for a capital crime, that he is entitled to a legal presumption or standard that allows jurors to be seated who quite likely will be biased in his favor.\" (Witt, supra, 469 U.S. at p. 423 [83 L.Ed.2d at p. 851], quoted with approval in People v. Howard (1988) 44 Cal. 3d 375, 417 [243 Cal. Rptr. 842, 749 P.2d 279].)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Although defendant originally challenged the excusal of two other venirepersons (Shepard and Boston) in addition to Giangregorio, he fails to mention these two jurors in his supplemental briefs and we assume he is conceding that, in light of the different standard established in Witt, the record no longer supports his claims that their excusal was improper. Our review of the record supports such a determination.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Dr. Loftus testified outside the jury's presence at defendant's first trial. The parties stipulated that the transcript of this testimony, together with a copy of the prosecutor's legal memorandum on this point, could be considered by the trial court before ruling on the admissibility of Dr. Loftus's testimony in defendant's second trial.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. The trial court in McDonald cited four cases in support of its decision: People v. Johnson (1974) 38 Cal. App. 3d 1 [112 Cal. Rptr. 834]; People v. Guzman (1975) 47 Cal. App. 3d 380 [121 Cal. Rptr. 69]; People v. Brooks (1975) 51 Cal. App. 3d 602 [124 Cal. Rptr. 492]; and People v. Bradley (1981) 115 Cal. App. 3d 744 [171 Cal. Rptr. 487]. (McDonald, supra, 37 Cal. 3d at p. 362 \u0026 fn. 8.) The trial court in the instant case also relied on some of these cases in excluding Dr. Loftus's testimony.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. The cases cited by defendant are not on point. In People v. Dail (1943) 22 Cal. 2d 642 [140 P.2d 828], the trial court erroneously instructed the jury that the credibility of accomplice witnesses should be judged by the same standard as other witnesses. (Id. at p. 656.) By contrast, the trial court here properly instructed the jury that the testimony of an accomplice must be viewed with distrust and must be corroborated. In People v. Robinson (1964) 61 Cal. 2d 373 [38 Cal. Rptr. 890, 392 P.2d 970], also cited by defendant, we reversed a conviction where, among other things, the trial judge erroneously left to the jury the determination of whether the witness was an accomplice when there was overwhelming evidence of that fact. (Id. at pp. 694-696.) As explained ante, the evidence showing Maxwell was an accomplice in the January 23 crimes was not strong. Hence, the question properly was one for the jury. (Mayberry, supra, 15 Cal. 3d at p. 159.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Miranda v. Arizona (1966) 384 U.S. 436 [16 L.Ed.2d 694, 86 S.Ct. 1602, 10 A.L.R.3d 974].\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. \" Miranda holds that '[t]he defendant may waive effectuation' of the rights conveyed in the warnings 'provided the waiver is made voluntarily, knowingly and intelligently.' [Citation.] The inquiry has two distinct dimensions. [Citations.] First, the relinquishment of the right must have been voluntary in the sense that it was the product of a free and deliberate choice rather than intimidation, coercion, or deception. Second, the waiver must have been made with a full awareness both of the nature of the right being abandoned and the consequences of the decision to abandon it. Only if the 'totality of the circumstances surrounding the interrogation' reveals both an uncoerced choice and the requisite level of comprehension may a court properly conclude that the Miranda rights have been waived.\" (Moran v. Burbine (1986) 475 U.S. 412, 421 [89 L.Ed.2d 410, 421, 106 S.Ct. 1135], quoting Fare v. Michael C. (1979) 442 U.S. 707, 725 [61 L.Ed.2d 197, 212-213, 99 S.Ct. 2560].) Defendant makes no claim that his statements to Officer Herman were involuntary.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. Although defendant would distinguish Spring because the police questioning in that case itself \"suggested the topic of inquiry\" (id. at p. 568 [93 L.Ed.2d at p. 962]), it is clear that only the trial court in Spring found this point important. (Ibid.) As noted above, the high court instead reasoned that an accused can execute a valid Miranda waiver even if he is not previously informed of all possible consequences of that decision. (Id. at p. 574 [93 L.Ed.2d at p. 966].) We thus reject defendant's attempt to distinguish Spring on its facts.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The instruction read, \"Every person who knowingly and maliciously prevents or dissuades or attempts to prevent or dissuade a witness or victim from making a report of such victimization to any peace officer is guilty of a felony if such acts, one, are accompanied by force or by an express or implied threat of force or violence upon the witness or victim; or, two, where such acts are in furtherance of a conspiracy.\" This instruction is based on section 136.1, subdivision (c)(1), (2).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The jury was also given instructions defining a conspiracy, although defendant was not charged with that crime. This may have been to lay a foundation for a later instruction informing the jury how to evaluate a coconspirator's (i.e., Brenda Maxwell's) statements, or to present a vicarious liability theory based on defendant's and Cebreros's status as coconspirators. (See People v. Belmontes (1988) 45 Cal. 3d 744, 750 [248 Cal. Rptr. 126, 755 P.2d 310] [court can instruct on conspiracy even if not charged]; People v. Washington (1969) 71 Cal. 2d 1170, 1174 [81 Cal. Rptr. 5, 459 P.2d 259, 39 A.L.R.3d 541] [same].) Defendant contends that the mention of a conspiracy may have led the jury to believe it could sustain the special circumstance allegation against him even if he only intended that Allen be intimidated but not killed. We need not resolve this problem, however, because as discussed ante, the instructions and the jury's verdicts show that it found defendant harbored the intent to kill. (Of course, there was sufficient evidence for the jury to find defendant himself struck the fatal blows and was thus the actual killer, not a mere aider and abettor.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. As Justice Mosk recognizes in his dissenting opinion, post, the United States Supreme Court recently filed two opinions that may affect our analysis of so-called Brown error. (Boyde v. California (1990) 494 U.S. 370 [108 L.Ed.2d 316, 110 S.Ct. 1190]; Blystone v. Pennsylvania (1990) 494 U.S. 299 [108 L.Ed.2d 255, 110 S.Ct. 1078].) Both cases suggest that the premise of much of this court's reasoning in Brown -- that capital juries should not be told their choice of sentence is mandatory if certain factual findings are made -- may have been overstated. Because we find no error under People v. Brown, supra, 40 Cal. 3d 512, and its progeny, however, we have no occasion to determine the impact of Boyde and Blystone on this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The trial court observed that it did not perceive defendant to be suffering from any mental aberration. Defense counsel concurred in this assessment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. We left open the possibility that the state's interest in a reliable penalty verdict may be compromised when, in addition to the defendant's failure to present available mitigating evidence, the jury was also given misleading instructions and heard misleading argument. (People v. Bloom (1989) 48 Cal. 3d 1194, 1228, fn. 9 [259 Cal. Rptr. 669, 774 P.2d 698]; Williams, supra, 44 Cal. 3d at p. 1152.) As we concluded, ante, at pages 521-524, the prosecutor's closing argument in this case was not objectionable and the jury instructions, although potentially misleading, did not actually deceive the jury into believing it lacked discretion regarding the choice of penalty.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Defendant contends his decision to decline to present any mitigating evidence was not a fully informed decision because he was not told that the trial court possessed the power to strike the special circumstances and thus make him eligible for parole. (People v. Williams (1981) 30 Cal. 3d 470, 489 [179 Cal. Rptr. 443, 637 P.2d 1029].) This assertion is belied by the record, which shows that a defense motion to set aside the special circumstance findings was denied by the trial court prior to presentation of evidence at the penalty phase.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Capital juries are routinely instructed at the penalty phase that \"you shall consider all of the evidence which has been received during any part of the trial of this case.\" (CALJIC No. 8.85.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. We also note that the United States Supreme Court has held that giving the antisympathy instruction at the penalty phase itself is not itself unconstitutional per se (California v. Brown, supra, 479 U.S. 538), although state law prohibits giving CALJIC No. 1.00 at the penalty phase. (People v. Brown, supra, 40 Cal. 3d at p. 537, fn. 7.) Here, of course, the challenged instruction was not given at the penalty phase but at the guilt phase.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Section 190.3, factor (b) permits the jury to consider, as an aggravating or mitigating factor, \"[t]he presence or absence of criminal activity by the defendant which involved the use or attempted use of force or violence or the express or implied threat to use force or violence.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Section 654 provides: \"An act or omission which is made punishable in different ways by different provisions of this code may be punished under either of such provisions, but in no case can it be punished under more than one . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. In finding no prejudicial error, the majority rely on the proposition that \"'[T]he . . . reliability [required by the Eighth Amendment in death penalty cases] is attained when'\" -- as assertedly here -- \"'the prosecution has discharged its burden of proof at the guilt and penalty phases pursuant to the rules of evidence and within the guidelines of a constitutional death penalty statute, the death verdict has been returned under proper instructions and procedures, and the trier of penalty has duly considered the relevant mitigating evidence, if any, which the defendant has chosen to present. . . .'\" (Maj. opn., ante, at pp. 525-526, quoting People v. Bloom (1989) 48 Cal. 3d 1194, 1228 [259 Cal. Rptr. 669, 774 P.2d 698], maj. opn. fn. omitted.) To my mind, that proposition is unsound. Reliability can be assured only when the record on which the verdict is based is \"complete,\" i.e., when it does not lack any \"significant portion of the evidence of the appropriateness of the penalty\" that counsel reasonably concludes \"'. . . makes the most compelling case in mitigation.'\" (People v. Deere, supra, 41 Cal. 3d at pp. 363, 364, fn. 3.) It is obvious that the record here is not \"complete\" in that sense.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In Brown the court construed the final paragraph of section 190.3 as it did for three reasons: (1) to \"honor[ ] the plain language of section 190.3\"; (2) to give effect to \"the most likely 'constitutional' intent of the drafters\"; and (3) to \"avoid[ ] the constitutional difficulties of a finding that the statute permits 'mandatory' death penalties.\" (40 Cal. 3d at p. 544.) Very recently, in Boyde v. California (1990) 494 U.S. 370 [108 L.Ed.2d 316, 110 S.Ct. 1190], the United States Supreme Court impliedly held not unconstitutional the final paragraph of section 190.3 to the extent that it requires that \"the trier of fact . . . shall impose a sentence of death if the trier of fact concludes that the aggravating circumstances 'outweigh' the mitigating circumstances.\" (Italics added.) (494 U.S. at pp. - [108 L.Ed.2d at p. 326, 110 S.Ct. at p. 1196].) In so doing, it relied primarily on Blystone v. Pennsylvania (1990) 494 U.S. 299 [108 L.Ed.2d 255, 110 S.Ct. 1078], which it had decided less than a week earlier. After careful review, I believe that Boyde gives us no reason to reconsider Brown. To be sure, Boyde has removed one of the bases on which the court founded its construction of the statutory provision. It now appears that there are no \"constitutional difficulties\" inherent in a \"statute [that] permits 'mandatory' death penalties.\" (40 Cal. 3d at p. 544.) But Boyde has had no effect whatever on the two other bases, i.e., \"the plain language of section 190.3\" and \"the most likely 'constitutional' intent of the drafters\" (40 Cal. 3d at p. 544). Obviously, that decision does not change the words of the statutory provision or their meaning. Moreover, it contains nothing to support a conclusion that the drafters of the provision may have intended to \"anticipate\" the law as stated therein. The primary authority on which Boyde relies -- i.e., Blystone -- dates to 1990. By contrast, the drafters of section 190.3 did their work more than a decade earlier. In my view, the construction of the final paragraph of section 190.3 that the court adopted in Brown retains its validity. From the reasoning in that decision it is manifest that the bases of statutory language and the drafters' intent are sufficient to support the interpretation set forth therein. Accordingly, Boyde 's removal of the \"avoidance of constitutional difficulties\" basis is without effect for purposes here. 3 In People v. Marshall (1990) 50 Cal. 3d 907, 933, footnote 5 [269 Cal. Rptr. 269, 790 P.2d 676], the court stated as follows: \"In Boyde v. California (1990) 494 U.S. 370 [108 L.Ed.2d 316, 110 S.Ct. 1190], the United States Supreme Court held that 'The legal standard for reviewing jury instructions claimed to restrict impermissibly a jury's consideration of relevant evidence' under the Eighth Amendment 'is whether there is a reasonable likelihood that the jury has applied the challenged instruction in a way that prevents the consideration of constitutionally relevant evidence. Although a defendant need not establish that the jury was more likely than not to have been impermissibly inhibited by the instruction, a capital sentencing proceeding is not inconsistent with the Eighth Amendment if there is only a possibility of such an inhibition.' (Id. at pp. , [108 L.Ed.2d at p. 329].) It appears to follow that the same standard is applicable for reviewing jury instructions claimed to restrict impermissibly a jury's sentencing discretion under the Eighth Amendment.\" (Italics added.) That the so-called \"reasonable likelihood\" standard may apply to a claim that a given instruction impermissibly restricted a jury's sentencing discretion under the Eighth Amendment does not mean that that test should apply to a claim -- like the present (see fn. 2, ante) -- that a given instruction impermissibly restricted a jury's sentencing discretion under section 190.3. The choice of the relevant standard here is plainly a matter of state law. I would adhere to the \"reasonable juror\" test. I certainly would not depart from it in favor of the \"reasonable likelihood\" test -- which is manifestly both novel and unsound (Boyde v. California, supra, 494 U.S. at pp. , [108 L.Ed.2d at pp. 334-341, 110 S.Ct. at pp. 1202-1207] (dis. opn. of Marshall, J.)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In concluding that the trial court did not commit Brown error, the majority rely on a reading of the summation that treats the prosecutor's comments on the mandatory sentencing language as sound and, in any event, discrete and insignificant. In light of the record set out above, such a reading is at the very least dubious. As explained, the prosecutor's remarks framed the \"major premise\" of his argument for death. Further, they misstated the law. The majority's assertion to the contrary notwithstanding, it is simply not the case that \"for those defendants as to which a jury decides the aggravating circumstances outweigh the mitigating circumstances, the Penal Code provides that the appropriate penalty is death.\" (Maj. opn., ante, at p. 523.) \"The jury is not simply to determine whether aggravating factors outweigh mitigating factors and then impose the death penalty as a result of that determination, but rather it is to determine, after consideration of the relevant factors, whether under all the circumstances 'death is the appropriate penalty' for the defendant before it.\" (People v. Myers, supra, 43 Cal. 3d at p. 276 (lead opn. by Grodin, J.).) 1a As the majority notes (maj. opn., ante, p. 489, fn. 2), though defendant frames this issue in terms of a challenge to the assembly of the master jury list, defendant, trial court, and the People apparently understood the basis of the motion to be a challenge to the composition of Kern County jury venires. 2a At the time of defendant's trial, the master jury list in Kern County was compiled through the random selection of names from the county's voter registration list alone. Questionnaires were then sent to those chosen to determine eligibility to serve as jurors. Although there were plans to use the names of those holding driver's licenses to assemble the master jury list in the future, such plans had not yet been implemented at the time of defendant's trial. 3a Kairys et al., Jury Representativeness: A Mandate for Multiple Source Lists (1977) 65 Cal.L.Rev. 776, 788-792. 4a The trial court itself recognized a prima facie showing of underrepresentation of Hispanic persons on Kern County jury panels when, in denying defendant's motion to quash, it stated, \"I do believe that there has been a prima facie showing that there is a disproportionate number of people with Hispanic surnames called for jurors, but I am not sure that means a thing, and as everybody knows by reading the Los Angeles Times and any other publication that there are an enormous number of people in this country illegally or green card-wise [ sic ] who are not really citizens. So, I don't think that really in and of itself means anything.\" The court's ruling was erroneous both in disregarding the proof of underrepresentation on the basis of allegedly common knowledge about the number of noncitizens in the county and in its finding that there was no showing of systematic exclusion. First, as we held in Harris, supra, 36 Cal. 3d 36, a defendant may rely upon total population figures, rather than pinpoint the exact number of people eligible for jury service, to make his prima facie case. The trial court here, like the court in Harris (p. 48), erroneously rejected defendant's showing on the grounds that his percentage of Hispanics may have included a large number of people who were not eligible for jury service, and in so doing improperly relieved the state of its burden to refute or justify the underrepresentation. Second, the trial court ignored the evidence which defendant presented relating to the jury eligible population. Rather the court casually referred to the common knowledge, as reported in the newspaper, that there is \"an enormous number\" of noncitizens in the United States without recognizing that the evidence that had been presented did take account of that factor.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5.a The majority quote United States v. Cecil (4th Cir. 1988) 836 F.2d 1431, which said that \"[I]t is sufficient that the system adopted provides a fair cross-section and we find both common sense and precedent establish that if the voter registration lists do this they are not tainted by some affirmative form of discrimination.\" (Pp. 1448-1449, italics added.) Clearly this and other cases cited by the majority are not authority that voter registrations lists may be used as an exclusive source for jury selection if they do not provide a fair cross-section. We cannot expect perfection, as Cecil says (ibid.), but surely we can do better than the 53 percent comparative disparity shown here.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6.a Likewise, the court apparently agreed that two post- Witherspoon cases (Maxwell v. Bishop (1970) 398 U.S. 262 [26 L.Ed.2d 221, 90 S.Ct. 1578] and Boulden v. Holman (1969) 394 U.S. 478 [22 L.Ed.2d 433, 89 S.Ct. 1138]), both of which applied the Witherspoon formula in overturning death penalties, were correctly decided, since its decision distinguishes them in part on the ground that \"both involved jurors who were excused merely because they had 'conscientious' objections to, or did not 'believe in,' the death penalty.\" (Witt, supra, 469 U.S. at p. 422, fn. 4 [83 L.Ed.2d at p. 850].)\u003c/span\u003e\n\n",
    "body_length": 181610,
    "citedas": [
      "273 Cal. Rptr. 537",
      "51 Cal. 3d 471",
      "797 P.2d 561"
    ],
    "attorneys": "Dennis P. Riordan, under appointment by the Supreme Court, Nina Rivkind and B. E. Bergesen III for Defendant and Appellant. John K. Van de Kamp, Attorney General, Daniel J. Kremer, Steve White and Richard B. Iglehart, Chief Assistant Attorneys General, Arnold O. Overoye, Assistant Attorney General, Willard F. Jones, Eddie T. Keller, Ward A. Campbell and Jane N. Kirkland, Deputy Attorneys General, for Plaintiff and Respondent. Christopher N. Heard as Amicus Curiae on behalf of Plaintiff and Respondent.",
    "category": [
      "36",
      "78"
    ],
    "judges": "Opinion by Lucas, C. J., with Panelli, Eagleson, Kennard and Arabian, JJ., concurring. Separate dissenting opinions by Mosk, J., and Broussard, J.",
    "citation_count": 9
  }
}
