{
  "id": "L4vUQGYBTlTomsSBG3IM",
  "document": {
    "title": "BP West Coast Products",
    "full_title": "BP WEST COAST PRODUCTS, LLC v. FEDERAL ENERGY REGULATORY COMMISSION AND UNITED STATES OF AMERICA SFPP, L.P., ET AL., INTERVENORS",
    "jurisdiction": "D.C. Circuit",
    "date": "2004-07-20T00:00:00.000Z",
    "docket": "No. 99-1020 Consolidated with, 99-1051, 00-1221, 00-1240, 00-1256, 01-1413, 01-1453,, 01-1469, 01-1475, 02-1008, 02-1011, 02-1321",
    "body": "Argued November 12, 2003\n\nINTRODUCTION\n\nThe consolidated petitions before us seek review of four opinions of the Federal Energy Regulatory Commission (\"FERC\" or \"the Commission\"):\n\n1. SFPP, L.P., Opinion No. 435, 86 FERC ¶ 61,022 (1999) (\"Opinion No. 435\");\n\n2. SFPP, L.P., Opinion No. 435-A, 91 FERC ¶ 61,135 (2000) (\"Opinion No. 435-A\");\n\n3. SFPP, L.P., Opinion No. 435-B, 96 FERC ¶ 61,281 (2000) (\"Opinion No. 435-B\"); and\n\n4. SFPP, L.P., 97 FERC ¶ 61,138 (2001) (\"Clarification and Rehearing Order\").\n\nIn these opinions FERC considered the tariffs of SFPP, L.P., and complaints and other filings by shipper customers of SFPP. SFPP, L.P., both a petitioner and an intervenorrespondent in the consolidated dockets, operates pipelines that transport petroleum products in Texas, New Mexico, Arizona, California, Nevada, and Oregon. SFPP's operation includes a West Line and an East Line. The West Line consists of pipelines extending from Watson Station in Los Angeles, California, into Arizona to Phoenix and Tucson, and connects at Colton, California, with another pipeline system extending to Las Vegas. SFPP's East Line consists of pipelines from El Paso, Texas to Tucson and Phoenix. The orders under review consider, set, and otherwise govern rates on both lines. We consider three separate sets of petitions: the petition of SFPP, L.P.; the petition of the West Line Shippers (\"WLS\"); and the petition of the East Line Shippers (\"ELS\"). Petitioners and Intervenors include the following: BP West Coast Products LLC (\"BP WCP\"; formerly ARCO Products Company); Chevron Products Company (\"Chevron\"; including the former Texaco Refining and Marketing, Inc.); ConocoPhillips Company (\"ConocoPhillips\"); ExxonMobil Oil Corporation (\"ExxonMobil\"; formerly Mobil Oil Corporation); Navajo Refining Company, L.P. (\"Navajo\"); Western Refining Company, L.P. (\"Western\"); Ultramar Inc. (\"Ultramar\"); Valero Energy Corporation (\"VEC\"); Valero Marketing and Supply Company (\"Valero\"); and SFPP, L.P. (\"SFPP\").\n\nThe administrative proceedings before FERC began with tariff filings by SFPP for both East and West Lines. The lengthy, complex, and convoluted proceedings that followed included complaints and/or protests filed by shippers on the two lines, as well as investigation into SFPP's tariff filings by FERC's Oil Pipeline Board. The issues are further complicated by novelty in that this is the first oil pipeline case in which the \"changed circumstances\" standard of the Energy Policy Act of 1992 (\"EPAct\") has arisen for litigation. Energy Policy Act of 1992, Pub. L. No. 102-486, 106 Stat. 2776 (codified as 42 U.S.C. §§ 1320-556 (2003)). While we will not detail the administrative proceedings before FERC's administrative law judge and the full Commission as we discuss them at length in the analyses that follow, we note that issues presented for review include, among other things, the important question of application of the grandfathering principle under the new EPAct, the allocation of litigation costs between the East and West Lines, tax pass-through problems involving non-taxed subsidiaries of taxable entities, the payment of reparations after a finding of unjust or unreasonable rates, and the correct determination of capital structure to determine a starting rate base. The reader is duly warned.\n\nFor reasons set forth more fully below, we are able to affirm many of FERC's answers to specific issues, but because we find error in several fundamental areas, we order the decisions under review vacated and remand the matter for further proceedings consistent with this opinion.\n\nI. The West Line\n\nA. Grandfathering of Rates under the EPAct\n\nSection 1803 of the EPAct limits the ability of shippers to challenge pipeline rates in effect at the time of the enactment of the EPAct. Section 1803 provides that any oil pipeline rate that was \"in effect\" for a full year before the EPAct's enactment on October 24, 1992, and was not subject to \"protest, investigation, or complaint\" during that 365-day period, is \"deemed to be just and reasonable.\" EPAct § 1803(a)(1). These \"grandfathered\" rates are categorically immune from challenge in a complaint proceeding under Section 13 of the Interstate Commerce Act (\"ICA\"), 49 U.S.C. app. § 13(1) (1988) (repealed),\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e except when:\n\n(1) evidence is presented to the Commission which establishes that a substantial change has occurred after the date of the enactment of this Act-\n\n(A) in the economic circumstances of the oil pipeline which were a basis for the rate; or\n\n(B) in the nature of the services provided which were a basis for the rate; or\n\n(2) the person filing the complaint was under a contractual prohibition against the filing of a complaint which was in effect on the date of enactment of this Act....\n\nId. § 1803(b). In the post-EPAct world, the analysis of a pipeline rate challenge thus proceeds in two steps: first, FERC determines whether the rate in question is grandfathered; if it is, FERC then asks whether the rate falls within either of the exceptions outlined in Section 1803(b). The Commission may not alter a grandfathered rate that does not fall within an exception.\n\nB. Grandfathering of West Line Rates\n\nThe WLS contend that none of the West Line rates are grandfathered, and further argue that even if the rates are grandfathered, their challenges fall within the exceptions set out in Section 1803(b). We examine each of these contentions in turn.\n\n1. Rate \"In Effect\" for One Year\n\nTo be eligible for grandfathering, a pipeline rate must have been \"in effect for the 365-day period ending on the date of the enactment of this Act [October 24, 1992].\" EPAct § 1803(a)(1). Thus, to be grandfathered, a rate must have been \"in effect\" on October 25, 1991, and have remained in effect at least until the enactment of the EPAct.\n\nThe WLS do not contest this element with regard to the bulk of the West Line rates. Nor could they; the West Line rates became effective in 1989 pursuant to a settlement terminating a 1985 rate proceeding. See Opinion No. 435, 86 FERC at 61,057; Southern Pac. Pipe Lines, Inc., 45 FERC ¶ 61,242 (1988) (order approving settlement). The WLS do, however, challenge the eligibility for grandfathering of certain improvements to the West Line made after October 1991.\n\na. East Hynes Origination Point\n\nIn July 1992, SFPP made revisions to its Tariffs Nos. 15, 16, and 17 to add a new origination point on its West Line --the East Hynes station in Los Angeles County, California --and to add a rate for shipping services from that new origination point to Arizona. The rate came into effect in October 1992. The rate, however, was not new; it was the same as the rates from SFPP's two other source points in the Los Angeles area. Examining this situation, the Commission concluded that the rates from the East Hynes station qualified for grandfathering because the July 1992 \"filing did not involve a change to a rate or service SFPP was providing at the time the EPAct was enacted.\" Opinion No. 435, 86 FERC at 61,063. SFPP's revision to its tariffs \"only added another tap within an existing rate cluster.... No rate ... was changed, and there was no change in the products transported or the services provided.\" Id.\n\nThe question essentially boils down to the Commission's interpretation of the term \"rate\" in Section 1803. As this is the first case to be litigated under the new standards of the EPAct, we must consider the level of deference -- if any --to which FERC's interpretations of the EPAct are entitled. It is true, as some petitioners have noted, that the EPAct does not expressly confer rulemaking authority on the Commission. Section 1803 of the EPAct does, though, clearly contemplate that the Commission will enforce the terms and conditions of the statute through formal adjudications. See EPAct § 1803(b) (referencing \"proceeding instituted as a result of a complaint\"). When Congress authorizes an agency to adjudicate complaints arising under a statute, the agency's interpretations of that statute announced in the adjudications are generally entitled to Chevron deference. See United States v. Mead Corp., 533 U.S. 218, 229 (2001) (\"[A] very good indicator of delegation meriting Chevron treatment [is] express congressional authorizations to engage in the process of rulemaking or adjudication that produces regulations or rulings for which deference is claimed.\"); see also Trans Union Corp. v. FTC, 81 F.3d 228, 230 (D.C. Cir. 1996) (\"[W]e have expressly held that Chevron deference extends to interpretations reached in adjudications as much as to ones reached in a rulemaking.\" (citing Midtec Paper Corp. v. United States, 857 F.2d 1487, 1497 (D.C. Cir. 1988))). We see no reason to accord any less deference to FERC's interpretations of the EPAct.\n\nUnder the familiar Chevron two-part inquiry, we first ask whether Congress has directly spoken to \"the precise question at issue.\" Chevron U.S.A. Inc. v. Natural Res. Def. Council, Inc., 467 U.S. 837, 842 (1984). If it has, that is the end of the inquiry; we \"must give effect to the unambiguously expressed intent of Congress.\" Id. at 843. If Congress has not spoken so precisely, though, we reach the second step, and will defer to any reasonable interpretation of the statute by the agency. Id. Not surprisingly, Congress did not have occasion to confront the specific question of whether the addition of a new source point on an existing rate cluster would constitute a new rate. We thus proceed to the second step of Chevron, and inquire whether the Commission's construction is a reasonable one. It is. It is certainly permissible to conclude that the addition of a tap to an existing rate structure, completed without any change in the existing shipping rates, does not constitute a new rate. To employ an analogy that we find helpful, in adding the East Hynes station to its West Line, SFPP merely added an on-ramp to its existing expressway. We think that the Commission's conclusion reflects a permissible interpretation of the statute and thus affirm its holding that the rate for shipping from East Hynes is eligible for grandfathering.\n\nb. Watson Station Enhancement Facility\n\nWatson is the primary origin point for West Line shipments to Phoenix and Tucson. In 1989, SFPP notified its shippers that, starting in 1991, the minimum pumping rate and pressure from Watson Station would increase. SFPP gave its shippers the option of providing their own pressurization facilities by a date certain, or using, for a surcharge, a facility built by SFPP. By late 1991, most of SFPP's shippers had contracted to use SFPP's new enhancement facility, and on November 1, 1991, SFPP initiated the enhancement services. See Opinion No. 435, 86 FERC at 61,074; In re SFPP, L.P., 80 FERC ¶ 63,014, 65,156 \u0026 n.405 (1997) (\"ALJ Decision\"). SFPP, though, never filed those contracts with the Commission, because it believed its enhancement services were beyond the reach of FERC's jurisdiction. See Opinion No. 435, 86 FERC at 61,074. The Commission, however, concluded otherwise and ordered SFPP \"to file a rate equal to the historic charge in the shipper contracts.\" Id. at 61,076.\n\nDespite FERC's concession that \"Section 1803 only addresses rates that were on file with the Commission,\" Opinion No. 435-A, 91 FERC at 61,502, and its acknowledgment that the enhancement rates had never before been filed, FERC nevertheless concluded that, because \"the charges for the Watson Station facilities are part of enforceable contracts,\" the rates were \"the equivalent of a lawful, effective rate.\"\n\nOpinion No. 435, 86 FERC at 61,076. The Commission reasoned that because all the Watson enhancement rate contract charges \"were in effect before October 24, 1992,\" the shippers challenging those charges had to establish \"substantially changed circumstances.\" Id. at 61,075, 61,076. The fact that no statute permitted a shipper to challenge an unfiled rate before the Commission did not matter. For \"if [the rates] had been filed ..., it is clear that they would have been grandfathered because there was no challenge to them during the 12 months proceeding [sic] the enactment of the Act.\" Opinion No. 435-A, 91 FERC at 61,502.\n\nWe find the Commission's reasoning on this point to be fundamentally flawed, and vacate this portion of its order. First, if FERC is indeed correct in its interpretation that Section 1803 applies only to filed rates, the Commission may not grandfather unfiled rates on the assumption that if the rates had been filed, no challenge would have been brought. The Commission may not regulate rates as if they existed in a world that never was. It must take the rates as it finds them, and here, FERC found them unfiled. If FERC interprets Section 1803 to apply only to filed rates, then it may not extend the benefits of that provision to unfiled rates based on speculation about what would have happened had they in fact been filed. Invoking the so-called \"filed rate\" doctrine --which \"forbids a regulated entity to charge rates for its services other than those properly filed with the appropriate federal regulatory authority,\" Arkansas Louisiana Gas Co. v. Hall, 453 U.S. 571, 577 (1981) -- the WLS argue that the pipeline's failure to file a Watson enhancement rate tariff with the Commission precludes the Commission's treatment of the unfiled rate as grandfathered. Our disposition of this issue -- which is based on the Commission's flawed reasoning, and not a flawed conclusion -- does not require us to decide definitively whether Section 1803 of the EPAct applies only to filed rates.\n\nSecond, Opinion No. 435 suggests that any rate agreed upon before the EPAct's enactment on October 24, 1992 could be grandfathered. See Opinion No. 435, 86 FERC at 61,075 (\"The clear purpose of the EPAct's grandfathering provisions is to insulate pipelines from challenges to ... rates ... if those charges were in effect before October 24, 1992.\"). Section 1803, though, allows grandfathering of only those rates that were in effect (and unchallenged) for at least 365 days prior to the date of enactment of EPAct. EPAct § 1803(a). Even if we assume as a general proposition that Section 1803 applies to unfiled rates, other statements sprinkled throughout Opinion No. 435 suggesting that some of the rates were contracted for after the 365-day window had closed would remain problematic. See Opinion No. 435, 86 FERC at 61,075 (\"the contracts were entered into voluntarily by the parties, mostly before the end of 1991\"); id. (\"all the relevant contracts were required to be, and had been, executed well before June 1, 1992\"). If the Commission allows Section 1803 to apply to unfiled rates, those rates, to be grandfathered, must be in effect for at least 365 days prior to the EPAct's enactment. The reasoning of Opinion No. 435 gives us no comfort that this was the case. Without such an assurance, we cannot affirm the Commission's conclusion that the Watson enhancement rate is subject to grandfathering.\n\nc. Turbine Fuel Service\n\nIn December 1992, SFPP filed its Tariff No. 18, proposing the transportation on its West Line of a new product, turbine fuel (also known as jet fuel). The rate for the new turbine fuel service was equal to other grandfathered rates in Tariff No. 18 that had been in effect since 1989. The shippers argue that because the turbine fuel rate was not initiated until 1992 -- long after the grandfathering window had closed (indeed, after the EPAct had been enacted) -- the rate cannot be grandfathered. The Commission does not contest this; it recognized that the turbine fuel service was new, and therefore could not be grandfathered. Id. at 61,063. It nevertheless foreclosed further challenge to the turbine fuel rate, concluding, as a substantive matter, that the turbine fuel rate was just and reasonable. Id. at 61,078. The Commission reasoned that because the turbine fuel rate was equal to other Tariff No. 18 rates that had been deemed just and reasonable, \"there is no basis for providing a different rate level for turbine fuel at this time.\" Id.\n\nThat analysis falls far short of the mark. The fact that the Tariff No. 18 rates were deemed just and reasonable does not mean that the rates actually are just and reasonable. Perhaps if the Commission had undertaken a substantive review of the reasonableness of the West Line rates listed in Tariff No. 18, then its conclusion that the turbine fuel rate is reasonable -- because it is equal to those rates -- might be supportable. But here, the West Line rates had been \"deemed just and reasonable\" by operation of law -- solely because they had persisted without challenge for one year prior to the enactment of the EPAct. The turbine fuel rate, not itself eligible for grandfathering, cannot simply piggyback on the grandfathered status of other rates. The Commission's contrary conclusion reflects a fundamental misapprehension of the nature and purpose of the grandfathering provisions of the EPAct. The requirements for grandfathering -- the rate must be in effect and not subject to challenge for the year prior to the EPAct's enactment -- are not proxies for actual reasonableness. Those requirements instead operate principally as a means to constrain litigation over pre-EPAct pipeline rates. The fact that the turbine fuel rate is equal to other Tariff No. 18 rates thus says nothing about that turbine fuel rate's substantive reasonableness. The Commission's declaration that, as a substantive matter, the turbine fuel rate was just and reasonable -- a conclusion reached without the benefit of any substantive review of the underlying cost of service and rate of return -- was an arbitrary and capricious exercise of the Commission's authority and cannot stand.\n\n2. Complaints, Protests, or Investigations\n\nWhile the WLS concede that most of the West Line rates were in effect for the required year prior to the EPAct's enactment, they contend that no West Line rate is eligible for grandfathering because each of them was \"subject to protest, investigation, or complaint\" during that same one-year window. In support of their argument, the WLS point principally to protests filed by shippers El Paso Refinery, L.P. (\"EPR\") and Chevron, and an investigation opened by the Oil Pipeline Board (\"OPB\") pursuant to those protests. In October 1993, the Commission rejected these arguments, holding that the West Line rates were \"presumed just and reasonable\" and, therefore, a successful challenge had to \"prove the existence of the extraordinary circumstances set forth in section 1803 of the Energy Policy Act.\" SFPP, L.P., 65 FERC ¶ 61,028, 61,378 (1993); see also SFPP, L.P., 66 FERC ¶ 61,210 (1994) (denying rehearing).\n\nWhat does it mean for \"the rate\" to be \"subject to protest, investigation, or complaint\"? EPAct § 1803(a). The WLS maintain that a general attack on a tariff is sufficient to challenge all the rates and activities described therein. See WLS Br. 14 (\"a protest of a tariff filing did subject all rates in the tariff to review\"). The Commission, though, in ruling that the shippers' pleadings did not challenge the West Line rates, interpreted this clause of Section 1803 to require that the protest, investigation, or complaint specifically challenge the reasonableness of the rate in question. See SFPP, L.P., 65 FERC at 61,378 n.14 (while Chevron's protest did include \"a request for suspension of revised tariff no. 16, which contains ... only west line rates,\" the protest \"pled no concerns with the existing rates set forth in this tariff\"). The WLS object to FERC's interpretation on a general level, arguing that it grafts onto the statute a particularity requirement not found in its text. Here, too, we find the Chevron deference that we must accord to the agency's interpretation to be dispositive. Because we cannot say that the Commission's adjudicative interpretation is an impermissible reading of the statute -- the statute provides, after all, that it is \"the rate\" (not the tariff) that must be subject to \"protest, investigation, or complaint\" -- we defer to the Commission's interpretation. And with that interpretation in mind, we turn to the particular contentions of the WLS.\n\na. West Line Shipper Protests\n\nOn September 4, 1992, EPR, an East Line shipper, filed a protest to SFPP's Tariffs Nos. 15 and 16, and followed with three supplements that same month, one of which requested the suspension of Tariffs Nos. 15 and 16 and that the Oil Pipeline Board (\"OPB\" or \"Board\") open an investigation into the same. That same month, Chevron, which shipped on both the East and the West Line, filed a protest to Tariffs Nos. 15 and 16, also calling for their suspension and investigation.\n\nThe WLS contend that because EPR's and Chevron's protests challenged Tariff No. 16 -- which listed only West Line rates -- those protests had challenged the West Line rates. The Commission rejected this contention, looking beyond the relief requested by the protests to the shippers' substantive arguments for that relief. Examining the relevant pleadings, the Commission concluded that the protesting shippers \"raised concerns with only three matters -- flow reversal, prorationing, and existing rates on SFPP's east line.\" Id., 65 FERC at 61,378. As \"[n]othing within the four corners of these protests indicate[d] a concern with the existing rates on SFPP's west line,\" the Commission rejected those protests as a basis for denying grandfathered status to the West Line rates. Id.\n\nOur examination of the relevant pleadings convinces us that the Commission correctly concluded that EPR and Chevron did not challenge the reasonableness of the West Line rates in their protests to SFPP's Tariffs No. 15 and 16. The EPR and Chevron pleadings scarcely mention the West Line at all, let alone mount an attack on the reasonableness of its rates. The only mention of the West Line rates is found in EPR's first supplement to its protest: \"Santa Fe's proposed Tariff Nos. 15 and 16 retain Santa Fe's previously effective rates for service on its East Line and West Line systems, but represent the first tariffs under which product will flow in a reversed direction on the `Six-Inch Line' portion of the East Line system from Phoenix to Tucson.\" In re SFPP, L.P., Supplement to Protest of El Paso Refinery, L.P., 1-2 (Sept. 9, 1992) (emphasis omitted). This statement obviously concerns the flow reversal on the Phoenix-Tucson pipe -- not the reasonableness of West Line rates. Chevron's protest, as the Commission noted, \"simply fails to contain any statement indicating a challenge to existing rates on SFPP's west line.\" SFPP, L.P., 65 FERC at 61,378. The Commission thus reasonably concluded that these protests by East Line shippers were insufficient to render the West Line rates \"subject to protest.\" EPAct § 1803(a).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nb. Oil Pipeline Board Investigation\n\nOn September 29, 1992, in response to the protests filed by EPR and Chevron, the OPB, pursuant to its authority under Section 15(7) of the ICA, 49 U.S.C. app. § 15(7) (1988), opened an investigation of SFPP's rates listed in revised Tariffs Nos. 15, 16, and 17, suspended the tariffs for one day, and imposed refund obligations on SFPP. SFPP, L.P., 60 FERC ¶ 62,252 (1992).\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e In April 1993, the Commission vacated the suspension orders and the refund obligations. SFPP, L.P., 63 FERC ¶ 61,014 (1993). Observing that the protests against the tariffs did not challenge any change in a listed rate or practice (such as the addition of the East Hynes origination point or the turbine fuel service), but rather attacked only existing, unchanged rates and policies (the East Line rates and the flow reversal and prorationing practices), the Commission concluded that the OPB lacked authority to open an investigation under Section 15(7) of the ICA, which permits the Board only to investigate newly filed rates or practices. Id. at 61,125 (\"It was not appropriate for the Board to suspend the proposed tariff changes and initiate an investigation under section 15(7) when the focus of the protest was existing, unchanged, portions of the tariff.\"); 49 U.S.C. app. § 15(7) (1988) (limiting application to \"any schedule stating any new individual or joint rate ... or charge\") (emphasis added). The Commission held that the case should continue as a complaint proceeding before the Commission under ICA Section 13(1), id. § 13(1), and be limited to the issues properly raised by EPR, Chevron, and the intervenors. SFPP, L.P., 63 FERC at 61,125. But as the Board \"does not possess delegated authority to order initiation of a section 13(1) proceeding,\" the Commission vacated the tariff suspensions and the refund obligations. Id. The Commission eventually terminated the Board's suspension docket entirely, stating that matters would proceed only in the instant complaint docket. SFPP, L.P., 63 FERC ¶ 61,275 (1993). And based on its conclusion that the OPB's investigation had been unlawfully initiated, the Commission determined that SFPP's West Line rates were not \"subject to investigation\" for grandfathering purposes. SFPP, L.P., 66 FERC at 61,480.\n\nParsing with care the words of the Commission's countermand of the Board, the WLS argue that the Commission never formally vacated the Board's investigation of the SFPP's Tariffs Nos. 15-18, and thus the rates within those tariffs -- including the West Line rates -- remained subject to investigation in 1992, precluding grandfathered status. We, like the Commission, are unpersuaded. First, while the WLS are quite right that the Commission did not, in its ordering clauses, vacate the Board's investigation, the shippers' interpretation of the Commission's action runs head-on into the Commission's statement that it was inappropriate \"to suspend the proposed tariff changes and initiate an investigation under section 15(7).\" SFPP, L.P., 63 FERC at 61,125 (emphasis added). Moreover, the shippers offer no explanation how such an investigation by the Board could proceed in light of the Commission's order that the case would continue as a Section 13(1) complaint. But even if common sense bowed to formalism and the Board's investigation remained technically open, the scope of the Board's investigation --lawful only insofar as it enforces ICA Section 15(7) -- must be limited to newly tariffed rates or practices. See 49 U.S.C. app. § 15(7) (1988). As SFPP's tariffs made no changes to the West Line rates (except to add the Watson enhancement and the turbine fuel services), the Board could not have investigated the West Line rates.\n\nWe therefore conclude that FERC reasonably determined that the West Line rates (except, as noted above, for the Watson Station enhancement and turbine fuel rates) were grandfathered and therefore deemed just and reasonable under the terms of Section 1803(a) of the EPAct.\n\nC. Exceptions to Grandfathering\n\nWe turn now to the WLS' contention that the rates fall within the exceptions outlined in Section 1803(b) and therefore are still open to challenge under the ICA. Section 1803(b) permits a shipper to challenge a grandfathered rate if the shipper establishes either that (1) there has been a \"substantial change\" in the economic circumstances or services provided that \"were a basis for the rate\"; or (2) \"the person filing the complaint\" was under \"a contractual prohibition against the filing of a complaint\" on the date of the enactment of the EPAct. EPAct § 1803(b). The complaining shipper bears the burden of proving the existence of one of the circumstances triggering an exception. The Commission concluded that the WLS had not met either requirement. See SFPP, L.P., 68 FERC ¶ 61,105, 61,581 (1994) (contractual prohibition); Opinion No. 435, 86 FERC at 61,064-71 (changed circumstances). The shippers were therefore barred by the EPAct from challenging the grandfathered West Line rates. The WLS appeal both rulings.\n\n1. Substantially Changed Circumstances\n\nBefore the ALJ and the Commission, the WLS argued that there were five circumstances that had substantially changed so as to permit a challenge to the grandfathered West Line rates, including increased throughput on the West Line and the impact of the Commission's Lakehead decisions on SFPP's income tax cost allocation. The ALJ rejected all the substantial change arguments. See ALJ Decision, 80 FERC at 65,192-96. Concerning the claim based on throughput, the ALJ concluded that the evidence of a forty-percent increase in throughput from EPAct's enactment in October 1992 to 1995 (the last year for which data was obtained), by itself, could not prove a change in economic circumstances. Id. at 65,194. Missing, according to the ALJ, was any evidence demonstrating that the increase in throughput produced higher revenues and profits for SFPP. Id.\n\nThe Commission affirmed the holdings of the ALJ on each of the WLS' claims of substantial change, see Opinion No. 435, 86 FERC at 61,064-71, but, with respect to the throughput claim, did so on somewhat different reasoning, see id. at 61,067-69. The Commission found that the ALJ had erred by measuring change from the date of enactment of the EPAct, and by using data generated after the filing of the shippers' complaint. Id. Determining whether there has been a substantial change in economic circumstances providing the basis for the rate, the Commission held, requires comparing (a) the period before the rate first became effective (the basis for the rate) with (b) the period starting on the date of enactment and ending on the date of the complaint. Id. The WLS' substantial change claim based on increased throughput failed because the shippers measured changed circumstances against the \"wrong base period\" and with post-complaint evidence. Id. at 61,069. To establish a substantial change, FERC held, the shippers should have compared the period before the West Line rates became effective in 1989 to the period between October 24, 1992 (EPAct's enactment) and August 7, 1993 (the date of Chevron's complaint).\n\nThe shippers contest neither the Commission's interpretation of the substantial change provision of EPAct, nor its conclusion that the shippers failed to demonstrate a substantial change under that standard. The WLS do, however, maintain that the Commission's ruling employed a \"newly articulated standard\" and that they are, therefore, entitled to a remand so that they may have an opportunity to litigate under the Commission's \"new\" evidentiary requirements. WLS Br. 23. We reject this contention.\n\nEven before the Commission announced this interpretation, the correct points of comparison in a substantial change analysis were clear from the face of the statute. The statute requires a shipper to show a change in economic circumstances \"which were a basis for the rate.\" EPAct § 1803(b). As the Commission noted in its Opinion No. 435, this phrase could only mean \"the basis upon which the rate was last considered to be just and reasonable, either as a filed rate, a settlement rate, or one for which the Commission has made a legal determination.\" Opinion No. 435, 86 FERC at 61,068. Any other moment in time would lack \"correlation to the economic circumstances that were the basis of the rate at the time it was designed.\" Id.\n\nThe textual clues to the second point of comparison are perhaps less obvious but no less certain. The statute provides that \"[n]o person may file a complaint ... unless ... evidence is presented ... which establishes that a substantial change has occurred after the date of ... enactment.\" EPAct § 1803(b). From the \"after the date of enactment\" language we are given the earliest point at which a shipper may show a substantial change. The closing date for evidence is the day the complaint is filed; this conclusion follows from the language providing that no \"complaint\" may be filed unless \"evidence is presented\" with the complaint that demonstrates that a substantial change \"has occurred.\" As the Commission stated, \"[i]t is difficult to see how language that so explicitly uses the past tense could apply to evidence that would be developed at some indeterminate time after the complaint is filed.\" Opinion No. 435, 86 FERC at 61,069. Because the foregoing requirements of the statute are clear from its face, the shippers had adequate notice of the standard they were required to meet. See, e.g., Midtec Paper Corp., 857 F.2d 1487, 1510 (D.C. Cir. 1988) (rejecting petitioner's argument that it had inadequate notice specific evidence was required to support its complaint where the text of the regulations at issue \"clearly indicates\" that such evidence was to be considered).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThe WLS also argue that the Commission erred in rejecting their argument that the Commission's decision in Lakehead Pipe Line Co., L.P., 71 FERC ¶ 61,338 (1995) ( Lakehead ), reh'g denied, 75 FERC ¶ 61,181 (1996) (\" Lakehead II \"), insofar as it changed the ability of limited partnerships like SFPP to include certain income tax allowances in their cost of service, represented a substantial change in SFPP's economic circumstances. The Commission reasoned that the mere existence of the Lakehead policy, without any showing how the application of that policy affects the economic basis for the rates, cannot constitute substantially changed circumstances. See Opinion No. 435, 86 FERC 61,070-71. In light of our conclusion below that aspects of the Commission's Lakehead policy are arbitrary and capricious, we think the best course is to remand this claim to the Commission for further consideration in light of our disposition in this case.\n\n2. Contractual Prohibition\n\nThe WLS next contend that they may challenge the grandfathered West Line rates because they fit within the \"contractual prohibition\" exception. That exception allows a shipper to challenge a grandfathered rate when \"the person filing the complaint was under a contractual prohibition against the filing of a complaint which was in effect on the date of enactment of [the EPAct] and had been in effect prior to January 1, 1991.\" EPAct § 1803(b)(2). Navajo, as a part of an earlier settlement with SFPP, was subject to such a prohibition and thus was permitted to file a complaint against the West Line rates without demonstrating substantially changed circumstances. See SFPP, L.P., 67 FERC ¶ 61,089, 61,254 (1994). Navajo, however, reached another settlement with SFPP and withdrew its complaint against the pipeline. SFPP, L.P., 79 FERC ¶ 63,014 (1997). The Commission then terminated the Navajo complaint proceeding. SFPP, L.P., 80 FERC ¶ 61,088 (1997).\n\nThe WLS nevertheless argue that they, too, should not have to show substantially changed circumstances. First, they assert that Navajo's invocation of the contractual prohibition exception effectively vitiated the West Line rates' grandfathered status as to all complaining shippers. See WLS Br. 18 (\"The `grandfathered' status of the West Line rates ... was thus revoked.\"). Alternatively, the WLS argue that because the ALJ conditioned Navajo's \"withdrawal of the complaint\" on \"not prejudic[ing] in any way the status and rights of any other participants in this proceeding,\" SFPP, L.P., 79 FERC at 65,176, the other complaining shippers should be able to pursue their complaint as if Navajo had not withdrawn -- that is, without showing substantially changed circumstances. The Commission rejected both of these arguments. From the first, the Commission recognized that the contractual prohibition exception is party-specific. \"Because neither Chevron nor ARCO/Texaco was subject to a contractual bar [as was Navajo], it follows, under the plain meaning of the language of the statutory provision, that the complaints of Chevron and ARCO/Texaco [must show substantially changed circumstances].\" SFPP, L.P., 68 FERC at 61,581.\n\nAs for the shippers' claim that they had been prejudiced by Navajo's withdrawal, the Commission concluded that the condition on Navajo's settlement applied only to \"the integrity of the record.\" Opinion No. 435, 86 FERC at 61,073.\n\nWe agree with the Commission. The language of Section 1803(b)(2) is quite obviously party-specific. EPAct § 1803(b)(2) (\" the person filing the complaint was under a contractual prohibition\") (emphasis added). An interpretation, like that suggested by the WLS, that would allow other shippers to piggyback on the status of a contractuallyprohibited shipper, conflicts not only with the plain language of the statute, but also with Section 1803's overarching purpose of limiting litigation over pre-EPAct rates. On the other hand, the Commission's interpretation -- limiting the exception to those parties actually contractually prohibited from complaining -- is entirely consistent with the statute and therefore reasonable. We also find no merit to the WLS' claim that they were somehow prejudiced by Navajo's settlement. After examining the relevant proceedings, see SFPP, L.P., 79 FERC at 65,176, we think it clear that the ALJ, in implicitly promising that Navajo's withdrawal would not \"prejudice ... the status and rights of any other participants in proceeding,\" was referring only to the evidence that Navajo had placed into the administrative record.\n\nII. The East Line\n\nSFPP's East Line rates were not grandfathered under § 1803 of the EPAct, as EPR, as an ELS, had challenged them in the same September 1992 complaint in which it had protested SFPP's flow-reversal on the six-inch line. They were therefore \"subject to protest, investigation, or complaint\" within the year prior to the EPAct's enactment. Navajo later filed its own complaint against the East Line rates, and the Commission proceeded under the ICA, which, in Section 15, empowers the Commission to set aside rates it finds \"unjust or unreasonable,\" and to \"determine and prescribe what will be the just and reasonable ... rates, fares or charges to be thereafter observed.\" 49 U.S.C. app. § 15(1) (1988). The ALJ evaluated SFPP's East Line rates pursuant to its cost of service regulations, 18 C.F.R. § 346.2 (2004), found them unjust and unreasonable, and proceeded to set new ones in their place. ALJ Decision, 80 FERC at 65,122- 191. The Commission substantially affirmed the ALJ's determination in Opinion No. 435. 86 FERC at 61,084-111. Under the Commission's rate-of-return methodology, this involved determinations of SFPP's embedded capital costs, its yearly operating expenses, allowances for other costs, and its appropriate rate of return. See 18 C.F.R. § 346.2(c).\n\nThe proceedings before the Commission were complex, and many of the issues it decided in setting new East Line rates (and in determining that the previous rates were unjust or unreasonable) have not been challenged. As relevant to our review, the parties dispute only four discrete issues regarding the Commission's East Line rate-setting: (1) the starting rate base to which SFPP was entitled; (2) what tax allowance, if any, should be factored into rates; (3) the proper means of recovery, if any, of SFPP's litigation expenses; and (4) the treatment of SFPP's claimed expenses for reconditioning portions of the East Line.\n\nThe court reviews the Commission's ratemaking decision to determine whether it was arbitrary and capricious, see Association of Oil Pipelines v. FERC, 83 F.3d 1424, 1431 (D.C. Cir. 1996) (\" AOPL \"), according special deference to the Commission's expertise, id. at 1431; see also In re Permian Basin Area Rate Cases, 390 U.S. 747, 790 (1968). The court thus examines the Commission's ratemaking decisions to determine whether the Commission has examined the relevant data and articulated a rational connection between the facts found and the choice made. AOPL, 83 F.3d at 1431. The Commission must \"cogently explain why it has exercised its discretion in [the] given manner.\" Exxon Corp. v. FERC, 206 F.3d 47, 54 (D.C. Cir. 2000) (quoting Motor Vehicle Mfrs. Ass'n of U.S., Inc. v. State Farm Mut. Auto. Ins. Co., 463 U.S. 29, 48-49 (1983)).\n\nA. Starting Rate Base\n\nThe Commission decided that to measure SFPP's overall investment upon which it is entitled to a return, SFPP should use its December 19, 1988 capital structure. Opinion No. 435-A, 86 FERC at 61,503-06. In assessing the value of a pipeline's invested capital, the Commission's approach --stemming from its opinion in Williams Pipeline Co., 31 FERC ¶ 61,377 (1985) (\"Opinion No. 154-B\") -- weighs equity and debt-financed capital investments made prior to 1985 differently, and SFPP contends that the Commission used the wrong historical ratio between the two in setting the starting rate base.\n\nSome explanation of the \"starting rate base\" concept and its history is necessary. Prior to June 28, 1985, the rate base to be included in oil pipeline cost of service analysis was calculated under an Interstate Commerce Commission (\"ICC\") valuation method, which combined elements of original and reproduction cost. In Farmers Union Central Exchange, Inc. v. FERC, 584 F.2d 408, 417-20 (D.C. Cir. 1978) (\" Farmers I \"), the court expressed concerns about the ICC's valuation methodology, particularly its tendency to overvalue assets so as to \"exceed[ ] investment by a substantial amount.\" Id. at 415. After the Commission proposed to continue to use the ICC's valuation method in Williams Pipeline Co., 21 FERC ¶ 61,260 (1982), the court, on review from that decision, remanded the case in Farmers Union Central Exchange, Inc. v. FERC, 734 F.2d 1486, 1510-14 (D.C. Cir. 1984) (\" Farmers II \"), and directed the Commission to consider alternatives, noting the widespread agreement among many experts that the ICC's method \"lacks any economic rationale.\" Id. at 1511 (internal citation omitted).\n\nOn remand from Farmers II, the Commission developed its current \"trended original cost\" method. Opinion No. 154-B, 31 FERC at 61,833-35. This method starts from the original cost of a pipeline's assets but smooths out depreciation and equity recovery over the life of the pipeline, thereby avoiding the front-loading problems associated with a depreciated original cost methodology. Making the switch to this \"trended original cost\" method required the Commission to account for investments in existence at the time of the change. Under the ICC's valuation rate base methodology, many of these had been valued substantially above investment cost. See Farm -ers I, 584 F.2d at 415. Setting their value to depreciated original cost would, in many cases, have significantly decreased their valuation for rate-setting purposes. See Opinion No. 154-B, 31 FERC at 61,836. To mitigate any abrupt reduction in pipeline earnings resulting from the change, the Commission permitted a one-time rate base adjustment --creating a so-called starting rate base -- calculated by partially continuing the ICC's valuation method to the extent of a pipeline's equity ratio, but assessing its rate base at depreciated original cost to the extent of its debt ratio. Opinion No. 154-B, 31 FERC at 61,835-37. Because the stated purpose of this approach was to protect the expectations of investors who had invested prior to the switch, the Commission determined that the relevant debt-to-equity ratio would be a pipeline's capital structure as of the date of Opinion 154-B, June 28, 1985, rather than its capital structure at the time rates are set. See Williams Pipeline Co., 33 FERC ¶ 61,327, 61,640 (1985) (\"Opinion No. 154-C\").\n\nThe court has never reviewed the reasonableness of the Commission's Opinion No. 154-B methodology, nor need we do so now, as no party has challenged whether that approach is faithful to the court's remand order in Farmers II, 734 F.2d at 1511-21. The ELS support the Commission's application of the Opinion No. 154-B methodology, and SFPP contends only that the Commission's use of December 19, 1988 rather than June 28, 1985 as the relevant snapshot of the pipeline's capital structure is not faithful to Opinion No. 154-B and its progeny. We turn, then, to SFPP's contention that the Commission acted arbitrarily and capriciously, and departed from past precedent without adequate explanation, in rejecting use of the actual June 28, 1985 capital structure of the Santa Fe Southern Pacific corporation (\"SFSP\"), the pipeline's then-parent.\n\nSFPP did not yet exist in 1985, and its predecessor corporation, Southern Pacific Pipelines, Inc. (\"SPPL\"), was a wholly-owned corporate subsidiary of SFSP. SPPL therefore had a 100% equity structure, and no party urged the Commission to use that capital structure to calculate SFPP's starting rate base. SPPL's parent, SFSP, was capitalized at 78.29% equity and 21.71% debt at the time, and SFPP urged the Commission to follow Opinion No. 154-B's instruction to use the parent's capital structure to calculate the starting rate base. Initially, in Opinion No. 435, 86 FERC at 61,089-90, the Commission took the position that the 1988 settlement agreement between SPPL and several of its shippers, which had last set the pipeline's rates, required the use of SFSP's capital structure in the starting rate base. On rehearing in Opinion No. 435-A, however, the Commission decided that the settlement did not preclude it from independently examining SFPP's capital structure after the rates set by the settlement expired. The Commission determined that SFSP's capital structure should not be used in the starting rate base calculation because SFSP's high equity component in June 28, 1985 did not \"accurately reflect[ ] the risks of SFPP's underlying operations,\" and there was a \"significant difference in the nature of the pipeline's operations and those of its parent company on June 28, 1985.\" Opinion No. 435-A, 91 FERC at 61,504-05.\n\nSFPP contends that Opinion No. 154-B requires, in cases where a pipeline is owned by a parent company and therefore does not issue debt in its own name, the use of a parent company's capital structure as of June 28, 1985. Opinion No. 154-C, which clarified Opinion No. 154-B, does contain the instruction that \"the capital structure to be used in determining the starting rate base is as of the date of Opinion No. 154-B (June 28, 1985).\" 33 FERC at 61,640. The Commission qualified that approach, however, in ARCO Pipeline Co., 52 FERC ¶ 61,055, 61,233-34 (1990), where it began applying its precedents from the rate-of-return context -- in which it first examines whether a parent company's capital structure is representative of its subsidiary's risk level before imputing it to the subsidiary -- to the capital structure used in the starting rate base calculation. While the Commission in ARCO ended up using the corporate parent's actual capital structure, it indicated that its decision to do so hinged on \"whether the capital structure is representative of the pipeline's risks.\" Id. at 61,233.\n\nARCO did not contain much by way of explanation about why the representativeness of a parent's capital structure to the pipeline's risks should matter; its relevance to the starting rate base, where the equity component is standing in as a measure of investor reliance on the old ICC valuation method, appears less obvious than in the rate-of-return context, where pipelines receive different returns on debt and equity to compensate for their different risk levels, see, e.g., Kuparuk Transportation Co., 55 FERC ¶ 61,122, 61,375-78 (1991); Alabama-Tennessee Natural Gas Co., 25 FERC ¶ 61,151, 61,417-18 (1983). But the Commission's basic premise that a capital structure representative of a pipeline's risks must be used in the starting rate base calculation is not at issue, for SFPP concedes that the Commission can depart from a parent's actual capital structure if it is \"not ... representative of the pipeline's risks.\" SFPP Pet. Br. 17. SFPP's challenge goes only to whether the Commission made a reasoned decision applying that standard, and nothing about the Commission's determination of SFPP's, SPPL's, and SFSP's relative risk levels was arbitrary or capricious.\n\nThe Commission noted that the bulk of SFSP's business was in the railroad, trucking, and mineral exploration industries, which faced substantially higher amounts of competition than the pipeline, a regulated \"monopoly for the entire period\" guaranteed a fair rate of return and \"sufficiently secure that it proposed to undertake a major expansion beginning in 1985.\" Opinion No. 435-B, 96 FERC at 62,067. Most importantly, the Commission had a powerful piece of evidence of the pipeline's relatively low risk level: its initial public offering. When it first became a stand-alone entity on December 19, 1988, SFPP was able to adopt a capital structure financed with 60.74% debt and 39.26% equity. This strongly suggests a market judgment that the pipeline was significantly less risky than SFSP, which was financed with 78.29% equity and 21.71% debt. The Commission's view that SFPP's equity level as of its initial public offering more \"accurately reflect[ed] the pipeline's risk\" than that of its previous parent was based upon a reasoned view that \"the financial market's perceptions of the pipeline's risk,\" as demonstrated through an \"arms length public offering,\" provide an accurate estimate of an entity's risk level. 96 FERC at 62,068. SFPP misses the mark when it states that there is no single capital structure dictated by the market, for although other reasonable debt-equity ratios might have been adopted for SFPP, none would have market imprimatur. The reasonableness of the Commission's position is confirmed by the very different nature of the respective entities' business operations and the stark contrast between the capital structures each adopted. The same reasoning explains the Commission's choice to use December 19, 1988, the date of SFPP's initial public offering, as the relevant snapshot of its equity level, hardly an arbitrary date given its reliance on the judgment of the financial markets.\n\nSFPP maintains, however, that by adopting SFPP's December 19, 1988 capital structure for purposes of the starting rate base calculation, the Commission improperly applied it \"retroactively,\" thereby denying the pipeline a fair chance to bring itself in line with the capital structure hypothesized. The Commission's use of the December 19, 1988 capital structure was predicated on the conclusion that it was representative of the pipeline's risks in 1988, and that there were \"no rational grounds here to believe that SPPL's operations or business substantially changed between June 28, 1985 and December 19, 1988.\" Opinion No. 435-B, 96 FERC at 62,067. SFPP points to nothing that suggests otherwise. The starting rate base is an element of the determination of the prospective rates \"in dispute in this proceeding,\" and the Commission was neither altering past rates nor seeking to recover the pipeline's past losses in future rates; rather, it was determining a just and reasonable valuation of the pipeline's investment for the purpose of setting present rates. As such, there was nothing \"retroactive\" about the Commission's setting of the starting rate base.\n\nBecause the record contained sufficient evidence on which the Commission could find that SPPL faced significantly lower risks than SFSP in 1985, and SFPP concedes that the Commission may depart from an actual capital structure in the starting rate base formula where it is not representative of a pipeline's risks, the court has no occasion to decide whether the Commission improperly relied on non-record material from Moody's Transportation Manual regarding the poor financial condition of the Southern Pacific Railroad during the relevant period. Nor need we decide whether the Commission's other basis for departing from SFSP's 1985 capital structure -- its concern that SFSP's 78.29% equity component would yield an exorbitantly high starting rate base -- would suffice to uphold its decision. Accordingly, we affirm the Commission's starting rate base decision.\n\nB. Cost Issues\n\n1. Income Tax Allowance\n\nAs one element of the cost of service allowable to SFPP, FERC included a 42.7% income tax allowance reflecting the interest in the regulated entity held by a subchapter C corporation. All petitioners assigned this tax allowance as error. The shipper petitioners, and intervenors supporting them, allege as error the recognition of any income tax allowance as SFPP is a limited partnership that pays no income taxes. SFPP alleges as error the denial of a full income tax allowance. Because FERC has not established that its 42.7% allowance is the product of reasoned decisionmaking and indeed has provided no rational basis for this part of its order, we find that allowance to have been erroneous and we vacate.\n\nThere is no question that as a general proposition a pipeline that pays income taxes is entitled to recover the costs of the taxes paid from its ratepayers. We explained this proposition thoroughly in City of Charlottesville v. FERC, 774 F.2d 1205 (D.C. Cir. 1985) (Scalia, J.). While we will not fully discuss the analysis set forth in that decision, we will briefly review the basic principles as background for the current controversy.\n\nThe Commission must ensure that the rates of jurisdictional pipelines are \"just and reasonable.\" Id. at 1207 (quoting 15 U.S.C. § 717c(a) (1982)). This means that using the principles of cost of service ratemaking, Commission-approved rates must yield \"sufficient revenue to cover all proper costs,\" and provide an appropriate return on capital. Id. (citing Pub. Serv. Co. of New Mexico v. FERC, 653 F.2d 681, 683 (D.C. Cir. 1981)). Taxes, including federal income taxes, are costs. See id. at 1207. The difficulty in the application of this seemingly straightforward principle arises when \"the utility is part of a consolidated group,\" only a portion of which is regulated. Id. Historically, the Commission has employed two differing methodologies for attribution of tax costs in dealing with this difficulty. Again, City of Charlottesville provides the background for understanding the two methodologies. Under the older, \"flow-through\" methodology, the Commission \"derive[d] an effective tax rate by determining the ratio of each [regulated] pipeline's taxable income to the total taxable income of all affiliates, multipl[ied] this fraction by the group's consolidated tax liability, and divide[d] this figure by the pipeline's taxable income.\" Id. at 1207. Under the more recently derived \"stand-alone\" methodology, the Commission has sought to segregate the regulated utility, then determine \"the taxable income and deductions ... specifically attributable to the utility's jurisdictional activities.\" Id. Under this approach, the Commission then applies \"the statutory tax rate ... to the tax base to yield the stand-alone tax allowance.\" Id. The present controversy arises from the fact that neither of these historic methods can by its terms be literally applied to the rates of SFPP.\n\nThe name of the jurisdictional pipeline operator explains the origin of the difficulty. SFPP, L.P., is a limited partnership -- specifically a publicly-traded one. Both the flowthrough and stand-alone methodologies presume taxable income generated by the regulated entity. Each arose in the context of corporate ownership of a jurisdictional pipeline by a tax-paying corporation which is part of an affiliated group. Shipper petitioners concede that were SFPP a subchapter C corporation, a tax allowance would be appropriate in order \"to insure that the regulated entity has the opportunity to earn its allowed return on equity.\" Lakehead, 71 FERC at 62,314. But a limited partnership operating jurisdictional pipelines incurs no income tax liability. 26 U.S.C. § 7704(d)(1)(E).\n\nTherefore, shipper petitioners contend there is no rational basis for FERC to approve an income tax allowance for a limited partnership that incurs no income taxes. Thus, shippers argue, FERC erred in allowing even a 42.7% tax allowance in the rates of SFPP.\n\nShippers raised this argument before the Commission and the Commission discussed it in Opinion No. 435. See 86 FERC at 61,101-07; see also Opinion No. 435-A, 91 FERC at 61,508-09; Opinion No. 435-B, 96 FERC at 62,077-78. In all of its iterations, FERC's discussion of the issue has been in terms of the \" Lakehead policy.\" FERC first announced that policy in Lakehead, 71 FERC ¶ 61,338, and offered certain clarifications of the policy in Lakehead II, 75 FERC ¶ 61,181. That case also involved ratemaking of a limited partnership. In Lakehead, the Commission declared that where a regulated pipeline is a non-taxed limited partnership, it will not be permitted the same tax allowance as it would if the pipeline company were a corporation. However, FERC further ruled that where the limited partnership includes corporate partners, it would treat the partnership as being \"in essence a division of each of its corporate partners\" for purposes of determining an income tax component in the partnership's cost of service computation. Lakehead, 71 FERC at 62,315. Importantly, FERC's opinion in Lakehead was never subjected to judicial review, and neither this court nor any other circuit has ever passed on the validity of the Lakehead policy. Therefore, while FERC may deem itself bound to follow that policy, we are not so bound and consider its validity for the first time in this application. All petitioners urge us to reject it in whole or in part, though for differing reasons.\n\nCommencing with the assumption that it should apply the Lakehead policy to SFPP's ratemaking, FERC considered the question before it to be the determination of how that policy applied to a limited partnership composed of one partner (or partners) that is a subchapter C (taxpaying) corporation and other partners that are not subchapter C corporations but rather individuals, subchapter S corporations, trusts, or other entities that do not incur corporate income tax. FERC's analysis is rooted in the rationale offered in Lakehead, discussed in the ALJ Decision, see 80 FERC at 65,179, and adopted by the Commission in Opinion No. 435, see 86 FERC at 61,102. The Commission bases that rationale on the \"double taxation\" incurred in the context of subchapter C corporations, in which the profitmaking corporation is liable for corporate income tax and the shareholders of the corporation are individually liable for their individual income tax on dividends generated by the profitmaking corporations.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The Commission in Lakehead ruled that \"because the corporate tax is an extra layer of taxation, the Commission includes an element for the corporate taxes in the costof-service to insure that the regulated entity has the opportunity to earn its allowed return on equity.\" 71 FERC at 62,314. This same rationale guided the Commission's computation of tax allowance for the nontaxpaying limited partnership, including one or more subchapter C partners, throughout the Lakehead administrative litigation and the SFPP ratemaking now before us. Because SFPP, Inc., a subchapter C corporation, held a 42.7% interest\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e in the SFPP limited partnership, the Commission included in the cost of service computation for SFPP, L.P., a 42.7% allowance for income taxes that would have been incurred had the pipeline's jurisdictional earnings been subject to corporate taxation. 86 FERC at 61,103.\n\nShippers contend that FERC erred in including this income tax allowance, arguing that the ALJ was correct that because no income taxes have been or will be paid on SFPP's partnership income, the inclusion of an income tax allowance in the cost of service constitutes allowance for \"phantom taxes.\" Id. SFPP, on the other hand, contends that the 42.7% allowance is in fact inadequate to reflect cost of service. It argues that the Lakehead policy results in an understatement of the appropriate income tax allowance, and that the Commission should have applied a version of the \"stand-alone\" methodology discussed above, treating the regulated entity as if it alone were responsible for taxes which would have been incurred on the same income had the jurisdictional pipeline been a taxable corporation.\n\nBecause we conclude that FERC's rationale does not support its conclusion, we hold that inclusion of the 42.7% income tax allowance in the cost of service computation was erroneous and we vacate FERC's order to that effect. We further conclude that SFPP's arguments are not well-taken and reject the proposition that FERC should have included the 100% allowance that SFPP seeks. We further conclude that the shipper petitioners offer a convincing analysis consistent with ratemaking principles and governing law, and that on the record before us SFPP is entitled to no allowance for the phantom income taxes it did not pay.\n\nWe cannot conclude that FERC's inclusion of the income tax allowance in SFPP's rates is the product of reasoned decisionmaking. In Lakehead, as re-adopted in the opinion before us, the \"reasoning\" consists of a recitation of separately unassailable statements that do not together constitute a syllogism leading to the conclusion purportedly based on them. The Commission in Lakehead reasoned that:\n\n1. Under cost-of-service ratemaking principles a regulated company is entitled to rates that yield sufficient revenue to cover its appropriate costs.\n\n2. Income tax allowance is no different from the allowance for any other costs.\n\n3. When the regulated entity is organized as a corporation, its revenues are taxed at the corporate tax rate and the earnings of the owners (shareholders) of the corporation are then taxed on dividends at their particular rate.\n\n71 FERC at 62,314.\n\nTo that point the Commission's statements are unassailable. However, the Commission follows these statements with a rather cryptic statement. \"Because the corporate tax is an extra layer of taxation, the Commission includes an element for the corporate taxes in the cost-of-service to ensure that the regulated entity has the opportunity to earn its allowed return on equity. However, there is no allowance for the taxes paid by the owners of the corporation.\" Id. Again, the second of these two sentences is inarguable, but it is not at all clear what the Commission means by the first. It would seem to follow from the Commission's own reasoning in the preceding elements of analysis, as well as fundamental principles of ratemaking, that if the corporate tax is to be included in the cost-of-service, it is not because it is \"an extra layer of taxation,\" but rather because it is a cost. Id. In the Commission's own words, a tax allowance is \"no different from the allowance for any other costs.\" Id. Presumably whatever tax rate was applicable to a tax-paying regulated entity would be included in the cost-of-service analysis, nor does anything said by the Commission in Lakehead or in the opinions before us dispute that presumption. From this line of \"reasoning,\" FERC proceeded to conclude that the limited partnership operating a jurisdictional pipeline \"is entitled to an income tax allowance with respect to income attributable to its corporate partners.\" Id. The only further explanation that FERC offers for this conclusion is \"when partnership interests are held by corporations, the partnership is entitled to a tax allowance in its cost-of-service for those corporate interests because the tax costs will be passed on to the corporate owners who must pay corporate income taxes on their allocated share of income directly on their tax returns.\" Id.\n\nThe Commission then goes on to \"conclude[ ] that [the limited partnership pipeline] should not receive an income tax allowance with respect to income attributable to the limited partnership interests held by individuals ... because those individuals do not pay a corporate income tax.\" Id. at 62,315. Presumably, however, the individual owners pay individual income taxes. Also, presumably many owners (shareholders) of corporate holders of limited partnership interests will not be paying taxes on dividends as corporations often do not generate dividends.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e In the original Lakehead opinion, the Commission had little further to say about why it distinguished between the corporate taxes of corporate unit holders and the individual income taxes of individual unit holders. In Lakehead II, and in the opinions we review today, the Commission did offer some attempt to explain the distinction.\n\nIn Lakehead II, FERC considered the argument of the Lakehead limited partnership that the Commission's refusal to grant a tax allowance reflecting the tax liabilities of all limited partnership unit holders, whether or not each holder was a subchapter C corporation, did not comport with the Commission's own \"actual taxes paid\" rationale, because the Commission, under the \"stand-alone\" tax policy discussed above, would permit \"a regulated entity to collect a fair tax allowance even where no actual tax liability is incurred.\" Lakehead II, 75 FERC at 61,594. Lakehead II went on to argue that under this rationale, even if the jurisdictional entity is a non-taxed limited partnership, \"rate payers should be responsible for the tax liability otherwise associated with the revenue generated from the jurisdictional activities, without regard to any actual amount paid to the IRS.\" Id. In rejecting the argument, the Commission stated, no doubt correctly, that in the case of a jurisdictional corporate subsidiary of a corporate group, \"the allowed equity return generates an actual tax liability for the pipeline that must be paid to the IRS, either in cash or through the use of another member's deductions.... [E]ither way, the tax liability of the jurisdictional company is a real cost of providing service.\" Id. at 61,595 (citing Northern Border Pipeline Co., 67 FERC ¶ 61,194, 61,110-11 (1994)). As applied to tax liability generating corporate subsidiaries engaged in jurisdictional activities, the Commission's statement is again quite defensible, when such a subsidiary does not itself incur a tax liability but generates one that might appear on a consolidated return of the corporate group. The difficulty arose when the Commission attempted to take the next step and explain why this reasoning applied to an entity that is a non-taxable limited partnership and to justify discriminating between allowances for the tax liability of corporate unit holders and the tax liability of those unit holders who are individuals or otherwise not subchapter C corporations. The Commission's reasoning on that point extends for two more paragraphs, but is summarized in the following statement immediately following the last quoted language from Lakehead II:\n\nIn contrast, there is no corporate tax liability associated with individual partners' equity return and therefore it is not appropriate to allow Lakehead to collect for such amounts in its cost-of-service.\n\nId. This does not supply reasoning for differentiating between individual and corporate tax liability. It is merely restating the proposition that the Commission is so differentiating. Otherwise stated, the Commission is once again simply declaring: we are including a tax allowance for corporate tax liability; we are not allowing a deduction for individual income tax liability. To re-phrase a proposition is not the same as supplying supporting reasoning. In short, the Commission's opinions in Lakehead do not evidence reasoned decisionmaking for their inclusion in cost of service of corporate tax allowances for corporate unit holders, but denial of individual tax allowances reflecting the liability of individual unit holders.\n\nNonetheless, we could sustain the Commission's decision if the opinions we review had added the reasoned decisionmaking lacking in Lakehead. They do not. Before the court, the Commission's counsel argues that the distinction is justified in the reasoning offered by the ALJ in the portion of his decision affirmed by the Commission. The ALJ, attempting to apply the Lakehead policy, had reasoned that \"investors in a regulated pipeline are entitled to a return `commensurate with returns on investments in other enterprises having corresponding risk.' \" ALJ Decision, 80 FERC at 65,177 (quoting FPC v. Hope Natural Gas Co., 320 U.S. 591, 603 (1944)). Still struggling with the Lakehead policy which had permitted a corporate income tax allowance but not an allowance for the tax liability of other investors in the limited partnership, the ALJ concluded \"because there is no dual taxation, a tax allowance is not necessary to ensure that an individual limited partner obtains a `commensurate return.' \" Id. We agree that the ALJ's invocation of the Hope Natural Gas Co. principle was apt, but unlike the Commission, we agree that the conclusion he based it on was sound.\n\nThe Hope Natural Gas decision did not itself involve attribution of tax liability for purposes of determining allowances and ratemaking. It did however, apply general principles of ratemaking that are instructive in that context. As the Commission argues to us, that decision teaches that the Commission's ratemaking function involves \"a pragmatic assessment of whether the rates prescribed for a pipeline will support its services and provide a reasonable return to its investors.\" FERC Br. 60 (citing Hope Natural Gas, 320 U.S. at 602; Farmers II, 734 F.2d at 1502). However, the Commission's premise again does not lead to the Commission's conclusion. The ALJ correctly derived from Hope Natural Gas the more specific principle that the regulating commission is to set rates in such a fashion that the regulated entity yields returns for its investors commensurate with returns expected from an enterprise of like risks. Were the corporate unit holders investing in a non-regulated entity of like risk and otherwise similar return, they would of course expect to pay their own corporate tax on any profit they might realize from that investment. Should that profit generate dividends from the corporations, the shareholders would expect to pay their own taxes on such dividends.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Likewise, individual investors in such a non-regulated enterprise would expect to pay their individual taxes thereon. Granted, the second group of investors would pay one level of taxation; the first group, at least potentially, two layers of taxation. This is a product of the corporate form, not of the regulated or unregulated nature of the pipeline or any comparable investment or of the risks involved therein. Therefore, consistent with Hope Natural Gas, the ALJ correctly concluded that where there is no tax generated by the regulated entity, either standing alone or as part of a consolidated corporate group, the regulator cannot create a phantom tax in order to create an allowance to pass through to the rate payer. The Commission erred when it rejected the ALJ's conclusion.\n\nAs we have recited repeatedly above, and as the Commission itself has recognized in this very proceeding, under costof-service principles, a regulated company is entitled to a rate design to yield sufficient revenue to cover its appropriate cost; income tax allowance is no different from the allowance of any other costs. The regulated pipeline generates many costs, for example bookkeeping expenses. Presumably those bookkeeping expenses are recoverable in its rates. Its corporate unit holders, if any, presumably also have bookkeeping expenses. The bookkeeping expenses of the corporate unit holders are not recoverable in the rates of the pipeline, even though the corporation and its shareholders each may independently be paying bookkeepers and accountants unlike individual unit holders who pay only for their own accounting. All of this makes sense. It makes equal sense when applied to income taxes.\n\nSFPP, while raising its own objections to the Lakehead policy, joins the Commission in opposing the shipper petitioners' arguments that no income tax allowance should be included in the ratemaking. SFPP, however, argues that the Commission not only did not err in including the potential tax liability of its corporate unit holders, it instead erred in not including the potential tax liability of its individual or other non-subchapter C corporate unit holders. That argument serves to illustrate further why the ALJ was correct in including no such pass-through or phantom taxes at all. Under the Commission's present order, the imputed tax liability of the corporate unit holders creates an allowance included in the making of the rate for the pipeline. The ratepayers pay that rate for the product shipped, but the allocation of the nontaxed profit of the limited partnership pipeline is, so far as the record reflects, subject to division among the unit holders rateably according to their interest in the limited partnership, not affected by how their share of the profits will ultimately be taxed. Therefore, even if the Commission's goal of changing the risk analysis of \"double-taxed\" investors were a valid one, it is not being accomplished. The inclusion of the phantom taxes in the rate changes the profit margin for all unit holders in the untaxed limited partnership, not just those who are under a particular tax structure. Therefore, SFPP may well be correct that if such an allowance were allowable at all, it should have been allowed for the imputed taxes potentially incurred by all unit holders who realized taxable income from the untaxed profits of the limited partnership of the pipeline. For the reasons set forth above, we hold that the first step of this analysis is erroneous -- that is, we hold that no such allowance should be included.\n\nBoth FERC and SFPP argue that the position we adopt today is inconsistent with the \"stand-alone\" methodology approved by this court in City of Charlottesville, for reasons related to the so-called \"actual tax\" principle discussed therein. City of Charlottesville, 774 F.2d at 1207, 1215. Again, we will not rehash the full analysis of City of Charlottesville, but simply will remind SFPP that the stand-alone principle as approved in City of Charlottesville dealt with the imputation of taxes within a corporate structure where the imputation was made necessary not by the non-taxable, non-corporate nature of the regulated entity, but by the allocation of profits and losses among the related members maintaining separate balance sheets within a consolidated corporate group. While it is true that then-Judge Scalia posited the applicability of the stand-alone methodology to a circumstance in which taxes were \"not necessarily ... paid,\" id. at 1215, that analysis dealt with the use of \"actual or estimated taxes paid or incurred\" rather than being limited to actual taxes paid. But the part of the City of Charlottesville opinion in which that discussion occurred dealt with the argument that the taxes, though properly estimated and actually incurred, might not ever be actually paid because of such factors as losses generated in the corporate structure, or the allocation of profits between and among taxable years in such a fashion as to result in a different tax actually being paid, if any at all. See id. at 1214-15. Nothing in the City of Charlottesville opinion suggests that it is the business of the Commission to create tax liability when neither an actual nor estimated tax is ever going to be paid or incurred on the income of the utility in the ratemaking proceeding.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nFinally, SFPP argues that adopting the Lakehead policy and applying it to this case to restrict the allowance to the taxes of the corporate unit holders as opposed to imputing the taxes of all unit holders \"runs directly contrary to legislation in which Congress expressly sought to encourage the publicly traded partnership formed for oil pipelines and other selected industries.\" Underlying this argument is Congress's 1987 enactment of Section 7704 of the Internal Revenue Code. 26 U.S.C. § 7704 (added by Pub L. 100-203, Title X, § 10211(a), Dec. 22, 1987, 101 Stat. 1330-403). Under Section 7704, Congress decreed that, in general, publicly traded limited partnerships would be taxed as corporations. However, Congress made the policy decision that for a limited number of industries, including \"pipelines transporting gas, oil, or products thereof,\" limited partnerships should operate without taxation to encourage investment in those critical industries. Id. § 7704(d)(1)(E). SFPP argues that because Congress singled out a narrow category of enterprises with the intent to facilitate investment in such enterprises by providing a taxefficient means to raise capital, FERC's policy is inconsistent with congressional intent because it provides a smaller incentive than would be the case if it granted an allowance for phantom taxes based on all unit holders instead of simply the corporate ones. This is a classic case of an argument proving too much.\n\nSFPP's argument would equally apply to any decision by the Commission that caused the pipeline lower allowances rather than higher. Unsurprisingly, SFPP is able to offer no precedent for the proposition that we should compel the Commission, or any other agency, to adopt a rate structure bringing it into line with the perceived intent of Congress to achieve objectives in general, as opposed to consistency with the mandate adopted by Congress in furtherance of such objectives. As we have noted in other contexts, congressional mandates to agencies to carry out \"specific statutory directive[s] define[ ] the relevant functions of [the agency] in a particular area.\" Michigan v. EPA, 268 F.3d 1075, 1084 (D.C. Cir. 2001). Such a mandate does not create for the agency \"a roving commission\" to achieve those or \"any other laudable goal.\" Id. The mandate of Congress in the tax amendment was exhausted when the pipeline limited partnership was exempted from corporate taxation. It did not empower FERC to do anything, let alone to create an allowance for fictitious taxes.\n\nFor the reasons set forth above, we vacate the taxallowance portion of the FERC opinion and order allowing recovery for income taxes not incurred and not paid.\n\n2. Litigation Costs\n\nThis case has been an expensive one. At the time of the ALJ Decision, 80 FERC ¶ 63,013, SFPP sought to recover $15.1 million for litigation expenses and associated costs related to Commission and certain civil litigation. This included a $12 million litigation expenses reserve plus $3.1 million that SFPP claimed was a direct expense associated with this rate proceeding and related civil litigation. By the time this case reached its second rehearing in 2001, Opinion No. 435-B, SFPP's actual costs appear to have ballooned much higher; the pipeline's 2002 compliance filing places its cumulative costs litigating this rate proceeding, as well as litigating and settling related civil litigation, at over $48.1 million.\n\na. Rate Litigation\n\nIn keeping with Iroquois Gas Transmission Sys. v. FERC, 145 F.3d 398 (D.C. Cir. 1998), and its own precedents, the Commission considered SFPP's rate litigation to be \"part of its normal, ongoing operations\" and allowed SFPP to recover these costs from shippers. It did not, however, permit recovery through a permanent rate increase. Reasoning that SFPP's regulatory litigation costs, if \"includ[ed] in embedded rates,\" would \"artificially inflate the level of rates between rate cases,\" because the rate proceeding that caused most of the costs was now over and was not likely soon to recur, the Commission refused to factor them into SFPP's indexed rates. Instead, the Commission allowed SFPP to recover its actual regulatory litigation costs in the form of an amortized five-year surcharge, with recovery of costs incurred after the 1994 test year offset by the amount which SFPP had collected in excess of the just and reasonable rates from shippers that did not file complaints within the appropriate period. The court reviews, therefore, two distinct decisions of the Commission: to use a temporary surcharge in lieu of a rate increase to recover SFPP's rate litigation costs, and to offset the post-1994 surcharge by the amount of reparations that would have been due non-complaining shippers.\n\nNo party challenges the Commission's decision that SFPP's rate litigation costs are recoverable. This does not mean, however, that SFPP was automatically entitled to have those expenses treated as part of its indexed rates, as if the unusually high costs it incurred in this proceeding would regularly recur until the next rate proceeding. SFPP contends that it was entitled to have a litigation reserve factored into its cost of service, because it incurred significant regulatory litigation expenses in the test year, 1994, and was bound to continue to incur costs litigating matters before the Commission in the future. Yet nothing in the record suggests that any other matters SFPP has pending before the Commission will generate costs close to those in this rate proceeding. A glance at SFPP's compliance filing confirms that its litigation expenses have dropped significantly from the levels they reached between 1994 and 1997. The Commission's reasoning for denying the rate increase, that there was \"no assurance that SFPP's litigation costs would exceed $2,914,114 a year for the several years that the 1994 rates are likely to remain in effect,\" Opinion No. 435-B, 96 FERC at 62,075, seems quite reasonable. The Commission has not denied all recovery of these costs but simply limited SFPP's recovery to its actual costs defending this proceeding and required that those costs be removed from rates once they were repaid.\n\nWhere the Commission took a more novel approach was in how it implemented this surcharge. While SFPP was permitted to recover its 1993 and 1994 regulatory litigation costs in full, the Commission offset the surcharge for later years by the amount SFPP had collected, in excess of rates ultimately set by the Commission, from shippers that did not challenge the rates and were therefore not entitled to reparations. SFPP contends that this novel approach of deducting \"unclaimed reparations\" from the surcharge deprived it of a full recovery, because, in effect, it recovered nothing at all for litigation costs incurred after the test year.\n\nAlthough the Commission does not cite any precedent for this offset, the apparent novelty of this approach does not render it unreasonable. As the Commission noted, the costs of this proceeding were \"high for all parties,\" and the issue is \"how those costs can be most equitably allocated.\" Id. at 62,074. In setting prospective rates, the Commission could reasonably conclude that because SFPP had reaped a windfall by charging rates in excess of those ultimately deemed just and reasonable in the same past years for which it was claiming supplemental expenses above those it would prospectively incur as part of its cost of service, it should be required to first fund its litigation expenses out of that pool before it could begin charging those costs to its customers anew. While SFPP contends that this unfairly benefits shippers that sat on their rights by not filing complaints against SFPP's rates, and that Section 16 of the ICA only authorizes reparations for shippers who have filed such challenges, see 49 U.S.C. app. § 16(1) (1988), it presents no justification for being entitled to keep this windfall. The court therefore affirms the Commission's surcharge mechanism and its corresponding offset, subject to the qualification that, depending on what rates ultimately result from this proceeding on remand, the surcharge might require recalculation.\n\nb. Civil Litigation Expenses\n\nSFPP also challenges the Commission's decision to disallow recovery in the East Line rates of significant expenses SFPP incurred in civil litigation defending its reversal of flow on a segment of six-inch pipe running between Phoenix and Tucson. SFPP's flow reversal removed capacity from the East Line in order to allocate it to the West Line. While this benefitted West Line shippers, it would be, as the Commission recognized, inequitable to include these costs in the East Line rates, for \"there appears no reason why ratepayers should bear the expense of defending conduct that had no ex ante prospect of benefitting them.\" See Iroquois Gas, 145 F.3d at 401; see also Mountain States Telephone \u0026 Telegraph Co. v. FCC, 939 F.2d 1035, 1043 (D.C. Cir. 1991) (\" Mountain States I \"). The Commission's recognition that litigation of this sort lacks the requisite nexus to the provision of SFPP's East Line service to justify inclusion in those rates was not unreasonable.\n\nSFPP was embroiled in lengthy litigation in Arizona and Texas state courts with EPR and Navajo, two East Line shippers, regarding SFPP's reversal of flow on the six-inch line, one of SFPP's two pipes running between Phoenix and Tucson. That litigation ultimately cost SFPP, according to its 2002 compliance filing, over $23.7 million. SFPP also has an eight-inch pipe running between the two cities. The sixinch line had been in West Line service from 1989 to 1991. When SFPP undertook an expansion of the eight-inch line (which had been in East Line service) SFPP temporarily assigned the six-inch line to the East Line. Upon completion of the expansion project, SFPP entered an agreement with ARCO, a West Line shipper, to return the six-inch line to West Line service, thus restoring West Line service to Tucson. EPR and Navajo sued to enjoin the reversal, alleging that SFPP had contractually agreed to provide them the extra capacity, that they had engaged in costly investments in reliance on those agreements, and that the line reversal was motivated by a desire to drive the two shippers out of business. As noted, EPR also filed a complaint with the Commission challenging both the flow reversal and SFPP's East Line rates, thereby initiating this rate proceeding. The ALJ dismissed the portion of EPR's complaint dealing with the flow reversal for lack of jurisdiction, noting that because the Commission has no jurisdiction to prevent SFPP from abandoning service on the six-inch line, it also lacks authority to adjudicate allocation disputes as between shippers serving different markets along the line. ALJ Decision, 80 FERC at 65,161-64. No party has sought review of that ruling. The litigation then proceeded in other courts with SFPP ultimately entering into settlements with both shippers.\n\nThe ELS' lawsuit based on SFPP's reallocation of capacity from the East Line to the West Line, and the corresponding litigation costs incurred by SFPP, while caused, in the immediate sense, by ELS, were not costs of East Line service or expenditures benefitting the SFPP system generally. They were costs, if anything, of making capacity available to the West Line at the East Line's expense. SFPP did not seek to recover its costs from West Line shippers, either in the cost of service or by capitalizing them into the rate base, presumably because of the Commission's earlier ruling that the West Line rates were grandfathered under Section 1803 of the EPAct, and therefore not subject to increase in this proceeding. Instead, SFPP sought to recover them from East Line shippers.\n\nThe Commission rejected this attempt, concluding that SFPP's costs in settling these matters \"arose out of litigation unique to the conditions of [EPR and Navajo],\" and, as such, were not costs that related to the provision of East Line service as a whole. Opinion No. 435, 86 FERC at 61,106. On rehearing, the Commission ruled that the costs of litigating these matters were not recoverable, because \"civil litigation of this type\" involving \"assertions of anti-competitive behavior and breach of contract to make capacity available\" does not \"address legal costs and remedies that SFPP would normally incur in the conduct of its common carrier operations.\" Opinion No. 435-A, 91 FERC at 61,513. Therefore, the Commission concluded, SFPP's litigation expenses were \"extraordinary.\" Id. On further rehearing, the Commission reaffirmed its ruling that SFPP could not recover such litigation costs in its rates. Opinion No. 435-B, 96 FERC at 62,070.\n\nUnder the Commission's accounting regulations, extraordinary costs are defined as costs that \"possess a high degree of abnormality and [are] of a type clearly unrelated to, or only incidentally related to the ordinary and typical activities of the entity\" and are \"not reasonably expected to recur in the in the foreseeable future,\" 18 C.F.R. pt. 352, General Instructions, 1-6(a). SFPP's flow reversal was not itself unique, for it had changed the direction of flow on the six-inch line a year before during the expansion of the eight-inch line. Nevertheless, as none of these prior reversals had generated legal disputes of this scope, the Commission could reasonably conclude that this type of civil litigation, \"an action that would not arise in the normal course of the pipeline's operations,\" was not likely to recur. Opinion No. 435-B, 96 FERC at 62,070.\n\nThe remaining question is whether the Commission used the correct standard in determining that these costs were \"clearly unrelated to, or only incidentally related to the ordinary and typical activities of the entity.\" SFPP contends that any reading of this portion of the Commission's regulations must comply with Iroquois Gas, 145 F.3d 398, and Mountain States I, 939 F.2d at 1034, particularly the latter decision's admonition that \"[i]f expenses are properly incurred, they must be allowed as part of the composition of rates. Otherwise, the so-called allowance of a return upon the investment, being an amount over and above the expenses, would be a farce.\" Id. at 1029 (internal citations omitted).\n\nSFPP's position that capacity allocation litigation is an inevitable cost of doing business with two shipper camps competing for the same markets is not without some persuasiveness. The court has generally taken a somewhat broad view of which litigation costs entities regulated under rate-ofreturn ratemaking should be permitted to recover. In Iroquois Gas, the court vacated the Commission's presumptive disallowance of a gas pipeline's litigation costs defending alleged environmental violations during construction, reasoning that the Commission must analyze whether the purported environmental violations were for ratepayers' benefit rather than simply presuming the imprudence of supposedly illegal activity. 145 F.3d at 399-403. Similarly, in Mountain States I, 939 F.2d at 1029-35, the court vacated an FCC order denying a carrier's recovery of antitrust litigation expenses, and, the same term, in Mountain States Telephone and Telegraph Co. v. FCC, 939 F.2d 1035 (D.C. Cir. 1991) (\" Mountain States II \"), remanded a rule presumptively denying recovery of litigation and judgment costs resulting from findings of illegal activity, expressing concern that such a rule might discourage utilities from taking appropriate legal risks that would ultimately benefit their ratepayers. Id. at 1042- 47.\n\nThe Commission stated that it did not consider Iroquois Gas apposite because in that case, the underlying activity --construction of the pipeline pursuant to the Commission's certificate authority -- was something over which the Commission had jurisdiction and whose prudence the Commission could evaluate. Opinion No. 435-B, 96 FERC at 62,070-71. By contrast, the Commission viewed SFPP's underlying business decision to reverse flow on the six-inch line as \"beyond the Commission's remedial authority.\" Proceeding on the premise that it lacks jurisdiction over market entry and exit, the Commission apparently takes the position that it is incapable of evaluating the prudence of legal expenses incurred in the course of either, and therefore cannot include them in common carrier rates.\n\nThe salient criterion under Iroquois Gas and Mountain States II for the recovery of legal expenditures by regulated entities is whether the underlying activity being defended in the litigation serves the interests of ratepayers. See Iroquois Gas, 145 F.3d at 401-02; Mountain States II, 939 F.2d at 1043-47. The court need not address whether the Commission can reasonably deny the recovery of all non-jurisdictional litigation expenses associated with \"both [market] entry and exit by the pipeline,\" Opinion No. 435-B, 96 FERC at 62,070, because the issue in this proceeding is more narrow, and arises only with regard to the inclusion of market exit costs in the East Line rates, not market entry costs in the West Line rates. Whatever might be a common carrier's entitlement to recover any non-jurisdictional litigation costs associated with the initiation of common carrier service, it is not unreasonable for the Commission to refuse to allow a common carrier to charge ratepayers for the cost of taking capacity away from them. The Commission's initial determination that the flowreversal litigation at issue was unrelated to the provision of East Line service was reasonable, and we affirm on that basis. The Commission recognized that, unlike in Iroquois Gas, SFPP's litigation did not \"arise[ ] under regulatory obligations that apply to the system as a whole,\" and noted the \"common sense observation by the East Line shippers that the costs and awards relating to their litigation will be borne primarily by themselves if the litigation and settlement costs are included in the East Line rates.\" Id. at 62,071. As only the East Line rates were at issue, the court understands the Commission's statement, that SFPP's civil legal expenses arising from the reversal dispute are not those \"that SFPP would normally incur in the conduct of its common carrier operations,\" to refer narrowly to SFPP's \"common carrier operations\" on the East Line, and not more broadly to SFPP's \"common carrier operations\" generally. This approach is reasonable, because the cost of canceling service is not a cost of providing it.\n\nc. Allocation of litigation costs\n\nMore problematic is the Commission's decision that the East Line rates should bear half of SFPP's recoverable litigation costs. Opinion No. 435-A, 91 FERC at 61,513. The rate proceeding included both East Line rates and the dispute about whether West Line rates were grandfathered. Some litigation costs may have been exclusive to each line, whereas others were common, but the record does not contain precise information regarding how much of SFPP's legal expenses can be attributed to each portion of the rate litigation. The West Line accounts for roughly twice the throughput of the East Line, and the Commission had initially reasoned that due to the more complex nature of the West Line issues litigated in the regulatory proceeding, costs should be apportioned volumetrically between the lines. Opinion No. 435, 86 FERC at 61,106. On rehearing, the Commission reversed itself and split the costs evenly. Opinion No. 435-A, 91 FERC at 61,512. The Commission stated that the ALJ, who initially presided over the case, was \"in a position to observe complexity and flow\" of the litigation, and could have reasonably concluded that it was the East Line issues, not the West Line issues, that accounted for the \"greater portion\" of costs generated in the proceeding. Id.\n\nThe ELS contend that the Commission departed from its well-established volumetric allocation policy for general costs without a rational basis, and thus was arbitrary and capricious in basing its allocation on which shippers created higher litigation costs. We see nothing problematic in an approach that attributes litigation costs to those for whose benefit the litigation is incurred, and prior Commission cases dealing with legal expenses have allocated them similarly. See, e.g., Southern California Edison Co., 56 FERC ¶ 61,003, 61,021 (1991). A volumetric approach might be appropriate for the recovery of commonly-incurred costs benefitting the entire system, but the Commission's focus here on who \"generate[d] the greater portion of a given litigation,\" Opinion No. 435-A, 91 FERC at 61,513, is reasonable when litigation costs are specific to separately priced services.\n\nThe problem with the Commission's litigation-cost allocation is more basic: it lacks substantive analysis. The court is unable to discern why the Commission decided that 50%, as opposed to 40%, 30%, or any other number, fairly reflects the portion of SFPP's litigation expenses attributable to the East Line. It simply claimed to rely on the ALJ Decision for the 50% figure. See 80 FERC at 65,167. The ALJ Decision, at best, implicitly adopts the allocation suggested by a Staff witness. Other than describing the Staff's proposal as being developed as a representative amount of litigation expenses for inclusion in the test year cost of service, the ALJ Decision provides no analysis of why such a distribution is warranted. Hence, the Commission's reliance on the ALJ as being in the best position to observe the \"complexity and flow\" of the litigation leaves unexplained the basis for the allocation. While most of SFPP's litigation cost recovery has been offset by unpaid reparations, and the difference in rates resulting from the allocation may ultimately not be significant, the Commission must still explain its decision. The 50% allocation may or may not be a fair reflection of SFPP's rate litigation costs that were in fact attributable to the East Line. Accordingly, we remand for the Commission to explain its rationale for its allocation, either based on a 50-50 sharing between the East and West Lines or any other allocation it determines would be appropriate.\n\n3. Reconditioning Costs\n\nSFPP sought to have included in its East Line rates a projected annual cost of $3 million for a 15-year pipeline reconditioning program replacing the protective coating on parts of the East Line. Before the Commission, SFPP claimed to have spent upwards of $5.9 million of these reconditioning costs between 1995 and 1998. While acknowledging SFPP's expenditures on the project, the Commission refused to incorporate those costs, most of which were not incurred until after 1995, into SFPP's cost of service because they were too uncertain at the end of the test period in 1994. Opinion No. 435, 86 FERC at 61,106-08. On rehearing, the Commission permitted SFPP to recover its actual expenses from shippers as part of the temporary surcharge it created for SFPP's rate litigation and environmental expenses. Opinion No. 435-A, 91 FERC at 61,518-19. On further rehearing, however, the Commission reversed itself again and denied SFPP all recovery of its refurbishing costs. Opinion No. 435- B, 96 FERC at 62,078-79.\n\nUnder its cost of service regulations, the Commission uses a \"test year\" methodology to determine a pipeline's annual cost of service. This approach looks to the actual costs the carrier incurs in the \"test year\" and then adjusts for any \"known and measurable with reasonably accuracy\" costs that \"will become effective within nine months after the last month of the available actual experience utilized in the filing.\" 18 C.F.R. § 346.2(a)(1)(ii) (2004). The test year methodology accounts for the somewhat counterintuitive quality of these proceedings. The Commission, in issuing decisions after 1999 setting SFPP's cost of service for years after 1994, looked not to SFPP's actual costs in those years but rather to what one could have predicted those costs to be, based on what was known in 1994. The Commission noted in Opinion No. 435 that it considers the test year a \"relatively rigid concept simply because there must be some point at which the record closes and there is a known, factual basis for the conclusions.\" 86 FERC at 61,108. Although this statement appears to mark a change from Commission policy in cases preceding the implementation of its cost of service regulations, where it indicated that it would approach test years more flexibly, see, e.g., Lakehead, 71 FERC at 62,313; Williams Pipe Line Co., 21 FERC at 61,658, the Commission's current cost of service regulations provide that it \"may allow reasonable deviation from the test period\" for \"good cause shown.\" 18 C.F.R. § 346.2(a)(1)(ii).\n\nThe ALJ, using 1993 as the base year, decided that the refurbishing costs could not be recovered as part of SFPP's cost of service because the costs had not yet been incurred at that time, and SFPP's predictions of future costs were too uncertain. Finding that SFPP's board had not committed to the refurbishing program as late as 1995 and was simply funding the program year-by-year rather than committing itself to the entire proposed 15-year program, the ALJ reached a series of conclusions: that SFPP might decide to abandon the project or scale it back in the future, that the overall plan was subject to change, that there was little documentation to support estimates of the costs, and that it was uncertain whether significant amounts of the pipeline scheduled for refurbishing might be so corroded as to require outright replacement, which would be treated as a capital investment and factored into the rate base, not as an expense added to cost of service. In Opinion No. 435, the Commission essentially affirmed the ALJ's decision. 86 FERC at 61,106- 08.\n\nSFPP contends that the Commission, which used a 1994 base period and the nine-month test period in 1995, could not reasonably affirm the ALJ's decision, which was based on data from an earlier period. There is some record evidence supporting SFPP's claim that it had more firmly committed to the reconditioning project, including beginning refurbishment of several miles of pipeline in 1995, within \"nine months after the last month\" of 1994. Cf. 18 C.F.R. § 346.2(a)(1)(ii). There was testimony that SFPP's board had approved the project by 1994, that SFPP had recoated 13 miles of the pipeline in 1995, and that its prospective cost estimates were based upon its actual costs thus far.\n\nNonetheless, it was not unreasonable of the Commission to continue to have doubts about locking so large an expense into SFPP's cost of service (or, to put it more aptly given the test year methodology used here, it was not unreasonable for the Commission to have thought that doubts about the scope of the reconditioning project would still have been proper in 1995). At most the evidence before the Commission showed that, by 1995, SFPP had begun refurbishing certain portions of its pipeline; there was no guarantee from SFPP that the refurbishing would be as ambitious and expensive as claimed. Embedding SFPP's projections into its cost of service would have required its customers to pay for the refurbishing even if the project ultimately resulted in far smaller expenditures than those SFPP had projected. Indeed, given that SFPP now claims to have spent roughly $6 million on the project over four years, when it had predicted costs of at least $3 million a year over fifteen years, the Commission's judgment has been validated by hindsight.\n\nThis does not end our inquiry, however, for SFPP also contends that having denied inclusion of reconditioning costs in SFPP's cost of service, it was arbitrary for the Commission not to permit recovery in a surcharge of SFPP's actual costs in 1995-98, which were not found to be imprudently incurred. The Commission's legitimate doubts over the ultimate scope and cost of the reconditioning do not explain the basis for the Commission's decision to deny recovery once actual costs of the project were known. Its decision, rather, stems from a combination of the Commission's test year approach and its interpretation of the filed rate doctrine. In Opinion No. 435- A, the Commission permitted SFPP to recover its actual reconditioning costs as part of the same surcharge whereby it permitted recovery of SFPP's regulatory litigation costs, similarly offset by any unpaid reparations; any cost not so offset could be included in a surcharge amortized over five years. Yet in Opinion No. 435-B, presented with SFPP's claim that it had expended $5.9 million in actual East Line refurbishing costs between 1995 and 1998, the Commission denied recovery altogether because the expenditures \"were not incurred in the 1994 cost of service test period.\" 96 FERC at 62,078. In responding to protests that its Opinion No. 435-A ruling violated the filed rate doctrine, the Commission concluded \"[u]pon further review\" that allowing a surcharge for costs not incurred in the test period or with any regularity thereafter \"would permit SFPP to recover costs after the fact which were not even present in the test year itself and which thereafter could not be recovered in a cost of service rate filing,\" and that \"[t]o do so after the fact raises serious questions under the filed rate doctrine.\" Opinion No. 435-B, 96 FERC at 62,078.\n\nThe difficulty for the court stems from three sources: the Commission's apparent failure in its test year approach to articulate a clear and consistent approach for dealing with the prudently incurred costs of providing pipeline service that do not regularly recur, the Commission's failure to explain adequately why SFPP's reconditioning costs would not be recoverable in a cost of service rate filing, and its failure to articulate why such a surcharge would violate the filed rate doctrine. Some prudent expenditures involved in the operation of a pipeline that are not capitalized, such as, for instance, rate litigation or refurbishing, are bound to be one-time or infrequent expenditures. A \"test year\" snapshot of a pipeline's operating costs, therefore, if applied too simplistically, risks over- or under-stating the \"real\" costs of providing pipeline service, depending on whether such costs happen, by chance, to fall in a test year or not. We do not understand the Commission to apply the test year concept so simplistically; its regulations deal with the possible overstating problem by disallowing nonrecurring costs as part of the cost of service, see 18 C.F.R. § 346.2(a)(1)(I), and both under- and over-stating problems by permitting deviation from the test year \"for good cause shown,\" id. § 346.2(a)(1)(ii). Yet the Commission's approach in the instant case does not appear to deal consistently with costs incurred outside the test year, as evidenced by its different treatment of SFPP's rate litigation and reconditioning costs between 1995 and 1998. Both appear to be prudent, otherwise recoverable costs; both are nonrecurring (in the sense that they will not be permanent expenditures SFPP can be expected to incur each year); both were incurred chiefly outside the 1994 test year; and the Commission initially held that both past expenses could be recovered in prospective rates through a temporary surcharge because of \"benefits that flowed to the system when the costs were incurred.\" Opinion No. 435-A, 91 FERC at 61,518.\n\nThe Commission then reversed course in Opinion No. 435- B and disallowed recovery of the reconditioning costs only. Its reasoning for disallowing one surcharge but permitting the other was that \"unlike the [Commission] regulatory costs, none of [SFPP's reconditioning costs] were incurred in the test period.\" 96 FERC at 62,078. The rate litigation surcharge included SFPP's actual costs after 1994. So the Commission's ruling suggests that it matters, to recovery of costs incurred outside of the test year, whether a carrier also incurred costs of the same general nature in the test year itself. The logic behind this distinction, as applied to costs that benefit the carrier's system but are not expected to regularly recur, is neither explained in Opinion No. 435-B itself, nor is it obvious. Should the Commission wish to rely on this reasoning on remand, it must articulate and justify more carefully what its policy on the recoverability of nontest-year expenses is.\n\nThe Commission did explain that SFPP's rates were indexed to account for cost increases after the test year, and that SFPP could not meet the \"substantial divergence\" standard for showing that indexing failed to account for increases in its cost of service due to reconditioning expenses after 1994. Cf. 18 C.F.R. § 342.4(a) (2004). Assuming that the Commission can explain its different treatment of rate litigation and reconditioning costs incurred in years after the 1994 test year, this may be a reasonable basis for denying recovery, but the Commission's opinion provides no analysis for why it is true. Where the Commission had found SFPP's cost of service to be roughly $14 million a year, SFPP was claiming reconditioning costs of roughly $1 million a year, a not insubstantial amount. The Commission provided no estimate or analysis of how any supplemental revenues to SFPP resulting from rate indexing, or from increased throughput in years after 1994, compare to those expenses.\n\nThe Commission also stated that permitting recovery of the refurbishing costs \"after the fact\" would \"raise serious questions under the filed rate doctrine.\" Opinion No. 435-B, 96 FERC at 62,078. The filed rate doctrine \"forbids a regulated entity to charge rates for its services other than those properly filed with the appropriate federal regulatory authority.\" Arkansas Louisiana Gas Co. v. Hall, 453 U.S. 571, 577 (1981). The Commission did not articulate what type of \"serious questions\" it thought such recovery would raise. Because a prospective surcharge would presumably be on file with the Commission, the court presumes that the Commission meant that an amortized surcharge, by prospectively recovering SFPP's expenses from past years, would violate the related rule against retroactive ratemaking, which requires that \"a utility may not set rates to recoup past losses, nor may the Commission prescribe rates on that principle.\" Southern California Edison Co. v. FERC, 805 F.2d 1068, 1070 n.2 (D.C. Cir. 1986) (quoting Nader v. FCC, 520 F.2d 182, 202 (D.C. Cir. 1975)).\n\nThis logic, again, raises the question of why such recovery is any more permissible for rate litigation expenses than it is for reconditioning costs. The Commission seems to place SFPP in a Catch-22: it cannot recover its reconditioning costs prospectively or contemporaneously because the cost of the project is too uncertain until the costs are incurred, but then once the costs are certain it is too late because recovery would involve retroactive charges. Absent a better explanation for the Commission's conclusion that SFPP has recovered its reconditioning costs through the indexed rates, it is unclear how the costs of any multi-year project whose cost is not \"known and measurable with reasonable certainty\" in advance, 18 C.F.R. § 346.2(a)(1)(ii), could ever be recovered, were this reasoning to be consistently adopted. The Commission ruled in Opinion No. 435-A that prospective recovery of SFPP's reconditioning costs would be appropriate because of \"benefits that flowed to the system when the costs were incurred,\" 91 FERC at 61,518, implying that it initially did not view the rule against retroactive rulemaking as an obstacle because the expenses provided an ongoing benefit that would continue to accrue in future years. In light of the Commission's failure to explain why it now considers the rule against retroactive rulemaking (or the filed rate doctrine) to bar recovery, and because no party has briefed this question in any detail, the court remands so that the Commission, if it wishes to continue relying on this reasoning, may better explain it.\n\nThe Commission may have answers to these concerns, but they are not provided in the Opinions on review. SFPP's shippers are presently enjoying the benefits of what appears to be an expensive pipeline reconditioning program without sharing in any of its costs. If, in the Commission's opinion, they should not have to, the Commission needs to provide a more thorough explanation of why not. Accordingly, we remand SFPP's request to recover its reconditioning costs for the East Line between 1995 and 1998 to the Commission for further consideration.\n\nIII. Reparations\n\nA. Background and Proceedings Below\n\nAfter determining that SFPP's East Line rates were not just and reasonable, the ALJ ordered SFPP to pay reparations to the ELS which had filed complaints against the rates. ALJ Decision, 80 FERC at 61,308. In Opinion No. 435, the Commission considered various objections to the reparations on the part of both SFPP and the shippers but reaffirmed that SFPP was to pay reparations as determined by the Commission. See id. at 61,111 - 14. Specifically, the Commission ruled that the period for the calculation of reparations would run from the date of each complaint until March 31, 1999, the effective date of revised East Line rates required by Opinion No. 435.\n\nIn calculating the potential reparations, the Commission retroactively applied the test year approach it had used to set SFPP's prospective rates: SFPP was to develop an East Line cost of service for a test year, 1994; design a rate that reflected that cost of service; index that rate to December 31, 1998; and apply that indexed rate to designated volumes adopted by Opinion No. 435 for each calendar year for which an indexed rate had been developed. Using the new cost of service thus established for years 1994-1998 and partial year 1999, SFPP was to determine whether the revenues for each period resulted in an over or under-recovery of its cost of service. FERC's order permitted SFPP to \"net out its over and under recoveries for each year and determine that net amount, if any, that is due its East Line Shippers.\" Id. at 61,114. FERC ordered a similar calculation of reparations for years prior to 1994 based on the calculation of under- or over-recovery of cost of service in those years. As to reparations in general, FERC held that no shipper was entitled to reparations for periods prior to the filing date of a complaint. Id. at 61,112-13.\n\nOn rehearing, FERC held that Navajo was the only complainant that had filed a challenge to East Line rates. Thus, only Navajo could recover reparations. Opinion No. 435-A, 91 FERC at 61,514. FERC granted Navajo reparations beginning one month prior to the filing of its December 23, 1993, complaint to SFPP's rates. FERC also noted that Navajo had entered a settlement with SFPP in 1989. That settlement barred Navajo from bringing action against SFPP until November 23, 1993. With those provisos, FERC ordered SFPP to calculate the limited reparations still in order on the East Line based on the difference between per-barrel rates charged and per-barrel rates that would have been charged had SFPP charged cost-based rates using a 1994 test year, and to index such rates annually going forward -- in other words, the difference between the charged rates and the rates that SFPP should have charged. In sum, the Commission modified its prior order and decreed that:\n\nSFPP will calculate the gross reparations that would be due if all shippers that had used the East Line had filed complaints for the applicable reparations period ... establish[ing] the total revenue that was received in excess of the new East Line rates established by the prior order. Navajo will be paid its pro rata share of the reparations for the relevant time frame.\n\nId. at 61,518. The Commission noted that because Navajo was the only shipper entitled to reparations, the calculations \"should leave a surplus of revenues in excess of the East Line restated cost of service between the beginning of the reparations period and the actual date on which the restated rates began to be collected by SFPP.\" Id.\n\nThe shippers petitioned for rehearing of FERC's reconsideration order, which FERC granted in part. This time, FERC held that Chevron, Western, ConocoPhillips, and ExxonMobil were, like Navajo, entitled to reparations for overcharges that occurred two years prior to the filing of their complaints. Opinion No. 435-B, 96 FERC at 62,071-74. FERC held that Valero was not entitled to reparations, because its complaint was filed after August 7, 1995, the last date complaints were consolidated in the proceedings. Id. at 62,072. The Commission subsequently clarified Opinion No. 435-B by stating that Chevron's eligibility for reparations was determined as of its August 3, 1993 complaint, not a protest it filed September 23, 1992. Clarification and Rehearing Order, 97 FERC ¶ 61,138.\n\nSFPP now argues that the Commission ought not have awarded any reparations whatsoever. Navajo contends that it was improperly denied reparations prior to November 23, 1993. Chevron alleges that FERC improperly set the commencement date for calculating its reparations. And Valero, BP WCP, and Chevron all claim that they were improperly denied reparations.\n\nB. Analysis\n\n1. SFPP\n\nSFPP argues that the underlying orders were arbitrary and capricious for four related reasons. First, SFPP contends that awarding ELS reparations is impermissible retroactive ratemaking, in violation of the Supreme Court's decision in Arizona Grocery Co. v. Atchison, Topeka \u0026 Santa Fe Railway Co., 284 U.S. 370 (1932). Second, it asserts that FERC's award of pre-complaint reparations violates the EPAct. Third, SFPP advances that FERC improperly awarded reparations based on a \"test period,\" disregarding damages actually suffered and proved by complainants. Finally, SFPP argues that FERC failed to consider substantial arguments -- such as the novelty and complexity of SFPP's rate case -- that militated against awarding reparations. For the reasons stated below, we reject all four claims.\n\na. The Arizona Grocery Rule\n\nArizona Grocery proscribes \"the retroactive revision of established rates through ex post reparations.\" Verizon Tel. Cos. v. FCC, 269 F.3d 1098, 1107 (D.C. Cir. 2001); see also Ala. Power Co. v. ICC, 852 F.2d 1361, 1373 (D.C. Cir. 1988). Otherwise put, Arizona Grocery bars reparations that retroactively change a final Commission-approved rate. SFPP relies on Arizona Grocery to argue that Opinion No. 435 was a final order prescribing just and reasonable rates, and thus FERC was barred from awarding reparations when SFPP's rate was effectively further lowered as a result of FERC's subsequent orders. SFPP argues that Opinion No. 435 was a final order setting rates \"to be thereafter observed\" under ICA Section 15(1), and therefore that the subsequent orders were retroactive changes of Opinion No. 435. We disagree.\n\nArizona Grocery is of no help to SFPP in this case. Arizona Grocery applies only where the Commission has \"declared what is the maximum reasonable rate to be charged by a carrier.\" 284 U.S. at 390. Yet FERC did not finalize a maximum reasonable rate in Opinion No. 435 and in fact repeatedly stated it was not doing so. Thus Opinion No. 435 set no final rate; rather, FERC only established a final rate at the completion of the OR92-8 proceedings. SFPP, L.P., 100 FERC ¶ 61,353, 62,625 (2002) (\"September 26 Order\"). The OR92-8 proceedings were compliance filings. SFPP's filing in Docket No. OR92-8-013 showed SFPP's calculations for determining how its East Line rates should be structured to reflect the requirements of Opinion No. 435-B. SFPP later amended that in Docket No. OR92-8-015 to address the exclusion of the interest element from the calculation of the total potential reparation pool that would be due under the Commission's prior orders. Id. at 62,622.\n\nThe record shows that at each point, the Commission said that final East Line rates would not be established until the OR92-8 proceedings were completed. September 26 Order, 100 FERC at 62,625. In response to Opinion No. 435, SFPP filed a tariff establishing a rate, but the Commission concluded that the tariff could not be determined to be just and reasonable until review of the Docket No. OR92-8 compliance filing was completed. The Commission accepted the tariff for filing and suspended it, subject to refund, pending review of the compliance filing. SFPP, L.P., 87 FERC ¶ 61,056, 61,225- 26 (1999). Nor did FERC's next opinion on the subject make that rate final. Opinion No. 435-A merely reaffirmed the suspension of the previously filed tariff based on the significant chance that the proposed rate levels in it would change depending on how the protests and related requests for rehearing were resolved. 91 FERC at 61,520. It did not finalize the rate.\n\nFERC's subsequent orders concerning SFPP's proposed rates were similarly non-final. FERC accepted for filing SFPP's Tariff No. 60, filed to comply with Opinion No. 435-A, with a proposed effective date of August 1, 2000, but suspended it subject to refund. SFPP, L.P., 92 FERC ¶ 61,166, 61,563-64 (2000). Opinion No. 435-B approved the August 1, 2000, effective date because that was the date the Commission accepted SFPP's compliance filing, and directed a further compliance filing, also to be effective August 1, 2000. 96 FERC at 62,071, 62,079. SFPP filed Tariff No. 67 (later corrected in Tariff No. 68), with a proposed effective date of December 1, 2001. SFPP, L.P., 98 FERC ¶ 61,177, 61,657 (2002). The Director of the Division of Tariffs and Rates Central rejected the tariffs because Opinion No. 435-B required an effective date of August 1, 2000. Id. FERC's order memorializing the rejection made clear that FERC's previous orders suspended, subject to refund, SFPP's proposed tariffs pending resolution of the numerous compliance issues that have been raised in the course of these proceedings. In each of the prior Opinions the Commission has made clear that SFPP must recalculate the rates to be applied in compliance with those Opinions and that any prior calculations of reparations and surcharges must be adjusted accordingly.\n\nId.\n\nThe Commission has thus been clear from the outset and throughout that no final rate determination would be made until the OR92-8 proceedings were complete. September 26 Order, 100 FERC at 62,625. As a result, the Commission's orders requiring reparations do not violate the prohibition in Arizona Grocery from subjecting a carrier to payment of reparations with respect to a final rate. The Commission did not establish final lawful rates where it has expressly reserved authority to make adjustments in the context of an ongoing proceeding in which the methodology for determining the rate had not even been established. Id. at 62,626.\n\nSFPP contends that the Commission's reparations orders violate ICA Section 15(7), which authorizes refunds of \"such increased rates or charges\" as \"shall be found not justified.\" 49 U.S.C. app. § 15(7) (1988). But Section 15(7) is an authorization, not a prohibition, and FERC did not invoke this provision in awarding the shippers reparations. The Commission found it inappropriate for this complaint proceeding to go forward under Section 15(7), SFPP, L.P., 63 FERC ¶ 61,014, 61,124 (1993), and thus no relief was awarded under that section. Rather, FERC proceeded under ICA §§ 8, 9, and 16(1), which specifically authorize the Commission to award damages in a Section 13 complaint. 49 U.S.C. app. §§ 8, 9 \u0026 16(1) (1988). SFPP also contends that FERC lacks authority to issue \"interim\" rates after ruling on a complaint. Yet nothing in Section 15(1) prohibits FERC from directing a pipeline to file an interim rate, subject to suspension and refund, if there is a possibility that the final rates will be lower than the interim rates. Indeed, the Supreme Court has held that under the ICA the Commission has authority -- in response to an initial rate filing -- to direct an oil pipeline to file interim rates to go into effect, subject to refund, during the suspension period for the initial rates. Trans Alaska Pipeline Rate Cases, 436 U.S. 631, 654-56 (1978). See also FPC v. Tenn. Gas Transmission Co., 371 U.S. 146, 146-57 (1962); FPC v. Natural Gas Pipeline Co., 315 U.S. 575, 585 (1942).\n\nTherefore, we hold that when the Commission awarded reparations, it was not constrained by Arizona Grocery 's blanket prohibition on retroactive repeals of ratemaking.\n\nb. Pre-Complaint Reparations\n\nSFPP's second contention is that the EPAct precludes precomplaint reparations in a Section 13 proceeding, and that each complainant may seek reparations only for overcharges that date from the filing of its own complaint. We disagree. EPAct Section 1803(b) provides:\n\nIf the Commission determines pursuant to a proceeding instituted as a result of a complaint under section 13 of the Interstate Commerce Act that the rate is not just and reasonable, the rate shall not be deemed to be just and reasonable. Any tariff reduction or refunds that may result as an outcome of such a complaint shall be prospective from the date of the filing of the complaint.\n\nEPAct § 1803(b). The ICA, however, allows reparations for up to two years prior to the date of the filing of a complaint if the rates paid in those two years exceed the just and reasonable rate established in the complaint proceeding. See 49 U.S.C. app. § 16(3)(b) (1988).\n\nSFPP contends that the last clause of Section 1803(b) is applicable to any and all complaints filed under ICA Section 13, and therefore that reparations awarded for all complaints -- including those for East Line rates -- must be prospective from the filing of the complaints. We agree with SFPP that EPAct Section 1803(b) prohibits retroactive ratemaking, but we think that it does so only for those rates that were \"grandfathered\" under this section. Section 1803(b) does not apply to complaints challenging non-grandfathered rates. In its prefatory clause, it explicitly refers only to \"a complaint ... against a rate deemed just and reasonable under [Section 1803(a)].\" The second-to-last sentence of Section 1803(b) expressly relates only to complaints on which FERC acts to determine grandfathered rates, otherwise \"deemed to be just and reasonable,\" to be just and reasonable. The reference to \"such a complaint\" in the last sentence of Section 1803(b) plainly refers back to the prior references in Section 1803(b) to complaints against rates \"deemed to be just and reasonable\" under Section 1803(a).\n\nBecause the East Line rates were challenged within the one-year period prior to enactment of the EPAct, they are not grandfathered under Section 1803. Accordingly, relief for East Line rate complainants is governed by \"the traditional standards of the ICA, including section 16's provision for a two year reparations period retroactive from the date of the complaint.\" SFPP, L.P., 68 FERC ¶ 61,306, 61,582 (1994).\n\nFERC's order tracked this interpretation of the statute precisely. FERC found that shippers filing a complaint against SFPP's East Line rates may recover reparations for the two-year period prior to the date of their complaints. The Commission determined that the EPAct barred precomplaint relief only for complaints against grandfathered rates. Thus, FERC correctly found that Section 1803(b) does not apply to complaints challenging the East Line rates that FERC held not to be grandfathered.\n\nc. Test Period\n\nNext, SFPP challenges the methodology FERC ordered SFPP to use to calculate reparations. In Opinion No. 435-A, FERC ordered SFPP to use the following method. First, FERC said, SFPP must determine what the just and reasonable rate would have been in each year between 1994 and August 1, 2000 -- as well as two years back from the date of the earliest complaint -- and then calculate what the appropriate gross revenues would have been from that rate. The difference between the gross revenue under the new just and reasonable rates would create the total reparations pool --the amount SFPP would pay to all eligible shippers. SFPP would then calculate the reparations due each eligible shipper (including interest), leaving a residual in the pool of funds that could not be distributed because certain shippers had not filed a complaint within the time frame of the proceeding. The residual pool would then be credited against the total supplemental costs permitted under Opinion No. 435-A between 1995 and 1998. Any remaining allowable costs would then be recovered through a five-year surcharge.\n\nTo estimate what gross revenues would have been in those years, the Commission directed that SFPP use a test year cost of service, divided by the test year's volumes, to replace the previous unit rate not found to be just and reasonable. Opinion No. 435-A, 91 FERC at 61,516. The reparations payment due for each year would be the difference between the revenues generated in that year under the old rates and the revenues that would have been generated under the final new rates. Id.\n\nSFPP challenges the estimation methodology proposed by FERC -- specifically FERC's direction to use a \"test period\" to estimate past gross revenues. SFPP contends that basing the reparations calculations on a rate derived from a historical test period \"makes no sense in the real world, as it wrongly assumes SFPP's actual cost of service did not change appreciably over a period of eight years or more.\" We once again disagree.\n\nThe use of test periods to set the cost of service for rates intended to span a number of years is well established. See, e.g., Williston Basin Interstate Pipeline Co. v. FERC, 165 F.3d 54, 56 (D.C. Cir. 1999). As we have noted, it is ordinarily impossible for a pipeline to know at the time of filing what its actual costs will be during the effective period of the filed rates, and so the use of a \"test period\" for calculating the cost of service is appropriate. Id. While use of a test period is not perfect, it is a reasonable proxy for actual costs. See generally American Public Power Ass'n v. FPC, 522 F.2d 142 (D.C. Cir. 1975); see also Public Serv. Co. v. FERC, 832 F.2d 1201, 1218 (10th Cir. 1987). It was therefore reasonable for the Commission to base reparations calculations on the same test period methodology it uses to calculate prospective rates. To the extent SFPP contends that the Commission's reliance on the test year approach unreasonably denied it recovery of certain expenses it incurred after the test period, those concerns are addressed in Part II of our opinion.\n\nThe Commission also properly determined that rates based on the test period could be used to calculate reparations for the two years prior to the filing of the complaints. See ALJ Decision, 80 FERC at 65,203. There is no basis to conclude that test period rates that are just and reasonable for all future years do not provide a just and reasonable basis for determining reparations in the two years prior to the complaints. Id.\n\nSFPP further contends that it should have been allowed to offset under-recovery of its cost of service in some years with over-recovery of its cost of service in other years, based on ICC decisions permitting netting of multi-year data in determining reparations. As explained, however, the Commission reasonably found that consideration of the costs from every year was not feasible. While the Surface Transportation Board (formerly ICC) determines the total revenue stream required to recover the costs of particular service over its economic life, FERC has reasonably decided to calculate reparations by the difference in the unit value of the old and new rate, not the difference in gross and net revenues for the operation of the pipeline as a whole. ALJ Decision, 80 FERC at 65,203. Accordingly, the Commission reasonably found the netting of reparations across the entire reparations period inappropriate in these circumstances.\n\nMoreover, this Court has previously rejected pipeline demands to permit offsetting undercharges and overcharges in different years during a refund period. As we held in Belco Petroleum Corp. v. FERC, 589 F.2d 680, 686-87 (D.C. Cir. 1978), the NGA -- like the ICA here -- gives the regulated entity no right to collect more than the just and reasonable rate in one period simply because it collected less than the just and reasonable rate in another.\n\nSFPP cites a number of cases for the proposition that the concept of netting multi-year data to assure fairness in reparations is well established, but here a multi-year rate method was not employed. It is thus reasonable to base reparations on a year-to-year basis without netting.\n\nd. Reasoned Decisionmaking\n\nSFPP's fourth contention is that the Commission abused its discretion by failing to consider SFPP's arguments. Although SFPP acknowledges FERC's discretion to award reparations, it points out that it argued that SFPP's rate case was complex and presented issues of first impression, and that SFPP could not have predicted what lawful rates would have been. In sum, it argued before the Commission that it could not have reasonably adjusted its rates. SFPP claims that by giving no consideration to these arguments, FERC failed to engage in reasoned decisionmaking. We reject this contention.\n\nFERC's orders reasonably addressed SFPP's concerns. Although FERC never explicitly responded to SFPP's point that its case was complex, it implicitly did so by finding SFPP's rates unjust and unreasonable. The fact that SFPP's rate case was complex does not alter the Commission's obligation to make a decision as to whether SFPP's rates were unjust and unreasonable. The Commission reasonably responded to SFPP's argument by simply performing its statutory duty to pass on the reasonableness of SFPP's rates, rather than dwelling on the difficulty of the task at hand. Assuming FERC's decision to find the rates just and reasonable was reasoned, it does not become unreasoned simply because FERC reached its decision without explicitly commenting on its difficulty. In any event, it is apparent from the length and complexity of FERC's discussion that it understood the complexity of SFPP's case.\n\nAs for SFPP's argument that it could not have predicted the eventual rates, the Commission expressly responded to that reliance argument by stating that SFPP was on notice that its rates were subject to review, and that \"there was a risk that the rates could be found unjust and unreasonable and reparations awarded.\" Opinion No. 435, 86 FERC at 61,113.\n\nAccordingly, the Commission engaged in reasoned decisionmaking in awarding reparations. Although certain matters were complex issues of first impression, FERC did not need to acknowledge that complexity explicitly for its decision to stand.\n\n2. Navajo\n\nTurning next to the shipper petitioners, Navajo contends that it should be awarded reparations for the two years preceding the filing of its complaint on December 22, 1993. As noted above, the Commission concluded that a prior settlement agreement between SFPP's predecessor and Navajo foreclosed Navajo from collecting reparations for this two-year period. We find no error in FERC's decision.\n\nThe settlement Navajo entered into with SFPP's predecessor, provided -- in Section 2.3 -- that:\n\nFor the five (5) year period following the effective date of FERC Tariff No. 88 -- i.e., November 23, 1988 --Navajo shall not challenge, by complaint or any other means, East Line rates established or increased in conformity with the terms and conditions of this Article, nor shall they seek reparations or other damages with respect to such rates. Southern Pac. Pipe Lines, Inc., No. IS85-15-000, Stipulation and Settlement Agreement § 2.3 (Jan. 30, 1989) (approved in Southern Pac. Pipe Lines Partnership, L.P., 49 FERC ¶ 61,-081 (1989)).\n\nNavajo contends that this language permits it to seek reparations for the two years prior to filing its complaint, even though those two years are within the five-year settlement rate moratorium. In Navajo's view, this reading is compelled by the contrast between Section 2.3 and Section 1.3 of the 1989 settlement concerning West Line rates. Section 1.3 provides as follows:\n\nDuring the (5) year period following November 23, 1988 (the effective date of FERC Tariff No. 88), Navajo shall not challenge, by complaint or any other means, West Line rates established or increased in conformity with the terms and conditions of this Article, nor shall they seek reparations or other damages with respect to such rates for any part of that five (5) year period.\n\nId. § 1.3.\n\nAccording to Navajo, the last sentence \"made clear that Navajo not only agreed to refrain from filing a complaint seeking reparations during the five-year period following November 23, 1988, but also agreed to waive its rights to reparations relating to that five-year period.\" In contrast, Navajo argues, \"the provision pertaining to the East Line did not waive the right to seek reparations for rates paid for service on the East Line during the five-year period once the moratorium expired.\"\n\nThe ALJ disagreed with Navajo, concluding that a \"fair reading of the settlement agreement and the Commission's order approving it precludes claims for reparation by Navajo for rates charged during the period when the settlement was in effect.\" ALJ Decision, 80 FERC at 65,207-08. The Commission affirmed the ALJ's interpretation as \"the only reasonable interpretation\" of the settlement agreement. Opinion No. 435, 86 FERC at 61,111.\n\nWe find the Commission's interpretation of the settlement to be reasonable. Section 2.3 expressly provides that Navajo shall not \"seek reparations or other damages\" with respect to the East Line rates for the five-year period following November 23, 1988. Southern Pac. Pipe Lines, Inc., No. IS85-15- 000, Stipulation and Settlement Agreement § 2.3 (Jan. 30, 1989). While an additional phrase does appear in Section 1.3, this does not alter the plain meaning of Section 2.3. It is unreasonable to assume that, although obtaining agreement to language expressly referring to a five-year moratorium period for all rate changes, SFPP nevertheless intended to permit Navajo to seek reparations for two of the five years.\n\nNavajo advances a number of theories as to why SFPP might have agreed to a shorter moratorium on East Line reparations. However, there is no evidence that these theories played any part in the negotiations and none of them address the fundamental point that the settlement expressly says five years. The Commission's interpretation of the contract as such is therefore reasonable.\n\n3. Valero\n\nValero, another shipper, contends that FERC erred by denying it reparations in Opinion No. 435-B. Valero argues that because FERC found that SFPP charged it unjust and unreasonable rates in Opinion No. 435-A, FERC had an obligation to award reparations to it as well. FERC responds that because Valero was not a party to OR92-8, the Commission properly rejected Valero's claim that it is entitled to reparations \"in the same manner\" as the shippers in OR92-8. Valero may be correct that it is entitled to reparations, but we agree with FERC that it is not so entitled in this particular proceeding.\n\nValero's complaint involves distinct issues from the complaints at issue in this case, and accordingly FERC reasonably denied it recovery in these proceedings. This case concerns shippers who filed their claims prior to August 1995. The timing of their complaint matters, because FERC determined that they were entitled to reparations only for overcharges during the two years preceding the filing of their complaints. In contrast, Valero -- then Ultramar Diamond Shamrock -- filed its complaint in November 1997. ARCO Products Co., 82 FERC ¶ 61,043, 61,183 (1998). That complaint was docketed as OR98-2, separate from the docket at issue here, OR92-8, consolidated with other complaints filed after August 7, 1995, and all held in abeyance with an opportunity to amend the complaints based on the findings in this proceeding. The post-August 7, 1995 complaints were consolidated in a proceeding separate from OR92-8 because those complaints involve different test periods and cost factors from those addressed in OR92-8. Because Valero filed its complaint in 1997 -- and because, as FERC points out, Valero's reparations will be determined based upon a different test period and cost factors, and will be limited to the two years prior to the filing of Valero's complaint -- it may well not be entitled to the same reparations as shippers who filed in 1994. Accordingly, Valero must have its reparations claims adjudicated in the OR98-2 proceedings.\n\nValero's arguments do not convince us otherwise. Valero alleges that FERC's failure to provide reparations to Valero is directly contrary to the plain language and intent of the ICA. Under Section 8 of the ICA, injured shippers are provided a right of action for damages. See 49 U.S.C. app. § 8 (1988). But FERC's denial of reparations in Opinion No. 435-B is perfectly consistent with this provision. FERC did not hold in that order that Valero was not entitled to reparations. Rather, FERC deferred consideration of Valero's entitlement. Accordingly, FERC's decision is consistent with the ICA.\n\nValero argues that under A.J. Phillips Co. v. Grand Trunk Western Ry. Co., 236 U.S. 662, 665 (1915), its party status in OR92-8 \"is of no moment in awarding reparations.\" Pet. Joint Brief on Rate and Reparations Issues 28. While A.J. Phillips held that finding a rate unreasonable \"inured to the benefit of every person that had been obliged to pay the unjust rate,\" A.J. Phillips, 236 U.S. at 665, it also recognized that a shipper's right to reparations turns on the timely filing of its complaint, and its rights are limited by that complaint. Id. at 665-66 (\"But while every person who had paid the rate could take advantage of the finding that the advance was unreasonable, he was obliged to assert his claim within the time fixed by law\"). Here, Valero -- which filed its complaint in 1997 -- is not entitled to the same reparations as the shippers who filed in 1994, since Valero's reparations will be determined upon a different test period and cost factors, and will be limited to the two-year period prior to the filing of Valero's complaint. See 49 U.S.C. app. § 16(3)(b) (1988). Thus, deferring consideration of Valero's claim is consistent with A.J. Phillips Co. While there is some commonality of issues between Valero's complaint proceeding and OR92-8, OR92-8 is not dispositive of Valero's reparations claims. Therefore Valero must await adjudication of its reparations claims in OR98-2.\n\n4. BP West Coast Products and Chevron\n\nPetitioners allege that because both BP WCP (formerly ARCO Products Co.) and Chevron (formerly Texaco Refining and Marketing, Inc.) were injured by SFPP's East Line rates and both jointly filed -- on January 14, 1994 -- a complaint, FERC violated the ICA by denying them reparations. FERC denied both of these entities damages from the East Line rates because they stated no claim regarding the East Line rates in their complaints. We again agree with FERC.\n\nARCO's and Texaco's complaint simply did not challenge the East Line rates. While their complaint referenced Tariff No. 15 along with other tariffs, which includes East Line rates, that reference was not specific to any rate, but alleged only that shippers shipped petroleum pursuant to one or more of those tariffs. That vague reference fails to state a cognizable complaint against the East Line rates, since otherwise the allegations solely concerned West Line rates. ARCO's and Texaco's complaint alleged, instead, that their \"shipments basically originate in California and are transported by SFPP to Phoenix and Tucson.\" Transportation from California into Arizona occurs only on the West Line. Consistent with that allegation, the complaint addressed the grandfathering of the West Line rates, and sought reparations, at the least, from the date of the filing of their complaint, which is the standard for grandfathered rates. The affidavit submitted in support of the complaint concluded that \"SFPP's rates on its West Line System exceed the rates that would result from an appropriate application of the Commission's ratemaking methodology by a significant amount.\" SFPP, L.P., No. OR92-8-000, Affidavit of Marsha K. Palazzi 2 (Jan. 18, 1994). No mention of the East Line rates is made in the complaint or the supporting affidavit. Thus, the complaint was only applicable to the West Line rates. See SFPP, L.P., 68 FERC at 61,582. Under these circumstances, the Commission reasonably interpreted the complaint to state a claim only with regard to the West Line rates, and BP WCP and Chevron were properly denied reparations for the East Line rates.\n\nARCO's October 2, 1992, intervention in OR92-8 does not change this result, see Rate Br. 32, since BP WCP's stated ground for intervention was its \"direct interest\" in the \"new origin point and applicable rates at East Hynes.\" As the East Hynes station is on the West Line, this intervention likewise stated no claim with regard to the East Line rates.\n\n5. Chevron\n\nOn September 23, 1992, Chevron filed a protest concerning SFPP's reversal of the flow of the \"six-inch line\" between Tucson and Phoenix, and SFPP's modification of its prorationing policy. On August 3, 1993, Chevron filed a complaint alleging that SFPP's East Line rates were unjust and unreasonable. Chevron demanded reparations \"for the period beginning two years preceding the filing of the Complaint.\"\n\nThe Commission properly calculated Chevron's East Line rate reparations based on Chevron's 1993 complaint challenging those rates. See supra at 14 n.2. While Chevron argued that its 1993 complaint should relate back to its 1992 protest, the 1992 protest did not challenge the East Line rates, but rather only challenged flow reversal on one of SFPP's lines and its capacity allocation procedures.\n\nChevron now contends that its East Line reparations should be based upon the date of its 1992 protest because the Commission treated the protest as a complaint. The Commission, held, however, that \"[t]he scope of the complaint proceeding shall be defined by the issues raised by El Paso and Chevron which caused these proceedings to be instituted.\" SFPP, L.P., 63 FERC ¶ 61,275, 62,769 (1993). Chevron's protest \"complained against the reversal of one of SFPP's lines and its capacity allocation procedures, but did not complain against the East Line rates as such.\" Opinion No. 435-A, 91 FERC at 61,514 n.55. Because the protest did not complain about the East Line rates, the Commission properly found that the protest did not trigger reparations for the East Line rates, and dated Chevron's right to reparations from Chevron's August 3, 1993, East Line complaint. SFPP, L.P., 97 FERC ¶ 61,138 61,623-24 (2001) (citing SFPP, L.P., 65 FERC ¶ 61,028); see also SFPP, L.P., 102 FERC ¶ 61,073, 61,183-84 (2003).\n\nThe ALJ's determination that reparations demands could relate back to earlier-filed complaints does not aid Chevron. As the ALJ recognized, an amendment to a pleading may relate back when it arises out of the same transaction or occurrence set forth in the original pleading. Fed. R. Civ. P. 15(c)(2). Because the Commission found that Chevron's original protest did not concern the East Line rates, but rather only the practice of prorationing and reversal of the \"six inch line,\" however, Chevron's claim for East Line rate reparations cannot relate back to that protest. The Commission reasonably determined that Chevron's 1993 complaint, which first stated a claim with regard to the justness and reasonableness of the East Line rates, was the proper basis for determining Chevron's right to reparations.\n\nFor the reasons given above, we affirm the decisions of the Commission in awarding reparations and deny the petitions for review in full to the extent they challenge FERC's reparations order.\n\nCONCLUSION\n\nIn conclusion, we affirm the decisions of the Commission and deny the petitions except as follows: As regards the West Line rates, we grant the petition and remand with respect to the Commission's decisions that the Watson enhancement and turbine fuel rates are grandfathered under the EPAct. We also remand with respect to the Commission's determination that changes in tax allowance policy constitute \"substantially changed circumstances\" under the Act. As regards the East Line rates, we reverse the Commission's decision to rely on Lakehead insofar as it pertains to tax allowances, and thus grant the petition and remand the Commission's determination regarding the proper tax allowance for SFPP. We also grant the petition and remand for the Commission to determine and explain an appropriate allocation of the civil litigation costs between the West Line and East Line shippers. Finally, we grant the petition and remand for the Commission to address SFPP's request to recover its reconditioning costs.\n\n\u003cspan class=\"fn\"\u003e1. Although the ICA was repealed in 1978, see Pub. L. No. 95-473 § 4(b), (c), 92 Stat. 1466, 1470 (Oct. 17, 1978), FERC has \"the duties and powers related to the establishment of a rate or charge for the transportation of oil by pipeline or the valuation of that pipeline that were vested on October 1, 1977, in the Interstate Commerce Commission.\" 49 U.S.C. § 60502 (2003). The relevant version of the ICA was, but is no longer, reprinted in the appendix to title 49 of the United States Code. Therefore, when we refer to FERC's authority under the ICA, we cite to the 1988 edition of the U.S. Code, the last such edition that reprinted the ICA as it appeared in 1977.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. In August 1993, Chevron filed a complaint that did specifically challenge the reasonableness of the West Line rates. See ALJ Decision, 80 FERC at 65,121. The WLS maintain that this 1993 complaint should \"relate back\" to its 1992 protest. We do not agree. Relation back is a concept born in the context of statutes of limitations. Amendments to complaints are said to relate back to the date of the original complaint. See Fed. R. Civ. P. 15(c). Even assuming that this suggested use of the relation back doctrine could supersede the Commission's own time limitations governing amendments of protests, the WLS concede that to relate back \"the claim ... in the amended pleading [must have] ar[isen] out of the conduct, transaction, or occurrence set forth ... in the original pleading.\" Fed. R. Civ. P. 15(c)(2). That clearly is not the case here. As the Commission found, Chevron's initial protest \"simply fails to contain any statement indicating a challenge to existing rates on SFPP's west line.\" SFPP, L.P., 65 FERC at 61,378.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. After SFPP filed Tariff No. 18, adding the turbine fuel service on the West Line, the OPB, acting pursuant to a protest by Chevron to Tariff No. 18, instituted an investigation and consolidated that case into the open investigation and suspension of SFPP's Tariffs Nos. 15, 16, and 17. SFPP, L.P., 62 FERC ¶ 62,060 (1993).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Consolidated Edison Co. v. FERC, 315 F.3d 316 (D.C. Cir. 2003) and the other cases cited by the shippers ( see WLS Br. 23) are distinguishable. Those cases stand for the unremarkable proposition that when an agency abandons its own precedent in the course of an adjudication, the new rule may be applied retroactively to the parties only \"so long as the parties ... are given notice and an opportunity to offer evidence bearing on the new standard.\" 315 F.3d at 323 (citing Hatch v. FERC, 654 F.2d 825, 835 (D.C. Cir. 1981)). Here, FERC did not abandon its own precedent. Shippers point to Santee Distrib. Co. v. Dixie Pipeline Co., 71 FERC ¶ 61,205 (1995), reh'g denied, 75 FERC ¶ 61,254 (1996), but that ruling -- issued nearly two years after Chevron's complaint was filed, and several months after the parties had submitted their direct cases to the ALJ, see ALJ Decision, 80 FERC at 65,121 --stands solely for the proposition that, to make out a substantial change under EPAct Section 1803, the complainant must show some change in circumstances since the enactment of the EPAct. See Santee Distrib. Co., 71 FERC at 61,754 (\"Comparisons of data for 1987 to data for 1993 cannot be the basis for showing a change in economic circumstances since enactment of the EPAct.\"). That holding is entirely consistent with the holding of Opinion No. 435.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In our discussion of the double-taxation rationale, we are advertent to actual and proposed changes in corporate and dividend taxation occurring after the ratemaking we now review. In view of the timing of the ratemaking, and of our resolution of this issue, no such changes are germane to our further analysis.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. A 41.7% limited partnership interest and a 1% general partnership interest.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. As noted in n.5, supra, changes in tax laws subsequent to the Commission's opinion herein may further affect the asymmetry of including in ratemaking allowance for the corporate tax of corporate unit holders but not the individual tax of individual unit holders.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. At least equally inapposite is Carolina Power and Light v. FERC, 860 F.2d 1097 (D.C. Cir. 1988). SFPP relies on Carolina Power and Light for the proposition that \"the Commission is not obligated in prospective ratemaking proceedings to match rates dollar for dollar with taxes paid to the Internal Revenue Service.\" Id. at 1101 (internal quotations omitted). There, again, we dealt with the computation of the precise amount of taxes to be passed through, not whether the Commission could create a tax liability out of whole cloth to pass through to rate payers of a nontaxable utility.\u003c/span\u003e\n\n",
    "body_length": 153671,
    "citedas": [
      "374 F.3d 1263"
    ],
    "attorneys": "R. Gordon Gooch argued the cause for West Line Shippers.With him on the briefs were Elisabeth R. Myers, D. JaneDrennan, George L. Weber, Marcus W. Sisk, Jr., Steven A.Adducci, and Richard E. Powers, Jr. Steven H. Brose argued the cause for petitioner Sfpp, L.P.With him on the briefs were Timothy M. Walsh, Daniel J.Poynor, Alice E. Loughran, Albert S. Tabor, Jr., and CharlesF. Caldwell. Thomas J. Eastment argued the cause for East LineShippers on Cost Allocation Issues. With him on the briefswere Joshua B. Frank, Michael J. Manning, and Glenn S.Benson. Thomas J. Eastment, Joshua B. Frank, Michael J. Manning, George L. Weber, R. Gordon Gooch, Elisabeth R.Myers, Richard E. Powers, Jr., Steven A. Adducci, andMarcus W. Sisk, Jr. were on the brief for petitioners andintervenors supporting petitioners on Rate and ReparationsIssues. Dennis Lane, Solicitor, Federal Energy Regulatory Commission, and Lona T. Perry, Attorney, argued the causes forrespondents. With them on the brief were Robert H. PateIII, Assistant Attorney General, U.S. Department of Justice,John J. Powers, III and Robert J. Wiggers, Attorneys, Cynthia A. Marlette, General Counsel, Federal Energy Regulatory Commission. Jay L. Witkin, Solicitor, and Susan J.Court, Special Counsel, entered appearances. Thomas J. Eastment, Joshua B. Frank, Michael J. Manning, George L. Weber, R. Gordon Gooch, Elisabeth R.Myers, Richard E. Powers, Jr., Steven A. Adducci, andMarcus W. Sisk, Jr. were on the brief of Shipper intervenorsin support of respondents. Steven H. Brose, Timothy M. Walsh, Daniel J. Poynor,Alice E. Loughran, Albert S. Tabor, Jr. and Charles F.Caldwell were on the brief of Sfpp, L.P. as intervenor insupport of respondents.",
    "category": [],
    "judges": "Before: Sentelle, Rogers, and Roberts, Circuit Judges.",
    "citation_count": 12
  }
}
