{
  "id": "EIOjPmYBTlTomsSB3tq4",
  "document": {
    "title": "Holloway v. McElroy",
    "full_title": "M. W. HOLLOWAY -APPELLEE, v. CLAY E. MCELROY, WARDEN -APPELLANT",
    "jurisdiction": "Fifth Circuit",
    "date": "1980-12-11T00:00:00.000Z",
    "docket": "No. 79-3325",
    "body": "On May 1, 1975, a jury in the Crisp County, Georgia, Superior Court convicted M. W. Holloway of voluntary manslaughter for the March 18, 1975, shooting of Joe Crumbley. At trial, Holloway had admitted the shooting, but had claimed self-defense. He was sentenced to twenty years. His conviction was affirmed on direct appeal in the Georgia courts, and the denial of his subsequent petition for habeas corpus in the state courts was affirmed by the Georgia Supreme Court. He then petitioned the federal district court below for a writ of habeas corpus. That court granted habeas relief, Holloway v. McElroy, 474 F. Supp. 1363 (M.D.Ga.1979), and the State of Georgia brings this appeal.\n\nWe are presented with two questions: First, was the burden of persuasion on one or more elements of the crime of voluntary manslaughter impermissibly shifted to Holloway in violation of his due process rights under the United States Constitution? Second, should the standard so recently announced by the United States Supreme Court in Jackson v. Virginia, 443 U.S. 307, 99 S. Ct. 2781, 61 L. Ed. 2d 560 (1979), be applied in determining the sufficiency of the evidence upon which he was convicted, and if so, was that evidence insufficient under the Jackson standard?\n\nFor the reasons set out below, and with some qualifications, we answer these questions in the affirmative. We therefore affirm the action of the district court below in granting habeas corpus relief.\n\nI. FACTUAL BACKGROUND LEADING TO THIS APPEAL\n\nA. The Trial\n\nHolloway was tried on a charge of malice murder, but was found guilty only of voluntary manslaughter. The prosecution's theory at trial was that Holloway deliberately, intentionally, and maliciously shot Joe Crumbley while Crumbley was sitting in his pickup truck at Holloway's father's farm near Cordele, Georgia; Holloway then, according to the prosecution's theory, attempted to alter the evidence at the scene to make it consistent with a story of self-defense. Holloway has consistently maintained that he shot Crumbley in legitimate self-defense as Crumbley came at him with a knife after the two men had scuffled. The chief evidence to support the State's theory was a series of inconsistencies between Holloway's version of the events as related at the trial and in interviews with police officers immediately after the shooting. For reasons that will become obvious later in this opinion, we proceed to sketch the evidence presented by both sides at Holloway's trial on April 30-May 1, 1975; additional detail is provided in the accompanying footnotes.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\n1. The prosecution's case-in-chief.-The prosecution's first key witness was Deputy Sheriff Andrew Martin. Martin testified that he had driven to Holloway's father's farm at about 3:00 p. m. on the day of the shooting to answer a report of trouble. Holloway led Martin to Crumbley's body, which lay just inside the doorway of the Holloway house. In response to Martin's questioning, Holloway explained that the shooting had occurred after an argument and fight between Crumbley and himself. Crumbley had started the fight in a drunken rage, and when Holloway withdrew the house, Crumbley pursued him with a knife. Holloway claimed that he had been forced to shoot in self-defense as Crumbley threatened him with the knife after following Holloway into the house.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The physical evidence at the scene was consistent in most respects with Holloway's account of the events.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The two respects in which the physical evidence was inconsistent with Holloway's version of events, as told to Martin on the scene, had to do with the location of Crumbley's coat at the time of the shooting and the ownership of a spread with which the body was covered. Holloway told Martin that Crumbley had taken off his own hat and jacket early in the fight. Other evidence at the trial showed that Crumbley had been wearing the jacket when the fatal shot was fired. Crumbley's body was covered with a spread when Martin arrived on the scene; there was testimony that the spread came from Crumbley's pickup truck rather than from the Holloway house, as Holloway claimed.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Subsequent investigation positively confirmed that the gun Holloway turned over to Martin had been the one used in the shooting, and that the shooting had been the cause of Crumbley's death.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nThe other key witness was Georgia Bureau of Investigation Agent Jim Baker, who described two interviews he had conducted with Holloway after the shooting.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e In the initial interview, Holloway told a story very similar to that which he told Martin.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e When confronted with a discrepancy in his story with regard to when Crumbley took off his jacket, Holloway this time said that Crumbley took off the jacket as he came into the house.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Holloway told Baker that he had fired from a kneeling position as Crumbley loomed over him with the knife; he fired several times. After an autopsy on Crumbley's body indicated that the bullet's trajectory ranged downward at a forty-five degree angle from the left shoulder into the right chest space, Baker again questioned Holloway as to the position which he fired the shots, and Holloway again confirmed that he had begun firing while on his knees.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Though Baker investigated with some care, he could find no other evidence inconsistent with Holloway's claim of self-defense.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\n2. The defendant's case-in-chief.-The defense primarily relied upon M. W. Holloway's own testimony.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Holloway contended that Crumbley had started a fight with him after cursing him and accusing him of trying to shoot Crumbley in a previous incident that involved Crumbley's unauthorized fishing at a pond on the Holloway property.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e After the men fought in the yard outside the Holloway house for a while, Holloway broke free and retreated to the house. But Crumbley followed him, brandishing a hunting knife\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e and ignoring Holloway's warnings. Holloway was forced to shoot to save his own life.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e After the shooting, he covered Crumbley's body with a spread that he claimed belonged to him; he then summoned the police.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nWhen asked at trial to explain his prior inconsistent statements to the police officers regarding the jacket, he said that he didn't remember much about the jacket-only that he had taken it off Crumbley after the shooting. Holloway flatly denied that he had gotten the spread out of Crumbley's truck, or that he had ever plotted to kill Crumbley. He testified that he did not know Crumbley well enough to recognize him on sight, and that he only recognized Crumbley when Crumbley accused him of trying to shoot Crumbley at the fishpond. When asked why he had shot Crumbley, Holloway replied as follows:\n\nI shot Mr. Crumbley because Mr. Crumbley was trying to kill me with this knife, trying to stick me with this knife. I was trying to protect my life; I was trying to get him off me and the only way I could get him off me was with that. I tried to push him back; I tried to get him to leave two or three times.\n\nHe testified further that he was physically unable to put up much of a fight because of a physical disability having to do with his hip joint. He denied having changed around any of the physical evidence on the scene, and said that he never went out to Crumbley's truck at all. When asked to account for the inconsistencies between his testimony at trial and the statements he had given the police officers after the event, Holloway replied that he had been very upset and sick on the day of the shooting. He said that he did not deny that he might have made some inconsistent statements to the police about the jacket, but said that he was telling the story at trial as he remembered it.\n\nWhen asked to explain the path of the fatal bullet, the following exchange took place between the district attorney and Holloway:\n\nQ. Well, can you explain to the Jury in any manner that you see fit, how Joe Crumbley could have been shot in the left shoulder and the bullet take a downward trajectory with you on your knees and him over you?\n\nA. The last shot I fired at Mr. Crumbley, I was up.\n\nQ. Oh, now you remember that you ....\n\nA. I said that I was coming up and I had the gun pointed this way, the way I said it was done, in this direction, like this, and when I came up, Mr. Crumbley jerked, I felt him when he jerked back.\n\n(Ellipsis in original.) Unfortunately, the court reporter did not indicate Holloway's descriptive gestures in the transcript.\n\nThe defense rested, and its motion for a directed verdict of acquittal was denied. Both sides made closing arguments and the jury was charged.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e During their deliberations, the jury asked the court what the various sentences were for the different offenses as to which they had been instructed, but the court declined to answer that question. After deliberating for over three hours, the jury returned a verdict of guilty of voluntary manslaughter. Thus, they impliedly acquitted Holloway of the greater charge of malice murder and rejected his sole defense of self-defense. The court then sentenced Holloway to the maximum allowable sentence for voluntary manslaughter under Georgia law, twenty years.\n\nB. Holloway's Direct Appeal in the Georgia Courts\n\nFollowing his conviction, Holloway appealed to the Georgia Court of Appeals. He urged that the trial court had erred in limiting the scope of questioning during the voir dire examination of the jury venire, and in failing to excuse some potential jurors who were challenged for cause. The court of appeals, however, sustained the trial judge's action in limiting the questioning, holding that there was no abuse of discretion because some of the questions were overbroad; further, Holloway had not used all of his peremptory strikes, and hence could not complain of having to take any particular juror. Holloway v. State, 137 Ga.App. 124, 125(1-4), 222 S.E.2d 898, 899-90 (1975). Holloway also contended that the evidence was insufficient to support a conviction of voluntary manslaughter. Six judges-a majority of the court of appeals-disagreed, pointing to the discrepancies in Holloway's testimony about the bullet's path and the jacket:\n\nThe evidence amply warranted a verdict of guilty of manslaughter; and further authorized the jury to disbelieve defendant's testimony because of being contradicted by prior contradictory statements about when and who took the jacket off the deceased and as to whether the shots ranged downward or upward.\n\nId. at 126(5-6), 222 S.E.2d at 900.\n\nPresiding Judge Braswell Deen, however, wrote a strong dissent that was joined in by two of the other judges. Judge Deen first reviewed the evidence presented at the trial, and concluded:\n\nThe inconsistencies in the appellant's statements concerning the dead man's coat, the location of the spread and the position of the deceased when he was shot go to his credibility and the jury was within its prerogative to disbelieve him on these points and to find that the coat was being worn at the time of death, that the spread came from the truck and that the appellant was not on his knees when the shot was fired; however, to sustain a conviction of manslaughter there must have been evidence to authorize the jury to find that the appellant shot the deceased, not under circumstances where there was actual or apparent necessity to do so to save his own life, but in hot blood engendered by the deceased's conduct toward him.\n\nId. at 129, 222 S.E.2d at 902 (Deen, P. J., dissenting). Judge Deen determined that the only theory on which the state could argue that voluntary manslaughter was proved was one of mutual combat-i.e., that both men were at fault and willing to fight because of a sudden quarrel-but found this theory, and the theory that Holloway was not acting in self-defense, unpersuasive:\n\nIt is true that the only evidence produced by the appellant to show that the homicide was perpetrated in self-defense was his own statement and testimony and that there was expert testimony that the decedent could not have been shot in the manner alleged. This does not however disprove that the shot was fired in self-defense; it merely is some evidence that the appellant was not in the position he claimed when the shot was fired. By the same token the state relied exclusively on the statement and testimony of the appellant to show an essential element of the crime of manslaughter (here mutual combat), and where no other evidence is produced to show such element, the evidence does not authorize a verdict of guilty.\n\nId. (citing Georgia cases). He also noted that the State had the burden of proving that Holloway acted in the heat of sudden passion, and asked the majority this question:\n\nWhere is the evidence to show that the deceased was killed in any manner other than in self-defense? There is none. The contradictions in the appellant's story in no way disprove his explanation that the shot was fired in self-defense. To my mind the fact that a defendant's story may prove to be contradicted does not remove the state's burden to show at least some evidence of \"hot blood.\" The fact that the defendant's explanation may be contradicted in some respects does not obviate the necessity for proof of the commission of a crime in order to sustain a conviction. Here the only evidence which could possibly be contrary to the appellant's statement was the coat, the sheet and the bullet's trajectory....\n\nIt is a woeful day when the state seeks a conviction of murder on such scant evidence. It is an even sadder day when a jury returns a verdict of guilty of manslaughter based upon so little evidence. But it is perhaps the most regretful day of all when an appellate court gives judicial sanction to such a result.\n\nId. at 132-133, 222 S.E.2d at 903-04 (emphasis in original). But despite Judge Deen's dissent, the Georgia Supreme Court denied Holloway's application for a writ of certiorari.\n\nC. Holloway's Habeas Corpus Proceedings in the State Courts\n\nAfter the Georgia Supreme Court denied Holloway's application for certiorari, Holloway filed an application for a writ of habeas corpus in the United States District Court for the Middle District of Georgia, Americus Division. On June 16, 1977, however, this application was dismissed without prejudice by the district court because Holloway had failed to exhaust his state-court remedies, as required by 28 U.S.C. ยง 2254(b) (1976). The court suggested sua sponte that the charge given by the trial court was \"notably suspect under the principles of Mullaney v. Wilbur,\" 421 U.S. 684, 95 S. Ct. 1881, 44 L. Ed. 2d 508 (1975), and suggested that the issues concerning the trial court's charge be presented to the state courts.\n\nHolloway then petitioned the Superior Court of Baldwin County, Georgia, for habeas corpus relief. That court denied relief, and the Georgia Supreme Court granted a certificate of probable cause to appeal. On appeal, the Georgia Supreme Court affirmed the denial of Holloway's state-court habeas corpus petition in a three-paragraph opinion, which is reproduced below.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e The court first held that despite Holloway's failure to raise the burden-shifting issues in his direct appeal or at trial, he did not waive the right to attack the charge on this ground in his state habeas corpus proceeding because the issue involved law developed after his trial.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Holloway v. McElroy, 241 Ga. 400(1), 245 S.E.2d 658, 659 (1978). On the merits of the petition, the court concluded that because Holloway had no burden of proving anything until the State had \"shown to a moral and reasonable certainty and beyond reasonable doubt that the defendant is the intentional slayer,\" it was permissible to place upon Holloway the burden of persuasion as to justification, citing Patterson v. New York, 432 U.S. 197, 97 S. Ct. 2319, 53 L. Ed. 2d 281 (1977). 241 Ga. at 401(2), 245 S.E.2d at 659. Holloway apparently did not petition for certiorari from the United States Supreme Court after either his direct or collateral appeal in the state courts, but this is not required to exhaust state-court remedies. See County Court of Ulster County v. Allen, 442 U.S. 140, 149 n.7, 99 S. Ct. 2213, 2220 n.7, 60 L. Ed. 2d 777 (1979).\n\nD. Habeas Proceedings in the Federal District Court\n\nAfter the Georgia Supreme Court affirmed the state court's denial of Holloway's petition for a writ of habeas corpus, Holloway brought this action in federal district court. The State conceded that Holloway had properly exhausted his state-court remedies, and both parties agreed that there was no need for an evidentiary hearing to supplement the record from the trial.\n\nThe court below granted habeas corpus relief in a thoughtful, comprehensive opinion. Holloway v. McElroy, 474 F. Supp. 1363 (M.D.Ga.1979). The court first addressed the sufficiency of the evidence supporting the conviction. It began by noting that Jackson v. Virginia, 443 U.S. 307, 99 S. Ct. 2781, 61 L. Ed. 2d 560 (1979), established a new standard of review for federal courts to use in evaluating the sufficiency of the evidence supporting a state-court conviction: \"Instead of determining whether or not here is \"any evidence' to support petitioner's conviction, the court must now go further and satisfy itself that the evidence in the record could reasonably support a finding of guilt beyond a reasonable doubt.\" 474 F. Supp. at 1364-65. The court then cited the reasoning of Judge Deen's dissent from the Georgia Court of Appeals' decision.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e The court also noted that the prosecution's evidence revealed that Crumbley had a blood alcohol content of 0.12% at the time of his death, while 0.10% gives rise to a statutory presumption under Georgia law\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e that a person was under the influence of alcohol; the court cited this as evidence supporting Holloway's contention that Crumbley began the fight. The court held:\n\nIn this court's considered judgment this conviction for manslaughter was not supported by evidence that would rationally lead to the conclusion of guilt beyond a reasonable doubt. It must(,) therefore, be set aside.\n\nId. at 1365 (footnote omitted). The court noted by way of footnote that the double jeopardy clause would preclude Holloway's retrial since the conviction was being set aside for insufficiency of evidence. Id. at 1365 n.1 (citing Burks v. United States, 437 U.S. 1, 98 S. Ct. 2141, 57 L. Ed. 2d 1 (1978); Greene v. Massey, 437 U.S. 19, 98 S. Ct. 2151, 57 L. Ed. 2d 15 (1978).\n\nThe court continued to a discussion of the trial court's charge. It found the charge to be constitutionally defective on three related bases. First, it held that the trial court erred in instructing the jury that Holloway was presumed under Georgia law to intend the consequences of his acts for purposes of establishing that the shooting was intentional. 474 F. Supp. at 1366-67. According to the district court, this unconstitutionally relieved the prosecution of its burden of proving an essential element of the crime-intent. It based this conclusion on the Supreme Court's recent decision in Sandstrom v. Montana, 442 U.S. 510, 99 S. Ct. 2450, 61 L. Ed. 2d 39 (1979).\n\nSecond, the court held that the trial court erred in instructing the jury that the law presumed every intentional homicide to be malicious until the defendant had established the contrary to the jury's satisfaction. 474 F. Supp. at 1367-69. In the court's view, this instruction impermissibly shifted onto the defendant the burden of persuasion on malice-which was yet another essential element of the offense-and hence the instruction was unconstitutional under In re Winship, 397 U.S. 358, 90 S. Ct. 1068, 25 L. Ed. 2d 368 (1970); Mullaney v. Wilbur, 421 U.S. 684, 95 S. Ct. 1881, 44 L. Ed. 2d 508 (1975); Patterson v. New York, 432 U.S. 197, 97 S. Ct. 2319, 53 L. Ed. 2d 281 (1977); and Sandstrom, supra.\n\nThird, the court held that the trial court's instruction impermissibly placed upon Holloway the burden of persuasion on self-defense. 474 F. Supp. at 1369-70. The court reasoned that under Georgia law, \"unlawfulness\" was an essential element of both murder and manslaughter, but that self-defense and unlawfulness were mutually exclusive propositions:\n\n\"(T)o require the defendant to prove self-defense-(lawfulness)-would relieve the prosecution from proving an essential element of the crime charged-(unlawfulness).\"\n\n474 F. Supp. at 1369 (quoting Porter v. Leeke, 457 F. Supp. 253, 255 (D.S.C.1978)). The court concluded that under Georgia law, \"the absence of self-defense is an element of the crime which the prosecution must (prove) beyond a reasonable doubt.\"\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e Id. Hence, because the charge required Holloway to establish his defense of self-defense by a preponderance of the evidence, it unconstitutionally shifted to Holloway an essential element of the prosecution's case.\n\nFinally, the court determined that these erroneous instructions were not harmless error beyond a reasonable doubt, citing Chapman v. California, 386 U.S. 18, 87 S. Ct. 824, 17 L. Ed. 2d 705 (1967). 474 F. Supp. at 1370. The court ordered the State to release Holloway immediately after the judgment became final by virtue of either the State's failure to appeal, or by affirmance upon appeal. The court offered to entertain a motion for bail pending appeal, and counsel for Holloway informed this court at oral argument that Holloway is now free on bail pending our decision.\n\nE. Summary of the Issues Before This Court on Appeal\n\nIn summarizing the issues with which we are now presented, perhaps it is best to start by listing the issues that are not properly before us. First, there is no question but that Holloway is entitled to raise as grounds for habeas relief the asserted errors in the trial court's charge, despite his failure to raise those issues at trial or pursue them on direct appeal. Any doubt that we might otherwise have as to whether Holloway was barred by a state-law contemporaneous objection rule or some other independent and adequate state-law procedural ground, see Wainwright v. Sykes, 433 U.S. 72, 97 S. Ct. 2497, 53 L. Ed. 2d 594 (1977), has been resolved for us by the highest authority on Georgia's procedural law, the Georgia Supreme Court. That court specifically held as a predicate to affirming the denial of Holloway's state-court habeas petition that, in view of the rapid changes in the law wrought by the United States Supreme Court since Holloway's trial in 1975, no state procedural ground should be used to bar Holloway from asserting his arguments on the merits of the trial court's charge. Holloway v. McElroy, 241 Ga. 400(1), 245 S.E.2d 658, 659 (1978).\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e \"(I)f neither the state legislature nor the state courts indicate that a federal constitutional claim is barred by some state procedural rule, a federal court implies no disrespect for the State by entertaining the claim.\" County Court of Ulster County v. Allen, 442 U.S. 140, 154, 99 S. Ct. 2213, 2223, 60 L. Ed. 2d 777 (1979) (footnote omitted). We therefore need not decide the question of whether the facts of this case would otherwise bring it within the \"cause\" and \"prejudice\" exceptions to the rule of Wainwright v. Sykes.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nNext, we agree with the State that another issue was not properly before the district court, and is not before us on appeal. One stated ground for the district court's decision was that the trial court's instructions as to the presumption of malice had relieved the prosecution of its obligation to prove beyond reasonable doubt every essential element of the crime of murder. Had the jury found Holloway guilty of malice murder, the trial court's instructions on malice would certainly have been relevant. But the jury found Holloway guilty only of the crime of voluntary manslaughter. As the district court pointed out, 474 F. Supp. 1369 at n.4, and as we will discuss in more detail later in this opinion,\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e voluntary manslaughter is defined as being a homicide that would be murder but for the lack of malice; voluntary manslaughter requires instead that the defendant must have acted \"solely as the result of a sudden, violent, and irresistible passion resulting from serious provocation sufficient to excite such passion in a reasonable person,\" rather than with malice. Ga.Code Ann. ยง 26-1102 (1978). The jury necessarily found an absence of malice when it impliedly acquitted Holloway of murder but convicted him of voluntary manslaughter. Thus, even if the trial court's instructions operated to shift the burden of negating malice to Holloway, the jury found that he satisfactorily met that burden; Holloway is now in no position to complain of this portion of the charge, since it did not ultimately work to his detriment. Any error was harmless beyond a reasonable doubt. See Chapman v. California, 386 U.S. 18, 87 S. Ct. 824, 17 L. Ed. 2d 705 (1967); Wynn v. Mahoney, 600 F.2d 448, 450 (4th Cir.), cert. denied, 444 U.S. 950, 100 S. Ct. 423, 62 L. Ed. 2d 320 (1979). Insofar as the district court's decision was based on alleged errors in the portion of the trial court's charge that dealt with the presumption of malice, that portion of its opinion must be regarded as no more than dictum. We are not to be construed as intimating any views whatsoever as to whether that dictum would have been a correct statement or application of the law had the facts of the case properly presented that issue to the district court.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nThe same may be said, though for different reasons, for the portion of the district court's opinion that dealt with the trial court's instruction on the presumption of intent. General intent\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e is an essential element of all crimes under Georgia law (except those involving criminal negligence), see Ga.Code Ann. ยง 26-601 (1978), but Holloway has never contended that his shooting of Crumbley was unintentional-i. e., that he did not intend the natural and probable consequences of his act. Compare Sandstrom v. Montana, 442 U.S. 510, 99 S. Ct. 2450, 61 L. Ed. 2d 39 (1979) (holding unconstitutional a presumption of intent where defendant claimed shooting was not knowing or purposeful because of personality disorder aggravated by alcohol; jury could reasonably have thought presumption was conclusive or placed burden of persuasion on defendant-either of which would violate due process). Holloway acknowledged that he had committed the homicide, and that he had done so intentionally. By pleading only self-defense, he voluntarily focused the entire determination of his criminal culpability on a single question-was the homicide justified? There is no denial of due process in allowing a defendant to admit some essential elements of the crime in order to put justification into issue.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e We are convinced that any error in the jury instructions on the intent issue was harmless beyond reasonable doubt. Chapman v. California, supra. Thus, insofar as the district court's decision was based on alleged errors in the portion of the trial court's charge that dealt with the presumption of intent, that portion of the district court's opinion must be regarded as dictum. We intimate no view as to the correctness of the district court's dictum were it to be applied in an appropriate case.\n\nThus, we have remaining before us two questions: First, could the State require Holloway to establish his self-defense claim by a preponderance of the evidence? Second, was there sufficient evidence to support Holloway's conviction?\n\nTo answer the first question, we must determine the essential components of the crime of voluntary manslaughter under Georgia's substantive criminal law. Particularly, we must determine whether the absence of self-defense is an essential element of the crime, at least in those instances in which the issue is properly raised. If it is, then the State violated Holloway's due process rights by placing upon him the burden of persuasion on the self-defense issue, and Holloway is entitled at the least to a new trial, in which the burden of persuasion on this issue would be placed upon the prosecution. We undertake this analysis in part II of this opinion.\n\nBut even if we hold that the State violated Holloway's due process rights in placing upon him the burden of persuasion on the self-defense issue, we must still address the question of the sufficiency of the evidence. Holloway seeks not just his release from prison, but freedom from retrial. He contends not just that this jury made its determination under an erroneous charge, but that no jury when properly charged could have found him guilty of every necessary element of the offense from the record evidence adduced at trial. To determine whether he is entitled to the full measure of relief he seeks, we must review the sufficiency of the evidence upon which he was convicted, for were we to find that evidence insufficient, Holloway would thereafter be entitled to assert the double jeopardy clause as a bar to his retrial for this killing. As a predicate to our review of the sufficiency of the evidence, we must decide whether the standard of review set out in Jackson v. Virginia is the appropriate one for this court to use.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e We deal with the sufficiency of the evidence issue, including the proper standard of review, in part III of this opinion.\n\nII. THE BURDEN OF PERSUASION ON THE ISSUE OF SELF-DEFENSE\n\nA. The Trial Court's Charge on Self-Defense\n\nEarly in its charge, the trial court instructed the jury as to the definition of malice murder under section 26-1101 of the Georgia Criminal Code. It then went on to charge as to the crime of voluntary manslaughter, and the differences between that crime and malice murder: the latter crime requires either express or implied malice, while voluntary manslaughter requires that the killer have acted solely from a sudden, violent, and irresistable passion resulting from serious provocation sufficient to excite such passion in a reasonable person. The trial court then charged on justification-specifically, through defense of one's person or habitat. After defining the circumstances in which justification would exist, the trial court charged the jury that it should acquit if it found that Holloway was justified under one or more of the principles of justification given. In setting out the circumstances in which an intentional homicide should not be found to be malicious, the trial court charged:\n\nI charge you further that the law presumes every intentional homicide to be malicious until the contrary appears from circumstances of alleviation, of justification, of mitigation, or excuse, and the burden is on the slayer whenever an intentional homicide has been proved to make out such circumstances to the satisfaction of the Jury unless they appear from the evidence produced against him.\n\nAlmost immediately thereafter, it charged as to the burden of persuasion on the self-defense issue:\n\nI charge you that when a killing is proved to be the intentional act of the defendant, the presumption of innocence with which he enters upon the trial is removed from him and the burden is upon him to justify or mitigate the homicide unless the evidence introduced against him shows justification or mitigation or excuse, but as I have charged you heretofore, the evidence in justification or mitigation or excuse may be found in the evidence introduced against him. If there be no evidence introduced to show justification or excuse, and if the evidence introduced shows the homicide committed as charged in the Indictment, the burden would then be upon the defendant to show justification or mitigation or excuse.\n\nTranscript at 253-54 (emphasis added).\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\nThe district court found that even though the charge never explicitly allocated the burden of persuasion on the self-defense issue, the charge as a whole operated to put the burden of proof on self-defense on Holloway. 474 F. Supp. at 1369-70. This was also the construction given the charge by the Georgia Supreme Court, see Holloway v. McElroy, 241 Ga. 400, 401(2), 245 S.E.2d 658, 659 (1978). We note that because voluntary manslaughter was defined in terms of circumstances that would otherwise be murder but for the substitution of \"hot blood\" for malice, a reasonable juror could well have believed that the burden was on the defendant to make out to the jury's \"satisfaction\" any circumstances of justification, mitigation, or excuse on the manslaughter charge, too. When combined with the other language quoted above-which abolishes the presumption of innocence once an intentional killing is shown, and requires the defendant to carry the \"burden\" on justification, mitigation, or excuse (without distinguishing between burdens of production and persuasion)-this inference would be even more compelling. After considering the entire charge, in addition to that particularly relevant portion set out above, we agree with the district court that a reasonable juror could well have believed from the charge as given that the burden was on Holloway to establish, by something approximating a preponderance of the evidence, that the killing was in self-defense. Thus, once an intentional killing was shown-as it was in this case by Holloway's own testimony-a reasonable juror could have believed that his duty was to convict even if it was exactly as likely as not that the killing had been in self-defense. Whether the resulting conviction would be for malice murder or voluntary manslaughter would depend on whether Holloway had established to the jury's satisfaction that the killing was not done with malice, but instead with \"hot blood.\"\n\nThe State does not seriously contend otherwise, but instead insists that this allocation of the burden of persuasion is constitutionally permissible and in accord with Georgia law at the time of the trial. Whether the State is correct in this assertion depends upon the relationship between self-defense and the unlawfulness requirement in Georgia's definition of the crime of voluntary manslaughter. Our analysis of this relationship must be performed within the framework established in recent Supreme Court decisions that construe the requirements binding upon the States under the due process clause.\n\nB. The Framework for Constitutional Analysis of the States' Definition of Crimes and Allocation of Burdens of Persuasion\n\n1. In re Winship.-In invalidating a New York statute that allowed the State to convict juveniles of crimes upon proof by a preponderance of the evidence, the Supreme Court explicitly held for the first time in In re Winship, 397 U.S. 358, 364, 90 S. Ct. 1068, 1072, 25 L. Ed. 2d 368 (1970), that \"the Due Process Clause protects the accused against conviction except upon proof beyond a reasonable doubt of every fact necessary to constitute the crime with which he is charged.\" The Court emphasized that the long-established adherence to this standard in common-law jurisdictions reflected \"a profound judgment about the way in which law should be enforced and justice administered.\" Id. at 361-62, 90 S. Ct. at 1071 (quoting Duncan v. Louisiana, 391 U.S. 145, 155, 88 S. Ct. 1444, 1450, 20 L. Ed. 2d 491 (1968)). The Court noted that many of its previous opinions had assumed that the \"beyond reasonable doubt\" standard was required by the Constitution, id. at 362-63, 90 S. Ct. at 1071-72, and noted that \"(t)he standard provides concrete substance for the presumption of innocence-that bedrock \"axiomatic and elementary' principle whose \"enforcement lies at the foundation of the administration of the criminal law.' \" Id. at 363, 90 S. Ct. at 1072 (quoting Coffin v. United States, 156 U.S. 432, 453, 15 S. Ct. 394, 402, 39 L. Ed. 481 (1895)). Among the \"cogent reasons\" supporting the standard's vital role, said the Court, are its value in reducing the margin of error through which innocent persons might be wrongly convicted, and in fostering the respect and confidence of the community in the integrity of the criminal justice system. Id. at 363-64, 90 S. Ct. 1072-73.\n\nA bare two years later, the Supreme Court held in Ivan V. v. City of New York, 407 U.S. 203, 205, 92 S. Ct. 1951, 1952, 32 L. Ed. 2d 659 (1972) (per curiam), that the rule announced in Winship was to be given \"complete retroactive effect.\"\n\n2. Mullaney v. Wilbur.-The Supreme Court was called upon in Mullaney v. Wilbur, 421 U.S. 684, 95 S. Ct. 1881, 44 L. Ed. 2d 508 (1975), to determine whether Wilbur's murder conviction in a Maine state court was in violation in his Winship rights because the burden of proving that he acted in \"heat of passion\" was placed upon him. Wilbur contended at trial that he had lacked the requisite criminal intent to be convicted of murder, or alternately that the killing could be no more than manslaughter since it occurred in the heat of passion provoked by the victim's homosexual assault. The trial court instructed the jury that, under Maine law, the crimes of murder and manslaughter shared the common elements of intent and unlawfulness (lack of excuse or justification). The jury was instructed that once the prosecution had proven these elements beyond a reasonable doubt, malice aforethought-the additional element necessary to establish the crime of murder-was to be conclusively implied unless the defendant proved by a fair preponderance of the evidence that he acted in the heat of passion on sudden provocation, in which case a conviction for manslaughter would be authorized. The trial court emphasized that malice aforethought and heat of passion were two fundamentally inconsistent things, and that by proving the latter the defendant would negate the former and reduce the homicide from murder to manslaughter.\n\nThe Supreme Court first noted that it was bound by the construction given by state courts to their states' laws except in extreme circumstances that were not present in that case. Id. at 691, 95 S. Ct. at 1886. The Court capsulized Maine's law of homicide as follows:\n\nAbsent justification or excuse, all intentional or criminally reckless killings are felonious homicides. Felonious homicide is punishable as murder-i. e., by life imprisonment-unless the defendant proves by a fair preponderance of the evidence that it was committed in the heat of passion on sudden provocation, in which case it is punished as manslaughter ....\n\nId. at 691-92, 95 S. Ct. at 1886. The Court noted that, while at common law the burden of proving heat of passion rested on the defendant, the large majority of states had come to require the prosecution to prove beyond reasonable doubt the absence of heat of passion. Id. at 693-96, 95 S. Ct. at 1886-88.\n\nThe Court refused the State's invitation to limit Winship to those facts that, if proved, would wholly exonerate the defendant:\n\nMaine has chosen to distinguish those who kill in the heat of passion from those who kill in the absence of this factor.... By drawing this distinction, while refusing to require the prosecution to establish beyond a reasonable doubt the fact upon which it turns, Maine denigrates the interests found critical in Winship.\n\nId. at 698, 95 S. Ct. at 1889. The Court noted that Winship had been concerned with substance rather than form, and pointed out:\n\nNot only are the interests underlying Winship implicated to a greater degree in this case, but in one respect the protection afforded those interests is less here. In Winship the ultimate burden of persuasion remained with the prosecution, although the standard had been reduced to proof by a fair preponderance of the evidence. In this case, by contrast, the State has affirmatively shifted the burden of proof to the defendant. The result, in a case such as this one where the defendant is required to prove the critical fact in dispute, is to increase further the likelihood of an erroneous murder conviction.\n\nId. at 700-01, 95 S. Ct. at 1890-91. In addressing the practical consequences of its holding, the Court noted that Maine itself required the prosecution to prove beyond reasonable doubt the absence of self-defense; the Court therefore could \"discern no unique hardship on the prosecution that would justify requiring the defendant to carry the burden of proving a fact so critical to criminal culpability.\" Id. at 702, 95 S. Ct. at 1891. The Court concluded by noting that \"(u)nder this burden of proof a defendant can be given a life sentence when the evidence indicates that it is as likely as not that he deserves a significantly lesser sentence (under Maine law).\" Id. at 703, 95 S. Ct. at 1892 (emphasis in original). For the sum of these reasons, the Court concluded that Wilbur's conviction could not stand.\n\nIn 1977, the Court held that the rule announced in Mullaney necessarily must be given retroactive effect:\n\nIvan V. (v. City of New York, 407 U.S. 203, 92 S. Ct. 1951, 32 L. Ed. 2d 659 (1972),) controls this case. In Mullaney v. Wilbur, as in In re Winship, the Court held that due process requires the States in some circumstances to apply the reasonable doubt standard rather than some lesser standard under which an accused would more easily lose his liberty. In Mullaney, as in Winship, the rule was designed to diminish the probability that an innocent person would be convicted and thus to overcome an aspect of a criminal trial that \"substantially impairs the truth-finding function.\"\n\nHankerson v. North Carolina, 432 U.S. 233, 242, 97 S. Ct. 2339, 2344, 53 L. Ed. 2d 306 (1977). The Court ended its opinion, however, with this observation: \"Since the issue of whether due process requires the prosecution to disprove self-defense beyond a reasonable doubt under North Carolina law was not raised by either party in this case, we decline to consider it now.\" Id. at 245, 97 S. Ct. at 2346.\n\n3. Patterson v. New York.-New York's statutory definition of second-degree murder differed somewhat from the homicide law reviewed by the Court in Mullaney. Malice aforethought was not an element of the New York version of the crime; indeed, there was no requirement of premeditation whatsoever. Instead, all that was required was for the prosecution to prove that there was an intentional killing. That done, the State allowed a defendant to raise and prove as an affirmative defense that he acted \"under the influence of extreme emotional disturbance for which there was a reasonable explanation or excuse.\" The Court upheld a conviction under this statute in Patterson v. New York, 432 U.S. 197, 97 S. Ct. 2319, 53 L. Ed. 2d 281 (1977), while insisting that it was not overruling Mullaney. Indeed, Patterson was announced on the very day that the Court declared Mullaney to be retroactive in the Hankerson case.\n\nThe Patterson Court began by noting:\n\n(I)t is normally \"within the power of the State to regulate procedures under which its laws are carried out, including the burden of producing evidence and the burden of persuasion,\" and its decision in this regard is not subject to proscription under the Due Process Clause unless \"it offends some principle of justice so rooted in the traditions and conscience of our people as to be ranked as fundamental.\"\n\nId. at 201-02, 97 S. Ct. at 2322-23 (citing Speiser v. Randall, 357 U.S. 513, 523, 78 S. Ct. 1332, 1341, 2 L. Ed. 2d 1460 (1958); Leland v. Oregon, 343 U.S. 790, 798, 72 S. Ct. 1002, 1007, 96 L. Ed. 1302 (1952); and Snyder v. Massachusetts, 291 U.S. 97, 105, 54 S. Ct. 330, 332, 78 L. Ed. 674 (1934)). The Court then described its holding in Leland v. Oregon, supra, which found no due process violation in an Oregon rule that insanity must be proved beyond a reasonable doubt by the defendant. The Patterson Court declined to reconsider Leland's vitality. Id. at 207, 97 S. Ct. at 2325. Applying a strict procedural due process analysis, the Court held:\n\nWe cannot conclude that Patterson's conviction under the New York law deprived him of due process of law. The crime of murder is defined by the statute, which represents a recent revision of the criminal code, as causing the death of another person with intent to do so. The death, the intent to kill, and causation are the facts that the State is required to prove beyond a reasonable doubt if a person is to be convicted of murder. No further facts are either presumed or inferred in order to constitute the crime. The statute does provide an affirmative defense-that the defendant acted under the influence of extreme emotional disturbance for which there was a reasonable explanation-which, if proved by a preponderance of the evidence, would reduce the crime to manslaughter, an offense defined in a separate section of the statute. It is plain enough that if the intentional killing is shown, the State intends to deal with the defendant as a murderer unless he demonstrates the mitigating circumstances.\n\nId. at 205-06, 97 S. Ct. at 2324-25 (emphasis added). The Court did not believe that this offended any of the substantive fairness requirements of the due process clause: though New York's placement of the burden of persuasion on the defendant enhanced the probability that a person legitimately entitled to the mitigation of punishment would be penalized unfairly,\n\ndue process does not require that every conceivable step be taken, at whatever cost, to eliminate the possibility of convicting an innocent person ....\n\nIn each instance of a murder conviction under the present law, New York will have proved beyond a reasonable doubt that the defendant has intentionally killed another person, an act which it is not disputed the State may constitutionally criminalize and punish. If the State nevertheless chooses to recognize a factor that mitigates the degree of criminality or punishment, we think the State may assure itself that the fact has been established with reasonable certainty. To recognize at all a mitigating circumstance does not require the State to prove its nonexistence in each case in which the fact is put in issue, if in its judgment this would be too cumbersome, too expensive, and too inaccurate.\n\nId. at 208-09, 97 S. Ct. at 2326 (footnote omitted). The Court summarized its holding as follows:\n\nWe thus decline to adopt as a constitutional imperative, operative countrywide, that a State must disprove beyond a reasonable doubt every fact constituting any and all affirmative defenses related to the culpability of an accused. Traditionally, due process has required that only the most basic procedural safeguards be observed; more subtle balancing of society's interests against those of the accused have been left to the legislative branch. We therefore will not disturb the balance struck in previous cases holding that the Due Process Clause requires the prosecution to prove beyond a reasonable doubt all of the elements included in the definition of the offense of which the defendant is charged. Proof of the nonexistence of all affirmative defenses has never been constitutionally required; and we perceive no reason to fashion such a rule in this case and apply it to the statutory defense at issue here.\n\nThis view may seem to permit state legislatures to reallocate burdens of proof by labeling as affirmative defenses at least some elements of the crimes now defined in their statutes. But there are obviously constitutional limits beyond which the States may not go in this regard.\n\nId. at 210, 97 S. Ct. at 2327 (emphasis added). The Court did not, however, attempt to define very precisely where those limits would be drawn. By way of obvious example rooted in the Court's prior precedent, it noted that the legislatures of the States cannot declare an individual guilty or presumptively guilty of a crime, and neither can they command that the finding of an indictment, or mere proof of the identity of the accused, should create a presumption of all the facts essential to guilt. Id. (citing cases).\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nThe Court next went to considerable lengths to distinguish Mullaney. \"Mullaney surely held that a State must prove every ingredient of an offense beyond a reasonable doubt, and that it may not shift the burden of proof to the defendant by presuming that ingredient upon proof of the other elements of the offense.\" Id. at 215, 97 S. Ct. at 2329. But the Court rejected a broader reading. The key distinction between the two cases, said the Court, was in the way the States defined the crimes:\n\nPremeditation was not within (Maine's) definition of murder; but malice, in the sense of the absence of provocation, was part of the definition of that crime. Yet malice, i. e., lack of provocation, was presumed and could be rebutted by the defendant only by proving that he acted with heat of passion upon sudden provocation. In Mullaney we held that however traditional this mode of proceeding might have been, it is contrary to the Due Process Clause as construed in Winship.\n\nAs we have explained, nothing was presumed or implied against Patterson; and his conviction is not invalid under any of our prior cases.\n\nId. at 215-16, 97 S. Ct. at 2329-30.\n\n4. Where the States are left after Winship, Mullaney, and Patterson.-These three recent Supreme Court cases indicate that, in applying the due process clause to the States' definition of criminal offenses and allocation of burdens of persuasion, there are both procedural fairness and substantive fairness components to the analysis. Winship makes clear that the States are bound by some of the deeply ingrained traditions of substantive fairness from our common-law heritage; one central substantive value is that no person should be convicted when there remains a reasonable doubt as to the truth of any of the essential elements included in the definition of the crime. To protect this particular substantive value, the Winship Court confirmed the constitutional necessity of a strict rule of procedural due process: the Constitution requires that the burden be placed upon the prosecution to prove beyond reasonable doubt every element (or ultimate fact) included in the definition of a crime. There are certainly other such substantive values protected by the Constitution: \"A normative principle for protecting the \"innocent' must take into account not only the certainty with which facts are established but also the selection of facts to be proved.\" Jeffries \u0026 Stephan, Defenses, Presumptions, and Burden of Proof in the Criminal Law, 88 Yale L.J. 1325, 1347 (1979).\n\nThe States, however, are not completely proscribed from modifying through their legislatures and courts their criminal laws to reflect changing notions and policies: they may, within substantive fairness limits whose boundaries are not yet precisely marked, redefine the elements of their criminal offenses. In so doing, they may wish to reallocate burdens of persuasion on those issues that they remove from the definition of the crime, thereby converting those issues from elements into matters of mitigation or enhancement. Yet the States must also adhere tightly to procedural due process requirements in order to protect adequately the substantive values with which they may not tamper-such as the rule that conviction may be had only when the essential elements included in the definition of the crime have been established to a high degree of accuracy. Mullaney and Patterson both articulate one variation on the procedural due process requirement that the Winship Court found necessary to protect this particular substantive value: despite a State's characterization of an issue as being an \"affirmative defense,\" the State may not place the burden of persuasion on that issue upon the defendant if the truth of the \"defense\" would necessarily negate an essential element of the crime charged.\n\nFurthermore, Mullaney and Patterson indicate that the federal courts will take a functional approach in determining what elements comprise a given crime under the State's law. In Mullaney, for example, the Court pierced the Maine Supreme Court's categorization of its law as providing for a unitary crime of felonious homicide that did not require a showing of specific criminal intent to convict. As the Patterson Court reminded us in discussing the Maine statute that was at issue in Mullaney, though Maine claimed that malice was not an essential element in this crime of felonious homicide, malice in the sense of a lack of provocation was the sole difference between two very different degrees of punishment; this being true, the prosecution could not rely on a presumption to establish this essential lack of provocation merely because the other elements of the crime had been established.\n\nIn determining whether a State has met these demands of procedural due process, the federal courts must satisfy themselves that a State's characterization of its laws does not, by refusing to address logical inconsistencies, functionally operate to place the burden of persuasion on an essential element upon the defendant. At bottom, a unanimous Court in Mullaney was not persuaded that Maine really intended to punish all intentional killers equally, giving no regard to the degree of their specific criminal intent until each given defendant tried to establish his lesser culpability because of a less blameworthy degree of specific criminal intent. In Patterson, however, a majority\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e of the Court was persuaded that this was exactly what New York intended to do: \"It is plain enough that if the intentional killing is shown, (New York) intends to deal with the defendant as a murderer unless he demonstrates the mitigating circumstances.\" Patterson, 432 U.S. at 206, 97 S. Ct. at 2325 (emphasis added).\n\nImplicating as it does complex considerations of federalism and substantive fairness, this functional analysis of the elements of States' crimes requires close calls. Though the proper balance in applying this functional analysis is difficult to achieve, the framework within which that analysis is to be applied is consistent with our Nation's traditions of federalism, while still protecting adequately important values of substantive fairness to individual defendants.\n\nAs we noted above, it is true that within substantive fairness limits which have not yet been clearly charted, the States may in good faith modify their criminal laws. Winship clearly establishes one particular limit on the States' power to allocate burdens of persuasion: once the States have defined their crimes, the burden must be placed on the prosecution to persuade the factfinder that every element of the crime has been proved beyond reasonable doubt. Beyond this, however, Mullaney and Patterson do not tell us the location of any substantive limits on the States' powers to define their crimes or allocate burdens of persuasion thereunder, but instead tell us only where those limits are not.\n\nThe Patterson Court was confronted with the argument that Mullaney established a new substantive rule, to the effect that it would be unconstitutional in all circumstances-as a substantive matter-to place upon a defendant the burden of persuasion on the issue of whether the killing was the result of provocation.\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e But the Patterson Court refused to read Mullaney as having announced such a substantive rule. After Patterson, Mullaney can only be read as a case in which the Supreme Court did not believe that the State's procedures afforded adequate regard for the substantive value that prompted the procedural rule announced in Winship : once the Mullaney Court had determined that malice (lack of provocation) was an essential element of the crime of murder under Maine law, it was led to conclude that forcing the defendant to carry the burden of persuasion on that issue violated procedural due process, for it made all too likely a defendant's conviction when there was still a reasonable doubt about the truth of an essential element of the crime. Thus, Patterson reads Mullaney as being no more than a procedural due process case that protects an established substantive value.\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nHaving re-read Mullaney in this manner, the Patterson Court was able to assume\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e that there was no substantive violation in convicting of murder a defendant who, as likely as not, was acting under extreme emotional disturbance. That assumption made, the only remaining task was to see if New York afforded adequate procedural respect to the substantive value that the Winship Court sought to protect. Once the Patterson Court determined that the absence of extreme emotional disturbance was not an essential element of the crime, it was led to conclude that New York's procedural practice was constitutional: the truth of the defense did not necessarily negate any element of the crime. The prosecution was still being required to prove every essential element of the crime, and there was no violation of fundamental fairness in inflicting this punishment upon proof of only those elements. The particular substantive value that prompted Winship -i. e., the requirement that the essential elements of the crime be established with a high degree of accuracy before a conviction could be obtained-was therefore not offended, or even implicated, by placing the burden of persuasion on the extreme emotional disturbance issue on the defendant.\n\nBut Patterson leaves open the possibility that there are substantive fairness values in addition to the one that prompted the procedural rule of Winship. For example, a plausible argument could be made that it would violate other substantive values if a State refused to recognize the doctrine of self-defense, either as a matter in mitigation that was not inconsistent with any element of the crime, or as a matter whose absence was an essential element of the crime. The Supreme Court has not reached the question of whether such a practice would run afoul of substantive fairness guarantees in the Constitution regardless of how the State's law was structured, and neither need we.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e\n\nBut, as Mullaney makes clear, the federal courts in guarding the federal constitutional rights of state-court defendants invoking their protection, will employ a functional analysis in determining whether the State has truly excluded the absence of the excuse or justification from the definition of the crime, as in Patterson, or has actually and functionally incorporated it as an essential element of the crime, as in Mullaney. The adjustment must truly be made in the elements necessary to constitute the crime; merely labeling an issue as an \"affirmative defense\" in mitigation or exoneration does not, as Mullaney makes clear, end the analysis.\n\nC. The Absence of Self-Defense as an Element of Voluntary Manslaughter Under Georgia Law\n\n1. The Georgia Statutes.-Naturally enough, we must begin our determination of the essential elements of the crime of voluntary manslaughter under Georgia law with the pronouncements of the Georgia Legislature. Voluntary manslaughter is defined in the statutes by reference to the crime of malice murder. Malice murder is defined as follows:\n\nA person commits murder when he unlawfully and with malice aforethought, either express or implied, causes the death of another human being. Express malice is that deliberate intention unlawfully to take away the life of a fellow creature, which is manifested by external circumstances capable of proof. Malice shall be implied where no considerable provocation appears, and where all the circumstances of the killing show an abandoned and malignant heart.\n\nGa.Code Ann. ยง 26-1101(a) (1978) (emphasis added).\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e Thus, on the simplest level of analysis-an independent exercise in statutory construction-murder would appear to have three elements. First, the defendant must cause the death of another human being. But this homicide is not murder unless there are two other elements: the killing must be unlawful, and it must be with malice aforethought. It is, of course, possible that a defendant's acts may give rise to other sorts of criminal liability even though both elements in addition to the killing are not present; but without a combination of homicide, unlawfulness, and malice, there can be no murder.\n\nVoluntary manslaughter, in turn, is defined as follows:\n\nA person commits voluntary manslaughter when he causes the death of another human being, under circumstances which would otherwise be murder, if he acts solely as the result of a sudden, violent, and irresistible passion resulting from serious provocation sufficient to excite such passion in a reasonable person ; however, if there should have been an interval between the provocation and the killing sufficient for the voice of reason and humanity to be heard, of which the jury in all cases shall be the judge, the killing shall be attributed to deliberate revenge and be punished as murder. A person convicted of voluntary manslaughter shall be punished by imprisonment for not less than one nor more than 20 years.\n\nGa.Code Ann. ยง 26-1102 (1978) (emphasis added).\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e The crimes of voluntary manslaughter and malice murder thus require the identical causation element when the statutes speak of \"causing the death of another human being.\" But the voluntary manslaughter definition also incorporates part of the murder statute by reference: the killing must be \"under circumstances which would otherwise be murder.\" The difference from murder is that the act must be \"solely as the result of a sudden, violent, and irresistible passion resulting from serious provocation sufficient to excite such passion in a reasonable person,\" rather than being the result of malice. This \"hot blood\" requirement, as it is sometimes called, is inconsistent with malice. Because of the \"under circumstances which would otherwise be murder\" language, the requirement of unlawfulness is imported into the definition of manslaughter from the definition of murder.\n\nSelf-defense is specifically addressed in chapter 26-9 of the Georgia statutes. Ga.Code Ann. ยง 26-901 (1978) provides: \"The fact that a person's conduct is justified is a defense to prosecution for any crime based on that conduct.\"\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e Section 26-901(a) then refers to section 26-902, which in turn specifies the circumstances in which self-defense is justified.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e Section 26-903 contains analogous provisions regarding defense of habitat.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nSection 26-907 puts a gloss on these statutory requirements for the use of justification as a defense: \"A defense based upon any of the provisions of this Chapter is an affirmative defense.\" Ga.Code Ann. ยง 26-907 (1978). The notes from the committee responsible for revising the Georgia Criminal Code in 1968 make only this cryptic comment about section 26-907: \"The purpose of this section is to make it clear that affirmative defenses are not merely technical ones which, if not raised at a particular stage of the proceeding, will be considered as waived. They are defenses which go to the merits of the case.\" Criminal Law Study Committee, Committee Notes to Chapter 26-9, reprinted at 10 Ga.Code Ann. 126 (1978). Although this statement is not altogether unambiguous, it would seem that by contrasting the justification defenses to those technical \"defenses\" that are waived if not presented at a particular stage of the proceeding-e. g., venue-the advisory committee meant only that the justification issues were not procedural technicalities, but substantive defenses \"which go to the merits.\" Nowhere in this chapter, nor at any place in the study committee's notes thereto, is there a hint as to the intended allocation of the burden of persuasion on these defenses.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e Thus, the statute's characterization of self-defense as an \"affirmative defense\" tells us nothing about the burden of persuasion on the self-defense issue once that issue is properly raised.\n\nThe meaning of the \"unlawful(ness)\" language in the murder statute-and, by reference, in the voluntary manslaughter statute-is nowhere explicitly set out in the statutes themselves. The study committee, however, in discussing changes wrought in prior law by the 1968 recodification, made the following comment:\n\nThus, the Criminal Code makes no change in the definitional classification of homicide in Georgia (i. e., murder, voluntary manslaughter, and involuntary manslaughter). It omits the essentially meaningless clauses of the former law: \"by a person of sound memory and discretion\" and \"in the peace of the State.\" The latter is an historic anomaly which need no longer be retained. Since murder is defined as being unlawful and since an insane person's rights and liabilities are elsewhere established, (Chapter 26-7), the retention of the clause relating to sanity does not appear necessary.\n\nId. at 160 (emphasis added). This makes clear that the word \"unlawfully\" is not intended as a meaningless redundancy in the murder statute (and by reference, the voluntary manslaughter statute). The killing is not unlawful because it is murder; rather, part of the reason that the killing is murder is because it is unlawful.\n\nNeither would it make sense to construe \"unlawfully\" to refer to acts that are unlawful under some other criminal statute. Section 26-1101(b) defines the crime of felony murder-causing the death of another, irrespective of malice, during the commission of a felony-as an offense separate and distinct from malice murder.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e Deaths caused without specific criminal intent, but in the commission of an unlawful act other than a felony (e. g., striking a pedestrian while driving drunk) are punishable as involuntary manslaughter under section 26-1103(a).\n\nThe only sensible way to interpret the unlawfulness requirement of the malice murder statute, then, is to read it to mean \"unjustified and unexcused.\" Justification and excuse, in turn, are defined more particularly elsewhere in the criminal code-a perfectly logical practice from an organizational standpoint, since justification and excuse are defenses to many crimes other than the various forms of homicide. For example, chapters 26-6 and 26-7 deal with various forms of excuse that may, in appropriate circumstances, be grounds for treating as lawful certain conduct that would otherwise be unlawful.\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e Similarly, chapter 26-9, discussed above, deals with various forms of justification, of which self-defense is one.\n\nAs an abstract matter of statutory construction, then, we would hold that the most reasonable interpretation of this statute is that unlawfulness-in the sense of absence of excuse or justification-is an essential element of the crime of murder. By incorporation, it is also made an essential element of the crime of voluntary manslaughter. Because unlawfulness is an essential element of the crime, the State would have to shoulder the burden of persuasion (but not necessarily the burden of production) in seeking to negate justification or excuse.\n\nBut we are not the ultimate expositors of Georgia law, see Mullaney v. Wilbur, 421 U.S. at 691, 95 S. Ct. at 1886, and the analysis above must be tempered with any qualifications read into that language by the Georgia courts, who may find subtleties in the legislative pronouncements that limit their sweep. If the state courts have narrowed the unlawfulness requirement of the statute, they have thereby narrowed the elements that the State must prove in order to obtain a constitutionally valid conviction.\n\n2. The Georgia courts' construction of the unlawfulness requirement.-The State has not cited, and our own research does not reveal, any cases from the Georgia Supreme Court that directly interpret the unlawfulness requirement in either the Georgia malice murder statute or the voluntary manslaughter statute. However, the State does not contend that unlawfulness is not an essential element of both crimes. In arguing in its brief that the district court was mistaken in holding that the prosecution was relieved of its burden of proof on all elements of the crime (an argument with which we agree-see part I-E of this opinion, supra ), the State virtually concedes the trial court's error under Georgia law in placing upon Holloway the burden of persuasion on self-defense:\n\nThe flaw in the lower court's conclusion that when an individual pleads self-defense he thereby relieves the state of any burden of proof is that a claim of self-defense admits the killing, but says that it was done without any criminal intent. Furthermore, the trial court's instructions clearly placed the burden of proof upon the state, and even when an accused puts forth evidence of self-defense, the burden is upon the state to prove beyond reasonable doubt that there was no excuse, justification or mitigation, since the state still has to show unlawfulness even though an accused puts forth evidence of self-defense, and thus the state is still not relieved of the burden of proving unlawfulness.\n\nBrief for Respondent-Appellant at 25 (emphasis added).\n\nThere is also some case law that tends to indicate that the Georgia courts view unlawfulness as an essential element of the two crimes, and that they view unlawfulness and self-defense as mutually inconsistent alternatives. In Henderson v. State, 234 Ga. 827, 832(3), 218 S.E.2d 612, 616-17 (1975), the Georgia Supreme Court reversed a conviction because the trial court had charged that the burden was on the defendant to establish beyond a reasonable doubt that he had acted in self-defense. The Georgia Supreme Court cited Mullaney as the sole authority for the proposition that this instruction was erroneous. The Georgia Supreme Court has never overruled or amplified upon Henderson, and neither has it ever explained why, if it applies at all to Georgia law on self-defense, Mullaney would not apply with equal force to instructions that merely shift the burden to the defendant to prove self-defense by a preponderance. Henderson, to turn upon Mullaney, must be based on an implicit acknowledgement that unlawfulness-in the sense of an absence of self-defense-is an essential element of the crime of murder. Later opinions of the Georgia Supreme Court, however, do not allude to the unlawfulness requirement. See, e. g., Holloway v. McElroy, 241 Ga. 400, 401(2), 245 S.E.2d 658, 659 (1978).\n\nIn Johnson v. State, 137 Ga.App. 740, 224 S.E.2d 859, vacated, 237 Ga. 276, 227 S.E.2d 345, on remand, 140 Ga.App. 343, 231 S.E.2d 75 (1976), the Georgia Court of Appeals examined the relationship between unlawfulness and self-defense under Georgia law in a thoughtful, persuasively reasoned opinion. Johnson had been accused of murder, but was found guilty of voluntary manslaughter; his sole contention was that he had acted in self-defense. The facts of the Johnson case, then, exactly parallel those of the case at bar on this issue. After reviewing the United States Supreme Court's holdings in Winship and Mullaney, the court of appeals began its analysis of Georgia law by noting that\n\n(w)hile Mullaney rejects formalism and requires a pragmatic analysis that looks to the operation of the law, we must be ultimately guided by the substantive requirements of our penal statutes as they relate to the proffered defense.\n\nId. at 741, 224 S.E.2d at 861. Construing the Georgia murder and manslaughter statutes, the court then squarely held that unlawfulness is an essential element of both the crimes of malice murder and voluntary manslaughter. Id. Continuing to an analysis of the relationship between self-defense and unlawfulness, the court held:\n\nThe provisions of Code ยง 26-902 provide that the use of force in defense of self is justified under certain circumstances. Where these circumstances are found to exist, no penal consequences attach and the actor's conduct is therefore lawful. See Hayes v. State, 11 Ga.App. 371(1), 75 S.E. 523 ((1912)); Walters v. State, 90 Ga.App. 360, 365, 83 S.E.2d 48 ((1954)). We thus conclude that a finding of self-defense negates the essential element of unlawfulness within the meaning of our murder and manslaughter statutes. For the State to meet its required burden of proving the element of unlawfulness, it must therefore prove beyond a reasonable doubt the absence of justification.\n\nId. at 741, 224 S.E.2d at 861 (emphasis added). The court reasoned that this holding was compelled by Mullaney despite the Georgia Supreme Court's prior decisions that placed upon the defendant the burden of persuasion on self-defense. It interpreted Mullaney to hold that \"the determination of whether the State or the defendant has the burden of persuasion with respect to a particular defense depends upon whether the truth of that defense negates an essential element of the crime charged.\" Id. at 743, 224 S.E.2d at 862. The court further concluded that while section 26-907 denominated self-defense as an affirmative defense, this did no more than place the burden of production on the defendant. To support this conclusion, the court cited the definitional section of the criminal code, section 26-401, which provides in part: \"With respect to any affirmative defense authorized in this title, unless the State's evidence raises the issue invoking the alleged defense, the defendant to raise the issue, must present evidence thereon.\" Ga.Code Ann. ยง 26-401(a) (1978), cited at 137 Ga. App. 745, 224 S.E.2d 863. Based on this analysis, the court of appeals reversed Johnson's conviction.\n\nIn a one-sentence opinion, the Georgia Supreme Court vacated the court of appeals' holding and remanded for reconsideration in light of State v. Moore, 237 Ga. 269, 227 S.E.2d 241 (1976), which came out after the court of appeals' decision in Johnson. State v. Moore announced a major shift in Georgia's criminal jurisprudence. Moore was convicted of robbery under jury instructions that placed upon him the burden of persuasion to establish his asserted defense, coercion. The court of appeals, relying on Mullaney, reversed the conviction, Moore v. State, 137 Ga.App. 735, 736(2), 224 S.E.2d 856, 857-58 (1976), but was itself reversed by the Georgia Supreme Court. Citing no authority, the Georgia Supreme Court announced this rule:\n\nAfter careful consideration this court has concluded that the trial courts would welcome a simple straightforward rule which can be applied easily and would lessen the possibility of error. Also we are of the opinion that the desirability of uniformity in jury instructions outweighs adherence to a rule which is of doubtful value, probably makes overly nice legal distinctions which are difficult for many juries to follow, and so far as can be discerned has little, if any, influence upon verdicts reached in particular criminal cases. Therefore we hold that henceforth charges which place any burden of persuasion upon the defendant in criminal cases shall not be given and such charges will be deemed erroneous and subject to reversal, absent harmless and invited error. We point out that usual charges on presumptions are not considered \"burden shifting\" charges, nor are charges that such presumptions may be rebutted. We reiterate that this conclusion is prospective and applies only to cases tried after the final date of this decision (June 29, 1976).\n\n237 Ga. at 270(1), 227 S.E.2d at 242 (emphasis added).\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e Significantly, Moore was decided before the United States Supreme Court's decision in Hankerson v. North Carolina, 432 U.S. 233, 97 S. Ct. 2339, 53 L. Ed. 2d 306 (1977), which held that the rule announced in Mullaney was to be given full retroactive effect. Since the Moore case,\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e Georgia appellate courts have taken the position that trial courts should charge that the prosecution must prove beyond a reasonable doubt that the defendant's claim of self-defense is not true. E. g., Marshall v. State, 143 Ga.App. 731(2), 240 S.E.2d 176, 178 (1977); Brooks v. State, 143 Ga.App. 523, 524(4), 239 S.E.2d 207, 208 (1977). Nonetheless, failure to give such a charge has not always been treated as reversible error if the appellate court has determined that the instructions as a whole did not shift the burden of persuasion on the self-defense issue. E. g., Walston v. State, 245 Ga. 572, 573(2), 266 S.E.2d 185, 187 (1980); Maddox v. State, 241 Ga. 398, 399(1), 245 S.E.2d 654, 655 (1978); McClenton v. State, 150 Ga.App. 573, 574(3), 258 S.E.2d 168, 170 (1979).\n\nIt is unclear exactly to what extent the Georgia Supreme Court expressed disapproval of the court of appeals' holding in Johnson. The most logical explanation, however, is that the Georgia Supreme Court did not disagree with the court of appeals' analysis of Georgia law, but merely declined to apply that logic retroactively. This was indeed the interpretation taken by the court of appeals on remand, see 140 Ga.App. 343, 231 S.E.2d 75. In denying a motion for rehearing after its decision on remand, the court of appeals found that Ivan V. v. City of New York, 407 U.S. 203, 92 S. Ct. 1951, 32 L. Ed. 2d 659 (1972)(holding Winship retroactive), had been interpreted by the Georgia Supreme Court to allow a prospective-only rule in Moore ; the court of appeals felt itself bound by the Georgia Supreme Court's decision on the retroactivity of Mullaney. Of course, the validity of the Georgia Supreme Court's conclusion that Moore could be completely limited to prospective effect must be regarded as seriously eroded, if not completely undercut, by the United States Supreme Court's holding Hankerson. Insofar as Moore was compelled by Mullaney, those principles in Moore must also be retroactive.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e Because Hankerson holds that Mullaney must be given full retroactive effect, and because the court of appeals relied on Mullaney for its conclusion in Johnson, it would appear that the court of appeals was correct the first time.\n\nAt any rate, the action of the Georgia Supreme Court in vacating Johnson does not persuade us that the Georgia Supreme Court disagreed with the interpretation placed on Georgia law by the court of appeals. Though vacated, the Johnson decision's logic seems to us compelling evidence of how the Georgia courts would interpret the interrelationship between their unlawfulness requirement and self-defense were they to deal directly with those issues in a context in which it was clear that there were no problems of retroactivity.\u003cspan class=\"fnref\"\u003e47\u003c/span\u003e We agree with the conclusion of the district court below that, in the absence of explicitly contradictory precedent from the Georgia Supreme Court, the federal courts are bound by Johnson's logic, if not directly by its holding. See 474 F. Supp. at 1369 n.5.\n\nThe finding that the crime of voluntary manslaughter includes as an essential element the ingredient of unlawfulness does not, however, end our inquiry. It may be that the State, through either its legislature or its courts, has construed unlawfulness to be not inconsistent with self-defense-effectively reading out of the definition of the crime that portion of the meaning of unlawfulness that would be inconsistent with self-defense. We believe that the Georgia legislature and courts have done exactly that with a comparable excuse-insanity-that, on its face, would seem to be inconsistent with the requirement of unlawfulness. By sharp contrast to the Georgia Legislature's definition of justification by virtue of self-defense, the statutory provision on excuse by virtue of insanity, as definitively interpreted by the Georgia courts, explicitly allocates to the defendant the burden of persuasion, by means of a presumption, on the issue of his insanity. But there is more: the Georgia courts have explicitly held that the absence of insanity is not an element of various crimes under Georgia law. See Ga.Code Ann. ยง 26-606 (1978); Moses v. State, 245 Ga. 180, 263 S.E.2d 916 (1980); State v. Avery, 237 Ga. 865, 230 S.E.2d 301 (1976); Grace v. Hopper, 234 Ga. 669, 217 S.E.2d 267 (1975), cert. denied, 423 U.S. 1066, 96 S. Ct. 806, 46 L. Ed. 2d 657 (1976); Johnson v. State, 235 Ga. 486, 220 S.E.2d 448 (1975). See also Leland v. Oregon, 343 U.S. 790, 72 S. Ct. 1002, 96 L. Ed. 1302 (1952); Grace v. Hopper, 566 F.2d 507, 510 n.6 (5th Cir.), cert. denied, 439 U.S. 844, 99 S. Ct. 139, 58 L. Ed. 2d 144 (1978).\n\nThe State has not cited, and our research has not found, any case from the Georgia courts which holds that the absence of self-defense has similarly been read out of the requirement of unlawfulness. On this issue, as on the initial question of whether unlawfulness is an essential element of the crime, we are persuaded by the logic of the Johnson case from the Georgia Court of Appeals. It is not dispositive that the Georgia courts characterized self-defense as an affirmative defense on which the burden of persuasion may be placed upon the defendant. The Maine Supreme Court did even more than that in Mullaney, to no avail. But we need not go so far as to employ the functional analysis that the Mullaney Court applied to Maine law,\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e for the Georgia courts have never purported to read the absence of self-defense out of the requirement that the killing be unlawful. They have done nothing more than to assert, without dealing explicitly with the unlawfulness requirement, that Patterson allows the prosecution to avoid having to disprove any and all affirmative defenses. Patterson does not announce so simple a rule.\n\nD. Our Conclusions Upon Consideration of Georgia Law\n\nIn short, in this case, unlike Patterson, it is emphatically not \"plain enough that if the intentional killing is shown, the State intends to deal with the defendant as a murderer unless he demonstrates the mitigating circumstances\"-here, the absence of unlawfulness. Rather, it seems to us that unlawfulness-including the absence of self-defense-is an essential element of the offense. If Georgia includes within its murder and manslaughter laws unlawfulness as an element of those crimes, while at the same time Georgia courts require the defendant to prove lawfulness by virtue of self-defense, that construction makes the statutes' operation run contrary to the Constitution under Winship and Mullaney. Had the Georgia Supreme Court plainly construed its murder and manslaughter statutes so as to delete the unlawfulness requirement as an element of the crime, at least insofar as unlawfulness is inconsistent with the justification of self-defense, or had the Georgia legislature drafted its statutes to the same end, we might be compelled to a different result. But for us to interpret their actions to date as having already done so would be straining beyond any reasonable bounds of legislative or judicial interpretation.\n\nHaving decided that the absence of self-defense is an essential element of the crime of voluntary manslaughter, and that the trial court's charge operated to place the burden of persuasion on Holloway on this issue, we are compelled by Winship to conclude that Holloway's conviction was in violation of his due process rights under the United States Constitution. We agree also with the district court that this was patently not harmless error beyond reasonable doubt, see Chapman v. California, 386 U.S. 18, 87 S. Ct. 824, 17 L. Ed. 2d 705 (1967); Wynn v. Mahoney, 600 F.2d 448, 450 (4th Cir.), cert. denied, 444 U.S. 950, 100 S. Ct. 423, 62 L. Ed. 2d 320 (1979). This leads us in turn to the conclusion that Holloway's further confinement by the State would be contrary to the Constitution and laws of the United States; hence we affirm that portion of the district court's decision that is based upon the trial court's allocation of the burden of persuasion on the self-defense issue.\n\nWe emphasize the relatively narrow impact of our holding. We do not hold that the prosecution must prove the absence of self-defense even in those cases in which the issue is not properly raised; as Mullaney makes clear, 421 U.S. at 701 n.28, 95 S. Ct. at 1891 n.28, the States may require the defendant to produce \"some evidence\" to put the mitigating circumstances in issue. See also Hankerson v. North Carolina, 432 U.S. at 237 n.3, 97 S. Ct. at 2342 n.3. \"(P)lacing the burden of production on the defendant is an economical way to screen out issues extraneous to the case at hand and thus to promote efficient litigation.\" Jeffries \u0026 Stephan, supra, 88 Yale L.J. at 1334. We make no judgment regarding the constitutionality of placing upon the defendant the burden of persuasion on defenses other than self-defense, as that defense is defined by Georgia law. Neither does our holding necessarily include within its scope crimes other than voluntary manslaughter as defined by Georgia law. Because the Georgia Supreme Court in State v. Moore disapproved all jury instructions that act to place any burden of persuasion on the defendant (with some few exceptions, e. g., insanity), the practical effect of our holding is even further limited. And, of course, since our decision is based upon Georgia's definition of its crimes, a change in those definitions-by either the Georgia courts or the Georgia Legislature-might dictate a different result in future cases. But it implies no disrespect to principles of federalism to hold the prosecution to strict proof of those essential elements that are included in the definition of a crime under the State's own laws. That is what we do today.\n\nFurther, we do not reach the question of whether substantive notions of fundamental fairness, similar to those prompting the Supreme Court's decision in Winship, would prohibit the States from placing upon the defendant the burden of persuasion on self-defense.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e\n\nIII. THE SUFFICIENCY OF THE EVIDENCE\n\nHolloway urges in this court, as he has urged in the Georgia Court of Appeals, Georgia Supreme Court, and finally with success in the district court below, that there is insufficient evidence to support his conviction on the charge of voluntary manslaughter. For his conviction to have been valid under Georgia's substantive criminal law, the prosecution must have proved beyond reasonable doubt all of the elements of the crime of voluntary manslaughter. We have determined from our reading of Georgia law, see parts II-B and II-C of this opinion, that those elements are: (1) an intentional killing, which was (2) unlawful (in this context, not in self-defense) and (3) prompted solely as the result of a sudden, violent, and irresistible passion resulting from serious provocation sufficient to excite such passion in a reasonable person.\n\nBefore proceeding to our review of the evidence, however, we must first determine the proper standard of review to be used.\n\nA. The Standard of Review\n\nThe State argues that we should not apply the standard of review announced by the Supreme Court in Jackson v. Virginia, 443 U.S. 307, 99 S. Ct. 2781, 61 L. Ed. 2d 560 (1979). That standard, the State urges, should not be given \"retroactive effect\"-i. e., it should not be applied in reviewing the sufficiency of the evidence supporting state-court convictions obtained prior to the date when Jackson was announced. The State urges that we should instead apply the standard that was used prior to Jackson. Under that standard, sometimes called the Thompson \"no evidence\" standard, federal habeas corpus relief was not available on sufficiency of the evidence grounds except in those cases in which there was a total absence of evidence to support a conviction. See, e. g., Thompson v. City of Louisville, 362 U.S. 199, 80 S. Ct. 624, 4 L. Ed. 2d 654 (1960); Eleuterio v. Wainwright, 587 F.2d 194, 196 (5th Cir.) (per curiam), cert. denied, 443 U.S. 915, 61 L. Ed. 2d 879, 99 S. Ct. 3106 (1979);\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e Anderson v. Maggio, 555 F.2d 447, 452-53 (5th Cir. 1977).\n\nThe Jackson Court concluded that the \"no evidence\" rule was insufficient to protect the constitutional guarantees recognized in In re Winship, 397 U.S. 358, 90 S. Ct. 1068, 25 L. Ed. 2d 368 (1970). It therefore announced a new standard of review to be applied by federal courts in evaluating the sufficiency of the evidence supporting those state-court convictions challenged under the habeas statute, 28 U.S.C. ยง 2254 (1976):\n\nWe hold that in a challenge to a state criminal conviction brought under 28 U.S.C. ยง 2254-if the settled procedural prerequisites for such a claim have been otherwise satisfied-the applicant is entitled to habeas corpus relief if it is found that upon the record evidence adduced at the trial no rational trier of fact could have found proof of guilt beyond a reasonable doubt.\n\n443 U.S. at 324, 99 S. Ct. at 2792. In footnote, the Court directed that this standard be applied with explicit reference to the substantive elements of the criminal offense as defined by state law. Id. at 324 n. 16, 99 S. Ct. at 2792 n. 16.\n\nSeveral previous opinions of this court have raised the question of whether Jackson should be applied in reviewing convictions obtained before the date on which Jackson was announced. In those cases, however, we have found the evidence sufficient to support the conviction even if the stricter Jackson standard of review was applied; thus, we have reserved the question for a case in which the application of the Jackson standard made a difference in the outcome. See Sims v. Hopper, 603 F.2d 581, 582 (5th Cir. 1979); Pate v. Wainwright, 607 F.2d 669, 670 (5th Cir. 1979); Tyler v. Phelps, 622 F.2d 172, 178 (5th Cir. 1980); Preacher v. Estelle, 626 F.2d 1222, 1224-25 (5th Cir. 1980). Cf. Parrish v. Wainwright, 614 F.2d 1028, 1029 (5th Cir. 1980) (assuming arguendo that the Jackson standard should be used in reviewing the sufficiency of the evidence to sustain a parole revocation). But see Reese v. Wainwright, 600 F.2d 1085, 1089-90 (5th Cir.), cert. denied, 444 U.S. 983, 100 S. Ct. 487, 62 L. Ed. 2d 410 (1979) (applying Jackson standard without reservation to pre-Jackson conviction); Llewellyn v. Stynchcombe, 609 F.2d 194, 196 (5th Cir. 1980) (same).\n\nWe think that the State fundamentally misconceives what the Jackson Court was doing. Jackson announces a new standard of collateral review.\u003cspan class=\"fnref\"\u003e51\u003c/span\u003e It does not affect in any way the obligations of the prosecutors or state trial courts: the standard of proof to which they are bound is that laid down in Winship, and that standard was made fully retroactive in Ivan V. v. City of New York, 407 U.S. 203, 92 S. Ct. 1951, 32 L. Ed. 2d 659 (1972) (per curiam). Jackson, in contrast to, for example, Winship, does not lay down a new rule that is to govern proceedings in the criminal trial courts. The Jackson standard requires nothing new of the States; nor does it say that they have erred in their past practices. As the Jackson Court pointed out,\n\napplication of the Thompson standard to assess the validity of a criminal conviction after Winship could lead to absurdly unjust results.... Such results would be wholly faithless to the constitutional rationale of Winship.\n\n443 U.S. at 320 n. 14, 99 S. Ct. at 2790 n. 14. Were we to limit our use of the Jackson standard to only those convictions obtained after the date Jackson was handed down, we would intentionally be \"wholly faithless to the constitutional rationale of Winship \" in order to reach an \"absurdly unjust result\" by recognizing only the right protected by the Thompson standard-the right to be free from a \"wholly arbitrary deprivation of liberty\" if the conviction is \"based upon a record wholly devoid of any relevant evidence of a crucial element of the offense.\" Id. at 314, 99 S. Ct. at 2786. We decline to adopt such a perverse approach.\n\nMoreover, other cases from this circuit and elsewhere indicate that a decision of the Supreme Court which announces a new standard of collateral review on habeas corpus should be applied to convictions obtained before the new standard of collateral review was announced.\u003cspan class=\"fnref\"\u003e52\u003c/span\u003e Significantly, the State has not cited, and our research has not revealed, any case from any other circuit in which the question of Jackson's \"retroactivity\" is even mentioned-though one would expect that in the few months since Jackson was announced the bulk of the convictions reviewed by those courts on habeas would have been obtained before Jackson.\n\nBut we need not speculate further as to whether the Jackson standard should be applied to convictions obtained before the date of that decision. The Supreme Court has indicated by its own actions the answer to that question. In Pilon v. Bordenkircher, 444 U.S. 1, 100 S. Ct. 7, 62 L. Ed. 2d 1 (1979) (per curiam), the Court granted certiorari in a case in which the Sixth Circuit Court of Appeals had applied the Thompson \"no evidence\" standard just a few months before Jackson was announced. The Court vacated and remanded, saying:\n\nIt is thus beyond dispute that the District Court and Court of Appeals applied an incorrect and inadequate constitutional test in resolving the petitioner's due process claim that his state-court conviction rested on insufficient evidence. Although it is quite possible that the evidence against the petitioner will survive a challenge under the correct constitutional standard, he is entitled to have his application for habeas corpus considered under that standard.\n\nId. at 2, 100 S. Ct. at 8 (emphasis added).\n\nSimilarly, in Moore v. Duckworth, 443 U.S. 713, 99 S. Ct. 3088, 61 L. Ed. 2d 865 (1979) (per curiam), the Court granted certiorari to consider a decision of the Seventh Circuit in which the Thompson standard had been used. The Court, citing Jackson, agreed with the petitioner that the circuit court erred in using the Thompson standard. The Court did not, however, remand for reconsideration in light of the Jackson decision, because it was clear from the record that there was sufficient evidence even under the stricter Jackson standard. Accordingly, the Court affirmed the action of the circuit and district courts below in denying habeas relief. See also Leonard M. v. California, 443 U.S. 914, 99 S. Ct. 3105, 61 L. Ed. 2d 878 (1979) (vacating 85 Cal.App.3d 887, 149 Cal.Rptr. 791 (1978), and remanding for further consideration in light of Jackson ); Blake v. Thompson, 444 U.S. 806, 100 S. Ct. 27, 62 L. Ed. 2d 19 (1979) (vacating 595 F.2d 1222 (6th Cir. 1979), and remanding for further consideration in light of Jackson ); 47 Tenn.L.Rev. 456, 474-75 \u0026 n. 91 (1980).\n\nWe thus think it absolutely clear that this court and the federal district courts are bound to apply the Jackson standard in reviewing under 28 U.S.C. ยง 2254 the sufficiency of the evidence supporting state-court convictions-regardless of whether that state-court conviction was obtained before or after the date of the Jackson decision. We so hold.\u003cspan class=\"fnref\"\u003e53\u003c/span\u003e\n\nB. Sufficiency of the Evidence Under the Jackson Standard\n\nThe district court concluded after applying the Jackson standard that the evidence supporting Holloway's conviction was insufficient. Though we cannot say that there is \"no evidence\" under the former standard of review dictated by Thompson, our independent review of all the record evidence under the Jackson standard leads us to agree with the district court.\u003cspan class=\"fnref\"\u003e54\u003c/span\u003e\n\nWe begin by noting that we are bound, under the Jackson standard, to consider all of the evidence in the light most favorable to the prosecution. This is appropriate because it gives \"full play to the responsibility of the trier of fact fairly to resolve conflicts in the testimony, to weigh the evidence, and to draw reasonable inferences from basic facts to ultimate facts.\" 443 U.S. at 319, 99 S. Ct. at 2789.\n\nOne element of the crime is unlawfulness-here, the absence of self-defense. We conclude, after reviewing the evidence in the light most favorable to the prosecution, that no reasonable factfinder could have found the absence of self-defense beyond a reasonable doubt based on the record evidence adduced at trial. There was overwhelming evidence supporting Holloway's contention of self-defense. The circumstantial evidence\u003cspan class=\"fnref\"\u003e55\u003c/span\u003e cited by the State as supporting a finding of the absence of self-defense consists of discrepancies between Holloway's story as told to the interviewing officers and his testimony at trial on three points: the trajectory of the bullet, the ownership of the spread, and the location of the jacket. As Judge Deen said in dissent in Holloway's direct appeal:\n\nThe inconsistencies in (Holloway's) statements concerning the dead man's coat, the location of the spread and the position of the deceased when he was shot go to his credibility and the jury was within its prerogative to disbelieve him on these points and to find that the coat was being worn at the time of death, that the spread came from the truck and that (Holloway) was not on his knees when the shot was fired ....\n\n137 Ga.App. at 129, 222 S.E.2d at 902. But under the particular circumstances of this case, we do not believe that any rational factfinder could take these inconsistencies as a sufficient base upon which to pile inference on top of inference to reach beyond reasonable doubt the ultimate conclusion that the shooting was not in self-defense. We reach this decision after giving due regard to the fact that, under Jackson, we are to consider circumstantial as well as direct evidence, and that we are to assume that the jury drew all reasonable inferences from basic facts to ultimate facts.\u003cspan class=\"fnref\"\u003e56\u003c/span\u003e Because we hold that there was insufficient evidence on this element of the crime, we need not address the sufficiency of the evidence on the other elements.\n\nIn sum, we hold, based on our independent examination of all the record evidence adduced at trial, and viewing that evidence in the light most favorable to the prosecution, that no rational trier of fact could have found proof beyond reasonable doubt that the killing was not in self-defense. Because we agree with the district court that there was insufficient evidence under the Jackson standard on an essential element of the crime of which Holloway was convicted, we affirm that portion of the district court's decision to grant habeas relief which was based on sufficiency of the evidence grounds.\n\nIV. CONCLUSION\n\nAccordingly, for the reasons set out in parts II and III of this opinion, the judgment of the district court is\n\nAFFIRMED.\n\n\u003cspan class=\"fn\"\u003e1. To keep a long opinion from becoming even longer, we omit discussion of some extremely tenuous circumstantial evidence relevant only to the prosecution's hypothesis of malice murder-a theory that the jury rejected in its implied acquittal on that charge. Insofar as any of this evidence may be peripherally relevant to the voluntary manslaughter charge, we take account of it in our review of the sufficiency of the evidence generally. See part III of this opinion, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Baker testified that when he arrived on the scene, M. W. Holloway was standing in the yard. When he asked Holloway what the problem was, Holloway replied, \"I've had trouble with this man.\" Martin found Crumbley's body lying face up inside the doorway of the Holloway house, with his feet outside on the porch. Martin asked Holloway what had happened, and Holloway told him the following tale: Crumbley had driven up to the house and asked Holloway if he could get out to look at a tractor in the yard that he had talked to Holloway's father about buying; Holloway told Crumbley he could get out and look. Crumbley got out of his truck and started toward the tractor, but turned and said to Holloway, \"You're the ยง . o. b. that tried to kill me awhile back at the river, at the fishpond.\" Holloway replied, \"No, you are mistaken, you get back in the truck and leave.\" Then Crumbley pushed Holloway, after which Crumbley took off his hat and jacket and laid them on the porch rail. Crumbley then hit Holloway again, and Holloway went into the house and got the pistol. Holloway started back out, and Crumbley \"came on him with a knife,\" at which point Holloway shot him. Holloway fired two or three times.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Martin testified that after Holloway related the story set out above, Martin examined Crumbley's body. He found a bullet wound in Crumbley's left shoulder and a one-inch cut on Crumbley's forehead, with no blood visible around the cut. Dirt and grass were inside the back of Crumbley's trousers. Three other witnesses also testified that there was little or no blood around the forehead cut. One, however, acknowledged that while the cut was of a type that would probably have bled if inflicted while Crumbley was alive, it was possible that the heavy rains that day had washed most of the blood off of the area around the forehead wound. Martin also testified that he took into his possession Crumbley's jacket, which was lying on the rail of the porch; a hunting knife, which he found on the floor just inside the door of the house; a scabbard, which he found in the yard; and a .38 caliber revolver containing three spent cartridges, which Holloway produced voluntarily at Martin's request. On cross-examination, Martin testified that it had been raining all day, and that Holloway was muddy when Martin arrived on the scene. Holloway's shirt and undershirt were torn open, and his stomach was scratched. Martin found signs of a scuffle outside the house-particularly, a broken flower pot, part of which was on the porch and part of which was in the yard. Martin took a blood sample from the ground near the rear of the pickup truck on the driver's side; lab analysis showed that the blood was canine blood, which was consistent with the fact that the Holloways' dog had a fresh cut on his foot. Martin admitted that he found no evidence of a struggle or a shooting in the area of the truck.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Kate Crumbley, the widow of the deceased, identified a spread that she claimed she and her husband had used to cover the seat of their pickup truck; she said that when the truck was returned to her after the shooting, the spread was not in the truck. Suzanne Black, the Crumbley's housekeeper, also testified that she had ridden in the Crumbley pickup on the day before the shooting, at which time the spread was lying on the pickup's seat. Mrs. Crumbley also testified that, to her knowledge, her husband did not own a hunting knife and was not carrying one when he left the house on the day of the shooting. She further testified that in her conversation with Holloway a few days after his father had been sent to the Central State Hospital in Milledgeville, Georgia, Holloway had threatened to kill anybody who interfered with his father or his father's property. Holloway was carrying a gun and a hunting knife at the time of that conversation, and appeared dangerous; she further testified that her husband knew that Holloway regularly carried a gun, but that she never gave the matter a second thought.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. A microanalyst from the Georgia State Crime Laboratory testified that laboratory tests he had run on the gun he was given by the police and on the bullet removed from Crumbley's body confirmed that the pistol had been used in the shooting. He also testified that the carbon staining and burns on Crumbley's jacket indicated that the muzzle of the gun was either pressed against the jacket or no more than one inch away when the fatal shot was fired. The jury also heard from Dr. Fred Thompson, who conducted the autopsy on Crumbley's body. Dr. Thompson testified that he had determined from the autopsy that Crumbley died from a gunshot wound to the left shoulder. The bullet entered Crumbley's chest, went through the left lung, the aorta, and the right lung, remaining in the right chest space.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. Baker also testified outside the presence of the jury for the purpose of determining the voluntariness of Holloway's statements during interrogation by Baker and the other officers. This issue is not before us on appeal. We consider only his testimony before the jury, of course, in reviewing the sufficiency of the evidence.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Baker testified that Holloway told him the following story in an interview on the day of the shooting: Holloway was staying at his father's house when Crumbley drove up. Crumbley yelled to Holloway, asking if he could come up to the porch, and Holloway allowed him to do so. Crumbley said that he had talked to Holloway's father about buying a tractor and asked Holloway if he could look at the tractor. Then Crumbley said to Holloway, \"You're the ยง . o. b. that tried to kill me back in December.\" Holloway replied, \"Well, I don't know what you mean, what you are talking about.\" Crumbley said, \"You know what I mean; you tried to kill me at the fishpond last December,\" and Holloway denied having tried to shoot Crumbley. Crumbley became very angry, and a fight started between the two men on the back porch. They fell onto the ground and stayed on the ground just a second, after which Holloway jumped up and ran into the house. When Crumbley followed him into the house, Holloway saw a knife in his hand. Crumbley grabbed Holloway and reared back with the knife, and Holloway was afraid he was going to be cut. At this point Holloway grabbed a gun from a table by the door. Holloway said that he was on his knees when he fired. He could not say how many times he fired, but he believed it was more than one time. He said he fired in an upward position. After Crumbley fell on his face, Holloway turned the body over, listened for a heartbeat, and then took off Crumbley's jacket to check for wounds. Then he got in his car, drove to a store, and called the sheriff's office.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. After relating the narration set out above and in footnote 7, supra, Baker testified that he hadn't really gone into any detail with Holloway at that first interview on the day of the shooting. But when Baker confronted Holloway with his earlier statement that Crumbley took off his own jacket, Holloway thought for a moment and then said that Crumbley took his jacket off when he came into the house. He told Baker that he did not see the knife until Crumbley started to come into the house.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. At this interview, according to Baker's testimony, Holloway gave the same story up until the point when the two men began wrestling on the ground. This time, Holloway said that they exchanged blows, which he had not mentioned in the interview on the previous day. Baker asked again about the jacket, and Holloway said that after Crumbley came in and after they had fought some more, Crumbley took off the jacket. Holloway said that Crumbley had the knife in his right hand and had grabbed Holloway with his left hand, when Holloway reached over for the gun and shot Crumbley. Baker asked Holloway to demonstrate the exact positions that they had been in; Holloway demonstrated by getting on his knees, with Baker's left hand on Holloway's shirt and his right hand holding the knife above Holloway. Holloway was looking up from his knees when he got the gun and began firing.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Baker testified that he had tried to determine the ownership of the hunting knife, but had had no success. He had nothing to link it to either Holloway or Crumbley, nor to anyone else, but he had never tried to check the knife for fingerprints. He also testified that when he had visited the house on April 9, 1975, with Sheriff Benson, the district attorney, Holloway's lawyer, and Holloway, he found the spread lying inside the door on the floor. On cross-examination, Baker was unable to confirm or deny whether in an adjoining bedroom, there was nothing on the bed except a wrinkled electric blanket. He testified that he had often found that witnesses who have no reason to lie often tell widely conflicting versions of the same episode. He agreed that while he, as a trained man, might remember clearly the details of a traumatic episode, that is not the \"normal routine\" for \"rank and file people\" who have no special training. Baker also testified that he had ordered the ballistics tests run to confirm that the gun given to Deputy Martin by Holloway was the gun used in the shooting. He had found no evidence indicating that the shooting had taken place in or near the truck. He also testified that he had sent to the state crime lab a box containing a \"hair sample\" that had been removed from a hammer found in the truck; lab tests indicated that the sample was plant material, rather than hair. The crime lab's analysis of a blood sample from Crumbley's body indicated that Crumbley had had a blood alcohol content of .12% at the time of his death. Finally, Baker confirmed having found evidence of a scuffle around the porch area.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. On direct examination, Holloway gave the following explanation of the prelude to the fight: On March 18, 1975, he was living in his father's house, looking out for his father's property. He was expecting a visit from an insurance adjuster, and when he heard someone drive up, he stopped reading his newspaper and went to see who it was. He saw someone get out of a pickup truck. The driver of the truck staggered, slammed the door of the truck, and began walking toward the house. Holloway testified that at this time, he did not recognize Crumbley, since he had only seen Crumbley twice before in his life. Crumbley reached a tree about 15 to 20 feet from the porch. He stopped there and looked toward the tool shed at the Holloways' dog, who was barking. Holloway stood at the window watching Crumbley for about a minute, and then walked to the door. When Crumbley saw Holloway, Crumbley walked through the rain to the porch. The two men chatted about the tractor for a moment, and then Crumbley turned to Holloway and said, \"You tried to shoot me not long ago down at the fishpond.\" Holloway replied, \"Did I?\" Crumbley said, \"Yes,\" and asked, \"Do you carry a gun all the time?\" Holloway replied that he did not, that he only carried a gun when he left the house. Holloway asked, \"Did you come out here to see about the tractor or did you come out here to see about the episode that happened at the fishpond?\" Crumbley didn't answer this question, but asked if Holloway had a gun on him at that moment, and Holloway answered that he did not.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. In explaining the fishpond incident, Holloway testified that he had been asked by his brother James to see if someone was fishing without permission at night. He walked toward the pond with his rifle, yelling a warning that he was going to start shooting if he didn't get an answer from whoever was fishing at the pond. He then found his nephew, Wilburn Musslewhite, fishing along with Musslewhite's brother-in-law. The men argued a moment, and then Holloway turned to the water, raised his gun, and emptied it into the water. Someone began shouting at the far end of the pond, and Musslewhite said, \"That's Uncle Joe, that's Uncle Joe.\" Holloway turned and went back to the house, where he watched as the intruders left. Holloway said that while Musslewhite had permission to fish at the pond, he was supposed to ask Holloway's permission to fish at night.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Holloway testified that at first he couldn't tell what Crumbley had in his hand as Crumbley was entering the house, but that he could tell it was a knife when Crumbley reached down to push aside a rocking chair that Holloway had thrown in his path.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. According to Holloway's testimony, after he told Crumbley that he was not carrying a gun, Crumbley grabbed him and pushed his back over the banister of the porch, trying to bend his back over the banister. Holloway testified that his back would not bend because he has no hipjoint. Holloway struck Crumbley, knocking him off, and they fell down inside the porch rail and began wrestling. Crumbley hit Holloway a couple of times, and Holloway kicked Crumbley in the head and tried to get loose. Holloway finally went down the steps, catching Crumbley by the leg and dragging him down after Holloway. They were then on the ground wrestling and exchanging blows for \"maybe a minute or longer, I don't know exactly how long.\" Holloway got loose and ran back up on the porch. When Holloway reached the porch, Crumbley grabbed him by the belt and they began wrestling again. They again fell off the porch, and began rolling through the mud and water on the ground while hitting each other. At one point while Holloway was on the ground, Crumbley grabbed him by the legs and held them up in the air; Holloway yelled, \"That is my crippled leg,\" to which Crumbley replied, \"I'll pull it off and beat your brains out with it.\" Holloway called for the family dog, and when the dog ran up, Crumbley kicked and slapped at it. Holloway kicked Crumbley against the side of the house, and then pulled him back into a puddle of water while calling for the dog; but the dog wouldn't bite. Holloway shoved Crumbley against the ground and went back up the steps into the house. When he got inside the door, he turned to see Crumbley coming up the steps. There was a platform rocker just inside the door, and Holloway threw it in front of the door and said, \"Joe, don't come in this house.\" He saw that Crumbley had something in his hand. Holloway turned to a table next to the door, and picked up with his left hand the .38 caliber revolver that was lying there under a pair of pajamas. He turned back to the door to find that Crumbley had shoved the chair out of the way and was coming through the door. Holloway could plainly see the knife in Crumbley's right hand. He reached up and caught Crumbley's wrist, but Crumbley turned the knife toward Holloway's stomach. Holloway hit Crumbley in the stomach as hard as he could and tried to push Crumbley back out the door, but his foot slipped and he went down on one knee. Crumbley was standing just inside the door threatening Holloway with the knife. Holloway pointed the gun in Crumbley's direction and pulled the trigger. The gun was so close that the powder burned Holloway's eye. He didn't recall how many times he shot, but when he began shooting, he jerked down Crumbley's right hand. He felt Crumbley jerk, relax, and pull away from him. Crumbley staggered back to the doorway, where he dropped the knife, knelt down on his knees, and then fell over on his face. As a result of their scuffle, Holloway had been cut on his chest with the point of the knife, and his shirt and undershirt were torn open. There were cuts on his stomach and chest and blood around his shirt and undershirt; photographs were introduced to document these assertions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Holloway testified that immediately after the shots were fired, he watched Crumbley for a moment, and then tried to see if there was anything he could do for Crumbley. He turned Crumbley over and pulled off his jacket. He pulled up Crumbley's shirt, and rolled Crumbley over and looked at his back, and then at his face. Holloway didn't notice a gunshot wound or blood anywhere on the body. He felt for a pulse and listened for a heartbeat, and also put his ear to Crumbley's mouth to see if he could detect breathing. Crumbley's breath smelled stale. At this point, according to Holloway's testimony, he got sick to his stomach from looking at the body and had the dry heaves. He walked into another room and got a spread off a bed on which he had been sleeping. He testified that he previously had found the spread \"in some stuff that Daddy had, and I put it over this electric blanket because the blanket wouldn't work unless I had something over it, and that was the bed that I slept on.\" Evidently, he covered Crumbley's body with the spread. Then, he drove to a nearby store and telephoned the sheriff's office. He then drove back to the house and waited on the porch until Deputy Sheriff Martin arrived. When he saw Martin drive up, he stepped into the yard and waived Martin over.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See part II-A of this opinion, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The Georgia Supreme Court's opinion reads in full: We granted Holloway's application to review the denial of his habeas corpus petition in order to consider a \"burden-shifting\" charge on justification. Holloway was indicted for murder, but was convicted of voluntary manslaughter. The Court of Appeals affirmed. 137 Ga.App. 124, 222 S.E.2d 898 (1975). His defense at trial was self-defense. The charge now attacked was neither objected to at trial nor enumerated as error on appeal. Two issues are presented here: (1) Has the question been waived by the failure to raise it on direct appeal, and (2) if not, did the charge place an unconstitutional burden of proof on the defendant? We answer both questions in the negative and affirm. 1. The state urges that since Holloway did not raise the burden-shifting issue on his appeal, he has waived the right to raise it on habeas corpus. See, e.g., Shoemake v. Whitlock, 226 Ga. 771, 177 S.E.2d 677 (1970). However, Holloway's trial occurred on May 1, 1975, prior to our decision in State v. Moore, 237 Ga. 269, 227 S.E.2d 241 (1976), where we held that this court in the future would not approve burden-shifting charges. Holloway's trial was also prior to Mullaney v. Wilbur, 421 U.S. 684, 95 S. Ct. 1881, 44 L. Ed. 2d 508 (1975), which the Supreme Court, in Hankerson v. North Carolina, 432 U.S. 233, 97 S. Ct. 2339, 53 L. Ed. 2d 306 (1977), held was fully retroactive. Since the issue involves law developed after Holloway's trial, we do not consider the issue waived and reach its merits. See generally Parrish v. Hopper, 238 Ga. 468, 233 S.E.2d 161 (1977) (Hall, J., concurring specially). 2. The charges on justification complained of by Holloway are clearly not erroneous. Patterson v. New York, 432 U.S. 197, 97 S. Ct. 2319, 53 L. Ed. 2d 281 (1977); Chandle v. State, 230 Ga. 574, 198 S.E.2d 289 (1973). The trial court charged that the defendant had no burden of proving anything until the state has \"shown to a moral and reasonable certainty and beyond a reasonable doubt that the defendant is the intentional slayer ...\" The burden placed on the defendant to excuse the homicide is an affirmative defense. Code Ann. ยง 26-907. The defendant is not required to negate any of the elements of the crime which the state must prove to convict. Under Patterson, supra, where the defendant is required to carry the burden of persuasion of an affirmative defense, there is no denial of due process. The habeas trial court correctly denied Holloway's petition. 241 Ga. 400, 401, 245 S.E.2d 658, 659 (1978) (footnotes omitted; ellipsis in original).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. See text accompanying notes 22 \u0026 23 infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. Indeed, the district court specifically incorporated that dissent into its own opinion and republished it in full as an appendix thereto. See 474 F. Supp. at 1365, 1370-73.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. Ga.Code Ann. ยง 68A-902.1(b)(3) (1980). We note, however, that this statutory presumption has to do with driving while intoxicated. In our evaluation of the sufficiency of the evidence, see infra part III-B, we of course consider the evidence as to the percentage of alcohol in Crumbley's blood; we do not, however, rely on this statutory presumption.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. Both the original manuscript of the district court's opinion and the reported version in the Federal Supplement use the word \"disprove\" in place of our bracketed \"prove\" in the quote above. It is absolutely clear from the context, however, that the district court intended to say that the prosecution must prove the absence of self-defense-i.e., disprove the presence of self-defense-beyond a reasonable doubt. It would be nonsense to say that the State must always disprove the absence of-i.e., prove the presence of-self-defense. No party has urged such a bizarre construction, and we construe the district court's language as having the meaning expressed in our modified quotation above.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. See note 17 supra \u0026 accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Cf. Tyler v. Phelps, 622 F.2d 172, 176-78 (5th Cir. 1980) (counsel's lack of knowledge that trial court's burden-shifting charge violated due process constitutes adequate \"cause\" within the meaning of Sykes); Berrier v. Egeler, 583 F.2d 515 (6th Cir.), cert. denied, 439 U.S. 955, 99 S. Ct. 354, 58 L. Ed. 2d 347 (1978) (magnitude of error under Michigan law when burden on self-defense impermissibly placed on defendant rose to level of plain error; thus no Sykes bar on habeas). But see Cole v. Stevenson, 620 F.2d 1055 (4th Cir. 1980) (finding Sykes bar). See also Hankerson v. North Carolina, 432 U.S. 233, 244 n.8, 97 S. Ct. 2339, 2345 n.8, 53 L. Ed. 2d 306 (1977) (suggesting that States can insulate past convictions from burden-shifting allegations via contemporaneous objection rule). See generally Project, Ninth Annual Review of Criminal Procedure: United States Supreme Court and Courts of Appeal 1978-1979, 68 Geo.L.J. 279, 636-37 (1979). For an excellent discussion of constitutional jurisprudence in this area, and the relationship between Mullaney/Patterson and Sykes, see Cole v. Stevenson, 620 F.2d 1055, 1063-74 (4th Cir. 1980) (Murnaghan, J., dissenting).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. See parts II-B \u0026 II-C of this opinion, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Compare Mason v. Balkcom, 487 F. Supp. 554 (M.D.Ga.), appeal docketed, No. 80-7344 (5th Cir. 1980).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. By \"general intent\" we mean intent in the sense that a person intends the consequences of his voluntary physical actions-e. g., an \"intentional\" shooting in self-defense. The contrasting term is \"specific criminal intent,\" which refers to a state of mind that is thought culpable-e. g., premeditation as part of murder, or \"hot blood\" as part of manslaughter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. We are not confronted with, and express no opinion as to, the question of whether a State could, consistent with the Constitution, require that a defendant admit general intent in order to assert a claim of self-defense. Because Holloway voluntarily asserted that the shooting was intentional, that issue is not before us.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Though we would gladly avoid making unnecessary constitutional decisions, we cannot avoid answering both questions merely by addressing the sufficiency of the evidence question first. Obviously, before we can determine whether there is sufficient evidence on each essential element of the crime, we must decide exactly what elements the State must prove in order to obtain a constitutionally valid conviction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The charge is set out in somewhat more detail in the district court's opinion, 474 F. Supp. at 1365-66.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. See part II-B -4 of this opinion, infra ; see also note 49 infra \u0026 accompanying text.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. Justice White's majority opinion was joined in by Chief Justice Burger and Justices Stewart, Blackmun, and Stevens. Justice Powell, who wrote for a unanimous Court in Mullaney, led Justices Brennan and Marshall in dissent. Justice Rehnquist did not participate in Patterson.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Indeed, the argument was phrased even more broadly than this: Mullaney's holding, it is argued, is that the State may not permit the blameworthiness of an act or the severity of punishment authorized for its commission to depend on the presence or absence of an identified fact without assuming the burden of proving the presence or absence of that fact, as the case may be, beyond a reasonable doubt. In our view, the Mullaney holding should not be so broadly read. Patterson, 432 U.S. at 214-15, 97 S. Ct. at 2329. The Patterson Court also put to rest the arguments of some commentators that Mullaney required the prosecution to prove beyond a reasonable doubt any fact affecting the degree of criminal culpability. Id. at 214 n.15, 97 S. Ct. 2329 n.15.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. The Mullaney doctrine, as re-read by the Patterson Court, may represent the outer limits of the rational use of procedural due process to promote substantive justice. Our notions of substantive fairness have only limited correlation to the allocation of burdens of persuasion: It would be unconscionable, as Justice Powell suggests (in his dissent in Patterson ), to base liability for murder on proof of \"mere physical contact\" between defendant and deceased. And Professor Underwood is undoubtably correct in objecting to the imposition of major felony sanctions following proof of a \"trivial assault.\" (Underwood, The Thumb on the Scales of Justice: Burdens of Persuasion in Criminal Cases, 86 Yale L.J. 1229, 1324 (1977).) Both hypotheticals depict an enormous disparity between the penalties authorized by law and any proven basis for subjecting an individual citizen to censure and punishment. We are all outraged if penal liability is imposed without any element of blameworthiness or if sanctions bear no proportional relationship to the seriousness of the crime. The trouble lies in the unspoken assumption that excessive punishment is somehow a product of shifting the burden of proof. In fact, use of a burden-shifting defense or presumption does not necessarily result in excessive punishment, nor does excessive punishment necessarily involve reallocation of the burden of proof. Thus, to forbid burden-shifting devices in order to reduce disparity between proven fault and authorized penalties is a non sequitur. In point of fact, a constitutional stricture against shifting the burden of proof would not prevent the injustice of unwarranted or disproportionate criminal punishment. It would withdraw from legislative choice certain procedural options, but it would not address the real evil of substantive disproportionality in the assignment of criminal penalties. Jeffries \u0026 Stephan, supra, 88 Yale L.J. at 1357-58 (emphasis in original). That part of Mullaney which survives Patterson -i. e., the rule that a State may not place upon the defendant the burden of persuasion on an issue that, if established, would necessarily negate an element of the crime-promotes one substantive value recognized in Winship in that it decreases the margin of error within which individual elements of a crime might erroneously be found to exist. But a broader reading of Mullaney would not address the real but different evils that are postulated in the \"horror stories\" of Justice Powell and Professor Underwood. Various commentators have criticized the Patterson Court for adopting a mechanical rule that exalts form over substance in analyzing state law. To some extent, this criticism is unfair. It fails to take into account that Patterson left intact the functional analysis applied by the Mullaney Court. Under that analysis, the federal courts are not bound to accept blindly a State's characterization of its own law. Instead, they look to see if the truth of an \"affirmative defense\" is logically inconsistent with the truth of an essential element of the crime, as the crime's elements are defined by the State. This means that the federal courts are not constrained by principles of federalism to ignore glaring non sequiturs in a State's characterization of its substantive criminal law. Yet to a considerable extent, the Mullaney doctrine, as it survives after Patterson, is fairly mechanical in its application. The Mullaney doctrine is one of procedural due process. The substantive value that it protects is that same value which prompted the Winship rule-i. e., it offends our notions of fundamental fairness and is inconsistent with our shared conception of \"innocence\" to allow conviction when the trier of fact retains a reasonable doubt as to the truth of any element of the crime. The reason that the essential elements of the crime are deserving of such great emphasis is that the polity, through its legislatures and courts, has determined those ultimate facts to be the sine qua non of criminal culpability; punishment is unjust unless at least those facts have been established, and therefore the degree of accuracy with which those facts are established is one component of substantive justice. The procedural rules of Winship and Mullaney protect that substantive value by reducing the margin of error within which the trier of fact must operate. But this is all that we can ask of procedural rules-i. e., that they improve accuracy by reducing margins of error. If a mechanical application of these procedural rules cannot bring about complete substantive justice, that does not mean that there is some flaw in the procedural rules themselves, or that they should be applied more vigorously or creatively. It means instead that there are components of substantive justice other than the accuracy with which the trier of fact reaches its conclusions. To address the \"horror stories\" postulated by Professor Underwood and others, we must look to analogs-not derivatives-of the substantive value that prompted Winship and Mullaney. Procedural rules, such as those having to do with required degrees of persuasion and those allocating the risk of nonpersuasion, are ill-suited to the task of protecting those analogous values.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. \"In each instance of a murder conviction under the present law, New York will have proved beyond a reasonable doubt that the defendant has intentionally killed another person, an act which it is not disputed the State may constitutionally criminalize and punish.\" Patterson, 432 U.S. at 209, 97 S. Ct. at 2326 (emphasis added).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Because we announce no new substantive limit on the States' powers, we need not join the debate as to the proper constitutional peg from which such a substantive rule would be hung. Some commentators, such as Jeffries \u0026 Stephan, see note 33, supra, have looked to an eighth amendment proportionality analysis. But cf. Rummel v. Estelle, 445 U.S. 263, 100 S. Ct. 1133, 63 L. Ed. 2d 382 (1980) (application of Texas habitual criminal statute did not result in disproportionate punishment), and cases discussed therein. Justice Powell, in his dissent in Patterson, suggests that these limits may be found in the due process clause. Whatever the precise limits that may constrain the States, however, it is clear that they have substantial freedom in defining their crimes and allocating burdens of persuasion thereunder. States may establish various excuses and justifications as conditions for total or partial exoneration from criminal liability. They may, within the limits of substantive fairness imposed by the Constitution, take a number of different approaches in defining the elements of their crimes. They may wish to establish certain \"strict liability\" crimes, as for example when they wish to shift by fines an economic burden to the particular portion of the public that is responsible for a public danger; for these crimes, they may wish to limit sharply the number of excuses or justifications available to the defendant. Or, they may take a middle ground for other crimes, as did the State of New York with its murder statute, by offering exoneration in whole or part to defendants who can prove an excuse or justification that is not logically inconsistent with an essential element of the crime. Or, for certain crimes the States may take the opposite extreme from strict liability by incorporating as an essential element of the crime the absence of one or more excuses or justifications. Under Winship, as interpreted by Mullaney, this requires the prosecution to prove beyond reasonable doubt the absence of the particular excuse or justification.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. The remainder of ยง 26-1101 relates to the definition of the crime of felony murder, and the common punishment provision for malice and felony murder: (b) A person also commits the crime of murder when in the commission of a felony he causes the death of another human being, irrespective of malice. (c) A person convicted of murder shall be punished by death or by imprisonment for life. Ga.Code Ann. ยง 26-1101 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. There is a separate statutory provision defining involuntary manslaughter, Ga.Code Ann. ยง 26-1103 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. Other justifications besides self-defense include defense of habitation or property; entrapment; coercion; performance of lawful duties; reasonable discipline by parents of their minor children; and \"all instances which stand upon the same footing of reason and justice as those enumerated in this Chapter.\" See Ga.Code Ann. ยง 26-901(a)-(f) (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. Defense of person is defined as follows: (a) A person is justified in threatening or using force against another when and to the extent that he reasonably believes that such threat or force is necessary to defend himself or a third person against such other's imminent use of unlawful force; however, a person is justified in using force which is intended or likely to cause death or great bodily harm only if he reasonably believes that such force is necessary to prevent death or great bodily injury to himself or a third person, or the commission of a forcible felony. (b) A person is not justified in using force under the circumstances specified in paragraph (a) of this section if he: (1) initially provokes the use of force against himself with the intent to use such force as an excuse to inflict bodily harm upon the assailant; or (2) is attempting to commit, committing, or fleeing after the commission or attempted commission of a felony; or (3) was the aggressor or was engaged in a combat by agreement, unless he withdraws from the encounter and effectively communicates to such other person his intent to do so and the other notwithstanding continues or threatens to continue the use of unlawful force. Ga.Code Ann. ยง 26-902 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. Defense of habitation is defined as follows: A person is justified in threatening or using force against another when and to the extent that he reasonably believes that such threat or force is necessary to prevent or terminate such other's unlawful entry into or attack upon a habitation; however, he is justified in the use of force which is intended or likely to cause death or great bodily harm only if: (1) The entry is made or attempted in a violent and tumultuous manner and he reasonably believes that the entry is attempted or made for the purpose of assaulting, offering personal violence to any person dwelling or being therein and that such force is necessary to prevent the assault or offer of personal violence; or (2) He reasonably believes that the entry is made or attempted for the purpose of committing a felony therein and that such force is necessary to prevent the commission of the felony. Ga.Code Ann. ยง 26-903 (1978).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Compare Ga.Code Ann. ยง 26-606 (presumption of sanity); see also the discussion of insanity in part II-c -2 of this opinion, infra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. See note 36 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. Chapter 26-6, entitled \"Criminal Act and Mental State,\" contains sections on the general definition of criminality (violation of statute plus general criminal intent or criminal negligence), accident, wilfullness, general intent, specific intent, and sanity. Chapter 26-7, entitled \"Responsibility,\" contains sections on minimum age, insanity, delusional compulsion, intoxication, and mistake of fact.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Cf. United States v. Chiantese, 560 F.2d 1244 (5th Cir. 1977) (en banc) (announcing similar prospective-only rule for federal courts as part of this court's supervisory powers).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. In a murder case decided after Moore but before Hankerson, the Supreme Court of Georgia adhered to its statement in Moore that the new rule prohibiting burden-shifting charges was to be applied prospectively only. The trial court in Davis v. State, 237 Ga. 279, 227 S.E.2d 249 (1976), began by charging the jury that it should acquit if it found that the defendant had proved justification by a preponderance of the evidence. It continued its instructions, however, with a non sequitur: \"(W)hether or not ... justification has been proved by the preponderance of the evidence the burden of proof still rests on the State to prove beyond a reasonable doubt that the defense of justification does not exist before you would be authorized to convict of either of the offenses which I have defined for you.\" The supreme court held that while this sort of charge was prohibited in all trials conducted after the date on which Moore was decided, it was not error to give such a charge at the time Davis was tried. Id. at 280(1), 227 S.E.2d at 250.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Of course, insofar as Moore is not compelled by Mullaney, there is no reason that the rule announced in Moore must be considered retroactive. For those affirmative defenses that are not inconsistent with an essential element of the crime charged, the State may-but of course need not under the Constitution-allocate the burden of persuasion to the defendant, as Patterson makes clear. Nothing compels the State to make retroactive a change in its policy that is not required by the constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. The State could argue-but has not-that this is really what the Georgia Supreme Court did in affirming the denial of Holloway's state-court habeas petitioner. We think it would be fanciful to read this into the Georgia Supreme Court's opinion, which does not even mention the unlawfulness requirement of the statute. See note 17 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. For example, an argument could be made that the mental state required for self-defense is logically inconsistent with the requirement in the voluntary manslaughter definition that the defendant have acted solely as the result of a sudden, violent, and irresistible passion resulting from serious provocation sufficient to excite such passion in a reasonable person. Because of our conclusions on the unlawfulness issue, however, we need not reach this question.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. See Jeffries \u0026 Stephan, supra, 88 Yale L.J. at 1366-79; Note, The Constitutionality of Affirmative Defenses After Patterson v. New York, 78 Colum.L.Rev. 655, 672-73 (1978) (suggesting that self-defense is so critical to the concept of criminal responsibility and has such substantial effects on a defendant's liberty that to allow a conviction where reasonable doubt as to self-defense remains would be inconsistent with the fundamental notions of fairness that underlie the State's duty to establish criminal liability); Allen, The Restoration of In re Winship: A Comment on Burdens of Persuasion in Criminal Cases After Patterson v. New York, 76 Mich.L.Rev. 30, 52 \u0026 n. 80, 62 n. 115 (1977) (suggesting that after Patterson, Winship will not be used to disturb affirmative defenses except when a statute removes from the definition of a crime those elements that make the crime serious in the first place-such as the absence of self-defense). See also Patterson, 432 U.S. at 201-02, 97 S. Ct. at 2322 (recognizing that some state practices in defining laws and burdens of proof could be proscribed under the due process clause if they offend \"some principle of justice so rooted in the traditions and conscience of our people as to be ranked as fundamental\"); id. at 228 n. 13, 97 S. Ct. at 2336 n. 13 (Powell, J., dissenting) (suggesting that \"under other principles of due process jurisprudence, certain factors are so fundamental that a State could not, as a substantive matter, refrain from recognizing them so long as it chooses to punish given conduct as a crime\"); Jackson v. Virginia, 443 U.S. 307, 324 n. 16, 99 S. Ct. 2781, 2792 n. 16, 61 L. Ed. 2d 560 (1979) (rejecting contention that new standard for habeas review would intrude on power of states to define criminal offenses because Jackson standard must be applied with explicit reference to substantive elements of offense under state law; \"whether the State could constitutionally make the conduct at issue criminal at all is, of course, a distinct question\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. For reasons known only the Supreme Court, certiorari was denied in Eleuterio on the same day-July 2, 1979-that it issued its per curiam order in Moore v. Duckworth, 443 U.S. 713, 99 S. Ct. 3088, 61 L. Ed. 2d 865 (1979), discussed infra. See Project, Ninth Annual Review of Criminal Procedure: United States Supreme Court and Courts of Appeals 1978-1979, 68 Geo.L.J. 279, 629 \u0026 n. 2748 (1979). It is a familiar proposition, however, that a denial of certiorari indicates no views on the merits. See, e. g., Key v. Wise, 629 F.2d 1049, 1055 (5th Cir. 1980). See generally 16 C. Wright \u0026 A. Miller, Federal Practice and Procedure ยง 4004, at 510-12 (1977 \u0026 1980 Supp.), and cases cited therein.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e51. We note in passing that Jackson may have profound practical implications for state-court standards of direct review as well: can it make sense to apply on direct appeal some standard less strict than that announced in Jackson, with the inevitable result that the losing defendant-appellant will immediately seek the benefits of the Jackson standard on habeas? The Georgia appellate courts, we note, have begun applying the Jackson standard on direct as well as collateral appeal. See, e. g., Blair v. State, 245 Ga. 611, 613(3), 266 S.E.2d 214, 217 (1980) (citing and applying Jackson standard on direct appeal); Walston v. State, 245 Ga. 572, 573(1), 266 S.E.2d 185, 186-87 (1980) (same); Phelps v. State, 245 Ga. 338, 339, 265 S.E.2d 53, 55 (1980) (same); Balom v. State, 245 Ga. 367, 368, 265 S.E.2d 21, 22 (1980) (same). Cf. United States v. Booty, 621 F.2d 1291 (5th Cir. 1980), modified on petition for rehearing, 627 F.2d 762 (5th Cir. 1980) (suggesting that \"manifest miscarriage of justice\" standard may no longer be valid on direct appeal from federal conviction, but finding sufficient evidence even under a stricter standard). But cf. Chin v. United States, 622 F.2d 1090, 1093 n. 4 (2d Cir. 1980) (Jackson has no bearing on review of federal convictions). Of course, we are not concerned in this case with standards of review on direct appeal, state or federal; hence, we express no opinion on that matter, and reserve it for a case in which it is properly raised.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e52. For example, the Supreme Court held in Stone v. Powell, 428 U.S. 465, 481-82, 96 S. Ct. 3037, 3046, 49 L. Ed. 2d 1067 (1976), that \"where the State has provided an opportunity for full and fair litigation of a Fourth Amendment claim, the Constitution does not require that a state prisoner be granted federal habeas corpus relief on the ground that evidence obtained in an unconstitutional search or seizure was introduced at his trial.\" Stone thus affected the standards of habeas review even more drastically than Jackson, for it eliminated-rather than expanding the contours of-an entire class of claims. When presented with a claim that Stone should not be applied to bar habeas review of a conviction obtained before Stone, the Tenth Circuit noted that \"traditional notions of retroactivity appear inapplicable to the situation now confronting us.\" Chavez v. Rodriguez, 540 F.2d 500, 502 (10th Cir. 1976). The Chavez court continued: Nevertheless, in our opinion, it is clear that Stone is applicable to the instant habeas proceedings. Nowhere in its opinion does the Supreme Court limit Stone to prospective application only. Had the district court granted habeas corpus relief in this case, we would be compelled by Stone to reverse the district court's decision. Id. When presented with the same sort of claim, the Ninth Circuit pointed out: The holding of Stone v. Powell enunciated no new formulation of the exclusionary rule. It simply holds that the purposes of that rule are not served by allowing one who has fully and fairly litigated a Fourth Amendment claim in a state court to reargue the question in a federal habeas corpus action. No police conduct heretofore unlawful has been legitimated. Bracco v. Reed, 540 F.2d 1019, 1020 (9th Cir. 1976). The same analysis was applied in this circuit. See Jordan v. Estelle, 551 F.2d 612, 613 (5th Cir.), cert. denied, 434 U.S. 957, 98 S. Ct. 485, 54 L. Ed. 2d 316 (1977); George v. Blackwell, 537 F.2d 833, 834 (5th Cir. 1976) (assuming without discussion that new rule should be applied).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e53. Even were we to apply traditional retroactivity analysis to the standard announced in Jackson, we are confident that we would reach the same result. The considerations for determining whether a new constitutional doctrine should be applied retroactively are three: (1) the purpose to be served by the new standards; (2) the extent of reliance by law enforcement authorities on the old standards; and (3) the effect on the administration of justice of a retroactive application of the new standards. Brown v. Louisiana, 447 U.S. 323, 100 S. Ct. 2214, 2219, 65 L. Ed. 2d 159 (1980) (plurality opinion, but three dissenting Justices agreed with statement of standards, id. at -- , 100 S. Ct. at 2225). See also, e. g., Hankerson v. North Carolina, 432 U.S. 233, 97 S. Ct. 2339, 53 L. Ed. 2d 306 (1977); Ivan V. v. City of New York, 407 U.S. 203, 92 S. Ct. 1951, 32 L. Ed. 2d 659 (1972). Foremost among those factors is the purpose to be served by the new constitutional rule, Brown, -- - U.S. at -- , 100 S. Ct. at 2219, and controlling significance will be given to the measure of reliance and the impact on the administration of justice only when the purpose of the rule in question does not clearly favor either retroactivity or prospectivity, id. \"Where the major purpose of the new constitutional doctrine is to overcome an aspect of the criminal trial that substantially impairs its truth-finding function and so raises serious questions about the accuracy of guilty verdicts in past trials, the new rule has been given complete retroactive effect. Neither good-faith reliance by state or federal authorities on prior constitutional law or accepted practice, nor severe impact on the administration of justice has sufficed to require prospective application in these circumstances.\" Brown, -- - U.S. at -- , 100 S. Ct. at 2219-20 (quoting Williams v. United States, 401 U.S. 646, 653, 91 S. Ct. 1148, 1152, 28 L. Ed. 2d 388 (1971), and citing three cases in accord). As to the first factor, the Jackson Court itself noted: \"The question whether a defendant has been convicted upon inadequate evidence is central to the basic question of guilt or innocence.\" 443 U.S. at 307, 99 S. Ct. at 2782. Jackson is predicated on the need to protect adequately the values articulated in Winship, and Winship itself was declared to have full retroactive effect in Ivan V. v. City of New York, supra. The purpose served by the Jackson standard is a compelling one that clearly favors retroactive application. Like Winship and Mullaney, Jackson was designed \"to diminish the probability that an innocent person would be convicted and thus to overcome an aspect of a criminal trial that \"substantially impairs the truth-finding function.' \" Hankerson, 432 U.S. at 242, 97 S. Ct. at 2344. Further, there can have been no reasonable, good-faith reliance by law enforcement authorities, or by the States generally, on the continued existence of the Thompson standard. Jackson in no way adds anything new to the trial process that Winship had not already required. Finally, while it is difficult to predict with any degree of accuracy the effect on the administration of justice that is likely to follow from the standard of review dictated by Winship and announced in Jackson, we note that the new Jackson standard expands the contours of the prior habeas standard under Thompson, but it does not create an entirely new class of cases cognizable on federal habeas corpus. 443 U.S. at 332, 99 S. Ct. at 2796.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e54. The State contends that the district court misinterpreted Jackson to mean that it should satisfy itself of proof beyond reasonable doubt. Though such a standard of review, if actually used by the district court, would not comport with the rule announced in Jackson, see 443 U.S. at 318-19, 99 S. Ct. at 2789, and would in fact invade the province of the fact-finder at trial, whose responsibility it is to draw inferences and make credibility choices, it is by no means clear from the district court's opinion that it used such a standard. The court held: \"In this court's considered judgment this conviction for manslaughter was not supported by evidence that would rationally lead to the conclusion of guilt beyond a reasonable doubt.\" 474 F. Supp. at 1365. The court's \"considered judgment\" may have been with regard to the legal sufficiency of the evidence under the Jackson standard. In any event, because we are dealing with the sufficiency of the evidence as a matter of law, we are in equally as good a position to examine the record evidence on this issue as the court below-or any habeas court, for that matter. We have made our own independent examination of the record, and our conclusions therefrom are based not on our own sentiments about Holloway's guilt or innocence; rather, we have viewed the evidence in the light most favorable to the prosecution in reaching the conclusion that no rational trier of fact could have found guilt beyond reasonable doubt on every element of the crime of manslaughter. It thus does not matter if the district court misread the Jackson rule.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e55. The State conceded at oral argument that all of the evidence supporting the conviction was circumstantial in nature. Georgia law provides that \"(t)o warrant a conviction on circumstantial evidence, the proved facts shall not only be consistent with the hypothesis of guilt, but shall exclude every other reasonable hypothesis save that of the guilt of the accused.\" Ga.Code Ann. ยง 38-109 (1974). This stricter standard is not required by the Constitution, see Jackson, 443 U.S. at 326, 99 S. Ct. at 2793; nonetheless, a plausible argument could be made that the State would be denying a defendant of the process due him under state law were it to obtain a conviction that was based entirely on circumstantial evidence which did not meet this more rigorous standard. It is unclear to what degree such state-law protections should be incorporated into the federal courts' review of the sufficiency of the evidence when the state-law standards are more rigorous than federal constitutional requirements. Cf. Llewellyn v. Stynchcombe, 609 F.2d 194, 196 (5th Cir. 1980) (Georgia evidentiary requirement of independent corroboration of an accomplice's testimony in conspiracy trial not controlling upon collateral review by a federal court); Anderson v. Maggio, 555 F.2d 447, 451 (1977) (violation of state evidentiary rules justifies habeas relief only when evidence is \"material in the sense of a crucial, critical, highly significant factor\" and violation of state evidentiary rules results in a denial of fundamental fairness). Because of our disposition under the Jackson standard, we need not consider whether Holloway could demand the stricter standard of ยง 38-109 on federal habeas.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e56. We point out, however, that because the trial court instructed the jury that the burden of persuasion was on Holloway to establish that the killing was in self-defense, this particular jury could have based the conviction on a finding that it was exactly as likely as not that the killing was in self-defense. Therefore, the acts of this particular jury seem to us to have little probative value in determining whether any hypothetical jury could find proof beyond a reasonable doubt that the killing was not in self-defense. Similarly, at the time of Holloway's direct appeal, the Georgia appellate courts had not begun their practice of reviewing the sufficiency of the evidence under the Jackson standard, see note 51 supra. As the Jackson Court noted, \"(t)he fact that a state appellate court invoked the proper standard, however, though entitled to great weight, does not totally bar a properly presented claim of this type under ยง 2254.\" 443 U.S. at 322 n. 15, 99 S. Ct. at 2791 n. 15. Because the Georgia Court of Appeals did not have the benefit of Jackson when it acted on Holloway's direct appeal, its finding cannot even be \"entitled to great weight.\"\u003c/span\u003e\n\n",
    "body_length": 153745,
    "citedas": [
      "632 F.2d 605"
    ],
    "attorneys": "John W. Dunsmore, Asst. Atty. Gen., Atlanta, Ga., for respondent-appellant. Lawrence W. Roberts, Cordele, Ga., for petitioner-appellee.",
    "category": [
      "243",
      "36",
      "78"
    ],
    "judges": "Before Morgan, Anderson and Randall, Circuit Judges.",
    "citation_count": 89
  }
}
