{
  "id": "RJWxQ2YBTlTomsSBUmxY",
  "document": {
    "title": "HART v. COMMUNITY SCH. BD. OF BROOKLYN",
    "full_title": "Jeffrey HART, as a minor by his parent and next friend Doris Hart, et al., Plaintiffs, v. The COMMUNITY SCHOOL BOARD OF BROOKLYN, NEW YORK SCHOOL DISTRICT #21, a body corporate, et al., Defendants. The COMMUNITY SCHOOL BOARD OF BROOKLYN, NEW YORK SCHOOL DISTRICT #21, By its President and Member, Evelyn J. Aquila, et al., Defendants and Third-Party Plaintiffs, v. John V. LINDSAY, Mayor of the City of New York, et al., Third-Party Defendants",
    "jurisdiction": "E.D. New York",
    "date": "1974-01-28T00:00:00.000Z",
    "docket": "72 C 1041",
    "body": "WEINSTEIN, District Judge.\n\nThis first New York City school desegregation case to reach a federal court is a class action on behalf of children attending Coney Island's Mark Twain Junior High School, Number 239. Defendants are the Community School Board of Brooklyn, New York, School District Number 21, its members and the Chancellor of the Board of Education of the City of New York. Claiming that defendants are maintaining Mark Twain as an unconstitutionally racially segregated and underutilized school, plaintiffs seek declaratory and injunctive relief. The defendant Board and its members contend that segregation, if it exists, is due to housing patterns fostered and maintained by the city, state, and federal authorities who have been impleaded as third-party defendants.\n\nI. SUMMARY\n\nThe evidence shows that Mark Twain is segregated. That segregation was brought about partly through the ghettoization of the core of Coney Island. It is also due to deliberately zoning out of the school white middle-class children, enhancing segregative tendencies and leading to gross underutilization of Mark Twain's physical facilities.\n\nBoth the Community School Board of District 21 and responsible city educational officials recognize that they have the power to desegregate Mark Twain. They have refused to do so because they believe that such action might cause white children from District 21 to leave the public school system by moving to the suburbs, or by transferring to private schools, or by various forms of subterfuge, increasing segregation in the schools of District 21. On the local level there is fear -- substantially unjustified -- for the safety of white children who would be transferred to Mark Twain, concern over the teaching environment in a school where average reading and mathematics levels are much lower than those in any other school in the district; and some latent concern at the prospect of children attending a ghetto school.\n\nPublic officials responsible for new housing in the area have exacerbated the situation by applying housing policies mechanically, discouraging integrated occupation of new housing by child-rearing families of a variety of socio-economic levels. Persons now moving into the thousands of publicly assisted new apartments in this area are overwhelmingly black and Hispanic. The whites are primarily persons beyond child-bearing age. The result has been to insure that local schools zoned to the immediate neighborhood will be segregated.\n\nHousing and school patterns feed on each other. The segregated schools discourage middle class whites from moving into the area and the segregated housing patterns lead to segregated schools.\n\nNevertheless, this area of Coney Island remains fundamentally attractive as a place for all kinds of people to live and to raise and educate children. It is being almost completely rebuilt at a cost to the taxpayers of the city, state and nation of tens of millions of dollars.\n\nMark Twain, a school in excellent physical condition, is located in one of the potentially most attractive settings in the city. It is served by an experienced staff devoted to effective education and has a fine program. It can easily accommodate in safety, and educate well, hundreds of children from other parts of District 21 whose presence will eliminate unconstitutional segregation.\n\nIf ever there were a school and an area in New York City where desegregation could be accomplished with benefits to all the children who will attend the school and to the community, it is here. Educational, housing and other officials at all levels of government are required by the Constitution to cooperate in promptly eliminating the effects of segregation at Mark Twain Junior High School.\n\nThe history of Mark Twain can be characterized as reflecting neither de jure segregation -- required by law and custom, typical of southern and borderstate schools of the recent past -- nor de facto segregation, due to segregated neighborhoods arising from purely private decisions of residents without any interference by government, said to be typical of many metropolitan areas in the north. Rather, it reflects both these characteristics. Demographic trends have been accentuated by government choices. Decisions have been made knowing they would encourage segregation and failure to take available steps to reverse segregative tendencies have made a bad situation worse. Whether denominated de facto or de jure, the segregation of Mark Twain is unconstitutional.\n\nIn fairness to the devoted officials from every level of government involved in some way in education and housing, it must be noted that racism was not a significant factor in what occurred in Coney Island. There was no conspiracy to deprive minorities or to enhance the position of whites. On the contrary, those in education were and are devoted to improving the education of all the students in their charge; those in housing were and are dedicated to providing sound housing to all the people living in dreadful slums. Desegregation was the goal of all. But, as is the case of so many tragedies of our times, the many people of good will and fine intentions were overwhelmed by social tides beyond their individual control. And the bureaucracies, instead of imaginatively drawing together all agencies of the government, separately applied the logic of consistency to deaden the spirit of resistance, making segregation inevitable instead of only highly probable.\n\nThe rest of this opinion demonstrates the illegality of the present situation at Mark Twain and requires planning for rectification.\n\nII. FACTS\n\nA. The Area and its Environs\n\nThe New York Metropolitan area consists of New York City, the counties on Long Island, the area to the north on the mainland, and the cities and counties of northern New Jersey, with a total population of over ten million. The largest concentration of black and Hispanic populations are in the Bedford-Stuyvesant area of Brooklyn, Harlem in Manhattan and in the South Bronx. While substantial pockets of black population are located in such places as Newark, Yonkers and Hempstead, and large white neighborhoods are found in Central Manhattan, the general northern pattern is present: large central city concentrations of minorities surrounded by a ring of generally low-income whites, followed by a large suburban ring of generally middle-income whites. By 1968, this trend in Coney Island had become pronounced. In the metropolitan area generally, there has been since 1968 a continuing decrease in white population in the city and an increase in white population in the suburban areas.\n\n[Map showing concentrations of nonwhite population in Metropolitan New York, and changes of concentrations in District 21, is omitted in published opinion.]\n\nSchool District 21 lies in the first outer ring and is inhabited generally by some 290,000 people who are mainly white, lower middle-class. It is an area fronting on the Atlantic Ocean, about 3 miles from east to west and 3 1/3 miles north to south. Some 3 miles north of the northern end of the District is Bedford-Stuyvesant with a large concentration of blacks and Hispanics. Less than ten miles away are the business areas of Manhattan, reached by a number of rapid transit elevated and subway lines.\n\n[SEE ILLUSTRATION IN ORIGINAL]\n\nMuch of the District consists of well kept one and two family homes and small apartment houses built during the period between World Wars I and II. In the post-World War II period a number of large white-occupied housing projects were built by private developers, many with the aid of federally insured loans and some with state and city tax and other aid.\n\nConey Island lies in the southern part of District 21. It is a peninsula facing the Atlantic Ocean on the south, lower New York Bay on the west and northwest and Coney Island Creek on the north. Broad sandy public bathing beaches and a wide boardwalk overlooking the ocean have been used by hundreds of thousands of people each summer for generations. Long faded is the elegance of the pre-World War I era when the well-to-do came for summer vacations and commuting was by steamboat from the Coney Island Pier. Almost gone too are the remains of the post-World War I fun period when Luna Park, Steeplechase and the Garden Restaurant of Feltmans ranked with Copenhagen's Tivoli Gardens as places of family amusement and pleasure.\n\nSea breezes are still cooling in the summer, and moderating in the winter. Fishing is pleasant off the pier, the fascinating open boat fleet of Sheepshead Bay is nearby. Walking on the boardwalk and swimming are free. One of the world's great aquaria is at hand. A huge indoor public skating rink, a public library, social service centers, religious institutions, rapid transit, open food stands, carnival rides, a view of the city on one side and the sea on the other, and other physical attractions would seem to make this corner of New York an attractive place for children and their parents both to visit and to live in.\n\nYet, much of Coney Island became one of the City's worst slums. To see how this came to pass, and to understand this suit, three portions of the peninsula must be examined separately.\n\nThe western nose of the peninsula, eastward to 37th Street, is known as Sea Gate. Its inhabitants are white. For more than fifty years a high fence has isolated it with access controlled by private guards. Inside are middle-class one-family homes along privately owned streets. There has been practically no deterioration over the years and property values have appreciated. Some thirty Sea Gate children out of approximately 100 of junior high school age attend Mark Twain; the rest presumably go to private schools.\n\nFrom 37th Street to Stillwell Avenue is the central area. Apart from the amusement section near the boardwalk, it consisted of two main types of housing prior to World War II. There were some brick two and four-family homes and small apartment houses occupied year-round by families of workers and owners of small businesses. There were also wooden summer bungalows. With the severe housing shortage in the late forties and early fifties, the bungalows were \"winterized\" and occupied by veterans and others with much the same backgrounds as the permanent residents. Availability of housing in the suburbs and in new apartment houses to the east left vacancies. Housing began to deteriorate as speculators rented to welfare families and other poor people. Physical destruction of abandoned buildings by unsupervised youths and their use by addicts increased crime. A sense of desolation and despair led the whites to abandon the area at an accelerating tempo. By the middle-sixties, aged whites, blacks and Hispanics occupied a terrible slum. Already, however, public housing and slum clearance had started. Almost all of Central Coney Island has now been denominated an urban renewal area. By the mid-seventies almost all of it will have been torn down and replaced by large modern apartment buildings built by the city and state, partly with federal funds.\n\nEast of Stillwell Avenue to Ocean Parkway are some modern apartment houses built in the forties and fifties near Ocean Parkway, an extensive area once utilized by Luna Park, and large areas \"reclaimed\" from wetlands by earlier city dumping and land fill. Large private apartment house developments were built here for the white lower middle-class in the sixties. Rents exclude all but a relatively few middle class blacks and Hispanics.\n\n[Map showing changes of concentrations of nonwhite population by census tracts is omitted in published opinion.]\n\nWhile police precincts and school districts are not congruent, an examination of precinct-by-precinct data on race, income, age, welfare cases and crime, when integrated with evidence in the case, suggests some of the problems. See D. Burnham, \"Precinct Crime Compared With Peoples Age, Wealth,\" New York Times, June 30, 1973, p. 1, col. 1. In Central Coney Island, as compared to the rest of District 21, blacks and Hispanics are in high concentrations; median family income is much lower and families with income less than $4000 is high; (in the District as a whole less than 5% of the families have incomes over $25,000); the percent of population between 14-21 and over 65 years is high; percentage of families on welfare is high; the unemployed non-student male population 16-21 is high; and the homicide and robbery rates are high. As of 1969 the City Planning Commission found the welfare rate to be three times the city average; juvenile delinquency was two and one-half times the citywide average; and 45 percent of the population lived below poverty standards.\n\nB. Description of Mark Twain\n\nMark Twain is situated at the northern edge of the middle sector of Coney Island where the Coney Island Creek enters Gravesend Bay, an arm of New York's lower harbor. It is a well constructed three-story brick building approximately forty years old, thoroughly rebuilt and refurbished a few years ago. Among its facilities are a large modern auditorium, separate large gymnasiums for girls and boys, a large lunchroom with a modern kitchen, well equipped science laboratories, a well stocked library, and home-making and other specialized rooms. New typewriters and calculating equipment, machines for remedial reading, and other paraphernalia of modern teaching are available in satisfactory quantities. The printing and other shops seem well equipped for the use of children of this age group.\n\nIn addition to the usual outside recreation areas of a junior high school of this vintage, the building is adjacent to a sizeable city park. As a result there are tennis and handball courts, grass ball fields and track facilities available to the children during and after school hours for intra- and inter-mural sports.\n\nOn the day the court visited the school, in December of 1973, all the facilities appeared to be well used; the teaching and other staff seemed genuinely concerned with helping their young charges; and the children seemed well disciplined, alert, and interested in their school work. Imaginative use of the surrounding area was being made; for example, the science class was examining specimens gathered at the nearby seashore and use of the park facilities was scheduled.\n\nThe visit confirmed the impression left by the evidence received in court that some classes were segregated due to tracking, and that there were far fewer children than the facility and staff could handle. Lack of students is a reflection of the fact that Mark Twain has both the lowest utilization rate in the District and the highest absentee rate. The general emphasis on academic exercises requiring reading skills also seemed less than would be expected in a school attended by middle-class pupils in the five other Junior High and Intermediate Schools in District 21 -- J.H.S. 43, 228, and 281; I.S. 96 and 303.\n\nAVERAGE DAILY PERCENTAGE OF ATTENDANCE DISTRICT 21 SEPTEMBER 1972 -- JUNE 1973 (City Wide 83.41)J.H.S. 43 86.05I.S. 96 89.37J.H.S. 228 86.04J.H.S. 239 72.26J.H.S. 281 85.15I.S. 303 86.15\n\nReading scores for Mark Twain remain low as indicated by the following chart (based on New York Times, p. 51, col. 1, September 26, 1973; p. 1, col. 1, March 18, 1973): READING SCORES DISTRICT 21 Percentage of Grade 8 Students Reading Ranking of Median Grade At or Above City Junior Score Grade Level High Schools 1971 1972 1972 1973 1973 J.H.S. 43 9.3 8.7 48.3 53.4 23I.S. 96 8.0 8.2 36.6 38.2 56J.H.S. 99 9.3 9.3* 50.5*J.H.S. 228 8.4 8.0 39.7 41.6 46J.H.S. 238 8.4 8.4* 53.7*J.H.S. 239 5.8 5.7 13.8 13.9 108J.H.S. 281 8.2 7.8 42.7 42.4 43I.S. 303 9.8 9.0 45.9 47.2 38\n\nThe principal of Mark Twain attributed part of the low reading scores to the high absentee rate. Those children who do attend regularly show, according to his testimony, dramatic increases in reading skills as a result of the remedial reading programs. The intense efforts to improve average reading levels as compared to the paucity of results is frustrating. As the principal explained, many of the students have known nothing but failure and it is difficult to motivate them to come to school and to try to learn. Getting through to the parents seems almost as difficult. During the trial, a P.T.A. meeting and film at the school attracted thirty parents of whom three were minority.\n\nC. Racial Imbalance at Mark Twain\n\nOver the past ten years, the racial balance of the Mark Twain student body has changed drastically. In 1962 white students comprised about 81% of the total enrollment. (The category \"white students\" may include a very few Orientals and American Indians.) In each of the last ten years, the percentage of white students has declined. By 1973 white students comprised only about 18% of the total enrollment.\n\nIn 1962, black students comprised about 7.4%, and Hispanic (mostly Puerto Rican) students about 11.6%, of the total enrollment. In each of the last ten years, the percentage of nonwhite students at Mark Twain has increased. By 1973 blacks comprised about 43.3%, and Hispanos 38.6%, of the total enrollment.\n\nThis drastic change in the racial balance at Mark Twain has been due more to the \"attrition\" of white students than to any influx of minority students. In 1962 whites numbered 1566 out of a total 1933 students; by 1973 they number only 129 out of 713. By contrast, in 1962 blacks numbered 143, and Hispanos 224, out of a total 1933 students; and by 1973 blacks still numbered only 309, and Hispanos 275, out of 713.\n\nSignificantly, the percentage of black students at Mark Twain increased even during the two years (1969-70 and 1971-72) when there was a slight decrease in the actual number of black students. Similarly, the percentage of Hispanic students increased during the 1968-72 period when the actual number of Hispanics at Mark Twain declined.\n\n[SEE ILLUSTRATION IN ORIGINAL]\n\nThe racial imbalance at Mark Twain stands in marked contrast to, and compares very unfavorably with, the racial composition at the other Junior High and Intermediate Schools in District 21.\n\n[Extensive statistical charts on schools in District 21 are omitted in published opinion.]\n\nIn October, 1972, the total intermediate and junior high school population of District 21 numbered 8752. Of these, 919 were \"open-enrollment\" students -- students who do not reside in District 21 but who nonetheless attend school there in order to find a school which is more racially balanced than the one in their home district; they came from the heavily black and Puerto Rican areas of Bedford-Stuyvesant and are presumably nonwhite. Thus, in October, 1972, there were 7833 resident students attending intermediate and junior high schools in District 21.\n\nAssuming that the 919 \"open-enrollment\" students were nonwhite, 1337 of the 7833 resident students were nonwhite. About 17% of the total resident enrollment at the intermediate and junior high school in District 21 was nonwhite, while 76% of the enrollment at Mark Twain was nonwhite. Put another way, 41% of the resident nonwhite students enrolled at District 21 intermediate and junior high schools attended Mark Twain.\n\nIn the fall of 1973, about 30.4% of all the students - resident and nonresident - attending schools in District 21 -- elementary, intermediate, junior and high -- were nonwhite. 17.43% were black; 11.54% were Puerto Rican; and 1.41% were other Spanish-surnamed. Yet -- it bears repeating -- at that same point, 81.9% of the student enrollment at Mark Twain was nonwhite.\n\nD. Underutilization of Mark Twain\n\nTo put the racial imbalance at Mark Twain in perspective, we must examine the extent to which the school is underutilized. Determining the optimum use for a school involves more than a raw statistical comparison of the school's maximum pupil seating capacity as against its actual student register. Special programs, the physical nature of the school plant, and the unique needs of each individual school and its students must be taken into account. Undoubtedly, the optimum is somewhat below 100% of designed capacity and some underutilization is generally preferable to overutilization. For ease of comparison, the percentages used are based on design capacity.\n\nIn 1962, the utilization rate at Mark Twain was 88%. By 1964, it had increased to 98%. In 1965, however, the rate began declining and continued to do so steadily until 1972, save for 1967 when it climbed 1%. By 1972 the utilization rate at Mark Twain had declined to 41%. In the fall of 1973 it remained 41%. Since the actual number of nonwhite students at Mark Twain increased, albeit not greatly, during the 1962-1972 period, this sharp drop in the utilization rate at Mark Twain is obviously due to the \"attrition\" of white students during the past ten years. Significantly, the other junior high and intermediate schools in District 21 have not shown a similar decline in utilization over the last several years. As the chart below indicates, three of the other five schools in this category were being overutilized in the school year 1973-74; and during that same year the utilization rate at Mark Twain was 39% lower than the next lowest utilization rate, that of I.S. 303 and J.H.S. 43. Utilization Rate School 1973-74 J.H.S. 239 41%J.H.S. 228 100%J.H.S. 43 80%J.H.S. 281 108%I.S. 96 106%I.S. 303 80%\n\nThe utilization rate at Mark Twain was almost 50% below the District average. Even with small classes and many special project rooms, the principal of the school admitted that the school could easily accommodate three hundred more students.\n\nE. Segregation Within Mark Twain\n\nWithin Mark Twain there is a considerable amount of segregation based upon the equivalent of tracking. There are presently seven classifications of students. First, special students with high reading scores who accomplish the three year course of study in two years; second, special students with high reading scores who are not in a rapid advance program; third, students who elect to study a foreign language -- these are generally college bound; fourth, students with Puerto Rican backgrounds having trouble with English but who have good potential in reading; fifth, the bulk of students who range from about average in reading ability to considerably below average; sixth, pupils with seriously retarded reading scores; and seventh, children who are so disinterested in academic matters -- older boys, generally with substantial emotional or physical problems interfering with learning who do not attend school regularly -- they require some sort of work study program.\n\nInspection of the pictures of the graduating class, as well as the testimony, reveals that despite the high ratio of minority to white students in the school as a whole, the first two categories have been almost entirely white. The fifth, sixth and seventh tracks have been almost entirely nonwhite.\n\nPrograms to mix poor and good readers to provide a better racial balance have not worked well at Mark Twain and will not work, according to a member of the District 21 Board, unless the school population is \"larger and the school [draws] from a cross-section of all the economic and ethnic groups as the rest of the district does.\"\n\nThe most recent figures, for the incoming class, show some improvement in internal desegregation.\n\n[Chart showing ethnic distribution by classes in 1973 is omitted from published opinion.]\n\nF. Community Perceptions of Mark Twain\n\nThe community and school officials view Mark Twain as a segregated school. So, too, did Professor Nathan Glazer, an expert presented by the School Board and Professor Dan W. Dodson, plaintiffs' expert.\n\nDoctor Irving Anker, now Chancellor, testified, \"it was racially imbalanced.\" The principal noted the strong antipathy parents have to sending their children to Mark Twain despite its fine facilities, faculty and program; even the children in the school have a negative image of themselves. He testified:\n\nA. The school is situated in a slum area, for one thing.\n\nThe children who do not live in the area have to come by bus. They would have to walk one or two blocks through a high-crime, low-socioeconomic area. The children have learned from their parents or gotten from their parents certain attitudes about going to a school of this type, where there are a preponderance of minoritygroup children, and honestly, that's the only thing I can say about it. (Emphasis added).\n\n* * *\n\nQ. Now, at your school you do perceive it as an overwhelmingly minority school, very heavily minority school; is that correct?\n\nA. Yes.\n\nQ. And that is perceived throughout the district by your colleagues?\n\nA. I would think so, yes.\n\nQ. Would it be fair to say that the children at your school, or a number of the children at your school, have a negative image of themselves?\n\nA. I would say so, yes, some of them.\n\nQ. And you as the principal understand and recognize that, and the rest of your faculty recognize that?\n\nA. Right.\n\nQ. And perhaps even a great many of the administrators in the rest of the district know that children at your school have a negative -- certain numbers of children at your school have a negative image of themselves; is that correct?\n\nA. It would be my opinion, yes.\n\n. . . .\n\nThe principal also admitted that the reputation of the school -- though undeserved -- was bad, stating:\n\nA. It seems to me that a school gets its reputation from several sources: One is the published report on the reading scores of the school, and I'm sure that these people, when they came to me, they had already examined the figures and they saw that the school had the lowest reading score average on the standardized test than any other school in the district, and they were not happy with that.\n\nThey had also heard, they told me, that things were difficult for the children in the school, that there were fights and that there were extortions and there were disruptive children in the school. And I said, 'well, I'm very glad to have you come and look for yourself and see for yourself rather than listen to the rumors.'\n\n* * *\n\nQ. You indicated that the assemblyman came to your school.\n\n. . . .\n\n* * *\n\nA. He called me on the phone and told me he had attended a meeting of the Sea Park East, the housing development on Surf Avenue, that's in our area, and he told me that some of the parents at the meeting told him that they were afraid to send their children to Mark Twain, that they didn't want to send them, they were looking for ways to send them to other schools.\n\nDoctor Nathan Glazer summed up the matter when he testified that segregation \"is the perception and the reality there\" at Mark Twain.\n\nG. Action of School Officials Contributing to Present Situation\n\nTo a substantial degree the present condition at Mark Twain is attributable to decisions of school officials. The racial composition and utilization of a school is determined in large part by its feeder pattern -- that is, in the case of a Junior High School such as Mark Twain, by which graduating elementary students are zoned into that school.\n\nPublic School 212 and Public School 216 are both elementary schools with predominantly white student bodies. During the 1973-74 school year, blacks and Hispanos together comprised 39.2% of the total student enrollment at P.S. 212, and 9.6% of the total student enrollment at P.S. 216. At one time students at both P.S. 212 and P.S. 216 fed into Mark Twain -- that is, they \"graduated\" from P.S. 212 and P.S. 216 and under school board rules and regulations, went on to that Junior High School.\n\nUp until September, 1965, about 50% of the graduating class at Elementary School 216 fed into Mark Twain. The other 50% fed into J.H.S. 228. By September, 1966, pursuant to a change in school zoning patterns, all of the graduating class at P.S. 216 began feeding into J.H.S. 228.\n\nApparently, then, in September, 1966, every graduate of P.S. 216 entered grade 7 at J.H.S. 228. By September, 1968, the change was complete. Because the P.S. 216 students who had been graduating into Mark Twain were predominantly white, this change in feeder pattern had the natural and foreseeable effect of decreasing the white student enrollment at Mark Twain.\n\nIn September, 1966, J.H.S. 281, newly constructed, opened its doors. At that time, pursuant to a change in school zoning patterns, P.S. 212 students, who up until then had been feeding into Mark Twain, began attending J.H.S. 281. Because the P.S. 212 students were predominantly white, the construction of J.H.S. 281 in conjunction with the change of feeder pattern effectuated with regard to these two schools had the natural and foreseeable effect of decreasing the white student enrollment at Mark Twain.\n\nIn September, 1965, P.S. 303, newly constructed, opened its doors as an elementary facility. The Board of Education's Central Board had planned for P.S. 303 to be converted into an intermediate facility. Actual conversion began in September, 1968, when grades K through 4 were eliminated, leaving only grades 5 and 6. This phase of the conversion did not affect Mark Twain, however, since Mark Twain only has grades 7 through 9. In September, 1969, P.S. 303 added grade 7, and in September, 1970, it added grade 8. In September, 1971, P.S. 303 eliminated grade 5, completing the conversion to Intermediate School 303.\n\nIn adding grades 7 and 8 to P.S. 303, the local School Board withdrew children from the almost entirely white occupied Warbasse Houses and Luna Park House from Mark Twain. Ms. Delores Chitraro, until 1972 Superintendent of District 21, described this development at the trial:\n\nWe withdrew Warbasse House children, the junior high school children, from Mark Twain; we did it on a gradual basis and we withdrew Luna Park. We withdrew those youngsters because we had received figures from school planning and also from the Housing Authority that the new housing coming up in Coney Island would give to us an additional population, that is, children in addition to those already living in Coney Island, which would include a certain number of white children.\n\n* * *\n\nI am referring to O'Dwyer Gardens and West 32nd Street Housing [new public housing to the east of Sea Gate]. The population that was expected did not materialize; hence, the withdrawal of the youngsters who lived in Warbasse and Luna Park that we withdrew for 303 were not compensated for in Mark Twain by an additional white population nor even by an additional minority group population, because the movement within those houses was from within the community itself and not from outside the community.\n\nMs. Chitraro and Mr. Peter Gianesini, a former member and chairman of the local community school advisory board, objected to the conversion of P.S. 303 as not responsive to the need of the community. They foresaw the adverse racial impact on Mark Twain. Local school officials had serious doubts about the accuracy of the projections upon which the Central Board relied in part in concluding that new housing would fill the void in Mark Twain caused by the removal of students as a consequence of the conversion of P.S. 303.\n\nP.S. 303 was located in a predominantly white, middle class neighborhood and, consequently, the conversion of P.S. 303 from an elementary to an intermediate facility had the natural and foreseeable effect -- insofar as it directed students away from Mark Twain -- of decreasing the white student enrollment at Mark Twain. In the words of one witness:\n\n[In converting P.S. 303 into an intermediate school,] you practically guaranteed you were going to draw some white children from the area and this [303] was going to become a school that would further weaken the white strength that was in 239 [Mark Twain].\n\nPresently, then, only elementary schools P.S. 188 and P.S. 288 feed into Mark Twain. During the 1973-74 school year, blacks comprised 48.3% and Hispanos 30.9% of the total student enrollment at P.S. 188. During this same year, blacks comprised 50.4%, and Hispanos 41.5%, of the total student enrollment at P.S. 288.\n\nThe various actions of the Community Board, and the predecessor local School Board described above -- the rezoning effectuated with regard to Elementary School 216; the construction of J.H.S. 228 and the attendant rezoning of students graduating from Elementary School 212; and the phased conversion of P.S. 303 -- individually and together, had the foreseeable, inevitable effect of decreasing the white student enrollment at Mark Twain. It helped bring about the severe racial imbalance which we have already described.\n\nThe natural and foreseeable impact of the City school officials' and Community School Board's actions helping create severe racial imbalance has been magnified and exacerbated by the failure of the Community Board to act to remedy the situation. It is to this failure that we now turn.\n\nH. Inaction of School Officials Contributing to Present Situation\n\nIn September, 1970, the New York City Board of Education was decentralized in an effort to give each individual community more control of its schools. The \"local\" school board of District 21 became the Community School Board. As soon as the change was effected, Ms. Chitraro brought to the attention of the new Community Board the problem of severe racial imbalance at Mark Twain. The Board directed Ms. Chitraro to examine the situation further and to supply it with information relevant to the possibility of rezoning.\n\n1. Rejection of Rezoning Plans\n\nMs. Chitraro, the office of school zoning of the New York City Board of Education, and the Community School Board did develop a plan to rezone Elementary School 216 so that it would again feed into Mark Twain. The Community Board then met with the representatives of the Parent Associations of all the schools in District 21 and with other members of the community to discuss the possibility of implementing this plan.\n\nOn March 25, 1971, the Community Board issued a notice of public hearing with regard to the proposal to rezone P. S. 216. The public hearing was held on March 31, 1971. Ms. Chitraro tells us what happened:\n\nThere were representatives, people, present from all the various schools in the District. . . . There were people who spoke against the idea, and there were people who spoke for the idea.\n\nThose parents of the Coney Island area . . . were in favor of having an integrated school situation in Mark Twain, and were in favor of better utilization for Mark Twain because of the diminishing of services. . . . In the Luna Park houses, I found a great deal of ambivalence with certain people being in favor of an integrated situation and others not being in favor. In the 212 and 216 areas and the 281 area, to the best of my knowledge, there was an overwhelming opposition to forming a better integrated school at Mark Twain . . . because of the feeling of the parents that, one, the education facility at Mark Twain was not as good as either 228 or 281 and, two, their greater fear for safety of the children going to and from Mark Twain and, to some degree, inside the premises of Mark Twain.\n\nOn April 7, 1971, the Community Board advised the community that it had decided to make no changes in the status quo. On April 19, 1971, the Parents Association of Mark Twain appealed from the decision of the Community School Board to defendant Harvey Scribner, Chancellor of the Board of Education of the City of New York. When Chancellor Scribner failed to act, the Parent Association of Mark Twain filed a petition with the Commissioner of Education of the State of New York, Dr. Edward Nyquist.\n\nSubsequent to the filing of the petition with Commissioner Nyquist, Chancellor Scribner, in a letter dated September 7, 1971, and addressed to the President of Community School Board of District 21, directed the Board to formulate and approve, by no later than December 31, 1971, a plan \"to eliminate racial imbalance and improve building utilization\" at Mark Twain. On December 15, 1971, the President advised Chancellor Scribner that the plan he requested would be submitted to him in January, 1972.\n\n2. Failure of Free Choice Plan\n\nIn January, 1972, at a public meeting, the Community Board -- in response to the Chancellor's September 7th directive -- adopted a plan. It was entitled:\n\nA plan to augment the junior high school program in order to encourage free choice transfers to Mark Twain Junior High School.\n\nAs the title indicates, it was designed to make Mark Twain educationally more attractive in the hope that white parents would voluntarily send their children there. Essentially the program called for spending more money to improve the quality of Mark Twain's educational program.\n\nPursuant to the plan, both federal and state monies were diverted from the elementary schools in District 21 to Mark Twain, making possible the development of various special programs. This money, since it was intended to be used for deprived children, undoubtedly was diverted from schools feeding into Mark Twain, probably causing a further deterioration of this junior high school's entering class.\n\nSpecial group field trips, for example, were taken to Albany and Philadelphia. More significantly, Mark Twain developed a program permitting students to take 8 of their 35 periods in elective areas of special personal interest, such as the performing arts. And an extended school day was instituted, allowing students, under teacher guidance, to participate in special programs, utilizing classroom and other school facilities, after the completion of the normal school day.\n\nAt the January meeting at which the Board adopted its plan, Allen Zelon, a member of the Community Board, proposed an amendment because, as Mr. Zelon put it at trial, \"the plan that was going to be voted upon by the Board did not change the utilization or the racial composition\" of Mark Twain. Under Mr. Zelon's amendment, the two elementary schools which formerly had fed into Mark Twain, P.S. 212 and P.S. 216, would again have become feeder schools for Mark Twain, thereby increasing white student enrollment and utilization. Mr. Zelon would have bussed children from points in front of P.S. 212 and P.S. 216 to Mark Twain. In addition, the amendment provided for enough empty seats so that, should the units projected by the Housing Authority materialize, children from that housing could be accommodated.\n\nThe Zelon amendment was voted down by the Community School Board 7 to 2. The reasons for opposition to forced desegregation were much the same as those given at the March, 1971 public meeting.\n\nCommenting on the Community Board's free-choice plan at trial, plaintiffs' expert witness, Professor Dodson, testified that\n\n[of] all the plans that are used, this is the weakest and poorest.\n\nIt puts all the responsibility on the parents for the decision as to whether their child will go search for an adequate education, rather than a responsibility on the educational authorities to require them, as a matter of policy, that they arrange for children to attend, conducive to growth and development.\n\nProfessor Dodson concluded that \"white parents generally won't [voluntarily] send their children to a minority school.\"\n\nAt the trial, there was uncontradicted testimony by Mr. Zelon that there was no publicity campaign or other attempt by the Community Board to notify white parents within District 21 of the educational improvement planned for Mark Twain, and no active effort to encourage white parents to send their children there. By this time it was well known in the educational community that freechoice transfer, unaccompanied by publicity or active encouragement, is not calculated to accomplish desegregation. United States Commission on Civil Rights, Racial Isolation in the Public Schools 66-70, 147-148 (1967). See Green v. County School Bd. of New Kent Co., Va., 391 U.S. 430, 88 S. Ct. 1689, 20 L. Ed. 2d 716 (1968).\n\nIn any event, as the enrollment statistics for Mark Twain for the 1972-73 and 1973-74 school years make clear, the Board's program has been singularly ineffective in attracting white students to Mark Twain. The principal of Mark Twain testified that \"not one\" white student has enrolled at Mark Twain pursuant to the Board's free-choice plan in spite of the fact that, in the principal's opinion, the educational program at Mark Twain is currently as fine as any in the City of New York.\n\nThe evidence at trial strongly indicated that the physical facilities at Mark Twain and the educational programs -- including remedial programs in reading and mathematics, placement of studentteachers from Brooklyn College, and the use of organized volunteer adult tutors -- are superior to the facilities and programs of public schools in New York City generally. The principal explained this apparent anomoly by saying, as suggested above, that white parents fear to send their children into the \"slum\" \"high-crime\" neighborhood in which Mark Twain is located.\n\nDespite parents' fears, public bus lines are so conveniently situated that the walk to the school can readily be policed. There is presently some deteriorated housing between the bus stops and the school but it should be marked for early clearance. Incidents within the school are now practically non-existent and the court observed that the corridors are strictly and fully policed by teaching, supervisory and auxiliary personnel.\n\n3. Refusal to Follow Orders of Chancellor to Desegregate\n\nChancellor Scribner himself had rejected a free transfer plan. In a letter dated April 7, 1972, the Chancellor advised the Community Board President that:\n\nYour plans for improving racial imbalance through the voluntary transfer of white pupils into areas of minority group concentration are hardly likely to succeed. In the areas in which they have been tried, either as \"freedom-of-choice\" plans or as \"reverse open enrollment,\" both in this city and across the country, they have been notably unsuccessful. Well motivated as they might be, they have not in the past succeeded in attracting any significant number of pupils and there is no reason to suppose that this plan will be more successful. As a response to the problem of racial imbalance, this proposal is inadequate.\n\nContinuing, the Chancellor stated:\n\n1. A situation of racial and ethnic imbalance exists at Mark Twain Junior High School # 239.\n\n2. In the absence of planned remedial action, this situation is likely to become worse.\n\n3. Mark Twain Junior High School # 239 is presently under-utilized.\n\n4. In the absence of firm remedial action, this under-utilization is not likely to be corrected to any great extent.\n\n5. The proposed plan of Community School Board # 21, presented to me on January 13, 1972, leaves me to believe it will not correct the condition of racial and ethnic imbalance or of under-utilization of plant.\n\nFinally, Chancellor Scribner ordered the Community School Board to take\n\nsuch action as may be necessary including the adoption of a plan no later than May 17, 1972, to insure that Mark Twain Junior High School 239 will have an enrollment of such a nature that (a) By September 1, 1972, the percentage of minority group students will not vary from the District-wide average for intermediate and junior high schools by more than approximately 30% and the building utilization similarly will not vary by more than approximately 35% (b) By September 1, 1973, the percentage noted above will drop approximately 20% and 25% respectively (c) By September 1, 1974, the percentages noted above will drop to approximately 10% for both. It is so ordered.\n\nThe clear purpose of the Chancellor's directive was to require the Community Board, through rezoning, to make Mark Twain a school reflective of the District-wide averages both in terms of racial balance and degree of utilization, save for the 10% deviation factor.\n\nOn June 30, 1972, Chancellor Scribner met with the Community School Board, and the Board advised the Chancellor that it would not modify its January 5th plan at that time, the Chancellor's April 7th directive and order to the contrary notwithstanding. In a letter dated July 5, 1972, Chancellor Scribner modified his April 7th directive. Specifically, the Chancellor requested that\n\n1. As was under consideration by your Board, a sixth grade is to be added to Mark Twain for September, 1972.\n\n2. You are to terminate all options and/or any remaining enclave so that all students who would normally attend schools that would feed into Mark Twain will observe that feeder pattern. Therefore, all students who have been scheduled to attend another middle school in the district as a result of such options, will attend Mark Twain in September, 1972.\n\n3. You are to move forward with your plans for special financing to improve the programming at the school and to introduce innovative ideas and techniques.\n\nOn August 10, 1973, the Chancellor advised the Community School Board that this court had ruled:\n\nThe fact that this case is now pending does not prevent the Chancellor or the local School Board from taking appropriate action to protect the rights of all the children of this District during the pendency of this case.\n\nHe added:\n\nIn light of the above, you are hereby again directed to implement by the earliest possible date the steps set forth in the [Chancellor's] letter of July 5. . . .\n\nAs indicated below, another such letter was sent on December 5, 1973. The Community School Board has, however, failed to act.\n\n4. Fear of Chancellor and Other Central School Officials that Whites Would Leave a Desegregated System\n\nAt trial, Counsel to the Chancellor of the New York City Board of Education said that the Chancellor modified his April 7th directive primarily because he realized that forced integration of Mark Twain would cause white families with school-age children to move out of the integrated school zone and, if necessary, out of the District. Specifically, counsel declared:\n\n[Upon] a second look, after that first April 7th letter, . . . the Chancellor realized that the type of thing that was contemplated [by the April 7th letter] and that we understand to be contemplated by plaintiffs, and that is a massive infusion [of white students] . . . from a contiguous neighborhood into that school will not work; that it will be self defeating in that those white students, over a very short period of time, will evaporate so that we will not have [an integrated school].\n\nThe fear of transfers out of the public schools is well founded. As the Report of the United States Commission on Civil Rights, Racial Isolation in the Public Schools 38-39 (1967) (footnotes omitted) points out:\n\nPrivate and parochial school enrollment also is an important factor in the increasing concentration of Negroes in city school systems. Nonpublic school enrollment constitutes a major segment of the Nation's elementary and secondary school population. Nationally, about one-sixth of the total 1960 school enrollment (Grades 1 to 12) was in private schools. In metropolitan areas the proportion is slightly higher, and divided unevenly between city and suburb. Nearly one-third more elementary school students in the cities attend nonpublic schools than in the suburbs. Almost all of them are white. In the larger metropolitan areas the trend is even more pronounced. As Table 8 shows, a much higher proportion of white city students than white suburban students attend private and parochial elementary schools. Nonwhites in these metropolitan areas, whether in cities or suburbs, attend public schools almost exclusively.\n\nTABLE 8. -- Proportion of total elementary students, by race, in public and nonpublic school, for 15 large metropolitan areas, 1960 Central cities Suburbs White Nonwhite White Nonwhite Publi c 61 94 75 97Nonpublic 39 6 24 3\n\nSource: Yaucher, Tables on School Enrollment in Selected Metropolitan Areas, prepared for the Commission.\n\nThus nonpublic schools absorb a disproportionately large segment of white school-age population in central cities, particularly in the larger ones. This poses serious problems for city school systems.\n\nOther testimony, including that of the present Chancellor, Mr. Anker, confirms the conclusion that opposition by white parents with children attending other Intermediate and Junior High Schools in the District -- as well as fear that these parents would refuse to send their children to Mark Twain -- explains the failure to desegregate.\n\nIn a letter dated August 8, 1972, the Community Board advised the Chancellor that it had no intention of implementing suggestions one and two of the Chancellor's July 5th letter. The Chancellor did nothing thereafter to enforce either his April 7th directive or his July 5th letter or subsequent directives. The Community Board did not implement either the April 7th directive or the July 5th letter.\n\nFinally, at the eleventh hour, on December 5, 1973, the Chancellor again reiterated in a letter to Community School Board 21 his belief \"that the present status [of Mark Twain] is not acceptable and that [the] Board must take appropriate steps to change the situation.\" He directed that the \"Board present a plan within three weeks\" on the threat that if it did not do so he would \"have no alternative but to direct the adoption of a particular plan.\" Still, nothing was done.\n\nFaced with the serious, urgent problem that Mark Twain is a severely racially imbalanced and underutilized school, the Community Board and the Chancellor failed to act. Their inaction had the natural and foreseeable effect of maintaining and perpetuating severe racial imbalance at Mark Twain Junior High School.\n\nThis failure does not suggest that there was any intent or desire that Mark Twain be segregated. All school officials were distressed by the situation. They took some steps to reduce the number of children who would be segregated, for example, by zoning the area immediately adjacent to Mark Twain into I.S. 303. These children were minority children. A considerable amount of courage and persistence was required to take this action since the evidence shows strong opposition from the parents of some of the white children in I.S. 303 who objected to a minority school population much higher than that in the neighborhood of the school. The Community Board also welcomes the hundreds of minority pupils bussed from Bedford-Stuyvesant into the District's Junior High Schools. The school officials cannot be charged with racial prejudice in their official positions or with segregative design or intent.\n\nI. Public Housing in Central Coney Island\n\nThe city, state and federal governments, individually and together, have sponsored, maintained, and managed -- and presumably will continue to do so -- many publicly-assisted housing projects and multi-family developments in District 21. These projects cover most of the area of Central Coney Island and are within the feeder area of Mark Twain.\n\nThe white-occupied 8157 units of middle income non-federally funded housing projects were built in the eastern portion of Coney Island -- Luna Park in 1961; Trump in 1964; and Warbasee in 1965. While some city assistance was undoubtedly given to these projects in such matters as street relocations, and while these projects are subject to suit should they discriminate in renting, they are treated as private projects for the purposes of this action.\n\nBetween 1954 and 1971, the New York City Housing Authority completed 5141 units of public housing in Community School District 21. As of October, 1973, 3220 housing units had been completed in Coney Island with public funds. An additional 4000 units are planned or being built.\n\nThe ethnic composition of the early projects constructed in Coney Island by the Housing Authority reflected the community as it was prior to the change in racial composition in the late '50s and early '60s. Gravesend Houses, a federally-aided project completed in June, 1954, located at Bayview and Neptune Avenues, and West 33rd Street, comprising 634 units of housing, 199 of them for the elderly, was 81.5% white by apartment at initial occupancy. Coney Island Houses, a city moderate income development, completed in February, 1957, bounded by Surf Avenue, West 32nd Street, the Boardwalk and West 29th Street, comprising 534 units of housing, 136 of them for the elderly, was 91.9% white by apartment at initial occupancy. As of June, 1972, the white population by apartment of those projects had dropped, respectively, from 81.5% to 50.8% and from 91.9% to 71.3%. (Statistics based upon apartments tend to substantially underrepresent percentages of nonwhites, since the nonwhite families in public housing tend to be much larger than the white, elderly, families.)\n\nMarlboro Houses, located north of Coney Island, at Stillwell Avenue, Avenue V, 86th Street and Avenue X, completed in January, 1958, was a state-aided project containing 1755 units of public housing, of which 439 were for the elderly. At initial occupancy it was 93.2% white, by apartment. By June, 1972, it was 70.3% white.\n\nBernard Haber Houses, an all-elderly project of 380 units, built with state aid, with boundaries of West 25th Street, West 24th Street, Surf Avenue and the Boardwalk, completed in June, 1965, had an initial occupancy of 92.6% white, by apartment. It remained essentially a white project, being 93.2% white by apartment in June, 1972.\n\nIt is readily apparent that there had been a loss of white population from these early Authority projects from initial occupancy to the present, except for Haber Houses for the elderly. This loss has ranged from 20% to 30% of the initial white population by apartment. The fact that Coney Island was turning into a slum was undoubtedly a contributing factor to this loss of white population.\n\nDuring the 1960s, in addition to Haber Houses with its 380 elderly units, largely white, the Authority planned and constructed three public housing projects totaling 1847 units, West 32nd Street Mermaid Houses, William O'Dwyer Gardens, and Gerald J. Carey Gardens. 687 units, or 37% of the total, were designed for the elderly. Carey and Mermaid Houses were federally subsidized projects with an average monthly rent per room of $17.98 and $18.58 respectively. O'Dwyer was a city moderate income project, charging $28.36 per rental room. 45% of the apartments at O'Dwyer were for the elderly. The factors of higher rent and proportion of units for the elderly account for the fact that O'Dwyer had retained a relatively high proportion of white occupancy by apartment. It was 74.0% white by apartment in May, 1970 at initial occupancy and remained 70.7% white in June of 1972.\n\nO'Dwyer and Mermaid Houses are located adjacent to one another between West 31st Street and West 35th Street and between Surf and Neptune Avenues. Carey Gardens is located to the east, between West 22nd and West 24th Streets, across Neptune Avenue from J.H.S. 239. The proportions of units for the elderly at Mermaid and Carey are somewhat less than at O'Dwyer, being 39% at Mermaid and 29% at Carey. Mermaid was 48.0% white, by apartment, at initial occupancy in March, 1970, and was 43.4% white as of June, 1972. Carey Gardens was 27.5% white at initial occupancy, and 24.6% white as of June, 1972.\n\nIn 1968, a fifty square block area of Central Coney Island was selected by the city and federal governments as a \"target\" for government-assisted residential development under urban renewal and related programs, the latter termed Neighborhood Development Program (NDP). The NDP area, located between West 19th Street to Sea Gate and between Surf and Neptune Avenues, will be completely reconstructed.\n\nBy February, 1973, the City Housing Authority, as part of the NDP program, was constructing 686 family, and 108 elderly, low-income housing units. Plans for further development of low-income housing by the Authority in the NDP area were dropped in favor of moderate-income developments by the New York State Urban Development Corporation. Some 4000 units of moderate-income housing will be built by the state.\n\nThe Housing Authority selected tenants for Mermaid, O'Dwyer and Carey pursuant to its regulation, GM 1810. This regulation requires the Authority to give first priority to site and former site residents; second priority to people relocated from Coney Island West Urban Renewal Area and Neighborhood Development Program sites; and third priority to persons in emergency need of housing in Postal Zone 24 -- greater Coney Island. Cf. Otero v. New York City Housing Authority, 484 F.2d 1122 (2d Cir. 1973). Apparently the Authority adopted this regulation, after consulting with other government agencies and community groups, in acknowledgment of the community attachment which is frequently felt by persons relocated from the site of a housing project development. The Authority agreed to rent its three NDP projects on the same priority basis which governed its Mermaid, O'Dwyer, and Carey rentals.\n\nThe Housing Authority concedes that there has been a substantial loss of white population from its projects. When dislocated by urban renewal, white residents tend to fare better in finding new housing than minority residents. This leads to a disproportionate number of nonwhite former site residents and relocatees applying for public housing. And, under the Housing Authority's priority policy, these former site residents and relocatees get first choice in public housing.\n\nAs a result, the new units of housing opening in the early seventies were overwhelmingly minority with a high proportion of welfare and problem families. The sequence tended to discourage middle-class families who observed what appeared to be a precipitous policy of tipping.\n\nWhat is striking is that the new white population in the public housing is essentially aged. White families with children are not moving into public housing in this area. In view of the demand for housing, a number of new apartments were converted into larger units for sizeable minority families.\n\nThere was a good faith attempt to set target goals as to ethnic and racial composition as to tenant selection; but the goals were not met. For example, in one project two buildings were heavily occupied (80-85%) by white elderly people and three buildings ended up with black and Puerto Rican families.\n\nIn a letter to Community School Board 21 in 1972, the then Chancellor summed up the matter when he concluded:\n\n[It] is anticipated that new housing developments to be constructed in the area would yield 80% to 90% minority group children. Thus the new construction, rather than correcting the present situation of racial imbalance, is more likely to make it worse, and to place additional pupils in an ethnically imbalanced situation. (Emphasis added.)\n\nOne witness, a member of the Coney Island Community Advisory Board, capsulated the present trend and portents for the future when, after testifying that the original plan for site five and six originally called for 80% white residency, said: \"I have been inside Site 5 and 6, and you see a lot of children running around the playground, and they are all Black or Hispanic.\"\n\nJ. Impact of Public Housing\n\n1. On Underutilization\n\nThe Community School Board attempted to explain its various actions diverting white students away from Mark Twain and the attendant underutilization in terms of housing units now under construction or planned for the area serviced by Mark Twain. Specifically, the Community Board argued that it expected new housing units to mitigate both the underutilization and racial imbalance at Mark Twain. The Board's expectation was not justified by the facts. Housing presently under construction in the Coney Island area, unless there is a sharp change in rental policy, will not have any significant impact on either the underutilization or the severe racial imbalance at Mark Twain.\n\nSeymour Levine, a principal planner in the Division of School Planning and Research of the New York City Board of Education, submitted a document approved by the Administrator of the Division of School Planning and Research of the New York City Board of Education, which indicates that under its present grade structure an estimated 739 students would be added to the student body of Mark Twain by 1978 as a consequence of new housing. Even if these projections are credited, by 1978 Mark Twain would still be only 83% utilized. But there is no reason to believe these projections are any more accurate than the misleading ones of the past.\n\nRobert G. Hazen, General Manager of the Urban Development Corporation of the State of New York, testified that by the fall of 1975, \"substantial occupancy of [the total number of about 4000 new] units in the Neighborhood Development Plan area of Coney Island would be achieved.\" The estimated pupil contribution from those units to Mark Twain, under its present grade structure, would increase utilization at Mark Twain to only 69% by 1975.\n\nThe 69% figure is almost identical to the 68% utilization figure referred to by the Chancellor in his April 7th letter to the Community Board. The Chancellor's letter stated that:\n\nThere is some merit in the contention of the Community School Board that new housing may ultimately remedy the under-utilization of Mark Twain Junior High School 239, but the claim is not entirely valid. As of October 29, 1971, the utilization of the school was 41%. On the same date, the utilization of other intermediate and junior high schools in the District was as follows: 91%; 114%; 106%; 112%; 74%. The projections of the Central Zoning Unit, based upon data supplied by the Office of School Planning and Research, show that it is unlikely that utilization of Mark Twain Junior High 239 will improve by 1972, and that by 1974 the utilization is not likely to exceed 68% even taking into account the new housing. (Emphasis added.)\n\nBased on the most recent projections made available to the court, by 1974 the utilization factor at Mark Twain would be only 64% rather than the 68% referred to by the Chancellor. With regard to the underutilization of Mark Twain, then, housing units planned for Coney Island hold little promise.\n\n2. On Racial Balance\n\nWith regard to the severe racial imbalance at Mark Twain, housing units planned for Coney Island offer no hope if present government programs are not modified. The fact that Central Coney Island, unlike the rest of District 21, has a predominantly nonwhite population, and the fact that Mark Twain Junior High School, which services this area, is severely racially imbalanced, have discouraged and presumably will continue to discourage, white persons, especially white families with school-age children, from renting or purchasing housing in the area now serviced by Mark Twain. The testimony at trial virtually compels this conclusion.\n\nThe General Manager of the Urban Development Corporation of the State of New York, noted, generally, that \"a pattern of heavy minority occupancy, a minority percentage, heavy in either junior high school or elementary school, would make it more difficult to attract white families into the immediate neighborhood.\" David S. Olinger, formerly Deputy Commissioner of the Department of Development of the City of New York, testified to the same effect:\n\nI believe that people as they are concerned with making their housing choices as to the basic apartments, transportation and shopping, a very major, and perhaps primary concern for family people is the school that their children are going to go to.\n\nIf that school is heavily minority in its makeup, people may tend to be a little bit afraid of that situation. And that may be a negative in terms of their making their housing choice to locate in that community.\n\nI think an instance of this is in the real estate pages where schools are advertised as being an important selling point of one particular neighborhood over another.\n\nChancellor (then Deputy Chancellor) Anker, the defendant Community School Board's own witness, made this same point:\n\nWhat is needed is that the area be refertilized with new families. And if -- if one does not continue to get into the area families with children whom they are willing and prepared to send to the public schools, then one will lose one's effect and I would think that given the choice of living in an area where one would have to send one's children to Mark Twain or living in an area 5, 10, 15 blocks away, maybe even as far as going outside the city, where one could escape it, one would have a negative impact in that area.\n\nQ. How do you fertilize a residential area, to bring in white people, when you have a segregated school there?\n\nA. What do you mean by \"segregated school\"?\n\nQ. Predominantly minority school, 80 percent minority?\n\nA. I think you have a very, very tough job.\n\nQ. If you have to fertilize that area, that new housing, isn't it? Around Mark Twain?\n\nA. If Mark Twain continues to be a school that is overwhelmingly Black and Puerto Rican, it will be rather difficult to attract families, middle-class families. I point out, middle-class Black as well as White, to into the area. But hopefully, if the majority of the housing there is integrated, one can reflect that in the school.\n\nQ. Yes, but isn't -- but we have just come full circle. Isn't it going to be difficult to make that housing integrated if Mark Twain is segregated or overwhelmingly minority?\n\nA. If you cannot make a plan or a commitment to the people that you are going to change the nature of the school, yes, it will be difficult.\n\nProfessor Dodson, plaintiffs' principal expert witness, concurred in this conclusion. \"My general experience is that the school comes nearer determining the housing of the neighborhood than vice versa, by far.\"\n\nIn short, then, the Community School Board's expectation that new housing units in Coney Island will remedy the sharp underutilization and severe racial imbalance at Mark Twain seems unrealistic, especially in light of the racial imbalance existing at Mark Twain.\n\nIn fact, the building and rental policies of the various housing authorities have resulted in a minority child bearing population in newly constructed housing. Whites in the low cost housing are primarily elderly persons beyond child bearing age. Partly because the projects are perceived of as nonwhite, the New York City Housing Authority is not able to obtain white families from its waiting lists.\n\nThe point was well made by the United States Commission on Civil Rights in its Report, Racial Isolation in the Public Schools at 31, 33-34, 37 (1967) (footnotes omitted):\n\nIn the public schools of the central cities there are also pronounced patterns of stratification and racial isolation. One reason is the high level of residential segregation common to all cities -- a product of private discrimination, State and local government practices, and the impact of federally assisted housing programs . . . .\n\nOther decisions made at all levels of government also have contributed substantially to city patterns of residential segregation. Local public housing authorities, instead of locating projects on small sites scattered throughout the city, have concentrated them in large blocks located in limited areas of the city, frequently in the sections where racial concentrations are most dense. Local improvement programs, such as urban renewal and highway construction, have displaced large numbers of low-income nonwhite families who often have no alternative but to relocate in areas of existing racial concentrations, thereby intensifying residential segregation.\n\nThe Federal Government shares with State and local governments the responsibility for decisions that increase residential segregation within cities. Low-income housing programs, although carried out by private parties and local government agencies, usually are federally subsidized, and key determinations such as site selection are made with Federal approval. Similarly, local improvement programs often are heavily financed by the Federal Government and are subject to Federal approval. The Commission has reviewed the impact on racial concentrations in the city, and in the city schools, of three important Federal programs -- FHA 221(d)(3), urban renewal, and low-rent public housing.\n\nAs noted earlier, the Federal Housing Administration's 221(d)(3) program of assisting private industry in building rental projects for lower-to middle-income families has been primarily a central city program. In view of the high degree of residential segregation in cities, the sites selected for these projects can be important factors in either intensifying or reducing racial concentrations . . . public housing often has intensified racial concentrations in central city schools.\n\nSee also Note, \"The Responsibility of the Federal and State Governments for Residential Segregation,\" in United States Commission on Civil Rights, Racial Isolation in the Public Schools 254-258 (1967); Coleman, et al., Equality of Educational Opportunity 31-32 (1966).\n\nIII. LAW\n\nA. Supreme Court Standards\n\nIn Brown v. Board of Education of Topeka (I), the Supreme Court held that statutorily compelled or authorized racial segregation in public schools violates the Equal Protection Clause, \"even though the physical facilities and other 'tangible' factors may be equal.\" 347 U.S. 483, 493, 74 S. Ct. 686, 691, 98 L. Ed. 873 (1954). One year later, in Brown v. Board of Education of Topeka (II), the Court ruled that states which statutorily compel or authorize racial segregation must \"effectuate a transition to a racially nondiscriminatory school system.\" 349 U.S. 294, 301, 75 S. Ct. 753, 756, 99 L. Ed. 1083 (1955).\n\nBy their terms the two Brown cases spoke to racial discrimination compelled or authorized by statute; but it is too obvious and well settled to merit extended discussion, that racial discrimination which is accomplished by administrative design is no less repugnant to the equal protection clause than discrimination which has a statutory imprimatur. See, e.g., Yick Wo v. Hopkins, 118 U.S. 356, 373-374, 6 S. Ct. 1064, 1073, 30 L. Ed. 220 (1886) (\"Though the law itself be fair on its face and impartial in appearance, yet, if it is applied and administered by public authority with an evil eye and an unequal hand, so as practically to make unjust and illegal discriminations between persons in similar circumstances, material to their rights, the denial of equal justice is still within the prohibition of the constitution.\").\n\nIn Green v. County School Board of New Kent Co., Va., 391 U.S. 430, 88 S. Ct. 1689, 20 L. Ed. 2d 716 (1968) and Swann v. Charlotte-Mecklenberg Board of Education, 402 U.S. 1, 91 S. Ct. 1267, 28 L. Ed. 2d 554 (1971), the Supreme Court amplified the affirmative command of Brown II. In Green, involving a rural and sparsely settled county, school boards which had operated dual school systems held by Brown I to be unconstitutional, were declared to have \"the affirmative duty to take whatever steps might be necessary to convert to a unitary school system in which racial discrimination would be eliminated root and branch.\" 391 U.S. at 437, 88 S. Ct. at 1694. The Court then added that \"[the] burden on a school board today is to come forward with a plan that promises realistically to work, and promises realistically to work now.\" 391 U.S. at 439, 88 S. Ct. at 1694. In Swann the Court applied this \"affirmative duty\" doctrine to the urban school system of metropolitan Charlotte, North Carolina.\n\nAt the close of the last term of court, the Supreme Court, for the first time, spoke to the problem of a racially segregated school system in a nonsouthern city. The school system in question had \"never been operated under a constitutional or statutory provision that mandated or permitted racial segregation in public education.\" Keyes v. School District No. 1, Denver, Colorado, 413 U.S. 189, 191, 93 S. Ct. 2686, 2688, 37 L. Ed. 2d 548 (1973).\n\nIn Keyes the Court announced two evidentiary rules for school segregation cases involving no claim of statutory compulsion or authorization. First:\n\n[Proof] of state-imposed segregation in a substantial portion of the district will suffice to support a finding by a trial court of the existence of a dual system.\n\n413 U.S. at 203, 93 S. Ct. at 2695. The Court attached a proviso to this first rule, indicating that the rule would not apply where\n\nthe geographical structure of or the natural boundaries within a school district may have the effect of dividing the district into separate, identifiable and unrelated units.\n\n413 U.S. at 203, 93 S. Ct. at 2695.\n\nThe Court formulated a second rule for situations where (1) the proviso of the first rule renders the first rule inapplicable, or (2) proof of state-imposed segregation in a \"substantial portion\" of a school district is lacking. The second rule reads as follows:\n\n[A] finding of intentionally segregative school board actions in a meaningful portion of a school system . . . creates a presumption that other segregated schooling within the system is not adventitious. It establishes, in other words, a prima facie case of unlawful segregative design on the part of school authorities, and shifts to those authorities the burden of proving that other segregated schools within the system are not also the result of intentionally segregative actions.\n\n413 U.S. at 208, 93 S. Ct. at 2697. In reference to this second rule, the Court added:\n\n[If] respondent School Board cannot disprove segregative intent, it can rebut the prima facie case only by showing that its past segregative acts did not create or contribute to the current segregated condition of the core city schools.\n\n413 U.S. at 211, 93 S. Ct. at 2699.\n\nThe rules as of Keyes may be summarized as follows: (1) states and political subdivisions and agencies of the states may not authorize or compel -- whether by constitution, statute, ordinance, administrative rule or regulation or accepted custom -- racial segregation in public schools; (2) those charged with the responsibility of administering public schools may not act with \"unlawful segregative design\", Keyes, 413 U.S. at 208, 93 S. Ct. at 2697; and (3) where unlawful racial segregation in public schools exists, action must be taken, immediately, to eliminate it.\n\nThe Supreme Court has not yet ruled on the situation where racially imbalanced schools exist absent official compulsion or authorization or segregative design. Such a situation is sometimes described as de facto racial segregation. In Keyes, the Court noted that \"the differentiating factor between de jure segregation and so-called de facto segregation to which we referred in Swann [402 U.S. 1, 17-18, 91 S. Ct. 1267, 1276-1277, 28 L. Ed. 2d 554 (1971)] is purpose or intent to segregate.\" 413 U.S. at 208, 93 S. Ct. at 2697 (emphasis in original). See also Gomperts v. Chase, 404 U.S. 1237, 1240, 92 S. Ct. 16, 17-18, 30 L. Ed. 2d 30 (1971) (Douglas, J., denying preliminary injunction). Avoiding the de jure-de facto issue, the Court in Keyes said:\n\nWe have no occasion to consider in this case whether a \"neighborhood school policy\" of itself will justify racial or ethnic concentrations in the absence of a finding that school authorities have committed acts constituting de jure segregation. It is enough that we held that the mere assertion of such a policy is not dispositive where, as in this case, the school authorities have been found to have practiced de jure segregation in a meaningful portion of the school system by techniques that indicate that the \"neighborhood school\" concept has not been maintained free of manipulation.\n\n413 U.S. at 212, 93 S. Ct. at 2699. See also Keyes, 413 U.S. at 198, 93 S. Ct. at 2692 (\"Petitioners apparently concede for the purposes of this case that in the case of a school system like Denver's, where no statutory dual system has ever existed, plaintiffs must prove not only that segregated schooling exists but also that it was brought about or maintained by intentional state action.\").\n\nB. De Jure-De Facto Distinction\n\nThe de jure-de facto distinction is not helpful in a situation such as the one before us. See Keyes, 413 U.S. 189, 219-236, 93 S. Ct. at 2702-2711 (Powell, J., concurring in part); Cisneros v. Corpus Christi Independent School District, 467 F.2d 142, 148 (5th Cir. 1972), cert. denied, 413 U.S. 922, 93 S. Ct. 3052, 37 L. Ed. 2d 1044 (1973); see also Fiss, \"Racial Imbalance in the Public Schools: The Constitutional Concepts,\" 78 Harv.L.Rev. 564, 584 (1965); Wright, \"Public School Desegregation: Legal Remedies for De Facto Segregation,\" 40 N.Y.U.L. Rev. 285 (1965).\n\nIt is of some significance that the rule in this district for more than ten years has been that de facto segregation which can be avoided is unconstitutional. Branche v. Board of Education of Town of Hempstead, 204 F. Supp. 150, 153 (E.D.N.Y.1962) (\"The educational system that is . . . compulsory and publicly afforded must deal with the inadequacy arising from adventitious segregation; it cannot accept and indurate segregation on the ground that it is not coerced or planned but accepted.\"); Blocker v. Board of Education of Manhasset, New York, 226 F. Supp. 208, 229 (E.D.N.Y.1964). In Blocker this District Court ordered a white suburban school district with a single school which had become black as a result of adventitious private housing patterns to be integrated. As Judge Zavatt put it in Blocker, school children, \"are not so mature and sophisticated as to distinguish between the total separation of all Negroes pursuant to a mandatory or permissive State statute based on race and the almost identical situation prevailing in their school district\" without such a statute. Id. at 229.\n\nLater studies confirm the conclusion in Blocker. The United States Commission on Civil Rights wrote in its Report on Racial Isolation in the Public Schools 190-191 (1967):\n\nThe facts in this report confirm that racial isolation, whether or not sanctioned by law, damages Negro students by adversely affecting both their attitudes and achievement. Negro pupils attending predominantly Negro schools tend to have lower educational aspirations, feel more frequently that they are unable to control their own destinies, have a poorer self-image, and have teachers with lower expectations than similarly situated Negro students attending predominantly white schools. These differences in part are associated with differences in the comparative social class levels of the average predominantly Negro and the average predominantly white school -- differences which, given the relatively small Negro middle class, cannot be erased without school integration.\n\nBeyond this, however, a major factor in these differences is racial isolation itself, even when social-class factors are held constant. Just as segregation imposed by law was held in Brown to create feelings of inferiority among students affecting their motivation and ability to learn, so there is evidence that adventitious segregation is accompanied by a stigma which has comparable effects.\n\nOur society is fundamentally pluralistic. An important element is its ethnic and racial variety. Expressed in our Constitution is our national commitment to a society where persons of all races can live together in peace and creative harmony -- committed to the ideal of \"one Nation, indivisible\". The character and strength of this commitment were forged, in part at least, in the tragedy and pain of our own Civil War.\n\nWe have not thought that public schools obliterated -- or that they should obliterate -- ethnic variety, but we have believed that public education promotes the tolerance and understanding essential to harmony. While, as shown below, recent studies suggest that schools cannot carry much of the burden of eliminating social and economic inequality, public schools remain, as classrooms in democracy, one of the primary institutions through which our society can promote interracial tolerance and understanding and, therefore, multi-racial harmony. This point has been made, with considerable force, by several authoritative commentators, and their compelling observations bear repeating here:\n\nFor most children, the first experience with the legal and political framework of their society is in the school. They know that the public maintains the schools, and that they are required by law to attend. And quite apart from the reading, writing and arithmetic they learn in their schools, they also receive an unspoken message -- their society's concern, or lack of concern, for them, and the seriousness, or lack of seriousness, of the principles the society professes.\n\nThe best traditions of our country, those of which we are proudest and which we try, in our explicit teaching, to transmit to our children, envisage a heterogeneous but fraternal society in which individuals are free to identify with and develop their own special cultural heritage if they choose but in which no hard lines will be drawn separating group from group and citizen from citizen. This Commission believes that a school system, maintained by law, governed by public officials, supported by public revenues, cannot, by acts of commission or omission, permit the young who come into its charge to draw the inference that public authority accepts, encourages, or participates in, the division of our society into first- and second-class citizens. Nor can it permit students to come away from their education with grounds to believe that, despite the Pledge of Allegiance, with its phrase, \"one nation, under God, indivisible, with liberty and justice for all,\" the schools are content to accept as permanent and incurable a state of distrust and hostility between different races, classes, or cultural groups.\n\nOur nation and our state are informed by founding ideals which are admittedly difficult to live by. The only thing that is likely to be more difficult is the acceptance of a status quo departing radically from these ideals. Cynicism, despair, apathy, rebelliousness, hypocrisy, are the price. There can be reasonable disagreement between honest men about the best way to achieve the goal of integration. No one has a monopoly of wisdom with regard to this matter, and different approaches have to be tried in an experimental spirit. On the necessity to act, and on the validity of the goal itself, however, we see little room for disagreement among those who take seriously the promise of this nation. A \"good education for our children\" means, at the minimum, an education in which they become aware that our society is making a serious effort to practice what it preaches.\n\nFurthermore, the Commission is persuaded that an integrated education carries with it promises of improved quality that cannot be achieved in a segregated environment, and that full interracial and inter-ethnic exposure throughout the educational process enhances each individual's self-awareness and social consciousness in ways that rebound not only to his own but society's advantage as well. In a pluralistic world that increasingly demands interracial and inter-ethnic cooperation and understanding at all levels, segregated education makes no sense. . . .\n\nInterracial and inter-ethnic exposure increases understanding and cooperation. Integration in the schools should be given the highest priority because it is clear that such cooperation and understanding are more easily instilled in young people than in adults.\"\n\nFleischmann (Commission) Report on the Quality, Cost and Financing of Elementary and Secondary Education in New York State 226-227 (1973).\n\nOne of the \"Major Findings\" of the most recent New York State Commission to consider the matter was: \"it is no less imperative that our children be taught in school how to live in an integrated world than that they be taught how to read.\" Id. at 239.\n\n[Proper] teaching of the principle of equality of opportunity requires more than the mere inculcation of the democratic ideal. What is essential is the opportunity, at least in school, to practice it. This requires that the school make possible continuous actual experience of harmonious cooperation between members of various ethnic and religious groups and thus produce attitudes of tolerance and mutual sharing that will continue in later life. In the segregated school this desirable environment does not exist. The most important instrument for teaching democracy to all people is thus rendered impotent.\n\n\"Brief for the Committee of Law Teachers Against Segregation in Legal Education,\" 34 Minn.L.Rev. 289, 319-320 (1950) (the authors included Thomas I. Emerson, John P. Frank, Erwin N. Griswold, and Edward Levi).\n\n[Actual] integration of students and faculty at a school, by setting the stage for meaningful and continuous exchanges between the races, educates white and Negro students equally in the fundamentals of racial tolerance and understanding. . . . [Learning] to live interracially is, or in a democracy should be, a vital component in every student's educational experience.\n\n[Segregation] in the schools precludes the kind of social encounter between Negroes and whites which is an indispensable attribute of education for mature citizenship in an interracial and democratic society. Segregation \"perpetuates the barriers between the races; stereotypes, misunderstandings, hatred, and the inability to communicate are all intensified.\"\n\nHobson v. Hansen, 269 F. Supp. 401, 419, 504 (D.D.C. 1967), aff'd sub nom. Smuck v. Hobson, 132 U.S. App. D.C. 372, 408 F.2d 175 (D.C.Cir. 1969) (footnotes omitted).\n\nThese comments, spanning some twenty-three years, are an eloquent and cogent testament to the belief that desegrated education is an important and even crucial means to one end to which our nation and Constitution are committed: multi-racial harmony. It is no less important that we face the converse of this belief, namely, that segregated schooling is an incubator for racial intolerance and misunderstanding, of feelings of racial inferiority (and superiority), of racial separation and prejudice -- in short, of multi-racial discord. This point, too, has been made again and again:\n\nThe damaging consequences of racially isolated schools extend beyond the academic performance and attitudes of Negro schoolchildren and the subsequent impairment of their ability to compete economically and occupationally with whites. Racial isolation in the schools also fosters attitudes and behavior that perpetuate isolation in other important areas of American life. Negro adults who attended racially isolated schools are more likely to have developed attitudes that alienate them from whites. White adults with similarly isolated backgrounds tend to resist desegregation in many areas -- housing, jobs, and schools.\n\nAt the same time, attendance at racially isolated schools tends to reinforce the very attitudes that assign inferior status to Negroes. White adults who attended schools in racial isolation are more apt than other whites to regard Negro institutions as inferior and to resist measures designed to overcome discrimination against Negroes. Negro adults who attended such schools are likely to have lower self-esteem and to accept the assignment of inferior status.\n\nUnited States Commission on Civil Rights, Racial Isolation in the Public Schools 109-10 (1967).\n\nWe support integration as the priority education strategy because it is essential to the future of American society. We have seen in this last summer's disorders the consequences of racial isolation, at all levels, and of attitudes toward race, on both sides, produced by three centuries of myth, ignorance, and bias. It is indispensable that opportunities for interaction between the races be expanded.\n\nReport of the National Advisory Commission on Civil Disorders 438 (Bantam ed. 1968).\n\nIndividual growth in the educational system occurs not only in the area of achievement, the acquisition of cognitive skills, but also in the areas of social and psychological development. Segregation is perhaps more detrimental to the Black student's social and psychological development than to his achievement level. Finding himself isolated to a significant degree from the bulk of the white population, witnessing the disparate superiority of the status of White adults over Black adults in many circumstances, and perhaps further observing a pronounced underrepresentation of Blacks in positions of leadership in his school, where this is the case, the Black child may become reluctant to assert himself in the presence of Whites and unduly pessimistic concerning his ability to interact or compete successfully with Whites of his own generation. . . .\n\nThe negative impact of racially segregated schools is not confined exclusively to Black students. White children may also react to racial isolation in ways harmful to themselves. White pupils are apt to form an irrational attitude of inherent superiority and are apt to develop an unrealistic concept of homogeneous society in which certain values enjoy universal acceptance. Similarly, because of their cultural isolation, segregated White children tend to lose sight of those fundamental values of our constitutional system which, while respecting individual differences, favor free access and wide social mobility to all persons regardless of race, creed, or national origin, and which thereby promote a healthy interchange among persons of different backgrounds.\n\nThe state of mind fostered by racial and cultural isolation heightens racial conflicts and divisiveness in the country and thus adversely affects the domestic tranquility the Constitution was designed to promote. White students who have been educated in segregated public schools are thus ill-prepared to deal with the pluralistic society which actually exists in the adult world beyond the classroom.\n\nOliver et al. v. Kalamazoo Board of Education, 368 F. Supp. 143, 155-156 (W.D. Mich.1973). (Emphasis in original.)\n\nThe rulings of the Supreme Court in Brown and subsequent cases touched the core of our constitutional ethos and must be construed with the breadth required of such fundamental pronouncements. Thus understood, Brown I held that racial segregation which is caused by state action is unconstitutional.\n\nWe must . . . reject this type of continued meaningless use of de facto and de jure nomenclature to attempt to establish a kind of ethnic and racial separation of students in public schools that federal courts are powerless to remedy. Such attempts are confusing and unnecessary. The decision in Brown is the clear embodiment of the legal framework for the resolution of these important issues.\n\nBrown prohibits segregation in public schools that is a result of state action. It requires simply the making of two distinct factual determinations to support a finding of unlawful segregation. First, a denial of equal educational opportunity must be found to exist, defined as racial or ethnic segregation. Secondly, this segregation must be the result of state action.\n\nWe need not define the quantity of State action or the severity of the segregation necessary to sustain a constitutional violation. These factual determinations are better dealt with on a case by case basis. We need only find a real and significant relationship, in terms of cause and effect, between state action and the denial of educational opportunity occasioned by the racial and ethnic separation of public school students.\n\n. . . Discriminatory motive and purpose, while they may reinforce a finding of effective segregation, are not necessary ingredients of constitutional violations in the field of public education. We therefore hold that the racial and ethnic segregation that exists in the Corpus Christi school system is unconstitutional -- not de facto, not de jure, but unconstitutional.\n\nCisneros v. Corpus Christi Independent School District, 467 F.2d 142, 148-149 (5th Cir. 1972), cert. denied, 413 U.S. 922, 93 S. Ct. 3052, 37 L. Ed. 2d 1044 (1973).\n\n1. Definition of Racial Segregation.\n\nUnder the test announced in Cisneros the threshold problem is that of determining what constitutes \"racial segregation\" in the public schools. The court faces no similar definitional problem when reviewing statutory classifications based on race, because such a classification, in and of itself, is presumptively unconstitutional. See, e.g., Loving v. Virginia, 388 U.S. 1, 87 S. Ct. 1817, 18 L. Ed. 2d 1010 (1967) (anti-miscegenation statute held violative of Equal Protection Clause). When statutory compulsion or authorization is absent, however, it is necessary to inquire whether an actual condition of racial segregation exists.\n\nWe agree with the court in Cisneros that \"the severity of segregation\" -- or, put another way, the degree of racial imbalance -- \"necessary to sustain a constitutional violation . . . [is a] factual determination . . . better dealt with on a case by case basis.\" Cisneros v. Corpus Christi Independent School District, 467 F.2d 142, 148 (5th Cir. 1972), cert. denied, 413 U.S. 922, 93 S. Ct. 3052, 37 L. Ed. 2d 1044 (1973). What constitutes a racially segregated school or school system cannot be defined in the abstract.\n\nWhat is or is not a 'segregated' school will necessarily depend on the facts of each particular case.\n\nKeyes v. School District No. 1, Denver, Colorado, 413 U.S. 189, 196, 93 S. Ct. 2686, 2691, 37 L. Ed. 2d 548 (1973); Swann v. Charlotte-Mecklenburg Board of Education, 402 U.S. 1, 18-23, 91 S. Ct. 1267, 1277-1279, 28 L. Ed. 2d 554 (1971). See also Report of Select Committee on Equal Educational Opportunity, United States Senate, Toward Equal Educational Opportunity, Sen.Rep.No.92-000, 92nd Congress, 2d sess., 101 (1972).\n\nAmong the factors required to be considered by cases such as Keyes, Swann and Brown I are:\n\n1. The racial and ethnic composition of the student body, faculty and staff;\n\n2. the racial and ethnic compositions of the school compared to that in the school district and other schools in the district;\n\n3. the attitude of the adult community, children in the school and other schools, and teachers and staff toward the school;\n\n4. the history of the school, particularly with respect to opening and closing of other schools and changes in zoning patterns affecting the school;\n\n5. the objective success of the school in educating its students as compared to that of other schools in the district;\n\n6. segregation within the school; and\n\n7. skill of teachers, programs and facilities compared to those in other schools.\n\nIn considering these factors, dynamics are important. As the expert for the defendants, Professor Nathan Glazer noted, Mark Twain \"is segregated . . . less because of the figures [but] because of what is happening to it, the precipitous drop in other children over the last few years.\"\n\nHispanos, or as they are referred to in most New York City statistics, Puerto Ricans, are to be combined with blacks \"for purposes of defining a 'segregated' school.\" Keyes v. School District No. 1, Denver, Colorado, 413 U.S. 189, 197, 93 S. Ct. 2686, 2691, 37 L. Ed. 2d 548 (1973). In New York City the educational problems of these two minorities are in many respects similar.\n\n2. State Action: School Board Action and Inaction.\n\nOnce it has been established that racially segregated schooling exists, it must then be shown -- in order to make out a constitutional violation -- that this segregation was caused or brought about by state action. Acts of omission as well as acts of commission constitute state action.\n\nIf a public school is operated as a segregated facility, in an integrated community, the school's character results from the school board's action or inaction. Just as a public school would not exist but for the state, the character of the public school is determined by the school board. In the words of Mr. Justice Powell:\n\nPublic schools are creatures of the State, and whether the segregation is state-created or state-assisted or merely state-perpetuated should be irrelevant to constitutional principle. The school board exercises pervasive and continuing responsibility over the long range planning as well as the daily operations of the public school system. It sets policies on attendance zones, faculty employment and assignments, school construction, closings and consolidations, and myriad other matters.\n\nKeyes, 413 U.S. 189, 227, 93 S. Ct. 2686, 2707, 37 L. Ed. 2d 548 (1973) (Powell, J., concurring in part). See also United States v. Texas Education Agency, 467 F.2d 848, 863 (5th Cir. 1972) (\"A school board is an agent of the state. . . . The actions of the [school board] are 'state action' for purposes of the fourteenth amendment. Here school authorities assigned students, faculty, and professional staff; employed faculty and staff; chose sites for schools; constructed new schools and relocated old ones; and drew attendance zone lines\").\n\nA school board which neglects to avoid racial segregation in its school is itself causing or bringing about, as an agency of the state, racial segregation. This is so because a school board, like other legal entities, must be held accountable for the natural, foreseeable, and avoidable consequences of its activities and policies:\n\nThe school board's responsibility for the creation and maintenance of imbalanced schools, even under the policies of approval or disregard, is derived from its deliberate choice to assign children to schools on the basis of geographic criteria when it knows that, given the ghettoized residential patterns, the implementation of this choice will yield racially imbalanced schools.\n\nFiss, \"Racial Imbalance in the Public Schools: The Constitutional Concepts,\" 78 Harv.L.Rev. 564, 584 (1965).\n\nIn this context, the pertinent action of the school board is its choice of a criterion for student assignments. The board decides how students are to be assigned. The result of using a criterion such as geographic proximity in a system with residential segregation is foreseeable; and in most instances there are reasonable measures the board could adopt, if not to eliminate, then at least to mitigate the result that flows from the use of that criterion.\n\nFiss, \"The Charlotte-Mecklenberg Case -- Its Significance for Northern School Desegregation,\" 38 Chi.L.Rev. 697, 706 (1971).\n\nThat school boards must be held accountable for the natural, foreseeable, and avoidable consequences of their activities and policies is hardly a novel view. See Bradley et al. v. Milliken et al., 484 F.2d 215, at 222 (6th Cir. 1973), cert. granted, 414 U.S. 1038, 94 S. Ct. 538, 38 L. Ed. 2d 329 (1973) (\"The manner in which the Board formulated and modified attendance zones for elementary schools had the natural and predictable effect of perpetuating racial segregation of students. Such conduct is an act of de jure discrimination in violation of the Fourteenth Amendment.\"); Cisneros v. Corpus Christi Independent School District, 467 F.2d 142, 149 (5th Cir. 1972), cert. denied, 413 U.S. 922, 93 S. Ct. 3052, 37 L. Ed. 2d 1044 (1973) (\"[Actions] and policies of the Board, had, in terms of their actual effect, either created or maintained racial and ethnic segregation in the public schools. . . . [In] our view the use of the neighborhood school plan is the direct and effective cause of segregation in the schools. . . . The Board imposed a neighborhood school plan, ab initio, upon a clear and established pattern of residential segregation in the face of an obvious and inevitable result.\"); United States v. Texas Education Agency, 467 F.2d 848, 863 (5th Cir. 1972) (\"The natural and foreseeable consequence of [the school board's various administrative actions] was segregation of Mexican-Americans. Affirmative action to the contrary would have resulted in desegregation. When school authorities, by their actions, contribute to segregation in education, whether by causing additional segregation or maintaining existing segregation, they deny to the students equal protection of the laws.\"); Oliver v. Kalamazoo Board of Education et al., 368 F. Supp. 143, 180 (W.D.Mich.1973) (\"The Kalamazoo School Board's acts of commission and omission clearly demonstrate that the Kalamazoo School Board's administration of the school system substantially contributed to and proximately caused the segregated condition which prevails in the system\"); Hoots v. Pennsylvania, 359 F. Supp. 807, 823 (W.D.Pa.1973) (\"When the natural and foreseeable consequences of actions taken by school authorities are to preserve segregation within the public schools or to hamper its removal, such actions violate the Fourteenth Amendment.\"); Johnson v. San Francisco Unified School District, 339 F. Supp. 1315, 1318-1319 (N.D.Cal.1971) (\"[If] the school board, as in this case, has drawn school attendance lines, year after year, knowing that lines maintain or heighten racial imbalance, the resulting segregation is de jure.\"); Soria v. Oxnard School District Board of Trustees, 328 F. Supp. 155, 157 (C.D.Cal.1971) (\"The maintenance of unequal educational opportunities in the Oxnard Elementary Schools through racial imbalance denies plaintiffs their rights to equal protection of the laws, guaranteed by the Fourteenth Amendment.\"); Spangler v. Pasadena City Board of Education, 311 F. Supp. 501, 521 (C.D.Cal.1970) (\"Under the Fourteenth Amendment a public school body has an obligation to act affirmatively to promote integration, consistent with the principles of educational soundness and administrative feasibility.\").\n\nIn the Keyes case, Mr. Justice Powell, concurring, but without contradiction, concluded that where racially segregated schools exist, the school board is presumptively responsible for the condition of segregation.\n\n[If], after such detailed and complete supervision, substantial school segregation still persists, the presumption is strong that the school board, by its acts or omissions, is in some part responsible. Where state action and supervision are so pervasive and where, after years of such action, segregated schools continue to exist within the district to a substantial degree, [the court] is justified in finding a prima facie case of a constitutional violation.\n\n413 U.S. 189, 227-228, 93 S. Ct. 2686, 2707, 37 L. Ed. 2d 548. Reason and common sense require Mr. Justice Powell's conclusion in a case such as the one before us. The state is responsible for the very existence of its public schools; acting through the school board or some other agent it is responsible for determining the character of its schools.\n\nMoreover, when racial characteristics determine place-of-residence, as undoubtedly they often do in our society, then the school board's use of a \"neighborhood\" or residential criterion in student assignment and school construction decisions constitutes a racial classification once-removed. To the extent that racial characteristics determine or have determined place-of-residence, the school board's use of a residential criterion effectively implicates the state in racial discrimination. The residential criterion\n\namplifies the consequences of private discrimination; it lengthens the discriminator's arm, giving him a veto over the neighborhood public school.\n\nGoodman, \"De Facto School Segregation: A Constitutional and Empirical Analysis,\" 60 Cal.L.Rev. 275, 320 (1972).\n\nThe point that the residential criterion is a racial classification once-removed has even more force when governmental acts and policies have contributed substantially to existing patterns of residential segregation. The Report of the Senate Select Committee on Equal Educational Opportunity (Towards Equal Educational Opportunity) concludes:\n\nAs in the case of school segregation, housing segregation is seldom a matter of individual choice. It is clear that Federal, State and local governmental practices, at every level, have contributed to the housing segregation which exists today. These actions combine with those of private organizations such as lending institutions, real estate brokerage firms, land developers and others to establish and maintain residential segregation.\n\nSen.Rep.No.92-000, 92d Congress, 2d Sess., 121-122, (1972) (emphasis added).\n\nIn testimony before the Select Committee, George Romney, then Secretary of the Department of Housing and Urban Development, placed these matters in historical perspective:\n\nThroughout most of that history, the dominant majority supported or condoned social and institutional separation of the races. This attitude became fixed in public law and public policy at every level of government and every branch of government, and thus it was adopted as a matter of course by the Federal Government when it entered the housing field in the 1930's. It continued after World War II.\n\nId. at 122.\n\nThat this residential segregative tendency became fixed in federal practice, as Secretary Romney indicated, is clear.\n\nA glaring example is found in explicit provisions of FHA manuals, revised through 1938 and still utilized in the 1950's, which discouraged financing real estate transactions that introduced 'inharmonious racial groups' into a community. FHA fostered school segregation by advising in an underwriting manual that a neighborhood 'under consideration will prove far less stable and desirable . . . if the children of people living in such an area are compelled to attend a school where the majority or a goodly number of pupils represent a far lower level of society, or an incompatible racial element. . . .'\n\nOliver v. Kalamazoo Board of Education, 368 F. Supp. 143, at 182 (W.D.Mich. 1973) (emphasis in original).\n\nThe federal government, aided by pervasive state practices in zoning, taxing and the like, must share the responsibility for residential segregation. One authority properly notes:\n\nAt the federal level, government agencies for many years explicitly premised their policies on the assumption that economic and social stability was best achieved by maintaining the racial homogeneity of the neighborhood. Thus, from 1935 to 1950, the Federal Housing Administration took the position that \"[if] a neighborhood is to retain stability, it is necessary that properties shall continue to be occupied by the same social and racial classes\" and invited appraisers to lower their valuations of property in mixed neighborhoods. According to one authority, this policy \"established federally sponsored mores for discrimination in the suburban communities in which 80 per cent of all new housing is being built and fixed the social and racial patterns in thousands of new neighborhoods.\"\n\nGoodman, \"De Facto School Segregation: A Constitutional and Empirical Analysis,\" 60 Cal.L.Rev. 275, 332-333 (1972).\n\nWhere, as in the case before us, the federal, state and city governments cooperate to rebuild completely a neighborhood, controlling access to the apartments built and maintained through governmental action, the government's responsibility for ghettoization is apparent. Cf. Otero v. New York City Housing Authority, 484 F.2d 1122 (2d Cir. 1973).\n\nWe indicated above that the residential criterion effectively constitutes a racial classification once-removed, where racial characteristics determine place-of-residence, as undoubtedly they often do. When residential segregation is the result of state action -- and we have seen that it often is -- then the school board's use of a residential criterion constitutes \" double discrimination\". United States v. Texas Education Agency, 467 F.2d 848, 864 n. 22 (5th Cir. 1972) (emphasis in original).\n\nFurthermore, we cannot ignore the fact that racially segregated schools themselves contribute to residential segregation, which in turn -- through the school board's use of a residential criterion -- further segregates the school.\n\nThe character of the public school often plays a critical role in a family's choice of neighborhood when children are assigned to school on the basis of residence. Just as the residential pattern affects the racial composition of the school, the racial composition of the school affects the residential pattern. This interdependence can be attributed to something far more obvious than the alleged fact that segregated education perpetuates the social barriers between the races and thereby encourages residential segregation. By rigidly adhering to geographic criteria over a long period of time the school board assures the parent who does not want his children to go to school with Negroes that this desire can be fulfilled by moving into a white neighborhood. The invasion-succession sequence is also fortified by the use of geographic criteria since it assures the white parent that if he moves out of the neighborhood 'invaded' by the Negro, he will be leaving the Negro behind. Of course, many of the factors involved in the choice of residence are far beyond the school board's control. However, the relationship between the use of geographically determined attendance zones and ghettoized residential patterns is merely a further reason why the school board cannot disclaim responsibility for the imbalanced school.\n\nFiss, \"Racial Imbalance in the Public Schools: The Constitutional Concepts,\" 78 Harv.L.Rev. 564, 587-588 (1965).\n\nIt is less important that we isolate where this vicious circle -- racially segregated schools contributing to residential segregation contributing to racially segregated schools -- begins than that the law eliminate, to the extent practicable, the state's complicity in the maintenance of racially segregated schools. To this end,\n\n[Integration] is an educational goal to be given a high, high priority among the various considerations involved in the proper administration of a system beset with de facto segregated schools.\n\nUnited States v. Jefferson County Board of Education, 372 F.2d 836, 875 (5th Cir. 1966), reaffirmed en banc, 380 F.2d 385 (1967).\n\nUnder the Fourteenth Amendment school boards may not respond \"to the fact and dilemma of segregation\" with \"indifference and inaction. School officials\" may not neglect \"to install actual integration as an objective of administration policy, or even to recognize that . . . segregation is a major problem.\" Hobson v. Hansen, 269 F. Supp. 401, 414 (D.D.C.1967), aff'd sub nom. Smuck v. Hobson, 132 U.S.App.D.C. 372, 408 F.2d 175 (1969).\n\nOne final point is relevant with regard to inaction of the Community School Board. Where a plan for desegregation is adopted or ordered, nullification of that plan by revision or by refusing to act constitutes \"a de jure segregative act and a constitutional violation entitling the plaintiffs to a remedy in this court.\" Oliver v. Kalamazoo Board of Education, 368 F. Supp. 143, at 159, (E.D.Mich.1973).\n\n3. Illicit Motive.\n\nSegregative design is not material in the sense that it is not essential in proving a violation of the Constitution in a case such as this. Nevertheless, it may be relevant in proving that segregation exists on the theory that people are more apt to accomplish something if they set out to do so.\n\nAs a practical matter it is exceedingly difficult, if not impossible, for a court to ascertain legislative or even executive motive. More to the point, it is virtually impossible for a court to divine the collection of motives which underlies a multi-member school board's various administrative decisions. The method of judicial inquiry is not well suited to group psychoanalysis. As the Supreme Court has pointed out:\n\n[As] we said in Palmer v. Thompson, 403 U.S. 217, 225, [91 S. Ct. 1940, 1945, 29 L. Ed. 2d 438] it \"is difficult if not impossible for any court to determine the 'sole' or 'dominant' motivation behind the choices of a group of legislators,\" and the same may be said of the choices of a school board. . . . Thus, we have focused upon the effect -- not the purpose or motivation -- of a school board's [actions]. . . . The existence of a permissible purpose cannot sustain an action that has an impermissible effect.\n\nWright v. Council of City of Emporia, 407 U.S. 451, 461-462, 92 S. Ct. 2196, 2203, 33 L. Ed. 2d 51 (1972) (emphasis added). See Keyes v. School District No. 1, Denver, Colorado, 413 U.S. 189, 323-334, 93 S. Ct. 2686, 2710, 37 L. Ed. 2d 548 (1973) (Powell, J., concurring) (\"This Court has recognized repeatedly that it is 'extremely difficult for a court to ascertain the motivation, or collection of different motivations, that lie behind a legislative enactment,'. . . . Whatever difficulties exist with regard to a single statute will be compounded in a judicial review of years of administration of a large and complex school system.\"); McGinnis v. Royster, 410 U.S. 263, 276-277, 93 S. Ct. 1055, 1063, 35 L. Ed. 2d 282 (1973); Palmer v. Thompson, 403 U.S. 217, 224-225, 91 S. Ct. 1940-1945, 29 L. Ed. 2d 438 (1971); United States v. O'Brien, 391 U.S. 367, 381, 88 S. Ct. 1673, 1691, 20 L. Ed. 2d 672 (1968).\n\nThe United States Court of Appeals for the Second Circuit has itself emphasized that proof of a discriminatory motive is not required under the equal protection clause.\n\nIt is now well established that a plaintiff alleging unlawful discrimination in violation of the equal protection clause of the Fourteenth Amendment is not required to prove that a discriminatory motive preceded the unlawful effect . . .\n\n[The] Supreme Court has made it clear that it is the effect of state action that is to control a claim for relief under the equal protection clause of the Fourteenth Amendment.\n\nPride (I) v. Community School Board of Brooklyn, New York # 18, 482 F.2d 257, 265, 267, (2d Cir. 1973) (emphasis in original). See Chance v. Board of Examiners, 458 F.2d 1167, 1175-1176 (2d Cir. 1972); Kennedy Park Homes Ass'n v. City of Lackawanna, 436 F.2d 108, 114 (2d Cir. 1971), cert. denied, 401 U.S. 1010, 91 S. Ct. 1256, 28 L. Ed. 2d 546 (1971); Norwalk CORE v. Norwalk Redevelopment Agency, 395 F.2d 920, 931 (2d Cir. 1968). See also Cisneros v. Corpus Christi Independent School District, 467 F.2d 142 (5th Cir. 1972), cert. denied, 413 U.S. 922, 93 S. Ct. 3052, 37 L. Ed. 2d 1044 (1973) (\"School cases serve to emphasize the correctness of this principle, for regardless of motive, the children that suffer from segregation suffer the same deprivation of educational opportunity that Brown condemns. No one would suggest that the validity of a segregation law depends upon the legislators' motives in enacting it, or that such a law is unconstitutional only when it can be ascribed to racial animus. Why then the distinction between types of school board action that produce segregation? '[The] factor of malevolent motivation is farther from the core of invidiousness that condemns explicit racial discrimination than are the odious effects produced.'\"); Goodman, \"De Facto School Segregation: A Constitutional and Empirical Analysis,\" 60 Cal.L.Rev. 275, 284-85 (1972) (\"If the courts are indeed prepared to inquire into motive, thorny questions will arise even if one assumes that racial motivation is capable of being proven at trial. What of the case in which one or more members of a school board, but less than a majority, are found to have acted on racial grounds? What if it appears that the school board's action was prompted by a mixture of motives, including constitutionally innocent ones that alone would have prompted the board to act? What if members of the school board were not themselves racially inspired but wished to please their constituents, many of whom they knew to be so?\").\n\nJudge Skelly Wright wisely points out:\n\nThe complaint that analytically no violation of equal protection vests unless the inequalities stem from a deliberately discriminatory plan is simply false. Whatever the law once was, it is a testament to our maturing concept of equality that, with the help of the Supreme Court decisions in the last decade, we now firmly recognize that the arbitrary quality of thoughtlessness can be as disastrous and unfair to private rights and the public interest as the perversity of a willful scheme.\n\nHobson v. Hansen, 269 F. Supp. 401, 497 (D.D.C.1967), aff'd sub nom. Smuck v. Hobson, 132 U.S.App.D.C. 372, 408 F.2d 175 (1969) (footnotes omitted).\n\nOf course, a showing of illicit motive, while not required, is not irrelevant, for it increases the probability, as well as the stigma, of discrimination.\n\nIn Wright v. Council of City of Emporia, [407 U.S. 451, 461-462, 92 S. Ct. 2196, 33 L. Ed. 2d 51 (1972)] . . . the Supreme Court observed that \"where an action by school authorities is motivated by a demonstrated discriminatory purpose, the existence of that purpose may add to the discriminatory effect of the action by intensifying the stigma of implied racial inferiority.\"\n\nPride (I) v. Community School Board of Brooklyn, New York School District # 18, 482 F.2d 257, 266 (2d Cir. 1973).\n\n4. Harm from De Facto Segregation.\n\nThe conclusion that racial segregation in public schools violates the equal protection clause absent statutory compulsion or authorization and absent even a finding of \"unlawful segregative design\", is supported not only by reason and authority, but also empirically, by the fact that such segregation inflicts upon the segregated, nonwhite students the selfsame harm which the Constitution as interpreted in Brown I sought to prevent.\n\nTheir consignment to predominantly Negro schools . . . causes Negroes to feel that they are being discriminated against, or, as a Negro teenager told Dr. [Robert] Coles, \"contained.\" It would be morally callous, and factually inaccurate, to suggest that their assumption that these schools wear \"a badge of inferiority\" stems solely from their free choice \"to put that construction upon it.\" . . . [The] nation in abolishing Negro slavery merely released the Negro into the bondage of an informal social and economic caste system cemented together by bias and discrimination. Despite the revolution of the last 13 years, these attitudes remain distressingly pervasive forces in race relations even today. What it means to be Negro in America thus \"becomes a psychological fact in [the] daily lives\" of Negro children, who are the heirs and victims of these traditions of prejudice, significantly influencing their attitude toward study and education; understandably, in their view the predominantly Negro school is \"part of a history of exile and bondage.\" And Negroes read in the eyes of the white community the judgment that their schools are inferior and without status, thus confirming and reinforcing their own impressions. . . .\n\nIn an environment defined by such unhealthy attitudes, it should not be surprising that the predominantly Negro schools show a pronounced intrinsic tendency to slide in a pathological direction. This of course affects the schools' teachers, of whatever race, whose own demoralization and low expectations, communicated back to the children, contribute further to the schools' social disintegration in a vicious though understandable circle.\n\nHobson v. Hansen, 269 F. Supp. 401, 420-421 (D.D.C.1967), aff'd sub nom. Smuck v. Hobson, 132 U.S.App.D.C. 372, 408 F.2d 175 (1969) (footnotes omitted). See A. Bickel, The Supreme Court and the Idea of Progress 112 (\"If a Negro child perceives his separation as discriminatory and invidious, he is not, in a society a hundred years removed from slavery, going to make fine distinctions about the source of a particular separation\"). See also Oliver v. Kalamazoo Board of Education, 368 F. Supp. 143, at p. 156 (W.D.Mich.1973); United States Commission on Civil Rights, Racial Isolation in the Public Schools, 109-110, (1967), both quoted above at part III B, supra.\n\nAlthough the principal victims of a racially segregated education are the minority students, it is no less true that racially segregated schools inflict considerable harm on white students and society generally. For example, as one commentator observes:\n\n[De] facto segregation . . . fosters racism in white students, thus significantly raising the level of prejudice and discrimination in the society. Many social scientists are convinced that the all-white neighborhood school is a prime incubator of ethnocentric attitudes and behavior.\n\nGoodman, \"De Facto Segregation: A Constitutional and Empirical Analysis,\" 60 Cal.L.Rev. 275, 335-336 (1972) (footnotes omitted). See also Hobson v. Hansen, 269 F. Supp. 401, 419, 504 (D.D.C.1967), aff'd sub nom. Smuck v. Hobson, 132 U.S.App.D.C. 372, 408 F.2d 175 (1969); I Fleischmann (Commission) Report on the Quality, Cost, and Financing of Elementary and Secondary Education in New York State 226-27 (1973); \"Brief for the Committee of Law Teachers Against Segregation in Legal Education,\" 34 Minn.L.Rev. 289, 319-320 (1950), quoted above at part III B, supra.\n\n5. Internal Segregation.\n\nTracking is a common means of maintaining racial isolation within a school. United States Commission on Civil Rights, Racial Isolation in the Public Schools 161-162 (1967). As the Commission on Civil Rights notes (ibid.):\n\nIf, in a newly desegregated school, children attending the same grade are grouped in separate classrooms on the basis of their achievement level, the result may be the establishment of racially isolated classrooms within the nominally desegregated school. Data from Commission studies show that many Negro students who attend majority-white schools in fact are in majority-Negro classrooms. These students generally perform at the same levels as Negro students in majority-Negro schools.\n\nSo far as the children are concerned, such internal segregation is even more invidious than segregation by schools, since it is impossible to ignore what is observable each day. Internal segregation is illegal. Hobson v. Hansen, 269 F. Supp. 401, 511-514 (D.D.C.1967), aff'd sub nom. Smuck v. Hobson, 132 U.S.App.D.C. 372, 408 F.2d 175 (1969). See M. S. Sorgen, \"Testing and Tracking in Public Schools,\" 24 Hastings L.J. 1129 (1973).\n\n6. Practicability.\n\nThe conclusion that the state has a responsibility to eliminate segregation and that its failure to exercise its powers to that end constitutes an unconstitutional state activity carried to its logical extreme has broad implications. It would lead, as plaintiff's expert explicitly proposed in his testimony in this case, to a mixing of school populations in the entire New York metropolitan area to insure that no child was compelled to attend a racially segregated school. For an area as large as New York City or Metropolitan New York, the problems of practicability become critical. Desegregation may cause such a loss of time and such confusion as to outweigh any possible advantages to the students or society. To require equalization of racial and ethnic percentages in smaller areas such as Brooklyn might also prove abortive because the central portions have such high proportions of black students. Desegregation that results in every school having an overwhelming black and Hispanic student body accomplishes little. This suggests that the rule may include an element of reasonableness. This is to say, the state must act to eliminate de facto racial imbalance unless it is clearly impracticable to do so. Cf., e.g., Hobson v. Hansen, 269 F. Supp. 401, 515 (D.D.C.1967), aff'd sub nom. Smuck v. Hobson, 132 U.S.App.D.C. 372, 408 F.2d 175 (1969) (where desegregation not possible compensatory education required); Bell v. School City of Gary, 213 F. Supp. 819, 831 (N.D.Ind.), aff'd 324 F.2d 209 (7th Cir. 1963), cert. denied, 377 U.S. 924, 84 S. Ct. 1223, 12 L. Ed. 2d 216 (1964); Blocker v. Board of Education of Manhasset, New York, 226 F. Supp. 208, 229 (E.D.N.Y.1964); Wright, \"Public School Desegregation: Legal Remedies for De Facto Segregation,\" 40 N.Y.U.L.Rev. 285, 301 (1965) (\"The fact that the classification to attend the school is based on geography . . . does not make the classification less illegal unless it can be shown that no reasonable classification will alleviate the inequality.\"). This factor has been referred to as the \"rule of reason.\" Keyes v. School District No. 1, Denver, Colorado, 413 U.S. 189, 238, 93 S. Ct. 2686, 2712, 37 L. Ed. 2d 548 (1973) (Powell, J., concurring).\n\nAny reliance upon impracticality would require the state to meet the heavy burden of the compelling necessity test. As the Court of Appeals for this Circuit recently pointed out, discussing its Otero decision in a school segregation case:\n\nAlthough integration was the object of the action in Otero, the method by which it was achieved was outright denial of new public housing to nonwhite persons on account of race. The dangers inherent in such action clearly justify the \"heavy\" burden.\n\nPride (II) v. Community School Board 18, 488 F.2d 321, 327, n.3 (2d Cir. 1973).\n\nThis is an issue we need not address in this case. Here the district involved is small and overwhelmingly white. There is no reason not to take effective steps to desegregate except the constitutionally impermissible one that some white parents do not wish to send their children to black schools or neighborhoods.\n\nAs part of the state's obligation to eliminate segregation there is, of course, a concomitant obligation to insure that there is no diminution of the quality of education afforded white students or of their safety. There is in this case not the slightest factual basis for believing that these factors provide a practical barrier to desegregation.\n\n7. Contrary Decisions.\n\nThere are reported federal appellate decisions from other circuits arguably adopting positions declaring that only classic de jure segregation is unconstitutional. See United States et al. v. Board of Education, Independent School District No. 1, Tulsa, Oklahoma, et al., 459 F.2d 720, 724 (10th Cir. 1972), vacated and remanded, 413 U.S. 916, 93 S. Ct. 3048, 37 L. Ed. 2d 1038 (1973) (\"for further consideration in light of Keyes v. School District No. 1, 413 U.S. 189, 93 S. Ct. 2686, [37 L. Ed. 2d 548]\"); Deal v. Cincinnati Board of Education, 369 F.2d 55, 61 (6th Cir. 1966), cert. denied, 389 U.S. 847, 88 S. Ct. 39, 19 L. Ed. 2d 114 (1967); Downs v. Board of Education, 336 F.2d 988, 998 (10th Cir. 1964), cert. denied, 380 U.S. 914, 85 S. Ct. 898, 13 L. Ed. 2d 800 (1965); Bell v. School City of Gary, 324 F.2d 209, 213 (7th Cir. 1963), cert. denied, 377 U.S. 924, 84 S. Ct. 1223, 12 L. Ed. 2d 216 (1964). See also United States Commission on Civil Rights, Racial Isolation in the Public Schools 223 (1967) (\"The issue of whether the equal protection clause forbids adventitious school segregation has been litigated frequently, but remains an open question.\"). Each of these cases was decided in terms of the principle that proof of illicit motive is required to sustain an equal protection claim of unlawfully segregated schools. For reasons stated above, this principle is not applicable to the instant case where school authorities acted and failed to act knowing segregation would be the result of their decisions.\n\n8. Congruence of State Policy.\n\nWhile not decisive, it is of some significance that the conclusion in this case that segregation in New York is illegal apart from motive is congruent with New York State policy. \"New York [purports] to require the elimination of racial imbalance in all schools.\" United States Commission on Civil Rights, Racial Isolation in the Public Schools 23 (1967); Id. at 233, 234, n. 10 (New York cases collected). See also I Fleischmann (Commission) Report on the Quality, Cost and Financing of Elementary and Secondary Education in New York State 226-227 (1973). This is also the policy expressed in the testimony in the instant case by the New York City Board of Education and the Chancellor of the New York City School system -- though some doubt has been expressed about the efficacy of the techniques used to execute that policy. See D. Rogers, 110 Livingston Street 34 (1968); Steing, \"Strategies for Failure,\" 41 Harv.Ed.Rev. 158 (1971); cf. D. Ravitch, The Great School Wars 241-311 (1974). Thus, the conclusion of this court enforces rather than flouts state policy and no possible considerations of comity require forbearance.\n\nUnder United Mine Workers v. Gibbs, 383 U.S. 715, 86 S. Ct. 1130, 16 L. Ed. 2d 218 (1966), we would exercise pendent jurisdiction to enforce the state law requiring desegregation. See Pride (I) v. Community School Board 18, 482 F.2d 257, 271-272 (2d Cir. 1973).\n\nC. Segregation is Not Constitutionally Acceptable Whether Desired by a Minority or a Majority.\n\n1. Minority Desire\n\nIt has been urged that self-imposed segregation in the public schools is desirable and therefore constitutional. See, e.g., F. Mosteller and D. P. Moynihan, On Equality of Educational Opportunity 62 (Vintage ed. 1972); I. E. Robinson, Jr., \"Preparation for Life: The Black Classroom,\" in J. Haskins, Black Manifesto for Education 8 (1973); R. W. Crary and L. A. Petrone, Foundations of Modern Education 433 (1971).\n\nThis position would have to be rejected even were there basis in fact for the position that segregated schools improved the education of black students -- a proposition belied by data available to date. See, e.g., subsection 3 infra ; A. F. Allen, \"The Politics of Urban Education,\" in J. Haskins, Black Manifesto for Education 60-61 (1973); K. B. Clark, \"Issues in Urban Education,\" in J. Haskins, Black Manifesto for Education 76 (1973) (\"There is not a single exception anywhere in this country to the basic finding that racially homogeneous, predominantly black or minoritygroup schools are inefficient in terms of providing these children with an effective education and that the norm is underachievement in these schools\"); W.E.B. DuBois: The Crisis Writings 86-87 (Ed. D. Walden, 1972) (\"Some people in . . . Northern cities are quietly trying to establish separate colored schools. This is wrong, and should be resisted by black men and white. Human contact, human acquaintanceship, human sympathy is the great solvent of human problems. Separate school children by wealth and the result is class misunderstanding and hatred. Separate them by race and the result is war. Separate them by color and they grow up without learning the tremendous truth that it is impossible to judge the mind of a man by the color of his face.\").\n\nNew York State bars segregation imposed by minorities. See Buder, \"Regents Act to Bar College Segregation A Minority Imposes,\" N.Y. Times, Dec. 15, 1973, p. 1, col. 2. The Board of Regents, by an official policy statement, has called for full desegregation in higher education. Ibid. It had long had this policy for other schools.\n\n2. Majority Desire\n\nShortly after Brown the point was made in the most dramatic way possible that whites could not prevent desegregation by force. President Eisenhower sent federal troops into Little Rock to help enforce federal court decrees requiring desegregation.\n\nSince then a more subtle form of resistance has been threatened. If desegregation is ordered, it has been said, whites will flee the system. Voluntary movement is guaranteed by the Constitution. See Shapiro v. Thompson, 394 U.S. 618, 89 S. Ct. 1322, 22 L. Ed. 2d 600 (1969); see also Emerson, Haber and Dorsen, Political and Civil Rights in the United States: The Right to Travel, Vol. I, 1973 Supp. at pp. 409-416. So, too, is the right to choose private schools over public schools. See Pierce v. Society of Sisters, 268 U.S. 510, 45 S. Ct. 571, 69 L. Ed. 1070 (1925).\n\nNevertheless, the threat of white disappearance cannot be used as an excuse for continuing segregated schools. As the District Court in Tennessee recently declared:\n\nThe Court is not unsympathetic to the concern expressed by the Board for minimizing the voluntary departure of white students from the system. It must be apparent, however, that this objective cannot serve as a limiting factor on the constitutional requirement of equal protection of the laws, nor as a justification for retaining de jure segregation. Concern over \"white flight\", as the phenomenon was often referred to in the record, cannot become the higher value at the expense of rendering equal protection of the laws the lower value.\n\nMapp et al. v. Board of Education of City of Chattanooga, Tennessee, 366 F. Supp. 1257, at 1260, Opinion and Order at 4-5 (E.D.Tenn. No. 3564, November 16, 1973). See Monroe v. Board of Commissioners, 391 U.S. 450, 459, 88 S. Ct. 1700, 1705, 20 L. Ed. 2d 733 (1968) (\"We are frankly told in the Brief that without the transfer option it is apprehended that white students will flee the school system altogether. 'But it should go without saying that the vitality of these constitutional principles cannot be allowed to yield simply because of the disagreement with them.'\").\n\nFollowing remand in the Keyes case the Superintendent of Schools of Denver stated that he opposed the orders of desegregation because of the serious threat of \"accelerated white flight from the city\", New York Times, December 28, 1973, p. 14, col. 1. Nevertheless, the court persisted, as the Constitution compelled it to. Ibid.\n\nNo one can deny that the problem exists. But it must be solved by constitutional means, providing a school system that will work under desegregated conditions.\n\nThe Constitution forbids segregated schooling whether provided at the behest of blacks or whites. The state may not use taxpayers' money to support a segregated system. Blacks or whites desiring to utilize such a system must find it without the aid of the state. \"The principle is deeply imbedded in the very fabric of this Republic that constitutionally secured rights are not subject to popular referendum.\" Oliver v. Kalamazoo Board of Education, 346 F. Supp. 766, 781-782 (W.D.Mich.1971), aff'd 448 F.2d 635 (6th Cir. 1971). Neither a majority nor a minority may override the Constitution.\n\n3. Impact of Available Research\n\nWhile recognizing some of the force of application of the Brown doctrine requiring non-segregated education, the local school board defendants urge that recent studies show that requiring desegregation will not appreciably improve education of minorities and will have the long-term effect of weakening the public school system. This contention, justifying the status quo of minority segregation, was made in other forms by John W. Davis in the Brown cases and was spurned by the Brown holding. See Argument: The Oral Argument Before the Supreme Court in Brown v. Board of Education of Topeka 57-61 (Ed. L. Friedman 1969).\n\nThe present status and condition of the blacks, creating severe educational, housing and other problems in the North, stems directly from slavery imposed in the South and accepted in the North and from the post-Civil War attempt to maintain the blacks' inferior social and legal position despite the Thirteenth, Fourteenth and Fifteenth Amendments. It is not only Plessy v. Ferguson, 163 U.S. 537, 16 S. Ct. 1138, 41 L. Ed. 256 (1896), providing the legal basis for imposed segregation, but the conspiracy -- explicit and implicit -- of an entire society and its local, state and federal governmental arms to impose social, political and economic segregation that has in large measure created the racial dilemmas our country now faces.\n\nAs Lincoln reminded us in the Second Inaugural Address, payment for \"the bondsman's two hundred and fifty years of unrequited toil\" was made in the wealth and blood sunk in the Civil War. So, too, the cost of a hundred post-Civil War years of evasion of the promise of racial equality is being paid in such forms as fear of crime, welfare costs, public housing expenditure, and problems with ill-educated children, broken families and massive discontents in the ghettos of this country. The cost can not be avoided on the ground that it is difficult or inconvenient to make the payment.\n\nThe argument that white children of the North should not be forced to pay the cost of rectifying mistakes of others cannot be ignored. But, even if it had basis in fact -- i.e., that their education would be adversely affected by desegregation -- it could not be used to deny plaintiffs what the Constitution guarantees to them -- a non-segregated education.\n\nFortunately, the evidence supports neither the argument that desegregated public school education is not helpful to the minorities, nor that it adversely affects whites. While much of the current research replies to precise policy based questions with the ambiguity of a Delphic oracle, confirming Veblen's remark that \"the outcome of any serious research can only be to make two questions grow where one question grew before,\" none of it furnishes grounds for questioning basic constitutional policy favoring desegregated schooling. See, e.g., M. Weinberg, The Education of the Minority Child: A Comprehensive Bibliography (1970); M. Weinberg, Desegregation Research: An Appraisal (2d ed. 1970); \"Bibliography on Race and Schools,\" Integrated Education Magazine (updating bibliography in each edition); F. Mosteller, D. Moynihan, et al., On Equality of Opportunity (1972); J. Haskins, Black Manifesto for Education (1973); Coleman et al., Equality of Educational Opportunity (1966) [hereafter referred to as the Coleman Report]; C. Jencks et al., Inequality: A Reassessment of the Effect of Family and Schooling in America (1972); Report of the United States Commission on Civil Rights, Racial Isolation in the Public Schools 77-114 (1967); Report of the Select Committee on Equal Educational Opportunity, United States Senate, Towards Equal Educational Opportunity, Sen. Report No. 92-000, 92d Cong., 2d Sess. (1972); I Fleischmann (Commission) Report on the Quality, Cost, and Financing of Elementary and Secondary Education in New York State (1973); C. E. Silberman, Crisis in the Classroom: The Remaking of American Education (1970).\n\nThe Coleman Report is the product of the most comprehensive study to date. Since it was conducted pursuant to the mandate of section 402 of the Civil Rights Act and its data and discussions furnish much of the grist for current debate, it is well to set forth some of its conclusions. There seems to be no doubt that the average black and Spanish surname pupil starts school behind whites and steadily drops further back. Coleman Report at 21.\n\nPlacing the black child in a school environment where highly motivated white middle class students are in the majority improves the blacks' learning capacity, without reducing that of the whites. Id. at 22, 29. Characteristics of fellow-students are critical, not only in creating a favorable environment for learning, but in making easier a successful transition into the larger society. White children's respect for blacks when they associate in integrated classes is higher. Id. at 331. An analysis of the data by regions shows particular significance for schools in the Northeast. \"In the Metropolitan Northeast the average score for students who have only attended segregated schools is consistently lower than those groups of students with other experiences.\" Id. at 331.\n\nThe Coleman Report has been authoritatively read as demonstrating that \"the average performance of disadvantaged Negro students is better when the social class level of the student body is higher. . . . this relationship is true for disadvantaged white students as well.\" United States Commission on Civil Rights, Racial Isolation in the Public Schools 84 (1967). This, and other studies, the Commission on Civil Rights concluded, tended to \"confirm the maxim that students learn as much from each other as from their teachers.\" Id. at 87. No adverse effect from desegregation on white students where the school is half or more white has been found. Id. at 160. The Commission summed up the available data and its own studies as follows (Id. at 113-114):\n\nThe outcomes of education for Negro students are influenced by a number of factors including students' home backgrounds, the quality of education provided in their schools, and the social class background of their classmates. In addition to these factors, the racial composition of schools appears to be a distinct element. Racial isolation in the schools tends to lower students' achievement, restrict their aspirations, and impair their sense of being able to affect their own destiny.\n\nBy contrast, Negro children in predominantly white schools more often score higher on achievement tests, develop higher aspirations, and have a firmer sense of control over their own destinies.\n\nDifferences in performance, attitudes, and aspirations occur most often when Negroes are in majority-white schools. Negro children in schools that are majority-Negro often fail to do better than Negro children in all-Negro schools. In addition, the results stemming from desegregated schooling tend to be most positive for those Negro children who began their attendance at desegregated schools in the earlier elementary grades.\n\nAn important contributing element to the damage arising from racially isolated schools is the fact that they often are regarded by the community as inferior institutions and students and teachers sense that their schools are stigmatized. This has an effect on their attitudes which influences student achievement.\n\nRacial isolation also appears to have a negative effect upon the job opportunities of Negroes. Negro adults who experienced desegregated schooling tend to have higher incomes and more often hold white-collar jobs than Negro adults who attended isolated schools. These differences are traceable to the higher achievement levels of the Negroes from desegregated schools, and, in part, to the fact that association with whites often aids Negroes in competing more effectively in the job market.\n\nAttendance in racially isolated schools tends to generate attitudes on the part of Negroes and whites that lead them to prefer association with members of their own race. The attitudes appear early in the schools, carry over into later life, and are reflected in behavior. Both Negroes and whites are less likely to have associations with members of the other race if they attended racially isolated schools. Racial isolation not only inflicts educational damage upon Negro students when they are in school, it reinforces the very attitudes and behavior that maintain and intensify racial isolation as well.\n\nMoreover, the absence of interracial contact perpetuates the sense that many whites have that Negroes and Negro schools are inferior.\n\nRacial isolation in schools has apparent effects on both Negro children and adults. This effect can be direct and obvious -- as in impaired achievement and aspirations. It can be indirect and subtle -- as in the negative interracial attitudes and behavior which further perpetuate the racial isolation. In either case, it contributes to the continuing process of damage and isolation.\n\nThe study by Jencks and his associates is somewhat skeptical of conclusions to be drawn from available data and finds no \"significant\" \"pedagogical effects\" from tracking. C. Jencks et al., Inequality: A Reassessment of the Effect of Family and Schooling in America, 106-107 (1972). The conclusion of this study is that desegregated education does aid blacks without adversely affecting whites and that it creates a more favorable climate for an integrated society. Id. at 106.\n\nSimilar reservations about the firmness of the conclusions to be drawn from available studies, with agreement that desegregation has positive benefits, comes from the Harvard University faculty seminar on the Coleman Report. F. Mosteller and D. P. Moynihan, On Equality of Educational Opportunity (Vintage ed. 1972). The conclusion of this reanalysis of Coleman's data is that \"Racial integration where minority group students were not a majority seemingly improved the level of achievement for them, without lowering it for others. But the improvement was not great.\" Id. at 24.\n\nIt may well be that family-income programs may have a greater impact on learning capacity than changes in schools and other social action because \"what can be done at schools is conditioned by the situation at home.\" Id. at 56. But that does not allow the schools to be ignored since they are one of government's important social fulcrums and the Constitution requires desegregated schools.\n\nA great deal depends, of course, on the nature of desegregation -- whether it creates a hostile environment, for example, or is intelligently planned and executed to reduce the level of hostility between the races. Id. at 359-366 (D. K. Cohen, T. F. Pettigrew and R. T. Riley, Race and the Outcomes of Schooling).\n\nEven were the available research to suggest that segregation in schools had beneficial effects, the Constitution would forbid segregation as governmental policy. But,\n\n[Virtually] none of the negative predictions by anti-desegregationists finds support in studies of actual desegregation. The rejected predictions concerned lower achievement, aggravated self-concepts of Negro children, and growing disorder in desegregated schools.\n\nM. Weinberg, Desegregation Research: An Appraisal 379 (2d ed. 1970).\n\nThe failure of the public schools to educate many children from poor families is not new. C. E. Silberman, Crisis in the Classroom, The Remaking of American Education 53-58 (1970). What is new is a realization by more members of all classes that in a modern technical economy there is little room for the uneducated no matter how strong the desire to work. Moreover, there is less inclination to accept the status of a second class citizenship based upon unworthiness of background. The second third of the twentieth century has seen a growing reluctance by Americans generally to accept the discrepancy between theoretical and actual equality of opportunity and respect. See F. Mosteller and D. P. Moynihan, On Equality of Educational Opportunity 58-60 (Vintage Books ed. 1972). The fact that large gains have been made is a reason for self-congratulation, but not for allowing continuing unconstitutional segregation to continue.\n\nThere are, of course, serious pedagogical issues facing the schools, such as, what is the extent to which instruction of black children should make use of a non-standard dialect and special experiences in teaching them to read or, should the classroom be used to induce the use of American standard dialect and acceptance of middle class assumptions. Compare J. Kozol, Death at an Early Age 200 (1967) with S.S. and J. C. Baratz, \"Negro Ghetto Children and Urban Education: A Cultural Solution,\" 33 SOCIAL Education 401-404 (April 1969) and J. Olsen, \"Challenge of the Poor to the Schools,\" XLVII Phi Delta Kappa, 79-84 (October 1965), reprinted in W. E. Beckner and W. Dumas, American Education: Foundations and Superstructures 73-90 (1970); and see R. W. Crary and L. A. Petrone, Foundations of Modern Education 396-413, 435-36 (1971).\n\nThese problems may, the court recognizes, be compounded where rich and poor, black and white, are integrated in public schools, bringing to the same classrooms different patterns of speech and varying life styles. But this is a problem -- and an advantage -- of a heterogeneous democratic society.\n\nThere also may be some basis for the contention of some blacks that some white teachers expect black children to fail and, therefore, do not have the emotional ability to successfully teach them. But, as already noted, segregation desired by blacks is no more acceptable than that enforced by whites. Cf. R. W. Crary and L. A. Petrone, Foundations of Modern Education 432-36 (1971); C. E. Silberman, Crisis in the Classroom: The Remaking of American Education 83-112 (1970).\n\nThese problems of technique are for school authorities. They have the broadest freedom to develop curriculae so long as illegal segregation is not utilized. Even if it were the case -- and it is not -- that some segregated students of Mark Twain, with smaller classes, a chance to develop minority power and control, and extra funds, might be better off than they would be in a desegregated school, their wish for segregation must be rejected on constitutional grounds. The fact, however, that this class action has been vigorously pressed suggests that the view that segregation is helpful is not reflective of the thinking of parents of children attending Mark Twain.\n\nDesegregation is required, not because it will necessarily improve pupils' scores in the three R's, but because the Constitution requires it.\n\nD. Duty of Housing Authorities\n\n1. State Authorities\n\nIn its trial memorandum, the third-party defendant New York City Housing Authority admitted its affirmative duty to integrate the housing built under its jurisdiction, pursuant to the United States Constitution, the Civil Rights Act of 1871, 42 U.S.C.  1983, the Civil Rights Act of 1964, 42 U.S.C.  2000d, and the Fair Housing Act of 1968, 42 U.S.C.  3601, 3604, and 3608(d)(5). Commenting on these statutory provisions, the United States Court of Appeals for the Third Circuit stated:\n\nWhatever were the most significant features of a workable program for community improvement in 1949, by 1964 such a program had to be nondiscriminatory in its effects.\n\nShannon v. United States Dept. of Housing \u0026 Urban Development, 436 F.2d 809, 816 (3d Cir. 1970).\n\nRecently, the United States Court of Appeals for the Second Circuit elaborated on this affirmative duty to integrate:\n\nWe agree with the parties and with the district court that the Authority is under an obligation to act affirmatively to achieve integration in housing. The source of that duty is both constitutional and statutory. Various discriminatory housing practices have been outlawed by judicial decree as violative of the Equal Protection Clause. An authority may not, for instance, select sites for projects which will be occupied by non-whites only in areas already heavily concentrated with a high proportion of non-whites. A tenant assignment policy which assigns persons to a particular project because of the concentration of persons of his own race already residing at the project has been prohibited. An authority is barred from using assignment methods which seek to exclude, or have the evident effect of excluding, persons of minority races from residing in predominantly white areas or of restricting non-whites to areas already concentrated by non-white residents. Not only may such practices be enjoined, but affirmative action to erase the effects of past discrimination and desegregated housing patterns may be ordered.\n\nAn additional source of the affirmative duty to integrate is found in the 1968 Fair Housing Act (\"the Act\" herein) which provides that \"[it] is the policy of the United States to provide, within constitutional limitations, for fair housing throughout the United States,\" 42 U.S.C.  3601, and, in  3608, that \"(d) The Secretary of Housing and Urban Development shall . . . (5) administer the programs and activities relating to housing and urban development in a manner affirmatively to further the policies of this sub-chapter.\" It is true that the Act was designed primarily to prohibit discrimination in the sale, rental, financing, or brokerage of private housing and to provide federal enforcement procedures for remedying such discrimination so that members of minority races would not be condemned to remain in urban ghettos in dense concentrations where employment and educational opportunities were minimal. However, we are satisfied that the affirmative duty placed on the Secretary of HUD by  3608(d)(5) and through him on other agencies administering federally-assisted housing programs also requires that consideration be given to the impact of proposed public housing programs on the racial concentration in the area in which the proposed housing is to be built. Action must be taken to fulfill, as much as possible, the goal of open, integrated residential housing patterns and to prevent the increase of segregation, in ghettos, of racial groups whose lack of opportunities the Act was designed to combat. Senator Mondale, who drafted  810(a) of the Act, 42 U.S.C.  3610, pointed out that the proposed law was designed to replace the ghettos \"by truly integrated and balanced living patterns.\" 114 Cong.Rec. 3422.\n\nOtero v. N.Y.C. Housing Authority, 484 F.2d 1122, 1133-1134 (2d Cir. 1973) (footnotes and case citations omitted). Cf. A. Downs, Opening up the Suburbs 98-100 (1973).\n\nIt is the Housing Authority's contention, however, that this affirmative duty to integrate is moderated by the Authority's policy of giving priority to former site and area residents. Cf. Otero v. N.Y.C. Housing Authority, 484 F.2d at 1135-1136. We need not decide what weight should be accorded this contention in the context of a case like Otero, where no issue of school segregation is involved. The fact is that the case at hand, unlike Otero, involves a claim of racially segregated education.\n\nRacially imbalanced housing is a contributing cause of racial segregation in schools. See Note, \"De Facto School Segregation and the 'State Action' Requirement: A suggested New Approach,\" 48 Ind.L.J. 304, 324 n. 101 (1973); Note, \"Consolidation for Desegregation: The Unresolved Issue of the Inevitable Sequel,\" 82 Yale L.J. 1681, 1686-87 nn. 48-52 (1973). In remedying the condition of unconstitutional racial segregation at Mark Twain, this court has the power and duty to require not only the School Board to act, but other agencies of the state as well, including the New York City Housing Authority.\n\nThe Fourteenth Amendment, by its very terms, speaks to the state. An equal protection claim of racially segregated education is actionable against a school board because the board is, for constitutional purposes, an agency of the state. If the school board is found liable for racial segregation, then the state, as the principal whose agent the school board is, is also necessarily liable. Consequently, in remedying the racial segregation for which the state is liable, this court may require the state, through its other agencies and political subdivisions, to participate and cooperate in remedial action. See Bradley v. Milliken, 484 F.2d 215, at 239 (6th Cir., 1973), cert. granted, 414 U.S. 1038, 94 S. Ct. 538, 38 L. Ed. 2d 329 (1973) (\"Under the Constitution of the United States . . . the responsibility for providing educational opportunity to all children on constitutional terms is ultimately that of the state . . . . That a state's form of government may delegate the power of daily administration of public schools to officials with less than statewide jurisdiction does not dispel the obligation of those who have broader control to use the authority they have consistently with the constitution. In such instances the constitutional obligation toward the individual school children is a shared one.\") (emphasis added).\n\n2. Federal Authorities\n\nThe federal housing authorities are under the same compulsions to avoid segregated housing as are city and state officials. The Secretary of Housing and Urban Development must \"affirmatively promote fair housing.\" Shannon v. United States Dep't of Housing \u0026 Urban Development, 436 F.2d 809, 816 (3d Cir. 1970). See also Otero v. New York City Housing Authority, 484 F.2d 1122, 1133-1134 (2d Cir. 1973). Federal complicity in encouraging segregated schooling through its housing programs and policies is as improper under the Fifth Amendment as is that of the state under the Fourteenth. Bolling v. Sharpe, 347 U.S. 497, 74 S. Ct. 693, 98 L. Ed. 884 (1954). Cf. Penn v. Schlesinger, 490 F.2d 700, 702-703 (5th Cir. 1973), en banc rehearing granted, 490 F.2d 700 (1973) (42 U.S.C.  1981 and 1982 bars all discrimination against blacks because of race by federal government). So heavily involved is the federal government in the funding and supervision of building in Central Coney Island, that without its participation the housing program would collapse. The chart below illustrates the extent of the federal presence in the Mark Twain area. Federal Housing Programs in School Area Program Housing Act United States Code Urban Renewal Title I, Housing Act 42 U.S.C.  1450 of 1949, as added by et seq. the Housing Act of 1954. Education, Title VIII, Civil Rights 42 U.S.C.  3601Technical Act of 1968 et seq.Assistance andEnforcement,Fair Housing Research, Title V, Housing and P.L. 91-609 (1970)Demonstration Urban Developmentand Technology Act of 1970Programs Multifamily Loan Section 236, National 12 U.S.C.  1715z-1Insurance and Housing Act of 1934,Interest Subsidy, as added by thefor Low Income Housing and UrbanFamilies Development Act of 1968 Finance: FHA payment to mortgagee of FHA mortgage insurance premium and in- terest on mortgage over 1 percent, and FHA guarantee of 100 percent mortgage of up to 40 years. Income: Income (95 percent of regular gross earnings of all family members over 21 during preceding 12 months, less $300 per minor) must be under 135 percent of public housing admission limits. Rental: 25 percent of income but up to 20 percent of units in a project may be leased under rent supplement or public housing leasing programs, under their respective requirements. Low-Rent Public United States Housing 42 U.S.C.Housing Act of 1937, as amended  1401 et seq. Finance: Payment by HUD of principal and interest on 40-year-tax-exempt bonds of LHA for development cost; and, in some cases, part payment of operating expenses but total payment may not exceed 2 percent over going federal yield on its securities and development cost. Income: 20 percent of income must be less than 80 percent of rentals of available private housing, exact figure locally determined. Rental: Approximately 20 percent of income; exact figures set by local housing authority; may not exceed 25 percent income. Rent Supplement Section 101, Housing and 12 U.S.C.Program Urban Development Act of  1701s 1965 Finance: Payment by FHA to owner of difference between unsubsidized rent and 25 percent of tenant's income but not over 70 percent of unsubsidized rent. 12 U.S.C.  1701s Income: Income (95 percent of regular gross earnings of all family members over 21 during preceding 12 months, less $300 per person) of all family members must be under 100 percent of public housing eligibility; assets under $2000 ($5000 if over age 62). Rental: 25 percent of income.\n\nAs a practical matter, there is, in the urban renewal area surrounding Mark Twain Junior High School, a joint enterprise of the City of New York, the State of New York, and the United States. Cf. McQueen v. Druker, 438 F.2d 781, 784-785 (1st Cir. 1971). Illegal activities in the way of segregation in public housing leading to segregation in the schools must be chargeable to all three levels of government. Federal officials have the effective power to prevent discrimination in housing in this area.\n\nThe Civil Rights Act of 1964 was enacted by the Congress and approved by President Johnson on July 2, 1964 (P.L. 88-352, 78 Stat. 241). Section 601 of this Title (VI) provides that \"No person in the United States shall, on the ground of race, color or national origin, be excluded from participation in, be denied the benefits of, or be subjected to discrimination under any program or activity receiving Federal financial assistance.\" 42 U.S.C.  2000d. This provision laid down a strong national policy against discrimination in any program or activity financed by the federal government and, as far as housing is concerned, supported the Executive Branch's pronouncement to that effect in President Kennedy's Executive Order. E.O. 11063.\n\nMany of the recipients of federal funds such as states, counties, municipalities and their agencies are prohibited from discriminating by the equal protection clause of the Fourteenth Amendment to the Constitution of the United States. The Executive Order and Title VI provided a means to hold back federal funds where discriminatory conduct occurred through state action. See, e.g., Board of Public Instruction of Taylor Co., Fla. v. Finch, 414 F.2d 1068 (5th Cir. 1969). As demonstrated by an affidavit of S. William Green, Regional Administrator of Region II of the Department of Housing and Urban Development, with responsibility for the Coney Island area, the Department takes an active role in carrying out the racial policies of the federal government in public housing in Coney Island.\n\nMoreover, the proper role of the federal government in these matters certainly does not end with housing. The general responsibility of the federal government to assist a state government and agencies of a state in desegregating public schools is clear. See 42 U.S.C.  2000c-2; Title I of the Office of Education Appropriations Act, 1971 (P.L. 91-380, 84 Stat. 800); 20 U.S.C.  1601 et seq. (The Emergency School Aid Act); 20 U.S.C.  1651 et seq.; cf. Kelley v. Metropolitan County Board of Nashville and Davidson County, Tennessee, 372 F. Supp. 540, 560 (M.D.Tenn., 1973) (Federal executive no-funds-for-bussing policy held violative of federal legislation; also, federal third-party defendants held to have \"violated the equal protection right of the original and third-party plaintiffs by enforcing the blanket prohibition against federal funding for school transportation. . . . [These] federal officials placed the Executive Branch of the federal government in violation of the mandate of Brown v. Board of Education . . . and broke the longstanding commitment of this Government to elimination of segregation in this nation's schools.\").\n\n3. Procedural Defenses\n\nThe third-party defendants submit that two procedural defenses require dismissal of the case against them. First, under Rule 14 of the Federal Rules of Civil Procedure, this is an improper third-party complaint, and, second, administrative remedies to correct any governmental segregative housing practices have not been exhausted. Both these arguments have some force, but in the present posture of the case they are irrelevant.\n\nIt is urged that this is an improper third-party complaint because the housing authorities cannot be liable to the Community School Board for plaintiffs' claim against the Board since \". . . a defendant cannot assert an entirely separate claim against a third party under Rule 14, even though it arises out of the same general set of facts as the main claim; there must be an attempt to pass on to the third party all or part of the liability asserted to the defendant.\" Moore's Federal Practice, para. 14.07. Impleader under Rule 14(a) normally does require liability to the main defendant on the part of the person impleaded under some provision of substantive law. General Dynamics Corp. v. Adams, 340 F.2d 271, 279 (5th Cir. 1965); Uptagrafft v. United States, 315 F.2d 200, 202-203 (4th Cir.), cert. denied, 375 U.S. 818, 84 S. Ct. 54, 11 L. Ed. 2d 52 (1963); Brown v. Cranston, 132 F.2d 631, 633-634 (2d Cir. 1942), cert. denied, 319 U.S. 741, 63 S. Ct. 1028, 87 L. Ed. 1698 (1943); Kantlehner v. United States, 279 F. Supp. 122, 124 (E.D.N.Y.1967).\n\nHere the plaintiffs seek to enjoin the School Board and other defendants from \"continuing to pursue and carry out policies and practices which authorize, sanction, and encourage discrimination in educational opportunities\" against the children attending J.H.S. 239 and to require the defendants to \"promote, develop, and implement a plan for ending the maintenance of racially imbalanced and under-utilized schools\" in District 21.\n\nNumerous Supreme Court cases beginning with Brown v. Board of Education of Topeka, 347 U.S. 483, 74 S. Ct. 686, 98 L. Ed. 873 (1954) through Swann v. Charlotte-Mecklenburg Board of Education, 402 U.S. 1, 91 S. Ct. 1267, 28 L. Ed. 2d 554 (1971) have held that school boards are themselves legally responsible for meeting the constitutional requirements of providing integrated education for the children of their school district. They cannot argue that housing patterns make such a responsibility difficult to meet or shift responsibility to housing authorities, requiring them to correct residential segregation before school segregation is eliminated. See, e.g., Cisneros v. Corpus Christi Independent School District, 467 F.2d 142 (5th Cir. en banc 1972), cert. denied, 413 U.S. 922, 93 S. Ct. 3052, 37 L. Ed. 2d 1044 (1973); United States v. Texas Education Agency, 467 F.2d 848, 863-864 n. 22 (5th Cir. 1972); Northcross v. Board of Education of Memphis City Sch., 466 F.2d 890 (6th Cir. 1972); Davis v. School District of City of Pontiac, Inc., 309 F. Supp. 734 (E.D.Mich.S.D.1970), aff'd 443 F.2d 573 (6th Cir.), cert. denied, 404 U.S. 913, 92 S. Ct. 233, 30 L. Ed. 2d 186 (1971); Taylor v. Board of Ed. of City School District of New Rochelle, 195 F. Supp. 231 (S.D.N.Y.), aff'd 294 F.2d 36 (2d Cir. 1961), cert. denied, 368 U.S. 940, 82 S. Ct. 382, 7 L. Ed. 2d 339 (1961); and see also cases cited in Part III B, supra.\n\nWhile in a literal sense, the housing authorities are not \"liable to\" the defendant school authorities \"for all or part of\" the plaintiffs' claim against the defendants, they are partly \"liable for\" the harm, in the sense that their actions help maintain segregated schools. Rule 14, Fed.R.Civ.P.\n\nMore important, no effective decree requiring desegregation of the schools is possible without a shift in the racial composition of the tenants in the public housing controlled by third-party defendants. As indicated in Part V A and D, infra, the state is responsible for carrying out the decree of the court and it must use each of its arms -- including its housing authorities -- to effectuate desegregation of the schools. Since these instrumentalities of the state necessary to carry out the decree are already parties, \"the just, speedy, and inexpensive determination\" of the action requires that they remain in the case. Rule 1, Fed.R.Civ.P.\n\nThe United States housing authorities are not units of the state, but they do have a responsibility not to cause segregated schools -- whether state or federal. Bolling v. Sharpe, 347 U.S. 497, 74 S. Ct. 693, 98 L. Ed. 8843 (1954). As we have found, the public housing in Coney Island is in every practical sense a continuing joint effort of federal, state, city and private enterprises. Cf. Thompson v. Washington, 162 U.S. App. D.C. 39, 497 F.2d 626 (D.C.Cir. 1973) (continuing power of HUD to supervise rents even after projects completed). Nothing effective can be done to remedy the housing situation without the active concurrence and participation of the federal government. Since its presence is required to insure that the court's decree is not flouted and is fully implemented, it should remain a party to the action.\n\nIn a real sense the federal housing authorities are \"in privity\" with the defendants and the third-party defendants and will be bound by the decree. Rule 65(d), Fed.R.Civ.P.; Golden State Bottling Co. v. National Labor Relations Board, 414 U.S. 168, 175-181, 94 S. Ct. 414, 421-423, 38 L. Ed. 2d 388 (1973). As the Supreme Court pointed out in Golden State Bottling Co. (Id. at 179-180, 94 S. Ct. at 422-423):\n\nRule 65(d) \"is derived from the common-law doctrine that a decree of injunction not only binds the parties defendant but also those identified with them in interest, in \"privity\" with them, represented by them or subject to their control.\" Regal Knitwear [v. NLRB], 324 U.S. 9, 13, [65 S. Ct. 478, at 481, 89 L. Ed. 661]. Persons acquiring an interest in property that is a subject of litigation are bound by, or entitled to the benefit of, a subsequent judgment, despite a lack of knowledge. Restatement of Judgments  89, and comment c. (1942); see I Story, Equity Jurisprudence  536 (14th ed. 1918). This principle has not been limited to in rem or quasi in rem proceedings. Restatement of Judgments, supra,  89, comment d.; see ICC v. Western N. Y. \u0026 P.R. Co., 82 F. 192, 194 (W.D.Pa.1897). We apply that principle here in order to effectuate the public policies of the Act. \" Courts of equity may, and frequently do, go much farther both to give and withhold relief in furtherance of the public interest than they are accustomed to go when only private interests are involved.\" Virginia R. Co. v. Systems Federation, 300 U.S. 515, 552 [57 S. Ct. 592, 601, 81 L. Ed. 789] (1937); see Walling v. James V. Reuter, Inc., supra, 321 U.S. [671] at 674-675 [64 S. Ct. 826, at 827, 88 L. Ed. 1001]. We hold that a bona fide purchaser, acquiring, with knowledge that the wrong remains unremedied, the employing enterprise which was the locus of the unfair labor practice, may be considered in privity with its predecessor for purposes of Rule 65(d). (Emphasis supplied.)\n\nIt is true that \"[impleader] is not a device for bringing into an action any controversy which may happen to have some relation to it.\" Moore's Federal Practice para. 14.04. Here the housing aspects of the controversy are inextricably intertwined with the school dispute. Dismissal on the ground of improper impleader must be denied.\n\nIt is significant that in Bradley v. Milliken, 484 F.2d 215, at 251 (6th Cir. 1973), cert. granted, 414 U.S. 1038, 38 L. Ed. 2d 329 (1973), an order was made against \"school districts . . . not parties to the litigation.\" Since they were \"arms and instrumentalities of the State of Michigan,\" they were subject to the decree. Ibid. Pursuant to Rule 19 of the Federal Rules of Civil Procedure, however, they had a right to be made parties and to be heard. As the court noted (Id. at p. 251):\n\nRule 19, Fed.R.Civ.P. provides that a person who is subject to service of process shall be joined as a party to the action if \"in his absence complete relief cannot be accorded among those already parties.\" Under this rule joinder of necessary parties is required if jurisdiction over them can be obtained and if joinder will not defeat federal jurisdiction of the case.\n\nWe hold that school districts which are to be affected by the decree of the District Court are \"necessary parties\" under Rule 19. As a prerequisite to the implementation of a plan in this case affecting any school district, the affected district first must be made a party to this litigation and afforded an opportunity to be heard.\n\nSee also Hoots v. Commonwealth of Pennsylvania, 359 F. Supp. 807, 821-822 (W.D.Pa.1973).\n\nSimilarly, any entity of the state or city not already a party to this action, required to be heard, should be made a party by either the plaintiffs or defendants. As indicated in Part V D, infra, this would include at least the Metropolitan Transit Authority, the Park Department and the Police Commissioner of the City of New York.\n\nThe position that defendants have failed to exhaust their administrative remedies against the housing authorities is also beside the point. This is not a case where there is a need to seek review pursuant to 42 U.S.C.  3610; or to prove that the alleged discriminatory housing practices occurred within the 180 days of the filing of the third-party complaint (42 U.S.C.  3612).\n\nThe housing authorities must remain in the case because without them no effective remedy can be granted. No administrative rule can afford an excuse for violating the Constitution. \"To allow housing officials to make decisions having the long range effect of increasing or maintaining racially segregated housing patterns merely because minority groups will gain an immediate benefit would render such persons willing, and perhaps unwitting, partners in the trend toward ghettoization of our urban centers\" and our schools. Otero v. New York City Housing Authority, 484 F.2d 1122, 1134 (2d Cir. 1973).\n\nIn Otero the court held that the Housing Authority's affirmative duty to integrate, constitutional and statutory in origin, takes precedence over the Authority's own administrative priority policy and procedures.\n\nWe hold that to the extent that GM 1810 conflicts with the Authority's duty to integrate, the latter prevails and that the Authority may limit the number of apartments to be made available to persons of white or nonwhite races, including minority groups, where it can show that such action is essential to promote a racially balanced community and to avoid concentrated racial pockets that will result in a segregated community.\n\nOtero et al. v. New York City Housing Authority et al., 484 F.2d 1122, 1140 (2d Cir. 1973). Similarly, the duty to desegregate segregated schools -- a duty which is unequivocally constitutional in origin -- takes precedence over any priority policy and administrative procedures.\n\nThe third-party claim is, therefore, mooted by the decision that plaintiffs are constitutionally entitled to a comprehensive remedy.\n\nIV. APPLICATION OF THE LAW TO MARK TWAIN JUNIOR HIGH SCHOOL\n\nBy almost every criteria Mark Twain is segregated. The racial and ethnic composition of the student body is heavily black and Puerto Rican; whites have recently fled from the school and resist going there; the percentage of minority students is far higher than in other junior high schools in District 21; the school is considered a black and Puerto Rican school by the children and their parents in the district, by the teachers and staff, by educational and other officials, and by the public; the history of the school shows a sudden increase in the ratio of minority to white pupils; the school's success rate as measured by such criteria as reading scores is low compared to the rest of the district; and there is segregation through excessive tracking in the school. All the experts who testified conceded that Mark Twain is segregated.\n\nHere, unlike the situation in de jure cases, the school authorities did not desire Mark Twain to become desegregated. They would have preferred to see housing patterns develop so that all the schools in the district were equally integrated, making each of them overwhelmingly white. But they continued to make decisions that they knew would enhance demographic trends and result in segregation at Mark Twain. Moreover, they refused to take steps ordered by the Chancellor to reverse the trend because they did not want to compel white children to go into minority schools, while approving a program to introduce minority children from outside the district into white schools. The racial double standard is apparent. To further add to the difficulty, the state through use of its housing powers, reinforced racial and ethnic tendencies. In short, state officials, while radiating emanations of constitutional good will, utilized their powers to make segregation inevitable.\n\nUnder the circumstances, benign neglect is as illegal as malign intent -- both are unconstitutional. We cannot ignore the fact that \"[the] system of geographic school attendance, imposed upon segregated housing patterns, provides the broad base for racial isolation in Northern Schools.\" United States Commission on Civil Rights, Racial Isolation in the Public Schools 59 (1967).\n\nV. REMEDY\n\nInvolved in this suit to compel a change in the racial and ethnic student ratios in Mark Twain Junior High School are deep emotional attitudes of parents understandably concerned with the education and future welfare of their children as well as basic vexing issues of constitutional law. For the reasons already indicated we hold that the Constitution has been violated in operating Mark Twain Junior High School.\n\nA. Power to Eliminate Effects of Past Discrimination.\n\nHaving found a violation, the court has broad equitable powers to order changes designed to eliminate future misconduct and to reduce the effect of prior violations. See e.g., Swann v. Board of Education, 402 U.S. 1, 15, 91 S. Ct. 1267, 1276, 28 L. Ed. 2d 554 (1971) (\"a district court's equitable powers to remedy past wrongs is broad, for breadth and flexibility are inherent inequitable remedies\"); Louisiana v. United States, 380 U.S. 145, 154, 85 S. Ct. 817, 822, 13 L. Ed. 2d 709 (1965) (invalidating Louisiana requirement that persons wishing to vote be able to interpret Federal and State Constitutions; \"we bear in mind that the court has not merely the power but the duty to render a decree which will so far as possible eliminate the discriminatory effects of the past as well as bar like discrimination in the future\") (emphasis added); Vulcan Society of New York City Fire Department, Inc. et al. v. Civil Service Commission of the City of New York, 490 F.2d 387, at 399 (2d Cir. 1973) (employment discrimination); Bradley v. Milliken, 484 F.2d at 215, at 252-253, 254-255 (6th Cir. 1973), cert. granted, 414 U.S. 1038, 94 S. Ct. 538, 38 L. Ed. 2d 329 (1973).\n\nIn Bradley v. Milliken, 484 F.2d 215, at p. 249 (6th Cir. 1973), cert. granted, 414 U.S. 1038, 94 S. Ct. 538, 38 L. Ed. 2d 329 (1973), the court approved a decree requiring crossing of boundary lines between school districts. It specifically acknowledged the power of the district court \"to disregard such artificial barriers.\" Ibid. Just as the state's obligations can not be avoided by dividing responsibility among school districts, so it cannot divide responsibility by types of officials. All state officers and agencies, whether educational or not, must comply with court orders designed to eliminate unconstitutional activities of any state agency. All are instrumentalities of the same entity, the state.\n\nThat a decree may require expenditure of public funds is no bar to corrective action.\n\nIn the exercise of its equity powers, a District Court may order that public funds be expended, particularly when such an expenditure is necessary to meet the minimum requirements mandated by the Constitution. Griffin v. County School Board of Prince Edward County, 377 U.S. 218, 233, 84 S. Ct. 1226, 12 L. Ed. 2d 256 (1964); Eaton v. New Hanover County Board of Education, 459 F.2d 684 (4th Cir. 1972); Brewer v. School Board of City of Norfolk, 456 F.2d 943, 947, 948 (4th Cir.), cert. denied, 406 U.S. 933, 92 S. Ct. 1778, 32 L. Ed. 2d 136 (1972); Plaquemines Parish School Board v. United States, 415 F.2d 817 (5th Cir. 1969).\n\nBradley v. Milliken, 484 F.2d 215, at p. 258 (6th Cir. 1973), cert. granted, 414 U.S. 1038, 94 S. Ct. 538, 38 L. Ed. 2d 329 (1973).\n\nB. Duty of Education Officials\n\nChanges to meet constitutional standards may take a variety of forms and, as is the invariable practice in federal courts, local school authorities must be given an opportunity to provide an acceptable plan for eliminating the illegal segregation at this school. That plan must eliminate racial and ethnic segregation; it should also provide a practical method of minimizing community conflicts and maximizing educational opportunities for the present and potential students of the school. The parties will have until March 1, 1974 to submit such a detailed plan to be placed in operation by September, 1974.\n\nIn devising the plan the parties shall take into account the \"six basic elements in successful school integration\" as listed by the Report of the Select Committee on Equal Educational Opportunity, United States Senate, Toward Equal Educational Opportunity, Sen. Rep. No. 92-000, 92d Cong.2d Sess., 29-31 (1972). They are:\n\n1. Community Participation\n\n2. Socioeconomic Diversity\n\n3. Early Integration\n\n4. Integrated Classrooms\n\n5. Access of Language Minorities to Bilingual Programs\n\n6. Mutual Understanding and Respect.\n\nClosing Mark Twain is not an acceptable method of meeting the constitutional mandate. This school is in a sound condition. It is needed for the full education of pupils in District 21. Its closing to require all of its pupils to be bussed to other parts of District 21 would entail much more uprooting and transportation than would the transportation of some students from other nearby parts of District 21 to redress the balance in Mark Twain. Eliminating Mark Twain to prevent segregation could, under the circumstances, only be viewed as further invidious discrimination against minority pupils of this school. It would also have the effect of cutting down the number of openings in the northern part of District 21 for students from Bedford-Stuyvesant, thus frustrating the efforts of the City to provide non-segregated education for at least some of those living in the central city.\n\nThe plan shall insure that Mark Twain will not deviate more than 10% from the district-wide average of minority pupils in Junior High and Intermediate Schools. This is the percentage used by the Chancellor. While he proposed higher percentages during an adjustment period, that period has been exhausted in delays by the Community School Board. The 10% is not fixed \"as a matter of substantive constitutional right.\" Swann v. Charlotte-Mecklenburg Board of Education, 402 U.S. 1, 24, 91 S. Ct. 1267, 1280, 28 L. Ed. 2d 554 (1971). In devising its plan, the Shore Parkway is not to be deemed \"a natural dividing line.\" Keyes v. School District No. 1, Denver, Colorado, 413 U.S. 189, 205, 93 S. Ct. 2686, 2696, 37 L. Ed. 2d 548 (1973).\n\nAn important aspect of the plan is the preparation of students, parents and community for the change. The Board of Education shall make funds available for visits to the school by children and adults and pay for transportation, food and other hospitality. Teachers and other staff throughout the district shall be involved in this enterprise. Community relations shall be planned to continue on an intensive basis at least until October 1975.\n\nDetailed programs to eliminate possible racial tension in Mark Twain must be developed. See, e.g., United States Commission on Civil Rights, \"Factors in Successful Desegregation,\" in Racial Isolation in the Public Schools, 13 ff (1967). The academic and other teaching programs must be arranged so that pupils transferring into the school have at least as good an education as they would have been afforded without the change. If this means adding certain languages to the curriculum not now offered at Mark Twain, this shall be done.\n\nTracking within Mark Twain must be reduced to the minimum required for sound education. Classes providing for rapid advance by skipping a grade may be made available; students may be selected by objective, racially and ethnically neutral criteria such as reading scores. See 2 Fleischmann (Commission) Report on the Quality, Cost and Financing of Elementary and Secondary Education in New York State, Part IV: \"Gifted and Talented Students\" (1972). A separate group of those so deprived that they are incapable of profiting from normal instruction and need special attention in very small groups may be retained. The group intended is not necessarily limited to those technically described as \"handicapped.\" See  200.1, Rules of the Board of Regents and Regulations of the Commissioner of Education, University of the State of New York, 2 Fleischmann (Commission) Report on the Quality, Cost and Financing of Elementary and Secondary Education, in New York State 9.7 (1972). All other students are to be integrated in their basic academic classes so far as academically feasible. This does not mean that special electives such as language may not be made available.\n\nThe number of students in the school shall be no less than 1000. While below the rated capacity, this is the number the principal indicated could be readily accommodated without interfering with current programs.\n\nC. Duty of Housing Officials\n\nAs indicated above in part III D, supra, the racial segregation at Mark Twain has had the effect of discouraging white families with school-age children from moving into public housing within the Mark Twain feeder area. Racial segregation at Mark Twain has consequently had the effect of further deepening racial imbalance in public housing, because racially-imbalanced housing itself obviously discourages white families from moving into the imbalanced housing. By way of remedying the past effects of racial segregation at Mark Twain, the federal, state and city housing authorities must attempt to undo the racial imbalance in publicly-supported housing in Coney Island.\n\nHousing officials of the city, state and federal government shall provide a joint plan. As the Chancellor of New York City's school system testified, what is needed is that the area be \"refertilized with new families.\"\n\nThere shall be accelerated reconstruction of the blocks south of the school. Renting and construction patterns shall be modified to encourage substantial numbers of whites and middle class families with children to move into buildings constructed with the aid of public funds. Plans should include advertising and inducements to encourage middle class persons to move into the area with their families in order to stabilize its population.\n\nD. Duty of Other Officials\n\nThe City of New York is deeply involved in this litigation because both its housing officials and educational officials are defendants, responsible for taking corrective action. The Corporation Counsel of the City of New York will be expected to coordinate efforts to insure that proper plans are developed and executed to eliminate segregation in Mark Twain.\n\nThe Police Commissioner shall present a plan for adequate protection of children in the vicinity of the school while they are going to and from the building. Violence in or around the school ordered integrated by the court will not be tolerated. See 2 Fleischmann (Commission) Report on the Quality, Cost and Financing of Elementary and Secondary Education in New York State 10.2-10.6 (1972).\n\nFor similar reasons, the Metropolitan Transit Authority shall cooperate in arranging necessary bus schedules to meet school plans at Mark Twain for 1974. Rearrangement of bus schedules to provide bus service at the building shall be considered.\n\nMark Twain makes heavy use of Park Department facilities. This department will necessarily be involved in planning.\n\nAs indicated in Part III D 3, supra, the Police Commissioner, the Commissioner of Recreation and the Metropolitan Transit Authority shall be made parties to this action.\n\nNormally, plans as complex as those required might take years to develop and implement. In view of the need to protect the rights of students presently attending Mark Twain, the luxury of such a time span is not available. The situation has been long known to all affected officials and governmental agencies. At the time of final argument on the merits, the court orally indicated the relief that would be granted. Planning to rectify the illegal conditions existing at Mark Twain should therefore be well under way.\n\nA hearing is set for March 5, 1974, at 10:00 A.M. to consider the plans referred to. Those plans shall be filed in the Clerk's office on March 1, 1974.\n\nSo ordered.\n\nVI. Supplemental Opinion: Power to Appoint Special Master Respecting Remedy\n\nSUPPLEMENTAL OPINION OF APRIL 2, 1974\n\nSuggestions have been made by some of the parties that the court appoint a master to assist them and the court in developing an appropriate remedy. Only representatives of the City of New York oppose. For the reasons set forth below a master must be appointed.\n\nPursuant to this court's direction of January 28, 1974, the parties filed a series of proposals for eliminating unconstitutional segregation at Mark Twain Junior High School. Extensive hearings on the question of an appropriate remedy were held. Despite the cooperation of the parties and their counsel, it is apparent that a complete and integrated proposal covering education, housing and related matters has not yet been formulated.\n\nPlaintiffs have submitted six possible educational \"models,\" outlining in broad terms methods of desegregating the school. They express a preference for one that would require cross-bussing, creating nearly equal minority percentages and utilization in each junior and intermediate school in the district. The details of zoning and transportation have not been worked out.\n\nDefendant Local School Board has provided a more detailed \"plan,\" making Mark Twain an integrated but somewhat underutilized school for gifted and talented students drawn from throughout the district. The plan provides for bussing designed to equalize use and minority percentages in all other junior and intermediate schools. One of the problems with this formulation is that only one class would occupy the school in 1974 and full utilization of Mark Twain would not begin until September, 1975. Zoning details were submitted after the hearings were completed. This plan has the unanimous support of members of the Local School Board -- though not of all parents of school children in the district. It is expected that the plan's details will generate discussion as individuals realize the need for changes affecting their personal lives.\n\nThe Chancellor of New York City's Board of Education has supplied two \"feeder patterns\" designed to meet the criteria set forth in this court's memorandum of January 28. He has, however, disavowed these patterns as \"fraught with educationally unsound changes.\" The \"patterns\" reflect this distaste, for they comply with the literal terms of this court's order, while eschewing the opportunity for providing a more desirable program of change. The technicians who developed the proposals, for example, recognized that they created a number of undesirable anomalies such as bussing children living across the street from I.S. 303 to Mark Twain and bussing children living across the street from Mark Twain to I.S. 303. Unlike the proposals of the Local School Board and the plaintiffs, the Chancellor's \"patterns\" leave unresolved such problems as the imminent tipping of I.S. 303 and overcrowding in some junior high schools in the district. Nevertheless, those \"patterns\" reflect the work of a highly professional staff whose technical capacities, when fully exploited, could provide essential help in creating a viable program for constitutionally required change.\n\nThe Police Department has provided a \"plan\" to protect children coming and going to school and against intruders during school hours. But none of the parties has yet analyzed it to determine whether it is sufficient.\n\nThe proposal of the Parks, Recreation and Cultural Affairs Administration is that \"Comfort Station No. 4\" in the park next to the school be rehabilitated. In view of the deterioration of the park's sea wall which makes substantial portions of the park unsafe, and in light of the need for specific programs to encourage use of the park area by children and adults of all races and walks of life, an expanded proposal is required.\n\nA schedule of available transportation furnished by the Transit Authority provides helpful information. What changes, if any, will be required cannot be determined until school zoning and feeder patterns are determined. More intensive park recreational programs and possible changes in housing patterns may also affect public transportation requirements.\n\nNo proposals have been received from the various private and public social agencies of the City. A large number of families on welfare or in need of welfare have moved into the Coney Island area in recent years. Many of these families face serious financial and personal problems requiring a coordinated program of social services to help them resolve their difficulties. Significantly, such help would also reduce the possibility of unresolved familial problems generating disruptive tensions and pressures in the Coney Island community where the stability ordinarily provided by long-term residents and institutions is now generally lacking.\n\nIn the housing area -- one crucial to an effective decree -- the court has thus far received little in the way of definite proposals. Yet, all the housing officials at each level of government concerned with Coney Island have shown a strong desire to cooperate with the court in devising an effective remedy.\n\nFor example, the Commissioner of Housing and Community Renewal of the State of New York, in his letter to the court, points to his agency's assistance in constructing \"9,040 dwelling units under low rent and middle income programs\" occupied by \"numerous white families with children\" in this school district. Nevertheless, the Commissioner claims inability to help meet the Mark Twain problem:\n\n[Should] any plan of bussing of children from Junior High School 303 to Mark Twain Junior High School be implemented . . . stability will be undermined as numerous white tenants will move. Tenants' meetings have been held and bussing is vigorously opposed. Further, new white families with children will refuse to move in, since what they consider to be acceptable educational facilities will no longer be available.\n\nThis Division was created to assist in improving the conditions of urban life. It is painful to be so constricted by crippling inflation and lack of essential funds that we cannot assume our customary leadership role in solving the problem of racial balance in the Mark Twain School District area.\n\nIt should be noted that when the largely white middle income projects referred to by the Commissioner were built with state assistance in East Coney Island, a substantial portion of minority families living in East Coney Island were relocated into West Coney Island. These minority families could not afford the new East Coney Island project rents, however, and they remained in West Coney Island. As the census tract analysis of racial percentages shows, the result has been a sharp decrease in minority percentages in East Coney Island and an accentuation of the increase in the western area from which Mark Twain now draws its students.\n\nThe New York City Housing and Development Administration submitted a \"plan\" describing a variety of programs in progress, referring to studies authorized independently of this action, and proposing amendments to plans for the Coney Island Neighborhood Development Program. None of this work was prepared specifically to meet the issues raised in this lawsuit.\n\nIn sum, while the various housing agencies involved have met with each other and with agencies such as the City Planning Commission, they have been unable to reach a consensus. This is conceded by the New York State Urban Development Corporation, which concluded that no plan could be developed without the intervention of the court with the aid of a master. The President of the Urban Development Corporation declared:\n\nAfter meetings among the representatives of New York City Housing Authority, New York State Division of Housing and Community Renewal, New York City Housing and Development Administration, United States Department of Housing and Urban Development, and New York State Urban Development Corporation, and in spite of efforts to devise such a plan, no agreement has been reached on the provision of such a plan.\n\n. . .\n\nTo achieve housing integration in such form as to provide stable integration in the public schools it will be necessary to make housing competitively attractive to white families compared to other options available to them and equally important to provide a community setting for such housing which offers the level of municipal services, shopping areas and plain safety in the streets that will make young white families not only willing but eager to move into such a community. [Emphasis in original.] The basic amenities of sea and sand, what nature has provided, are all powerful attractions but not in themselves enough.\n\n. . . UDC believes the court's order can be carried out but only by extraordinary means. Clearly the ordinary operations of public and private enterprise have failed.\n\nThis is an historic opportunity to establish a meaningful path toward voluntary urban integration in the public schools and in housing in neighborhoods which more mobile whites seem irreversibly to be abandoning.\n\nNo one entity of government has the legal power or the resources to accomplish the refertilization of Coney Island. Absent a specific legislative action creating an appropriately empowered and funded entity, only the judiciary has the power to order the necessary actions to be undertaken.\n\nThe \"refertilization\" of a neighborhood is an immensely complicated process involving laws, regulations, appropriations and administration.\n\nFor example it is UDC's judgment that the number one obstacle in the path of providing the \"joint plan\" which the court seeks are the restrictions and underfunding of federal housing and urban renewal legislation by the Congress and even more important the further administrative restrictions and impoundments which the Executive has placed on the legislation which has been adopted. . . .\n\n. . . In addition, the various agencies before the Court operate on different levels of government and under different laws, regulations and methods of financing.\n\nTherefore, UDC believes that the Court itself must undertake the burden of devising a \"joint plan\" -- in the process examining the multitude of laws, regulations and practices necessarily relevant.\n\nIn the alternative we urge that the Court appoint a special master to devise a plan under its close supervision and direction.\n\nThe federal government, like other governmental units responsible for housing, recognized that action was required but expressed frustration at the absence of resources. An acknowledged expert in this field, S. William Green, Regional Administrator of the Department of Housing and Urban Development, testified that hundreds of millions of dollars of appropriated housing monies had been \"reserved\" -- or, as others put it, \"impounded\" -- by the United States Office of Management and Budget, making it impossible, without court intervention, to use federal funds to further improve housing and integrate this community.\n\nMr. Green recognized that the City's own regulations requiring the City to resettle people from the area back into new local housing -- the so-called \"right to return regulation\" -- has accentuated the problem. He expressed concern at the overwhelming number of problem ridden families on welfare being placed in new, publicly-aided buildings in Coney Island.\n\nThis is not to say that this litigation has had no impact. One day before hearings on the proposed \"plans,\" for example, the Housing and Development Administration of the City proposed to the City Planning Commission that two blocks to the southwest of the school be condemned and redeveloped -- presumably with moderate income housing and attractive commercial enterprises -- as part of a program for the Coney Island area. The Administration's letter of March 4, 1974, states in part:\n\nThis change will permit the City to comply with [this court's] . . . Order to accelerate reconstruction of the two blocks south of Mark Twain Junior High School. Although field inspections had previously verified that most of the property on the two blocks is dilapidated or deteriorating, they had not been included in the proposed Amended Plan because we felt the additional Capital Budget funds required would not be available. In light of [the court's] . . . directive, we would expect to secure the necessary funds either through the Capital Budget and/or through application to the U.S. Department of Housing and Urban Development.\n\nIn response to testimony at the hearing that these two blocks were decaying, the City ordered the Department of Buildings to enforce the building code The City has also ordered the Department of Sanitation to clean up debris and garbage accumulations in the area.\n\nA title search was made on the court's suggestion. It shows that the City and the Secretary of Housing and Urban Development each own properties on the blocks in question. These will now be held and utilized in a way consistent with the projected improvement of the area.\n\nFinally, the City recognized that its desire to find alternative accommodations for welfare families residing in hotels in other parts of the City led to moving many of these families into temporary Coney Island quarters slated for destruction. Under present interpretation by the City of its own regulations, those families new to the area have to be placed in new low income housing in Coney Island, increasing the minority percentages and making it less likely that middle income families would find room or reason to resettle there. It is reported that the City has taken steps to control this unrestricted flow of welfare families into the decaying area near the school.\n\nThe court recognizes the intense pressures on City agencies to find homes for the poor in the city, which has experienced a long-term housing shortage. Moveover, clearing an additional two blocks in Coney Island will add more than one hundred families to those the Department of Relocation and Management Services must provide for.\n\nTestimony at the hearing made it clear that plans to deal comprehensively with conditions that have figured in the segregation of Mark Twain cannot be executed by September of 1974. Accordingly, the desegregation of Mark Twain is postponed to September 1975.\n\nDespite obvious difficulties, the hearings and materials submitted to date provide substantial grounds to believe that adequate plans to stabilize this community and school are possible. There are adequate basic studies available and highly trained people, at all levels of government with the desire and capacity to handle the problem. Well over a hundred million dollars of public money has already been spent in this area and it is recognized that unless there are further expenditures of lesser sums much of this money may have served to create a hostile ghetto and a school system unsatisfactory to everyone in the community.\n\nThe coordination of scores of agencies, officials and private persons and groups in developing a workable plan will require patient and understanding consultation. The role of coordinator is not one suited to a court which can best preside at an adversary hearing devoted to a specific plan.\n\nAfter consultation in court and chambers, all parties except defendants who are officials of the City of New York agreed that a master was required to assist the parties in developing a plan. Both the terms of reference and names of proposed masters were explored by court and counsel in off-the-record discussions and all agreed that if a master were appointed it should be Professor Curtis J. Berger of the Law School of Columbia University, a widely respected educator, expert in housing and community planning. Since counsel for the City officials objects to appointment of a master, it is necessary to consider the power of the court to make such an appointment.\n\nPOWER OF THE COURT TO OBTAIN EXPERT ASSISTANCE\n\nExpert assistance is available to federal courts through two means when it is not provided by the parties. The court has the power to call expert witnesses. It may also appoint special masters.\n\nCOURT-APPOINTED EXPERT WITNESSES\n\nThe inherent power of a court \"to appoint an expert under proper circumstances, to aid it in the just disposition of a case\" is not open to question. Scott v. Spanjer Bros., Inc., 298 F.2d 928, 930 (2d Cir. 1962) annotated in \"Trial Court's Appointment, in Civil Case, of Expert Witness,\" 95 ALR 2d 390 (1964). Its roots are as deep as those of our system of justice.\n\nAs early as 1345 a court beckoned surgeons from London to determine if a wound was fresh; cases in 1494 and 1555 reveal courts calling \"masters in grammer\" to decipher Latin pleadings. See Anonymous, Lib. Ass'n 28, pl. 5 (28 Edward III) (1345); Anonymous, 9 Henry VII 16, pl. 8 (1494); Buckley v. Thomas, 1 Plow. 118, 122 (1555); L. Hand, \"Considerations Regarding Expert Testimony,\" 15 Harv.L.Rev. 40, 42-43 (1901). Special juries of participants in a trade were called to hear cases concerning their trade in 14th century London. L. Hand, supra at 40-42. Lord Mansfield regularly used a special jury of merchants to obtain expert advice for his commercial law decisions. Beuscher, \"Use of Experts by the Courts,\" 54 Harv.L.Rev. 1105, 1109 (1941); Fifoot, Lord Mansfield 105 (1936). An English statute of 1730 gave parties a right to an expert jury. 3 George II, c. 25  15 (1730); cf. A. K. Berle and L. S. DeCamp, Inventions and Their Management 659 (2d ed. 1947). Special experts available to sit with and advise judges during a trial were standard practice in the 17th century English Admiralty Court, which called on the sea captains of the Elder Brethren of the Holy and Undivided Trinity club. 3 Black Book of the Admiralty (Rolls Series 1874) 371, n. 1; Beuscher, supra at 1109-10. Cf. Kaufman, \"Masters in the Federal Courts: Rule 53,\" 58 Col.L.Rev. 452, n. 4 (1958); Kaufman, \"Use of Pre-Trial Masters in the 'Big Case,' 23 F.R.D. 572, 574 (1959); Law Reform Committee, 17th Report, Evidence of Opinion and Expert Evidence, Cmnd. 4489, pp. 6-7 (1970).\n\nIn this country several states have adopted rules providing for court-appointed expert witnesses in civil cases. See, e.g., West's Ann.Cal.Evid.Code  730-733; Ill.Sup.Ct.Rule 215(d); 2 Wigmore on Evidence  563 (3d ed. 1940) (1972 Supp.); McCormick on Evidence  17 (2d ed., E. W. Cleary ed.) Report by Special Committee of the Association of the Bar N.Y.C., Impartial Medical Testimony (1956); \"Medical-Legal Screening Panels as an Alternative Approach to Medical Malpractice Claims,\" 13 Wm. \u0026 Mary L.Rev. 695 (1972).\n\nOthers followed the drafts of the law reformers seeking to regulate and expand this power. National Conference of Commissioners on Uniform State Laws, Model Uniform Act on Court-appointed Experts (1937); 2 Wigmore on Evidence  563 at 651-655 (3d ed. 1940); American Law Institute Model Code of Evidence, Rules 403-410 (1942); National Conference of Commissioners on Uniform State Laws, Uniform Rules of Evidence, Rule 59 (1953).\n\nRule 28 of the Federal Rules of Criminal Procedure grants courts the power to order the government or defendant or both to show cause why an expert should not be appointed and authorizes payment from government funds for experts appointed by court motion. While the Judicial Conference concluded in 1953 that it would be fruitless to seek a new Rule of Civil Procedures patterned after Rule 28, this decision was based upon the belief that Congress was unlikely to appropriate funds to pay expert witness fees in civil cases. See Rep. Proceedings U.S.Jud.Conf. 23-24 (1953).\n\nRule 706 of the proposed Federal Rules of Evidence allows courts broad powers in appointing experts and recognizes courts' discretion in fixing fees and applying costs against parties. These provisions have been approved with no change both by the Supreme Court and the House of Representatives. Cong. Record, House, H569-570, Jan. 6, 1974. They have already been adopted by a number of states. West's Wisc.Stat.Ann.  901.01-911.02 (Nov.1973 Supp.); New Mexico Stat.Ann., Art. 4,  20-4-101 to 20-4-1102 (1973 Supp.); Nevada Revised Stat.,  47.020-53.070 (1973).\n\nFederal courts have recognized an inherent power to appoint experts. Justice Brandeis, writing for the majority, approved Learned Hand's appointment of an expert auditor, finding that courts possess the \"power to provide themselves with appropriate instruments required for the performance of their duties.\" In re Peterson, 253 U.S. 300, 312, 40 S. Ct. 543, 547, 64 L. Ed. 919 (1920). He ruled that if the appointment of an expert furthers the interests of the court (as opposed to the interests of the particular parties) by assisting either the judge or the jury, then the cost is taxable against the losing party. Id. at 315-319, 40 S. Ct. at 548-549. See also Johnson v. United States, 333 U.S. 46, 53-55, 68 S. Ct. 391, 395-396, 92 L. Ed. 468 (1948) (Justice Frankfurter, dissenting). For other techniques providing expert assistance to the courts see, e.g., Mason, Harlan Fiske Stone; Pillar of the Law 785 (1956) (economic service suggested by Chief Justice Stone); Roscoe Pound, The Spirit of the Common Law 212-215 (1921); In re Wilton Realty Corp., 30 F. Supp. 486 (E.D.Mich. 1938), aff'd, 106 F.2d 1022 (6th Cir. 1939) (S.E.C. utilized in devising plan under Chapter X of the Bankruptcy Act); Beuscher, \"The Use of Experts by the Courts,\" 54 Harv.L.Rev. 1105, 1120 (1941) (special statutes requiring reference to appropriate commissions); McGuire et al., Cases and Materials on Evidence 396-398 (6th ed. 1973).\n\nCOURT-APPOINTED EXPERT MASTER\n\nThe expert in this case must assist the court by coordinating and evaluating remedial proposals that defendants and others are in the process of preparing pursuant to court order. He must serve an investigatory and consultative function among the parties and advise this court in technical areas so it may approve an effective remedial order. In a sense, he must bridge the gap between the court as impartial arbiter of plans placed before it and advocates protecting their clients' positions that are often narrower than that of society at large. This is a complex task not envisioned in drafting the expert witness provisions of proposed Rule 706.\n\nThe Federal Magistrate's Act provides for an office with duties similar to a special master's. 28 U.S.C.  636(b)(1). Magistrates in this district are, however, too heavily engaged in their regular duties to acquire the expertise and spend the time required to advise the court in the matter at hand.\n\nRule 53 of the Federal Rules of Civil Procedure permits district courts in non-jury cases to name special masters in \"any action . . . upon a showing that some exceptional condition requires it.\" The rule is broad enough to allow appointment of expert advisors.\n\nCourts have used broad language in speaking of possible powers of masters. The Eighth Circuit defined a master as,\n\n. . . a public servant engaged in a public function. He is an aide to the court of his appointment. He is not the servant of the litigants, nor the servant of their attorneys. He has a positive duty and must exercise firm discretion to cause the business confided to him to be brought to a conclusion within reasonable bounds of time.\n\nUniversal Oil Products Co. v. Hall, 76 F.2d 258, 265 (8th Cir.), cert. denied, 296 U.S. 621, 663, 56 S. Ct. 143, 80 L. Ed. 441 (1935). He has \"the duties and obligations of a judicial officer,\" with a commission limited by the order appointing him. In re Gilbert, 276 U.S. 6, 9, 48 S. Ct. 210, 211, 72 L. Ed. 441 (1928).\n\nWhile the Model Act and Model Code provisions noted above would require a degree of party concurrence in the naming of court-appointed witnesses, Rule 53 has no such limits. But if a master is being named as an expert advisor to work closely with the parties, prudence dictates that selection be made with the concurrence of the parties if that is possible.\n\nAppointing an expert advisor as a master in complex cases has received support from commentators. The Prettyman Committee Report on Procedure in Anti-Trust and Other Protracted Cases, 13 F.R.D. 62, 79-81 (1953) recommended the appointment of experts as special masters to aid courts in determining scientific or technical questions of unusual complexity. Professor Lucas' commentary in Moore's Federal Practice supports use of experts \"in determining the economic and scientific facts underlying certain cases of great magnitude. . . .\" 5A Moore's Federal Practice para. 53.05[2] at 2958 n. 41 (1971). See also Dession, \"The Trial of Economic and Technological Issues of Fact,\" 58 Yale L.J. 1019, 1242 (1949). But cf. C. A. Wright and A. R. Miller, Federal Practice and Procedure  2605, p. 791 (1971).\n\nMasters have in fact been used as aides to district judges to resolve a galaxy of problems. Jurisdictional issues assigned to masters include venue, forum non conveniens, and jurisdiction over parties and subject matter. In re Hotel Governor Clinton, Inc., 107 F.2d 398 (2d Cir. 1939); Stone v. Southern Pacific Co., 32 F. Supp. 819 (S.D.N.Y.1940); Lazar v. Cecelia, 32 F. Supp. 420 (S.D.N.Y.1939); Schlessinger v. Ingber, 29 F. Supp. 581 (S.D.N.Y.1939). They have been assigned to numerous procedural problems, including supervision of discovery, especially in cases of large magnitude. See, e.g., First Iowa Hydro Elec. Coop. v. Iowa-Ill. Gas \u0026 Elec. Co., 245 F.2d 613 (8th Cir.), cert. denied, 355 U.S. 871, 78 S. Ct. 122, 2 L. Ed. 2d 76 (1957); Tivoli Realty v. Paramount Pictures, 10 F.R.D. 201, 203 (D.Del.), aff'd per curiam, 186 F.2d 120 (3d Cir. 1950), cert. denied, 340 U.S. 953, 71 S. Ct. 572, 95 L. Ed. 687 (1951); Kaufman, \"Use of Special Pre-Trial Masters in the 'Big' Case,\" 23 F.R.D. 572 (1959); \"Standing Masters to Supervise Discovery in the Southern District, New York,\" 23 F.R.D. 36 (1959); Marsh, \"Pre-Trial Discovery in an Anti-Trust Case,\" 8 Record of the N.Y.C.B.A. 401 (1953).\n\nMasters have been utilized in matters going to the merits, including determination of claims to money or property under court control, evaluation of profits resulting from copyright infringement, determination of complex economic issues in patent and antitrust cases, determination of issues in a shareholder's action, and formulation of recommendations for corporate reorganization under the Bankruptcy Act. See York Corp. v. Brock, 405 F.2d 759 (5th Cir. 1969); Helene Curtis Industries v. Sales Affiliates and Gillette Safety Razor Co., 105 F. Supp. 886, 906 (S.D.N.Y.), aff'd, 199 F.2d 732 (2d Cir. 1952); In re Van Schaick, 69 F. Supp. 764 (S.D.N.Y.1946); Miller v. Weiant, 42 F. Supp. 760 (S.D.Ohio 1942); Connecticut Importing Co. v. Frankfort Distilleries, Inc., 42 F. Supp. 225 (D.Conn.1940); Houghton Mifflin Co. v. Stackpole Sons, 31 F. Supp. 517 (S.D.N.Y.1940), rev'd on other grounds, 104 F.2d 306 (2d Cir. 1939), cert. denied, 308 U.S. 597, 60 S. Ct. 131, 84 L. Ed. 499, modified on other grounds, 113 F.2d 627 (2d Cir. 1940). In Arizona v. California, 347 U.S. 986, 74 S. Ct. 848, 98 L. Ed. 1121 (1954), a complex litigation over water rights involving five western states, the Supreme Court appointed a special master \"with authority to summon witnesses, issue subpoenas and take . . . evidence\" in order to find facts and conclusions of law on which the Court could base its decision. See also, e.g., Mississippi v. Arkansas, 402 U.S. 926, 91 S. Ct. 1521, 28 L. Ed. 2d 861 (1971) (appointing master in boundary dispute); 411 U.S. 913, 93 S. Ct. 1539, 36 L. Ed. 2d 305 (1973) (accepting master's report); 415 U.S. 289, 94 S. Ct. 1046, 39 L. Ed. 2d 333 (1974) (decision).\n\nMasters to determine remedies after liability has been determined by the court -- the posture of the instant case -- have been particularly useful. See, e.g., Foster v. City of Detroit, 254 F. Supp. 655, 668 n. 33 (E.D.Mich.1966) (master named to supervise damages remedy after city urban renewal condemnation plan was found unlawful); Dorchester Music Corp. v. National Broadcasting Co., 171 F. Supp. 580, 588 (S.D.Cal.1959) (master appointed to measure damages after liability found for copyright infringement); Zenith Radio Corp. v. Dictograph Products Co., 6 F.R.D. 597 (D.Del.1947) (patent infringement; master named to set damages after liability fixed); Bartlett v. Gates, 118 F. 66 (C.C.D.Colo.1902) (master to superintend an election of corporate directors after finding of improper election).\n\nNaming an expert as a master to recommend to a court a formula for remedying an antitrust case was approved in Danville Tobacco Ass'n, Inc. v. Bryant Buckner Assoc., Inc., 333 F.2d 202, 208-209 (4th Cir. 1964). Facing litigation involving an association's division of tobacco marketing time, a district court appointed an expert on tobacco marketing to guide it. The Fourth Circuit found, \"rightfully, and with every propriety, he expounded to the Court and the parties the techniques of the subject in suit,\" and noted that the master \"was subject to questioning as a witness before and after his counselling advice to the Court.\" Id. at 208.\n\nIn the area of school desegregation, experts have been appointed to advise courts in devising remedies. For example, in Swann v. Charlotte-Mecklenburg Board of Education, the district court designated an expert \"consultant\" in educational administration \"to prepare immediately plans and recommendations to the court for desegregation of the schools.\" 306 F. Supp. 1291, 1313 (W.D.N.C.1969), 311 F. Supp. 265, 269, vac. on other grounds, 431 F.2d 138 (4th Cir.), on remand, 318 F. Supp. 786 (1970), aff'd 402 U.S. 1, 91 S. Ct. 1267, 28 L. Ed. 2d 554 (1971). The court directed defendants \"to cooperate fully with the consultant,\" including providing offices, staff assistants, computers, draftsmen, telephones, access to all information about the school system, and paying all fees and expenses. 306 F. Supp. at 1313-1314. See also 311 F. Supp. at 266 (W.D.N.C.1970). The plan for desegregation drawn by the expert was adopted by the district court. 311 F. Supp. at 265. In explicitly approving the plan drawn by the expert, the Supreme Court implicitly approved his appointment and role. See 402 U.S. 1, 8, 9, 25, 91 S. Ct. 1267, 1272, 1280, 28 L. Ed. 2d 554 (1971).\n\nSwann provides an almost precise precedent for the case at hand, since the liability of the school board had been established, and expert assistance in the preparation of a remedy was crucial to the court's further deliberations. See also Knight v. Board of Education of the City of New York, 48 F.R.D. 115, 117-118 (E.D.N.Y.1969) (panel of education experts to assist in providing an effective remedy for high school students improperly expelled from school); Bradley v. Milliken, 345 F. Supp. 914, 916-917 (E.D.Mich.1972), aff'd in part, 484 F.2d 215 (6th Cir. 1973) (en banc), cert. granted, 414 U.S. 1038, 94 S. Ct. 538, 38 L. Ed. 2d 329 (1973) (panel composed of experts in education and transportation and representatives of parties to prepare and submit an effective desegregation plan). In cases such as these, unlike La Buy v. Howes Leather Co., 352 U.S. 249, 77 S. Ct. 309, 1 L. Ed. 2d 290 (1959), there is no danger of \"abdication of the judicial function.\" 352 U.S. at 256, 77 S. Ct. at 313. Cf. Bartlett-Collins Co. v. Surinam Nav. Co., 381 F.2d 546, 550-551 (10th Cir. 1967).\n\nRule 53's requirement that the case referred to a master be \"exceptional\" is more than satisfied when a court is faced with a polycentric problem that cannot easily be resolved through a traditional courtroom-bound adjudicative process. Parties to this case have begun supplying the court with remedial plans, involving housing programs and educational administration. Any solutions will involve a multitude of choices affecting allocation of educational, housing and other resources, and each choice will affect other choices. Such many-centered problems call for informal consultations and weighing of complex alternatives using a managerial decision-making process. See Henderson, \"Judicial Review of Manufacturers' Conscious Design Choices: The Limits of Adjudication,\" 73 Col.L.Rev. 1531, 1534-38 (1973); Fuller, \"Adjudication and the Rule of Law,\" 1963 Proc. A. Soc'y Int'l L.I. A skilled master, with expertise in government housing laws and in educational administration to coordinate the efforts of the parties, is crucial if a just and workable remedy is to be devised.\n\nDetermination of the amount of the master's compensation and the party that shall pay that compensation rests in the discretion of the district court, subject to review in case of abuse. See Rule 53, Fed.R.Civ.P.; Newton v. Consolidated Gas Co., 259 U.S. 101, 42 S. Ct. 438, 66 L. Ed. 844 (1922); E. I. DuPont de Nemours \u0026 Co. v. Purofied Down Products Corp., 176 F. Supp. 688 (S.D.N.Y.1959). Since this court has determined that defendants supported the unlawful racial segregation that necessitated this suit, it is proper to award the costs of the master and the supportive services he requires against the defendant with the funds available to pay -- here, the Chancellor of the Board of Education of the City of New York. As in the Knight case, such funds would be advanced by the City of New York subject to being included as costs to abide the event. 48 F.R.D. 115 (E.D.N.Y.1969).\n\nBecause it is not clear how much time the master will require, the question of the amount of compensation is deferred, with the consent of the parties. Preliminary discussions with counsel suggest that a reasonable fee would be based upon about half that obtainable by private attorneys in commercial matters.\n\nCONCLUSION\n\nThis court finds that the appointment of a special master is vital to this court in remedying this difficult and multifaceted school desegregation problem. A master will promote due process by facilitating participation of parties in the suit as solutions are designed. While the mechanism of special master is not commonly employed in such a flexible and informal way, as Lord Chancellor Francis Bacon noted,\n\nhe that will not apply new remedies must expect new evils; for time is the greatest innovator; and if time of course alter things to the worse, and wisdom and counsel shall not alter them to the better, what shall be the end?\n\n12 Works of Francis Bacon, 160 (Spedding \u0026 Heath eds., Houghton, Mifflin \u0026 Co., Riverside Press).\n\nORDER\n\nIt is ordered, adjudged, and decreed:\n\n1. Curtis J. Berger, 435 West 116th Street, New York, New York 10027, is named Special Master pursuant to Rule 53 of the Federal Rules of Civil Procedure and the inherent powers of the court.\n\n2. Each party to this suit, having been given two weeks to submit names of proposed masters, and having agreed that the above named master is acceptable, no further notice of selection is required.\n\n3. While the master shall have all powers set forth in Rule 53 except as circumscribed by this order, he is not limited to receiving and reporting evidence; he is permitted to consult informally with the parties and with outside experts and others, and to receive reports and recommendations which are not in evidence. He shall formulate a \"joint plan\" and, if possible, gain the parties' consent to this plan. In order to achieve this goal, proceedings before the master may be conducted as informal working sessions, with trial counsel, officials of the various concerned public and private agencies, and members of the public present. Informal private consultations without the presence of counsel are permitted but the fact that such meetings were held shall be made known to all counsel by the master keeping a record of them and making the record available. Findings of fact and conclusions of law under Rule 53(e)(1) are not required.\n\nThe master's report shall include a comprehensive plan dealing not only with the elimination of segregation at the Mark Twain Junior High School but also with the housing, non-residential development, community, social welfare, recreational, transportation and protective facilities within the Coney Island neighborhood necessary to provide a basis for effectively desegregating Mark Twain Junior High School. It shall indicate what steps are to be taken by which agencies, the timing of sequences for action and such matters as how funding is to be provided.\n\n4. The master shall immediately begin preparing remedial plans, and coordinate the efforts of the parties toward that end. He shall remain under the close supervision of this court, reporting frequently to the court on his activities. The master shall consult frequently with the parties and be reasonably available to the parties for informal discussions and to exchange suggestions.\n\n5. The master may engage legal, administrative and clerical aides, as he deems necessary, subject to the approval of the court. He may consult other experts, but he may not retain experts without an order obtained on forty-eight hours notice to the parties. Wherever possible expense shall be minimized by calling on experts available from government to prepare necessary drawings, studies and plans. The services of the Community Relations Service of the United States Department of Justice have been made available by the Acting Regional Director. See 42 U.S.C.  2000g.\n\n6. Defendants, third-party defendants, and others in all public agencies of the City and State of New York and in the executive departments of the federal government are directed to cooperate fully with the master. This cooperation will include, but not be limited to, providing space at the headquarters of the Board of Education and at housing agencies in which he may work; and providing business machines, draftsmen, and computers. The master shall have full access to maps, drawings, reports, statistics, computer studies, and all information about all phases of the school system, housing and services that may be necessary to prepare plans or reports. He shall be supplied with any studies and plans for desegregation that the defendants or others in the government may have. Governmental agencies shall provide the master with full professional, technical, and other assistance required in familiarizing himself with the school and housing systems and the various problems to be solved in desegregating Mark Twain.\n\n7. The master shall hear the views of various community groups in Local School District 21. He shall also consult with various groups organized on a broader geographic basis but with an interest in the district such as private welfare and religious organizations.\n\n8. The Clerk of this Court shall provide such office, courtroom, and conference room space as the master shall require.\n\n9. Any party or person may apply to this court on notice to the master and parties for a protective order against any activity of the master. The master may apply to this court for assistance.\n\n10. The amount of compensation to be paid to the master shall not be fixed until he has proceeded further with his deliberations. He may, however, apply from time to time for compensation and reimbursement of expenses. The master shall keep records of time spent.\n\n11. The master shall furnish a final report no later than July 1, 1974. Copies shall be presented to each party and an evidentiary hearing will be held by this court on July 15, 1974, at 10:00 A.M. on the issue of whether the master's report shall be adopted, modified or rejected.\n\n12. Jurisdiction is retained for further orders as may be appropriate.\n\nSo ordered.\n\n[The extensive, probing and comprehensive reports of the Special Master on a \"School Plan\" and \"Physical and Human Renewal\" of Coney Island, filed July 1 and 8, 1974, respectively, are available in the Clerk's office, U.S. District Court for the Eastern District of New York.]\n\n",
    "body_length": 226859,
    "citedas": [
      "383 F. Supp. 699"
    ],
    "attorneys": "Elliot Hoffman, New York, New York, for defendant Chancellor Scribner and third-party defendants Mayor of the City of New York, The City of New York, The Housing and Development Administration of the City of New York, Administrator, Housing and Development Administration of the City of New York. , Hyman Bravin, New York, New York, for defendants and third-party plaintiffs. , Edward J. Boyd, V, Acting U.S. Atty. E.D.N.Y., by Cyril Hyman, Asst. U.S. Atty., for third-party defendants U.S. Dept. of Housing and Urban Development. , Jeanne Hollingsworth, New York, New York, Housing Authority, New York, New York, for third-party defendant New York, New York, Housing Authority. Weinstein, District Judge.",
    "category": [],
    "judges": "WEINSTEIN, District Judge.",
    "citation_count": 0
  }
}
