{
  "id": "Ss_1YWYBTlTomsSBTze4",
  "document": {
    "title": "In Re Rights To Use Water In Big Horn River",
    "full_title": "IN RE THE GENERAL ADJUDICATION OF ALL RIGHTS TO USE WATER IN THE BIG HORN RIVER SYSTEM AND ALL OTHER SOURCES, STATE OF WYOMING. THE STATE OF WYOMING v. OWL CREEK IRRIGATION DISTRICT MEMBERS; SHOSHONE AND ARAPAHOE TRIBES; LANDIS WEBBER AND BARBARA WEBBER, INDIVIDUALLY AND ON BEHALF OF RED CREEK CATTLE COMPANY, BERTHA JONES AND GRACE GRABOSKI; UNITED STATES; CITY OF RIVERTON, MIDVALE IRRIGATION DISTRICT, AND RIVERTON VALLEY IRRIGATION DISTRICT . OWL CREEK IRRIGATION DISTRICT MEMBERS v. THE STATE OF WYOMING, SHOSHONE AND ARAPAHOE TRIBES; LANDIS WEBBER AND BARBARA WEBBER, INDIVIDUALLY AND ON BEHALF OF RED CREEK CATTLE COMPANY, BERTHA JONES AND GRACE GRABOSKI; CITY OF RIVERTON, MIDVALE IRRIGATION DISTRICT, AND RIVERTON VALLEY IRRIGATION DISTRICT . SHOSHONE AND ARAPAHOE TRIBES v. THE STATE OF WYOMING, OWL CREEK IRRIGATION DISTRICT MEMBERS, LANDIS WEBBER AND BARBARA WEBBER, INDIVIDUALLY AND ON BEHALF OF RED CREEK CATTLE COMPANY, BERTHA JONES AND GRACE GRABOSKI; UNITED STATES; CITY OF RIVERTON, MIDVALE IRRIGATION DISTRICT, AND RIVERTON VALLEY IRRIGATION DISTRICT . LANDIS WEBBER AND BARBARA WEBBER, INDIVIDUALLY AND ON BEHALF OF RED CREEK CATTLE COMPANY, BERTHA JONES AND GRACE GRABOSKI v. THE STATE OF WYOMING; OWL CREEK IRRIGATION DISTRICT MEMBERS; SHOSHONE AND ARAPAHOE TRIBES; UNITED STATES; CITY OF RIVERTON, MIDVALE IRRIGATION DISTRICT, AND RIVERTON VALLEY IRRIGATION DISTRICT . CITY OF RIVERTON, MIDVALE IRRIGATION DISTRICT, AND RIVERTON VALLEY IRRIGATION DISTRICT v. THE STATE OF WYOMING; OWL CREEK IRRIGATION DISTRICT MEMBERS; SHOSHONE AND ARAPAHOE TRIBES; LANDIS WEBBER AND BARBARA WEBBER, INDIVIDUALLY AND ON BEHALF OF RED CREEK CATTLE COMPANY, BERTHA JONES AND GRACE GRABOSKI; UNITED STATES . UNITED STATES v. THE STATE OF WYOMING, OWL CREEK IRRIGATION DISTRICT MEMBERS; SHOSHONE AND ARAPAHOE TRIBES; LANDIS WEBBER AND BARBARA WEBBER, INDIVIDUALLY AND ON BEHALF OF RED CREEK CATTLE COMPANY, BERTHA JONES AND GRACE GRABOSKI; UNITED STATES; CITY OF RIVERTON, MIDVALE IRRIGATION DISTRICT, AND RIVERTON VALLEY IRRIGATION DISTRICT; ALBERT HORNECKER AND HORNECKER LIVESTOCK CO., INC., DONALD BATH AND DHB \u0026 CO., AND PLB \u0026 CO., BRADFORD BATH, GRIFFIN BROTHERS, INCORPORATED, RALPH FLOYD URBIGKIT, CHARLES RICHARDSON AND RICHARD AND ELSIE MARTIN, ALL NON-INDIAN PARTIES . ALBERT HORNECKER AND HORNECKER LIVESTOCK CO., INC., DONALD BATH AND DHB \u0026 CO., AND PLB \u0026 CO., BRADFORD BATH, GRIFFIN BROTHERS, INCORPORATED, RALPH FLOYD URBIGKIT, CHARLES RICHARDSON AND RICHARD AND ELSIE MARTIN, ALL NON-INDIAN PARTIES v. THE STATE OF WYOMING, OWL CREEK IRRIGATION DISTRICT MEMBERS; SHOSHONE AND ARAPAHOE TRIBES; UNITED STATES; LANDIS WEBBER AND BARBARA WEBBER, INDIVIDUALLY AND ON BEHALF OF RED CREEK CATTLE COMPANY, BERTHA JONES AND GRACE GRABOSKI; CITY OF RIVERTON, MIDVALE IRRIGATION DISTRICT, AND RIVERTON VALLEY IRRIGATION DISTRICT . ROBERT W. HARVEY AND OLGA J. HARVEY, MARY O. AHLBORN, OWEN BARNETT AND EVA M. BARNETT, BLACK BUTTE LIVESTOCK COMPANY, CAMPBELLS, INC., PHYLLIS L. CRANDALL AND KENNETH WARD CRANDALL, BILLY M. AND BARBARA J. DANIELS, CARL DOCKERY AND CAROL DOCKERY, CLYDE R. FISHER AND GLORIA A. FISHER, CHARLES GOLDBEN, GARY v. KELLOGG AND BRENDA JOYCE KELLOGG, RUSSELL E. LONG AND IRENE M. LONG, WILLIAM A. MATTHEWS, ARTHUR D. MCCUMBER, MARVIN W. MEYER AND ERNESTINE S. MEYER, VERN NELSON AND CAROLYN R. NELSON, NORWEST BANK OF OMAHA N.A., NORRIS EDWIN ODDE AND F. LOUISE ODDE, WILLIAM OKIE, KENNETH AND IONA OUTLAND, SYLVIA PAULSEN, JERRY D. REDDING AND SHELIA C. REDDING, RED LANE WATERSHED IMPROVEMENT DISTRICT, C. DUANE RUSH AND KATHERINE C. RUSH, BRIAN F. SANFORD AND KATHLEEN SANFORD, NORMAN L. SANFORD, NEWELL S. SESSIONS AND DAISY E. SESSIONS, BARBARA SMITH, ROBERT STEWART, TOWN OF EAST THERMOPOLIS, VE BAR LIVESTOCK COMPANY, RAYMOND C. AND DELORES J. WEESE, AND RUTH CLARE YONKEE v. THE STATE OF WYOMING, UNITED STATES; OWL CREEK IRRIGATION DISTRICT MEMBERS; SHOSHONE AND ARAPAHOE TRIBES; LANDIS WEBBER AND BARBARA WEBBER, INDIVIDUALLY AND ON BEHALF OF RED CREEK CATTLE COMPANY, BERTHA JONES AND GRACE GRABOSKI; UNITED STATES; CITY OF RIVERTON, MIDVALE IRRIGATION DISTRICT, AND RIVERTON VALLEY IRRIGATION DISTRICT; ALBERT HORNECKER AND HORNECKER LIVESTOCK CO., INC., DONALD BATH AND DHB \u0026 CO., AND PLB CO., BRADFORD BATH, GRIFFIN BROTHERS, INCORPORATED, RALPH FLOYD URBIGKIT, CHARLES RICHARDSON, AND RICHARD AND ELSIE MARTIN, ALL NON-INDIAN PARTIES .",
    "jurisdiction": "Wyoming Supreme Court",
    "date": "1988-02-24T00:00:00.000Z",
    "docket": "Nos. 85-203 to 85-205, 85-217, 85-218, 85-225, 85-226, 85-236.",
    "body": "I INTRODUCTION\n\nThis appeal is from the district court's order adjudicating rights to use water in the Big Horn River System and all other sources within the State's Water Division No. 3. The district court modified the special master's recommended decree. All parties have appealed from the district court's amended judgment and decree. We affirm in part and reverse in part.\n\nA. Geography and History\n\nWe begin by acknowledging the comprehensive reports of both the special master and the district court and our use of these reports in our preparation of this section of this opinion.\n\nWater Division No. 3 is essentially identical with what is known as the Big Horn River drainage basin. (See map appended.) It is located in Fremont, Hot Springs, Washakie, Big Horn and Park counties in northwestern and west central Wyoming and includes parts of Yellowstone National Park. Other federal entities included are the Wind River Indian Reservation, located in the southeastern portion of the region, consisting of approximately 4,000 square miles of land area, the Shoshone and Big Horn National Forests, the East Fork Winter Elk Pasture, the Sheridan County Elk Winter Pasture, the Yellowtail Wildlife Habitat Management Area, the Middle Creek Drainage Area of Yellowstone National Park, the Big Horn Canyon National Recreation Area, and numerous public water reserves, water wells and stock driveways upon federal lands administered by the Bureau of Land Management.\n\nThe topography of the area is varied. It includes mountain peaks and valleys, high plateaus, terraced stream valleys and low desert badlands. Elevations range from 3,870 feet near the town of Basin to over 13,000 feet in the Wind River Range. On the reservation the elevation varies from 4,500 feet at the northeastern corner near the Wind River Canyon to 12,500 feet in the Wind River Range.\n\nThe primary drainage system in the division is the Wind River-Big Horn River which originates in northern Fremont County and leaves the Division at the Wyoming-Montana border in northern Big Horn County. By statutory definition the division also includes the Clark's Fork of the Yellowstone River, § 41-3-501(a)(iii), W.S. 1977, originating in northwestern Park County, which drains much of the northwestern portion of the region. The Shoshone River, a major tributary of the Big Horn River which originates in northern Park County and joins the Big Horn at the Yellowtail Reservoir, is the other major drainage system in Division 3.\n\nThe history of the Big Horn Basin for purposes of this case begins in the early 1800's when explorers, trappers and traders began traveling into northwestern Wyoming, part of the vast hunting grounds of the peripatetic Shoshone Indians. Neither group encroached on the other and relations were friendly. Nonetheless, in 1865, the United States, hoping to preserve the peace and stability, reached an agreement delineating the area within which the Eastern Shoshone roamed, a 44,672,000 acre region comprising parts of Wyoming, Colorado and Utah. Following the Civil War, as the westward movement gained momentum, the United States government realized the size of the region set aside for Indians only was unrealistic, and on July 3, 1868, executed the Second Treaty of Fort Bridger with the Shoshone and Bannock Indians, establishing the Wind River Indian Reservation.\n\nDuring their first years on the reservation, the Shoshone Indians were still dependent on the buffalo as the mainstay of their life, but as the supply rapidly decreased, they began to rely upon an agricultural economy. During the 1870's the Shoshone Indians increased their efforts in both farming and ranching. The Shoshone ceded lands beyond the Popo Agie back to the United States in the 1872 Brunot Agreement. The Arapahoe moved to the reservation in 1878. By the 1880's it was evident that the agricultural economy of the Indians was failing, and by 1895, the Indians on the Wind River Indian Reservation were totally dependent on the government for food, clothing and shelter. These economic misfortunes compelled them to sell more of their land to the United States. The First McLaughlin Agreement, or Thermopolis Purchase, was concluded in 1897; the Big Horn Hot Springs was the main feature of the lands ceded to the United States for cash payment. An additional 1,480,000 acres of reservation land were ceded to the Government in the Second McLaughlin Agreement in 1904-1905. The revenue derived helped to develop the remaining reservation lands (which came to be known as the \"diminished reservation\"). The United States Government offered the ceded lands for sale to others, under the provisions of the homestead, townsite, coal and mineral land laws, and reimbursed the Tribes or expended for the benefit of the Tribes the money raised by the sales.\n\nThe earliest non-Indian settlements in northwestern and north central Wyoming were near the gold and silver fields in the South Pass area of the Wind River Range. These mining camps soon expanded into permanent farming and ranching communities which relied primarily on cattle ranching and dryland or easily-irrigated farming for sustenance. By the mid-1800's, many small communities had been established by settlers who had obtained their land under the Congressional land disposal acts. By the early 1900's most of the best land in the region was occupied by ranches or irrigated farms. Yet the settlers continued to arrive, forcing gradual expansion onto the dry basin floors and prompting the development of many irrigation projects, often sponsored jointly by private citizens and the United States. The arrival of the homesteaders in the Wind River Basin significantly altered the Indian's economic base. As the number of settlers and their farms increased, the number of Indians working their own farms and ranches decreased, and they began to rent and eventually to sell their land while hiring themselves out as laborers.\n\nIn 1934, all remaining lands which had been ceded to the United States by the 1904 agreement were reserved from non-Indian settlement. In 1940, the Secretary of Interior began a series of restorations of certain undisposed lands to tribal ownership. These lands again became part of the existing Wind River Reservation. In addition, the United States later reacquired, in trust for the Tribes, additional ceded land and certain lands within the diminished reservation which previously had passed into private ownership. Since 1953, the size of the reservation has remained fairly stable.\n\nB. Procedural History of the Instant Litigation\n\nOn January 22, 1977, Wyoming enacted § 1-1054.1, W.S. 1957 (now § 1-37-106, W.S. 1977), authorizing the State to commence system-wide adjudications of water rights. The State of Wyoming filed the complaint commencing this litigation and naming the United States as a defendant on January 24, 1977, in the District Court of the Fifth Judicial District of Wyoming.\n\nThe United States removed the case to the United States District Court for the District of Wyoming in Cheyenne, Wyoming, claiming the state court was without jurisdiction in this suit against the United States. The federal district court granted the State's motion to remand the case to state court on June 1, 1977, finding that the McCarran Amendment and § 1-37-106, W.S. 1977, provided for jurisdiction in the state court.\n\nOn August 21, 1977, the United States moved to dismiss in state court, again alleging that the state court was without jurisdiction and that the Tribes were an indispensable party. The court granted the Tribes' motion for leave to file an amicus curiae brief on the dismissal motion. The Shoshone and Arapahoe Indian Tribes also moved to intervene, alleging that the United States would not adequately represent their interests. The court granted intervention on November 21, 1977, and the Tribes entered their appearance. On December 20, 1977, Judge Joffe denied the United States' motion to dismiss and granted the State of Wyoming partial summary judgment on the United States' jurisdictional defenses.\n\nOn April 20, 1978, the State moved the court to certify this case to the Board of Control pursuant to § 1-37-106(a)(i)(A)(I), W.S. 1977. Judge Joffe entered a First Order of Certification and Referral to the Wyoming State Board of Control on August 22, 1978. The United States and the Tribes objected to the certification and moved for the appointment of a special master. After receiving suggestions, selecting a master and allowing time for objections, Judge Joffe appointed the special master on May 4, 1979. The First Order of Certification and Referral to a special master, entered on May 29, 1979, charged the special master with the duty to:\n\n\"1. Determine the status of those rights which are evidenced by previous Court decrees, as set out in Appendix B to the Complaint herein, as well as those rights evidenced by certificates heretofore issued by the Board of Control, as set out in Appendix C to the Complaint herein, which Appendices may be revised to more accurately reflect the records of the State Engineer and State Board of Control.\n\n\"2. Determine the status of all uncancelled permits to acquire the right to use of water as set out in Appendix D and Appendix E to the Complaint herein, which Appendices may be revised to more accurately reflect the records of the State Engineer and State Board of Control.\n\n\"3. Adjudicate any interest in or right to use the water of the Big Horn River System and all other sources within Water Division No. 3, State of Wyoming, arising under the permits described in paragraph 2, above.\n\n\"4. Determine the extent and priority date of the adjudicate [sic] any other interest in or right to use the water of the Big Horn River System within Water Division No. 3, State of Wyoming, not otherwise represented by the aforedescribed decrees, certificates, or permits, including, but not limited to, any appropriate or reserved rights of the Arapahoe Tribe, Shoshone Tribe, or of the United States in either its proprietary or fiduciary capacity, which may be hereafter identified by said Tribes or the United States and which are not subject to the decrees, permits and/or certificates described in paragraphs 1 and 2 above.\"\n\nThe United States filed its initial statement of claims on March 6, 1980, and supplemental claims on May 29, 1980. The Tribes filed an additional claim on April 4, 1980.\n\nThe case was divided into three phases: Phase I, Indian reserved water rights (appeal decided here); Phase II, non-Indian federal reserved water rights (completed); and Phase III, state water rights evidenced by a permit or certificate (pending).\n\nThe master approved stipulations allowing provisional confirmation of adjudicated rights and settling boundaries and dates. He also dismissed the off-reservation hunting and fishing claims and denied summary judgment on instream flow claims made by the Bureau of Land Management. The trial began January 26, 1981, and concluded December 1981.\n\nThe special master signed his 451-page Report Concerning Reserved Water Right Claims by and on Behalf of the Tribes in the Wind River Reservation on December 15, 1982, covering four years of conferences and hearings, involving more than 100 attorneys, transcripts of more than 15,000 pages and over 2,300 exhibits.\n\nThe report recognized a reserved water right for the Wind River Indian Reservation and determined that the purpose for which the reservation had been established was a permanent homeland for the Indians. A reserved water right for irrigation, stock watering, fisheries, wildlife and aesthetics, mineral and industrial, and domestic, commercial, and municipal uses was quantified and awarded.\n\nA final judgment adjudicating the non-Indian federal reserved water rights (Phase II), pursuant to stipulation, was entered February 9, 1983.\n\nThe State of Wyoming, the United States, the Shoshone and Arapahoe Tribes, and numerous private parties presented objections to the master's report, and on May 10, 1983, Judge Joffe entered his Findings of Fact, Conclusions of Law and Judgment approving that portion of the master's report awarding reserved water rights for practicably irrigable acreage within the Wind River Indian Reservation and refusing to accept that portion of the master's report recommending an award of reserved water rights for other than agricultural purposes.\n\nOn May 13, 1983, this case was assigned to State District Judge Alan B. Johnson. The United States, the State of Wyoming and the Tribes then moved to alter or amend Judge Joffe's decree. On May 24, 1985, pursuant to Rule 54(b), W.R.C.P., the Amended Judgment and Decree from which this appeal is taken was entered.\n\nA 95-page Supplemental Report was filed June 1, 1984, recommending that those individuals who succeeded to the interests of an Indian allottee and individuals owning land which had once been part of the reservation but was obtained under public land acts and not directly from an allottee be awarded state permit priority dates. As to the remaining state water rights, the master recommended future proceedings. On May 24, 1985, Judge Johnson entered an order deferring acceptance of the June 1, 1984 Supplemental and Final Report of the Master, providing:\n\n\"Reservation reserved rights are rights created by the courts solely for the protection and enjoyment of Indian tribes so that they can make their reservations their homelands. These rights do not pass to successors in interest to Indian lands. Therefore, this Court will not award to non-Indian parties an 1868 priority date for their water rights.\" (Citations omitted.)\n\nThe court held that non-Indian successors were entitled to water rights with priority dates established by permits and/or certificates issued by the State of Wyoming, or by evidence of appropriation of water for beneficial use and deferred decision on these claims.\n\nOn July 5, 1985, the United States moved for reimbursement of one-half the special master's fees and expenses (Phase I costs) on grounds that the McCarran Amendment prohibits assessment of costs against the United States. The motion was denied.\n\nII JURISDICTION\n\nEarly in the litigation, the Tribes challenged the jurisdiction created by § 1-37-106, W.S. 1977, on grounds that Article 21, § 26 of the Wyoming Constitution, the so-called disclaimer provision, barred any state court adjudications of Indian water rights. On appeal the Tribes concede that there is no federal law preventing state courts from adjudicating Indian reserved water rights but maintain that the disclaimer provision of the Wyoming Constitution barred the district court, as a matter of state law, from asserting jurisdiction over their water rights. Because the Tribes' claim involves construction of the Wyoming Constitution, not a federal question, our decision on this issue is final. Arizona v. San Carlos Apache Tribe of Arizona, 463 U.S. 545, 561, 103 S.Ct. 3201, 3210, 77 L.Ed.2d 837 (1983).\n\nArticle 21, § 26 of the Wyoming Constitution states:\n\n\"The people inhabiting this state do agree and declare that they forever disclaim all right and title to the unappropriated public lands lying within the boundaries thereof, and to all lands lying within said limits owned or held by any Indian or Indian tribes, and that until the title thereto shall have been extinguished by the United States, the same shall be and remain subject to the disposition of the United States and that said Indian lands shall remain under the absolute jurisdiction and control of the congress of the United States * * *.\" (Emphasis added.)\n\nThis disclaimer is almost identical to those found in the constitutions and enabling acts under which Congress admitted most western states into the Union. See Enabling Act of Feb. 22, 1889, § 4, 25 Stat. 676, 677 (North Dakota, South Dakota, Montana, and Washington); Enabling Act of July 16, 1894, § 3, 28 Stat. 107, 108 (Utah); Enabling Act of June 16, 1906, § 3, 34 Stat. 267, 270 (Oklahoma); Enabling Act of June 20, 1910, § 2, § 20, 36 Stat. 557, 558-559, 569 (New Mexico and Arizona); Enabling Act of July 7, 1958, § 4, 72 Stat. 339, as amended by Act of June 25, 1959, § 2(a), 73 Stat. 141 (Alaska). See also Ariz. Const., Art. 20, ¶ 4; Idaho Const., Art. 21, § 19; Mont. Const., Ordinance No. 1; N.M. Const., Art. 21, § 2; Utah Const., Art. 3. The disclaimers and enabling acts did not establish new bars to state jurisdiction over Indians. They were simply intended to make clear that the new states entered the Union subject to the same jurisdictional limitations first imposed upon the other states by the landmark case of Worcester v. Georgia, 31 U.S. (6 Pet.) 515, 8 L.Ed. 483 (1832). See Arizona v. San Carlos Apache Tribes, supra 463 U.S. at 561-563, 103 S.Ct. at 3210-12; Comment, State Disclaimers of Jurisdiction Over Indians: A Bar to the McCarran Amendment, 18 Land \u0026 Water L.Rev. 175, 180 (1983) (discussing Draper v. United States, 164 U.S. 240, 17 S.Ct. 107, 41 L.Ed.2d 419 (1896)).\n\nThe argument that the state disclaimer should be interpreted to be more protective of the Tribes than the controlling federal law, the McCarran Amendment, has been presented to the Tenth Circuit Court of Appeals and the Supreme Courts of Arizona and New Mexico. Each of these courts has rejected the argument. Jicarilla Apache Tribe v. United States, 601 F.2d 1116, 1130, (10th Cir. 1979), cert. denied 444 U.S. 995, 100 S.Ct. 530, 62 L.Ed.2d 426 (1979); United States v. Superior Court In and For Maricopa County, 144 Ariz. 265, 697 P.2d 658, 669 (1985); State ex rel. Reynolds v. Lewis, 88 N.M. 636, 545 P.2d 1014, 1015 (1976). The persuasive logic of these courts was well stated by the Arizona Supreme Court:\n\n\"If one thing is clear on this issue, it is that the Enabling Act and the provisions which it required to be inserted in the state constitution were intended to ensure supremacy of federal policy and federal law with regard to Indian land. The federal policy, asserted in the McCarran Amendment, is that the United States is `. . . to represent, as guardian, * * * the Indian tribes in any state court general water rights adjudication proceeding . . .' Jicarilla, supra, 601 F.2d at 1130. There is no clear necessity to read the disclaimer provisions of article 20, ¶ 4 of the state constitution as a cession of exclusive jurisdiction. We prefer, if possible, the interpretation which best serves the purposes and objectives of federal law and federal policy, which we acknowledge as supreme in this area. One of those objectives is that Indian claims to surface waters ordinarily be adjudicated in state court as part of a general water rights adjudication, with the United States representing Indian interests. [Arizona v.] San Carlos, 463 U.S.\n\nat\n\n, 103 S.Ct.\n\nat 3212 [77 L.Ed.2d 837 (1983)]. Unless compelled by unambiguous language, we refuse to interpret the provisions of the Arizona Constitution so restrictively as to defeat federal policy when supremacy of that policy was the very objective Congress sought to accomplish by requiring article 20, ¶ 4 to be part of the organic law of this state.\" United States v. Superior Court In and For Maricopa County, supra, [144 Az. 265] 697 P.2d\n\nat 669. See also Arizona v. San Carlos Apache Tribe, supra, 463 U.S.\n\nat 562-563, 103 S.Ct.\n\nat 3211 [77 L.Ed.2d 837 (1983)]; and Comment, supra, 18 Land \u0026 Water L.Rev. at 198-199.\n\nJust one court, the Ninth Circuit Court of Appeals, has held a state constitutional disclaimer to be an independent bar to state jurisdiction over Indian water rights. Northern Cheyenne Tribe of Northern Cheyenne Indian Reservation v. Adsit, 668 F.2d 1080 (9th Cir. 1982). But this case was reversed by the United States Supreme Court in Arizona v. San Carlos Apache Tribe of Arizona, supra 463 U.S. 545, 103 S.Ct. 3201, holding that it was not the business of the Ninth Circuit to interpret Montana's disclaimer as a bar to state jurisdiction after the Montana court had decided to exercise jurisdiction:\n\n\"[T]o the extent that a claimed bar to state jurisdiction in these cases is premised on the respective State Constitutions, that is a question of state law over which the state courts have binding authority. Because, in each of these cases, the state courts have taken jurisdiction over the Indian water rights at issue here, we must assume, until informed otherwise, that — at least insofar as state law is concerned — such jurisdiction exists.\" Id., 463 U.S. at 561, 103 S.Ct. at 3210.\n\nWe have never had occasion to consider the effect of the Wyoming disclaimer provision upon a water case, although it was considered in a civil case involving a collision between a motor vehicle and a horse on the Wind River Indian Reservation. State ex rel. Peterson v. District Court of the Ninth Judicial District, Wyo., 617 P.2d 1056 (1980). There we agreed that the disclaimer provision should be interpreted to be consistent with federal law, stating:\n\n\"McClanahan [v. State Tax Commission of Arizona, 411 U.S. 164, 93 S.Ct. 1257, 36 L.Ed.2d 129 (1973)] thus suggests that interpretation of Article 21, Section 26, of the Wyoming Constitution is largely a question of federal law.\" Id., 617 P.2d at 1067.\n\nWe hold that Article 21, § 26 of the Wyoming Constitution only bars state jurisdiction over Indian water rights when federal law also bars that jurisdiction. Congress's policy under the McCarran Amendment is to allow state courts to adjudicate Indian water rights as part of general stream adjudications. Arizona v. San Carlos Apache Tribe of Arizona, supra 463 U.S. at 564-565, 103 S.Ct. at 3212; Cappaert v. United States, 426 U.S. 128, 145-146, 96 S.Ct. 2062, 2073, 48 L.Ed.2d 523 (1976). Because of the McCarran Amendment, there is no federal law which prevents the State from adjudicating the Indian water rights on the Big Horn River System. The district court correctly assumed jurisdiction in this case.\n\nIII IS THERE A RESERVED WATER RIGHT FOR THE WIND RIVER INDIAN RESERVATION?\n\nA. Preliminary Matters\n\n1. Preservation of Objections for Review and Standard of Review in General\n\nRule 53(e)(2), W.R.C.P., provides:\n\n\"(2) In Non-Jury Actions. — In an action to be tried without a jury the court shall accept the master's findings of fact unless clearly erroneous. Within 10 days after being served with notice of the filing of the report any party may serve written objections thereto upon the other parties. Application to the court for action upon the report and upon objections thereto shall be by motion and upon notice as prescribed in Rule 6(d). The court, after hearing, may adopt the report or may modify it or may reject it in whole or in part or may receive further evidence or may recommit it with instructions.\"\n\nWhether objections to the master's report must be made in the district court to preserve an issue for appeal has not previously been before this court. But, federal courts construing the similar federal rule, F.R.C.P. 53(e), generally hold it unnecessary to make objections to a special master's report. Henry Hanger and Display Fixture Corporation of America v. Sel-O-Rak Corporation, 270 F.2d 635 (5th Cir. 1959); Shima v. Brown, 133 F.2d 48, 49, (D.C. Cir.), cert. denied 318 U.S. 787, 63 S.Ct. 982, 87 L.Ed. 1154 (1943). In Mitchell v. All-States Business Products Corporation, 250 F. Supp. 403, 409 (E.D.N Y 1965), the court stated:\n\n\"The Rule provides that `any party may serve written objections,' but it is not necessary to make objections to the Master's findings as permitted therein. Henry Hanger \u0026 Display Fixture Corp. of America v. Sel-O-Rak Corp., 270 F.2d 635 (5th Cir. 1959). The Rule clearly gives the court the power to modify the Master's report upon a motion for action upon the report and the failure of the Secretary to timely serve objections does not limit this power. 5 Moore, Federal Practice ¶ 53.12\n\n. Cf., Bingham Pump Co. v. Edwards, 118 F.2d 338 (9th Cir.), cert. denied, 314 U.S. 656, 62 S.Ct. 107, 86 L.Ed. 525 (1941); United States v. 1,674.34 Acres of Land, More or Less, in Benton County, Arkansas, 220 F. Supp. 893 (W.D.Ark. 1963).\"\n\nWe consider the federal courts' construction of Rule 53(e), see Centric Corp. v. Drake Bldg. Corp., Wyo., 726 P.2d 1047 (1986); B-T Ltd. v. Blakeman, Wyo., 705 P.2d 307 (1985); and State ex rel. Hopkinson v. District Court, Teton County, Wyo., 696 P.2d 54 (1985), and hold that the district court, absent objection, could review the special master's report. Rule 52(b), W.R.C.P. It is appropriate that this court also review the master's report and actions of the district court. Objections are unnecessary to preserve an issue for appeal.\n\nThe bulk of objections made involve the sufficiency of the evidence to support the awards or deletions from claims. When addressing a sufficiency of the evidence question, this court looks only at the evidence most favorable to the prevailing party, giving to it every favorable inference, and leaving out of consideration entirely evidence in conflict therewith. All-star Video, Inc. v. Baeder, Wyo., 730 P.2d 796, 798 (1986); Wangler v. Federer, Wyo., 714 P.2d 1209, 1216-1217 (1986); Tremblay v. Reid, Wyo., 700 P.2d 391, 392 (1985); City of Rock Springs v. Police Protective Association, Wyo., 610 P.2d 975, 980 (1980).\n\n2. Collateral Estoppel\n\nThe doctrine of collateral estoppel prevents relitigation of \"issues which were involved actually and necessarily in the prior action between the same parties.\" Delgue v. Curutchet, Wyo., 677 P.2d 208, 214 (1984). The State of Wyoming is not estopped from litigating the question of intent to reserve water by United States v. Hampleman, No. 753, June 26, 1916 (D.Wyo.), because the court there decided only that the water rights of the Indian allottees were within the exclusive jurisdiction of the United States. The State was not a party to United States v. Parkins, 18 F.2d 642 (D.Wyo. 1926), which indicated water had been reserved for the Indians. The case of Merrill v. Bishop, 74 Wyo. 298, 287 P.2d 620 (1955), does not collaterally estop Wyoming from raising the question of intent to reserve water because the basis of that decision is that the plaintiffs failed to make their case for injunctive relief on the facts; the question of intent to reserve water was, therefore, not involved. It is clear that these cases do not collaterally estop the State of Wyoming from litigating the question of intent to reserve water.\n\n3. Equitable Estoppel\n\nIt is claimed that the United States should be equitably estopped from asserting Indian water rights for the reservation because the United States induced settlers to relocate on the ceded reservation lands and other lands in the Division and acquire water rights under state law.\n\nThe practice of the United States of obtaining state water permits did not mislead the individual appropriators to believe that the United States would not seek future water rights with an 1868 priority date. The United States should not be estopped from claiming a water right priority date for the future projects which would defeat the rights of other water users. A finding of affirmative misconduct is a prerequisite to invoking the doctrine of equitable estoppel.\n\nThis court recognized the element of affirmative misconduct in DeWitt v. Balben, Wyo., 718 P.2d 854, 861-862 (1986) wherein we cited the following:\n\n\"Equitable estoppel or estoppel by misrepresentation is the effect of the voluntary conduct of a person whereby he is precluded, both at law and in equity, from asserting rights against another person relying on such conduct; and it arises where a person, by his acts, representations, or admissions, or even by his silence when it is his duty to speak, intentionally or through culpable negligence induces another to believe that certain facts exist, and the other person rightfully relies and acts on such belief, and will be prejudiced if the former is permitted to deny the existence of such facts.\" (Emphasis added.) 31 C.J.S. Estoppel § 59, p. 367 (1964). See also Heckler v. Community Health Services of Crawford County, Inc., 467 U.S. 51, 104 S.Ct. 2218, 81 L.Ed.2d 42 (1984) (reasonable reliance on definite misrepresentation to one's detriment required).\n\nIt is clear that in order to invoke the doctrine of equitable estoppel against a government or public agency functioning in its official capacity there must be a showing of affirmative misconduct. Greub v. Frith, Wyo., 717 P.2d 323, 326 (1986); Big Piney Oil and Gas Company v. Wyoming Oil and Gas Conservation Commission, Wyo., 715 P.2d 557 (1986). See also United States v. California, 332 U.S. 19, 39-40, 67 S.Ct. 1658, 1668-69, 91 L.Ed. 1889 (1947); Utah Power and Light Co. v. United States, 243 U.S. 389, 405-409, 37 S.Ct. 387, 391, 61 L.Ed. 791 (1917).\n\nIn the case at bar, there is no doubt that the United States facilitated settlement of non-Indian lands in Water Division No. 3. In addition, during the period 1905-1908, the United States obtained state water permits for some 145,000 acres of Indian lands on the Wind River Indian Reservation and began construction of the irrigation project. Judge Johnson was correct in concluding that none of this indicates affirmative misconduct on the part of the United States.\n\n4. Burden of Proof\n\nThe record is unclear as to which party was given the burden of proof with respect to the existence of a reserved water right. Insofar as the special master may have placed the burden of establishing its claims to water on the United States, he did not err. It is well established that \"[t]he burden of proof is on the party asserting the affirmative of any issue. Morrison v. Reilly, Wyo., 511 P.2d 970 (1973).\" Osborn v. Manning, Wyo., 685 P.2d 1121, 1124 (1984). See, e.g., Younglove v. Graham and Hill, Wyo., 526 P.2d 689, 693 (1974) (burden of proof is on one asserting an affirmative defense); Hawkeye-Security Insurance Company v. Apodaca, Wyo., 524 P.2d 874, 879 (1974) (burden of showing an exception to statute of limitations is on the one claiming the exception). Here, the Tribes and the United States asserted \"affirmative claims\" to reserved water rights for the Indians. The master accepted the Tribes' proposal that the parties be realigned, ordering that the United States and the Tribes be realigned as plaintiffs.\n\nThe McCarran Amendment did not contemplate that the United States would be absolved from the usual burdens once it was joined in litigation. \"If we were sued, we would have to prove * * * our Indian Rights * * *.\" Hearings Before Subcommittee of the Committee on the Judiciary, United States Senate, 82d Cong., 1st Sess., on S. 18, 1951 at 7. The United States has been required to establish its reserved water rights. United States v. New Mexico, 438 U.S. 696, 705, 98 S.Ct. 3012, 3016, 57 L.Ed.2d 1052 (1978); Arizona v. California, 373 U.S. 546, 598, 83 S.Ct. 1468, 1497, 10 L.Ed.2d 542 (1963); Arizona v. California, 460 U.S. 605, 638, 103 S.Ct. 1382, 1401, 75 L.Ed.2d 318 (1983). Block v. North Dakota ex rel. Board of University and School Lands, 461 U.S. 273, 288, 103 S.Ct. 1811, 1820, 75 L.Ed.2d 840 (1983) does not undercut these cases, because nothing indicates that the McCarran Amendment attaches any condition that the United States be relieved from ordinary burdens of proof in litigation.\n\nThe special master could not have erred in requiring the Tribes and the United States to substantiate their claim that water had been reserved for the Wind River Indian Reservation. Because they prevailed on this issue, they were not harmed in any event.\n\nB. Was There an Intent to Reserve Water?\n\n1. Analysis Below\n\nBoth the special master and the district court undertook the rigorous analysis called for by United States v. New Mexico, supra 438 U.S. at 700, 98 S.Ct. at 3014: \"Each time this Court has applied the `implied-reservation-of-water doctrine,' it has carefully examined both the asserted water right and the specific purposes for which the land was reserved, and concluded that without the water the purposes of the reservation would be entirely defeated.\"\n\nIn determining that there was intent to reserve water for the reservation, the special master looked to the treaty, the decision of Winters v. United States, 207 U.S. 564, 28 S.Ct. 207, 52 L.Ed. 340 (1908), and the act admitting Wyoming to the Union. He \"analyzed the 348 `Intent and Purposes' exhibits offered by the State of Wyoming, along with the competent argument of counsel for the State of October 7, 1981, supporting the position that no reservation of water exists.\" The master also studied Merrill v. Bishop, supra 287 P.2d 620. The foregoing indicates quite clearly that the special master did not blindly presume a reserved water right existed, but that he examined the law and the evidence relating to intent and simply found against the State.\n\nNor did the district court blindly presume intent to reserve water. Judge Joffe adopted the report of the special master with some exceptions. He rejected the State's argument that there was no intent to reserve water because it would not only run counter to his interpretation of the intent of Congress but it would also run counter to controlling law on the subject. Judge Johnson adopted Judge Joffe's decision on intent to reserve water.\n\n2. The Appeal\n\na. Intent to Reserve Water in 1868\n\nThe treaty establishing the Wind River Indian Reservation, signed on July 3, 1868, ratified on February 16, 1869, and proclaimed on February 24, 1869, Treaty of Ft. Bridger, 15 Stat. 673 (1869), is silent on the subject of water for the reservation. Yet both the district court and the special master found an intent to reserve water. We affirm.\n\nThe case of Byers v. Wa-Wa-Ne, 86 Or. 617, 169 P. 121, 127 (1917), does not support Wyoming's position that because the Wind River Indians did not need water in 1868, there is no basis for implying a reserved water right. Unlike the lands involved in Byers, the lands in the case at bar did require water to produce crops in 1868. In addition, Byers prevailed in that case because her competing water right was granted by Congress. Id., 169 P. at 122-123.\n\nCongress, by passing the settlement acts, intended non-Indian settlers to obtain water rights. An award of Indian reserved water rights would damage the interests the settlers had established under state law. The settlement acts do not, however, simply by recognizing that water is important to settlers, indicate that water was not important to the Indians as well. Nor do the acts indicate that Congress did not intend to reserve necessary water for the Indians.\n\nIn 1890, Wyoming was admitted to the United States. The act provided that — \"Wyoming * * * is hereby declared admitted to the union on an equal footing with the original States in all respects whatever; and that the constitution which the people of Wyoming have formed for themselves be, and the same is hereby, accepted, ratified, and confirmed.\" 26 Stat. 222, 51st Cong., Sess. I, ch. 664 (1890). Section 2 of the act provided that the Act of Admission did not affect the reservation of Yellowstone National Park nor the right and ownership of the United States to the park. Id. The constitution which was adopted provided that \"[t]he water of all natural streams, springs, lakes or other collections of still water, within the boundaries of the state, are hereby declared to be the property of the State.\" Wyoming Constitution, Art. 8, § 1. It also provided that \"[p]riority of appropriation for beneficial uses shall give the better right.\" Article 8, § 3. In addition, the constitution disclaimed jurisdiction over Indian lands. Wyoming Constitution, Art. 21, § 26.\n\nThis court's decision in Merrill v. Bishop, supra, 287 P.2d 620, while indicating that the admission had impacted the rights of successors to allottees in the ceded portions of the reservation, did not decide the question of intent to reserve water, but held only that the allottees' successors failed to prove the facts necessary for an injunction. The United States District Court for the District of Wyoming, on the other hand, has twice indicated that the treaty did reserve water for the Indians, both cases being decided after Wyoming was admitted to the Union. United States v. Hampleman, supra No. 753, June 26, 1916; and United States v. Parkins, supra 18 F.2d 642. The United States Supreme Court has said:\n\n\"The Court has previously concluded that whatever powers the States acquired over their waters as a result of congressional Acts and admission into the Union, however, Congress did not intend thereby to relinquish its authority to reserve unappropriated water in the future for use on appurtenant lands withdrawn from the public domain for specific federal purposes.\" United States v. New Mexico, supra 438 U.S. at 698, 98 S.Ct. at 3013.\n\nThe Gila National Forest was set aside in 1899, before New Mexico was admitted to the Union. Thus, the federal courts have determined that admission acts do not indicate that Congress abandoned reserved water rights. The fact that the admission act reserved to the United States jurisdiction and ownership of Yellowstone National Park but is silent as to the Wind River Indian Reservation in no way detracts from our conclusion.\n\nThe equal footing clause contained in the Act of Admission does not evidence an intent not to reserve water. The equal footing doctrine argument was rejected in United States v. District Court in and For County of Eagle, Colorado, 401 U.S. 520, 91 S.Ct. 998, 28 L.Ed.2d 278 (1971) (U.S. can reserve water before or after admission). See also United States v. Texas, 339 U.S. 707, 70 S.Ct. 918, 94 L.Ed. 1221 (1950) (equal footing clause refers only to political rights and sovereignty). The fact that the irrigability of Wyoming was an important factor in the decision to admit it does not indicate that anyone intended to deprive the Indians of the advantage of water.\n\nWe now hold that, examining the Act of Admission and the constitution as a whole, and considering more recent federal pronouncements on the issue, the admission of Wyoming to the Union did not evidence an intent by Congress not to reserve water for the reservation.\n\nThe fact that the pre-Winters years evidenced some uncertainty in the status of Indian water rights negatives the notion that actions during these years were indicative of an intent not to reserve water for the Wind River Indian Reservation. The master was correct in determining that the uncertain acts between 1902 and 1908 reflect only the uncertainty in the law, not an intent not to reserve water.\n\nThe Second McLaughlin Agreement, Treaty of April 21, 1904, Act of March 3, 1905, 33 Stat. 1016, does not evidence an intent not to reserve water for the reservation. The Indians were eager to secure their water rights, Minutes of Council, Shoshone Agency, April 19, 1904, at 19, and understood that the agreement would make their water rights firm. Id. at 22. The agreement contained the following provisions:\n\n\"The said Indians belonging on the Shoshone or Wind River Reservation * * * do hereby cede, grant, and relinquish to the United States, all right, title, and interest they may have to all the lands embraced within the reservation, except [certain lands].\" Article 1.\n\n\"The balance [of $85,000, after per capita payments, estimated to be approximately $2,000] shall be devoted to surveying, platting, making of maps, payment of fees, and performance of such acts as are required by the statutes of the State of Wyoming in securing water rights from said State for the irrigation of such lands as shall remain the property of said Indians * * *.\" Article 3.\n\n\"[One hundred and fifty thousand dollars was authorized] for the construction and extension of an irrigation system within the diminished reservation for the irrigation of the lands of the said Indians * * *.\" Article 4.\n\n\"It is further understood that nothing in this agreement shall be construed to deprive the said Indians of the Shoshone or Wind River Reservation, Wyoming, of any benefits to which they are entitled under existing treaties or agreements, not inconsistent with the provisions of this agreement.\" Article 10.\n\nA reservation of water with an 1868 priority date is not inconsistent with the permit provisions of the pre-Winters 1905 Act. The rejection of the provision which would have given the Indians a grace period in which to secure their own permits for allotments on the ceded portion of the reservation, H.R.Rep. No. 3700, 58th Cong., 3d Sess. (1905), is no indication there was never any intent to reserve water for the Indians, but only of fear that it would delay settlement of the area opened. S.Rep. No. 4263, 58th Cong., 3rd Sess. (1905).\n\nThe fact that contemporary agreements indicate that the United States knew how to reserve water for Indians is of marginal relevance. Congress also knew how to express a relinquishment of reserved water rights. See First McLaughlin Agreement, or Thermopolis Purchase, supra, Article 1 (Tribes surrender \"all their right, title, and interest of every kind and character\" to water rights appurtenant to ceded lands). It is well established that Congress must use such explicit statutory language in order to abrogate treaty rights. Oneida County, N.Y. v. Oneida Indian Nation of New York State, 470 U.S. 226, 247, 105 S.Ct. 1245, 1258, 84 L.Ed.2d 169 (1985), citing Washington v. Washington State Commercial Passenger Fishing Vessel Association, 443 U.S. 658, 690, 99 S.Ct. 3055, 3077, 61 L.Ed.2d 823 (1979) and Menominee Tribe of Indians v. United States, 391 U.S. 404, 88 S.Ct. 1705, 20 L.Ed.2d 697 (1968). Cf., Rosebud Sioux Tribe v. Kneip, 430 U.S. 584, 586, 97 S.Ct. 1361, 1363, 51 L.Ed.2d 660 (1977).\n\nInconsistent actions by the United States do not evidence an intent not to reserve water. After the 1905 Act was passed, the United States did seek and obtain state water permits for Indian land and continued to seek permits while asserting reserved water rights for the reservation after Winters v. United States, supra, 207 U.S. 564, 28 S.Ct. 207, 52 L.Ed.2d 340 (1908) was decided. The United States more strongly asserted its reserved water rights when, in 1910, it refused to apply to the State for an extension of time in which to complete the irrigation project authorized by the 1905 Act. It was in 1911 that Water Commissioner Hampleman first closed the headgates on an allottee's ditches claiming that she had no valid state permit. Ultimately the case which arose from his actions was decided in favor of the Indians in 1916. In the meantime, in 1914, Congress rejected a provision which would have protected water rights for allotments: \"Any invasion of a prior right of the United States to the waters of a stream is a trespass, and the Government may maintain a suit in equity to protect its right against any or all such trespassers.\" 1913 H.R. 12579, Indian Appropriations Bill, Subcommittee of the Committee on Indian Affairs of the House of Representatives. That this provision, sought to be attached to the 1914 Appropriations Act, 38 Stat. 582, was not enacted into law is no indication that there was no intent to reserve water; the amendment could not be enacted because it was ruled out of order.\n\nNor do other cited actions evidence an intent not to reserve water. In 1926, the federal district court announced its decision in United States v. Parkins, supra 18 F.2d 642, finding against a successor to an allottee who had been diverting water without authority. In a 1939 act appropriating a fund for the Shoshone Tribe, Congress authorized the Secretary of the Interior to establish land use districts within the ceded and nonceded lands and to acquire, exchange and consolidate lands and water rights. In 1953, Congress appropriated funds constituting final payment, pursuant to the 1905 Act, for certain lands withdrawn and reserved under the 1902 Reclamation Act. In 1955, the Wyoming Supreme Court decided the case of Merrill v. Bishop, supra 287 P.2d 620, in favor of the State and against allottees' successors. These actions are not sufficient proof of intent not to reserve water for the Indians.\n\nb. Subsequent Abrogation\n\nWhat we have said above disposes of the contention that even if the treaty did reserve water for the Wind River Indian Reservation in 1868, the right to water was abrogated by the 1890 Act of Admission and/or the 1905 Act. If the actions are not sufficient evidence to show there never was any intent to reserve water, they are not sufficient to make the even stronger showing that such an established treaty right has been abrogated. The district court did not err in finding a reserved water right for the Wind River Indian Reservation.\n\nc. Sensitivity Doctrine\n\nThe sensitivity doctrine does not apply to the question of intent to reserve water. United States v. New Mexico, supra, 438 U.S. 704, 98 S.Ct. at 3016. At any rate, both the special master and the district court were sensitive to existing water rights in determining there was an intent to reserve water for the Wind River Indian Reservation.\n\nIV PURPOSES OF THE WIND RIVER INDIAN RESERVATION\n\nThe government may reserve water from appropriation under state law for use on the lands set aside for an Indian reservation. Winters v. United States, supra 207 U.S. 564, 28 S.Ct. 207. A reserved water right is implied for an Indian reservation where water is necessary to fulfill the purposes of reservation. United States v. Adair, 723 F.2d 1394, 1409 (9th Cir. 1983), cert. denied sub nom. Oregon v. United States, 467 U.S. 1252, 104 S.Ct. 3536, 82 L.Ed.2d 841 (1984). The quantity of water reserved is the amount of water sufficient to fulfill the purpose of the lands set aside for the reservation. See, e.g., Cappaert v. United States, supra 426 U.S. at 138, 96 S.Ct. at 2069, and 426 U.S. at 141, 96 S.Ct. at 2071 (relying on Arizona v. California, supra 373 U.S. at 600-601, 83 S.Ct. at 1497-1498, 10 L.Ed.2d at 578-579 (to the same effect)); United States v. New Mexico, supra 438 U.S. at 698, 98 S.Ct. at 3013. Congress can reserve water for lands withdrawn for specific federal purposes. Winters v. United States, supra 207 U.S. 564, 28 S.Ct. 207; Arizona v. California, supra 373 U.S. at 597-598, 93 S.Ct. at 1496; Colville Confederated Tribes v. Walton, 647 F.2d 42, 46 (9th Cir.), cert. denied 454 U.S. 1092, 102 S.Ct. 657, 70 L.Ed.2d 630 (1981), cert. denied 475 U.S. 1010, 106 S.Ct. 1183, 89 L.Ed.2d 300 (1986). We have already decided that Congress intended to reserve water for the Wind River Indian Reservation when it was created in 1868, and we accept the proposition that the amount of water impliedly reserved is determined by the purposes for which the reservation was created.\n\nThe special master's finding that the principal purpose for the creation of the reservation was to provide a permanent homeland for the Indians is not a factual determination. The master determined the purpose of the Indian reservation from the face of the treaty as a matter of law. Where the contract is unambiguous, the meaning or intent is derived from the instrument itself as a matter of law. Rouse v. Munroe, Wyo., 658 P.2d 74, 77 (1983); Goodwin v. Upper Crust of Wyoming, Inc., Wyo., 624 P.2d 1192, 1195 (1981); Amoco Production Company v. Stauffer Chemical Company of Wyoming, Wyo., 612 P.2d 463, 465 (1980); Goodman v. Kelly, Wyo., 390 P.2d 244, 247 (1964). The legal principles applicable to the interpretation of contracts apply also to interpretation of Indian treaties. Washington v. Washington State Commercial Passenger Fishing Vessel Association, supra 443 U.S. at 675, 99 S.Ct. at 3069. The purposes of a treaty are ascertained by utilizing rules for determining the intent of parties to a contract. Sullivan v. Kidd, 254 U.S. 433, 439, 41 S.Ct. 158, 160, 65 L.Ed. 344 (1921). The special master found as a matter of law that the treaty was unambiguous and ascertained the purpose for creation of the reservation from the four corners of the treaty, stating:\n\n\"Analyzing the Treaty in its entirety, with specific reference to the above cited provisions, it is not at all unreasonable to conclude that the principal purpose for entering into this Treaty was to provide the Indians with a homeland where they could establish a permanent place to live and to develop their civilization just as any other nation throughout history has been able to develop its civilization.\"\n\nThe district court ascertained the purpose of the reservation from the treaty itself, stating: \"On the very face of the Treaty, it is clear that its purpose was purely agricultural.\" This legal determination is fully reviewable by this court.\n\nA. The Treaty\n\nThe Treaty with the Shoshones and Bannacks, July 3, 1868, provides in pertinent part:\n\n\"ARTICLE I. From this day forward, peace between the parties to this treaty shall forever continue. The government of the United States desires peace, and its honor is hereby pledged to keep it. The Indians desire peace, and they hereby pledge their honor to maintain it.\n\n\"ARTICLE II. It is agreed that whenever the Bannacks desire a reservation to be set apart for their use, or whenever the President shall deem it advisable * * *, he shall cause a suitable one to be selected for them in their present country * * *. The United States further agrees that the following district of county * * * shall be and the same is set apart for the absolute and undisturbed use and occupation of the Shoshone Indians herein named, and for such other friendly tribes as from time to time they may be willing, with the consent of the United States, to admit amongst them; and the United States now solemnly agrees that no persons except those herein designated and authorized so to do, and except such officers, agents, and employees of the government as may be authorized to enter upon Indian reservations in discharge of duties enjoined by law, shall ever be permitted to pass over, settle upon, or reside in the territory described in this article for the use of said Indians, and henceforth they will and do hereby relinquish all title, claims, or rights in and to any portion of the territory of the United States, except such as is embraced within the limits aforesaid.\n\n\"ARTICLE III. The United States agrees * * * to construct * * * a warehouse or storeroom * * *; an agency building for the residence of the agent * * *; a residence for the physician * * *; and five other buildings, for a carpenter, farmer, blacksmith, miller, and engineer * * *; also a schoolhouse or mission building * * *.\n\n\"The United States agrees further to cause to be erected * * * a good steam circular saw-mill, with a grist-mill and shingle machine attached * * *.\n\n\"ARTICLE IV. The Indians herein named agree * * * they will make said reservations their permanent home, and they will make no permanent settlement elsewhere; but they shall have the right to hunt on the unoccupied lands of the United States so long as game may be found thereon, and so long as place subsists * * *.\n\n\"ARTICLE VI. If any individual belonging to said tribes * * * shall desire to commence farming, he shall have the privilege to select * * * a tract of land within the reservation of his tribe * * * which tract * * * shall cease to be held in common * * *.\n\n\"ARTICLE VII. In order to insure the civilization of the tribes entering into this treaty, the necessity of education is admitted, especially of such of them as are or may be settled on said agricultural reservations * * *.\n\n\"ARTICLE VIII. When the head of a family or lodge shall have selected lands and received his certificate as above directed, and the agent shall be satisfied that he intends in good faith to commence cultivating the soil for a living, he shall be entitled to receive seeds and agricultural implements for the first year * * * and for each succeeding year he shall continue to farm, for a period of three years more * * *.\n\n\"And it is further stipulated that such persons as commence farming shall receive instructions from the farmers * * * and whenever more than one hundred persons on either reservation shall enter upon the cultivation of the soil, a second blacksmith shall be provided * * *.\n\n\"ARTICLE IX. * * * the United States agrees to deliver at the agency house on the reservation [items of clothing].\n\n\"* * * and in addition to the clothing herein named, the sum of ten dollars shall be annually appropriated for each Indian roaming and twenty dollars for each Indian engaged in agriculture, for a period of ten years, to be used by the Secretary of the Interior in the purchase of such articles as from time to time the condition and necessities of the Indians may indicate to be proper.\n\n\"ARTICLE XII. It is agreed that the sum of five hundred dollars annually for three years from the date when they commence to cultivate a farm, shall be expended in presents to the ten persons of said tribe, who in the judgment of the agent, may grow the most valuable crops for the respective year.\" (Emphasis added.)\n\nThe court in Colville Confederated Tribes v. Walton, supra 647 F.2d 42, did not mandate that a single purpose for the reservation be found. Rather, the court applied the specific purpose test outlined in United States v. New Mexico, supra 438 U.S. at 702, 98 S.Ct. at 3015, in an Indian reserved water case and found two primary purposes: \"to provide a homeland for the Indians to maintain their agrarian society,\" 647 F.2d at 47, for which practicably irrigable acreage was the measure, and to preserve the \"tribes' access to fishing grounds.\" 647 F.2d at 48. See also Confederated Salish and Kootenai Tribes of Flathead Reservation, Montana v. Flathead Irrigation and Power Project, 616 F. Supp. 1292, 1297 (D.Mont. 1985). The validity of the ninth circuit's application of the New Mexico test has been drawn into question because the standards governing non-Indian federal reserved water rights differ from those governing Indian reserved water rights. F. Cohen, Handbook of Federal Indian Law, ch. 10 § 133, at 583-584 (1982 ed.); State ex rel. Greely v. Confederated Salish and Kootenai Tribes of Flathead Reservation, Mont., 712 P.2d 754, 766-767 (1985). See also Montana v. Blackfeet Tribe of Indians, 471 U.S. 759, 105 S.Ct. 2399, 2404, 85 L.Ed.2d 753 (1985). In United States v. Adair, supra 723 F.2d at 1408, the ninth circuit agreed that non-Indian federal reservation reserved water rights cases only provide useful guidelines to Indian reserved water rights.\n\nThe following cases are not authority for limiting reserved water for a permanent homeland reservation to irrigation because the only reserved water rights sought were for irrigation and related uses: Winters v. United States, supra 207 U.S. 564, 28 S.Ct. 207; United States ex rel. Ray v. Hibner, 27 F.2d 909 (D.C.Idaho 1928); Skeem v. United States, 273 F. 93 (C.C.A.Idaho 1921); United States v. Powers, 305 U.S. 527, 533, 59 S.Ct. 344, 83 L.Ed.2d 330 (1939). See also Anderson v. Spear-Morgan Livestock Company, 107 Mont. 18, 79 P.2d 667, 669 (1938) (dicta indicates only an implied reservation for irrigation, but does not address the question of reservation of water for other uses).\n\nIt is well established that the judgment of the district court will be upheld for any proper reason appearing of record. Anderson v. Bauer, Wyo., 681 P.2d 1316 (1984); Mentock v. Mentock, Wyo., 638 P.2d 156 (1981). Considering the well-established principles of treaty interpretation, the treaty itself, the ample evidence and testimony addressed, and the findings of the district court, we have no difficulty affirming the finding that it was the intent at the time to create a reservation with a sole agricultural purpose. Indian treaties should be interpreted generously, Oneida County, N.Y. v. Oneida Indian Nation of New York State, supra, 470 U.S. at 247, 105 S.Ct. at 1258; Carpenter v. Shaw, 280 U.S. 363, 366-367, 50 S.Ct. 121, 122, 74 L.Ed. 478 (1930), and liberally in favor of the Indians, United States v. Shoshone Tribe, 304 U.S. 111, 117, 58 S.Ct. 794, 798, 82 L.Ed. 1213 (1938); Winters v. United States, supra 207 U.S. 564, 28 S.Ct. 207; McClanahan v. State Tax Commission of Arizona, 411 U.S. 164, 174, 93 S.Ct. 1257, 1263, 36 L.Ed.2d 129 (1973); Washington v. Washington State Commercial Passenger Fishing Vessel Association, supra 443 U.S. at 676, 99 S.Ct. at 3069; State ex rel. Greely v. Confederated Salish and Kootenai Tribes of Flathead Reservation, supra 712 P.2d at 762-763; United States v. Adair, supra 723 F.2d at 1413; United States v. Lower Elwha Tribe, 642 F.2d 1141, 1144 (9th Cir.), cert. denied sub nom. Makah Indian Tribe v. Lower Elwha Tribe, 454 U.S. 862, 102 S.Ct. 320, 70 L.Ed.2d 161 (1981), and should not be given a crabbed or restrictive meaning. McClanahan v. State Tax Commission of Arizona, supra 411 U.S. at 176, 93 S.Ct. at 1264. Nor should treaties be improperly construed in favor of Indians, for \"`[W]e cannot remake history,'\" Rosebud Sioux Tribe v. Kneip, supra 430 U.S. at 615, 97 S.Ct. at 1377, citing DeCoteau v. District County Court for Tenth Judicial District, 420 U.S. 425, 449, 95 S.Ct. 1082, 1095, 43 L.Ed.2d 300 (1975); In re Wilson, 30 Cal.3d 21, 36, 177 Cal.Rptr. 336, 346, 634 P.2d 363, 372 (1981) (citing same case), and courts should not distort the words of a treaty to find rights inconsistent with its language. Ward v. Race Horse, 163 U.S. 504, 16 S.Ct. 1076, 41 L.Ed. 244 (1896).\n\nArticle 7 of the treaty refers to \"said agricultural reservations.\" Article 6 authorizes allotments for farming purposes; Article 8 provides seeds and implements for farmers; in Article 9 \"the United States agreed to pay each Indian farming a $20 annual stipend, but only $10 to `roaming' Indians\"; and Article 12 establishes a $50 prize to the ten best Indian farmers. The treaty does not encourage any other occupation or pursuit. The district court correctly found that the reference in Article 4 to \"permanent homeland\" does nothing more than permanently set aside lands for the Indians; it does not define the purpose of the reservation. Rather, the purpose of the permanent-home reservation is found in Articles 6, 8, 9, and 12 of the treaty.\n\nThe emphasis on education for Indians settled on \"said agricultural reservations,\" in Article 7 also helps to define the purpose of the reservation. Those words do not refer only to the farm tracts selected by individual Indians under Article 6, but to the two Indian reservations authorized by the treaty — for the Shoshone in Wyoming (Wind River) and for the Bannack in Utah (Fort Hall). Other treaties have emphasized the importance of education in somewhat different language. See, e.g., Treaty with the Ute Tribe, March 2, 1868, 15 Stat. 619, Article 8; Treaty with the Navajo Tribe, June 1, 1868, 15 Stat. 667, Article 6; Treaty of Fort Laramie with the Cheyenne and Arapahoe, May 10, 1868, 15 Stat. 655, Article 4; Treaty of Fort Laramie with the Crow, May 7, 1868, 15 Stat. 649, Article 7. The thrust of all these provisions is that education is especially important for those Indians who are settled and engaged in agriculture and are no longer roaming. Thus, while Article 7 of the instant treaty emphasizes the importance of education for Indians engaged in farming, \"said agricultural reservations\" does have a broader meaning — that the two Indian reservations were to be agricultural.\n\nAlthough the treaty did not force the Indians to become farmers and although it clearly contemplates that other activities would be permitted (hunting is mentioned in Article 4, lumbering and milling in Article 3, roaming in Article 9), the treaty encouraged only agriculture, and that was its primary purpose. The Court in United States v. Shoshone Tribe of Indians, supra 304 U.S. 111, 58 S.Ct. 794, discussing the purpose of this treaty, stated:\n\n\"Provisions in aid of teaching children and of adult education in farming, and to secure for the tribe medical and mechanical service, to safeguard tribal and individual titles, when taken with other parts of the treaty, plainly evidence purpose on the part of the United States to help to create an independent permanent farming community upon the reservation.\" Id., 304 U.S. at 117-118, 58 S.Ct. at 798.\n\nThe Court, while recognizing that the Tribes were the beneficial owners of the reservation's timber and mineral resources, id., 304 U.S. at 117, 58 S.Ct. at 798, and that it was known to all before the treaty was signed that the Wind River Indian Reservation contained valuable minerals, nonetheless concluded that the purpose of the reservation was agricultural. The fact that the Indians fully intended to continue to hunt and fish does not alter that conclusion. October 4, 1868 Report to the President of the Indian Peace Commission; Report of Wyoming Territory Superintendent of Indian Affairs, October 11, 1870. See also Williams, Personal Recollections of Wash-A-Kie, Chief of the Shoshones, 1 Utah Historical Quarterly 101, 104 (1928) (the Shoshone left the reservation both before and after the treaty for better hunting and fishing grounds in Utah).\n\nAgreements subsequent to the treaty acknowledge the continuance of non-agricultural activities on the reservation. The Brunot Agreement of 1872, 18 Stat. 291, 292, 43rd Cong., Sess. II, ch. 2 (1874); 1904 McLaughlin Agreement, Act of March 3, 1905, 33 Stat. 1016; 1896 Agreement, 30 Stat. 63, 93. The reports of the Indian agents are replete with descriptions of and plans for other activities. Yet not one of the cited reports neglects to report also on the progress of the farming and ranching operations. The primary activity was clearly agricultural.\n\nB. Fisheries\n\nReserved water rights for fisheries have been recognized where a treaty provision explicitly recognized an exclusive right to take fish on the reservation or the right to take fish at traditional off-reservation fishing grounds, in common with others. United States v. Winans, 198 U.S. 371, 384, 25 S.Ct. 662, 665, 49 L.Ed. 1089 (1905); Byers v. Wa-Wa-Ne, supra 169 P. at 122; United States v. Adair, supra 723 F.2d at 1408; Puyallup Tribe, Inc. v. Washington Department of Game of Washington, 433 U.S. 165, 175, 97 S.Ct. 2616, 2622, 53 L.Ed.2d 667 (1977); United States v. Lower Elwha Tribe, supra 642 F.2d at 1147; Confederated Salish and Kootenai Tribes of Flathead Reservation, Montana v. Flathead Irrigation and Power Project, supra 616 F. Supp. at 1294; Washington v. Washington State Commercial Passenger Fishing Vessel Association, supra 443 U.S. at 661, 99 S.Ct. at 3062.\n\nInstream fishery flows have also been recognized where the Indians were heavily, if not totally, dependent on fish for their livelihood. United States v. Adair, supra 723 F.2d at 1409; Colville Confederated Tribes v. Walton, supra 647 F.2d at 48. In the case at bar, the Tribes introduced evidence showing that fish had always been part of the Indians' diet. The master, erroneously concluding that a reserved right for fisheries should be implied when the tribe is \"at least partially dependent upon fishing,\" awarded an instream flow right for fisheries. The district court, however, finding neither a dependency upon fishing for a livelihood nor a traditional lifestyle involving fishing, deleted the award. The district court did not err. The evidence is not sufficient to imply a fishery flow right absent a treaty provision.\n\nC. Mineral and Industrial\n\nThe Tribes were denied a reserved water right for mineral and industrial development. All parties to the treaty were well aware before it was signed of the valuable mineral estate underlying the Wind River Indian Reservation. October 4, 1686, Report of Brevet Major C.C. Augur to the President of the Indian Peace Commission; Brunot Agreement, 18 Stat. 291, 292, 43rd Cong., Sess. II, ch. 2 (1874); United States v. Shoshone Tribe of Indians, supra 304 U.S. 111, 58 S.Ct. 794. The question of whether, because the Indians own the minerals, the intent was that they should have the water necessary to develop them must be determined, of course, by the intent in 1868. Neither the Tribes nor the United States has cited this court to any provision of the treaty or other evidence indicating that the parties contemplated in 1868 that a purpose of the reservation would be for the Indians to develop the minerals. The fact that the Tribes have since used water for mineral and industrial purposes does not establish that water was impliedly reserved in 1868 for such uses. The district court did not err in denying a reserved water right for mineral and industrial uses.\n\nD. Municipal, Domestic and Commercial\n\nA reserved water right for municipal, domestic and commercial uses was included within the agricultural reserved water award. Domestic and related use has traditionally been subsumed in agricultural reserved rights. See, e.g., United States ex rel. Ray v. Hibner, supra 27 F.2d at 911 (the treaties fixed the rights of the Indians — \"to a continuous use of a sufficient amount of water for the irrigation of their lands, and domestic purposes\"); United States v. Powers, supra 305 U.S. at 533, 59 S.Ct. at 347 (\"waters essential to farming and home making\"). Practicably irrigable acreage (PIA) was established as the measure of an agricultural reserved water right in Arizona v. California, supra 373 U.S. at 601, 83 S.Ct. at 1498. The special master there indicated that PIA was the measure of water necessary for agriculture and related purposes. Report from Simon H. Rifkind, Special Master, to the Supreme Court 265-266 (December 5, 1960) quoted in Colville Confederated Tribes v. Walton, supra 647 F.2d at 48. The court properly allowed a reserved water right for municipal, domestic, and commercial use.\n\nE. Livestock\n\nFor the reasons stated above, the district court did not err in finding a sole agricultural purpose for the reservation or in subsuming livestock use within that purpose.\n\nF. Wildlife and Aesthetics\n\nThe special master awarded 60% of historic flows for wildlife and aesthetic uses, consistent with his determination that the purpose of the reservation was to be a permanent homeland. The district court deleted this award, reciting not only that the purpose was solely agricultural, but that insufficient evidence had been presented to justify an award for these uses. The district court did not err in holding that the Tribes and the United States did not introduce sufficient evidence of a tradition of wildlife and aesthetic preservation which would justify finding this to be a purpose for which the reservation was created and for which water was impliedly reserved.\n\nThe district court did not err in finding a sole agricultural purpose in the creation of the Wind River Indian Reservation. The Treaty itself evidences no other purpose, and none of the extraneous evidence cited is sufficient to attribute a broader purpose.\n\nV SCOPE OF THE RESERVED WATER RIGHT\n\nA. Groundwater\n\nThe logic which supports a reservation of surface water to fulfill the purpose of the reservation also supports reservation of groundwater. See Tweedy v. Texas Company, 286 F. Supp. 383, 385 (D.Mont. 1968) (\"whether the [necessary] waters were found on the surface of the land or under it should make no difference\"). Certainly the two sources are often interconnected. See § 41-3-916, W.S. 1977 (where underground and surface waters are \"so interconnected as to constitute in fact one source of supply,\" a single schedule of priorities shall be made); Final Report to the President and to the Congress by the National Water Commission, Water Policies for the Future 233 (1973) (groundwater and surface water \"often naturally related\"); Cappaert v. United States, supra 426 U.S. at 142-143, 96 S.Ct. at 2071 (citing additional authority to this effect).\n\nAcknowledging the above, we note that, nonetheless, not a single case applying the reserved water doctrine to groundwater is cited to us. The ninth circuit indicated that groundwater was reserved in United States v. Cappaert, 508 F.2d 313, 317 (9th Cir. 1974). The United States Supreme Court, however, found the water in the pool reserved for preservation of the pupfish was not groundwater but surface water, protected from subsequent diversions from either surface or groundwater supplies. Cappaert v. United States, supra 426 U.S. at 143, 96 S.Ct. at 2071. Nor have the other cases cited to us granted a reserved right in underground water. In Colville Confederated Tribes v. Walton, supra 647 F.2d 42, there is slight mention of the underground aquifer and of pumping wells, Id. at 52, but the opinion does not indicate that \"their wells\" are a source of reserved water or even discuss a reserved groundwater right. Tweedy v. Texas Company, supra 286 F. Supp. 383, did not recognize a reserved groundwater right. Pueblo water rights, which include not only surface water but also groundwater \"interrelated to the surface water as an integral part of the hydrologic cycle,\" State of New Mexico ex rel. Reynolds v. Aamodt, 618 F. Supp. 993, 1010 (D.N.M. 1985), do not apply here.\n\nThe district court did not err in deciding there was no reserved groundwater right. Because we hold that the reserved water doctrine does not extend to groundwater, we need not address the separate claim that the district court erred in determining that the State owns the groundwater. The State has not appealed the decision that the Tribes may continue to satisfy their domestic and livestock needs (part of the agricultural award) from existing wells at current withdrawal rates; therefore, we do not address that question.\n\nB. Exportation\n\nThe district court held that \"[t]he Tribes can sell or lease any part of the water covered by their reserved water rights but the said sale or lease cannot be for exportation off of the Reservation.\" The Tribes did not seek permission to export reserved water, and the United States concedes that no federal law permits the sale of reserved water to non-Indians off the reservation. Because of our holding on the groundwater issue, we need not address the separate constitutional attack on the prohibition of exportation of groundwater.\n\nC. Finality\n\nThe instant decree made no provision for future modification. In Article 9 of the decree in Arizona v. California, the Court retained \"jurisdiction of this suit for the purpose of any order, direction, modification of the decree, or any supplementary decree.\" Arizona v. California, supra 460 U.S. at 617-618, 103 S.Ct. at 1391. The Court explained that \"the Article was mainly a safety net added to retain jurisdiction and to ensure that we had not, by virtue of res judicata, precluded ourselves from adjusting the decree in light of unforeseeable changes in circumstances.\" Id., 460 U.S. at 622, 103 S.Ct. at 1393.\n\nThe statute authorizing this general adjudication, § 1-37-106, W.S. 1977, is in the Uniform Declaratory Judgments Act. Section 1-37-102, W.S. 1977, provides that \"such declarations shall have the effect of a final judgment.\" Section 1-37-114, W.S. 1977, provides: \"The Uniform Declaratory Judgments Act is remedial. Its purpose is to settle and to afford relief from uncertainty and insecurity * * *.\" This court has said that the separate statutory provisions for stream adjudications \"evince the legislative purpose peradventure of cavil that the adjudication of a water right in favor of a claimant shall be final and binding, and that no further rights may be claimed by him over and above the award made in the adjudication.\" Campbell v. Wyoming Development Company, 55 Wyo. 347, 100 P.2d 124, 137, reh. denied 102 P.2d 745 (1940). We conclude that finality in this litigation is appropriate.\n\nThe Tribes have several avenues available to them should unforeseen future problems develop. Rule 60(a), W.R.C.P., provides relief from clerical errors. Rule 60(b), W.R.C.P., provides relief from other mistakes. In addition, § 1-37-110, W.S. 1977, provides supplemental relief:\n\n\"Further relief based on a declaratory judgment may be granted. * * * If the application is sufficient the court, on reasonable notice, shall require any adverse party whose rights have been adjudicated by the declaratory judgment to show cause why further relief should not be granted.\"\n\nClearly the district court did not need to retain jurisdiction as a \"safety net.\"\n\nVI QUANTIFICATION\n\nA. The Measure\n\nThe measure of the Tribes' reserved water right is the water necessary to irrigate the practicably irrigable acreage on the reservation. In Arizona v. California, supra 373 U.S. at 600-601, 83 S.Ct. at 1498, a needs test was rejected as too uncertain, the Court opting instead for practicably irrigable acreage as the measure of a tribal agricultural reserved water right. Two subsequent non-Indian reserved water right cases, Cappaert v. United States, supra 426 U.S. 128, 96 S.Ct. 2067, and United States v. New Mexico, supra 438 U.S. at 702, 98 S.Ct. at 3015, indicate that necessity is the measure of a reserved water right. And in Washington v. Washington State Commercial Passenger Fishing Vessel Association, supra 443 U.S. at 686-687, 99 S.Ct. at 3075, the Court recognized the propriety of reducing the Indians' proportion of the fish harvest as their needs diminished. Nonetheless, the Court declined the invitation to re-examine the PIA standard in Arizona v. California, supra 460 U.S. at 625-626, 103 S.Ct. at 1394-1395, and reaffirmed the value of the certainty inherent in the practicably irrigable acreage standard. The district court was correct in quantifying the Tribes' reserved water right by the amount of water necessary to irrigate all of the reservation's practicably irrigable acreage.\n\nB. Future Lands\n\nThe Tribes and the United States claimed a reserved water right for lands on the reservation not yet developed for irrigation, but which were in their view, practicably irrigable acreage. Counsel for the State, the Tribes and the United States agreed upon a definition of practicably irrigable acreage: \"those acres susceptible to sustained irrigation at reasonable costs.\" The determination of practicably irrigable acreage involves a two-part analysis, i.e., the PIA must be susceptible of sustained irrigation (not only proof of the arability but also of the engineering feasibility of irrigating the land) and irrigable \"at reasonable cost.\"\n\nThe United States presented evidence on all these factors to support its ultimate claim for 53,760 practicably irrigable acres (210,000 acre-feet/year), and Wyoming presented evidence in opposition. The special master recommended the following award of reserved water rights for future projects:\n\nNorth Crowheart 34,993 acres South Crowheart 4,238 acres Arapahoe 3,437 acres Riverton East 3,442 acres Big Horn Flats 2,410 acres ______ 48,520 acres\n\nThe Amended Judgment and Decree corrected the Riverton East figure by reducing it to 3,019 acres, which resulted in the total final award being 48,097 acres.\n\n1. Arability\n\nOver Wyoming's objection that the land classes did not consider economic factors and were not sufficiently specific, the master adopted this system:\n\n\"Class 1: Class 1 lands are of high quality for irrigation, and will yield high returns with minimum production and management costs.\n\n\"Class 2: Class 2 lands are good quality with only minor deficiencies.\n\n\"Class 3: Class 3 consists of fair quality lands having more serious deficiencies than Class 2 lands.\n\n\"Class 4: Class 4 lands are of marginal quality for irrigation and are used mainly for shallow-rooted crops or pasture.\n\n\"Class 5: Class 5 lands are those lands which have been placed into a deferred status pending further investigation. There were no lands included in a deferred status.\n\n\"Class 6: Class 6 lands do not meet the minimum requirements for arability under the land classification standards used.\"\n\nThe land classification system was first utilized to determine all arable acres. The arable acreage was then analyzed from an engineering standpoint. The resulting irrigable acres were then subjected to stringent economic analysis, including cropping pattern and crop yield analysis. The economic analysis requirement was satisfied. Wyoming proposed no alternative land classification system. We approve the system adopted by the master, finding it reasonable and fair to the parties.\n\nThe master determined that the arable land base was 76,027 acres. Wyoming claims on appeal that the arability investigation did not meet Bureau of Reclamation Standards for 60% of the land as to the depth to barrier, maximum slope, hydraulic conductivity, barrier definition and maximum drain spacing standards. The special master accepted the approach of the United States as meeting its burden of establishing the land base for the determination of arability. There was substantial evidence to support this determination, and looking, as we must, only to the evidence of the United States, we affirm the master's finding of 76,027 acres of arable land base.\n\n2. Engineering Feasibility\n\nThe State next attacks the design work of Dr. Woldzion Mesghinna, the United States' irrigation engineer, because he had never before designed a system for Wyoming lands and because none of the systems he had designed were yet operational. Despite these complaints, Wyoming did not object to his admission as an expert witness. The questions raised go only to the credibility of the witness, not his competence. Credibility is for the trier of fact. State ex rel. Worker's Compensation Division v. Colvin, Wyo., 681 P.2d 269 (1984); Crompton v. Bruce, Wyo., 669 P.2d 930 (1983); Matter of Altman's Estate, Wyo., 650 P.2d 277 (1982). The master praised Mesghinna's thorough work and found him not only credible, but \"detached from any preconceived estimates of what should be the result.\" The State objected that Dr. Mesghinna's irrigation design contains some non-arable Class 6 lands, perhaps as much as 487 acres. Dr. Mesghinna explained: \"In squaring off process, which you cannot escape in any work of this kind, we might have included a very small portion of Class 6 lands, and with the same token, we have omitted large lands which are classified as arable by HKM.\" Counsel for Wyoming did not contend before the special master that this invalidated the design work, but only that \"it's remarkably important, Your Honor, because it will come up with respect to the question of [crop] yields.\" Wyoming has presented us no cogent argument to support the notion that including irrigation for some fields containing some Class 6 lands invalidates the design work. The climatological data determines water requirements which govern the irrigation system design. Dr. Mesghinna did not use inaccurate climatological data. Dr. Mesghinna testified that he had never received any of the old, inaccurate solar radiation data from the Lander Airport. Instead of relying on measurements of solar radiation, Dr. Mesghinna used four equations to calculate evapo-transpiration, relying upon the ratio of actual to possible sunshine. The State had ample opportunity to directly challenge HKM, the United States' agricultural engineer, on the reliability of its work, but apparently chose not to do so. The special master correctly denied Wyoming's motion, made at the close of cross-examination, to strike Dr. Mesghinna's entire testimony for lack of foundation. The special master, after weighing the testimony, accepted Dr. Mesghinna's climate work and found that it satisfied \"any burden of the United States to prove the climate base for the engineering feasibility analysis. The State does not shift the burden back merely by asserting that greater efforts could have been made in the data collection.\" Credibility of the witness was for the trier of fact, and the master found the witness credible and his data reliable; we accept that finding.\n\nThe master did not abuse his discretion in accepting the engineering feasibility work which incorporated 35% project efficiencies rather than a 50% project efficiency. It is well established in Wyoming that it is appellant's burden to demonstrate an abuse of discretion. Canyon View Ranch v. Basin Electric Power Corp., Wyo., 628 P.2d 530 (1981). An abuse of discretion is an error of law under the circumstances; it occurs where the court could not reasonably conclude as it did. Martinez v. State, Wyo., 611 P.2d 831 (1980). A ruling which shocks the conscience of this court is held to be an abuse of discretion. Waldrop v. Weaver, Wyo., 702 P.2d 1291 (1985). See also Walker v. Karpan, Wyo., 726 P.2d 82, 90 (1986).\n\nThe master determined that practicably irrigable acreage should be based on present standards. Mr. Floyd Bishop, former State Engineer, gave the following testimony as a water resource engineer for the State: \"The overall efficiency, I think can reasonably be expected to be higher than [35%]. I think a close management and husbandry of the water resource will provide a 50% overall efficiency in projects of this kind.\" The special master rejected Mr. Bishop's testimony because his overall efficiency estimate did not have the components of application, distribution or conveyance efficiency, and properly found the United States' claim for unit and total diversion to be reasonable and supported by the evidence. He explained that Dr. Mesghinna's\n\n\"water duty `is quite low as compared to what is going out right now' in other areas around the Reservation.\"\n\nThe master, therefore, found:\n\n\"35. The United States claim for unit diversion and total diversion is reasonable and supported by convincing and the better evidence, particularly since Dr. Mesghinna's average water duty is more restrictive than the present historic use in Water Division 3.\"\n\nUpon the evidence, the master could reasonably accept the position of the United States and did not abuse his discretion in doing so.\n\nThe United States' evidence indicates that an adequate water supply is available to serve the future projects. Mr. Ronald Billstein, the United States' water resource planner, explained that any apparent shortages are manageable because available soil moisture or efficiency adjustments compensate for the shortage and thus there is no actual shortage for agriculture. The Wyoming model, on the other hand, which not only includes state-awarded water rights and reservoirs but includes in-stream flow as well as diversionary requirements, shows that two stream reaches would contain only 98% of the total United States claims. The master did not err because he did not award the total diversion request of the United States.\n\n3. Economic Feasibility\n\nThe five future projects were reduced by 10% to compensate for potential error in the arable land base and then subjected to economic analysis. After deleting 10% from the acres satisfying the engineering feasibility determination (i.e., before the economic analysis) the special master found the following acreage within the projects feasible to irrigate:\n\nNorth Crowheart 34,933 acres South Crowheart 4,238 acres Arapahoe 3,437 acres Riverton East 3,442 acres Big Horn Flats 2,410 acres ______ 48,520 acres\n\nAfter economic analysis, the special master awarded reserved water rights for the following practicably (i.e., economically) irrigable acreage:\n\nProject Acreage Diversion\n\nNorth Crowheart 34,993 133,324 af/yr South Crowheart 4,238 18,181 af/yr Arapahoe 3,437 15,088 af/yr Riverton East 3,442 15,837 af/yr Big Horn Flats 2,410 6,507 af/yr ______ _____________ Total 48,520 188,937 af/yr\n\nIt is readily apparent that the master found economically feasible, or practicably irrigable, all the acres he found to be irrigable from an engineering standpoint. Wyoming has cited no evidence in the record indicating that the economic feasibility testimony does not apply to the acres the master found to be practicably irrigable.\n\nThe master properly accepted a 4% discount rate in determining economic feasibility. Mr. David Dornbusch, economist for the United States, testified that he used principles recommended by the Water Resources Council, that the correct rate was in the range of 2 to 4%, and that he used 4% in his calculations. He agreed that the better practice is to stay with the original rate even if the discount rate goes up during the project and that the WRC rate on the date he testified was up to 7 1/8%. Wyoming would have us decide that there is no lawful basis for using a 4% discount rate instead of the 7 1/8% rate required on federal water projects in 1979. 42 U.S.C. § 1962d-17(a); 44 Fed.Reg. No. 210, October 29, 1979, 18 C.F.R. § 70439. Yet the other economists who testified, Dr. Ronald Cummings for the Tribes, Dr. Stephen Goldfeld for the United States in rebuttal and Dr. David Brookshire for the State, did not use 7 1/8%. The State's own witness did not rely on the regulatory rate of 7 1/8%. Dr. Brookshire testified that a range of rates is more appropriate and said that a range of 4-11% was appropriate here. Dr. Cummings felt 2-4% would be proper. Dr. Goldfeld placed 2 1/2% as the correct rate within his 1-4% range. After weighing the evidence, the master concluded \"that the preponderance of the evidence clearly supports the conclusions of Mr. Dornbusch.\" The master could not accept the State's evidence because Brookshire improperly excluded the household rate and relied on the average, rather than the marginal, rate. The master did not err in accepting Dornbusch's 4% discount rate.\n\nThe United States' crop yield data was not without a competent foundation. The master criticized the approach of the State and found:\n\n\"The future projects incorporate state of the art technology and improved approaches to irrigation farming not currently used by farmers in the area. Better technology and management makes higher yields reasonably foreseeable, and given evidence of current similar yields already obtained by farmers in the area, I find the preponderance of the evidence clearly supports the projections of the United States.\"\n\nOn cross-examination, Mr. James Jacobs, agricultural economist for the State, admitted that at least one farmer gets malt barley yields ranging from 90 to 115 bushels per acre. Mr. Douglas Agee for the State reported 100 to 115 bushels in the central area near Riverton. This alone would provide adequate support for Dornbusch's 100 bushel projection. In addition, Dornbusch interviewed 20 to 25 farmers and obtained recent averages from them. He departed from the average 83.3 bushel figure for malt barley in the Agee Report (prepared for the State) because\n\n\"in interviewing the farmers I thought pretty uniformly the progressive farmers who were conscientious about irrigating, fertilizing and using progressive techniques had for the most part entirely, all of them, had yields that were higher than Agee's. The most glaring difference was in malt barley, and for that reason I chose to depart from Agee's malt barley yield, but stick with his for others.\"\n\nThe crop yield figures were not without foundation.\n\nThat Mr. Dornbusch made no reduction in crop yield projections to account for the time necessary to bring the future project areas to full production does not invalidate the crop yield figures. The master correctly observed:\n\n\"[Dornbusch] addressed the issue from the production cost side of the equation, increasing his per acre costs to account for the possibility of lower yields in the initial years of operation. I find this cost method reasonable and an acceptable solution to the matter and, therefore, make no alteration to the crop yield projections of the United States.\"\n\nThe master did not err in accepting Dornbusch's methodology and cost elements derived for on-farm production costs and management and labor costs. Dornbusch testified that his analysis of fixed costs was based upon the most efficient use of the equipment, rather than unit size, because under cooperative Indian management the equipment could be used on larger than normal farms. Doug Agee, for the State, challenged this to some extent: \"They can become more efficient up to a limited size, and then that curve starts to back up.\" The master considered the conflicting testimony and determined that\n\n\"the approach taken by Dornbusch [is the] more realistic, and his assumptions of tribal cooperation on the projects is not only reasonable, but well supported by the preponderance of the evidence.\"\n\nSufficient evidence supports the use of Dornbusch's figures.\n\nThe United States' management and labor costs used only 20% of actual costs and assumed that unemployed Indians would supply labor. The disagreement between Dornbusch, for the United States, and Jacobs, for the State, was over what proportion of labor costs have a zero opportunity cost owing to high unemployment on the reservation. Dornbusch's 80% was derived from information from the BIA, interviews, and the historic experience on the reservation. Jacobs, who would cost farm labor at 75-100%, did less thorough work, relying on his own \"judgment call.\" The United States' economist provided adequate foundation for his figures.\n\nThe master's determination that the Wind River Indian Reservation embraces practicably irrigable acreage is proper. We therefore affirm the district court's award of a reserved water right for future projects covering practicably irrigable acreage.\n\n4. 10% Reduction\n\nThe master erred in reducing the award of a reserved water right by 10% on grounds that\n\n\"[e]rror is probably inevitable whenever a group of people are required to coordinate and analyze such a complex matter [land classification] and must rely on a field of expertise which, by its very nature, lacks the certainty of complete objectivity. But that concern can be addressed by an appropriate percentage reduction in the totals to reflect the unavoidable errors that arise in such a study.\"\n\nThe master specifically found that the United States met its burden of proof in establishing the arable land base. Wyoming, he said, did not present a case sufficient to refute the evidence of the United States, but did raise \"some concerns sufficient to support a percentage reduction.\" The master settled on a 10-15% reduction as appropriate and credited the United States with the 5% Dr. Mesghinna deducted for farmsteads and roads.\n\nEven assuming there is a 10-15% margin of error in the United States' arable land base, it is clear that a margin of error works both ways. It is as likely the United States claimed 10-15% too few acres as arable as it is that it claimed 10-15% too many. Even counsel for the State referred to \"the 10 percent plus or minus tolerance for accuracy.\" (Emphasis added.) The master found the United States had proved the arable land base by a preponderance of the evidence. Wyoming may have planted uncertainties in his mind, but by his own admission, they did not produce a preponderance of evidence to show that any particular acreage was not arable.\n\nNo independent evidence supports the reduction. The figures cited to us as evidence in support of the reduction are independent of any margin of error. We have already disposed of the claims that the United States' climatological data was without foundation, that the United States' efficiencies were reduced at trial, that a Wyoming witness said 50% efficiencies were possible, that another witness said only about 30,000 acres were irrigable, holding them insufficient to require a reduction in PIA. We addressed the inclusion of Class 6 lands and the squaring off process and resolved that claim adversely to Wyoming. Although Dr. Mesghinna admitted on cross-examination that his arable land might contain houses, cemeteries, dumps, gravel pits and the like, he also explained he had reduced the claimed arable land base by 5% to account for these. Thus, Wyoming has directed us to no independent evidence supporting the 10% reduction.\n\nThe master found (1) that the United States met its burden of proof on the arable land base, (2) that it proved engineering feasibility not only by a preponderance of the evidence, but as the most reasonable conclusion, (3) that it proved the diversion requirements \"by convincing and the better evidence,\" (4) that its cropping patterns were supported by the evidence and reasonable, (5) that its production costs were supported by the preponderance of the evidence, (6) that its incremental phase-in of the Indian management and normalization factor were supported by the preponderance of the evidence, (7) that it proved its reasonable discount rate by a preponderance of the evidence, and thus (8) that:\n\n\"59. The claimants for a reserved water right have established their asserted case by a `preponderance of the evidence,' which is the standard of proof clearly appropriate in this matter.\"\n\nWe have affirmed each of these findings. There should not have been a 10% reduction in the reserved water right, and we reverse that part of the decision.\n\n5. Stagner Ridge and Big Horn Flats Extension\n\nIn addition to the future project lands the United States claimed as practicably irrigable acreage, the Tribes claimed a reserved water right for two additional projects, Stagner Ridge and Big Horn Flats Extension. It does not appear that these areas were denied a reserved water right because they were nonarable or even not feasibly irrigable from an engineering standpoint, so we will not address those questions. Rather the reserved water right was properly denied because the projects are not economically feasible.\n\nMr. Jack Keller, the Tribes' agricultural irrigation engineer, reduced the costs for these projects developed by Stetson Engineers for the United States by removing the roof from the pumping plant, by cutting materials costs and by reducing the sprinkler pressures. Keller did not analyze the canal systems and related structures. Lyman Willardson, irrigation and drainage engineer and field investigator for the Tribes, spent an inadequate amount of time in the field. In addition, Stetson Engineers, on whose expertise the master had relied in awarding acreage for the five future projects, chose not to include these two projects in the United States' claim on the basis of costs. Willardson testified that only by saving on the other five projects by reducing drainage, a practice dangerous to the productivity of the land, would the two extension projects become economical. The State successfully argued that the bank of 9,000 hp pumps would increase the costs unacceptably for projects of this size. The master correctly concluded that the balance tipped away from the Tribes.\n\nThe comparable land approach to PIA rests on the fact that the lands in question are similar to other lands irrigated in the West, and so they, too, must be PIA. The master rejected this approach because Keller's cursory investigation of only one of the proposed project areas did not prove comparability. The comparable costs approach rests on the fact that if the costs are comparable to other projects, the acres are practicably irrigable. The per acre costs presented by the Tribes were well within the State's range for the five future projects. Nonetheless, the figures for the two extension projects were based on the cost-cutting the master rightfully condemned.\n\nNor does the Stagner Ridge Project meet the stipulated PIA definition. The master found the Tribes' witnesses not credible. Mr. Ronald Bleisner, the Tribes' irrigation engineer, admitted he sometimes followed instructions, not his conscience. Mr. Willardson, the Tribes' irrigation and drainage expert, was not credible because of his hasty investigation. Mr. Cummings' cost figures were incomplete; they did not include off-reservation costs. Stagner Ridge meets the PIA definition, with its cost/benefit ratio of 1.33, only if the cost figures are accepted. The master found them not credible and did not err in excluding Stagner Ridge and Big Horn Flats.\n\nC. Historic Lands\n\nThe district court awarded a reserved water right for 54,216 practicably irrigable acres currently and/or historically irrigated on the reservation, defining five types of historic lands:\n\n(a) Adjudicated trust lands are lands with an uncancelled state permit or certificate of appropriation;\n\n(b) Unadjudicated but currently irrigated trust lands are those being irrigated at the time of trial, but not carrying a state permit or certificate;\n\n(c) Type VII trust lands are those previously irrigated but currently idle or retired;\n\n(d) Type VIII trust lands are undeveloped arable lands, not currently irrigated but irrigable from existing canals (i.e., within or near project areas); and\n\n(e) Indian fee lands are those owned in fee by individual Indians.\n\n1. Presumptions\n\nThe master did not adopt improper presumptions relieving the United States and the Tribes from their burden of proving that the claimed historic acres met the stipulated definition of practicably irrigable acreage.\n\n\"I believe my presumption of irrigability regarding these [historically irrigated] lands was fair and that all parties fairly understood it. Like any other presumption, it asserts that the factual picture is sufficiently strong as to require an opponent's answer.\"\n\nThe master held during the proceedings that an uncancelled state permit was prima facie evidence of irrigability. The district court accepted this holding.\n\nThere is no doubt that this presumption rests on reason. Quinlan v. Jones, 27 Wyo. 410, 198 P. 352, 354 (1921). We have no quarrel with the proposition that presumptions are not necessary where the facts are available or known, Porter v. Wilson, Wyo., 357 P.2d 309, 316 (1960); Castor v. Rice, 71 Wyo. 99, 254 P.2d 189, 191 (1953); Kammerzell v. Anderson, 69 Wyo. 252, 240 P.2d 893, 895 (1952), but note that Wyoming also argues that the award for historic lands is improper because the facts were not known.\n\nIn a pretrial hearing the State of Wyoming agreed to the presumption when it argued, on behalf of individual private appropriators, that certificates of appropriation were prima facie evidence of a state water right and that the burden should be on the contestant to disprove a right to water. The State also argued that because it constantly monitors the water to be sure water is being used in accordance with the terms of the certificates, one cannot assume water is being wasted. The superintendent for Water Division No. 3 testified that he knew of no water rights in his division subject to abandonment and that he likely would know if there were. The State thus convinced the master that a certificate or permit is prima facie evidence that water is being put to beneficial use. The special master simply applied this reasoning to Indian lands as well, holding that the burden was on the State to show non-irrigability of Indian lands carrying a permit or certificate. Thereafter, Wyoming did attempt to prove that the claimed adjudicated acreage was not practicably irrigable, and in fact met its burden, convincing the master to delete some 5,017 acres of adjudicated lands. There is no merit to the contention that Wyoming did not fully understand the master's ruling that an uncancelled permit or certificate of appropriation was prima facie evidence of PIA.\n\nThe \"presumption\" concerning other historic lands was not a presumption at all. Rather, the master took evidence on arability, engineering feasibility and economic feasibility and found the United States' evidence to be \"competent, generally convincing, and in most cases adequate in supporting Federal claims.\" As to the Tribes' claims for Indian fee land, the master found the evidence showed the land awarded a reserved water right to be PIA. The evidence the master accepted was different from evidence used to prove PIA for the future projects but it was sufficient to meet the stipulated definition of PIA.\n\n2. Adjudicated Lands\n\nThe United States was awarded a reserved water right for 12,395 of the claimed 17,411 acres of land within the reservation covered by an uncancelled state permit or certificate of adjudication. Sufficient evidence supports the finding that this acreage is economically feasible to irrigate. Mr. George Christopolous, then the State Engineer, testified for the State that a certificate does not represent a determination that the land is capable of sustained irrigation at reasonable cost. The United States performed no economic analysis for the adjudicated acres. Yet this court has defined beneficial use as the limit of water which can be economically used. Nicholas v. Hufford, 21 Wyo. 477, 133 P. 1084, 1087-1088 (1913). We have also indicated that a certificate is prima facie evidence of a water right. Basin Electric Power Coop. v. State Board of Control, Wyo., 578 P.2d 557 (1978); Quinn v. John Whitaker Ranch Company, 54 Wyo. 367, 92 P.2d 568, 571-572 (1939); Laramie Irrigation and Power Company v. Grant, 44 Wyo. 392, 13 P.2d 235 (1932); Campbell v. Wyoming Development Company, supra 100 P.2d 124; Hamp v. State, 19 Wyo. 377, 118 P. 653, 663 (1911). We have said that a certificate is evidence of current, as opposed to potential future, beneficial use. Green River Development Company v. FMC Corp., Wyo., 660 P.2d 339, 346 (1983). David Dornbusch, economist for the United States, testified that the fact that the land is being irrigated means it is economically feasible to do so. We acknowledge that the beneficial use standard for abandonment of a water right under state law is not identical to the definition of PIA, but emphasize that the fact that a state water right has not been abandoned for failure to beneficially use the water is a strong indication that the land is being productively irrigated. Thus, the master and the court did not err in awarding a reserved water right for adjudicated lands without formal proof of economic feasibility. Furthermore, once the master correctly ruled that a permit or certificate is prima facie evidence of PIA, it was incumbent on the State to show specifically which areas were not PIA. Wyoming cites us to no evidence showing that any of the adjudicated lands for which an award was made were not economically feasible to irrigate. The court did not err in awarding a reserved water right for lands carrying a valid state water right.\n\nThe court nonetheless reduced the United States' claimed reserved water right for adjudicated lands, deleting a total of 5,017.1 acres as follows:\n\nType IX lands (\"out\" land types) 845.9 acres Class 6 lands 2,971.7 acres Class 6 lands 360.5 acres Type VII (retired) lands 829.0 acres Type VIII lands with no economic analysis 10.0 acres\n\nThe bases of the reduction were that Wyoming showed 5,007.1 acres to be nonarable by the United States' own standards and that the United States had not proved 10 acres of undeveloped land to be economically feasible to irrigate.\n\nThe master did not find the 2,971.7 acres of Class 6 lands to be nonarable only by finding that they could not be economically irrigated. We have already said that any economic analysis is a third step to determine whether arable lands can be economically irrigated; the fact that land can be economically irrigated does not make it arable. The special master adopted the United States' definition of Class 6 lands as \"lands which do not meet the minimum standards or requirements for arability under the Land Classification Standards used by HKM, and are nonarable.\" Mr. Sommers, for the State, agreed that Class 6 lands are by definition not arable. Language indicating that the master gave Wyoming the benefit of the doubt only indicates he found the State's witnesses credible in identifying 3,817 acres of Type IX and Class 6 lands. The master did not err in excluding these non-arable adjudicated lands.\n\nThe master deleted another 360.5 acres of Class 6 adjudicated trust lands. The 244.1 acres of Class 6 land are currently irrigated and thus economically feasible to irrigate. But we have said that the fact the land is economically feasible to irrigate does not make it arable. Thus there is no merit to the contention that the 244.1 acres were improperly excluded. As to the 116.5 acres, the master found the State's evidence that the acres were Type VII, currently idle lands, which were only possibly arable more credible than the HKM soil logs indicating the land is Class 3 or Class 4. The master could not add the 116.5 acres to the Type VII award because the necessary economic analysis had not been performed; therefore, he eliminated them. The court did not err in deleting these acres.\n\nThe master excluded 829.0 acres of Type VII land because he thought the United States did not show the land to be PIA with economic analysis. The record reflects that the United States did prove its case regarding these Type VII, not adjudicated, lands with economic analysis. But it is well established that this court will uphold the action of the district court for any proper reason appearing in the record. Anderson v. Bauer, supra 681 P.2d 1316; Mentock v. Mentock, supra 638 P.2d 156. And Mr. Sommers testified for the State that some 837.7 acres of Type VII land were not arable. Thus, the deletion of 829 acres was proper because the land was not arable.\n\nThe master and the court did not err in finding that the State rebutted the presumption of PIA for 5,017.1 acres of the 17,411 acres of adjudicated trust lands claimed by the United States.\n\n3. Unadjudicated In-Use Lands\n\nThe United States received a reserved water right for 28,129 of the claimed 34,427 acres of unadjudicated, but currently irrigated, trust lands. The master found credible the testimony of Mr. A.T. Kersich of HKM Associates, agricultural engineer for the United States, that the land was arable. He was satisfied that physical and cultural obstacles to irrigation were adequately accounted for. He also accepted the testimony of Mr. Dornbusch, the United States' economist, that current successful irrigation indicates economic feasibility. Thus, there is sufficient evidence that the acres awarded a reserved water right are arable and economically feasible to irrigate.\n\nNonetheless, the master deleted a total of 6,298 acres. He refused to award a reserved water right for 3,575.9 acres of Class 6 land. The United States claims that it is unfair to exclude Class 6 lands when such lands are in fact being irrigated in the Midvale and LeClair projects, and that the master \"placed an insurmountable burden on the United States — to prove that what is done in fact is not impossible to do in theory,\" are not well taken. It was the United States which defined Class 6 land as not arable, and it was the United States which classified these 3,575.3 acres as Class 6 lands. Thus the United States has essentially admitted that these acres are not practicably irrigable and not entitled to a reserved water right. The court did not err in excluding these acres.\n\nThe master also deleted 879 acres for which the United States' soil logs contain notations \"which discredit this irrigability.\" Mr. Sommers' testimony for the State pointed out that these notes question the arability of these acres. The master found this testimony credible and refused to strike it. The comments were: \"doesn't appear to have been farmed\"; \"seeped * * * too expensive to drain\"; \"subject to flooding\"; \"many cobbles and boulders on surface\"; \"poor land; water table is high\"; \"subirrigated\"; \"alkali on surface * * * subject to floods\"; and \"probably not used for irrigation.\" It is clear that this testimony and evidence support the deletion.\n\nThe court deleted 246 acres of subirrigated land. The master's deletion of 1,778 acres of subirrigated land was reduced by stipulation of the parties to a deletion of 246 acres in the Johnson Decree. The United States' own expert witness, Mr. Billstein, admitted that subirrigated land is nonarable. The court did not err in excluding these acres.\n\nThe master also deducted another 55.6 acres of Type VII, retired, lands. The land is not currently in use and because no economic analysis was done on it, it could not be included in the Type VII award. Mr. Sommers, testifying for the State that the acreage was idle, may have relied upon the wrong HKM log. Wyo. Exh. WRIR SS-1001 does identify tract 35-1 (55.6 acres) as Type IV, Class 4 land, but it also notes that the tract is \"idle hayland.\" The United States does not indicate where the proper soil log is to be found in the record nor that Mr. Sommers was questioned about his use of an improper soil log at trial. Without some indication that this claim has merit, we will not consider it further.\n\nThe Tribes' argument that once actual irrigation is shown, the land should be considered to be PIA unless the use of water is demonstrated to be wasteful is not well taken. The State's showing that some of the claimed lands are not currently irrigated takes those acres out of the proposed rule. The finding that the remaining deleted acres are not arable means that they cannot meet the definition of PIA.\n\nThe master did not err in deleting 6,298 acres of the claimed 34,427 PIA, unadjudicated in-use trust lands.\n\n4. Type VII Lands\n\nThe United States was awarded a reserved water right for 6,271 of the claimed 7,946 acres of Type VII, previously irrigated but currently idle, or retired, land. The master excluded 1,546 acres of Class 4 and Class 6 lands as \"simply too marginal to be awarded a finding of practicable irrigable acreage.\" We have already said that Class 6 lands are not arable and must be excluded. Class 4 lands are \"[l]ands of marginal quality for irrigation, suitable mainly for shallow rooted crops or pasture.\" The excluded acres were not classified as Class 6 for both gravity and sprinkler irrigation. Nonetheless, Mr. David Dornbusch, economist for the United States, eliminated even some Class 4 gravity/Class 4 sprinkler acres as economically unfeasible. Mr. Sommers testified for the State that additional acreage should be deleted because the United States relaxed its arability standards for these historic lands. Mr. Ross Waples, a United States land classifier and soil scientist, testified that the lands were properly designated Class 4 sprinkler only when \"the conditions that would be required to make it arable are met, which are drainage and the [soil] amendments.\" The land conditions not being met, the master and the court were justified in deleting this Class 4 acreage as just too marginal.\n\nThe master also deleted 129.5 acres because they did not meet the United States' minimum size standards. Mr. Waples explained that the size of the parcel \"is irrelevant if it can be operated as part of a larger field\" and admitted that the size standards were not strictly followed. The difficulty with this practice is that, even when the small parcels were joined with other parcels for management purposes, they either did not meet the 40 acre parcel requirement or were separated by a fenced paved county road. The master did not err in eliminating these parcels.\n\n5. Indian Fee Land\n\nThe Tribes claimed a reserved water right for a total of 10,374 acres of Indian fee lands — land on the reservation owned in fee by individual Indians — and proved that 6,155 acres were entitled to reserved water rights. The Tribes admit that the omitted 3,943 acres are not currently irrigated, and the testimony that Indian fee land was comparable to other reservation lands dealt only with irrigated lands. Thus there is no evidence to support inclusion of these non-irrigated lands even under the Tribes' comparable lands test for PIA.\n\nThe master did not accept these acres under the stipulated PIA definition because no economic analysis was performed. Keith Higginson, the Tribes' water resources engineer, testified that he believed the economic analysis was not necessary. The master implicitly agreed with him for the currently irrigated acres, but required the economic analysis for non-irrigated acres. The master did not rule that a formal benefit/cost analysis was necessary, only that some economic analysis was required. Yet Mr. Higginson merely assumed economic feasibility because \"it was simply, in most cases, a matter of extending the ditch or a lateral in order to bring the water to the land.\" He did not opine as to the cost of such activities, nor show the relationship of the tracts to existing diversion works.\n\nThe master also disallowed 276 acres of Class 6 and subirrigated Indian fee land. For the reasons outlined supra, he did not err.\n\n6. Efficiency Increase\n\nIn an irrigation system, the more efficient the use of water, the less water is needed. A system operating at 25% efficiency uses twice as much water as a system operating at 50%. In a 100% efficient system, the plants would use every drop of diverted water. The current average efficiencies for both project and non-project lands is 35%; a 50% overall efficiency is probably achievable. The district court quantified the reserved water right for historic lands based on a 40% efficiency.\n\nSufficient evidence supports the increase. Mr. Bishop for the State testified that a 50% overall efficiency was achievable. Mr. Higginson for the Tribes testified 40% was possible with the use of hand-moved sprinklers. Mr. Thomas Stetson, water duty engineer for the United States, said better efficiency could be achieved without a large cost investment but with better management. Thus there is evidence to support the master's finding that a 5% increase in efficiency is acceptable.\n\nThe award does not interfere with the Tribes' right to administer their own affairs; it merely quantifies the reserved right for historic lands by awarding only the amount of water necessary to irrigate all the PIA. The master did not discriminate against the Indians; he had no power to order an efficiency increase for non-Indian users in Water Division No. 3. The Tribes will not lose 12 1/2% of their reserved water right if they do not expend whatever funds or efforts are necessary to achieve a 40% efficiency; the amount of water awarded them was reduced under sound principles. It matters not that expensive modifications may be necessary in order that the Tribes can fully utilize the water awarded on all the historic PIA; expensive construction is necessary to irrigate the future PIA for which the Tribes have accepted water.\n\nThe court did not err in reducing the reserved water right for historic lands to the amount necessary to irrigate all the PIA based on an overall efficiency of 40%.\n\nD. Sensitivity Doctrine\n\nThe sensitivity doctrine takes its name from this passage:\n\n\"I agree with the court that the implied-reservation doctrine should be applied with sensitivity to its impact upon those who have obtained water rights under state law and to Congress' general policy of deference to state water law.\" United States v. New Mexico, supra 438 U.S. at 718, 98 S.Ct. at 3023 (Powell, J., dissenting in part).\n\nThe majority in that case said:\n\n\"The quantification of reserved water rights for the national forests is of critical importance to the West, where, as noted earlier, water is scarce and where more than 50% of the available water either originates in or flows through national forests. When, as in the case of the Rio Mimbres, a river is fully appropriated, federal reserved water rights will frequently require a gallon-for-gallon reduction in the amount of water available for water-needy state and private appropriators. This reality has not escaped the attention of Congress and must be weighed in determining what, if any, water Congress reserved for use in the national forests.\" Id., 438 U.S. at 705, 98 S.Ct. at 3016-3017.\n\nThe Court indicated that water is reserved only to fulfill the purposes of the reservation, id., 438 U.S. at 700, 98 S.Ct. at 3014, and that a careful examination of the purposes and the amount of water claimed is essential. Id., 438 U.S. at 700-702, 98 S.Ct. at 3014-3015. Yet in Arizona v. California, supra 460 U.S. at 625, 103 S.Ct. at 1395, the Court refused to reconsider the PIA standard in light of the holdings in New Mexico, supra, and in Washington v. Washington State Commercial Passenger Fishing Vessel Association, supra 443 U.S. 658, 99 S.Ct. 3055 (dealing with a right to take fish, not Indian reserved water rights). There is strong indication that New Mexico does not apply to Indian reserved water rights. F. Cohen, Handbook of Federal Indian Law 581-585 (1982 ed.). The ninth circuit has nonetheless gleaned useful guidelines from it for use in Indian reserved water cases. United States v. Adair, supra 723 F.2d at 1408. It is thus not clear whether the sensitivity doctrine, requiring the quantification of reserved water rights with sensitivity to the impact on state and private appropriators, applies here.\n\nAssuming, arguendo, that it does apply, we cannot accept the City of Riverton's argument that it was ignored by the district court. Neither the provision in the Amended Judgment and Decree eliminating the upstream storage requirement from the future projects award nor the award of the reserved water rights in acre-feet per year rather than cubic feet per second violate the sensitivity doctrine.\n\nDeletion of the upstream storage requirement which was intended to protect appropriators from sudden depletion by the diversion of water for the five future projects does not manifest insensitivity to other water users. The doctrine of reserved water rights entitles the Indians to a certain quantity of water. The requirement that they must first construct storage facilities to supply their entitlement flies in the face of the object of the reserved water right — a prior entitlement to the waters. There is no indication that elimination of the storage requirement before diversion of future project waters will require a gallon for gallon reduction in the water available for other users.\n\nThe award of a reserved water right in acre-feet per year is an accepted means of award. Arizona v. California, 376 U.S. 340, 342-345, 84 S.Ct. 755, 756-758, 11 L.Ed.2d 757 (1964); Mimbres Valley Irrigation Company v. Salopek, 90 N.M. 410, 564 P.2d 615 (1977), aff'd sub nom. United States v. New Mexico, supra 438 U.S. 696, 98 S.Ct. 3012, 57 L.Ed.2d 1052 (1978). The City has cited us no authority for the proposition that the mere form of an award of reserved water can violate the sensitivity doctrine.\n\nNor does this court's elimination of the 10% diversion reduction for future projects violate the sensitivity doctrine. The sensitivity doctrine does not preclude the award of a fair reserved water right.\n\nIn the case at bar, the purpose of the reservation for which water is reserved is narrow — agricultural only. The right was quantified based on PIA — the master and the court rejecting some 50,000 acres originally claimed by the United States and the Tribes. The Indians' claim was further reduced by requiring an efficiency increase in historic lands. All of this evidences a sufficient sensitivity to the water needs of other water users.\n\nWith the exceptions noted above, we affirm the quantification of the reserved water right.\n\nVII PRIORITY DATES\n\nA. Diminished Reservation\n\nWe recognized earlier in this opinion that there was indeed a federal water right impliedly reserved for the Indians when the Wind River Indian Reservation was created by the 1868 Treaty. Therefore, we affirm the rulings below that the tribal diminished-reservation lands have a water right with a priority date of 1868.\n\nB. Indian Fee Lands\n\nThe special master held that land within the reservation held in fee by individual Indians which never left Indian ownership held a priority date of 1868. In United States v. Powers, supra 305 U.S. at 533, 59 S.Ct. 344, the Court said it found nothing to show that Congress intended allottees be denied participation in the use of reserved water rights. See also Colville Confederated Tribes v. Walton, supra 647 F.2d 42; United States ex rel. Ray v. Hibner, supra 27 F.2d at 912. We affirm.\n\nC. Allottees' Grantees\n\nFor many years the courts have struggled to define the water rights of those who succeed to the lands of Indians. United States ex rel. Ray v. Hibner, supra 27 F.2d at 912. In Skeem v. United States, supra 273 F. 93, the court had held that Indian allottees were entitled to a reserved water right with a treaty priority date. The recognized rights of the successors were somewhat different from the rights of the allottee. The non-Indian successor\n\n\"would, as grantee of the Indian allotments, be entitled to a water right for the actual acreage that was under irrigation at the time title passed from the Indians, and such increased acreage as he might with reasonable diligence place under irrigation, which would give him, under the doctrine of relation, the same priority as owned by the Indians.\" United States ex rel. Ray v. Hibner, supra 27 F.2d at 912.\n\nUnited States v. Parkins, supra 18 F.2d 642, does not address any claim of right to divert water by virtue of succession to a reserved water right. In United States v. Powers, supra 305 U.S. 527, 59 S.Ct. 344, the Court refused to consider the successors' claim to a reserved water right, id., 305 U.S. at 533, 59 S.Ct. at 346-347, but did note that \"[t]he respondents' claim to the extent stated is well founded.\" Id. 305 U.S. at 532, 59 S.Ct. at 346. In Colville Confederated Tribes v. Walton, supra 647 F.2d at 50, the court reiterated that Indian allottees have a reserved water right and relied upon United States v. Ahtanum Irrigation District, 236 F.2d 321, 342 (9th Cir. 1956), for the proposition that \"non-Indian purchasers of allotted lands are entitled to `participate ratably' with Indian allottees in the use of reserved water.\" The court defined the non-Indian successor's interest in three ways: The successor cannot acquire a reserved water right for more PIA than the Indian owned; the successor's water right carries a treaty priority date; the successor's right is to the quantity of water being put to use by the Indian at the time title passes and to the water he puts to use with reasonable diligence thereafter. Colville Confederated Tribes v. Walton, supra 647 F.2d at 51. See also id., appeal after remand, 752 F.2d 397, 401-402 (9th Cir. 1985). The court also held that the state permits Walton held were \"of no force and effect,\" because the State had no authority over water on the reservation. In a footnote to the opinion, the court begged the United States Supreme Court to review the case so that \"guidance and stability\" might be given the issue of allottees' successors rights, \"an area of great unrest and uncertainty in Western water and land law.\" Colville Confederated Tribes v. Walton, supra, 647 F.2d at 54 n. 18. Yet the Court has twice denied certiorari. 454 U.S. 1092, 102 S.Ct. 657, 70 L.Ed.2d 630 (1981); 475 U.S. 1010, 106 S.Ct. 1183, 89 L.Ed.2d 300 (1986). In United States v. Adair, supra 723 F.2d 1394, the court reiterated that a non-Indian purchaser may succeed to the full quantity of water available to the allottee, id. at 1417, and held that the United States, as a non-Indian successor, also succeeded to the same appurtenant water rights. Id. at 1419.\n\nIn United States v. McIntire, 101 F.2d 650 (9th Cir. 1939), the court held that the state water rights procured by the Indian predecessor conferred no valid water right. Likewise, Colville Confederated Tribes v. Walton, supra 647 F.2d at 51, held that the state permits issued for lands carrying a reserved water right were \"of no force and effect.\" We hold that the mere fact that state permits have been issued does not deprive these allottees' successors of a reserved water right with a treaty date priority.\n\nMerrill v. Bishop, supra 287 P.2d 620, was a suit by allottees' successors to enjoin the state engineer from interfering with their headgates. Id. at 620. The actual holding in the case was that the injunction must be denied because the successors had not proved the facts necessary to allow the courts to tailor an injunction. Id. at 626. It is thus apparent that the master relied only on dicta in Merrill v. Bishop. The holding of that case is narrow and does not prevent relitigating what was not necessary to the decision. Rialto Theatre, Inc. v. Commonwealth Theatres, Inc., Wyo., 714 P.2d 328 (1986); CLS v. CLJ, Wyo., 693 P.2d 774 (1985). We have already decided that the admission of Wyoming to the Union did not abrogate reserved water rights for the reservation. To the extent that Merrill v. Bishop indicates otherwise, it is overruled. Merrill v. Bishop is not res judicata of Webber, Jones and Graboski's claim to a treaty priority date. We have also held that state permits issued for water which has been reserved are invalid. Thus, the administrative proceedings are not res judicata.\n\nOn remand, appellants must be awarded a reserved water right with an 1868 priority date for the PIA they can show were irrigated by their Indian predecessors or put under irrigation within a reasonable time thereafter.\n\nD. Reacquired Lands\n\nWe have already held that a non-Indian purchaser from an Indian allottee obtains a reserved water right with a treaty priority date, and that his non-Indian successor would likewise succeed to the treaty priority date. There is no reason then to deny the same priority to an Indian or tribal purchaser. Because all the reacquired lands on the ceded portion of the reservation are reservation lands, the same as lands on the diminished portion, the same reserved water rights apply. Thus, reacquired lands on both portions of the reservation are entitled to an 1868 priority date.\n\nVIII MONITORING OF THE DECREE BY THE STATE ENGINEER\n\nThe issue of whether the state engineer may monitor the decree is a controversy conferring jurisdiction upon this court. A letter from Wyoming to Judge Johnson which referred to \"[t]he federal government's residual dissatisfaction with Judge Joffe's ruling that the State Engineer shall have primary regulatory responsibility\" indicates previous disputes as to the propriety of the ruling. Section 4 of the United States' response confirms the contested nature of the issue. Sufficient adversary character exists to permit a ruling on this question. Brimmer v. Thomson, Wyo., 521 P.2d 574, 577 (1974).\n\nThe decree does not violate state law. The provision in the Amended Judgment and Decree does not purport to give full ownership of the reserved water to the State. Thus the argument that the decree divests the Tribes of their water in violation of Article 1, § 32 (eminent domain) of the Wyoming Constitution is inapposite because monitoring by the state engineer is not a taking of property. Article 8, § 1 of the Wyoming Constitution provides that the water is the property of the state and Article 8, § 5 provides that the state engineer has general supervision of the waters of the state. Because Congress, in admitting Wyoming to the Union, 26 Stat. 222, ch. 664, ratified the Wyoming Constitution, it clearly contemplated that whatever superior rights it might temporarily or permanently hold in the waters of this state, the underlying ownership and control would remain with the State. Thus the decree does not violate Article 21, § 1 (rights to continue after statehood) nor does the decree run afoul of Article 21, § 26, which disclaims all right and title to lands owned by Indians until title is extinguished by the United States and provides that Indian lands remain under the absolute control and jurisdiction of Congress, emphasizing that Indian rights remain only so long as the reservation exists. Our Declaratory Judgments Act, permitting the court to enter all necessary orders, § 1-37-106, W.S. 1977, is to be liberally construed to give effect to its remedial purposes and relief from uncertainty. Section 1-37-114, W.S. 1977; Brimmer v. Thomson, supra 521 P.2d at 577. Neither the United States nor the Tribes have advanced other authority for the proposition that the provision violates state law.\n\nFederal law has not preempted state oversight of reserved water rights. In Arizona v. San Carlos Apache Tribe of Arizona, supra 463 U.S. 545, 103 S.Ct. 3201, the Court merely reiterated that Indian water rights in state adjudications must be judged by federal law. In Cappaert v. United States, supra 426 U.S. at 145, 96 S.Ct. at 2073, the Court said: \"Federal water rights are not dependent upon state law or state procedures and they need not be adjudicated only in state courts.\" The procedures referred to are state procedures for perfecting state water rights, not monitoring of already decreed federal water rights. See Colville Confederate Tribes v. Walton, supra 752 F.2d at 400 (federal law governs only scope and volume of reserved right). United States v. Rio Grande Dam and Irrigation Company, 174 U.S. 690, 19 S.Ct. 770, 43 L.Ed. 1136 (1899) dealt only with interference with a navigable stream, and United States v. McIntire, supra 101 F.2d at 654, held a state appropriation of reserved water to be invalid. In Colville Confederated Tribes v. Walton, supra 647 F.2d 42, the court indicated that state administration of the No Name System was inappropriate because the system was entirely within the reservation, but conceded that state regulation may be appropriate in some circumstances. Id. at 52-53. The ninth circuit later conceded that the State could assume some regulatory authority on the reservation. United States v. Anderson, 736 F.2d 1358, 1365 (9th Cir. 1984). See also Federal Youth Center v. District Court in and for the County of Jefferson, 195 Colo. 55, 575 P.2d 395, 400 (1978) (Congress intended to defer to state administration); United States v. City and County of Denver, Colo., 656 P.2d 1, 35 (1982) (U.S. agrees adjudicated federal reserved water rights subject to administration by state engineer); United States v. Bell, Colo., 724 P.2d 631, 644 (1986) (U.S. must submit to state administration). The decree entered in the instant case does not require application of state water law to the Indian reservation. The decree recognizes reserved water rights based on federal law. The role of the state engineer is thus not to apply state law, but to enforce the reserved rights as decreed under principles of federal law. This court is also cognizant of the fact that exercise of the reserved water rights are intimately bound up with the state water rights of off-reservation users. The state water appropriators are not in a position to jeopardize the decreed rights of the Tribes. The decree only requires the United States and the Tribes first to turn to the state engineer to exercise his authority over the state users to protect their reserved water rights before they seek court assistance to enforce their rights; it does not preclude access to the courts. Incidental monitoring of Indian use to this end has carelessly been termed \"administration\" of Indian water by the state engineer. Should the state engineer find that it is the Tribes who are violating the decree, it is clear that he must then turn to the courts for enforcement of the decree against the United States and the Tribes and that he cannot simply close the headgates. United States v. Hampleman, supra No. 753, June 26, 1916. Any fear that the state engineer may be unfair must be dispelled by Article 1, § 31 of the Wyoming Constitution which provides that the State \"shall equally guard all of the various [water] interests involved.\" The state engineer has sworn to uphold this constitution. Thus it is readily apparent that the provisions authorizing the state engineer to monitor reserved water rights contemplate neither the application of state law nor the authority to deprive the Tribes of water without the assistance of the courts in a suit for the administration of the decree.\n\nThe argument that the instant decree can be administered only by the court in a separate suit for administration under the McCarran Amendment must fail in light of the admission that an independent water master might properly be appointed at this time to administer the decree and in light of the state engineer's limited authority. The Treaty of 1868 prohibits only unauthorized persons from entering the reservation, but the state engineer would be an authorized person upon his appointment to monitor the decree and could properly enter the reservation.\n\nThe district court did not err in including provisions giving the state engineer authority to enforce the decree against state appropriators.\n\nIX EXPENSES OF THE SPECIAL MASTER\n\nThe partial interlocutory decree settling the non-Indian federal reserved rights was final, under Rule 54(b), W.R.C.P., only as to Phase II, non-Indian federal reserved water rights. Nor could an appeal have been taken from the original orders to pay. The United States' timely notice of appeal from the May 24, 1985 Amended Judgment and Decree is sufficient to challenge all aspects of the Phase I proceedings, and we address the merits of the issue.\n\nThe McCarran Amendment prohibits taxing of costs against the United States: \"[N]o judgment for costs shall be entered against the United States in any such suit [for the adjudication or administration of water rights].\" 43 U.S.C. § 666. Rule 54(d), F.R.C.P., provides that \"costs against the United States * * * shall be imposed only to the extent permitted by law.\" Likewise, Rule 54(d), W.R.C.P., provides that \"costs against the state of Wyoming * * * shall be imposed only to the extent permitted by law.\" Both the federal and state rules provide that \"compensation to be allowed the master shall be fixed by the court, and may be charged against such of the parties * * * as the court may direct.\" Rule 53(a), W.R.C.P.; Rule 53(a), F.R.C.P.\n\nA number of federal cases have indicated that costs include the special master's fees and expenses. Norris v. Green, 317 F. Supp. 100 (N.D.Ala. 1965); K-2 Ski Co. v. Head Ski Co., Inc., 506 F.2d 471 (9th Cir. 1974); Capra, Inc. v. Ward Foods, Inc., supra 567 F.2d 1316 (5th Cir. 1978), overruled on other grounds Copper Liquor, Inc. v. Adolph Coors Co., 701 F.2d 542 (5th Cir. 1983). It is apparent, however, that the reason for this practice is to give the district court discretion as to whether to charge the losing party the entire master's bill. Capra, Inc. v. Ward Foods, Inc., supra, 567 F.2d at 1323-1324; Gary W. v. Louisiana, 601 F.2d 240 (5th Cir. 1979). Costs are generally considered to be the expenses incurred by the litigant, not the court system. 6 Moore's Federal Practice, ¶ 54.70 at 54-317 (1986). See also Rule 39(e), F.R.A.P. (including as taxable costs the preparation and transmission of the record and necessary transcripts, filing fees, and premiums paid for appeal bonds); Black's Law Dictionary at 312 (5th ed. 1979) (\"Fees and charges required by law to be paid to the courts or their officers, the amount of which is fixed by statute or court rule; e.g. filing and service fees\"). Therefore, assessing master's fees does not run afoul of the McCarran Amendment.\n\nThe United States was not the subject of discrimination because it was the only party other than Wyoming which was required to bear the expenses and fees of the master. Even in original proceedings before the United States Supreme Court, the practice is to allocate the master's compensation among the states and the United States. Arizona v. California, 351 U.S. 977, 76 S.Ct. 1042, 100 L.Ed.2d 1493 (1956).\n\nIn the case at bar, the United States insisted upon the appointment of a special master, arguing that the Board of Control could not be objective. Even though objection was groundless, the court appointed a master in order to insure the procedural integrity of the judgment. It was not unreasonable to require the United States to pay one-half of the master's fees and expenses under such circumstances. In Equal Employment Opportunity Commission v. International Union of Elec., Radio and Mach. Workers, AFL CIO, CLC, Local 758, 631 F.2d 81 (6th Cir.), cert. denied 449 U.S. 1010, 101 S.Ct. 565, 66 L.Ed.2d 468 (1980), the court affirmed the district court's order for the union to pay one-third of the master's expenses because the union had filed no objection to the appointment of the master and because the union had taken an active part in the litigation. In Gary W. v. Louisiana, supra 601 F.2d at 242-244, the court affirmed the order for the State to pay all the master's fees, despite its objection to the appointment of the master, because its failure to comply with the original injunction necessitated the appointment of the master to monitor implementation of the injunction. Where the reference to the master was at the defendant's request and over the plaintiff's objection, and where, as here, the party requesting the reference made no convincing showing that any serious prejudice would result if the reference were denied, it was proper to charge the defendant at least half of the expense of the reference. Johnson Fare Box Company v. National Rejectors, Inc., 269 F.2d 348 (8th Cir. 1959). See also 9 C. Wright \u0026 A. Miller, Federal Practice \u0026 Procedure, § 2608 at 798 (\"If a reference was unnecessary it is quite common to make the party who induced the court to order a reference bear the expense of the reference\"). No provision for the payment of fees was attached at the foot of the original reference to the Board of Control simply because there is no authority for assessing the fees and expenses of the Board.\n\nThe district court did not err in requiring the United States to pay one-half of the special master's fees and expenses.\n\nX CONCLUSION\n\nThe Amended Judgment and Decree is affirmed in part, reversed in part, and remanded to the district court for further proceedings consistent with this opinion.\n\nBY THE COURT:\n\nBROWN, C.J., authored Parts III, VII A, B, and D.\n\nCARDINE, J., authored Parts I, II, IV, V, and VI.\n\nMACY, J., authored Parts VII C, VIII and IX.\n\nTHOMAS, J., filed a dissenting opinion in which HANSCUM, District Judge, joined.\n\nHANSCUM, District Judge, filed a separate dissenting opinion.\n\nTHOMAS, Justice, dissenting with whom HANSCUM, District Judge, joins.\n\nI differ from the majority with respect to three propositions and must dissent from the disposition made in the majority opinion. Except for my three points of difference, I am in accord with the resolution of this case as set forth in that opinion. My three points of difference are: first, I do not agree that reserved water rights, to the extent that they properly are recognized under the reserved rights doctrine, should be limited in the manner suggested by the majority opinion; second, I believe that there should be a pragmatic limitation on the standard for quantification, the practicably irrigable acreage, which would eliminate those lands from the quantification formula which only could be irrigated by the construction of some future water project; and third, but most important, I do not believe that the reserved rights doctrine is applicable to that portion of the lands lying north of the \"Big Wind River,\" i.e., the ceded portion of the Wind River Indian Reservation.\n\nThe purpose of establishing an Indian reservation, such as the Wind River Indian Reservation, is to provide a homeland for Indian peoples. If one is to assume that, pursuant to the reserved rights doctrine relating to water, there is an implied reservation of those waters essential to accomplish the purpose of the reservation of land, then I cannot agree that the implied reservation of water with respect to the Wind River Indian Reservation should be limited, as the majority has held in approving the judgment of the district court. The fault that I find with such a limitation is that it assumes that the Indian peoples will not enjoy the same style of evolution as other people, nor are they to have the benefits of modern civilization. I would understand that the homeland concept assumes that the homeland will not be a static place frozen in an instant of time but that the homeland will evolve and will be used in different ways as the Indian society develops. For that reason, I would hold that the implied reservation of water rights attaching to an Indian reservation assumes any use that is appropriate to the Indian homeland as it progresses and develops. The one thing that I would not assume is that using the reserved water as a salable commodity was contemplated in connection with the implied reservation of the water. I would limit its use to the territorial boundaries of the reservation.\n\nDeeming it unnecessary to detail further the formula for allocation of water which involves the concept of practicably irrigable acreage (Arizona v. California, 460 U.S. 605, 103 S.Ct. 1382, 75 L.Ed.2d 318 (1983)), I am convinced that there has to be some degree of pragmatism in determining practicably irrigable acreage. It is clear from the majority opinion that there was included in quantifying the water reserved to the Indian peoples lands not now irrigable but deemed to be practicably irrigable acreage upon the assumption of the development of future irrigation projects. I would be appalled, as most other concerned citizens should be, if the Congress of the United States, or any other governmental body, began expending money to develop water projects for irrigating these Wyoming lands when far more fertile lands in the midwestern states now are being removed from production due to poor market conditions. I am convinced that, because of this pragmatic concern, those lands which were included as practicably irrigable acreage, based upon the assumption of the construction of a future irrigation project, should not be included for the purpose of quantification of the Indian peoples' water rights. They may be irrigable academically, but not as a matter of practicality, and I would require their exclusion from any quantification. For my purposes, this may be a moot point because I believe that hardly any of these lands are situated in the diminished portion of the Wind River Indian Reservation, the only lands to which reserved water rights can be attached.\n\nMy third concern is the error which has been committed in including lands north of the \"Big Wind River\" in the practicably irrigable acreage utilized for determining the quantification of the reserved water rights of the Indian peoples. In my judgment, the majority has ignored the significance of precedent from this court, to which we should accord priority; has failed to recognize the specific treaty history attaching to the Wind River Indian Reservation; and has failed to perceive the rationale of federal authorities addressing the disestablishment of Indian reservations. I would hold that the ceded lands have not been a part of an Indian reservation since 1905; and, since the reserved rights doctrine relating to an implied reservation of water rights depends upon the existence of reserved federal lands, there are no reserved water rights which attach to the ceded portion of the Wind River Indian Reservation. The United States Congress declared that the Indian peoples did not need these lands for the purpose of furnishing them a homeland; and, if that purpose is not present, there cannot be any implied reservation of water.\n\nTurning first to the precedent of our court because of the doctrine of stare decisis, on several occasions, we have addressed the implications of the Act of March 3, 1905, 33 Stat. 1016 (hereinafter Act of March 3, 1905), which approved the Second McLaughlin Agreement, negotiated with the Wind River Indian Reservation Shoshone and Arapahoe Tribes. Our decisions uniformly demonstrate recognition of state jurisdiction over the lands of the ceded portion of the Wind River Indian Reservation. In some instances, we relied upon the concept of \"Indian country.\" In this extraordinarily complex area of law, it seems important to promote rationality, if possible, and I would espouse a rule that for all practical purposes an \"Indian homeland\" and \"Indian country\" are one and the same.\n\nIn Merrill v. Bishop, 74 Wyo. 298, 287 P.2d 620 (1955), this court held that water rights appurtenant to lands situated in the ceded portion of the reservation could be perfected only by compliance with the statutory requirements of the State, thus unequivocally asserting jurisdiction over the management of water on the ceded portion of the reservation. The court expressed some doubt as to whether the reserved rights doctrine as to implied water rights, articulated in Winters v. United States, 207 U.S. 564, 28 S.Ct. 207, 52 L.Ed. 340 (1908), pertained to the Wind River Indian Reservation, in light of Art. 8, § 1 of the Constitution of the State of Wyoming, which declares all water within the boundaries of the State to be the property of the State, and the adoption of that constitutional provision by the United States Congress in the Act of Admission, Act of July 10, 1890, 26 Stat. 222. The decision, however, was not premised on such broad grounds. The court said:\n\n\"* * * And so we do not pass upon the right of the United States or the Indians in so far as it concerns water and lands that still remain within an Indian reservation. The federal government being in absolute control thereof and having complete jurisdiction there, the federal courts may hold that the water rights were impliedly reserved notwithstanding the broad language contained in the act of admission of Wyoming. * * * The lands involved in this action became a part of the public domain when Congress on March 3, 1905, approved the treaty of 1904. Furthermore, there is no evidence in the case that any of the Indian allotments here in question were granted prior to that time. So it is not necessary to consider what the law would be if these allotments had been granted while the lands herein involved were still contained in an Indian Reservation. It would seem then that the power to grant allotments after March 3, 1905, remained pursuant to that treaty, but only just as a power existed to acquire a homestead in that area, each with the qualification that water rights could be acquired only by appropriation thereof with a priority according to the time of the appropriation. If that were not so then if it should happen that there are still lands within the ceded area of 1904 that might now be allotted to Indians, he or they would then have a water right superior to all the rights acquired by appropriation during the last 75 years. To so hold would, we think, go beyond the mere protection of the weak against the strong. While Indian rights are to be regarded favorably, that should be done within reasonable limits. That the Indian allottees herein were not ignoran of the laws of appropriation of water is clearly demonstrated by the evidence in this case.\" Merrill v. Bishop, supra, 287 P.2d at 625.\n\nThe question in Blackburn v. State, Wyo., 357 P.2d 174, reh. denied 357 P.2d 1111 (1960), was criminal jurisdiction within the lands ceded pursuant to the Act of March 3, 1905. The argument was made that those lands were \"Indian country,\" and thus, the State of Wyoming had no criminal jurisdiction. The distinctive feature in Blackburn v. State, supra, was that the area in issue was located on the Riverton Irrigation Project, and compensation was authorized for those specific lands by the Act of August 15, 1953, 67 Stat. 592. Congress there provided for the sum of $1,009,500 to be credited and expended for the benefit of the Shoshone and Arapahoe Indians of the Wind River Indian Reservation:\n\n\"* * * [T]o constitute full, complete, and final compensation, except as provided in section 5 of this Act, for terminating and extinguishing all of the right, title, estate, and interest, including minerals, gas and oil, of said Indian tribes and their members of, in and to the lands, interests in lands, and any and all past and future damages arising out of the cession to the United States, pursuant to the Act of March 3, 1905 (33 Stat. 1016) of that part of the former Wind River Indian Reservation lying within the following described boundaries: * * *.\"\n\nIn Blackburn v. State, supra, this court noted that the Act of August 15, 1953, 67 Stat. 592, was amended by the Act of August 27, 1958, 72 Stat. 935, which provided, in pertinent part:\n\n\"* * * [A]ll of the right, title, and interest of the United States in all minerals, including oil and gas, the Indian title, to which was extinguished by the Act of August 15, 1953 * * * is hereby declared to be held by the United States in trust for the Shoshone and Arapahoe Tribes * * *.\"\n\nWe held that any retained mineral interest for the Indian peoples, held in trust by the United States, did not suffice to make the lands \"Indian country\" as that term is used in 18 U.S.C.A., §§ 1151-1153. This court ruled that, despite a retained interest in mineral proceeds, Congress had extinguished Indian title to the ceded lands.\n\n\"* * * Construing the Acts of Congress together, we think, as the trial court held, that the title of the Indians to the lands in the territory here involved has been extinguished and that the only right reserved to the Indians is in the money or proceeds received by the United States from the sale or lease of any rights in the land.\" Blackburn v. State, supra, 357 P.2d at 179.\n\nWhile this court did rely, in part, on the effect of congressional acts, other than the Act of March 3, 1905, in deciding Blackburn v. State, supra, it is clear that the same decision would have been reached relying solely on that Act. We quoted from Application of De Marrias, 77 S.D. 294, 91 N.W.2d 480, 482-483 (1958), as follows:\n\n\"`* * * It is provided in the Act of Congress ratifying the agreement of 1889: \"That the lands by said agreement ceded, sold, relinquished, and conveyed to the United States shall immediately, * * * be subject only to entry and settlement under the homestead and townsite laws of the United States, excepting the sixteenth and thirty-sixth sections of said lands, which shall be reserved for common school purposes, and be subject to the laws of the State wherein located: * * *.\" Section 30, Chapter 543, 1891 (26 United States Statutes at Large, p. 1039). * * *\n\n\"`It is readily apparent therefrom that the City of Sisseton is not situated on \"land within the limits of any reservation.\" Consequently it is not within the purview of the term \"Indian country\" as defined and used in Sections 1151, 1152, and 1153 of Title 18 U.S.C.A.'\n\n\"The foregoing italicized words are not contained in the Congressional Act of March 3, 1905, but we think that the intent is not different. See also Tooisgah v. United States, 10th Cir., 186 F.2d 93\n\n. The instant contentions of appellants are overruled.\" Blackburn v. State, supra, 357 P.2d at 179-180. (Emphasis in original.)\n\nA very similar jurisdictional question arose in State v. Moss, Wyo., 471 P.2d 333 (1970). The situs of the crime in that case was on property within the town of Riverton, Wyoming, which is situated on a portion of the lands ceded under the Act of March 3, 1905, and the court consistently held that Wyoming had jurisdiction over such lands which had not been returned to tribal ownership. The district court had dismissed a criminal information charging Moss, ruling that the State of Wyoming lacked jurisdiction over an Indian person in the town of Riverton. The State brought a bill of exceptions which this court sustained, holding that jurisdiction did exist. The court said:\n\n\"Ramified as is the recounted legislative and treaty history of the original reservation, the solution of our problem turns on two points, was the treaty and 1905 Act a disestablishment of the reservation as to portions ceded, and if so, what was the effect of the 1939 Act.\" State v. Moss, supra, 471 P.2d at 335.\n\nThis court did not give controlling effect to Blackburn v. State, supra, saying:\n\n\"* * * There a different area, a portion of the Riverton reclamation project, was under consideration; and while that site had been a part of the cession effected by the 1905 Act, it had also been the subject of the 1953 Act providing compensation to the Shoshone and Arapahoe Tribes `deemed to constitute full, complete, and final compensation, * * * and extinguishing all of the right, title, estate, and interest * * * to the lands * * *.'\" State v. Moss, supra, 471 P.2d at 337.\n\nInstead, the court limited its rationale to the effect of the Act of March 3, 1905 and held that, despite Art. 9 of that statute, which created a trust relationship in favor of the Shoshone and Arapahoe tribes by the United States, Indian title had been extinguished as to the ceded portion of the Wind River Indian Reservation. The court quoted from United States v. La Plant, 200 F. 92 (D.C.S.D. 1911), the part in which the federal court had addressed earlier the effect of a provision very similar to Art. 9 of the Act of March 3, 1905:\n\n\"`* * * That section declares that the United States does not guarantee to find a purchaser for the land, does not agree to buy the land, and acts only as trustee. But a trustee has not only the legal title, but he has also the right to possession, and the fact that the government is to act as trustee for the Indians does not indicate that their title has not been extinguished. There is nothing in section 9 providing that if the land is not sold it shall be turned back to the Indians. The government simply agrees to hold the money realized from the sale of the land, whenever it receives it, for the benefit of the Indians.'\" State v. Moss, supra, 471 P.2d at 337, quoting United States v. La Plant, supra, 200 F. at 94.\n\nThis court also quoted favorably from State ex rel. Hollow Horn Bear v. Jameson, 77 S.D. 527, 95 N.W.2d 181 (1959), which had construed an act \"parallel\" to the Act of March 3, 1905, relying on United States v. Pelican, 232 U.S. 442, 34 S.Ct. 396, 58 L.Ed. 676 (1914), and Putnam v. United States, 248 F.2d 292 (8th Cir. 1957). The adopted language states that the Act (36 Stat 440), described by our court to be parallel to the Act of March 3, 1905:\n\n\"`* * * [W]as motivated by a congressional purpose to reduce the area of Pine Ridge * * *. In effect it separated the reservation into two parts. That which the act denominates as the \"diminished\" reservation, and which we elect to refer to as the \"closed\" portion of the reservation, was to remain unchanged and to continue to serve the purposes of the government in protecting and dealing with the whole Indian population of the reservation as in the past. The remainder of the reservation, which we will refer to as the \"open\" portion of the reservation, was to undergo change through a process of settlement into homesteads and townsites. It was contemplated that most of this surplus area would ultimately be settled, patented in fee, and cease to be a part of the reservation and within Indian country. There is no indication that allotted lands in this open area were reserved and excepted to serve the interest of the Pine Ridge Indians as a whole. It seems apparent that the principal reason for reserving these scattered outlying tracts was to permit the government to respond completely to its obligations to the respective allottees of these tracts. It is equally apparent that as the Indian title to each of these tracts was extinguished they would cease to serve in furthering any phase of the functions of the government in ministering unto its Indian wards. Thereafter such a tract would bear no different relation to those functions than would an adjoining tract of the open area, the Indian title to which had been extinguished by a homestead patent to a settler. Because the Congress obviously did not contemplate the use of these outlying allotted tracts for any purpose in connection with the superintendence and protection of its Indian wards after the Indian title thereto had been extinguished, we are persuaded that after such an extinguishment it intended they should cease to be both a part of the reservation and of the Indian country.\" State v. Moss, supra, 471 P.2d at 338, quoting State ex rel. Hollow Horn Bear v. Jameson, supra, 95 N.W.2d at 184-185.\n\nThe court concluded that the Act of March 3, 1905 had the effect of extinguishing Indian title and demonstrated an intent that the land should cease to be a part of the reservation and of \"Indian country.\" This court also considered the effect of the Act of July 27, 1939, 53 Stat. 1128, describing this latter statute as one which:\n\n\"* * * [I]nter alia, directed the Secretary of the Interior to establish land-use districts within the diminished and ceded portions of the Wind River Indian Reservation, to restore to tribal ownership all undisposed-of surplus or ceded lands within the land-use districts not under lease or permit to non-Indians, and to restore the balance of said lands progressively as the non-Indian owned land within a given land-use district were acquired.\" State v. Moss, supra, 471 P.2d at 335.\n\nThe court was satisfied that the lands within the corporate limits of Riverton had not been included in any of the restoration orders pursuant to that statute and simply observed that \"* * * on its face it restored nothing but rather directed the Secretary of the Interior to restore in certain instances the ceded lands.\" State v. Moss, supra, 471 P.2d at 339.\n\nIn my view, the decisions of this court, premised on a finding that the ceded portion was disestablished, are supported by further investigation into the language of the treaty and the statutory history of the Wind River Indian Reservation. The language incorporated in the 1904 Agreement, which was approved by the Act of March 3, 1905, is substantially the same as that which Congress used to ratify and amend three agreements with the Indians of the Rosebud Reservation. Act of April 23, 1904, 33 Stat. 254; Act of March 2, 1907, 34 Stat. 1230; Act of May 30, 1910, 36 Stat. 448. Article I of the 1904 Agreement provided in pertinent part:\n\n\"The said Indians belonging on the Shoshone or Wind River Reservation, Wyoming, for the consideration hereinafter named, do hereby cede, grant, and relinquish to the United States, all right, title, and interest which they may have had to all the lands embraced within the said reservation, except the lands within and bounded by the following described lines: * * *.\" (Emphasis added.)\n\nArticle II provided in pertinent part:\n\n\"In consideration of the lands ceded, granted, relinquished, and conveyed by Article I of this agreement, the United States stipulates and agrees to dispose of the same as hereinafter provided under the provisions of the homestead, townsite, coal and mineral land laws, or by sale for cash as hereinafter provided at the following prices per acre: * * *.\" (Emphasis added.)\n\nExamination of other aspects of the 1904 Agreement confirms that it was the intention of Congress to disestablish the ceded portion as an Indian reservation and to leave a diminished reservation for the Shoshone and Arapahoe Tribes. In Article III, there is a provision for a sum of $85,000 from the sale of the lands to be used to make a per capita payment of $50 within sixty days of the opening of the ceded lands to settlement. Any remaining balance from this sum set aside for per capita payment was to be used to do those things necessary to secure water rights for any lands remaining the property of the Indians \"* * * whether located within the territory to be ceded by this agreement or within the diminished reserve.\" \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e Perhaps \"diminished\" was not a word of art in Indian law in 1904. See Solem v. Bartlett, 465 U.S. 463, 104 S.Ct. 1161, 79 L.Ed.2d 443, reh. denied 466 U.S. 948, 104 S.Ct. 2148, 80 L.Ed.2d 535 (1984), cert. denied ___ U.S. ___, 107 S.Ct. 409, 93 L.Ed.2d 361 (1986). In the context in which it was used in the 1904 Agreement, however, it could indicate only the intent to diminish the boundaries of the then-existing reservation. See Oregon Department of Fish and Wildlife v. Klamath Indian Tribe, 473 U.S. 753, 760, 105 S.Ct. 3420, 3425 n. 11, 87 L.Ed.2d 542 (1985) (indicating express use of the term \"diminished reservation\" is some indication of congressional intent).\n\nTwo other articles in the 1904 Agreement manifest an intent that funds be expended for development of the reservation but only within the diminished reservation. Article IV provided for $150,000 to be expended on an irrigation system \"within the diminished reservation.\" Article VI provided for $50,000 to be expended for \"the erection of school buildings and maintenance of schools on the diminished reservation.\" Further, Article IX of the 1904 Agreement was amended by the Act of March 3, 1905 to include an appropriation of $35,000 for the \"survey and field and office examination of the unsurveyed portions of the ceded lands, and the survey and marking of the outboundaries of the diminished reservation, where the same is not a natural water boundary; * * *.\" This provision manifests an intent to set apart the diminished reservation by establishing boundaries between the diminished and ceded portions. Taken together, the language of the 1904 Agreement expresses a congressional intent to disestablish the ceded portion from the then-existing reservation with the result being a diminished Wind River Indian Reservation.\n\nThe amplification of the statutory history demonstrates that Congress intended to disestablish the ceded portion of the reservation, consistent with the prior holdings of this court. The Wind River Indian Reservation was established by Congress as a Shoshone Reservation on July 3, 1868, upon the execution of the Second Treaty of Fort Bridger with the Shoshone and Bannock Indians. In 1878, the Arapahoe Indians were quartered on the reservation, and it subsequently became a joint reservation for the Shoshone and Arapahoe Tribes. Congressional efforts to reduce the size of the reservation culminated, on October 2, 1891, in an agreement which was reached with the Shoshone and Arapahoe Indians of the Wind River Reservation for the cession of approximately 1,100,000 acres for a consideration of $600,000. H.R.Exec.Doc. No. 70, 52d Cong., 1st Sess., at 23 (1892). The chairman of the commission which had been appointed to negotiate the agreement refused to execute it, however, with his principal reason being that it left the Indians with too much land.\n\n\"The Indians are left as now with too much land. The same complaints which their superabundance of land now gives rise to must necessarily continue. They surrender what is comparatively a small portion of their reservation, considering its value, and a portion from which but little of their former troubles have arisen. The part surrendered is comparatively worthless, and they propose to receive for it what, in the best possible light, is an exorbitant price.\" H.R.Exec. Doc. No. 70, supra, at 21.\n\nCongress followed the recommendations of the chairman and did not ratify the 1891 Agreement. Instead, Congress authorized the reopening of negotiations for the cession of a larger portion of the reservation. Act of July 13, 1892, 27 Stat. 120.\n\nIn January, 1893, a new commission was sent to negotiate but with orders to reduce the Wind River Indian Reservation to 300,000 acres. That commission determined, however, that 650,000 acres were needed for purposes of the reservation. H.R.Exec. Doc. No. 51, 53d Cong., 2d Sess., at 13 (1894). In the course of these negotiations, the representatives of the Indian peoples manifested a desire to sell a large portion of the reservation, which they felt white ranchers were using without payment or permission, but they refused to sell any portion of the reservation south of the Wind River. Chief Washakie of the Shoshone Tribe expressed their position:\n\n\"I guess we will not trade, I tell you now that I will not sell this land on the south side, I am done talking about it.\" H.R. Exec.Doc. No. 51, supra, at 18.\n\nThere is no record of any further negotiations of significance until April 21, 1896, when Inspector James McLaughlin successfully negotiated an agreement to cede 55,040 acres for $60,000, including some hot springs (Thermopolis) which the government desired to open for public use. That agreement was approved by Congress on June 7, 1897. S.Doc. No. 247, 54th Cong., 1st Sess. (1896); H.R.Doc. No. 5, 55th Cong., 2d Sess., at 34-36, 406-408 (1897). Although not related directly to subsequent negotiations, this agreement did set the stage for negotiations that later led to the passage of the Act of March 3, 1905. See J. McLaughlin, My Friend the Indian, ch. XXVII (1910); L. Pfaller, James McLaughlin, The Man with an Indian Heart, ch. XIII (1978).\n\nOn March 4, 1904, Representative Mondell of Wyoming introduced H.R. 13481 entitled \"A Bill to ratify and amend an agreement with the Indians residing on the Shoshone or Wind River Indian Reservation, in the State of Wyoming, and to make appropriations for carrying the same into effect.\" 38 Cong.Rec. at 2843 (1904), printed in entirety in 38 Cong.Rec. at 5245-5247 (1904). Among the purposes of this bill was ratification of the 1891 Agreement, but it, in fact, included substantial amendments to that agreement, providing, among other things, for a larger cession of land and a change in the manner of payment from a sum certain to proceeds from the sale of the land. H.R.Rep. No. 2355, 58th Cong., 2d Sess. (1904). The purpose of the bill was exactly the same as that of the agreement: to reduce the size of the Wind River Indian Reservation to an area better suited to the needs of the Indians and the United States. The Committee on Indian Affairs commented on H.R. 13481:\n\n\"H.R. No. ____ proposes to reduce the reservation, as suggested by Mr. Woodruff at the time of the making of the Agreement of 1891, and in this connection it should be remembered that the instructions to the commission in 1891 were to reduce the reservation from 650,000 to 700,000 acres. The bill in question still leaves the Indians with 808,500 acres. A careful estimate by the General Land Office gives the area of the lands proposed to be ceded by the above bill at 1,480,000 acres, leaving 808,500 acres in the diminished reserve. There are 1,650 Indians on the reservation at this time, so that the diminished reserve leaves about 500 acres per Indian man, woman, and child, on the reservation.\n\n\"The diminished reserve is by all means the best portion of it, although there are some good lands in the ceded tract. The diminished reserve is, however, a particularly well-watered, well-grassed country, a considerable portion of which is susceptible of irrigation, several thousand acres being now under irrigation and farmed by the Indians.\" H.R.Rep. No. 2355, supra, at 3.\n\nThe Committee on Indian Affairs favored Mondell's bill but suggested an amendment requiring the consent of the Indian peoples. H.R.Rep. No. 2355, supra at 2. James McLaughlin, the United States Indian Inspector who had negotiated successfully the Rosebud and Devil's Lake Agreements and the 1896 Agreement with the Indians of the Wind River Reservation, was chosen to seek the consent of the Shoshone and Arapahoe Tribes to the amendment. McLaughlin arrived at the Wind River Indian Reservation on April 15, 1904, and, six days later, he reached an agreement which he described in this way:\n\n\"* * * [A]long the lines of the `Mondell Bill' as to boundaries and manner of payment, but with some modifications of certain of its provisions, which, as I regard it, is in the interests of the Government and, at the same time, more beneficial and pleasing to the Indians.\" Letters of James McLaughlin (Microfilm Roll 26 at 12).\n\nIt is reflected in the minutes of the council meeting at which this agreement was discussed that both Inspector McLaughlin and the representatives of the Indian peoples understood that Congress intended the sale of a large portion of the Wind River Indian Reservation, for which compensation was to be made in accordance with the Mondell Bill.\n\n\"* * * The President and the Secretary of the Interior are desirous to have you sell your surplus lands and open them to settlement as much so as Congress, but at the same time, they are desirous to see that the Indians have full compensation for such lands ceded to the government. For several years past there has been a sentiment in Congress, and one that is growing stronger each succeeding year, opposed to paying the Indians a lump sum consideration for their lands. Instead of stipulating, or providing in the agreement, a lump sum consideration for any tract of land, they have determined upon giving the Indians the full benefit of the land by paying the Indians from the proceeds of the sale of the land as white men settle upon it. Several agreements with tribes of Indians that provided for a lump sum consideration which were presented to Congress the past two years have not been ratified, for the reason that Congress has refused to act upon any such agreements, and the said agreements have had to be changed before they could be carried out. I have made this explanation that you may know my reasons for not being able to entertain a proposition from you people for a lump sum consideration. Understand that anything you may receive from these lands will be paid to you from the proceeds of sales of same to white men.\n\n\"In days gone by, years ago, when your reservation was set apart, large reservations were possible, because the white man did not desire the lands, but the tide of immigration is now pressing from both east and west, white men are clamoring for additional lands, and all lands that the Indians have no need of, must be opened for settlement, the department having charge of the Indians cannot prevent it, and can only secure them by giving them homes and allotments in severalty, and that is why I am here today, to present to you an agreement for disposing of the lands that you do not need. \"For the purpose of having the surplus lands of your reservation open to settlement and realizing money from the sale of that land, which will provide you with means to make yourselves comfortable upon your reservation, a bill has been introduced in Congress called the `Mondell Bill,' which I will read. It has been presented and reported favorable from the Committee on Indian Affairs of the House, and is now awaiting action on the part of you people before it is taken up in the Senate.\" (Thereafter the Mondell Bill was read to the Indians by Inspector McLaughlin.) McLaughlin Letters (Microfilm Roll 26 at 26-27).\n\nThere can be no question that the representatives of the Indian peoples understood that the agreement and the bill contemplated an outright sale of a large portion of the Wind River Indian Reservation. Among the remarks of the participants were:\n\nLONE BEAR, ARAPAHOE:\n\n\"I understand what he comes for, and I will let him know what I think of it, and I will tell what part of the Reservation I want to sell.\"\n\nREVEREND SHERMAN COOLIDGE, ARAPAHOE:\n\n\"I am glad that Major McLaughlin has come to us to purchase a portion of our reservation. The proposed ceded portion has not been used by us except for grazing purposes, and I think cash money will be of more value among the Arapahoes and Shoshones. I am in favor of the `Mondell Bill' along the lines, with slight changes that we discussed with the Shoshones last night.\"\n\nGEORGE TERRY, SHOSHONE:\n\n\"It is not like selling a wagon, a horse, or something of that nature, but it is something we are parting with forever, and can never recover again.\"\n\nMcLaughlin Letters (Microfilm Roll 26 at 32, 35 and 40.)\n\nClearly, the Indian representatives understood the Mondell Bill. They suggested changes in certain provisions relating to the expenditure of the moneys to be received from the sale of the lands and requested a resurvey of the western boundary of the diminished portion of the reservation to make it conform with the 1868 treaty. They also requested a provision that the agreement require the signatures of a majority of male Indians over eighteen from both tribes. Inspector McLaughlin reported on his negotiations with the Indian peoples in this way:\n\n\"The diminished reservation leaves the Indians the most desirable and valuable portion of the Wind River Reservation and the garden spot of that section of the country. It is bounded on the north by the Big Wind River, on the east and southeast by the Big Popo-Agie River, which, being never failing streams carrying a considerable volume of water, give natural boundaries with well-defined lines; and the diminished reservation, approximately 808,000 acres, about three-fourths of which is irrigable land, allows 490 acres each for the 1,650 Indians now belonging on the reservation. I gave this question a great deal of thought and considered every phase of it very carefully and became convinced that the reservation boundary, as stipulated in the agreement, was ample for the needs of the Indians belonging thereto; that by including any portion of the lands north of the Big Wind River or east of the Big Popo-Agie River in the diminished reservation it would only be a short time until the whites would be clamoring to have it open to settlement, and the Indians would be eventually compelled to give it up. Furthermore, with the exception of about 20 families (mixed bloods and white men who are intermarried into the tribes) there are no Indians occupying lands outside of the diminished reservation.\" Letter of James McLaughlin, United States Indian Inspector, to the Secretary of Interior, April 25, 1904, printed in full in H.R.Rep. No. 3700, 58th Cong., 3d Sess., supra, pt. 1, at 15-19.\n\nThe Mondell Bill, H.R. 13481, resembled the preceding 1891 Agreement in that it proposed to disestablish the ceded portion of the then-existing Wind River Indian Reservation resulting in a diminished reservation to be inhabited by the Shoshone and Arapahoe Indians. That particular bill, however, was not adopted by Congress. Changes to the bill which had been suggested by the Indian peoples and accepted by Congress, along with further amendments to the bill such as the Asmus Boysen provision \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e made it necessary that a new bill \"be passed in lieu of H.R. 13481.\" The new bill was H.R. 17994. See H.R.Rep. No. 3700, supra, pt. 1, at 1-3. This is the bill which, after extensive debate in both houses and the adoption of a committee resolution relating to a disagreement between the House of Representatives and the Senate, ultimately passed as the Act of March 3, 1905. The intent of H.R. 17994 was consistent with and very much the same as that of H.R. 13481 and the 1891 Agreement. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nFrom the initial negotiation in 1891 to passage of the Act of March 3, 1905, the history of the 1904 Agreement and the legislation demonstrate that Congress intended the cession of a large portion of the then-existing Wind River Indian Reservation by disestablishing the ceded portion and recognizing a diminished reservation. The provisions of the Act of March 3, 1905, H.R. 17994, were considered most carefully by Congress. Congressman Mondell had continued with his efforts to have H.R. 13481 passed through both houses while James McLaughlin remained in Wyoming. Congressman Mondell had offered amendments to conform to suggestions by the Committee on Indian Affairs, and as amended, the House had passed the bill. 38 Cong.Rec., supra, at 5247-5248. The bill then had been read in the Senate and referred to the Senate Committee on Indian Affairs. 38 Cong.Rec., supra, at 5294. The Senate Committee had recommended passage with additional amendments. 38 Cong.Rec., supra, at 5671; S.Rep. No. 2621, 50th Cong., 2d Sess. (1904), and the bill had been passed with amendments by the Senate on April 27, 1904. 38 Cong.Rec., supra, at 5707. The House was unable to accede to the Senate amendments before that session of Congress adjourned.\n\nWhen H.R. 17994 was offered in the third session by Representative Marshall, in lieu of H.R. 13481, its purpose was to amend and ratify the April 21, 1904 Agreement with the Indian peoples residing on the Shoshone or Wind River Indian Reservation in the State of Wyoming. 39 Cong. Rec., at 1112 (1905). This new bill was sent to the House Committee on Indian Affairs, which split over the Asmus Boysen Amendment, but which also proposed the following amendment:\n\n\"Provided, that the constitution and laws of the State of Wyoming shall not operate to secure any rights, having priority to those members of the Shoshone tribe of Indians, to the use of the waters within the territory hereby open to sale and settlement, including Big Wind River and its tributaries, for purposes of irrigation of the lands comprised within such territory, until such time as the United States shall have perfected allotments to the members of the Shoshone Indian tribe, either from the lands to be opened for settlement or within the diminished reservation of said Indians, and completed the necessary steps under the law to secure the desired water rights for the said allotments.\" H.R.Rep. No. 3700, supra, pt. 1 at 7.\n\nWhen the bill was returned to the House, it was passed after considerable debate and some difficulty, and with the Boysen Amendment removed. The bill then went to the Senate and was referred to the Senate Committee on Indian Affairs. That committee reported back with the recommendation of passage with amendments. One of those was to reinsert a modified provision for the Boysen Amendment previously struck in the House. Yet another amendment removed the House amendment quoted above relating to the inhibition on settlers with respect to obtaining perfected water rights under Wyoming law before the Indians' water rights could be perfected. The bill passed the Senate with these amendments and was sent back to the House. After a motion was passed to disagree with the Senate amendments, a conference committee was appointed. The recommendation of the conference committee was that the House should recede from disagreeing with the Senate amendments and after further debate the conference report was passed by the House. 39 Cong. Rec., supra, at 3886-3887. The bill then was sent in its final form to the president and enacted as the Act of March 3, 1905. 39 Cong.Rec., supra, at 3974, 4033.\n\nRepresentative Marshall spoke on the floor of the House:\n\n\"Mr. Speaker, the gentleman from Wyoming [Mr. Mondell] has well said that this bill has had more careful consideration than any bill of this character that has been before the Indian Committee, and there is but one possible objection to it, and that is the objection to giving this preferential right to 640 acres to Mr. Boysen. I was chairman of the subcommittee that considered that question, and we considered it long and carefully and conscientiously, and ultimately decided that, as a matter of equity, Mr. Boysen was entitled to this preferential right.\" 39 Cong.Rec., supra, at 1945.\n\nIt is of particular moment to note that an amendment to inhibit the operation of the constitution and laws of the State of Wyoming so as to secure any rights to the use of waters within the ceded territory was defeated.\n\nThe legislative history subsequent to the passage of the Act of March 3, 1905 demonstrates an understanding that the ceded portion of the Wind River Indian Reservation had been disestablished. A discussion on appropriations for the construction of an irrigation project on the Shoshone or Wind River Indian Reservation can be found in hearings before the House Committee on Indian Affairs relating to H.R. 12579. Indian Appropriation Bill, Hearings on H.R. 12579, Before the Senate Committee on Indian Affairs, 63d Cong., 2d Sess., at 279-281 (1914). In those hearings, Mr. Merritt offered the following clause to be attached as a provision to a $25,000 appropriation:\n\n\"Provided, That the use of so much water as may be necessary to supply for domestic, stock watering, and irrigation purposes, land allotted or to be allotted to Indians on the diminished Shoshone or Wind River Reservation, in Wyoming, or set aside for administrative purposes within said reservation is hereby reserved, and the failure of any individual Indian or Indians to make beneficial use of such water shall not operate in any manner to defeat his or her right thereto while said land is held in trust by the United States. All laws and parts of laws in conflict herewith are hereby repealed.\"\n\nMr. Merritt then read from a memorandum which stated:\n\n\"`The purpose of this and other similar legislation in this bill is to protect the rights of Indians to water on Indian reservations and on allotted Indian lands held under trust or by other patents containing restrictions on alienation.\n\n\"`To establish more certainly and securely water rights of Indians is a matter of the greatest importance in administering satisfactorily their affairs. On a number of reservations where Indians have been allotted, the land is practically of no value for agricultural purposes without irrigation. Water on these reservations is a vital factor in developing the Indians living thereon so that they may become self-supporting and be raised to a higher standard of civilization.\n\n\"`The Supreme Court in the case of Winters v. United States (207 U.S. 564), said that \"The power of the government to reserve waters and exempt them from appropriation under the State laws is not denied, and could not be.\"\n\n\"`The Supreme Court further said in this case that there was an implied reservation for the benefit of the Indians of a sufficient amount of water from the Milk River for irrigation purposes which was not affected by the subsequent act of February 22, 1889 (25 Stat. L., 676), admitting Montana to the Union, and that the water of the Milk River cannot be diverted so as to prejudice the rights of the Indians by settlers on the public lands and those claiming riparian rights on that river.\n\n\"`It is believed that the general principles laid down in the Winters case are applicable to all Indian reservations where there are no specific acts of Congress to the contrary. However, I find that the very favorable decision of the Supreme Court in the Winters case regarding the water rights of Indians has been practically nullified by various acts of Congress, and as a result of such legislation the water rights of Indians are now dependent on beneficial use in a number of reservations where the Government has been, and is now, spending large amounts of reimbursable funds, and by acts of Congress these water rights are subject to the laws of several of the States wherein these irrigation projects are located.'\" Memorandum referred by Mr. Merritt, reported in Indian Appropriation Bill, Hearings on H.R. 12579, supra, at 280.\n\nThis statement of purpose is consistent with a policy, implemented following the passage of the Act of March 3, 1905, to encourage all of the Indians of the Wind River Reservation to reside only on the diminished portion. The annual report of the Secretary of Interior for 1906 included this comment:\n\n\"W.B. Hill, superintendent of irrigation, has been instructed to make surveys of ditches in use and of those necessary to be constructed on the Shoshone Reservation so as to give water to each allottee if possible and in order to apply for permit to appropriate waters under the laws of Wyoming. He was advised that in the beginning only such construction should be made as might be necessary to maintain priority of water rights and that any system of irrigation planned should be within the diminished reservation. In revising and completing allotments to the Indians on that reservation it is the policy of the Office to make new allotments within the diminished reservation, and to encourage Indians who have received allotments north of Big Wind River to relinquish them and agree to take other lands in lieu thereof within their diminished reservation.\" H.R.Doc. No. 5, 59th Cong., 1st Sess., at 155 (1905). Also see Letter to Walter B. Hill from Department of Interior, August 11, 1904; Act of August 1, 1914 (38 Stat. 582 § 24) (1914).\n\nIt is noteworthy that construction for an irrigation project was restricted to the diminished reservation; Congress was concerned with protecting the water rights of Indians on reservations and certain Indian allotments not within reservation boundaries; it was understood that despite Winters v. United States, supra, federal action might be necessary to protect Indian reservation water rights; and there was a complete absence of any concern for protecting any water rights appurtenant to the ceded lands, other than lands owned by Indian allottees. All this strongly indicates an understanding of Congress that a sufficient interest in the ceded land had not been retained by the Indians so that any reserved water rights appurtenant to the ceded portion were retained. See also Act of August 1, 1914 (38 Stat. 582, § 24, supra) (enacting H.R. 12579, as amended, and providing funds for construction of the irrigation system, roads and bridges within the diminished reservation manifesting an intent for the Indian peoples to corporately reside within the boundaries of the diminished reservation).\n\nThe intent to disestablish the ceded portion also is supported by the treatment in the 1904 Agreement of Sections 16 and 36 in those surveyed townships within the ceded portion of the reservation. An amendment to that agreement deleted a provision in Article II for the purchase of lands in lieu of Sections 16 and 36 of the ceded portion by the United States for $1.25 per acre. The deletion of this provision was accomplished by an amendment of Representative Mondell who explained that it was believed to leave Wyoming \"authorized under the enabling act to take lieu land.\" 38 Cong.Rec., supra, at 5247. The effect of this amendment is to demonstrate further the understanding of Congress that passage of the Act of March 3, 1905 not only would disestablish the ceded portion but also would extinguish Indian title to the ceded portion. The Wyoming Act of Admission provided that Sections 16 and 36 in every township in Wyoming were granted to the State for the support of common schools and provided that the State could select equivalent lands if Sections 16 and 36 had been sold or otherwise disposed of by the authority of any act of Congress. Act of July 10, 1890, 26 Stat. 222, § 4. The obvious concern of this amendment by Representative Mondell was that the Act of March 3, 1905 had the effect of removing the ceded portion from the disclaimer in Article 21, Section 26 of the Constitution of the State of Wyoming, disavowing any claim of a state interest in lands reserved for the Indians. Further, there was a concern that such provisions for school lands extended only to public federal lands. See Minnesota v. Hitchcock, 185 U.S. 373, 22 S.Ct. 650, 46 L.Ed. 954 (1902); Rosebud Sioux Tribe v. Kneip, supra, 430 U.S. at 601 n. 23, 97 S.Ct. at 1370 n. 23. If the effect of the Act of March 3, 1905 was to restore the ceded lands to the status of public federal lands and to avoid the inhibition of the Wyoming Constitution, then Wyoming could claim Sections 16 and 36 in townships on the ceded portion of the reservation. Since apparently no payment would be required by the United States for Sections 16 and 36, the amendment removed the requirement to pay for lieu lands selected because of the disposal of Sections 16 and 36. This proviso was different from that involved in Rosebud Sioux Tribe v. Kneip, supra, in which the United States had been required to purchase Sections 16 and 36 for the benefit of South Dakota. Unless the ceded portion was disestablished as a reservation, however, the amendment to delete the requirement to pay for lieu lands had no significance.\n\nA parallel history with respect to the Wind River Indian Reservation developed in the executive branch of the federal government. The presidential proclamation of June 2, 1906 states:\n\n\"WHEREAS, By an agreement between the Shoshone and Arapahoe tribes of Indians, belonging to the Shoshone or Wind River reservation in the State of Wyoming, on the one part, and James McLaughlin, a United States Indian Inspector, on the other part, amended and ratified by act of Congress approved March third, nineteen hundred and five (33 Stat., 1016), the said Indian tribes ceded, granted, and relinquished to the United States all the right, title, and interest which they may have had to all of the unallotted lands embraced within said reservation, except the lands within and bounded by the following described lines:\n\n\"NOW, THEREFORE, I, THEODORE ROOSEVELT, President of the United States of America, by virtue of the power in me vested by the said Act and Resolution of Congress, do hereby declare and make known that all the unallotted lands in the ceded portion of said reservation, except such as may at that time have been reserved for carrying out the provisions of said amended treaty relative to the rights of Asmus Boysen, allowing him to locate in accordance with the Government surveys not to exceed 640 acres in the form of a square, of mineral or coal lands in said reservation, and to purchase the same, will, on and after the fifteenth day of August, nineteen hundred and six, in the manner hereinafter prescribed, and not otherwise, be open to settlement, entry, and disposition under the general provisions of the homestead, townsite, coal, and mineral land laws of the United States.\" 34 Stat., pt. 3, at 3208.\n\nThe language found in that proclamation expresses \"an unambiguous, contemporaneous, statement, by the Nation's Chief Executive, of a perceived disestablishment\" of the ceded portion of the Wind River Indian Reservation. See Rosebud Sioux Tribe v. Kneip, supra, 430 U.S. at 602-603, 97 S.Ct. at 1371.\n\nAfter passage of the Act of March 3, 1905, the Department of the Interior of the United States published maps of the Wind River Indian Reservation which reflect an understanding of the executive department that the Indian peoples had not retained a sufficient interest in the ceded portion of those lands to cause the Department of Interior to consider it an Indian reservation. The Department of the Interior's map of the State of Wyoming for 1892 shows the Wind River or Shoshone Indian Reservation boundaries to exist as stated by treaties prior to the 1896 Agreement. The Department of the Interior's map for 1900 shows the reservation slightly reduced by the cession under the 1896 Agreement. Similarly, the Department of the Interior's maps for 1907 and 1912 reflect a dramatic decrease in the boundaries of the Wind River or Shoshone Indian Reservation, excluding the ceded land from that area known as the Wind River or Shoshone Indian Reservation. Dinsmore, A.F., compiler, State of Wyoming, United States Department of the Interior, General Land Office, 1892, scale 1:12, 1 sheet; King, H., compiler, Map of the State of Wyoming, United States Department of the Interior, General Land Office, 1900, scale 1:12, 1 sheet; Berthrong, I.P., compiler, State of Wyoming, United States Department of the Interior, General Land Office, 1907, scale 1:12, 1 sheet; Berthrong, I.P., compiler, State of Wyoming, United States Department of the Interior, General Land Office, 1912, scale 1:12, 1 sheet.\n\nThis legislative and executive history subsequent to the passage of the Act of March 3, 1905 supports only one conclusion: a status of an Indian reservation was intended and understood only for the diminished reservation; the Indians corporately would reside on the diminished reservation, and any of those who continued to live on the ceded portion would do so only as private allottees.\n\nFinally, an understanding by the United States that the ceded portion was disestablished from the reservation is demonstrated by acquiescence in the decisions of this court upholding state jurisdiction over the ceded portion. The effect of this unquestioned and consistent exercise of jurisdiction by the State of Wyoming over certain lands within the ceded portion is well expressed in Rosebud Sioux Tribe v. Kneip, supra, 430 U.S. at 604, 97 S.Ct. at 1372, 51 L.Ed.2d 660 (1977), in which the court said:\n\n\"* * * [T]he fact that neither Congress nor the Department of Indian Affairs has sought to exercise its authority over this area, or to challenge the State's exercise of authority is a factor entitled to weight as a part of the `jurisdictional history'.\"\n\nThe cases decided by this court and the very intriguing legislative and executive department history all are compatible with federal precedent relating to the disestablishment of an Indian reservation. Disestablishment abrogates appurtenant rights. Implied water rights on Indian reservations, founded upon the reserved rights doctrine, are extinguished by acts of Congress inconsistent with recognition of their existence, even though they are not subject to state law concerning the abandonment or extinguishment of a water right. See United States v. Anderson, 591 F. Supp. 1 (E.D.Wash. 1982). There appears to be no question that Congress may limit or extinguish Indian title, \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e and any rights appurtenant to the title, without obtaining the consent of the Indian peoples. Solem v. Bartlett, supra; Rosebud Sioux Tribe v. Kneip, supra; Lone Wolf v. Hitchcock, 187 U.S. 553, 23 S.Ct. 216, 47 L.Ed.2d 299 (1903); Ute Indian Tribe v. State of Utah, 716 F.2d 1298 (10th Cir. 1983), cert. denied ___ U.S. ___, 107 S.Ct. 596, 93 L.Ed.2d 596 (1986).\n\nThe cases hold that when Congress extinguishes the title of Indian peoples to a portion of any land, any hunting and fishing rights appurtenant to the land, to the extent that recognition of such right is inconsistent with extinguishment of the title, is limited impliedly or extinguished also. Oregon Department of Fish and Wildlife v. Klamath Indian Tribe, supra; Puyallup Tribe, Inc. v. Department of Game of State of Washington, 391 U.S. 392, 88 S.Ct. 1725, 20 L.Ed.2d 689, reh. denied 393 U.S. 898, 89 S.Ct. 64, 21 L.Ed.2d 185 (1968); Ward v. Race Horse, 163 U.S. 504, 16 S.Ct. 1076, 41 L.Ed. 244 (1896). Cf. Menominee Tribe of Indians v. United States, 391 U.S. 404, 88 S.Ct. 1705, 20 L.Ed.2d 697 (1968). In several cases, the Supreme Court of the United States has said that water rights implied because of the reserved rights doctrine are appurtenant to the federal lands actually set aside by Congress. See United States v. New Mexico, 438 U.S. 696, 698, 98 S.Ct. 3012, 3013, 57 L.Ed.2d 1052 (1978) (defining a federally implied reserved water right as one reserved for future use \"on appurtenant lands withdrawn from the public domain for specific federal purposes\"). See also Arizona v. California, supra; Cappaert v. United States, 426 U.S. 128, 96 S.Ct. 2062, 48 L.Ed.2d 523 (1976); Winters v. United States, supra.\n\nThe implied water right which is reserved is limited to that amount of water necessary to fulfill the purpose for which the land itself was reserved. Cappaert v. United States, supra. It should not matter what purpose the appurtenant rights were intended to accomplish, and the extinguishment of appurtenant water rights by implication should be as inevitable as the extinguishment of appurtenant hunting and fishing rights by implication. Once the Congress determines that the land previously set aside for some federal purpose no longer is required for that purpose, any appurtenant water rights reserved by implication no longer are necessary to accomplish the purpose initially intended. The issue to be resolved is whether the congressional action demonstrates that the land no longer is required for the purpose for which it originally was reserved. The appropriate inquiry then is whether congressional action manifests an intent that land previously set aside for the purpose of the Shoshone or Wind River Indian Reservation no longer was required to accomplish the purpose of an Indian homeland.\n\nThe Supreme Court of the United States in several cases has recognized the relevant considerations to be pursued in determining whether Congress intended to disestablish a portion of the land from an existing reservation. See e.g., Solem v. Bartlett, supra; Rosebud Sioux Tribe v. Kneip, supra; Ute Indian Tribe v. State of Utah, supra.\n\n\"* * * The underlying premise is that congressional intent will control. In determining this intent, we are cautioned to follow `the general rule that \"[d]oubtful expressions are to be resolved in favor of the weak and defenseless people who are the wards of the nation, dependent upon its protection and good faith.\"' The mere fact that a reservation has been open to settlement does not necessarily mean that the opened area has lost its reservation status. But the `general rule' does not command a determination that reservation status survives in the face of congressionally manifested intent to the contrary. In all cases, `the face of the Act,' the `surrounding circumstances,' and the `legislative history,' are to be examined with an eye toward determining what congressional intent was.\" (Citations omitted.) Rosebud Sioux Tribe v. Kneip, supra, 430 U.S. at 586-587, 97 S.Ct. at 1365. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nIn Rosebud Sioux Tribe v. Kneip, supra, the Supreme Court construed treaty language substantially similar to the language in the 1904 Agreement relating to the Wind River Indian Reservation. The Supreme Court said that such language is \"`precisely suited'\" to demonstrate an intent to disestablish a ceded portion of land from a reservation and creates \"an unmistakable baseline purpose of disestablishment.\" Rosebud Sioux Tribe v. Kneip, supra, 430 U.S. at 592, 597, 97 S.Ct. at 1366, 1368, quoting DeCoteau v. District County Court, 420 U.S. 425, 445, 95 S.Ct. 1082, 1093, 43 L.Ed.2d 300 (1975). It appears that the face of the act approving the 1904 Agreement demonstrates an intent to disestablish the ceded portion. That intent is substantiated by an examination of the legislative history. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nThe decisions of this court not only are consistent with the legislative history relating to the Wind River Indian Reservation but also are consistent with the conclusions of the Supreme Court of the United States in similar instances. \"The face of the act,\" the \"surrounding circumstances,\" and the \"legislative history\" all serve to manifest a congressional intent to disestablish the ceded portion of the Wind River Indian Reservation. It follows that the ceded portion has not been an Indian reservation, intended to supply an Indian homeland for the Shoshone and Arapahoe tribes since 1905. Under those circumstances, there is no justification for invoking the reserved rights doctrine with respect to those areas identified as practicably irrigable acreage on the ceded portion and including them in the quantification of water set aside for the Indian peoples. I would eliminate those lands from the formula in their entirety.\n\n\u003cspan class=\"fn\"\u003e1. An examination of the entire agreement, in light of prior events, discloses that any property outside the diminished reservation which remained under Indian ownership was limited to property which had been selected by individual Indians, under authority of the 1868 treaty and subsequent acts, and which was located on the portion to be ceded. It pertained to property which the individual Indian refused to exchange for a similar tract on the diminished reservation. Specific provision was made in Article I of the 1904 Agreement that: \"* * * [A]ny individual Indian, a member of the Shoshone or Arapahoe tribes, who has, under existing laws or treaty stipulations, selected a tract of land within the portion of said reservation hereby ceded, shall be entitled to have the same allotted and confirmed to him or her, and any Indian who has made or received an allotment of land within the ceded territory shall have the right to surrender such allotment and select other lands within the diminished reserve in lieu thereof at any time before the lands hereby ceded shall be open for entry.\" The legislative history demonstrates that the policy of the United States of America was to request all Indians to take allotments within the diminished reservation. It was believed that with the exception of 29 allottees, the Indian peoples would surrender their allotments on the lands which they had obtained under the 1868 treaty of Fort Bridger and \"* * * select other lands within the diminished reservation, where there is an abundance of good land for the purpose, and which can be more readily and inexpensively irrigated.\" H.R. Rep. No. 3700, 50th Cong., 3d Sess., pt. 1, at 19 (1905).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. This amendment was to Art. II of the 1904 Agreement to include a provision providing that one Asmus Boysen have a preferential choice of 640 acres in the ceded portion in exchange for any interest he had under a pre-existing mineral lease with the Shoshone and Arapahoe Indians on certain lands of the ceded portion. There was a dispute over this amendment because some members of the Indian Affairs Committee felt that Boysen's interest would terminate automatically with the passage of the Act. Section 13 of Boysen's lease did provide: \"`In the event of the extinguishment, with the consent of the Indians, of the Indian title to the lands covered by this lease, then and thereupon this lease and all rights thereunder shall terminate.'\" Quoted in H.R.Rep. No. 3700, 50th Cong., 3d Sess., pt. 2, at 3 (1905). The minority report contended that, because of the granting language of the agreement, Indian title would be extinguished, and Boysen's interest thereupon would disappear. Representative Lacey of Iowa had proposed the amendment to protect any interests that one of his constituents might have in Boysen's lease. Representative Lacey argued that the provision was necessary because under the Mondell Bill the Indian title would not be lost until five years after entry by settlers. He argued that the trust would be burdened if the lease were not canceled in accordance with the amendment. Ultimately, the House and the Senate concurred in this amendment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. The majority correctly perceive the 1896 Agreement, relating to the Thermopolis hot springs, as having divested the Indian peoples of any interest in the water rights to the portion of Wind River Indian Reservation ceded by that agreement. It is not clear why, having reached that conclusion, the 1891 Agreement, as approved by the Act of March 3, 1905, should lead to a different conclusion. The legislative history furnishes no hint that Congress might have perceived it was obtaining any lesser interest in the land under the 1904 Agreement than that which would have been obtained under the 1891 Agreement. The extensive debate on several provisions of the Act of March 3, 1905, coupled with the lack of any reference to the admission of an expressed cession of water rights under the Mondell Bill, indicates Congress did not perceive the provision as important. The reference to appertaining water rights, in the 1896 Agreement, should not be afforded any greater significance than that included in the October 2, 1891 Agreement, which also referred to appertaining water rights. The 1896 Agreement contained very similar language to the 1891 Agreement, and the 1891 Agreement substantially was implemented by the Act of March 3, 1905, which had very similar language to that included in the Rosebud Agreement. The Rosebud Agreement was debated extensively and passed by the House just prior to Representative Mondell's introduction of H.R. 13481, a bill \"to ratify and amend an agreement with the Indians residing on the Shoshone or Wind River Indian Reservation * * *.\" See 38 Cong.Rec., at 1423, 1643, 1899 and 2843 (1904). Certainly, a sale for a sum certain, provided for in the 1891 and 1896 Agreements but not provided for in H.R. 13481 or H.R. 17994, could not be controlling. Rosebud Sioux Tribe v. Kneip, 430 U.S. 584, 97 S.Ct. 1361, 51 L.Ed.2d 660 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. Applying a strict concept of title, fee title to Indian lands has been vested in the United States of America under the doctrine of discovery, with the Indian peoples retaining a right to possess and occupy that land. Their right of occupancy is good against all except the sovereign, who may terminate the right at will, although perhaps just compensation must be provided prior to termination. See Oneida Indian Nation of New York State v. Oneida County, New York, 414 U.S. 661, 94 S.Ct. 772, 39 L.Ed.2d 73 (1974); Shoshone Tribe of Indians v. United States, 299 U.S. 476, 57 S.Ct. 244, 81 L.Ed. 360 (1937). See generally F. Cohen, Handbook of Federal Indian Law, at 486-493 (1982); P. Maxfield, M. Dieterich \u0026 F. Trelease, Natural Resources Law on American Indian Lands, at 17-19 (1977).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The Indian peoples who participated in the negotiation with respect to the 1904 Agreement do not appear to have been weak and defenseless as suggested in the quoted language. James McLaughlin described George Terry as a mixed blood spokesman for the Shoshone Indians \"* * * whose gift of language and acquirements made him a man to be regarded with some respect.\" James McLaughlin, My Friend the Indian, at 296 (1910). George Terry spoke at the counsel meeting in April, 1904 and explained the Indian peoples' understanding of the 1904 Agreement. \"Major McLaughlin, our worthy agent, Ladies and Gentlemen: This is no little bargain we are entering into. It is not like selling a wagon, horse, or something of that nature, but it is something we are parting with forever, and can never recover again. These lands that we are about to dispose of have been our lands for ages. They have been our lands by inheritance for many, many years before the white man came this way. These same lands have been our lands by conquest. Our fathers fought with every nation that came near them and came off victorious, and from that date to this, they held this land as their own. These lands are our lands by treaty stipulations. We have given up vast tracts for this little tract of land called the Wind River Reservation. Now, we are glad our Arapahoe friends came in, and we will join hands with them and endeavor to pass a measure here that will follow the lines of this `Mondell bill.'\" Minutes of Council Meeting at the Wind River Reservation, April, 1904, Letters of Inspector James McLaughlin, Microfilm Roll 26 at 40. Concluding his remarks, Terry said: \"Now, Major, We all thank you very much for the feast, but we want it understood, that we do not give our consent to your agreement because you have filled us with beef, bacon, sugar, flour and coffee. It has gone upon record that all the white man has to do, to get the consent of the Indian to anything he desires, is to fill him up with what he likes. I want it to go on record, that notwithstanding the fact that we have been feasted, we have considered this bill in a sober and thoughtful manner, and for the benefit of every man, woman, and child on the reservation.\" Minutes of Council Meeting at the Wind River Reservation, April, 1904, Letters of McLaughlin, supra, Microfilm Roll 26 at 43. Of course, the understanding of the Indian peoples is relevant only to the extent that it explains Congressional intent because the actions of Congress in diminishing an Indian reservation do not depend on consent of the Indians. Rosebud Sioux Tribe v. Kneip, 430 U.S. 584, 97 S.Ct. 1361, 51 L.Ed.2d 660 (1977); Lone Wolf v. Hitchcock, 187 U.S. 553, 23 S.Ct. 216, 47 L.Ed.2d 299 (1903).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The dissenting opinion in Rosebud Sioux Tribe v. Kneip, 430 U.S. 584, 97 S.Ct. 1361, 51 L.Ed.2d 660 (1977), notes that the manner of payment was not approved by the required majority of the Indians. This resulted in concerns by the dissenting justices as to compliance with the legal meaning of the word \"cede.\" In the case of the 1904 Agreement as to the Wind River Reservation, the manner of payment expressly was discussed with the Indian representatives from the Wind River Reservation, and they agreed to it. While the special master decided that Rosebud Sioux Tribe v. Kneip, supra, is distinguishable because the word \"convey\" was omitted in Article I of the 1904 Agreement, that conclusion fails to acknowledge the inclusion of the word \"convey\" in Article II, which refers back to Article I and, in my judgment, places undue emphasis on the omission of the word in Article I. HANSCUM, District Judge, dissenting. I join in the dissent. Specifically, I would agree with the dissent's proposed holding that the implied reservation of water rights attaching to an Indian reservation should assume any use that is appropriate to the Indian homeland as it progresses and develops. I depart, however, when Justice Thomas proposes to limit water use to the territorial boundaries of the reservation, thus precluding marketability of the water. Justice Thomas would hold that, as a matter of law, marketing water off the reservation never could be appropriate to the progress and development of the Indian homeland. I disagree. I would go that additional step. I would hold that sale of water off the reservation should be permitted, provided that, as a factual matter, it could be demonstrated that such marketing contributed to the progress and development of the Indian homeland. I can envision a variety of scenarios where such showing could be made successfully. To preclude the opportunity of proving such a nexus unduly would restrict and hamper the prospective development of the Indian homeland in the future.\u003c/span\u003e\n\n",
    "body_length": 210108,
    "citedas": [
      "753 P.2d 76"
    ],
    "attorneys": "Joseph B. Meyer, Atty. Gen., S. Jane Caton, Asst. Atty. Gen., Steven F. Freudenthal, Sp. Asst. Atty. Gen., with Freudenthal, Freudenthal, Salzburg, Bonds \u0026 Rideout, Cheyenne, Houston G. Williams, Sp. Asst. Atty. Gen., with Williams, Porter, Day \u0026 Neville, Casper, Michael D. White and David F. Jankowski, Sp. Asst. Attys. Gen., with White and Jankowski, Denver, Colo., and Randall T. Cox, Sp. Asst. Atty. Gen., with Omohundro and Palmerlee, Buffalo, for State of Wyo. Argument presented by Michael D. White, for Type 1 and 2 Claims, and Randall T. Cox for Type 1, 2 and 3 Claims, also present at counsel table were A.G. McClintock, Wyoming Atty. Gen., and S. Jane Caton, Asst. Atty. General. Ruth Clare Yonkee, Thermopolis, for Red Lane Watershed Imp. Dist., Town of East Thermopolis. C. Edward Webster, II, Cody, for Owl Creek Irr. Dist. Donald P. White of White \u0026 White, Riverton, for City of Riverton, Midvale Irr. Dist. and Riverton Irr. Dist. Kenneth Guido, Jr., Washington, D.C., for Shoshone Tribe. W. Richard West, Jr. and Susan M. Williams of Fried, Frank, Harris, Shriver \u0026 Jacobson, Washington, D.C., and B. Kevin Gover and Susan M. Williams of Gover, Williams \u0026 Stetson, Albuquerque, N.M., and Thomas W. Fredericks, Dale T. White, and Robert S. Pelcyger of Fredericks \u0026 Pelcyger, Boulder, Colo., and William J. Thomson and W. Perry Dray of Dray, Madison \u0026 Thomson, Cheyenne, for Shoshone and Northern Arapahoe Tribes. Michael S. Messenger of Messenger \u0026 Jurovich, Thermopolis, for Landis Webber and Barbara Webber, individually and on behalf of Red Creek Cattle Co. Bertha Jones and Grace Graboski. F. Henry Habicht II, Asst. Atty. Gen. and James J. Clear, Dept. of Justice, Washington, D.C., for U.S. Sky D Phifer of Phifer \u0026 Phifer, Lander, for Albert Hornecker and Hornecker Livestock Co., Inc. Donald Bath and DHB \u0026 Co., and PLB \u0026 Co., Bradford Bath, Griffin Brothers, Inc., Ralph Floyd Urbigkit, Charles Richardson and Richard and Elsie Martin. Ross D. Copenhaver of Copenhaver, Kahl \u0026 Kath, Powell, for Willwood Irr. Dist. and Deaver Irr. Dist. Oral argument presented by Robert S. Pelcyger for Arapahoe Tribes, Type 1, 2, and 3 Claims; C. Edward Webster II for Owl Creek Irr. Dist., Type 2 Claims; Donald P. White for private parties City of Riverton, et al., Type 1 Claims; James J. Clear for U.S., Type 1 and 2 Claims; Michael S. Messenger for private parties Type 3 Claims; Sky D Phifer for Hornecker, et al., Type 3 Claims; also present at counsel table were Ruth Clare Yonkee; Dale T. White; Thomas W. Fredericks; David F. Jankowski; and B. Kevin Gover, Arthur Lazarus, Jr., and W. Richard West, Jr., for the Shoshone Tribes.",
    "category": [
      "243",
      "213"
    ],
    "judges": "BEFORE BROWN, C.J., AND THOMAS, CARDINE, AND MACY, JJ., AND HANSCUM, DISTRICT JUDGE.",
    "citation_count": 3
  }
}
