{
  "id": "NaWQSGYBTlTomsSBJcRu",
  "document": {
    "title": "08/29/90 H.R. APPELLANT.",
    "full_title": "H.R. . (IN THE MATTER OF BABY BOY C.)",
    "jurisdiction": "District of Columbia Court of Appeals",
    "date": "1990-08-29T00:00:00.000Z",
    "docket": "No. 86-1426",
    "body": "In this appeal from an order of adoption, this court addresses the question whether H.R., a natural father who seeks custody of his child, grasped his \"opportunity interest\" in developing a relationship with his child, and, if so, whether the trial Judge applied the correct standard in concluding that Baby Boy C.'s best interest called for his adoption by the O. family over H.R.'s objection.\n\nLehr v. Robertson, 463 U.S. 248, 103 S. Ct. 2985, 77 L. Ed. 2d 614 (1983), recognizes that a non-custodial father has a constitutionally protected \"opportunity interest\" in developing a relationship with his child. The Division agrees that the statutory best interest of the child standard must be applied in determining whether to grant a petition for adoption filed by unrelated persons, that the statute incorporates into the best interest standard a preference for a fit unwed father who has grasped his opportunity interest, and that this preference can be overridden only by a showing by clear and convincing evidence that it is in the best interest of the child to be placed with unrelated persons. Because the best interest standard, as applied by the trial court, did not incorporate such a parental preference, a majority concludes that a remand is required to apply the best interest standard as properly formulated. The Dissenting Judge would affirm the trial Judge's ruling that H.R. did not grasp his \"opportunity interest\" and would hold that reversal and remand are inappropriate in any event because of the trial Judge's determination concerning the effect that transfer from the adoptive parents would have upon the child.\n\nFERREN, Associate Judge: This case concerns the constitutional and statutory rights of an unwed father, appellant H.R., a citizen of Zaire who has been seeking custody of his infant (now seven-year-old) son, Baby Boy C. The child's mother, L.C., is a United States citizen who conceived the child while serving as a Peace Corps volunteer in Zaire. She returned to the United States and, ten days after the child was born in August 1983, relinquished her own parental rights to the Barker Foundation, a licensed child placement agency in the District of Columbia, to facilitate adoption of the child. In September 1983, Barker placed the child with adoptive parents, Mr. and Mrs. O., who, the same day, filed a petition for adoption in Superior Court. Although, upon leaving Zaire, L.C. had told H.R. she was pregnant, a mutual friend told H.R. in July that L.C. had had an abortion. H.R. was not aware that he had a son until sometime in October 1983, when L.C. informed H.R. that they had a child which she had placed for adoption. At this time, however, L.C. did not inform H.R. that he had rights concerning the child, even when he expressed his intent to assume custody of the child himself. Similarly, although the Barker Foundation sent H.R. two letters seeking his consent to adoption, the agency never informed him of his right to seek legal custody, or of Barker's role in the adoption process, or of the pending legal proceeding. In fact, for eighteen months, from October 1983 to April 1985, H.R. received no notice, official or otherwise, that a judicial proceeding had been initiated that could cut off all his legal rights to his child, despite the fact that throughout this period he was in contact intermittently with L.C. and with Barker, asking for information about his legal rights and manifesting a desire to take custody of his son. It was not until April 1985, after the trial court had issued an interlocutory decree of adoption and Baby Boy C. was 20 months old, that H.R. finally received notice of the court proceeding in the form of an order to show cause why a final adoption decree should not be granted to Mr. and Mrs. O., coupled with an order for H.R. to appear before the court in June 1985 to provide testimony on the issue. After several hearings on the petition held in June 1985 and over the next eleven months, the trial court granted the petition of Mr. and Mrs. O. to adopt Baby Boy C. as being \"in the best interests of the child.\"\n\nH.R. contends the adoption proceedings which granted custody of Baby Boy C. to the O. family (1) violated his statutory and constitutional rights to immediate, adequate notice of the adoption proceedings, including due diligence to assure he received notice, and (2) applied the wrong test by ordering the adoption in \"the best interests of the child\" without granting him a custodial preference as a natural parent, absent a showing of unfitness. He therefore urges us to remand this case for application of a \"fitness\" test whereby H.R. would assume custody of Baby Boy C. unless the court found him unfit to be a parent.\n\nI conclude that H.R.'s constitutional and statutory rights have been violated and that the court applied the wrong legal test in granting the adoption. I further conclude that when an unwed, non-custodial father has not abandoned his \"opportunity interest\" in developing a relationship with his child, the Constitution mandates that we construe our \"best interests\" standard under the adoption statute to include a custodial preference for a \"fit\" parent. In this case, I conclude as a matter of law that, because of unlawful state action, H.R. cannot be said to have abandoned his \"opportunity interest.\" Under the circumstances, therefore, the court should have awarded custody to H.R. if found \"fit\" to be a parent, unless clear and convincing evidence demonstrated that such custody would have been detrimental to the \"best interest\" of Baby Boy C. Because the trial court incorrectly applied a more traditional \"best interest\" test that did not begin with a presumption of custody for a \"fit\" natural parent, and because we, as an appellate court, cannot properly apply the correct test on this record, we vacate the judgment and remand the case for further proceedings.\n\nI. FACTS AND PROCEEDINGS\n\nA. Case History\n\nBaby Boy C.'s mother, L.C., met H.R. in the village in Zaire where she was teaching. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e At the time, appellant was on leave from his law studies at the university in Kinshasa, Zaire. In April 1983, when L.C. learned she was pregnant, the Peace Corps immediately evacuated her to Washington, D.C. Upon her departure, L.C. wrote a letter to H.R. informing him that she was pregnant and that he was the father. She hinted that she planned to have an abortion, saying that what she would have to go through in the United States would exhaust her physically and emotionally and that she would return to Zaire in two weeks. She also said that she did not want anyone to know about the matter. L.C. never went back to Zaire. In July, a mutual friend of L.C. and H.R. told H.R. that L.C. had had an abortion in Washington, D.C. In fact, however, L.C. gave birth to Baby Boy C. in the District on August 5, 1983. Ten days later, L.C. relinquished her parental rights to the Barker Foundation.\n\nIn early August 1983, when he was visiting the dean's office at the University of Kinshasa from which he had graduated in June, H.R. happened upon a letter from the Barker Foundation postmarked over two months earlier in May. The letter notified him that L.C. was expecting to give birth to a child in July. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Along with its letter, Barker sent three forms: an \"Admission of Paternity and Consent to Adoption\" form, a \"Statement of Non-Paternity and Consent to Adoption\" form, and a biographical data form. Neither the letter nor the accompanying forms indicated that H.R. had the right not to consent to the adoption and the right to seek custody of his child himself. Upon receiving this information, H.R. immediately wrote a letter to L.C. in care of her parents, in order to ascertain what in fact had occurred over the past several months. L.C. received this letter in mid-September, after she had left Washington to attend graduate school in Chicago. Because she was unsure of H.R.'s whereabouts and afraid that her letter might be intercepted and read by his relatives, L.C. answered the letter without mentioning the birth of Baby Boy C. or the plans for adoption. L.C., however, gave H.R. a telephone number where she could be reached. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nOn September 22, 1983, the Barker Foundation placed Baby Boy C. with the O. family. On the same day, the O. family filed a petition for adoption in Superior Court. No notice was sent to inform H.R. of a formal adoption proceeding seeking to terminate his parental rights to Baby Boy C. in favor of a new adoptive family. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e On September 29, 1983, the court issued an order of reference, directing Barker to investigate the truth of the allegations contained in the petition for the purpose of determining whether Baby Boy C. was \"a proper subject for adoption and if the home of the petitioners is a suitable one\" and to file a report in ninety days.\n\nIn October 1983, after receiving L.C.'s response to his letter in which she had acknowledged receiving his letter but had not mentioned a baby, H.R. called her and learned for the first time that he had a son. According to L.C.'s testimony at the eventual hearings in this case, H.R. did not have a good understanding of United States adoption procedures and thought that L.C. had abandoned the child. Both in this conversation and in one that followed in the same week, she said, L. C. informed H.R. that she had given up her parental rights to the child, that Baby Boy C. had been placed in a loving home where he was being well cared for, and that they would never be able to see the child again. L.C. also urged H.R. to send his autobiographical information to the Barker Foundation. According to H.R.'s testimony at the same hearings, however, he asked L.C. to send the baby to him in Zaire, but L.C. had responded that, although she had considered sending him the child, she had decided against it. In November, believing that H.R. did not really comprehend the adoption process, L.C. wrote H.R. another letter, describing her sense of loss in giving up their child but stating her belief that Baby Boy C. was \"at home\" and loved by his adoptive parents and older brother. According to H.R., he responded by informing L.C. of his opposition to the adoption and offering to take the baby if she did not want to raise him herself. He further testified that he had difficulty grasping the idea that L.C. had really given up all her rights to the child.\n\nIn December 1983, in compliance with the court's order of reference, Barker submitted its report to the trial court and its formal consent to the adoption petition. Barker recommended entry of an interlocutory decree of adoption. In the report, Barker indicated that it had been unable to contact H.R., who had a statutory right to notification of, and presence at, a hearing on the adoption petition. Barker added that it had tried to reach H.R. at the university at Kinshasa but had received no response to its letter. Alice Avery, the Barker social worker responsible for the Baby Boy C. case, testified at the hearing that, although she had told the court she did not know H.R.'s whereabouts, Barker had not contacted L.C. to ask if she had heard from H.R. Nor, said Avery, had the agency attempted to contact H.R. or to update his address since mailing the consent forms to the university seven months earlier. Although the report provided the names of H.R.'s many siblings in Zaire, Avery testified that she had not pressed L.C. to provide their addresses because L.C. preferred the university address for reasons of confidentiality. Avery also testified that the report did not tell the court that L.C. had other possible addresses for H.R. Baby Boy C. was now four months old.\n\nOn January 17, 1984, H.R. called the Barker Foundation, having received a Christmas card from L.C. in which she had expressed her growing emotional distance from the adoption and noted what a wonderful gift (a son) the O. family had received for Christmas that year. Telephone communication was difficult; H.R., a native French speaker who understands some English, speaks French almost exclusively. Because Avery, the Barker social worker, did not speak French, one of Barker's secretaries who knew some French spoke with H.R. and recorded notes of the conversation. According to these notes, H.R. acknowledged his paternity. H.R. also requested clarification of the forms he had received in August and indicated that he did not understand the portion of the documents requiring him to give up his rights, particularly his right to see his son. H.R. told the secretary that the mails in Zaire were very bad and that he would be more likely to receive correspondence addressed to him in care of the Peace Corps in Zaire, an address Barker could obtain from L.C. According to the secretary's notes, H.R. also told her that he was expecting, shortly, to take a trip to France or to Canada during which he hoped to come to the United States to see his child. At no time during this conversation did Barker communicate to H.R. that he had a right to seek custody of his son, that a formal adoption proceeding had been instituted in which he had a right to contest his child's adoption, or that Barker had just recommended entry of an interlocutory decree of adoption in favor of the O. family.\n\nTwo days later, on January 19, 1984, Avery received a letter of January 12, 1984, from L.C. stating that she had recently received a letter from H.R., that H.R. did not consent to the adoption, that he would ask for the baby as soon as possible, and that he planned to be studying in Canada in March and might come to Chicago or Washington at that time. In this letter, L.C. expressed strong opposition to H.R.'s gaining custody of the baby. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e\n\nOn January 25, 1984, Judge Schwelb denied the petition for an interlocutory decree of adoption, noting his concern \"that all reasonable steps have not been taken to contact [H.R.].\" The Judge observed that Barker's December report listed many of H.R.'s siblings, thereby suggesting \"it would probably not be difficult to contact him.\" The Judge stated that the court should not entertain the petition for adoption until proof was offered that \"all reasonable steps to locate H.R. had been exhausted.\" According to Judge Schwelb, \"an Order to Show Cause directed to his last known address, without further reasonable inquiry into his present whereabouts, will not be sufficient.\" (Emphasis in original.)\n\nBarker filed an addendum to its January report on February 1, 1984, informing the court of H.R.'s January 17 telephone call, his willingness to acknowledge paternity, his lack of clarity about the documents he received, particularly those pertaining to giving up his legal rights, and suggesting that he could be contacted in care of the Peace Corps in Kinshasha, Zaire, an address which L.C. could provide. The agency also summarized the letter it had received from L.C. reporting that H.R. desired custody of Baby Boy C. as soon as possible, that he had marked \"no\" on the consent forms, and that he planned to come to Canada in March. The addendum did not inform the court that H.R. had directly informed Barker in the January 17 telephone conversation that he might be travelling in France or Canada and that he hoped to come to the District of Columbia to see the baby. The report also failed to mention that H.R. had told Barker that mail delivery in Zaire was terrible, a fact suggesting, perhaps, an alternative form of service of process would be better.\n\nOn February 6, 1984, Barker sent H.R. a letter, translated into French, in which it purported to clarify the documents it had sent him. The letter was sent by Worldwide Courier to H.R. in care of the Peace Corps in Zaire. It stated in relevant part:\n\nFollowing your telephone call of January 17, 1984, I would like to try to explain to you the documents that we have sent you. These documents explain the adoption procedure.\n\nLegally, adoption in the United States must conform to strict procedures administered by the Courts, following which the child takes the name of his adoptive parents and enjoys the same rights and privileges and status as their own children. The laws concerning adoption protect the rights of the child, of the biological parents, and of the adoptive parents. After [L.C.] signed the documents giving up her rights as a parent, all responsibility for the child was transferred to the adoptive parents at the moment in which the child was placed with them.\n\nMoreover, the law requires that an effort be made in good faith to inform the biological father of the plans for adoption. The documents that were sent to you in May 1983 and the letters from [L.C.] informed you of this. The letter that you received from the Barker Foundation requires your cooperation by requesting you to sign the documents of consentment to the adoption and to supply particulars that can be imparted to the adoptive parents and eventually to your child.\n\nI can well imagine that you found this very painful and we wish to help you in this matter in a way that is satisfactory for you. At the same time, we hope not to have to bring up again the matter of the adoption by this excellent family and who, according to [L.C.] and the adoption agency, meets the best interests of the child.\n\nDo not hesitate to get in touch with us regarding this matter. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nAgain, Barker did not mention that H.R. had a legal right to seek custody or that Barker was a party to formal adoption proceedings seeking to terminate H.R.'s parental rights in favor of the O. family. Nor did Barker provide any information about that proceeding. The letter also did not inform H.R. that Barker was gathering information for the court, including information ascertained in its communications with H.R., for the court's use in determining Baby Boy C.'s best interests. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nOn March 5, 1984, Barker filed with the court another addendum to its December report, stating that it had sent H.R. a letter \"informing him of the placement, the agency's work with [L.C.] and his rights as the putative father of the child.\" (Emphasis added). The addendum also related the substance of L.C.'s February telephone conversation with H.R. in which he had told her that he could not accept the all-or-nothing nature of adoption (which would not allow him to see his child) and that he intended to seek custody for himself. The report noted that L.C. was satisfied that Baby Boy C.'s placement with the O. family was in his best interests and \"that she is willing to assist in any way she is able to prevent the placement from being disrupted.\" After this addendum was received, internal court memoranda suggest that the court considered but did not issue an order to show cause why the adoption should not be granted. According to testimony and exhibits presented at the hearing, such a show cause order has been the vehicle through which the court gives notice to interested parties in a contested adoption case or when consent to adoption has not been obtained. Baby Boy C. was now seven months old.\n\nIn late April 1984, H.R.'s government sent him to Paris, France, to obtain a doctorate in international law, rather than to Canada as he had expected. H.R. and his wife, whom he had married in December 1983, telephoned L.C. twice in early May 1984 to inform her of their current situation. Appellant testified that during these conversations he asked L.C. to inform the Barker Foundation that he intended to come to the United States to take custody of Baby Boy C. when he had saved enough money. At the hearings, H.R. and L.C. had different recollections of this conversation. L.C. testified that H.R. told her he would consent to the adoption, and she passed this information on to Barker in a May 8, 1984 letter. H.R. testified that he had expressed his absolute opposition to the adoption but had said that he would consider sending in the biographical data form to Barker. Although appellant had given L.C. his Paris address during their telephone conversations, L.C. did not provide this address to Barker.\n\nOn May 22, 1984, Barker filed L.C.'s May 8 letter with the court, along with her letter of January 12 and an affidavit of Avery, stating that appellant was planning to sign the consent forms. The affidavit gave appellant's address as the Peace Corps in Zaire, even though H.R. had indicated in January that he might be moving to France and L.C. had informed Barker that H.R. in fact had just written to her from France. In June, L.C. wrote to H.R., stating that she did not want to hear from him again and sending him photographs of Baby Boy C. taken at birth. The baby was now ten months old.\n\nOn July 23, 1984, the court ordered Barker to translate a show cause order into French, ordering H.R. to appear in court on October 15, 1984, \"to show cause . . . why an order should not be made granting the petition for adoption.\" Although, at this point, H.R. had received no notice that an adoption petition had been filed, the order commented that H.R. had \"not initiated any action to either formally consent or to oppose the adoption.\" The order was sent to H.R. on August 15, 1984, by registered mail in care of the Peace Corps in Zaire. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Although Barker had not communicated directly with H.R. since January and had received intervening information indicating that he was in regular contact with L.C. -- who had just reported him to be in Paris -- no effort was made to ascertain H.R.'s current whereabouts. This was true despite the fact that Judge Schwelb's order in January denying the interlocutory decree of adoption had stated that the Order to Show Cause should not be issued unless specific inquiries were made as to H.R.'s current address. Neither the receipt nor the Order to Show Cause was returned to the court. H.R., who was living in Paris at the time the letter was mailed, testified that he did not receive it. Baby Boy C. was now one year old.\n\nOn October 15, 1984, Judge Riley entered an interlocutory decree of adoption in favor of the O. family, to become final on April 15, 1985, unless set aside for good cause shown. The order declared, among other things, that H.R. was withholding his consent to the adoption contrary to the best interests of the child. H.R., who had never received notice of the judicial adoption proceeding, was not present at the show cause hearing. According to H.R.'s later testimony, after three months of attempting unsuccessfully to gain assistance at the United States embassy, he finally met an official there who referred him to an American lawyer working in Paris. On November 30, 1984, on the advice of his attorney, H.R. formally acknowledged paternity in writing and filed it with his attorney. After his attorney had advised him that Barker was a legal adversary whom he must inform of his intention to seek custody in order to protect his legal rights, H.R. wrote a letter informing Barker that if it was not going to permit him the right to visit the child or to make decisions about the baby's future, H.R. was ready to assume custody of his child. H.R. also provided his Paris address. Although H.R. mailed this letter on December 1, 1984, Barker did not receive it until February 6, 1985. Barker filed a translation of this letter with the court but did not respond to it.\n\nOn February 25, 1985, appellant wrote Barker again, advising that he had retained an attorney and had admitted paternity. On the advice of his attorney, he asked Barker to inform the court that he did not intend to abandon his child. He stated that he would like to gain custody of his child by Baby Boy C.'s second birthday. He proposed that, once he gained custody, the O. family be allowed visitation rights during vacations. Barker received this letter on March 3, 1985, and filed it with the court on March 11, along with a translation. Again, Barker did not respond to H.R.'s letter. On April 5, Barker filed a final report, recommending entry of a final decree of adoption by the O. family.\n\nOn the basis of H.R.'s December 1, 1984, and February 25, 1985, letters to Barker, in which he expressed a refusal to consent to the adoption and indicated he had retained legal counsel, on March 21, 1985, Judge Riley issued an order to show cause as to whether the interlocutory decree of adoption should be set aside for good cause shown. On April 15, 1985, after considering the brief of the O. family and the Barker Foundation, Judge Riley ordered the interlocutory decree of adoption extended until June 30, 1985. The court also ordered H.R., through counsel, to file pleadings giving evidence as to why adoption of Baby Boy C. would not be in the child's best interests and to appear before the court before June 30, 1985 to give testimony on the issue. This order, served on H.R. at his Paris address, as well as on his attorney, was the first communication he had received informing him of the adoption proceeding against him. Baby Boy C. was 20 months old at this time.\n\nB. June 1985 Hearing\n\nOn June 28, 1985, H.R. appeared before the Family Division of Superior Court and moved to set aside the interlocutory decree of adoption. Hearings before Judge Riley began that day and were held on five other occasions throughout the next ten and one-half months. After an initial four-month delay to accommodate H.R., further hearing dates were again delayed for seven months to accommodate the court's schedule. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e Testimony was taken from H.R., L.C., the O. family, Avery, a former Peace Corps volunteer who knew L.C. and H.R., Dr. Allen E. Marans, an expert for the O. family qualified in child psychiatry, child-psychoanalysis, child development and adoption, and Dr. Joseph D. Noshpitz, an expert for H.R. qualified in child psychiatry but not qualified as an expert in adoption. Deposition testimony of H.R. and his wife was also admitted.\n\nDr. Marans, testifying in July 1985 on behalf of the O. family, had met with Baby Boy C., both adoptive parents, and Baby Boy C.'s older adoptive brother on several occasions during late June and early July 1985, both at his office and in the family home. Dr. Marans described Baby Boy C. as a happy, healthy, normal three-year-old child, fully integrated into the O. family. He said that the O. parents were emotionally stable, exceptionally sensitive parents, who were slightly overprotective of Baby Boy C. Concerning the effects of removing Baby Boy C. from the O. family, Dr. Marans stated that, although a child at three days or six weeks of age would suffer no permanent scar from a change in custody, such a change would be \"devastating\" to a child of 23 months, the age of Baby Boy C. at the time Dr. Marans testified. He described the period of life between one and one-half and two years as the rapprochement period, a critical time of integration when the child reaches a stage of separation and independence from the parents. Although the child is able to view other persons as separate individuals, the child can become quite frightened in realizing that the parents are not nearby. The effect is devastating if the parent does not return to remind the child of his or her past security. Dr. Marans testified that a child of 23 months would not be able to accept the natural father as a substitute for the only parents the child had known. He also testified that if the child were removed from the family at three years of age, the effect still would be devastating, but different, since three-year-olds are in the process of character development. Dr. Marans believed that Baby Boy C. had developed very strong ties to his adoptive parents and older brother.\n\nDr. Noshpitz met with Baby Boy C., his adoptive parents, and brother and with H.R. and his wife sometime after Dr. Marans did. Dr. Noshpitz testified in May 1986 when Baby Boy C. was three months shy of three years old. Like Dr. Marans, Dr. Noshpitz also testified that the O.s were warm and loving parents deeply attached to Baby Boy C. He also testified that Mr. and Mrs. R. were a devoted couple who could provide a loving home for Baby Boy C. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Concerning a transfer of custody, Dr. Noshpitz agreed with Dr. Marans that a transition in custody is more effective the earlier it takes place. He was concerned, however, that Baby Boy C. would suffer feelings of wonder and anger at a later stage when he learned that he was adopted and that his natural father had sought, but been denied, custody. Dr. Noshpitz advocated a period of transition over several years, during which H.R. and his wife would gradually assume custody. Dr. Noshpitz, agreeing with Dr. Marans, recommended against an immediate order transferring custody of Baby Boy C. to H.R. and his wife, stating that such transfer \"would create great turmoil and great pain\" and would have \"long-range, very traumatic effects\" on the child's future development.\n\nDr. Marans testified in rebuttal that an arrangement of the sort proposed by Dr. Noshpitz was naive because it ignored the negative psychological effects such a plan would have on the child's security and identity. He agreed that Baby Boy C. would experience anger and resentment at learning that his natural father had sought to raise him, but he opined that the experience would not destroy the boy's personality. Dr. Marans further testified that Dr. Noshpitz's proposal was imaginative but completely untried and ignored the strength of the child's attachment to those who nurture him. Dr. Marans stated that the gradual transfer plan would create an everlasting sense of insecurity in Baby Boy C. and undermine his ability to trust in others.\n\nC. Trial Court Decision\n\nIn Proposed Findings of Fact and Conclusions of Law submitted to the trial court after completion of the hearings, H.R. argued that the Barker Foundation and the O. family had violated the District of Columbia adoption statute by not providing H.R. with immediate notice of the filing of the adoption petition. H.R. also argued that Barker and the O. family had deprived him of due process of law by failing to inform him of his legal right to seek custody of Baby Boy C. and by failing diligently to ascertain H.R.'s whereabouts for purposes of serving him with the adoption petition. H.R. contended that, by failing to receive notice of the official adoption proceeding, he was precluded from coming forward to assert his constitutionally protected liberty interest in developing a relationship with his son before the baby had developed a relationship with the O. family. See Lehr v. Robertson, 463 U.S. 248, 103 S. Ct. 2985, 77 L. Ed. 2d 614 (1983). H.R. then argued that he was entitled to custody of Baby Boy C. because he was fit to serve as his father; a best interests-of-the-child standard should not be applied, he said, because it failed to recognize his liberty interest in a relationship with his child -- something that the O. parents did not have. According to H.R., the application of a best interests analysis would encourage adoption agencies to thwart a natural father's statutory and constitutional rights to notice and to deprive him of an opportunity to be heard at a meaningful time and in a meaningful manner. Under that analysis, he said, in the end the child's relationship with the adoptive parents would always enable those parents to prevail, without regard to the natural father's interests. H.R. argued, finally, that even if a best interests standard were applied, it would be more harmful to Baby Boy C. in the long run to be cut off from his natural father.\n\nIn its decision issued on September 11, 1986, the trial court rejected H.R.'s due process arguments. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The court concluded that H.R. had received all the constitutional protection he was due under Supreme Court jurisprudence. According to the court, \"the efforts of Barker Foundation to contact [H.R.] far exceeded the procedural protections upheld in Lehr.\" Even accepting H.R.'s argument under Lehr that natural fathers possess a so-called \"opportunity interest\" in developing a relationship with their children, the court concluded that H.R. had failed to grasp that opportunity and was himself responsible for some of the delay in receiving official notice of the adoption because he had failed to keep Barker informed of his changes of address. The court stated that H.R. had received a full and fair opportunity to present whatever arguments he had in support of his position that the adoption petition should be denied. The court concluded, moreover, that Barker had no obligation to inform H.R. of his legal rights. Finding lawful and appropriate -- and applying -- the \"best interests of the child\" standard, the trial court credited Dr. Marans' testimony over that of Dr. Noshpitz, who, according to the court, was not an expert in adoption and who admitted that his proposal for custody was untried and without precedent in adoption situations. The court concluded that the \"devastating\" effect of removing Baby Boy C. from the O. family \"could not be removed by the experimental and unprecedented gradual transition and custody that Dr. Noshpitz proposed.\" The court granted the petition for adoption by the O. family, finding by clear and convincing evidence, see In re J.S.R., 374 A.2d 860, 864 (D.C. 1977), that this was in the best interests of Baby Boy C.\n\nII. OUTLINE OF OPINION\n\nDistrict of Columbia law governing custody of minor children has developed somewhat haphazardly since 1897. Significant amendments to the adoption and Family Division statutes in the 1970's, however, make statutory resolution of the present case at best a guess. These legal developments -- covered next in Part III. -- comprise an important background for understanding the claim of an unwed, non-custodial father, such as H.R., to custody of his child. Under the guardianship statute, D.C. Code § 21-101 (1989), there has long been a presumption favoring a natural parent's custody of a minor child, absent a showing of parental unfitness, when another adult or the welfare authorities have sought custody. In other contexts, however, courts have kept the parent on an equal footing with other would-be custodians and have decided custody in the \"best interests of the child\". They have done so, for example, under the adoption statute, id. §§ 16-304 (e), -309 (b)(3), the neglect statute, id. § 16-2320 (a), and the statute governing termination of parental rights, id. §§ 16-2353, -2359 (f) (1989). In considering the rights of an unwed, non-custodial father confronted by strangers seeking adoption of his child upon its surrender by the mother at birth, a court confronts a question without a discernible answer: whether, under the adoption statute, the child's \"best interests\" should be defined by reference to the parental preference favoring the father under the guardianship statute, or should be resolved by considering the father's and the adoptive parents' respective claims without giving priority to either. I believe that any statutory analysis would yield an arbitrary result derived either from selection of statutory canons of construction or from the court's own policy views. Such a result can be avoided by focusing on constitutional considerations which the Supreme Court has imposed on the analysis.\n\nBeginning in the early 1970's and extending into the 1980's, the Supreme Court has issued significant constitutional decisions bearing on an unwed father's rights. This important legal chapter is analyzed in Part IV. Here I conclude that, despite the absence of a substantive statutory right, the unwed father has a substantive, constitutionally protected liberty interest under the fifth amendment -- now commonly called an \"opportunity interest\" -- in gaining custody of his child.\n\nPart V. considers whether appellant H.R.'s \"opportunity interest\" is still intact. I conclude that it is. State action, violating H.R.'s right to procedural due process under the fifth amendment, has interfered with H.R.'s early assertion of his claim -- his \"opportunity\" -- for custody of Baby Boy C. This interference tolled the running of the period within which H.R. had to make a timely assertion of his interest in custody.\n\nFinally, in Part VI., I consider how to apply the father's \"opportunity\" interest in a contested adoption proceeding. I conclude that when, as here, an unwed, non-custodial father has not lost his \"opportunity interest,\" the Constitution entitles him, if found fit to be a parent, to the benefit of a preference of the sort long established under the guardianship statute, D.C. Code § 21-101 (1989), i.e., to a custodial preference over would-be adoptive parents unless the court finds by clear and convincing evidence that the father's custody would be detrimental to the best interests of the child. I trace our local caselaw in this area, much of which comprises constitutional rulings in the late 1970's, and conclude that, while our decisions routinely have applied a \"best interests\" test without a parental preference, none is directly on point and none would preclude the result reached here. As a consequence, because the trial court applied a traditional \"best interests\" balancing test, not a \"fitness\" test with its parental preference, we must reverse and remand for further proceedings.\n\nIII. DISTRICT OF COLUMBIA STATUTORY AND COMMON LAW\n\nIn cases contesting child custody, the courts of this jurisdiction have issued two lines of decisions which we occasionally have said may be difficult to reconcile: (1) those awarding custody to the natural parent absent a showing of unfitness (a \"fitness\" test), and (2) others permitting termination of parental rights in the \"best interests of the child\" without a required showing of parental unfitness (a \"best interests\" test). \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Analysis of these cases shows they do not clearly reveal an answer to the claim to custody by an unwed, non-custodial father when the mother surrenders their child at birth for adoption by strangers.\n\nA. Statutory and Common Law Through 1976\n\nIn this jurisdiction, the awarding of custody in the \"best interest\" of the child as the \"paramount\" consideration originated in Wells v. Wells, 11 App. D.C. 392, 395 (1897), a case in which each divorcing spouse, as a natural parent, had an equal claim to custody. See also Seeley v. Seeley, 30 App. D.C. 191, 193 (1907) (same), cert. denied, 209 U.S. 544, 28 S. Ct. 570, 52 L. Ed. 919 (1908). Five years after Wells, in a case where the father of eleven-year-old twins died and their mother remarried -- and the children's maternal grandmother and aunt sought custody -- the court, citing Wells, acknowledged once again that the \"paramount consideration\" was the \"permanent advantage and welfare of the children.\" Beall v. Bibb, 19 App. D.C. 311, 313 (1902). But, to that end, the court recognized the mother's \"preferential claim\" over any non-parent, absent a finding of unfitness based, for example, on \"abandonment\" or \"misconduct.\" Id. at 313-14 (citing cases from other state courts).\n\nIn light of Beall, the guardianship statute has been construed over the years to give natural parents, including a surviving parent, priority -- absent a showing of unfitness -- over a variety of nonparents who have contested the custody of minor children. Sea D.C. Code § 21-101 (1989); Shelton v. Bradley, 526 A.2d 579 (D.C. 1987) (unwed father prevails over maternal grandmother); Davis v. Jurney, 145 A.2d 846 (D.C. 1958) (mother prevails over husband's sister); Bell v. Leonard, 102 U.S. App. D.C. 179, 251 F.2d 890 (1958) (mother prevails over sister of child's alleged father); see also Johnson v. Lloyd, 211 A.2d 764 (D.C. 1965) (mother prevails over married couple with whom four-year-old child had resided for over three years); Jackson v. Fitzgerald, 185 A.2d 724 (D.C. 1962) (father prevails over maternal grandmother). \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nIn another relatively old case, In re Stuart, 72 App. D.C. 389, 394, 114 F.2d 825, 832 (1940), the court similarly applied a parental preference in reversing a trial court ruling on a petition filed by the Probation Department of the Juvenile Court. The trial court found that a fifteen-year-old child living with her mother did not have \"adequate parental care,\" within the meaning of the Juvenile Court Act. 52 Stat. 596, ch. 309 (June 1, 1938). In contrast with the decisions discussed in the preceding paragraph, the trial court awarded custody to an unrelated person with whom the child, apparently, had never resided. The court of appeals reversed, ruling that the trial court's finding of inadequate parental care was \"without warrant\" in the evidence and thus violated the 1938 Act's incorporation of the natural parents' inherent constitutional \"right\" and \"liberty\" to \"direct the upbringing and education of their children,\" absent \"cruelty\" or \"neglect\" or \"unfitness in character or mode of life.\" Stuart, 72 App. D.C. at 394, 396, 114 F.2d at 830, 832 (citing Pierce v. Society of Sisters, 268 U.S. 510, 533, 45 S. Ct. 571, 69 L. Ed. 1070 (1925)).\n\nIn contrast with the cases in which parental preference was considered a rebuttable presumption (i.e., Beall, Seeley, Shelton, Davis, Bell, Johnson, Jackson, and Stuart), later courts shifted to a \"best interests\" test, without regard to parental preference, in cases where a natural parent had earlier surrendered custody of her child to the welfare authorities (voluntarily or otherwise) or to an adoptive family and later sought to regain custody. See In re N.M.S., 347 A.2d 924 (D.C. 1975) (foster parents, not mother, awarded custody in best interests of nine-year-old girl whom mother had voluntarily surrendered to Social Rehabilitation Administration when child was four days old); In re LEM, 164 A.2d 345 (D.C. 1960) (mother permanently deprived of parental right to minor child, committed for two-and-one-half years to Child Welfare Division for lack of \"adequate parental care,\" whose best interests lay in Division's being in position to consent to adoption); Cooley v. Washington, 136 A.2d 583 (D.C. 1957) (custody determination reversed for application of best interests criteria to contest over thirteen-year-old boy between natural mother -- who had surrendered child for adoption by her sister and brother-in-law, both now deceased -- and child's stepmother, the brother-in-law's second wife); Holtsclaw v. Mercer, 79 U.S. App. D.C. 252, 145 F.2d 388 (1944) (foster parents of three-and-a-half year-old child retained custody in child's best interest when mother, who had relinquished child at birth, sought to regain custody on ground she had consented to arrangement under duress). \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThree of these four cases reflect the court's view that in \"seeking to regain -- not retain -- custody,\" N.M.S., 347 A.2d at 927, the natural parent by her earlier actions has put herself on an equal footing with the state, or with another nonparent, and thus, as a result, \"what is best for the child, rather than the natural right of the parent, is the controlling factor.\" Holtsclaw, 79 U.S. App. D.C. at 252, 145 F.2d at 388. Put another way, \"the probable welfare of the child is the controlling consideration[,] and all questions of superior rights are entirely subordinated.\" Cooley, 136 A.2d at 585 (footnote omitted). In sum, in a situation where there previously had been an acknowledgement or finding of unfitness resulting in a temporary withdrawal of custody from the natural parent, in a subsequent custody proceeding the fitness test yielded to a best interests test. Implicit in these rulings, with their language subordinating parental rights to a child's welfare, is the following understanding: although a child's interests ordinarily may be best served by granting custody to a fit parent, it is possible in some circumstances that the child's interests may be better served by someone other than a concededly fit parent.\n\nThe fourth \"best interests\" case, LEM, added another dimension. It recognized that the prospect for adoption is an especially significant concern in evaluating the child's best interests. 164 A.2d at 347. As a consequence, the court authorized termination of parental rights with a view to facilitating adoption, although not in connection with an adoption proceeding itself. The opinion noted that \"no attack is made on the court's statutory power to act as it did, and indeed none could be sustained in view of the court's plenary power in this area.\" Id., 164 A.2d at 349.\n\nWhatever the merits of this last observation at the time, it no longer applied to the statutory scheme adopted in 1970. See D.C. Code §§ 16-2301 to -2337 (1973) (incorporating Pub. L. 91-358, title I, § 121 (a), 84 Stat. 535 (July 29, 1970)). In In re C.A.P., 356 A.2d 335 (D.C. 1976), we stated that D.C. Code § 16-2320 (a) (1973), while permitting the termination of parental rights, did so \"only in the context of an adoption proceeding. . . . The sine qua non is that the adoptive parents petition the court for the child\" pursuant to D.C. Code §§ 16-301 to -315 (1973). C.A.P., 356 A.2d at 338; see White v. N.E.M., 358 A.2d 328 (D.C. 1976) (same). We held that Super. Ct. Neg. R. 18(c), which, -- in apparent implementation of a catchall provision, § 16-2320 (a)(5) \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e -- expressly permitted termination of parental rights \"in the best interest of the child\" without regard to a pending adoption proceeding was, in essence, a nullity. See C.A.P., 356 A.2d at 336 \u0026 n.1, 339 \u0026 n.13, 344. As a result of C.A.P., parents enjoyed greater protection of their parental rights; a court could consider terminating parental rights only if an adoption petition was pending.\n\nWithin the realm of adoption, however, the courts virtually ignored the parental rights of fathers of children born out-of-wedlock. In 1976, when C.A.P. was decided, the adoption statute did not require the consent of the father of a child born out-of-wedlock. See D.C. Code § 16-304 (b)(2)(A), (C) (1973). Aside from constitutional considerations, any question of parental rights in an adoption proceeding as to a child born out-of-wedlock focused exclusively on the rights of the mother. But, even the rights of unwed mothers, as well as those of married parents, were statutorily limited. It is true that adoption was typically premised on consent, see id. § 16-304 (b), or on an earlier relinquishment of parental rights, see id. § 16-304 (a), coupled with a finding (among others) that \"the adoption will be for the best interests of the prospective adoptee,\" id. § 16-309 (b)(3). The court, however, could grant the petition for adoption without a particular consent under certain circumstances: if the parent could not be located or had abandoned the child, id. § 16-304 (d), or if the court found, after a hearing, that the consent was \"withheld contrary to the best interests of the child,\" id. § 16-304 (e). Cf. D.C. Code § 16-202 (1951) (consent may be dispensed with when investigation has shown \"extraordinary cause\"). In this respect, the adoption statute reflected the same \"best interest\" test which had been applied for Dispositions of neglected children whose natural parents had voluntarily or involuntarily surrendered custody.\n\nThe caselaw development through 1976, therefore, reflects the following:\n\n1. In a contest over custody of a minor child between a parent and a foster parent, or between a parent and the District of Columbia child welfare authorities, the natural parent would prevail absent a showing of unfitness (including neglect) -- with the following significant exception.\n\n2. When there had been a surrender of custody to the child welfare authorities at the instance of the natural parent, or pursuant to court order upon a petition by the welfare authorities and a showing of neglect, any subsequent custody decision would be made exclusively with reference to the best interests of the child, and the parent would stand on no better footing than other participants (such as foster parents) seeking custody. Theoretically, therefore, a non-parent could obtain legal custody of the child in this situation without showing (current) parental unfitness.\n\n3. After the C.A.P. decision in 1976, the courts could continue with a variety of Dispositions for neglected children, such as foster care, in the best interests of the child, but they had no authority to terminate parental rights for neglect or otherwise, except in connection with an adoption proceeding.\n\n4. As to children born out-of-wedlock, the court could approve an adoption in the child's best interests after the mother had relinquished her parental rights, or with the consent of the mother (or, when appropriate, by overriding her refusal to consent), without notice to, or consent of, the father -- even if he were known.\n\nB. Statutory Developments: Termination of Parental Rights\n\nEffective September 23, 1977, the Council of the District of Columbia in effect overruled C.A.P. by amending the law to permit termination of parent and child relationships \"in the best interests of the child,\" D.C. Code § 16-2353 (Supp. V 1978), wholly apart from an adoption proceeding (as then codified at D.C. Code § 16-301 to § 16-315 (1973 \u0026 Supp. IV 1977)). This statutory \"best interests\" test for termination proceedings, codified in the same section of the current D.C. Code, reflected the language of a considerable body of caselaw and paralleled the long-standing approach under not only the statutes governing Dispositions of neglected children, see, e.g., D.C. Code § 16-2320 (a) (1973), but also our local adoption statutes, see, e.g., D.C. Code § 16-203 (c) (1951) (\"the change will be for the best interests of adoptee\"); id. § 16-309 (b)(3) (1989) (\"the adoption will be for the best interests of the prospective adoptee\"). In contrast with the adoption statute, however, and even as amended, the termination statute continues to focus on the capabilities of the natural parent, thereby allowing that parent to defend against attacks on his or her capabilities wholly apart from, and not in comparison with, other custodians or potential adoptive parents.\n\nC. Statutory Developments: Adoption\n\nCould there be, however, any reason to believe that, in contrast with the termination statute, D.C. Code § 16-2353 (1989), the adoption statute, with its traditional \"best interests\" language, see D.C. Code §§ 16-304 (e), -309 (b)(3) (1989), nonetheless incorporated a parental preference with a corresponding \"fitness\" test under some circumstances? Of the seven custody cases applying a fitness test discussed earlier -- Beall, Shelton, Davis, Bell, Johnson, Jackson, and Stuart -- only one, Bell, concerned a petition for adoption. That aspect of the case was not material to the analysis, which was the same in all these cases without regard to the type of custody sought. As elaborated below, I perceive no basis for saying that termination of parental rights of a non-consenting parent under the adoption statute can be divorced from analysis under the termination statute.\n\nMore specifically, absent a parent's consent to adoption (or earlier relinquishment of parental rights), a court cannot enter an interlocutory decree of adoption under D.C. Code § 16-309 (b) (1989) \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e and override a parent's refusal to consent as \"contrary to the best interests of the child,\" id. § 16-304 (e) (1989), \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e unless the parent's custodial rights are terminable under criteria such as those identified in the termination statute, id. § 16-2353 (1989) (grounds for termination of parent and child relationship). \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Cf. In re D.R.M., 570 A.2d 796, 804-05 (D.C. 1990). \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e Thus, even if the birth mother were to consent to an adoption, the court could not terminate the parental rights of the non-consenting father through an adoption proceeding -- assuming his consent were required -- unless, as to him, § 16-2353-type criteria were met.\n\nAs indicated earlier, however, consent to adoption of a child born out-of-wedlock traditionally has been limited to the mother; the unwed father, at least as a matter of statutory law, has had no standing to object. See D.C. Code § 16-304 (b)(2)(A), (C) (1973). But in 1976, perhaps in anticipation of constitutional requirements, \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e the adoption statute was amended to require the consent of a father of a child born out-of-wedlock. See D.C. Code § 16-304 (b)(2)(A) (Supp. IV 1977) (incorporating D.C. Law 1-87 (Oct. 1, 1976) which struck paragraphs C and D, and modified paragraph A). \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nAccordingly, given the fact that an unwed father was now entitled to notice and to consentor to object to an adoption proceeding when the mother elected, for example, to surrender the child for adoption at birth, we must ask whether the Beall-Davis-Bell-Jackson-Johnson-Shelton line of cases grants the father -- who has never been formally charged with neglect or other elements of unfitness -- a custodial preference in such circumstances. In Shelton, a 1987 case, we applied the guardianship statute, D.C. Code § 21-101 (1989), see (supra) note 13, in granting custody to the child's unwed father -- with whom the child had lived \"on some occasions,\" 526 A.2d at 580 -- over the maternal grandmother upon the death of the child's mother. There was no issue of unfitness or neglect. We recognized that the custodial presumption in the father's favor is rebuttable only \"by clear and convincing evidence of abandonment, unfitness, or other circumstances which render the parent's custody detrimental to the best interests of the child.\" Id. (citations omitted). At first blush, therefore, it would appear this statute should apply on behalf of the father when a mother puts a child up for adoption, for the statute is not limited to cases of a surviving parent. See Davis; Bell.\n\nOn the other hand, it is not clear that the guardianship statute, with its parental preference, is intended in all cases to prevail over the adoption statute, with its \"best interests\" test. It is difficult to conclude, purely as a matter of statutory construction, that an unwed, non-custodial father who has not helped attend to the child before or after birth belongs exclusively in the guardianship arena, not in the adoption-termination arena. This is especially true because the guardianship statute is almost ninety years old, see (supra) note 13, whereas the fathers of children born out-of-wedlock were not even party to the adoption process until 1976.\n\nIt is one thing to say that, as between a natural parent and another relative or family friend -- both of whom have had a relationship with the minor child -- the parent presumptively should have custody, which is what the Beall to Shelton line of cases under the guardianship statute stands for. It is not as easy to find statutory support for the proposition that, when an unwed mother surrenders her child for adoption and the father is nowhere to be found at the time the adoption agency takes physical custody, the guardianship statute nonetheless accords that father -- if ever found -- presumptive custody. It is just as persuasive to say that, in such circumstances, any such presumptive custody has been rebutted by the father's ostensible abandonment of the child, putting the statutory burden on him and on the would-be adoptive parents to assert their respective claims on an equal footing under the \"best interests\" test, as in Holtsclaw, Cooley, LEM, and N.M.S.\n\nTo make matters even more complicated, one can imagine an unwed father whose claim to custody, as in Shelton, appears so deserving relative to any other solution that he should be accorded presumptive custody. One can also imagine unwed fathers whose indifference to the child has been so obvious that his refusal to consent to adoption after the mother has surrendered the child should not be enough to trigger a presumption favoring his right to custody over an adoptive family, even if he is not demonstrably unfit. The District of Columbia adoption and termination statutes, however, as well as our local caselaw, provide no basis for concluding that some unwed fathers are entitled to a custodial preference while others are not.\n\nAccordingly, it would appear that selecting one statutory approach or the other in a particular case, in the absence of any relevant legislative history whatsoever, would be a decision for the court to make in a relatively new context based either on an arbitrary selection among canons of statutory construction or on policy-oriented criteria selected by the court. We could take either approach and purport to make a sound statutory construction, but either has obvious limitations in the absence of an easily assessable statutory answer.\n\nThere is a better approach. Given recent caselaw development in the Supreme Court, in this court, and in other courts around the country, it is clear that the judiciary has employed the Constitution to provide substantive content to unwed fathers' custodial claims. Fifty years ago in Stuart, the United States Court of Appeals for the District of Columbia Circuit construed the Juvenile Court Act of 1938 to conform to the court's understanding of constitutional requirements: a custodial preference for the custodial parent, absent a showing of unfitness in a neglect case. \u003cspan class=\"fnref\"\u003e22\u003c/span\u003e If the Constitution were so to require in the context of an unwed, non-custodial father, then the question of statutory construction would be resolved, as in Stuart, by constitutional imperative. Having \"read ahead,\" so to speak, I am satisfied that constitutional analysis provides a more useful approach to the question -- \"fitness\" test or \"best interest\" test? -- than a rendezvous with canons of statutory construction or with our own reasoned (or instinctive) policy views.\n\nI therefore turn to recent constitutional developments, in order to learn where a noncustodial, unwed father stands in a proceeding for adoption of his child by strangers. How prophetic for this context, if at all, was Stuart's ruling that the Constitution protects a natural parent's \"inherent\" right to custody absent unfitness? See id., 72 App. D.C. at 394, 396, 114 F.2d at 830, 832.\n\nIV. THE UNWED FATHER'S \"OPPORTUNITY INTEREST\"\n\nA. Supreme Court Caselaw\n\nH.R. contends he has a substantial \"liberty\" interest under the due process clause in developing a parental relationship with his son. I agree. The Supreme Court has long recognized that state intervention in the relationship between a parent and child is subject to constitutional oversight, see Pierce v. Society of Sisters, 268 U.S. 510, 535, 45 S. Ct. 571, 69 L. Ed. 1070 (1925); Meyer v. Nebraska, 262 U.S. 390, 399-401, 43 S. Ct. 625, 67 L. Ed. 1042 (1923). And, of course, fifty years ago in Stuart the United States Court of Appeals identified \"the liberty of parents to direct the upbringing and education of their children\" as a constitutional right. 72 App. D.C. at 396. More recently, the Supreme Court has reiterated \"that the relationship of love and duty in a recognized family unit is an interest in liberty entitled to constitutional protection.\" Lehr, 463 U.S. at 257. The Court, however, in discussing the interests of unwed fathers in preventing termination of their relationships with their children, has treated differently the claims of fathers who have had custodial relationships with their children by the time of the termination proceeding and those who have not.\n\nIn Stanley v. Illinois, 405 U.S. 645, 92 S. Ct. 1208, 31 L. Ed. 2d 551 (1972), the state placed the children of unwed parents in guardianship after their mother's death over objection of their natural father, who had lived with and supported them all their lives. The Court held, as a matter of due process and equal protection, that the state could not deprive the father of custody without notice, hearing, and proof of his unfitness for parenthood.\n\nSeveral years later, moreover, in Caban v. Mohammed, 441 U.S. 380, 99 S. Ct. 1760, 60 L. Ed. 2d 297 (1979), the Court struck down a New York statute that permitted consent to adoption exclusively by the mother of a child born out-of-wedlock. As in Stanley, the natural father had lived with his two children and their mother, and supported them, for several years. After the mother had left with the children, remarried, and gained legal custody, the mother's new husband sought to adopt the children over the natural father's objection. The New York courts applied the statute and granted the adoption. The Supreme Court reversed, holding that, by permitting such adoption without consent of the father, the statute imposed a gender-based discrimination that did not bear a substantial relation to some important state interest, in violation of the equal protection clause. The Court eschewed discrimination\n\nagainst unwed fathers . . . when their identity is known and they have manifested a significant paternal interest in the child. The facts of this case illustrate the harshness of classifying unwed fathers as being invariably less qualified and entitled than mothers to exercise a concerned judgment as to the fate of their children.\n\nId. at 394.\n\nIn contrast, in Quilloin v. Walcott, 434 U.S. 246, 255, 98 S. Ct. 549, 54 L. Ed. 2d 511 (1978), where the unwed father had not \"at any time, had, or sought, actual or legal custody of his child,\" the Court upheld an adoption decree terminating the father's parental rights under Georgia's \"best interests of the child\" standard and granting legal custody to the eleven-year-old child's mother and stepfather. In upholding the adoption, the Court stated that due process would no doubt be violated if the state were \"to attempt to force the breakup of a natural family\" on the basis of the \"children's best interest\" without some showing of parental unfitness. Id. (quoting Smith v. Organization of Foster Families For Equality and Reform, 431 U.S. 816, 862-63, 97 S. Ct. 2094, 53 L. Ed. 2d 14 (1977) (Stewart, J., Concurring in judgment)). But, the Court noted, the result of the adoption was \"to give full recognition to a family unit already in existence.\" Quilloin, 434 U.S. at 255. The Court implied that the outcome would have been different if the proposed adoption had placed \"the child with a new set of parents with whom the child had never before lived.\" Id.\n\nRead together, these cases say that an unwed natural father who has had a custodial relationship with his child cannot be ousted as a parent at the mother's behest -- absent a showing of his unfitness -- in favor of a foster parent (Stanley) or an adoptive stepfather (Caban), but that an unwed father who has not developed a custodial relationship, though fit to be a parent, can lose his parental rights to an adoptive stepfather when the best interests of the child preclude disruption of \"a family unit already in existence\" (Quilloin). \u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nWhat, then, is to occur if an unwed father (1) has never had a relationship with his child but (2) seeks custody when a \"proposed adoption would place the child with a new set of parents with whom the child had never before lived\"? Quilloin, 434 U.S. at 255. The Court addressed that question -- at issue in this case -- in Lehr. Basically, the Court concluded the answer turns on how early and persistently the natural father pursues his interest in taking custody of the child so as to justify keeping the father presumptively first in line, so to speak, when the natural mother elects to put the child up for adoption.\n\nAccording to the Court in Lehr, when an unwed father \"demonstrates a full commitment to the responsibilities of parenthood by 'coming forward to participate in the rearing of his child,' Caban, 441 U.S. at 392, his interest in personal contact with his child acquires substantial protection under the Due Process Clause.\" Lehr, 463 U.S. at 261. The Court noted that \"the mere existence of a biological link does not merit equivalent constitutional protection.\" Id. But,\n\nthe significance of the biological connection is that it offers the natural father an opportunity that no other male possesses to develop a relationship with his offspring. If he grasps that opportunity and accepts some measure of responsibility for the child's future, he may enjoy the blessings of the parent-child relationship and make uniquely valuable contributions to the child's development.\n\nId. at 262 (emphasis added). Thus, the Court has characterized the unwed, non-custodial father's protectible liberty interest as an \"opportunity\" he must \"grasp[].\" Courts and commentators accordingly have relabelled this particular liberty interest of a natural father as his \"opportunity interest.\" See In re Baby Girl Eason, 257 Ga. 292, 358 S.E.2d 459 (1987); Buchanan, The Constitutional Rights of Unwed Fathers Before and After Lehr v. Robertson, 45 OHIO ST. L.J. 313, 351-53 (1984) [hereinafter Buchanan, Constitutional Rights]. It follows that a noncustodial, unwed father who has grasped his opportunity interest will, as a matter of substantive constitutional right, be in the same position as the custodial father in Stanley: entitled to an \"individualized hearing on fitness.\" 405 U.S. 645, 657,62 S. Ct. 1208, 31 L. Ed. 2d 55, n.9. See Buchanan, Constitutional Rights, at 354, 373.\n\nBecause a non-custodial father may not grasp the opportunity to develop a relationship with his child in a timely, meaningful manner, his eventual assertion of his opportunity interest may be too late and thus not entitled to the constitutional protection available to a custodial father. In Lehr, for example, the Court upheld against a due process challenge an adoption decree granting legal custody to the child's mother and stepfather, even though the natural father had not been notified of, or allowed to participate in, the adoption proceeding. By the time the petition for adoption was filed, Lehr had failed to establish a parental relationship with his two-year-old daughter attributable in large part to the mother's desire to prevent contact between them. Significantly, however, Lehr also had failed to submit his name to New York's putative father registry, an action that would have guaranteed he received notice of any action to terminate his parental rights. Lehr, 463 U.S. at 250-52. The Supreme Court concluded that, under the circumstances, the New York statutory scheme, designed \"to protect the unmarried father's interest in assuming a responsible role in the future of his child,\" provided sufficient process by guaranteeing putative fathers \"who have never developed a relationship with the child the opportunity to receive notice simply by mailing a postcard to the putative father registry.\" Id. at 262 n.18. Because Lehr did not have a significant custodial, personal, or financial relationship with his child at the time notice would have been sent, id. at 263, and because he had failed to take advantage of his statutory right to establish a legal tie, the Court concluded there was no due process violation in terminating his parental rights without advance notice. Id. at 265. According to the Court, Lehr's failure to avail himself of state statutory protections meant that he was not entitled to notice. \"The Constitution does not require either a trial Judge or a litigant to give special notice to nonparties who are presumptively capable of asserting and protecting their own rights.\" Id. at 265. In short, the Supreme Court concluded that the putative father registry scheme afforded Lehr the minimum notice Stanley required, see Lehr, 463 U.S. at 263-64 \u0026 n.20, and that the proposed adoption was responsive to Quilioin's support for recognition of a family unit already in existence. Id. at 262 \u0026 n.19.\n\nLehr, therefore, \"limits the situations in which the state must take account of a father with only an opportunity interest.\" Buchanan, Constitutional Rights, at 354. But Lehr implies that an unwed father who does grasp his opportunity interest may be as constitutionally protected as the custodial father in Stanley. See Buchanan, Constitutional Rights, at 373.\n\nB. Grasping the \"Opportunity Interest\"\n\nLehr is significant, therefore, especially for the present case, because the Supreme Court announced for the first time how an unwed father can receive constitutional protection of his interest in a child with whom he has not had a custodial relationship. Lehr makes clear that, in a proceeding to determine child custody, a noncustodial, unwed father who moves quickly and responsibly can achieve constitutionally mandated priority over prospective adoptive parents who have received the child at birth and do not yet have an established family relationship with that child. See Buchanan, Constitutional Rights, at 373. I therefore turn, more specifically, to what it means for a non-custodial father to grasp his opportunity interest in a manner entitling him to constitutional protection.\n\nAs Lehr illustrates, a natural father who fails promptly to assert his opportunity interest in developing a relationship with his child may forever lose that interest. See Eason, 257 Ga. at , 358 S.E.2d at 462 (opportunity interest \"not indestructible\"). Elizabeth Buchanan notes, moreover, that\n\nchildren are not static objects. They grow and develop, and their proper growth and development require more than day-to-day satisfaction of their physical needs. Their growth and development also require day-to-day satisfaction of their emotional needs, and a primary emotional need is for permanence and stability. . . . That need for early assurance of permanence and stability is an essential factor in the constitutional determination of whether to protect a parent's relationship with his or her child. The basis for constitutional protection is missing if the parent seeking it does not take on the parental responsibilities timely. The opportunity is fleeting. If it is not, or cannot, be grasped in time, it will be lost.\n\nBuchanan, Constitutional Rights, at 364 (footnotes omitted).\n\nOf course, once the state places an infant with a prospective adoptive family, the natural father is precluded from establishing a parental relationship with his child, and any failure to establish personal, custodial, or financial ties with the child after such placement cannot automatically be characterized as abandonment. On the other hand, at least two courts have found relevant to a finding of abandonment the fact that a natural father knew of the mother's pregnancy but failed to express an interest in a parental role or to assume any responsibility for the pregnancy or the newborn before adoptive parents assumed custody of his child near the time of the child's birth. See, e.g., In re Adoption of Baby Boy D, 742 P.2d 1059, 1068 (Okla. 1985) (unwed father not entitled to substantial constitutional protection where he knew of pregnancy, yet made no attempt to assist mother financially during pregnancy, pay for expenses related to childbirth, or learn when and where child was to be born), cert. denied, 484 U.S. 1072, 108 S. Ct. 1042, 98 L. Ed. 2d 1005 (1988); In re Adoption of Doe, 543 So. 2d 741, 749 (Fla. 1989) (not unconstitutional to deny substantial due process protection to father who fails to provide prebirth assistance to mother when he is able and assistance is needed). As the Supreme Court of Florida recently stated:\n\nBecause prenatal care of the pregnant mother and unborn child is critical to the well-being of the child and of society, the biological father, wed or unwed, has a responsibility to provide support during the prebirth period. natural father's argument that he has no parental responsibility prior to birth and that his failure to provide prebirth support is irrelevant to the issue of abandonment is not a norm that society is prepared to recognize. Such an argument is legally, morally, and socially indefensible.\n\nId. at 746.\n\nIn sum, a court evaluating a father's assertion of his opportunity interest is entitled to focus on the extent of the father's involvement as soon as he learns of the pregnancy. On the other hand, the court must also recognize the limitations state action can impose on a non-custodial father once the child is placed with another family.\n\nGiven the caselaw to date, I believe the question whether a particular unwed, non-custodial father's opportunity interest will be entitled to substantial protection under the due process clause depends upon application of such factors as (1) the presence or absence of an established relationship between the child and an existing family; (2) whether the father has established a custodial, personal, or financial relationship with his child, or assumed responsibilities during the mother's pregnancy; (3) the impact, if any, of state action on the father's opportunity to establish a relationship with his child; (4) the age of the child when the action to terminate parental rights is initiated; and (5) the natural father's invocation or disregard of statutory safeguards designed to protect his opportunity interest. Considering these factors, I conclude that, when an unwed mother has relinquished her right to custody of a child at birth for adoption by strangers, the unwed father's interest in developing a custodial relationship with his child is entitled to substantial constitutional protection if he has early on, and continually, done all that he could reasonably have been expected to do under the circumstances to pursue that interest. See Eason, 257 Ga. at , 358 S.E.2d at 462 (unwed fathers gain from biological connection an opportunity interest to develop relationship with children which is constitutionally protected); In re Adoption of Lathrop, 2 Kan. App. 2d 90, , 575 P.2d 894, 898 (1978) (due process requires that natural father who asserts desire for custody of infant child have rights paramount to those of non-parents); In re Adoption of Baby Boy Doe, 717 P.2d 686 (Utah 1986) (termination of unwed father's parental rights violated due process where father unable to assert his rights under statute because he did not know of birth of child); Ellis v. Social Services Dept., 615 P.2d 1250, 1256 (Utah 1980) (due process violated where parental rights are terminated under statute and father not permitted to show he was not afforded a reasonable opportunity to comply with statutory requirements); Shoecraft v. Catholic Social Serv. Bureau, Inc., 222 Neb. 574, , 385 N.W.2d 448, 451 (1986) (statutory scheme requiring unwed father to file intent to claim paternity within five days of child's birth may well violate due process rights where father did not know of birth) (dicta), appeal dismissed, 479 U.S. 805, 107 S. Ct. 49, 93 L. Ed. 2d 10 (1986).\n\nC. Distinguishing Lehr v. Robertson\n\nBefore evaluating whether H.R. can be said to have grasped his opportunity interest sufficiently to warrant constitutional protection, we must understand how -- Lehr where the father was deemed to have abandoned that interest -- differs from the present case in several important respects.\n\nIn the first place, there are substantial factual differences. This case concerns the rights of a natural father when (1) the natural mother relinquishes her rights to custody of her child at birth, and (2) the petition for adoption is filed by strangers when the child is still an infant. Lehr, in contrast, concerned a stepfather's adoption of a child who, at the time the petition for adoption was filed, had lived for two years in an existing family unit with her natural mother and adoptive father, as in Quilloin. This factual difference has two important implications. First, the Lehr opinion made much of Lehr's failure to have developed a father-daughter relationship with his two-year-old child by the time the adoption petition was filed (even though the mother had taken steps to prevent that relationship). It is impossible, however, to find a failed parental relationship under the facts of the present case. Here, when H.R. finally learned that L.C. had continued her pregnancy to term and given birth to Baby Boy C., the state had already placed the child in an adoptive home, cutting off any possibility for H.R. to establish a parental, custodial, or financial relationship with his child until the official adoption proceedings were resolved. Second, the Supreme Court was unwilling to grant Lehr a constitutionally protected interest because recognition of the natural father's interest at the time the adoption petition was filed would have meant disrupting an existing family relationship among the natural mother, stepfather, and child. Again, in contrast, there were no established family relations in place when the Barker Foundation placed one-month-old Baby Boy C. with the O. family and the adoption petition was filed. Recognition that fathers of newborn infants have a substantial liberty interest in developing parental relations with their children does not disrupt established family relations. See Quilloin, 434 U.S. at 255 (upholding step-parent adoption resulting in \"full recognition a family unit already in existence\" and implying outcome would have been different if proposed adoption had placed \"the child with a new set of parents with whom the child had never before lived\"). As Elizabeth Buchanan notes:\n\nWhen a natural mother formally consents to the adoption of her child by strangers, whether the child is an infant or an older child, the effect of her consent is legal authorization of the placement of the child was a new set of parent figures, not the validation of an already existing parent-child relationship. . . . Protection of the father's opportunity interest in such circumstances would not run afoul of the public value in early permanence and stability because there would be no present permanence and stability. Protection of the father's opportunity interest, on the other hand, assuming his willingness to take on all of the parental responsibilities, including providing a home for the child, would assure permanence and stability for the future.\n\nBuchanan, Constitutional Rights, at 366-67.\n\nThere is a second major difference between Lehr and this case. In Lehr, private action alone denied the establishment of parental ties between Lehr and his daughter by the time the adoption petition was filed. In the present case, however, state intervention cut off H.R.'s ability to establish parent-child relations with Baby Boy C. Under District of Columbia law, child placement agencies are delegated the government function of accepting the relinquishment of parental rights from natural parents and locating suitable adoptive homes, as well as investigating and reporting to the court about the suitability of the placement and consenting to the adoption. See D.C. Code § 32-1007 (1989); D.C. Code §§ 16-304(d), -307, -309 (1989). Before the adoption petition was filed in this case, the Barker Foundation, a District-licensed child placement agency, was permitted to seek the termination of H.R.'s parental rights before Baby Boy C. had even been born; to accept L.C.'s relinquishment of her parental rights; and to place the baby with the O. family without H.R.'s prior consent or a judicial determination that the placement was suitable for the child. \u003cspan class=\"fnref\"\u003e24\u003c/span\u003e These acts taken by Barker, as well as the proceedings in the Superior Court, constituted state action under the due process clause. See Swayne v. L.D.S. Social Servs., 670 F. Supp. 1537, 1543-44 (D. Utah 1987) (private adoption agencies initiating adoption, and thus terminating parental rights, deemed state actor for purposes of challenging statute); Scott v. Family Ministries, 65 Cal. App. 3d 492, 506-07, 135 Cal. Rptr. 430, 434 (1976) (private licensed adoption agencies held state actors in context of establishment clause); see also Lugar v. Edmondson Oil Co., 457 U.S. 922, 937, 102 S. Ct. 2744, 73 L. Ed. 2d 482 (1982) (state action when deprivation is caused by exercise of right or privilege created by state and party causing deprivation may fairly be called state actor). As Elizabeth Buchanan suggests:\n\nrecognition of an opportunity interest in unwed fathers requires a Conclusion that if the two elements of a constitutionally protected parent-child relationship are the biological link and commitment to and exercise of custodial responsibility, the state may not deny biological parents the opportunity to establish a protected custodial relationship.\n\nBuchanan, Constitutional Rights, at 351 (footnotes omitted).\n\nWhen state action blocks the opportunity for development of a parental relationship between the natural father and child and creates an environment for the development of parental ties between strangers and that child, the state may not then lawfully deny the father his opportunity interest on the basis that the child has developed family relations with prospective adoptive parents before the adoption petition is filed or between the time of the filing and the hearing on the petition. See Lathrop, 2 Kan. App. 2d at , 575 P.2d at 898 (putative father, who had been prevented from bestowing parental care on child from time of its birth by adoptive parents, cannot be faulted, nor can his parental rights be lessened, by virtue of failing to perform parental responsibilities).\n\nThe third major distinction between this case and Lehr is that District of Columbia law provides for immediate notice to a natural father upon the filing of a petition for adoption, D.C. Code § 16-306 (a) (1989), whereas the New York statute at issue in Lehr provided for notice only to certain classes of putative fathers. As elaborated above, the Supreme Court found Lehr's failure to use the available statutory protection fatal to his constitutional claim. Lehr's failure to register had rendered him, under New York law, a nonparty to the adoption proceeding. H.R., however, unlike Lehr, was guaranteed a right to immediate notice of the filing of the adoption petition under District of Columbia law. D.C. Code § 16-306 (a) (1989). By statute, the required initiative is on the government or its designated agent, not on the putative father. The Supreme Court's deference in Lehr to state legislative schemes for protecting natural fathers' rights, therefore, must result in a corresponding deference here: judicial recognition of H.R.'s statutory right to immediate notice in evaluating whether he grasped his opportunity interest. The onus placed on Lehr under the New York statute in no way can be used to diminish H.R.'s right to rely on placement of the burden elsewhere under our local law: the burden rests on the District of Columbia.\n\nIn short, Lehr, while recognizing an unwed father's \"opportunity interest,\" reaffirms the Stanley-Caban-Quilloin concern about disturbing existing family relationships and the Quilloin concern about the failure of the father to assert his interest in timely, committed fashion. Whereas Lehr therefore clarifies the burden the unwed father must carry -- timely, continual assertion of his \"opportunity interest\" -- Lehr does not deal with the issue of what happens when unlawful state action both interferes with assertion of the opportunity interest and facilitates creation of a prospective adoptive family intended to take the child from the father. We should not hesitate to conclude, however, that in such circumstances a natural father cannot be held to have abandoned his opportunity interest. See Eason, 257 Ga. at , 358 S.E.2d at 463 (\"unwed father has a constitutionally protected interest which cannot be denied him through state action\"). There may be other reasons why he should not be entitled to custody but not this one.\n\nV. VIOLATIONS OF H.R.'S CONSTITUTIONAL AND STATUTORY RIGHTS\n\nA. State Action Affecting H.R.'s \"Opportunity Interest\"\n\nI conclude, on this record, that H.R. has not abandoned his opportunity interest in developing a relationship with Baby Boy C. because state action unlawfully interfered with H.R.'s rights. Before explaining this Conclusion, however, I outline the context.\n\nAt the time the Barker Foundation and the O. family initiated adoption procedures, H.R. did not even know that his son had been born. L.C. had left Zaire, hinting that she would get an abortion and return to Africa within a couple of weeks. This intention was confirmed by a mutual acquaintance who told H.R. in July that L.C., in fact, had had an abortion in Washington, D.C. When H.R. received the letters from Barker in August 1983, postmarked in May, stating that L.C. \"has recently been working with our agency with a view to placing the child she expects in July, 1983 for adoption,\" H.R. had every reason to believe that an intervening abortion had mooted these plans. Nonetheless, he sought to learn what had happened and finally, in October 1983, learned that he was indeed the father of a child. Unfortunately for H.R., Barker had already placed Baby Boy C. with the O. family, eliminating any possibility for the development of custodial, financial, or emotional ties between himself and his son. The only way H.R. could have grasped his opportunity interest would have been to assert his legal rights to custody at a judicial proceeding. Again, unfortunately for H.R., neither L.C. nor Barker nor the court notified him that there was a pending judicial proceeding that vitally affected his legal rights to his son. Moreover, H.R.'s own efforts to identify the judicial proceeding proved fruitless. In sum, by cutting off the possibility of a current parent-child relationship, and then failing to inform H.R. for more than eighteen months of the legal proceeding which offered him his only means of ensuring a future relationship with his son, the District of Columbia -- primarily the Barker Foundation as a state actor -- deprived H.R. of any greater opportunity than he asserted to become a parent to his child.\n\nIf the District's (including Barker's) actions were lawful -- if the burden to learn the facts and the law were entirely on H.R. -- then presumably the failure to grasp his opportunity for custody of Baby Boy C. would have been his own responsibility. But, the reality is otherwise. State action violated H.R.'s procedural rights guaranteed by the due process clause of the Constitution and by the law of the District of Columbia. The trial court erred as a matter of law in holding otherwise. \u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nAs background for this Conclusion, we should note that the Supreme Court has held the state may not deprive a person of a liberty or property interest without affording that individual notice and an opportunity to be heard. Mullane v. Central Hanover Bank \u0026 Trust Co., 339 U.S. 306, 314, 70 S. Ct. 652, 94 L. Ed. 865 (1950). \"This right to be heard has little reality or worth unless one is informed that the matter is pending and can choose for himself whether to appear or default, acquiesce or contest.\" Id. Moreover, a court assessing whether a litigant has been afforded a right to be heard must \"look to the realities\" of the case before it, Greene v. Lindsey, 456 U.S. 444, 451, 102 S. Ct. 1874, 72 L. Ed. 2d 249 (1982), in assessing whether the opportunity to be heard has been granted, as the Constitution demands, \"at a meaningful time and in a meaningful manner.\" Armstrong v. Manzo, 380 U.S. 545, 552, 85 S. Ct. 1187, 14 L. Ed. 2d 62 (1965).\n\nB. Failure to Provide H.R. with Adequate Notice; Court-ordered Interim Guidelines\n\nI agree with H.R.'s argument that the information Barker furnished him failed to provide the minimal notice required by due process to enable him to assert his right to custody of Baby Boy C. at a meaningful time and in a meaningful manner.\n\nIn its initial letter to H.R. mailed in May 1983, Barker told H.R. that he had a right to acknowledge or deny paternity and provided him with forms to enable him to consent to the adoption. Barker's February 1984 letter, sent in response to H.R.'s request for clarification concerning his rights, stated only that \"the law requires that an effort be made in good faith to inform the biological father of the plans for adoption\" and that Barker's May 1983 letter, with accompanying consent forms, had informed him of this. Neither of these letters, however, informed H.R. of his basic right to seek custody of Baby Boy C. and of his right to participate at a court hearing that would be scheduled to determine the permanent placement of his child. \u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nThis court in Ford v. Turner, 531 A.2d 233 (D.C. 1987), held that the personal representative of an estate was deprived of procedural due process when the police seized guns from the decedent's apartment and failed to notify the representative about the seizure and her right to a hearing to contest it. District of Columbia law provided that within thirty days after the police department's property clerk assumed custody of a dangerous article, any person could file with the clerk a claim for possession of the item. The law, however, did not provide for notification to parties whose property had been seized. The representative eventually learned that the guns were in police custody and wrote to the property clerk on several occasions, challenging the authority of the clerk to retain the guns and suggesting that she might seek to regain possession. The clerk replied only once but did not explain why he would not turn over the guns. Nor did he tell the representative how she could regain possession. We concluded that \"the failure to give [the representative] notice 'reasonably calculated' to inform her of the reasons why the Property Clerk held the guns and of the means by which could challenge [the clerk's] continued custody of them violated due process.\" Id. at 237-38 (citing Memphis Light, Gas \u0026 Water Division v. Craft, 436 U.S. 1, 14, 98 S. Ct. 1554, 56 L. Ed. 2d 30 (1978) (\"The purpose of notice under the Due Process Clause is to apprise the affected individual of, and permit adequate preparation for, an impending 'hearing.'\" (citation omitted))). We stated that, \"at a minimum, she was entitled to notice that certain property had been seized, that the District sought to retain the property pursuant to specified authority, and that a claimant could take particular steps to challenge the District's action.\" \u003cspan class=\"fnref\"\u003e27\u003c/span\u003e Id. at 238.\n\nAs the Supreme Court recognized in Santosky v. Kramer, it is \"'plain beyond the need for multiple citation' that a natural parent's 'desire for and right to \"the companionship, care, custody and management of his or her children\"' is an interest far more precious than any property right.\" 455 U.S. 745, 758-59, 102 S. Ct. 1388, 71 L. Ed. 2d 599 (1982) (quoting Lassiter v. Dept. of Social Servs., 452 U.S. 18, 27, 101 S. Ct. 2153, 68 L. Ed. 2d 640 (1981) (citation omitted)). I believe that Barker's role as a state actor in the adoption process requires that it provide a natural father a minimum amount of information concerning his procedural rights in an adoption proceeding. Barker's May 1983 letter with consent forms and its February 1984 follow-up letter fell far short of providing this minimally required constitutional protection.\n\nAccording to the statute governing placement of children in family homes, rules and regulations were to be promulgated by a committee composed of social service, licensing, and charitable organization representatives, reviewed annually, and amended when necessary, subject to approval of the Mayor. D.C. Code § 32-1003 (1988). Regulations were not issued, however, until a notice of proposed rulemaking was published on January 26, 1990 seeking comments on proposed regulations. See 37 D.C. Reg. 859 (Jan. 26, 1990). \u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Unfortunately, these regulations, which have recently become effective, 37 D.C. Reg. 3033-3071 (May 11, 1990), in respects relevant to this case are inadequate. Adopted as a new chapter 16 for 29 DCMR, § § 1600-1645.1 (1990), the regulations are entitled \"Standards of Placement, Care, and Services for Child-Placing Agencies.\" As to notice to birth parents, these regulations provide:\n\n1629.1 When one or more individuals have been named as the possible birth father, the child-placing agency shall notify all named individuals of the plan for adoption by certified or registered mail return receipt requested.\n\n1629.2 The child-placing agency shall report to the court a birth parent's failure to respond to a notice of a plan for adoption, if the birth parent fails to respond within thirty (30) days of receipt of notification. \u003cspan class=\"fnref\"\u003e29\u003c/span\u003e\n\n37 D.C. Reg. 3058 (1990). The regulations, however, do not define the \"plan for adoption\" of which the parent is entitled to notice. But even if that \"plan\" can be fairly inferred to some extent, there is no indication the plan covers what appears to be a significant omission that cannot be overlooked: there is no required notice of the birth parents' rights in respect of custody.\n\nGiven the absence of adequate regulations, and in light of the rights at stake, I believe we should announce additional guidelines to govern child-placement practices until such time as the concerns they identify can be incorporated into formal regulations. A child placement agency, upon notification of the mother's intent to relinquish her parental rights to the agency, should inform the putative father that (1) the mother (named) of a child has stated her intent to relinquish her parental rights to her child to the agency; (2) as a child placement agency licensed by the District of Columbia, it seeks to place the child for adoption by new parents, but if the putative father acknowledges paternity he himself has a right to seek custody of the child; (3) if the putative father does want custody, he should inform the child placement agency immediately of his intentions and should retain an attorney; (4) assertion of the putative father's right to custody may involve a formal legal proceeding before the Family Division of the Superior Court (address provided), at which a Judge will preside; (5) before the formal proceeding occurs, the putative father will receive notice of the hearing of the case and an order to appear; and (6) any information which the putative father provides the child placement agency shall be included in a report to the Family Division on the placement agency's recommendation for the best placement of the child. \u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nIf the putative father cannot be located until after the mother has relinquished her rights and the child has been placed in an adoptive home, the foregoing notification should be amended accordingly. If the putative father is not located until after the filing of the petition for adoption, the agency letter seeking his consent to the adoption should inform the putative father of the docket number of the case in addition to the above-required information. Any written communication the child placement agency has with the putative father after the filing of the petition should contain the name and address of the court, the docket number of the case, and the name of the presiding Judge.\n\nI recognize that a child placement agency supporting termination of parental rights and approval of a proposed adoption is in a potentially difficult position when acting as agent for the court in officially notifying the putative father -- who may have objections -- about the situation. The court, however, is not limited to relying on the placement agency to provide the required notice. Pursuant to D.C. Code § 32-1010 (1988), the \"Department of Human Services is authorized to make such investigations and inspections as are necessary to carry out the provisions of\" the statute and, as a consequence, could work with the court to notify the putative father if the court -- or the child placement agency -- were to prefer that approach.\n\nC. Failure to Provide H.R. with Immediate Notice\n\nH.R. also claims he was denied his procedural rights under District of Columbia law when no effort was made to give him \"immediate\" notice of the filing of the adoption petition. His point is well taken. Local statutory law provides natural parents a right to notice of, and participation in, adoption proceedings concerning their children. See D.C. Code § § 16-304, -306 (1989). Given the fleeting nature of a noncustodial, unwed father's opportunity interest in gaining custody of his child, his constitutional right to notice of the adoption proceeding will be ephemeral unless he is given notice immediately upon the filing of an adoption petition. This constitutional imperative is reflected in D.C. Code § 16-306 (a) (1989), which requires that\n\ndue notice of pending adoption proceedings shall be given to each person whose consent is necessary thereto, immediately upon the filing of the petition. The notice shall be given by summons, by registered letter sent to the addressee only, or otherwise as ordered by the court. [Emphasis added.]\n\nH.R.'s statutory -- and constitutional -- right to notice, therefore, was violated when the court failed to provide him with immediate notice of the filing of the O. family petition to adopt Baby Boy C. The failure to provide H.R. with immediate notice appears to have been not an oversight but the normal practice of the Family Division of the Superior Court. \u003cspan class=\"fnref\"\u003e31\u003c/span\u003e The hearing testimony of Alice Avery of the Barker Foundation confirmed that, as a regular practice, the Family Division sends notice of an adoption proceeding to the opposing parties when a show cause order is issued, not immediately upon the filing of the petition.\n\nI conclude that the Family Division practice of providing notice to interested parties only upon the issuance of the show cause order violates the statute. In this jurisdiction, the legislature has decided to protect both the participation rights of natural parents (among others whose consent to an adoption is required) and the best interests of the child by providing immediate notice of a pending adoption proceeding. Immediate notice informs interested persons of their legal rights to participate in the proceeding and allows them, if they so desire, to register their opposition and to obtain a hearing as early as practicable. Immediate notice also furthers the best interests of the child in the earliest possible resolution of the adoption process. Because the development of a child's relationship with parental figures is of critical importance in resolving the ultimate placement, minimizing the time expended in the adoption proceeding is crucial. Waiting until issuance of the show cause order to notify a known, interested party of the proceeding is not a reasonable interpretation of the statutory command that due notice of a pending adoption proceeding be sent \"immediately.\" Accordingly, the procedures of the Family Division should be changed to comply with the statute -- and the Constitution.\n\nD. Failure to Use Due Diligence to Find H.R.\n\nH.R.'s final contention concerning deprivation of his procedural rights, with which I also concur, is that Barker violated his constitutional right to procedural due process by failing to use due diligence to find H.R. in order to provide timely service of the required immediate, official notice of the adoption proceedings. According to\n\nH. R., the delay engendered by Barker's lack of diligence caused him to be unable to assert his legal rights early enough to prevail at the custody hearing. Mullane established the fundamental principles for determining the constitutional sufficiency of notice for due process purposes:\n\nAn elementary and fundamental requirement of due process in any proceeding which is to be accorded finality is notice reasonably calculated, under all the circumstances, to apprise interested parties of the pendency of the action and afford them an opportunity to present their objections. The notice must be of such nature as reasonably to convey the required information. . . .\n\nProcess which is a mere gesture is not due process. The means employed must be such as one desirous of actually informing the absentee might reasonably adopt to accomplish it.\n\n339 U.S. at 314-15 (emphasis added) (citations omitted). Mullane's requirement that the \"means employed\" reflect an actual desire to inform the absent party of the proceedings applies not only to the form of service chosen but also to the efforts to ensure that such service is effective.\n\nThis court has held that violations of the Superior Court rules which provide for notice and opportunity to be heard have the effect of denying a litigant due process of law. Evans v. Evans, 441 A.2d 979, 980 (D.C. 1982). In Bearstop v. Bearstop, 377 A.2d 405, 408 (D.C. 1977), this court described the kind of information which plaintiffs, unable to achieve personal service of process in a divorce proceeding, should provide the court before the court allows notice by publication pursuant to the Domestic Relations Rules:\n\n(1) the time and place at which the parties last resided together as spouses; (2) the last time the parties were in contact with each other; (3) the name and address of the last employer of the defendant either during the time the parties resided together or at a later time if known to the plaintiff; (4) the names and addresses of those relatives known to be close to the defendant; and (5) any other information which could furnish a fruitful basis for further inquiry by one truly bent on leaning the present whereabouts of the defendant.\n\nWe held that the plaintiff, using this basic information, should detail for the Family Division the particular efforts which had been made to ascertain the defendant's address. Id. As Judge Schwelb said in his January 25, 1984, denial of petitioner's petition for an interlocutory order of adoption in this case, \"the rights of the father here in question are certainly not less significant than those at issue in Bearstop.\" See also Matter of E.S.N., 446 A.2d 16, 17-18 (D.C. 1982) (requirements of due diligence met in proceeding to terminate parental rights where appellant had not been heard of for six years and no record of his residence existed, social worker contacted appellant's brother and aunt and hired an investigator, and \"all possible leads were explored and affidavits regarding these efforts were presented in court and made part of the record\"). Accordingly, the efforts to locate H.R. at a minimum had to incorporate the due diligence required in Bearstop.\n\nBarker's efforts did not approach the standard of diligence required to satisfy due process. Barker assumed a casual attitude toward ascertaining H.R.'s whereabouts. Avery's testimony indicates that Barker did not obtain the addresses of H.R.'s relatives because L.C. wanted to keep the entire matter as confidential as possible. In Barker's crucial December 1984 report to the court, Avery wrote that L.C. did not know H.R.'s whereabouts; but Avery admitted on deposition that she did not tell the court that L.C. had other possible addresses for H.R. See Kickapoo Tribe of Oklahoma v. Rader, 822 F.2d 1493, 1499-1500 (10th Cir. 1987) (due process rights of natural father violated when state human services agency did not make diligent efforts to provide him with personal service: (1) social worker did not press mother of child for father's address or ask her if she had communicated with him; (2) social worker knew of father's relatives but did not attempt to gain information concerning his whereabouts from them, nor did he inform court that relatives could be located). Avery also admitted that her statement that L.C. did not know H.R.'s address was based on an August conversation she had had with L.C. four months before the submission of the December report. Indeed, at deposition, Avery admitted that she had been relying on old information and had not made an attempt to update it, despite the fact that L.C. had told Avery that the university address would not be good after July 1983. See In re Marriage of McDaniel, 54 Or. App. 288, , 634 P.2d 822, 825 (1981) (no due diligence in locating father in custody dispute where, among other things, affidavit of mother failed to indicate when her inquiries concerning father's whereabouts occurred \"'so as to show that they were made recently enough that a diligent person would be justified in relying upon them at the time of application for an order authorizing service . . . by publication'\").\n\nIn January 1984, Judge Schwelb explicitly told Barker that an Order to Show Cause \"directed to H.R.'s last known address, without further reasonable inquiry into his present whereabouts,\" would not be sufficient. Yet, in August 1984, Judge Mencher was only in a position to issue an Order to Show Cause to an old address, one in Zaire, which Barker had obtained seven months earlier. More specifically, at the time of the August 1984 Order to Show Cause, Barker knew or should have known that H.R. was no longer in Zaire. In H.R.'s January 17, 1984 phone conversation with Barker, he had mentioned that he was planning to go to Canada or France in the spring and that he hoped to come to the District of Columbia to see the baby. In May 1984, Barker had received correspondence from L.C. indicating that H.R. in fact was in Paris. And yet, three months later, rather than calling L.C. to ascertain H.R.'s Paris address, Barker instead allowed the court to mail the show cause order to an address which H.R. had given Barker seven months earlier.\n\nH.R. never received the August 1984 Order, and in October 1984 an interlocutory decree of adoption was entered for petitioners, Mr. and Mrs. O. In February 1985, after H.R. retained an attorney, Barker received a letter from H. R. in which he stated he refused to consent to the adoption. That letter contained H.R.'s Paris address, which then became the basis for all further communication with him. Also in February, H.R. wrote another letter to Barker stating that he had retained a lawyer and had formally admitted paternity. H.R. asked Barker to inform the court that he did not intend to abandon his child. Barker never answered either of these letters. The only notification H.R. ever received from anyone informing him of the adoption proceeding was an order from Judge Riley issued in April 1985, more than one year after Barker's February 1984 letter -- and at a time when his son was already twenty months old -- extending the interlocutory decree of adoption to June 30, 1985, and informing H.R. that he must file pleadings and appear at a hearing on that date. \u003cspan class=\"fnref\"\u003e32\u003c/span\u003e\n\nI reject the trial court's assertion (as well as Judge Belson's assertion, see post at p. 141, n.11) that H.R. had the responsibility to keep the \"parties,\" in this case Barker, informed of his current address if he wished to have prompt notice of the legal proceeding. There was no indication whatsoever in any of the information Barker sent to H.R. that there was a pending judicial proceeding, let alone that Barker and H.R. were \"parties\" to that proceeding. More specifically, Barker never informed H.R. that there was an adoption petition pending in a court of law and that H.R., pursuant to District of Columbia law, was entitled to notice of and participation in a hearing on that petition. Perhaps we could attribute some legal significance to H.R.'s failure to keep Barker informed of his whereabouts if -- but only if -- Barker had informed H.R. that it needed to be updated on his changes of address because it was serving as an investigator for a court that would be sending H.R. notice of a hearing in which Barker would be challenging H.R.'s rights to custody of his son. As it was, H.R. only knew that the Barker Foundation was seeking his consent to the adoption of his child -- consent which he was unwilling to give.\n\nE. Summary of Vioiations of H.R.'s Rights\n\nIn sum, the Barker Foundation and the court denied H.R. the following procedural rights, guaranteed by the due process clause: (1) notice of the legal procedures involved in the adoption process, and the agency's role in those procedures; (2) immediate notice of the adoption petition, filed by the O. family, which initiated the official judicial proceeding to terminate H.R.'s parental rights (a statutory violation as well); and (3) diligent efforts by the Barker Foundation to ascertain H.R.'s whereabouts, in order to assure the required immediate notice of the judicial proceeding so that H.R. could exercise his rights to seek custody of his child at a meaningful time and in a meaningful manner. Given the communications he did receive, H.R. did all he could reasonably have been expected to do to claim custody of his child. \u003cspan class=\"fnref\"\u003e33\u003c/span\u003e For these reasons, H.R.'s \"opportunity interest\" remained intact.\n\nVI. APPLICATION OF THE PROPER STANDARD FOR TERMINATING AN UNWED, NON-CUSTODIAL FATHER'S PARENTAL RIGHTS WHEN THE MOTHER PUTS A CHILD UP FOR ADOPTION AT BIRTH\n\nA. Custodial Preference for a \"Fit\" Parent Whose \"Opportunity Interest\" is Still Intact\n\nBecause state action violated H.R.'s rights to due process, I have concluded that H.R. has not abandoned his \"opportunity interest\" in parenting Baby Boy C. I therefore turn to H.R.'s contention that, in resolving custody for Baby Boy C., the trial court erred in applying the \"best interests of the child\" standard required by D.C. Code § 16-2353 (1989) (termination), see (supra) note 18, and id. § 16-304 (e) (adoption), see (supra) note 17. H.R. claims that, because he had a constitutionally protected liberty interest in developing parental relations with Baby Boy C. and did all he could reasonably be expected to do under the circumstances to grasp his opportunity to protect that interest, he was entitled to custody -- absent his \"unfitness\" as a parent. He adds that application of the \"best interests\" standard is especially inappropriate here because procedural violations delayed his awareness of the situation in a way that made it impossible for him to prevail under that standard as traditionally applied (i.e., by comparing a non-custodial parent with a custodial family with whom the child has lived happily for awhile). In short, H.R. claims that, because he would be a \"fit\" parent, the illegally established relationships between Baby Boy C. and the O. family cannot form the basis of a decision to deny him parental rights.\n\nLehr makes clear that a natural father who has not abandoned his \"opportunity interest\" has a constitutionally protected interest in establishing parental relations when the natural mother relinquishes their child for adoption at birth. Eason, 257 Ga. at , 358 S.E.2d at 463. \u003cspan class=\"fnref\"\u003e34\u003c/span\u003e I believe this means that ordinarily in such circumstances, if the court finds the natural father would be a \"fit\" parent, he is entitled to custody. See id. (applying fitness standard on due process and equal protection grounds); see also Jermstad v. McNelis, 210 Cal. App. 3d 528, 258 Cal. Rptr. 519 (1989) (construing \"best interests\" standard in light of Lehr to create parental preference over prospective adoptive parents when natural parent has diligently pursued opportunity to establish custodial relationship); Buchanan, Constitutional Rights, at 373. This means, in legal effect, that as a matter of constitutional law, an unwed, non-custodial father who has not lost his opportunity interest has maintained a sufficient connection with his child to receive the custodial preference -- the presumptive right to custody -- specified in the guardianship statute, D.C. Code § 21-101 (1989), as interpreted by Shelton and the earlier cases. In short, the due process clause constitutionalizes the applicability of the guardianship statute to an unwed, non-custodial father who has grasped his opportunity interest within the meaning of Lehr.\n\nIt is conceivable, however, that even granting custody to a \"fit\" parent who has not abandoned his \"opportunity interest\" could be detrimental to the best interests of the child under certain circumstances -- as I shall elaborate later. Lehr and earlier Supreme Court cases do not address, let alone foreclose, that possibility, and irrespective of a natural parent's fitness, I do not believe the Constitution, any more than the District's guardianship statute, requires an award of custody that clear and convincing evidence shows would be adverse to the child's best interests. \u003cspan class=\"fnref\"\u003e35\u003c/span\u003e On the other hand, I believe Lehr and Stanley taken together do afford substantive as well as procedural protection, mandating at least a custodial preference for a fit parent who has not abandoned his opportunity interest. See Jermstad, 210 Cal. App. 3d at , 258 Cal. Rptr. at 531; Buchanan, Constitutional Rights, at 373.\n\nAccordingly, I conclude the Constitution requires us to construe the \"best interests\" language under the adoption statute, D.C. Code §§ 16-304 (e), -309 (b)(3) (1989), to mean that, when a natural father who has not abandoned his \"opportunity interest\" seeks custody of an infant child whom the mother has surrendered for adoption at birth, he shall be entitled -- as under the guardianship statute -- to custody if he would be a \"fit\" parent, unless the adoptive parents persuade the court with clear and convincing evidence \u003cspan class=\"fnref\"\u003e36\u003c/span\u003e that failure to terminate the father's parental rights would be detrimental to the best interests of the child.\n\nBecause, however, this court's decisions in a number of instances have sustained our local statutes against constitutional attack by permitting termination of parental rights and adoption in \"the best interests of the child,\" without employing a presumption favoring custody by a \"fit\" parent, we must examine more precisely how parental \"fitness\" and the child's \"best interests\" relate under those cases. Only by doing so can we determine whether our caselaw permits this division of the court to take the approach I believe is constitutionally required here. See M.A.P. v. Ryan, 285 A.2d 310, 312 (D.C. 1971) (as matter of internal policy, no division of this court will override prior decision of this court; such result can only be accomplished by this court en banc).\n\nB. District of Columbia Caselaw on Constitutional Challenges to Adoptions and Other Terminations of Parental Rights\n\nIn three pre-Lehr adoption cases, this court, applying the statutory \"best interests\" standard, affirmed, against a due process, not a statutory, challenge, the termination of an objecting parent's parental rights in favor of an adopting family -- without a finding of parental unfitness. In re P.G., 452 A.2d 1183 (D.C. 1982); In re J.O.L., 409 A.2d 1073 (D.C. 1979), vacated and remanded, 449 U.S. 989, 66 L. Ed. 2d 286 (1980), cert. denied, 454 U.S. 832, 102 S. Ct. 131, 70 L. Ed. 2d 110 (1981); In re Adoption of J.S.R., 374 A.2d 860 (D.C. 1977). We concluded in J.S.R. that the \"best interests\" standard requires the Judge first to apply a variety of factors, such as those set forth in the Uniform Marriage and Divorce Act § 402, \u003cspan class=\"fnref\"\u003e37\u003c/span\u003e see J.S.R., 374 A.2d at 863 n.11; but see D.R.M., 570 A.2d at 804-05 (suggesting that § 16-2353 termination criteria are relevant and applicable), and then to select \"the least detrimental of the available alternatives\" for custody. Id. at 863; see P.G., 452 A.2d at 1184. We did not employ a custodial preference for a fit natural parent.\n\nIn the most recent of these cases, P.G., we noted that appellant, the child's natural father, had separated from the child's mother (with whom he had been living) while the mother was pregnant; that the child had lived with the prospective adoptive family for about a year and four months at the time of the trial court order; and that only the biological tie favored the father. \"All else is decisively in favor of the adoption petition.\" 452 A.2d at 1184. We then discussed Stanley, Quilloin, and Caban, stressing that the case at bar, like Quilloin, concerned a child who had become part of an existing family unit. P.G., 452 A.2d at 1184-85. We concluded that our due process analysis in J.S.R., applying a \"best interests\" test without a necessary finding of parental unfitness, controlled \"in the absence of subsequent contrary Supreme Court authority.\" P.G., 452 A.2d at 1185.\n\nThen came Lehr in 1983. Until the present case, we have not had occasion to consider Lehr's impact on the proposed termination of parental rights of an arguably fit parent in the adoption context. We have, however, published seven opinions on termination of parental rights in neglect cases under D.C. Code § 16-2353 (1989), (supra) note 18, of relevance here -- only one of which touched on Lehr, indirectly, in a Concurring opinion. I turn now to those seven opinions.\n\nIn In re K.A., 484 A.2d 992 (D.C. 1984), both parents had abandoned their daughter at age five to foster care, although witnesses testified that the father, the appellant, had achieved a \"close relationship\" with the child even though he had visited her only eight times in three years. Id. at 996. The trial court, applying the § 16-2353 (b) factors, (supra) note 18, terminated parental rights, over the father's objection, in the interest of stabilizing the child's relationship with her foster family. We affirmed, concluding that the P.G. line of cases controlled in the absence of a custodial relationship between parent and child. Significantly, however, we stated, in effect, that a fitness analysis might be required if a natural parent had custody at the time of the termination proceeding:\n\nWe do not wish to rule out, just as the Supreme Court in Quilloin v. Walcott did not want to preclude, a more prominent role for a concern for the natural parents' rights, if and when the case demands. Where custodial parents' rights are threatened with possible termination, it may be appropriate for the court to analyze the four statutory factors spelled out in § 16-2353 (b) first with respect to the natural parents facing rights termination. And only if the results of that analysis are unsatisfactory would the court then proceed to apply the factors to the other, potential custodians seeking parental status. But that is for another case on another day.\n\nK.A., 484 A.2d at 998 (emphasis added). Interestingly, this court did not advert to Lehr, perhaps because the facts showed abandonment by the objecting father, as well as an established foster family relationship with the child.\n\nIn another 1984 neglect case, In re M.M.M., 485 A.2d 180 (D.C. 1984), where there was no custodial or other meaningful relationship between the child and his natural mother -- who was mentally ill and violent -- we sustained termination of the objecting mother's parental rights in favor of a \"loving\" foster family. We reiterated K.A.'s message that if the natural mother had brought up the child and had custody at the time of the hearing, the Constitution might have required the court to apply the § 16-2353 (b) factors first with respect to the mother's fitness before considering other potential custodians. M.M.M., 485 A.2d at 184 n.4. Again, there was no mention of Lehr; the facts made the opportunity doctrine inapplicable.\n\nThree years later in In re C.O.W., 519 A.2d 711 (D.C. 1987), a termination proceeding concerning a neglected and sexually abused child who was in a prospective adoptive home (although an adoption petition was not before the court), we again affirmed the termination of parental rights over the natural mother's objection. The mother argued that § 16-2353 (b) was facially unconstitutional because only parental fitness should be considered at the termination hearing. We disagreed, citing J.S.R., K.A., and M.M.M., again noting that the result might have been different if the mother had retained custody, see C.O.W., 519 A.2d at 714 n.3. Appellant, however, had another argument: the \"best interest\" test \"inevitably invites a comparison of the natural parent and foster family in which the natural parent will always fall short,\" and thus termination will often be based \"on economic and cultural factors that were found objectionable by the Supreme Court in Santosky v. Kramer, 455 U.S. 745, 102 S. Ct. 1388, 71 L. Ed. 2d 599 (1982).\" C.O.W., 519 A.2d at 714. Without squarely ruling on this argument, we noted that the trial court had avoided \"possible constitutional infirmities that might arise if it appeared that all the court had done was to make a direct comparison of the natural parent and the foster home.\" Id. The trial court first addressed the child's \"special need\" as a result of sex abuse (by unknown persons), then in effect found the mother unfit, and \"only then\" turned to an evaluation of the child's current placement. Id. We implicitly approved that approach. Lehr, again, was apparently irrelevant.\n\nA year later in Appeal of U.S.W., 541 A.2d 625 (D.C. 1988), we sustained termination of parental rights in another neglect case over objection of the non-custodial father. The child -- a victim of fetal alcohol syndrome and fetal hydantoin syndrome -- had special needs for occupational and physical therapy. The trial court found that both parents, who were alcoholics and unable to hold steady jobs, were unable to meet their child's needs and that both were \"'seriously deficient in skills and insight needed to raise [C.E.W.]'\"; the foster parents were especially suitable because they \"were given training in infant stimulation.\" Id. at 625, 626. Concurring specifically, Judge Rogers noted that the father had \"regular and consistent interest\" in the child, in contrast with the \"intermittent interest\" of the father in K.A., U.S.W., 541 A.2d at 627 (Rogers, J., Concurring). Judge Rogers also noted that by the time of the hearing, a prospective adoptive home was \"no longer available.\" Id. The Judge agreed, however, that clear and convincing evidence supported the termination of parental rights in the child's \"best interests\" because the father \"has long had difficulty overcoming his own problems and has failed.\" Id. The father did not challenge expert testimony that termination would improve the child's prospects for adoption, and \"no claim is made that the father had been denied his 'opportunity interest' in his child.\" Id. at 627-28 (citing Buchanan, Constitutional Rights). Judge Rogers, therefore, acknowledged possible impact of Lehr. \u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nThe present case is thus the first in which we must consider an effort to terminate the parental rights of an apparently fit natural father who, although a non-custodial parent, had not abandoned his \"opportunity interest\" in gaining custody. As indicated earlier, we believe that under these circumstances Supreme Court caselaw culminating in Lehr mandates, as a matter of due process, that a fit parent must prevail over a prospective adoptive family unless clear and convincing evidence demonstrates that the natural parent's custody would be detrimental to the best interests of the child. We have already recognized that the Constitution may require consideration of a custodial parent's fitness, as a virtually controlling factor, before permitting termination of parental rights in favor of another custodian. K.A., 484 A.2d at 998; see C.O.W., 519 A.2d at 714 n.3; M.M.M., 485 A.2d at 184 n.4. We have also recognized \"possible constitutional infirmities\" if a court were to terminate even non-custodial parental rights by merely comparing the natural parent with a prospective custodial family to determine the child's best interests. C.O.W., 519 A.2d at 714. Finally, at least one Judge has heretofore recognized that a non-custodial parent's \"opportunity interest\" must be considered in appropriate cases. See U.S.W., 541 A.2d at 627-28 (Rogers, J., Concurring). Given this evolution of our caselaw -- and our first opportunity to consider Lehr directly -- I perceive no barrier to concluding that, by identifying a parent's protectible \"opportunity interest\" as a basis for evaluating the right to custody, the Stanley-Lehr line of Supreme Court cases mandates substantial constitutional protection of a fit non-custodial parent whose \"opportunity interest\" in custody is still intact.\n\nThis Conclusion means that although the applicable statutes, § 16-304 (e), (supra) note 17, and § 16-2353 (a) and (b), (supra) note 18, prescribe a \"best interests,\" not a \"fitness,\" test, we must construe \"best interests\" in a manner that preserves statutory constitutionality. Jermstad, 210 Cal. App. 3d at , 258 Cal. Rptr. at 532; see also Stuart, 72 App. D.C. at 396. Furthermore, Justice Traynor explained 35 years ago why, in any event, a child's best interests normally are achieved through custody of a fit parent:\n\nThe objection to the rule that custody must be awarded to the parent unless he is unfit carries the harsh implication that the interests of the child are subordinated to those of the parent when the trial court has found that the best interests of the child would be served by giving his custody to another. The heart of the problem, however, is how the best interests of the child are to be served. Is the trial court more sensitive than the parent to what the child's best interests are, better qualified to determine how they are to be served? It would seem inherent in the very concept of a fit parent that such a parent would be at least as responsive as the trial court, and very probably more so, to the best interests of the child. [Emphasis added.]\n\nIn re Guardianship of Smith, 42 Cal. 2d 91, , 265 P.2d 888, 891 (1954) (en banc) (Traynor, J., Concurring); see N.M.S., 347 A.2d at 927 (\"ordinarily a child's best interest is served by being with a fit parent\"); In re B.G., 11 Cal. 3d 679, , 114 Cal. Rptr. 444, , 523 P.2d 244, 254 (1974) (en banc) (parent fit to exercise custody may have better understanding of best interests than does juvenile court).\n\nIn sum, I construe D.C. Code § § 16-304 (e) and 16-2353 to incorporate a parental preference in determining the best interests of the child when an unwed, non-custodial father is fit and has not abandoned his opportunity interest. See Jermstad, 210 Cal. App. 3d at , 258 Cal. Rptr. at 520, 532 (civil code provision incorporating \"best interests\" standard for termination of parental rights, read in light of federal constitutional law, accords natural father parental preference where he has diligently pursued opportunity to establish custodial relationship, and thus best interests of child may not be measured by comparing father's circumstances with those of putative adoptive parents). Given controlling Supreme Court authority subsequent to the J.S.R.-P.G. line of cases, see P.G., 452 A.2d at 1184, I conclude in the context at issue that a \"best interests\" analysis which justifies termination of parental rights in an adoption proceeding without a finding of parental unfitness -- or a finding by clear and convincing evidence that custody in a fit parent would be detrimental to the best interests of the child -- no longer is available. See Frendak v. United States, 408 A.2d 364, 379 n.27 (D.C. 1979) (court may decline to follow prior decision when there has been subsequent change in governing law). A court in this context, therefore, cannot constitutionally use the \"best interests\" standard to terminate the parental rights of a \"fit\" natural father who has timely and continually asserted his parental rights and, instead, grant an adoption in favor of strangers simply because they are \"fitter.\" Cf. C.O.W., 519 A.2d at 714 (trial court resolved issue of parental fitness before evaluating child's current placement). \"The opportunity for protection of a custodial relationship is illusory if it is subject to being nipped in the bud by application of an unprotected best interest of the child comparison with prospective adoptive parents.\" Jermstad, 210 Cal. App. 3d at , 258 Cal. Rptr. at 532.\n\nAccordingly, I now apply the \"best interests\" standard to reflect the presumptive custodial rights of a fit natural father who has not surrendered his \"opportunity interest\" as defined by Lehr.\n\nC. The \"Best Interests\" Standard and Parental \"Fitness\"\n\nAs indicated earlier, the assumption that a natural parent's fitness incorporates the child's best interests may be suspect on occasion. There conceivably can be circumstances in which clear and convincing evidence will show that an award of custody to a fit natural parent would be detrimental to the best interests of the child. I therefore turn to the meaning of parental \"fitness\" and to the kinds of situations that could cause the court, despite a father's fitness, to terminate his parental rights.\n\nIn the first place, I do not believe a parent would be \"unfit\" only if the District of Columbia had grounds to intervene and take the child away if the parent had custody. But see Michael U. v. Jamie B., 39 Cal. 3d 787, 796 n.8, 218 Cal. Rptr. 39, 45 n.8, 705 P.2d 362, 368 n.8 (1985). Nonetheless, the § 16-2353 (b) factors, see (supra) note 18 -- as applied to the natural parent -- are of central concern: the child's prospects for \"continuity of care\" in a \"stable and permanent home\"; the parent's \"physical, mental, and emotional health\"; the \"quality of the interaction\" between parent and child; and, \"to the extent feasible, the child's opinion.\" See K.A., 484 A.2d at 998. Thus, in cases such as M.M.M., where the objecting mother was mentally ill and at times violent, or C.O.W., where the mother had serious emotional problems, or U.S.W., where there was a parental history of alcohol abuse and an inability to hold jobs, a \"fitness\" analysis as such apparently would have justified the termination.\n\nIf, however, a parent is not found unfit, under what circumstances, if any, could an award of custody to the parent be detrimental to the best interests of the child, such that termination of parental rights in favor of adoptive parents might be justified? In allowing for such a possibility, I do not try to define its contours or even to provide many examples. I am merely saying that presumptive custody for a \"fit\" parent subject to rebuttal in the child's best interests is not constitutionally precluded; I do not try to speak definitively on the scope of a \"best interests\" exception. I provide only minimal guidance in the form of suggesting considerations.\n\nMore than likely, given a common-sense application of the \"best interests\" exception, a parental preference will evaporate where circumstances beyond the control of the noncustodial, fit parent have created a situation that signals harm if the child is turned over to his or her parent. In California, for example, in applying a statutory \"detriment\" or \"actual harm\" exception to the \"fitness\" test, an appellate court concluded that negative evidence about the father was not necessary to a finding of detriment and then justified termination of the parental rights of a fit, non-custodial natural father solely because of the psychological harm that would result from removing the child from a prospective adoptive home where she had lived for five years. In re Baby Girl M., 191 Cal. App. 3d 786, 236 Cal. Rptr. 660 (1987). \u003cspan class=\"fnref\"\u003e39\u003c/span\u003e We do not have the California statute or its history, but the most obvious, and possibly the only, basis for denying custody to a fit parent in the best interests of the child would be a finding based on clear and convincing evidence that parental custody would actually harm the child.\n\nIn sum, under the adoption statute, D.C. Code § 16-304 (e) (1989), as applied to an unwed, non-custodial father who has not lost his \"opportunity interest,\" the trial court shall consider, first, the fitness of the father. If, for example, the court finds him generally fit, the court must deem him presumptively entitled to custody, subject to rebuttal only by clear and convincing evidence that the child's best interests require the court to deny the father custody. I would leave it to the trial courts to implement this approach case by case. I merely add that in allowing for the possibility that a fit natural father may lose parental rights because the best interests of the child would preclude a transfer of custody -- despite the father's best possible effort to preserve his \"opportunity interest\" -- we should not foreclose the possibility of a damages remedy, however inadequate, for violations of the father's statutory and constitutional rights that may have caused prejudicial delay.\n\nD. Resolution of This Case\n\nI turn, now, to the final issue: whether H.R. is a \"fit\" parent for Baby Boy C. and, if so, whether there is clear and convincing evidence that granting H.R. custody would be detrimental to the best interests of the child.\n\nWhere, as here, this court concludes that a new statutory interpretation, informed by constitutional requirements, should be applied by the trial court exercising its discretion, but the trial court has applied the statute differently in accordance with tradition, we ordinarily remand to afford the parties the benefit of the trial court's application of the proper standard. See Wright v. United States, 508 A.2d 915, 919-20 (D.C. 1986). On the other hand, if our review of the record were to indicate that, despite the violations of H.R.'s constitutional and statutory rights, the trial court could only have awarded custody of Baby Boy C. to the O. family under the proper standard applying the parental preference, we would be obliged to affirm as a matter of law. See Johnson v. United States, 398 A.2d 354, 364 (D.C. 1979) (\"facts may leave the trial court with but one option it may choose without abusing its discretion\").\n\nAlthough the trial court made no explicit findings about H.R.'s fitness to be a parent, the record strongly supports a finding that he is fit. Moreover, both of the expert witnesses who testified concerning the effects of a transfer of custody on Baby Boy C. assumed that H.R. would be a fit father, and Dr. Noshpitz explicitly so testified. I therefore proceed (solely for the sake of analysis) from this assumption.\n\nDespite H.R.'s fitness for fatherhood, however, both experts agreed that removing Baby Boy C. from the O. family would damage him psychologically. The trial court also found that the untried and unprecedented gradual transition proposed by Dr. Noshpitz could not eliminate the \"devastating\" effect of removing Baby Boy C. from the O. family. Under the circumstances, therefore, a remand of the case for application of the custodial preference arguably would not be necessary or appropriate; although the trial court's ruling was erroneously premised, one might be able to argue from the record that the trial \"'court, properly instructed, inevitably would reached the same result.'\" Wright, 508 A.2d at 920 (quoting Ibn-Tamas v. United States, 407 A.2d 626, 636 (D.C. 1979)).\n\nOn the other hand, we are given the trial court's incorrect application of the \"best interests\" standard, since H.R. was not evaluated for fitness and with a parental preference. And, we are given at least one expert who proposed a gradual transitional approach to custody that conceivably could have affected the trial court's view of the situation under the \"best interests\" standard correctly applied with a parental preference. On this record, therefore, I am not prepared to conclude that the \"best interests\" standard, even as newly interpreted, should be applied to deny H.R., the father, custody as a matter of law when there is no negative evidence about the father and thus the only possible harm would be the psychological impact on the child of a transfer from one fit custodian to another.\n\nAccordingly, the trial court must rule once again, with full freedom to reopen the proceedings as needed to inform the court about relevant events during the period that has elapsed since the last trial court order and the impact of those events on this petition. See In re A.B.E., 564 A.2d at 758; In re Baby Girl M., 37 Cal. 3d 65, \u0026 n.12, 207 Cal. Rptr. 309, \u0026 n.12, 688 P.2d 918, 925 \u0026 n.12 (1984) (en banc); Michael U. v. Jamie B., 39 Cal. 3d at 796, 218 Cal. Rptr. at 45, 705 P.2d at 368 (1985). In ordering a remand, however, we are aware that, because of the death of the trial Judge in this case, a new Judge will have to take over -- a Judge who, at this point, will be in no better position than we are to evaluate and apply the facts of record. I assume the court will first want to hear from counsel as to how the passage of time has affected their positions. If the case cannot be settled, perhaps Dr. Marans, Dr. Noshpitz, and others (if necessary) who are familiar with the record, could be recalled to help the court evaluate the factual record more thoroughly before the court itself applies the correct legal test. Although the trial court will be dealing with the child as of 1990, the court should be free to reevaluate Judge Riley's ruling of 1986, helped by expert testimony not available to us, with a view to deciding whether the court is in a position now to apply the correct legal test to the evidence as of 1986. If that would be possible and the court were to decide in favor of the adoptive parents, that would end the matter (subject to the right of appeal); if the court were to conclude custody should have been awarded to H.R., then the court might wish to reopen the proceedings for consideration of developments since 1986.\n\nThe judgment awarding custody of Baby Boy C. to the O. family should therefore be reversed and remanded. \u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nVII. POSTSCRIPT\n\nJudge Belson argues that H.R. had sufficient actual notice about Baby Boy C., early enough, to make H.R.'s constitutional and statutory rights to notice superfluous, or at least the failure to comply with those rights harmless. I profoundly disagree. H.R. did not learn for sure that he had a child until October 1983, a month after Barker had placed Baby Boy C. with the O. family. In October 1983, L.C. told H.R. that the baby had been placed in an adoptive home and that they would never be able to see him again. No later than November 1983, H.R. -- who had difficulty comprehending the adoption process in the absence of any notice containing his rights -- told L.C. that he wanted the baby if she were unwilling to raise him herself. In January 1984, H.R. called Barker, acknowledged paternity, and expressed confusion about giving up his rights. Barker learned, just days later, that H.R. had written to L.C. and had explicitly refused to consent to adoption.\n\nNo one disputes that Barker learned early on, of H.R.'s unwillingness to consent to adoption, and that everyone in authority failed to assure that H.R. knew what his legal rights were, including his right to seek custody in a proceeding already underway to consider the child's adoption by strangers. Judge Belson, nonetheless, would require H.R. to have used his own imagination to carry out a veritable laundry list of additional self-help efforts to preserve his \"opportunity interest\" under Lehr in gaining custody of his child. My colleague has it backwards; he assumes that preservation of the father's \"opportunity interest\" -- an accomplishment requiring legal action -- is a matter of intuition. Due process is premised on another understanding: legal consequences, including the loss of rights, flow only from failure to act upon adequate notice. The burden of telling H.R. his rights and obligations lay with Barker and the court; H.R. did not have a responsibility, at his peril, to find out or intuit what others were required by law to tell him but did not.\n\nThe concern, moreover, is not merely lack of notice of the adoption proceeding but, more broadly, the lack of notice of the right to seek custody, of whom to contact, of how to proceed, and of how quickly action must be taken. All this Judge Belson imputes to H.R.'s responsibility for self-help in the context of a foreign national whose child has been taken by the state before the father even knew the baby was born, who confronted undisclosed legal procedures with which he was altogether unfamiliar, and whom Barker -- as representative of the state -- made little effort to contact even though Barker had access to more current address information than it used. In short, because state action -- and inaction -- violated H.R.'s rights to due process, he cannot be said to have abandoned his opportunity interest in parenting Baby Boy C.\n\nJudge Belson justifies his approach by embracing concepts of actual and constructive notice. He says he is \"satisfied that the amount and quality of notice afforded appellant overcame his claims of deprivation of procedural due process,\" post at 135, citing as his authority a case standing for the proposition that notice to a close corporation regarding allegedly fraudulent importation of bark tea provided actual notice to one of the two shareholder-officer-employees, and constructive notice to the other, of their potential personal liability for a civil penalty. See United States v. United Priority Products, Inc., 793 F.2d 296, 300 (Fed. Cir. 1986). Unquestionably, each defendant in that case personally received the entire notice he or she was entitled to for an explanation of personal exposure -- in sharp contrast with the defaults of notice to which H.R. was entitled. The fact that Judge Belson offers a long list of self-help measures H.R. should have taken in order to learn of his rights suggests that my colleague relies less on actual notice than on constructive or inquiry notice as a sufficient basis for terminating a father's right to seek custody of his infant child. The Constitution and our local statutes afford considerably more protection than that, as elaborated earlier.\n\nJudge Belson also would affirm, even assuming inadequate notice to H.R., on the ground that \"the finding of the devastating effect upon Baby Boy C. that would be caused by his removal from the O. family mandates the ultimate finding that a transfer of custody to H.R. would be detrimental to Baby Boy C.'s best interests or, in Judge Ferren's terminology, would actually harm the child.\" Post at [ ]. In the end he may be right. The problem is, however, that the trial court's finding that removal of the child from the O. family would be \"devastating\" was made in the context of applying the traditional \"best interest of the child\" standard without consideration of the parental preference or the fitness of the father, H.R. But even if we assume that the trial court made this finding in a vacuum, we cannot properly assume that the court's application of that finding, while looking through the prism of an erroneous legal test, would be the same when looking through another prism intended to grant presumptive custody to a fit natural father as against strangers.\n\nIn this case the trial Judge asked herself whether custody in the adoptive family or in the natural father would be in the \"best interest\" of the child -- considering each to be on an equal footing -- and ruled in favor of the adoptive family, finding that a transfer of custody would be \"devastating\" to the child. If, however, the Judge had to begin with a presumption of custody in a fit natural father -- a presumption that the child's best interests lay in the father's custody -- we cannot be sure either that the Judge would have found that a transfer would be devastating or, in any event, that it would be so devastating that, on balance, the father should be denied custody because it would be contrary to the child's best interests (or, as I would prefer, because it would bring actual harm to the child). \u003cspan class=\"fnref\"\u003e41\u003c/span\u003e In Malat v. Riddell, 383 U.S. 569, 572, 86 S. Ct. 1030, 16 L. Ed. 2d 102, (1966), the Supreme Court -- interpreting a word in a tax statute differently from the interpretation given by the district court -- stated the applicable rule:\n\nSince the courts below applied an incorrect legal standard, we do not consider whether the result would be supportable on the facts of this case had the correct one been applied. We believe, moreover, that the appropriate Disposition is to remand the case to the District Court for fresh fact-findings, addressed to the statute as we have now construed it. Malat makes clear that the legal implications of any factfinding, no matter how simple, cannot be divorced from the applicable rule of law. It is the law that gives those facts significance and, ultimately, their true meaning.\n\nROGERS, Chief Judge, Concurring: In this appeal from an order of adoption, the court must determine whether H.R. grasped his opportunity interest and, if so, whether the trial Judge applied the correct standard in concluding that Baby Boy's best interest called for his adoption by the O. family over his natural father's objection. I join Judge Ferren in concluding that H.R. has grasped his opportunity interest under the unusual circumstances presented by this case, and that H.R.'s statutory right to receive immediate notice of the adoption proceeding was violated. Because I also conclude that the trial Judge failed to apply the best interest standard of the adoption statute, as long interpreted to include a presumption in favor of a fit natural parent over a stranger to the child, I join Judge Ferren in concluding that a remand is required. Accordingly, I join Part I (Facts and Proceedings) and Part V (Violations of H.R.'s constitutional and statutory rights) of Judge Ferren's opinion. I am unable to join his formulation of the post-Lehr \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e standard based on his view that Lehr creates, as a matter of substantive due process, a parental preference. In my view it is unnecessary to reach the constitutional issue that he presents. Further, I find no occasion to apply the guardianship statute to adoptions. Rather, the statutory best interest standard for adoption must apply. I also find no occasion to address the adequacy of the child placement regulations (see Part V (B) of Judge Ferren's opinion).\n\nThe statutory standard in the District of Columbia for determining custody disputes between a natural parent and a stranger has been long settled. In Davis v. Jurney, 145 A.2d 846 (D.C. 1958), the court stated:\n\nThe controlling principle by which the courts must be guided in cases of this kind is well settled. The paramount concern is the child's welfare and all other considerations, including the rights of a parent to the child, must yield to its best interests and well-being. While no precise formulae can be devised to aid the court in its determination as to what is best for the child, certainly the application of this broad principle does not demand that the right of a parent be ignored. Under our Code the father and mother are the natural guardians of their minor children. Case law has affirmed this by recognizing the preferential claim of a natural parent in contests involving nonparents. With added consistency the Court of Appeals recently stated in Bell v. Leonard:\n\n\"'Except where a non-parent has obtained legal and permanent custody of a child by adoption, guardianship or otherwise, he who would take or withhold a child from mother or father must sustain the burden of establishing that the parent is unfit and that the child's welfare compels awarding its custody to the nonparent. * * * In other words, the burden rests, not, for instance, upon the mother to show that the child's welfare would be advanced by being returned to her, but rather upon the nonparents to prove that the mother is unfit to have her child and that the latter's well-being requires its separation from its mother.' People v. ex rel. Kropp v. Shepsky, [305 N.Y. 465, 469, 113 N.E.2d 801, 804 (1953)]; Skeadas v. Sklaroff, [84 R.I. 206, 122 A.2d 444, (R.I.), cert. denied, 351 U.S. 988, 76 S. Ct. 1051, 100 L. Ed. 1501 (1956)]; People ex rel. Fentress v. Somma, Sup., [127 N.Y.S.2d 169 (1953)].\" [102 U.S. App. D.C. 179, 184, 251 F.2d 890, 395 (1958)] [footnotes omitted].\n\nThe foregoing represents no new principle of law, but merely reflects the wisdom of human experience that children ordinarily will be best cared for by those bound to them by the ties of nature. Where compelling circumstances are shown and the best interests of the child require an award to someone else, the court has but one choice. However, such an award can only be justified after the welfare and best interests of the child and the legal and natural rights of the parent have both been carefully considered.\n\n145 A.2d at 849. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nBell v. Leonard, supra, 102 U.S. App. D.C. 179, 251 F.2d 890, quoted in Davis v. Jurney, was an adoption case. In Bell the natural mother sought to regain custody of her nine-year-old daughter from a stranger who wanted to adopt the child. Id. at 180, 251 F.2d at 891. The mother, who had been in \"sore straits, jobless yet caring for the infant,\" had initially agreed to let Bell, a stranger to the child, take care of the child while she worked during the week. Id. When the mother sought to take her child on weekends, Bell protested and the upset mother decided she should reclaim her child altogether. Id. The mother filed petitions seeking custody of her child but was unsuccessful, apparently because she was planning to leave the country for a period of several years. Bell filed a petition for adoption of the child. Id. at 181, 251 F.2d at 892. When the mother returned to the country three years later, the trial court granted her request for custody and dismissed Bell's petition for adoption. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Id. The U.S. Court of Appeals for the District of Columbia Circuit affirmed, pointing to the presumption that children are better off with their natural mother, and that a fit natural mother is entitled to her own child as against the claim of a stranger even where the stranger has had custody of the child for a number of years. Id. at 184, 251 F.2d at 895. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nThis was in accord with the long-standing principle in this jurisdiction that the paramount consideration in awarding custody is \"the permanent advantage and welfare of the children.\" It also is consistent with the guardianship provisions upon survivorship of a parent. Thus, where the father is deceased and \"the mother is a proper person, able and willing to provide properly for the wants of her children . . ., the law recognizes the priority of her right to their custody and control.\" Beall v. Bibb, 19 App. D.C. 311, 313 (1902). In Beall v. Bibb, the mother's custody was opposed by the children's maternal grandmother and maternal aunt who had maintained custody of the twin eleven-year-old children for at least the past four years. Id. at 311. The court observed that transfer of custody to a particular person or deliberate abandonment would, under ordinary conditions, be very strong evidence of a lack of fitness on the part of the natural parent. Thus, the revived claims of such parents may only be denied, however, if the relations between the children and the non-parent custodians had become such that to sever them would be \"necessarily cruel or painful.\" Id. at 314. See also Shelton v. Bradley, 526 A.2d 579 (D.C. 1987) (under D.C. Code § 21-101 (1981), statutory presumption of custody in surviving natural parent).\n\nAccordingly, the interpretation of the statutory standard for adoption under our Code is fully consistent with recognition of the constitutional right of a natural father not to be denied his opportunity interest in seeking custody of his child. \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e District of Columbia caselaw suggests a well-established presumption to determine custody disputes between a natural parent and strangers favoring the award of custody to the natural parent, absent an affirmative showing of unfitness, as consistent with the best interest of the child. See, e.g., In the Matter of N.M.S. 347 A.2d 924, 927 (D.C. 1975) (ordinarily a natural mother cannot be deprived of child absent showing of unfitness or inability to care for child); Johnson v. Lloyd, 211 A.2d 764 (D.C. 1965) (to withhold a child from its natural parent there must be proof that the natural parent is unfit and that the child's welfare compels awarding custody to the nonparent, child's welfare being \"inextricably bound up\" with the right of the parent). \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e\n\nIn recent opinions the court has addressed a series of constitutional challenges to the adoption and termination of parental rights statutes. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Finding no constitutional basis for requiring a determination of unfitness as a precondition to the termination of a natural parent's custodial rights, the court did not refer (at least not explicitly) to a custodial preference for a fit natural parent. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Rather, the court simply viewed the best interest of the child as the dispositive factor. In three of the recent cases, the court rejected constitutional challenges to our interpretation of the statutory standard for adoption, and in so doing relied on decisions referring to circumstances in which a natural parent would forfeit his custodial rights. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e In no case has the court indicated that it abandoned or qualified the long held interpretation of the statutory best interest standard. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Indeed, as recently as 1985, the court noted the pervasiveness of the best interest standard, going back to the end of the last century in Wells v. Wells, 11 App. D.C. 392, 395 (1897), as the accepted test in child custody cases between spouses, between a natural parent and foster parents, in child neglect proceedings, and in adoptions involving a stranger. In re D.I.S., 494 A.2d 1316 (D.C. 1985) (citations omitted) (affirming adoption by grandmother and removing child from foster family notwithstanding consideration of psychological bonding of child and continuity of care). \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nNothing in Lehr suggests that the statutory interpretation is constitutionally defective. In Lehr, the Supreme Court held narrowly. The natural father in that case claimed that he was entitled to notice and a hearing before his child could be adopted. The lower court and the Supreme Court rejected his claim, holding instead that his right to due process was protected by the registry system established under state law. 463 U.S. at 265. The Court so held notwithstanding the father's active efforts to assert his rights to custody of his child. Justice Stevens discussed the nature and effect of the natural father's opportunity interest, commenting that when an unwed father demonstrates a full commitment to the responsibilities of parenthood by coming forward to participate in the rearing of his child, in other words, preserves his \"opportunity interest\" in custody, his interest in personal contact with his child acquires substantial protection under the Due Process Clause. Id. at 261. Accordingly, the Court concluded that the state must provide sufficient means to efficiently exercise one's rights, that is, sufficient means to seize one's opportunity interest and attain custody of their child. Nevertheless, the natural father, who had filed a petition seeking a determination of paternity and visitation privileges before the decree of adoption was entered, did not prevail on his due process (or equal protection) claim.\n\nJudge Ferren's more expansive reading of the holding in Lehr, adopting the analysis in a law review article that Lehr creates a substantive due process right in a natural parent to custody, see opinion at 37-40, would require this court to overturn its previous decisions about the elements of the constitutional standard. Neither Lehr, nor pre-Lehr Supreme Court decisions interpreted in light of Lehr, require such an overhaul of our law. While the Court refers to a natural father's parental interest in the care and custody of his child as deserving of \"substantial protection under the Due Process Clause,\" Lehr, 463 U.S. at 261, nothing in Lehr indicates that the Court was talking about a substantive, rather than a procedural, due process right incorporating a parental preference. Indeed, by affirming the constitutionality of a statutory limitation on the category of natural fathers whose parental rights are protected and denying Mr. Lehr, who continually tried to assume responsibility for his child, a right to notice and hearing before the adoption decree was issued and his parental rights were terminated, the majority in Lehr retreats from the broader position taken by the Dissent in recognition of the valuable interest in parenting one's own child. See Lehr, supra, 463 U.S. at 272-73 (White, J., Dissenting). Even were there some implicit substantive due process right protecting a natural father's interest in taking care and custody of his child, nothing in Lehr, either alone or in conjunction with Stanley v. Illinois, 405 U.S. 645, 92 S. Ct. 1208, 31 L. Ed. 2d 551 (1972), Caban v. Mohammed, 441 U.S. 380, 99 S. Ct. 1760, 60 L. Ed. 2d 297 (1979), and Quilloin v. Walcott, 434 U.S. 246, 255, 98 S. Ct. 549, 54 L. Ed. 2d 511 (1978), suggests that the best interest standard is inconsistent with due process or that the natural father's right is preeminent. \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e Indeed, since Lehr the Court has made clear that a natural father's right to a relationship with his child is not unlimited and can be defeated by a statutory presumption even in the absence of a hearing before termination of his parental rights. Michael H. v. Gerald D., 491 U.S. 110, 109 S. Ct. 2333, 105 L. Ed. 2d 91 (1989). \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e The provision in the District of Columbia Code requiring that a natural parent must be \"immediately\" notified of an adoption proceeding meets the requirements of due process as defined by Lehr. See Michael H. v. Gerald D., supra, 109 S. Ct. at 2347 (Stevens, J., Concurring). Lehr does not, in my view, provide further constitutional protection to H.R. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nUnder our adoption statute, a natural father, who has not abandoned his opportunity interest in seeking custody of his child, is entitled to custody of the child, where the mother has surrendered her parental rights in favor of adoption of the child by a strangers, absent a showing that such custody would not be in the best interest of the child. As between such a natural parent and strangers to the child, the burden of proof is on the strangers to show by clear and convincing evidence that the best interest of the child requires custody be placed with the strangers. This burden will not be easily met where the parent is deemed to be fit since that circumstance ordinarily will embrace the concept that a fit parent will be responsive to the best interests of the child. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e An exception may arise where the child is residing in a pre-existing unit. See Quilloin, supra, 434 U.S. 246, 98 S. Ct. 549 (no violation of substantive due process by use of best interest of child standard where natural father never had and never sought custody). \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nThis formulation of our standard is consistent with the District's legislative policy emphasizing the primacy of the best interest of the child who is sought to be adopted while giving full recognition to the natural parent's opportunity interest. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e Lehr does not require that we abandon our interpretation of the best interest standard. Indeed, Lehr does not abandon or revise the Court's emphasis on a child's best interest, see Quilloin v. Walcott, supra, 434 U.S. 246, 98 S. Ct. 549. In addition, since the District of Columbia has never adopted by statute the \"detrimental\" or \"harm\" standard as appeared in a now repealed California statute and as appears in the Uniform Parentage Act, there is no basis to import that standard into our law. \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Nor is there any indication that the legislature has abandoned the fit parent presumption underlying the best interest standard for adoption. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nAccordingly, in an adoption proceeding to which the natural father does not consent, the trial court must first determine whether the father has grasped his opportunity interest. If so, then the court must determine whether the father is a fit parent. \u003cspan class=\"fnref\"\u003e20\u003c/span\u003e If he is a fit parent, then he is presumed to be entitled to custody of his child. That presumption is rebuttable, however, upon a showing, by clear and convincing evidence, that the best interests of the child require that the child be placed in the custody of the strangers. In sum, while the applicable statute prescribes a \"best interests\" standard in determining custody, I would affirm the court's long held interpretation of D.C. Code § 16-304 (e) incorporating a parental preference in determining the best interest of the child when a non-custodial parent is fit and has not abandoned his opportunity interest. This is consistent with Lehr, and also with the statutory standard applied in this jurisdiction in recognition of the reality that only on rare occasions will custody with a fit natural parent fail to coincide with the best interests of a child.\n\nBecause the trial court failed to consider H.R.'s parental preference, a remand is required. Armstrong v. Manzo, 380 U.S. 545, 551, 85 S. Ct. 1187, 14 L. Ed. 2d 62 (1965) (reversing judgment confirming adoption decree and remanding case where failure to timely notify natural father of adoption proceedings placed burden on him that he otherwise would not have had); see Davis v. Jurney, supra, 145 A.2d at 850 (where fitness is necessary issue for Disposition of custody of 9 year old child and there is no indication what trial Judge would have found regarding natural parents' fitness, a remand for a new hearing is required) (citing Schroeder v. Schroeder, 133 A.2d 470 (D.C. 1957) (new trial where error of law)); cf. Bazemore v. Davis, 394 A.2d 1377 (D.C. 1978) (en banc) (remanding in absence of trial court's determination of best interest of child in custody dispute between natural parents). H.R. argued in pleadings before the trial court that the burden was on the O. family to show by clear and convincing evidence that it would be in the child's best interest to be placed with them. The record reveals that the trial court placed, and continued to place even after the evidentiary hearings had begun, an affirmative burden upon H.R. to come forward, in order to prevent the interlocutory decree of adoption from becoming final, with \"evidence as to why the adoption would not be in the child's best interests,\" ignoring the preference favoring the natural parent. \u003cspan class=\"fnref\"\u003e21\u003c/span\u003e While the trial court's final order permitting the adoption by the O. family includes a finding that the O. family established by clear and convincing evidence that it is in Baby Boy C.'s best interest to remain with the O. family, it is not clear that the trial court recognized at any point throughout the proceedings that the best interest standard includes a preference favoring the natural parent. Indeed, the trial court's finding that H.R. had not grasped his opportunity interest and its Conclusion of law that a finding of unfitness was unnecessary were consistent with the trial court's view that the burden remained with H.R. Combined with the absence of any reference to the parental presumption, the record demonstrates that the prior legal standard was not applied in assessing whether the O. family had demonstrated by clear and convincing evidence that the child's best interests required the permanent severing of any relationship between H.R. and his child. This court is not in a position to second guess the outcome had the trial court applied the best interest standard incorporating the parental preference in H.R.'s favor.\n\nThe division is in agreement that the \"best interest\" standard of our adoption statute incorporates a rebuttable presumption in favor of a fit unwed father who has grasped his opportunity interest. Accordingly, upon remand the trial court should give effect to H.R.'s unabandoned opportunity interest in the custody of Baby Boy C., in determining whether H.R. is a fit parent, and if so, whether the O. family has demonstrated, by clear and convincing evidence, that Baby Boy C.'s best interest require his custody to be placed in the O. family with or without visitation or other rights by H.R.\n\nBELSON, Associate Judge, Dissenting from the result: I disagree with the result reached by Chief Judge Rogers and judge Ferren for two reasons.\n\nFirst, I disagree fundamentally with their holding that \"as a matter of law\" H.R. cannot be deemed to have \"abandoned\" his so-called \"opportunity interest\" in developing a parent-child relationship with Baby Boy C. Cf. Lehr v. Robertson, 463 U.S. 248, 103 S. Ct. 2985, 77 L. Ed. 2d 614 (1983). Tbe relevant facts as found by Judge Virginia Riley, the most salient of which are not disputed, demonstrate that H.R. could readily have grasped his \"opportunity interest\" but failed to do so despite having received notice of the birth of his son in ample time to \"come forward to participate in the rearing of his child.\" Caban v. Mohammed, 441 U.S. 380, 392, 99 S. Ct. 1760, 60 L. Ed. 2d 297 (1979).\n\nSecond, even if we should assume, arguendo, that H.R. had seized his opportunity interest under Lehr and Caban, H.R. still would not be entitled to prevail in his opposition to the adoption of Baby Boy C. by the O. family because the trial court credited the testimony of an expert witness, Allen E. Marans, M.D., that removal of Baby Boy C. from the only family he had ever known would have a \"devastating\" effect on the child. Even if H.R. should be found a \"fit\" father (as Dr. Marans assumed he was) who had seized his opportunity interest, the finding of the devastating effect upon Baby Boy C. that would be caused by his removal from the O. family mandates the ultimate finding that a transfer of custody to H.R. would be detrimental to Baby Boy C.'s best interests or, in Judge Ferren's terminology, would \"actually harm\" the child. (Opinion of Ferren, J., at ). Under any view of applicable law advanced in the three opinions of this division, the result reached by the trial court must be affirmed because of this unassailable finding of fact. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e\n\nI.\n\nI restate the facts only to the extent necessary to demonstrate two points: 1) as the trial court determined, H.R. failed to grasp the opportunity interest that Lehr and antecedent authority recognized in unwed fathers, despite having received actual notice of the planned adoption one or two days following Baby Boy C.'s birth; and 2) the record fully supports the trial Judge's unqualified finding of the devastating effect upon Baby Boy C. of separation from the O. family.\n\nH.R. and L.C.'s relationship lasted from April, 1982, when they met in Zaire, through November, 1982, when they stopped seeing each other. L.C. was one week pregnant with Baby Boy C. at the time of their last meeting. Throughout the eight-month period that they were \"going together\" H.R. was engaged to be married to a Zairian woman, E.R., \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e then living in Paris. H.R.'s marriage to E.R. took place in December, 1983. At that time, E.R. was in Paris and H.R. was in Zaire. The trial court found that H.R. told E.R. about Baby Boy C. in April, 1984, when H.R. joined E.R. in France, eight months after the child's birth.\n\nL.C. left Zaire in April, 1983, when she was five months pregnant, and gave birth to Baby Boy C. in Washington, D.C. on August 5, 1983. Ten days after Baby Boy C.'s birth, having heard nothing from appellant since her departure from Zaire, L.C. relinquished her parental rights to the Barker Foundation, a licensed child-placement agency, so that Baby Boy C. might be placed for adoption. During this period, both L.C. and Barker wrote to appellant at his university.\n\nUpon her departure from Zaire, L.C. had written appellant H.R. a letter informing him that she was pregnant and that he was the biological father. By letter dated May 31, 1983, when L.C. was at least six months pregnant (and elective abortion no longer an option), Barker notified H.R. that L.C. had been working with Barker \"with a view to placing the child she expects in July, 1983, for adoption.\" Significantly, the letter invited H.R. to telephone Barker collect if he wished to have any more information. In addition, although the letter did not notify appellant that a specific court proceeding had been initiated concerning the adoption of Baby Boy C. (which, of course, was not so at the time the letter had been mailed and received), the letter referred to \"placement for the child,\" advice by Barker's \"legal counsel,\" that the documents sent with the letter could \"not be subpoenaed for use in any other proceeding\" (emphasis added), that the forms must be \"notarized,\" and that the Barker Foundation was \"licensed through the Department of Human Services of the District of Columbia.\" (quoted in Opinion of Ferren, J., at ).\n\nAppellant H.R. received this correspondence from Barker within a few days of Baby Boy C.'s birth and approximately one month after graduating from a university with a degree in law. Rather than telephoning Barker for more information, as suggested in Barker's letter, or contacting American lawyers in Zaire officials at the U.S. Embassy in Zaire, appellant wrote a letter to L.C. on August 12, 1983, in care of her parents, stating in part that if she later married a racist, she should send the child to him to raise \"if life with her husband is impossible.\"\n\nAppellant used the mails to write L.C. although they were slow and unreliable. L.C. received his August 12, 1983, letter sometime in mid-September. Appellant also failed to write to Barker or to fill out the forms. Thus, the record supports the trial Judge's finding that, during the crucial weeks following the birth of Baby Boy C., appellant was not seizing his opportunity interest.\n\nNot having heard from appellant, the Barker Foundation placed Baby Boy C. with the O. family on September 22, 1983. On the same day, the O. family filed a petition for adoption in the Superior Court.\n\nDuring October, 1983, appellant received confirmation, through two telephone calls he placed to L.C., that a child had been born, a boy, that L.C. had given up her parental rights to the boy, that Baby Boy C. had been placed in an adoptive home, and that a court was involved. In these telephone conversations, L.C. encouraged him to contact the Barker Foundation. L.C. testified that H.R. supported her decision to put Baby Boy C. up for adoption. In November and December 1983, L.C. wrote appellant two letters describing what she knew of Baby Boy C.'s adoptive placement and expressing her belief that the child was well cared-for.\n\nAfter receiving these letters, appellant finally made a telephone call to the Barker Foundation. This call was placed on January 17, 1984, five and one-half months after Baby Boy C.'s birth and appellant's receipt of Barker's May, 1983, letter. In response to a question on cross-examination as to why he waited from August, 1983, until January, 1984, to telephone Barker, H.R. testified: \"It is a matter of temperament. I preferred first to examine the situation before making a decision.\" By this time, Baby Boy C. had been with the O. family for four months, and H.R. had not made any effective effort to assume the role of a parent.\n\nThere was some disagreement as to what appellant H.R. told Barker about his wishes for Baby Boy C. H.R. testified that he told Barker he wanted to \"recuperate\" or pick up his son. Appellant also testified that he \"requested clarification on the situation\" of his child. Barker understood appellant to request only clarification of the forms (and the trial court so found). What is not in dispute is that appellant informed Barker that he would be more likely to receive correspondence addressed to him in care of the Peace Corps in Zaire. At the same time, appellant told Barker that he was expecting to take a trip to France or to Canada shortly, during which he hoped to come to this country to see the child.\n\nAppellant acknowledged that he received a letter sent by Barker on February 6, 1984, concerning the adoption procedures in the United States and testified that it made him determined to fight to gain custody of Baby Boy C. At about the time the letter was sent, appellant called L.C., but did not contact the Barker Foundation either to voice his opposition to the adoption or to fill out the forms. Appellant testified that he did not seek an American lawyer in Zaire because he was soon to leave the country, and that he decided not to consult with the American Embassy in Zaire because \"it wasn't necessary\" to consult with anyone familiar with U.S. law on adoption. He stated, however, that \"I can understand that the court would expect that I could contact an American lawyer.\" By this time, the child was over six months old, and H.R. was still taking no effective steps to assert his interest in custody.\n\nIn late April, 1984, appellant's government sent him to Paris, France, to continue his law studies, rather than to Canada. Appellant telephoned L.C. twice in early May, 1984, and informed her of his situation. Appellant testified that during these conversations he asked L.C. to inform the Barker Foundation that he intended to come to the United States to take custody of Baby Boy C. when he had saved enough money. He acknowledged, however, that when he telephoned her to wish her a happy Mother's Day, he promised her that he would think about consenting to the adoption.\n\nL.C. had a different understanding of their conversation. On May 8, 1984, she wrote Barker a letter in which she stated:\n\nGood news. . . . is in Paris, planning to try to find a job there or to return to his position in Zaire. He said he wanted to wish me a happy mother's day. . . . Tho he didn't have much to offer, he felt the best gift he could give was to sign the papers. He either already has or will sign them \u0026 send them in.\n\nH.R. was in France approximately six months before contacting an attorney in September, 1984. After his attorney advised him that he must take action if he wished to gain custody of Baby Boy C., appellant wrote a letter to the Barker Foundation, informing Barker for the first time of his Paris address and stating:\n\nI have reflected a lot on this situation and fear that we probably have different points of view concerning what would be considered in the best interests of the child. Since [Baby Boy C.] has been rejected by his mother I do not believe that it is in his best interests that I distance myself from him. On the contrary, having been deprived of the person who would have been a marvelous mother for him, there only remains for him his true father, before any other solution.\n\nTherefore I cannot give my consent to any plan which would result in separating him further from his biological parents.\n\nI regret not being able to accept this full adoption project for the benefit of people who are foreign and unknown to [L.C.], [Baby Boy C.], and myself.\n\nTherefore I am ready to recover the child as soon as you feel yourself no longer able to exercise [L.C.'s] rights as she would have exercised them if she still had rights to the child.\n\n(Emphasis added). Although appellant mailed this letter on December 1, 1984, Barker did not receive it until February 6, 1985. As the last paragraph of the letter reveals, H.R. remained ambivalent about assuming his role as a father. Baby Boy C. was over 16 months old when Barker received it, and H.R. was still equivocating about his possible role as a parent.\n\nOn February 25, 1985, appellant wrote Barker another letter advising that he had retained an attorney and had admitted paternity. He asked Barker to inform the court that he did not intend to abandon his child to anyone but L.C. In addition, he stated that he would like to gain custody of Baby Boy C. by his second birthday. He proposed that once he gained custody, Mr. and Mrs. O., appellees, be given visitation rights during vacations.\n\nThe trial at which the foregoing facts were elicited also occasioned the testimony of two child psychiatrists. Dr. Allen Elias Marans testified that based on his interviews with Baby Boy C. and the O. family, he thought that the family was doing an outstanding job of raising Baby Boy C. Dr. Marans concluded that removal of Baby Boy C., then 23 months of age, would be \"devastating\" to Baby Boy C. Dr. Marans viewed the rapprochement period that Baby Boy C. was then going through as a crucial developmental stage. Removing Baby Boy C. from the only family he had ever known would mean, in Dr. Marans' view, that \"his full potential could never be reached either in the intellectual or emotional range.\" Removing Baby Boy C. from his prospective adoptive family would jeopardize his trust of future relationships. Such a change would cause the child to regress, as well. While agreeing that the effect of removing Baby Boy C. from his adoptive home could cause a \"permanent scar,\" Dr. Marans acknowledged during cross-examination that if Baby Boy C. were to be removed at age three, rather than at twenty-three months, the problems would be more of a nature of \"character development\" than \"gross impairment.\" On the subject of returning Baby Boy C. to his natural father, Dr. Marans noted that the \"biological tie does not compensate for the nurturing that has taken place.\" Dr. Marans concluded that it was in the best interest of Baby Boy C. to remain with his adoptive family.\n\nDr. Joseph Noshpitz, the expert called by H.R., testified that based upon his interview with the O. family, he found them \"wholesome people by and large, decent people. I have no problem feeling pretty good about them. . . .\" Dr. Noshpitz also acknowledged that they were very much in love with Baby Boy C. Dr. Noshpitz also had the opportunity to interview H.R. and E.R. and found them devoted to each other. Dr. Noshpitz thought that if H.R. were granted custody of Baby Boy C. the transfer of custody should not be immediate. Instead, he would recommend a \"transfer be made gradually and stepwise over a period of perhaps several years; that there be a process of transition into which all the people involved would have to engage and within which they would have to participate.\" Dr. Noshpitz agreed with Dr. Marans concerning the inadvisability of an immediate transfer of custody from the O. family to H.R. and stated that it would \"create great turmoil and great pain, great confusion, and I would not recommend it.\" He later agreed that such an immediate transfer to H.R. would \"create harm to the child. . . .\" Although Dr. Noshpitz advocated a gradual transfer of custody or really a form of joint custody between H.R. and the O. family, he was unaware of any studies to back up his theory. Dr. Marans, who was present for Dr. Noshpitz' testimony, testified that he considered Dr. Noshpitz' plan for a gradual transfer of custody \"naive.\" Dr. Marans further testified that such a joint custody arrangement would be damaging to the child. He stated: \"This child needs to be protected from the deluding and undermining impact of having two sets of parents at this time, with all the split loyalties and sense of loss and loss of identity and everything else. That is to me unquestionable.\" Dr. Marans reiterated his earlier view that the \"best interests of the child are served by this child's continuing the stable, sensitive working unit that his family represents now. . . .\"During cross-examination, Dr. Marans stated that upon learning that he was separated from his natural father who had sought him Baby Boy C. would experience \"anger and resentment but not destruction of personality as there would be now.\" The court credited Dr. Marans' testimony.\n\nOn September 11, 1986, after holding hearings over an extended period, the court granted the petition for adoption by appellees.\n\nThe court's order was accompanied by findings of fact and Conclusions of law. The court's findings included the following:\n\nTearing Baby Boy [C.] away from Petitioners' family and granting Respondent custody would force the child not only to leave the only home he has ever known, but also to adjust to an entirely new home, culture, family, and language. This indeed would be devastating to the child. The damaging effects could not be removed by the experimental and unprecedented gradual transition and custody that Dr. Noshpitz proposes.\n\nThus, the court found that H.R.'s \"refusal to consent to the adoption is contrary to Baby Boy C[]'s best interests\" and that \"Petitioners and Barker have established by clear and convincing evidence that it is in Baby Boy C[]'s best interests that he remain with Petitioners' family, and that Petitioners' petition for adoption be granted.\" I point out, parenthetically, that the foregoing quotation answers the concern expressed by Chief Judge Rogers that the trial court misallocated the burden of proceeding or persuasion, at least at the early stages of the hearing. (Opinion of Rogers, C.J., at ). It is clear that when Judge Riley considered the entire record, she placed the appropriate burden on petitioners and Barker. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe court expressly found that in the past appellant's intentions regarding his seeking custody of Baby Boy C. were ambivalent, a finding clearly supported by the record. The court noted that appellant waited several months before contacting Barker for the first time; that in appellant's January 17, 1984, telephone call he did not seek custody but only sought clarification of the documents that had been sent (thus rejecting H.R.'s testimony that he refused to consent to adoption in this call); that he did not respond to Barker's February, 1984, letter; that although appellant stated in his December 1, 1984, letter that he would not consent to the adoption, he did not specifically seek custody until his February 25, 1985, letter, in which he asked for custody before Baby Boy C.'s second birthday, five months later.\n\nThe court also found that appellant had never offered to provide financial support for Baby Boy C., except for an ambiguous offer to L.C. in the fall of 1983, and had never inquired into the child's health and welfare. The court concluded that appellant\n\ndid not make any attempt to establish a custodial, personal, or financial relationship with [Baby Boy C.] until, in July 1985, the Court asked him whether he had ever given or offered any gifts to [Baby Boy C.]. . . . If truly were interested in establishing a meaningful relationship with his child, he would not have allowed geographical separation to prevent him from establishing that relationship. . . . \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e\n\nIn addition, the court concluded: \"The efforts of Barker Foundation and the court to contact far exceeded the procedural protections upheld in Lehr. Through such efforts, was contacted, and he received his due-process hearing.\" The court observed that appellant had learned of the pregnancy by May, 1983, and of the proposed adoption by August, 1983: by October, 1983, he had confirmed the fact of the child's birth and the placement with the appellees; and by February, 1984, at the latest, when Barker sent its second letter, he was on notice that the proposed adoption involved a court proceeding, requiring \"compliance with specific court-administered procedures.\" The court noted that although appellant claimed he did not understand American law on adoption, he could have consulted the American Embassy or the American law firm in Zaire to ascertain his legal rights, something he declined to do. H.R. testified that in Zaire, adoptions involve the courts and government agencies.\n\nThe trial Judge also concluded that after appellant received Barker's reply, \"he frustrated the Court's efforts to give him notice of the adoption proceedings by failing to notify Barker of his move from Zaire to France,\" an action which he testified he felt he had no obligation to take. In addition, the court observed that although appellant stated that he moved to France to be in a better position to come to this country to obtain custody of his son, he did not come here until fourteen months later when he was ordered to do so by the court. Indeed, the first time appellant applied for entry to the United States was May 15, 1985. H.R. further testified that the idea of going to the United Stated in late 1983 after learning he had a son did not occur to him. During this time, he did not ask Barker for the name of the court or infer from Barker's letterhead, which bore a District of Columbia address, that the court might be located in the District of Columbia. Rather, he \"insisted that he need not have come forward in this adoption proceeding until he received 'official notice' of the proceeding.\"\n\nAs we discuss in more length below, the salient facts support the trial Judge's ruling that because H.R. did not take the steps that were reasonably available to assert his rights as a father, he did not become entitled to substantial constitutional protection afforded unwed fathers who do so, and that it is in Baby Boy C.'s best interests that he remain with the O. family.\n\nII.\n\nThe Supreme Court has dealt with the extent to which the due process clause affords protection to an unwed natural father's biological relationship with his child in just a handful of cases. In these cases, \"the Court has emphasized the paramount interest in the welfare of children and has noted that the rights of the parents are a counterpart of the responsibilities they have assumed.\" Lehr v. Robertson, 463 U.S. 248, 257, 103 S. Ct. 2985, 77 L. Ed. 2d 614 (1983). \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e In Lehr, the Supreme Court dealt with the procedural due process protection the state must give an unwed father who wishes to develop his \"opportunity interest\" in a relationship with his child. The father in Lehr had never supported and had rarely seen the two-year-old daughter he claimed as his own, but he had made efforts to locate her and her mother. The father and mother had lived together during the pregnancy and the father had visited the mother and infant in the hospital following the infant's birth. The mother had never identified him as the father, nor had the father entered his name on the State of New York's putative father registry. But, one month after the mother and her husband commenced an adoption proceeding, in which the putative father was not a party, the putative father filed a petition for paternity and visitation rights. The state court granted the petition for adoption without considering the petition for paternity. The United States Supreme Court upheld the state court's action, concluding that the state had afforded the unwed father adequate procedural protection.\n\nThe Court emphasized that \"'parental rights do not spring full-blown from the biological connection between parent and child. They require relationships more enduring.'\" Lehr, supra, 463 U.S. at 260 (quoting Caban, supra, 411 U.S. at 397) (emphasis removed). The Court also stated:\n\nThe significance of the biological connection is that it offers the natural father an opportunity that no other male possesses to develop a relationship with his offspring. If he grasps that opportunity and accepts some measure of responsibility for the child's future, he may enjoy the blessings of the parent-child relationship and make uniquely valuable contributions to the child's development. If he fails to do so, the Federal Constitution will not automatically compel a State to listen to his opinion of where the child's best interests lie.\n\n463 U.S. at 262 (footnote omitted).\n\nObserving that the \"right to receive notice was completely within [the father's] control,\" Id. at 264 -- he could have mailed a postcard which would have caused his name to be entered on the putative father registry -- and that he was presumptively capable of asserting and protecting his own rights, the Court concluded that due process was not offended by the state court's insistence on strict adherence to the procedural requirements of the statute. Id. at 264-65. Lehr thus held that the biological father did not have an absolute right to notice and a hearing. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e Having failed to develop a relationship with his child or to communicate his interest in that regard by placing himself on the putative father registry, Lehr was found not entitled to the hearing he sought.\n\nThe Court in Lehr compared the factual situation of that case with those presented in the three earlier Supreme Court precedents:\n\nThe difference between the developed parent-child relationship that was implicated in Stanley and Caban, and the potential relationship involved in Quilloin and this case, is both clear and significant. When an unwed father demonstrates a full commitment to the responsibilities of parenthood by \"coming forward to participate in the rearing of his child,\" Caban, 441 U.S. at 392, his interest in personal contact with his child acquires substantial protection under the Due Process Clause. At that point it may be said that he \"acts as a father toward his children.\" Id. at 389 n.7. But the mere existence of a biological link does not merit equivalent constitutional protection.\n\nId. at 261. As applied to this case, this language supplies the context for the trial Judge's ruling that appellant's interest here was not entitled to substantial protection under the due process clause because appellant had not in fact come forward to participate in the rearing of his child.\n\nLike the father in Lehr, appellant cannot claim that he has established an actual parent-child relationship with Baby Boy C. In fact, he has never seen his son. Unlike the father in Lehr, however, appellant neither saw L.C. after the first week of her pregnancy, nor contributed to L.C.'s financial support during her pregnancy and the birth of their child. See In re Adoption of Doe, 543 So. 2d 741, 745-46 (Fl. 1989) (unwed father's conduct during pregnancy in failing to provide any support to the mother relevant).\n\nI observe that my colleagues would tilt the playing field in H.R.'s favor by framing the question to be whether H.R. \"abandoned\" his opportunity. (Opinion of Ferren, J., at ; Opinion of Rogers, C.J., at ). The Supreme Court, on the other hand, has spoken in terms of the unwed father's affirmative duty to \"comee forward\" to participate in the rearing of his child. Lehr, supra, 463 U.S. at 261; Caban, supra, 441 U.S. at 392.\n\nThe record strongly supports the trial Judge's finding that the notice appellant received gave him sufficient information to enable him to come forward in timely fashion to establish a father-son relationship if he was then disposed to do so and to enable him to assert seasonably his legal rights as a natural father.\n\nIn sum, I would affirm the trial Judge's rejection of appellant's attempt to attribute to Barker or the court either his failure to come forward and establish a parental relationship with Baby Boy C. or his failure to assert his legal claims more expeditiously and thereby improve his chances of gaining custody of the child. Rather, I am satisfied that the amount and quality of notice afforded appellant overcame his claims of deprivation of procedural due process. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e See United States v. Priority Products, Inc., 793 F.2d 296, 300-01 (Fed. Cir. 1986) (Even in absence of notice required by statute, actual notice of administrative proceeding satisfied due process requirements by notifying shareholder that he could be sued in his individual capacity).\n\nEven assuming that the trial court erred in failing to provide prompt notice of the filing of the petition (itself or through Barker) as required by D.C. Code § 16-306 (a) (1989 Repl.), I would conclude that the notice actually afforded appellant by the court, Barker, and L. C. rendered harmless any error involved in failing to comply with the statute. I will return to the statutory notice issue after completing the analysis of appellant's due process claim.\n\nA chronological analysis of appellant's course of conduct as it related to his interest in assuming the role of Baby Boy C.'s parent will demonstrate how H.R. failed to grasp his opportunity to assume the role of Baby Boy C.'s father. When Baby Boy C. was born on August 5, 1983, appellant had a strong claim to the opportunity to develop a relationship with his son and to his son's custody. Only L.C.'s claim was as strong, but she planned to, and subsequently did, relinquish all her parental rights. Not yet having been placed with a family, Baby Boy C. had developed no ties with others which might have served to undercut appellant's potential relationship with his child. From that time until Baby Boy C. was placed with the O. family on September 22, 1983, almost seven weeks later, appellant possessed a full opportunity to come forward to commence a relationship with his child. Furthermore, appellant Was notified of the plans for adoption through Barker's May 31, 1983, letter, which he received within days of the child's birth. There was testimony from Barker that, had appellant come forward at that time, he would have been given custody of Baby Boy C. Appellant, however, failed to respond to Barker, even to the extent of taking up Barker's offer to make a collect telephone call, or to indicate any interest in custody of the child for himself.\n\nAppellant's opportunity to assert his parental rights began to wane when the Barker Foundation, not having heard from him, placed Baby Boy C. for adoption. At that point, the O. family, rather than appellant, began to develop a parent-child relationship with Baby Boy C., and it became stronger as time passed. With the strengthening of the bonds between Baby Boy C. and the prospective adoptive family, appellant's opportunity to develop a relationship with his child withered. Appellant maintains that he has always professed his strong love for the child, at least to L.C. Even if that is so, he failed to express it in a way that would have established a relationship with the child at a time when bonding was critical. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e During this time appellant undertook none of the normal parental responsibilities that would have helped him develop a relationship with his child. Rather, he communicated with L.C. sporadically. Appellant acknowledges that as late as May of 1984 when Baby Boy C. had been with the O. family for approximately eight months, he told L.C. he would consider consenting to adoption. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nWell into this period of diminishing opportunity, on December 1, 1984, appellant decided to convey to Barker, whom he knew to have legal custody to the child, his definitive refusal to consent to the adoption. This he did by letter, which was not received until February 1985, when Baby Boy C. was eighteen months old. Another letter expressing the same message was received shortly thereafter.\n\nOnce the court received word of appellant's refusal to consent, it extended the interlocutory decree of adoption to allow appellant to appear before it to oppose the adoption. When appellant appeared, he was accorded a full evidentiary hearing. By that time, however, as both Dr. Marans and Dr. Noshpitz testified, the relationship between Baby Boy C. and his adoptive parents had become so complete that to remove him from the O. family would be devastating.\n\nUnlike my colleagues on the panel, the trial Judge did not find in appellant's actions, from the time he was given prompt notice of his paternity until the hearing in the Superior Court some twenty-two months later, the \"coming forward to participate in the rearing of the child,\" Caban, supra, 441 U.S. at 392, or the assumption of parental responsibility which would warrant substantial protection of his interest in personal contact with his child under the due process clause. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Lehr, supra, 463 U.S. at 261. The record supports the trial Judge's ruling.\n\nJudge Ferren's opinion includes the following finding, joined essentially by Chief Judge Rogers: \"Given the communications he did receive, H.R. did all he could reasonably have been expected to do to claim custody of his child.\" Judge Ferren goes on to conclude, in part on the basis of the foregoing finding, that H.R.'s \"'opportunity interest' remained intact.\" (Opinion of Ferren, J., at ). The former of these quoted passages presents two problems. The first is that it is an appellate finding of fact. The second is that it is plainly wrong. H.R. could reasonably have been expected to do many, if not most, of the following:\n\n-- At the time of Baby Boy C.'s birth, he could have made the collect phone call that Barker offered in order to confirm that he was a father.\n\n-- He could have written Barker directly and posed any questions he had.\n\n-- He could have gone to the U.S. Embassy in Kinshasa for assistance in learning about the facts and American adoption practices.\n\n-- He could have secured the advice of an American attorney in Kinshasa.\n\n-- He could have used his Peace Corps contacts or other English-speaking acquaintances to contact Barker or others if communication in English was any problem.\n\n-- As events unfolded, he could have kept Barker informed of his address.\n\n-- He could have telephoned or written the Embassy of Zaire in Washington for assistance in looking into the matter.\n\n-- Knowing that Barker was located in the District of Columbia, he could have contacted the District of Columbia courts for information, and to express interest in custody, if he was, in fact, interested.\n\n-- He could have made a firm commitment to Barker to come and assume custody of the child as soon as possible.\n\n-- He could have offered and sent support or gifts for the child or the mother before the trial court questioned him on this in July, 1985.\n\n-- He could have offered to pay money in support of L.C. during pregnancy, and at the time of birth.\n\n-- He could have maintained contact with L.C. after she left Zaire in April, 1983.\n\nFar from doing \"all he could reasonably have been expected to do,\" H.R. failed to do any of the foregoing.\n\nIn observing that the trial court should be sustained in its finding that H.R. failed to grasp his opportunity, I am not unmindful of the difficulties of this case. Yet, it Was for appellant to find some means of initiating a relationship with his son. A clear statement of his intention to assume full custody, a modest contribution to Baby Boy C.'s support, some attempt to visit his child early on or, above all, an effort to assume custody at the earliest possible time manifested by a clear statement of his intention to do so -- any of these things would have lent some support to appellant's claim, as an unwed father, to the rights of a parent. But the virtually complete absence of such beginnings leaves appellant outside of the area in which substantial protection is available to him under the due process clause. \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nAppellant's failures are the more egregious because he is a well-educated person -- he had completed law school and was on the way to becoming a member of the legal profession, both in his native Zaire and in France, at the time of the events in question here. He had the ability to know all he needed to know to go about the task of building a relationship with his son and asserting his claim to legal recognition of that relationship. He failed to do so. Thus, it cannot be said that Barker or the trial court thwarted his assertion of his rights or created a conflict between the father's interest and the best interests of his child.\n\nReturning to the matter of the asserted error of the trial court in failing, on its own or through Barker, to notify H.R. of the filing of the petition for adoption, D.C. Code § 16-306 (a) (1989 Repl.), any error involved was harmless for at least two reasons. The first is that H.R. received adequate notice of the adoption proceedings. The second is that, as demonstrated in Part III of this opinion below, the trial court should be affirmed in any event because of the devastating effect upon Baby Boy C. of his being taken from the O. family.\n\nAs I noted earlier in my description of the facts, an important contribution to H.R.'s notification was the Barker letter that informed appellant of the expected birth of Baby Boy C. almost contemporaneously with the birth itself, and which also told appellant generally of plans to place the child for adoption. At the very least, the letter put a legally trained man who had impregnated a woman on notice that he should find out if he was indeed a father. All he had to do to find out was to make a collect telephone call to Barker. Two telephone conversations with L.C. in October 1983, confirmed for appellant, inter alia, the fact of the actual birth of the child, his placement with an adoptive home, and the involvement of a court. A belated telephone conversation with Barker the following January gave appellant more information, and the communications recited at length above then followed.\n\nUnder the circumstances, H.R. was not seriously disadvantaged by the lack of immediate notice of the filing of the petition. Indeed, if he had moved forward first with inquiries upon the receipt of the Barker letter at the time of Baby Boy C.'s birth with a clear indication that he wished to take custody of the child, it is most probable that no petition would ever have been filed. A witness for Barker so testified.\n\nConsideration of the obvious purpose of the statutory notice provision also undercuts H.R.'s position. Although D.C. Code § 16-306 calls for immediate notice of the filing of an adoption petition, there is no more than an incidental connection between the statutory notice required under the D.C. Code and the opportunity discussed in Lehr for a father to assert his interest in being a parent to his child. There is no requirement that the petition be filed shortly after birth; often circumstances do not permit that. Nor need the petition be filed promptly after placement of a child with the potential adopting parents. The timing of the filing of the petition is left to the adoptive parents, who presumably would be guided by the adoption agency. Under the statute, the petition could be filed after the father has substantially lost his opportunity to act as a parent. The purpose of the statutory notice requirement is obviously to give the natural parent an opportunity to participate in the adoption proceedings, not to prompt an unwed father to seize his opportunity to act as a parent.\n\nTurning to the purpose of § 16-306, i.e., to permit H.R. to participate in the proceedings, patently it was satisfied because H.R. participated fully in lengthy hearings. His only possible complaint about the proceedings, that they did not take place before Baby Boy C. began to bond with the O. family is, as I have demonstrated, attributable directly to H.R.'s failure to come forward when he could have.\n\nIII.\n\nThere is a second and independent ground that requires us to affirm the trial court. Under any and all of the theories of how to decide adoption cases set forth in the three opinions of this division, a finding that the child would be \"devastated\" by reason of being taken away from the adoptive parents and given to a natural parent requires that the child be left with the adoptive parents if they are otherwise qualified. In such a case, as all members of this division recognize, the best interests of the child require that result. Here the trial court made such a finding, and the record strongly supports it. This court commits a serious legal error that may have equally serious human consequences by failing to give effect to this dispositive finding.\n\nThe interests of the adoptive parents do not figure directly in the best interests test. It is not their interests, but the child's that we consider. But where there has been close family bonding, their interests and the child's are reciprocal, and they suffer similarly from a misapplication of the law. Notwithstanding the strong interest of a natural father in rearing his own son, in a case such as this, where a trial on the merits has produced a dispositive finding that is supported by the record, there is no reason to subject Baby Boy C. and his adoptive parents to the agony and uncertainty of a second trial.\n\nThe most likely result of the majority's vote will be further proceedings in the trial court at which, presumably, further expert testimony will be adduced, probably from the experts who testified before, and possibly from other experts, who will have examined or reexamined members of the O. family. In what is apparently an effort to alleviate the anxiety and suffering that will be caused by this remand, Judge Ferren's opinion offers suggestions about the manner in which the proceedings on remand may be approached by the Judge who is designated to replace the late Judge Riley. (Opinion of Ferren, J., at ). As I understand, it is suggested that before the court decides whether it is necessary to reopen the record, \"perhaps Dr. Marans, Dr. Noshpitz, and others (if necessary) who are familiar with the record, could be recalled to help the court evaluate the factual record more thoroughly before the court itself applies the correct legal test.\" (Opinion of Ferren, J., at ). It is not clear what the experts could do that would assist the court. As Judge Ferren acknowledges, they could not be asked to help the court apply a legal standard. Nor is it suggested how they could factor into their existing testimony a preference in favor of a natural parent which the majority must presume could somehow affect their view of the devastating impact upon the child that a transfer would have. The same passage of Judge Farren's opinion goes on to suggest that if upon application of the \"correct legal test to the evidence as of 1986,\" the trial court \"were to decide in favor of the adoptive parents, that would end the matter (subject to the right of appeal).\" But, the opinion continues, \"if the court were to conclude custody should have been awarded to H.R., then the court would have to reopen the proceeding for consideration of developments since 1986.\" (Opinion of Ferren, J., at ). It is not explained why, given the reversal of the trial Judge's order that the majority is entering, the adoptive parents are entitled to treatment preferential to that extended to H.R. My view is that it is not necessary legally to extend this form of solicitude to the adoptive parents (and Baby Boy C.) because the appropriate course for this court is to act on the existing record, heed the strength of the finding that the child would be devastated by his removal from the O. family, and affirm the ruling of the trial court.\n\nIt is not necessary to repeat here the record support for Judge Riley's finding of the harm which will befall Baby Boy C. if he is taken from the O. family. (See pp. to , supra, and Opinion of Ferren, J., at pp. to ). Such a removal from the only family he has ever known, according to Dr. Marans, would be \"devastating\" to Baby Boy C. and would impair his future development. The trial court credited Dr. Marans' testimony that Baby Boy C. would be seriously harmed by removal from the O. family. That should end this case.\n\nThe postscript to Judge Ferren's opinion would justify ignoring these dispositive findings of fact on the ground that they were made \"in the context of applying the traditional 'best interest of the child' standard without consideration of the parental preference or the fitness of the father, H.R.\" But it can readily be seen that this matter of \"context\" has no bearing on the dispositive finding we are addressing. Even if we presume the fitness of the father and acknowledge his preferred status, the ultimate determination that the best interest of the child requires that he remain with the O. family is misstated by the trial Judge's findings concerning the consequences upon the child of a removal of the O. family. Judge Riley credited expert testimony that the transfer would be \"devastating\" to the child, that the child's removal from his adoptive family's home would cause a \"permanent scar,\" and that the child's \"full potential could never be reached either in the intellectual or emotional range\" if he were taken from the O. family.\n\nJudge Ferren's postscript posits that we cannot properly assume \"that the court's findings, while looking through the prism of one legal test, would be the same when looking through another prism intended to grant presumptive custody to a fit natural father as against strangers.\" This position misconstrues the factfinding function. The trial Judge in this case was making a straightforward finding of fact when she found that the transfer of the child from the O. family would be \"devastating.\" \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e She was not applying a legal test. A Judge acting as a factfinder, for example, can make a finding that the arm was broken, the traffic light was red, or that the physician misdiagnosed the patient's physical or mental illness. The Judge then determines the legal consequences of the factfinding. In this case, Judge Riley found factually that the child would be devastated by being taken from the O. family. Her best interest finding followed inexorably. \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e It should be affirmed.\n\nIV.\n\nAlthough I disagree with the Conclusion reached by the majority, I agree essentially with them on the test to be applied once an unwed father is found to have diligently pursued his opportunity interest under Lehr. A fit father, including an unwed father who has come forward promptly and undertaken to act as a father, should presumptively be entitled to custody of his child when the mother has relinquished her rights and put the child up for adoption, unless it is demonstrated that the best interests of the child require otherwise. The statutory standard of \"best interests\" of the child means that the child's interests are paramount, with a rebuttable presumption that placing the child in the custody of a fit natural father who has come forward and undertaken to act as a father will ordinarily be in the child's \"best interests.\"\n\nIn this case, H.R. did not earn the presumption. Even if he had, the best interests of Baby Boy C. would nevertheless require that he remain with the O. family.\n\nFor the reasons I have given, I Dissent.\n\n\u003cspan class=\"fn\"\u003e* Judge Rogers was an Associate Judge of this court at the time of argument. Her status changed to Chief Judge on November 1, 1988.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The trial court's findings of fact and Conclusions of law in this very complex case are adopted practically verbatim from the proposed findings and Conclusions submitted by petitioners, Mr. and Mrs. O., and the Barker Foundation. Thirty-five of the fifty paragraphs of findings of fact are verbatim; eleven of the remaining fifteen contain only grammatical or single word changes, and four add or delete several sentences. The legal analysis, while also practically verbatim, contains several changes of emphasis. Although a stricter standard of review is in order when a trial Judge adopts verbatim the proposals of one party, Leftwich v. Leftwich, 442 A.2d 139, 142 (D.C. 1982), we believe that the changes made by the trial court, although minor, indicate that the \"'findings and Conclusions ultimately represent the Judge's own determinations.'\" District Concrete Co. v. Bernstein Concrete Corp., 418 A.2d 1030, 1035 (D.C. 1980) (quoting Sullivan v. Malarkey, 392 A.2d 1057, 1061 (D.C. 1978)). Accordingly, the \"clearly erroneous\" rule applies. Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The text of the form letter was as follows:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eMs. [L.C.] has recently been working with our agency with a view to placing the child she expects in July, 1983 for adoption. She has named you as the father and we would be grateful for your cooperation in planning the best possible placement for the child. We are advised by legal counsel of The Barker Foundation that the enclosed documents must be maintained by us in strict confidence and the documents may not be subpoenaed for use in any other proceeding. The Barker Foundation is a reputable agency which is licensed through the Department of Human Services of the District of Columbia and has been in existence for over thirty years. Many babies have been placed through our agency.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe have enclosed two forms: (1) an admission of paternity, which, if signed, must also be notarized; and, (2) a denial of paternity, which may be signed without notarization. Please return both the original and the copy of whichever paternity form you sign. We are also enclosing a background information form which will provide us with details about you and your family history. Even if you sign the denial of paternity form, we would respectfully request that you fill in the background form and return it to the Barker Foundation if there is the slightest chance that this child is yours. Names and addresses need not be included but since many families have histories of allergies, diabetes, etc., you will understand that this information could be crucial to the child. For matching purposes, we would appreciate it if you would enclose a snapshot.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWe fully understand what a difficult situation this is for you and we want to help in any way that we can. If you wish to have any further information, please call me collect at (202) 363-7751. Your cooperation in filling out and sending the above information will ensure that you will not hear from us again if this is your wish.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(Emphasis in original). The trial court's factual finding that this notice gave H.R. actual notice of the adoption is clearly erroneous. At best, this notice informed H.R. that in May 1983 L.C. had been contemplating giving their baby up for adoption.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. L.C. wrote to H.R. in the care of a friend in Zaire, an address suggested by Katy, their mutual friend, whom L.C. had accidentally encountered in Washington.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. D.C. Code § 16-306 (a) (1981), discussed (infra) at [46-47, 55-57], provides that \"due notice of pending adoption proceedings shall be given to each person whose consent is necessary thereto, immediately upon the filing of a petition.\" Barker did not provide the court with H.R.'s address at this time.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. L.C. reminded Avery that Avery had \"said that it would be hard for the biological father to claim the child after she had been living with his or her adoptive family for a year and a half.\" L.C. also stated that she hoped her notifying Barker of H.R.'s \"response of 'no' to the adoption\" did not put Barker in \"an awkward position legally.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The court's factual finding that this letter placed H.R. on notice that there was a pending court proceeding involving the proposed adoption is clearly erroneous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The court's factual finding that H.R. knew of Barker's role in the adoption proceeding is clearly erroneous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. The trial court found that the delay in issuing the show cause order after H.R.'s January 17, 1984 telephone call to Barker was due to the need to translate the show cause order into French. No good explanation for the seven-month delay appears in the record, however, and the court's finding is not supported by the evidence presented.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. The court's finding that the delay between the July 1985 hearings and the May 1986 hearing resulted from difficulties encountered in accommodating H.R.'s study schedule in France is clearly erroneous.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. It was undisputed that both the O.s and the R.s possessed the financial resources to care for Baby Boy C.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. The trial court apparently ignored H.R.'s contention that D.C. Code § 16-306 (a) (1981) required that he be given immediate notice of the filing of the adoption petition.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See Shelton v. Bradley, 526 A.2d 579, 580 n.3 (D.C. 1987) (referring to \"a potential conflict between these two lines of cases\"); In re N.M.S., 347 A.2d 924, 927 (D.C. 1975) (referring to reconciling the holdings by reference to \"the differing factual situations\" or to \"the proposition that ordinarily a child's best interest is served by being with a fit parent\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. D.C. Code § 21-101 (1989), relied on in Shelton, provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(a) The father and mother are the natural guardians of the person of their minor children. When either dies or is incapable of acting, the natural guardianship of the person devolves upon the other.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(b) This section does not affect the power of a court of competent jurisdiction to appoint another person guardian of the children when it appears to the court that the welfare of the children requires it.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eWhen Davis and Bell were decided, these subsections were located in separate provisions of the D.C. Code, see D.C. Code § 21-101, -108 (1951), respectively. They are both traceable to 31 Stat. 1369, ch. 854, § 1123 (Mar. 3, 1901), which was in effect when Beall was decided but was not cited there.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See also In re Lambert, 86 A.2d 411 (D.C. 1952) (in proceeding to determine best interests of children found to be without adequate parental care, mother not entitled to jury trial). By the time N.M.S. was decided, the \"best interests\" test had been incorporated into the statute governing Dispositions of children who were \"found to be neglected,\" see D.C. Code § 16-2320 (a) (1973) (incorporating Pub. L. 91-358, title I, § 121 (a), 84 Stat. 535 (July 29, 1970)). The courts in LEM, Cooley, and Holtsclaw cited caselaw for the \"best interests\" test from this and other jurisdictions. The court in LEM cited Bell and Davis, among other cases, but did so, in context, not for purposes of applying a parental preference but for the proposition that the fitness of a parent at the time of the hearing is more important than past conduct in determining present qualifications.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. D.C. Code § 16-2320 (a) (1973) provided for \"any of the following Dispositions which will be in the best interest of the child:\" (1) remaining with the parent, guardian, or other custodian subject to various conditions; (2) placing the child under \"protective supervision\"; (3) transferring legal custody to a public agency, child placing agency, or qualified relative or other individual; (4) committing the child for \"medical, psychiatric, or other treatment;\" and -- as implemented in part by Super. Ct. Neg. R. 18 (c) -- \"(5) making such other Disposition as may be provided by law as the Division deems to be in the best interests of the child and the community.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. D.C. Code § 16-309 (b) (1989) provides in relevant part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(b) After considering the petition, the consents, and such evidence as the parties and any other properly interested person may present, the court may enter a final or interlocutory decree of adoption when it is satisfied that:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) the prospective adoptee is physically, mentally, and otherwise suitable for adoption by the petitioner;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(2) the petitioner is fit and able to give the prospective adoptee a proper home and education;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(3) the adoption will be for the best interests of the prospective adoptee; and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(4) the adoption form has been completed by the petitioner pursuant to section 10 of the Vital Records Act of 1981.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. D.C. Code § 16-304 (e) (1989) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe court may grant a petition for adoption without any of the consents specified in this section, when the court finds, after a hearing, that the consent or consents are withheld contrary to the best interest of the child.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. D.C. Code § 16-2353 (1989) provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(a) A Judge may enter an order for the termination of the parent and child relationship when the Judge finds from the evidence presented, after giving due consideration to the interests of all parties, that the termination is in the best interests of the child.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(b) In determining whether it is in the child's best interests that the parent and child relationship be terminated, a Judge shall consider each of the following factors:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) the child's need for continuity of care and caretakers and for timely integration into a stable and permanent home, taking into account the differences in the development and the concept of time of children of different ages;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(2) the physical, mental and emotional health of all individuals involved to the degree that such affects the welfare of the child, the decisive consideration being the physical, mental and emotional needs of the child;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(3) the quality of the interaction and interrelationship of the child with his or her parent, siblings, relative and/or caretakers, including the foster parent; and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(4) to the extent feasible, the child's opinion of his or her own best interests in the matter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. But see In re J.S.R., 374 A.2d 860, 863 n.11 (D.C. 1977) (suggesting reliance on similar factors in the Uniform Marriage and Divorce Act § 402, 9A U.L.A. 561 (1987)); see also In re J.O.L., 409 A.2d 1073, 1075 (D.C. 1979) (court suggests still another list of factors in considering appeal of grant of stepfather's adoption petition), vacated and remanded, 449 U.S. 989, 66 L. Ed. 2d 286 (1980), cert. denied, 454 U.S. 832, 102 S. Ct. 131, 70 L. Ed. 2d 110 (1981).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See Caban v. Mohammed, 441 U.S. 380, 99 S. Ct. 1760, 60 L. Ed. 2d 297 (1979).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The authority of the court to grant a petition for adoption despite a parent's lack of consent remained unchanged. D.C. Code § 16-304 (e) (1989).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. The Stuart court, in effect, saved the constitutionality of the 1938 Act, as applied, by construing its \"purposes\" section in a way that required a parental preference. See Stuart, 72 App. D.C. at 394, 396, 114 F.2d at 830, 832. The court did not find a statutory basis for that preference aside from constitutional requirements. In any event, the \"purposes\" provision so construed, D.C. Code § 11-902 (1940), is no longer in the District of Columbia Code.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. In Michael H. v. Gerald D., 491 U.S. 110, 109 S. Ct. 2333, 105 L. Ed. 2d 91 (1989), a majority of the Court upheld a California statute that, except in limited circumstances, denied natural fathers the right to establish their paternity of children conceived during, and born into, marriages between the children's mothers and other men. A plurality opinion reasoned that even though Michael H. had begun to establish a parental relationship with his daughter, he had no constitutional right to \"substantive parental rights . . . of a child conceived within and born into an extant marital union that wishes to embrace the child.\" Id. at 2344. Justice Stevens, Concurring in the judgment, \"would not foreclose the possibility that a constitutionally protected relationship between natural father and his child might exist in a case like this,\" but he concluded that the California statute was not unconstitutional because it did not prevent Michael H. from asserting a right to visitation. Id. at 2347 (Stevens, J., Concurring in the judgment).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Other state actions which vitally affected H.R.'s opportunity to develop a relationship with his child were Barker's investigation of the backgrounds of L.C., H.R., and the O. family for the court; its certification to the court in December, 1983, that the O. family was suitable for adoption of Baby Boy C; and its consent to the O. family's petition for adoption, also in December, 1983.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. H.R. also contends that the Barker Foundation, through the actions of Alice Avery, intentionally misrepresented his rights concerning Baby Boy C. and committed fraud on the court when it told the court in December of 1983 that his whereabouts were unknown. The trial court addressed these legal issues only indirectly and summarily in a statement, adopted verbatim from the petitioner's proposed findings of facts and Conclusions of law, that it \"specifically rejects any allegation or suggestion by [H.R.] that Barker or its counsel in any way sought to mislead either [H.R.] with respect to the nature of this proceeding or the Court with respect to whereabouts or his intentions as to seeking custody vel non of Baby Boy [C.].\" Because the trial court did not comprehensively address the fraudulent misrepresentation claims, I do not reach these issues on appeal -- except to say I do believe the trial court erred in asserting that the record contained no evidence supporting such claims.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. Avery of the Barker Foundation testified that if H.R. had come forward before the placement of Baby Boy C. with the O. family, Barker would have placed the child with him and not with adoptive parents. Unfortunately for H.R., he did not know of the child's birth or of his rights at that time.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. We also concluded that the representative might be entitled to damages under 42 U.S.C. § 1983 (1982) to remedy not only monetary harms inflicted as a result of the violation of her procedural due process rights but also mental anguish and suffering she experienced. See Ford, 531 A.2d at 240.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Until these regulations were proposed, adoption procedures were governed by an outdated 1969 Adoption Manual, prepared by the Committee on Regulations and containing suggested forms for use by licensed child-placing agencies. The Manual was published at a time when unmarried fathers had no statutory rights to notice of custody hearings concerning their children. Thus, there have been no regulations governing notification to natural fathers regarding the adoption of their children. Effective March 1, 1985, however, there has been a \"Statement of Policies and Procedures\" issued by the Superior Court Family Division, Adoption Branch, that increased an unwed father's chances to receive notice. Some of these procedures have been incorporated into the new regulations.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. The new regulations also require specified efforts to locate birth parents:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1632.1 If one or both birth parents cannot be located, the child-placing agency responsible for preparing the investigative report and recommendations for a proposed adoption shall make efforts to locate the missing natural parent. The efforts shall be documented in the record.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1632.2 The child-placing agency shall document that the following resources have been used in the efforts to locate the missing parents and the results of their use:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(a) Vital Statistics Branch of the Office of Policy and Planning of the Department of Human Services for birth, marriage and death records;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(b) DHS Child Support Locator;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(c) Military Locator;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(d) Court criminal records;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(e) Metropolitan area telephone books;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(f) Metropolitan area hospital records (if they can be released);\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(g) Public assistance, Medicaid, motor vehicle, and police records (if they can be released); and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(h) Family and friends of both birth parents (if appropriate).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1632.3 If a birth parent does not name the other birth parent, the child-placing agency or petitioner shall make a good faith effort to obtain the information from the known parent. If the name of the unknown parent is not given, and an affidavit is required by the court, the child-placing agency shall file an affidavit outlining the known parent's reason for refusing to give the information.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1632.4 If the birth mother names two or more possible fathers, the child-placing agency shall attempt to locate all of the alleged fathers. Paternity may be judicially determined.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The trial Judge stated she believed it would have been improper for Barker to give legal advice to H.R. in response to his inquiries but that it would have been appropriate for Barker's letter to suggest that H.R. consult an attorney and to supply H.R. with the address of the court and the docket number of the case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. The Adoption Procedures Information Manual, published in or after 1983 by the Family Division to guide pro se petitioners and inexperienced attorneys, does not mention, in explaining adoption procedures under the D.C. Code, that notification to the parties must occur upon filing of the petition for adoption. Rather, the Manual provides three different scenarios for notifying the parties of the hearing on the petition: (1) In an adoption proceeding where a formal opposition has been filed, the case is automatically set on the Adoption calendar for a court hearing after the agency report and recommendation has been received, and notice of the hearing date is mailed to the attorneys representing all parties. (2) When the agency reports that a party has expressed opposition during the course of the investigation, the opposing party is notified of the hearing date by an Order to Show Cause (why the adoption should not be granted) sent by registered mail, return receipt requested, and the hearing is then placed on the Adoption calendar, which is heard weekly by a Family Division Judge. (3) Where formal adoption consents have not been obtained, the court issues an order to show cause to the particular party at the last known address by registered mail, return receipt requested, to answer in writing by a specified date. If no response or consent is received, the adoption is granted as uncontested; if a contested response is received, the court will direct that a contested hearing date be set, and an order to show cause will be sent to notify all concerned parties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. The court order erroneously stated that H.R.'s communications to Barker \"revealed his awareness of the pending Court proceedings.\" It is worth noting that once he was aware of the court proceeding, H.R. communicated his receipt of the order and appeared as requested.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. In Dissent, Judge Belson characterizes this Conclusion as an \"appellate finding of fact.\" Post at 140. To the contrary, it expresses the legal test -- the Conclusion of law -- required for deciding whether a natural father, under the circumstances, has grasped his \"opportunity interest.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. In Eason, the Georgia Supreme Court noted that the state awards custody to unwed mothers unless they are unfit for parenthood and held that the state must award custody to unwed fathers under the same standard, rather than permitting placement of children with adoptive parents while denying custody to unwed fathers under a \"best interests of the child\" standard. 257 Ga. 292, , 358 S.E.2d 459, 463 (1987). Baby Girl Eason had been placed for adoption when she was three days old, and at the time of the appeals court decision she was nine months old and had lived with her adoptive parents for virtually all her life. According to the Supreme Court of Georgia, the decisions in Stanley, Caban, Quilloin, and Lehr, taken together, dictates that if the child's natural father has not abandoned his opportunity interest and would be a fit parent, he will be entitled to custody of the child. Id.; see also Doe v. Chambers, 188 Ga. App. 879, , 374 S.E.2d 758, 760 (1988) (issue at custody hearing was not whether adoptive parents were more qualified to raise child but whether natural father was fit to do so).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. Recall that presumptive custody of a natural parent under the guardianship statute, D.C. Code § 21-101 (1989), is rebuttable \"by clear and convincing evidence of abandonment, unfitness, or other circumstances which render the parent's custody detrimental to the best interests of the child.\" Shelton, 526 A.2d at 580.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. \"Proofs made in a termination proceeding must satisfy the clear and convincing evidentiary standard.\" In re K.A., 484 A.2d 992, 995 (D.C. 1984) (citing D.C. Code § 16-2359 (f) (1989); Santosky v. Kramer, 455 U.S. 745, 755, 102 S. Ct. 1388, 71 L. Ed. 2d 599 (1982)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. The Uniform Marriage and Divorce Act § 402, which has not been adopted as such in the District of Columbia, provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe court shall determine custody in accordance with the best interest of the child. The court shall consider all relevant factors including:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) the wishes of the child's parent or parents as to his custody;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(2) the wishes of the child as to his custodian;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(3) the interaction and interrelationship of the child with his parent or parents, his siblings, and any other person who may significantly affect the child's best interest;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(4) the child's adjustment to his home, school, and community; and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(5) the mental and physical health of all individuals involved.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe court shall not consider conduct of a proposed custodian that does not affect his relationship to the child.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9A U.L.A. 561 (1987). The trial court applied similar factors, and we approved, in J.O.L., 409 A.2d at 1075. It is unclear why, in the adoption context, in announcing criteria for determining the child's \"best interest\" under D.C. Code § 16-304 (e) (1989), (supra) note 17, this court in J.O.L. and in J.S.R. did not refer to the factors specified for a termination proceeding under id. § 16-2353 (b), (supra) note 18. In D.R.M., 570 A.2d at 804-05, we all but said that § 16-2353 (b) criteria are applicable in conjunction with adoptions under §§ 16-304 (e) and -309 (b)(3).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. In In re A.B.E., 564 A.2d 751 (D.C. 1989), we recently reversed a termination of parental rights in a neglect case \"in the absence of any substantial good to be achieved for this child.\" Id. at 757. Although the relationship between the objecting father and the nine-year-old son had been violent over the years, the trial court found that some of their interactions had been \"fruitful\" and that the father \"genuinely loved his son.\" Id. at 755. Significantly, the \"trial court's findings show a child without a permanent home and without a reasonable opportunity of finding one.\" Id. at 757. A.B.E. makes clear, therefore, that termination of parental rights is to be viewed with skepticism, even as to a parent of questionable fitness, when such termination is unlikely to help achieve a suitable alternative, permanent placement.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn contrast, in In re A.W., 569 A.2d 168 (D.C. 1990), we sustained the trial court's termination of a natural mother's parental rights to a two-year-old son. The trial court found the mother unfit for custody of her child and unlikely to be fit \"in the near future.\" Id. at 169. The court also found the boy \"very suitable for adoption,\" id. at 170, though without an actual prospect for adoption. We distinguished A.B.E. and concluded that the existence of a prospective adoptive parent was not \"an indispensable condition\" of termination on these facts. Id. at 171-73. But see In re A.W., 569 A.2d 169, 174 (D.C. 1990) (Rogers, C.J., Dissenting) (likelihood of child's timely adoption is integral part of mandated assessment of whether child's long term needs would most adequately be served by terminating parental rights).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFinally, in In re D.R.M., 570 A.2d 796 (D.C. 1990) -- although warning against \"an adoption juggernaut,\" id. at 807, when a natural parent has not established a relationship with her child within a year after birth -- we sustained an adoption over the opposition of a nonconsenting, non-custodial natural mother who contended the trial court had incorrectly applied the criteria for terminating parental rights under D.C. Code § 16-2353 (b) (1989), (supra) note 18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. California has had an interesting history of applying the \"detriment\" or \"actual harm\" standard. Years after the decision in In re Guardianship of Smith, discussed earlier in the text, the California legislature adopted statutes which the California Supreme Court held applicable to unwed parents and construed to provide, in various situations, that unless both parents consented to adoption when the mother relinquished her parental rights, the father was entitled to custody of the child, as against a prospective adoptive parent, unless an award to the father would be \"detrimental to the child.\" See In re Baby Girl M., 37 Cal. 3d 65, , 207 Cal. Rptr. 309, , 688 P.2d 918, 921, 925 (1984) (en banc). (Ten years earlier, the California Supreme Court had construed \"detrimental to the child\" to mean \"actually harmful to the child.\" In re B.G., 11 Cal. 3d 679, , 114 Cal. Rptr. 444, , 523 P.2d 244, 246 (1974) (en banc)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA year after Baby Girl M., the California Supreme Court, applying the detriment standard, held as a matter of law that the trial court had abused its discretion in concluding that an award of temporary custody to a teenage natural father would not be detrimental to the infant child. Michael U. v. Jamie B., 39 Cal. 3d 787, 218 Cal. Rptr. 39, 705 P.2d 362 (1985). The California Supreme Court noted that the father was unemployed, had serious academic difficulties, was a discipline problem at school, and lacked maturity and judgment. 39 Cal. 3d at 793-94, 218 Cal. Rptr. at 43-44, 705 P.2d at 366-67. The court said that the father was not \"'unfit' in the sense that, if he received custody of Eric, the state would have grounds to intervene and remove the child.\" 39 Cal. 3d at 796 n.8, 27 Cal. Rptr. at 45 n.8, 705 P.2d at 368 n.8. But, the court added that placement with the father could, nonetheless, be detrimental to the child \"depending on the child's current circumstances and the available placement alternatives.\" Id.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eA few years later, in reviewing the remand proceeding for In re Baby Girl M., 191 Cal. App. 3d 786, 236 Cal. Rptr. 660 (1987), the intermediate appellate court sustained the trial court's termination of the unwed father's parental rights. Although there was no question of the natural father's fitness as a parent, the court found detriment to the child based solely on the psychological harm that would result from removal from the adopting parents' home, where the child had lived for five years (from two months of age through the period of the second appeal). The appellate court cited footnote 8 of the lead opinion in Michael U. (quoted above) \"distinguishing 'detriment' from the concept of 'unfitness'\", concluded that \"negative evidence regarding the father\" is not \"a necessary predicate to a finding of detriment,\" and noted that all five Concurring Justices in Michael U. \"clearly expressed their view that harm resulting from the separation of the child and the prospective adoptive parents in and of itself can constitute 'detriment' sufficient to support the termination of parental rights. . . .,\" 191 Cal. App. 3d at , 236 Cal. Rptr. at 664-65(emphasis in original). The court noted, finally, that in the meantime the California legislature had \"responded to the Supreme Court's [1984 en banc] Baby Girl M. decision by amending [the law and] specifying the 'best interests' test as the only applicable standard.\" 191 Cal. App. 3d at ,236 Cal. Rptr. at 666.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eAccordingly, in administering the \"detriment\" standard, the California courts have construed unfitness very narrowly but have been willing to find a disqualifying detriment by reference not only to a fit father's negative qualities but also to circumstances that did not adversely reflect on the father's fitness.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn 1989, a California appellate court came to grips with Lehr in applying the \"best interests\" test prescribed by the legislature after the Supreme Court's Baby Girl M. decision. In Jermstad v. McNeils, the court held that the applicable provision of the civil code incorporating a \"best interests\" standard, \"read in the light of the federal constitutional law, accords the natural father a parental preference to the custody of his child where . . . the father has diligently pursued an opportunity to establish a protected custodial relationship. The preference precludes measuring the best interests of the child by comparison of his [the father's] circumstances with those of the putative adoptive parents.\" 210 Cal. App. 3d 528, , 258 Cal. Rptr. 519, 520 (1989); see id. at 532. The California court found there was no \"compelling indication\" that the natural father could not \"be an adequate parent,\" 210 Cal. App. 3d at 553, 258 Cal. Rptr. at 534; and, because the appellee natural mother (who favored the putative adoptive parents) did not request a \"statement of decision,\" the court assumed the trial court made whatever findings were \"necessary to sustain the judgment,\" 210 Cal. App. 3d at 553, 258 Cal. Rptr. at 533. Thus, the court did not have to confront the possibility that actual harm to the child could arise from a transfer of custody from the prospective adoptive parents to the natural father even if fit. It is unclear how the California Supreme Court would address that issue today.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eInterestingly, the Uniform Commissioners have adopted a \"detriment\" standard similar to the statute once in force in California. See UNIFORM PUTATIVE AND UNKNOWN FATHERS ACT § 6 (d), 9B U.L.A. 33 (Supp. 1990) (where the natural father's \"failure to establish a familiar bond is justified, and the father has the desire and potential to establish the bond . . . the court may terminate the parental rights of the father . . . only if failure to do so would be detrimental to the child\"); In re Guardianship of D.A. McW., 429 So. 2d 699, 703-04 (Fla. Dist. Ct. App. 1983) (natural parent of child born out-of-wedlock should be denied custody only where parent is disabled from exercising custody or such custody will be detrimental to welfare of child).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. In view of the policy of finality, especially in adoption proceedings, I believe the \"best interests\" standard, incorporating a parental preference as elaborated in this opinion, should apply to this case and any other pending appeal on the date of this decision but otherwise should have prospective application only. See In re C.A.P., 359 A.2d 11, 13 (D.C. 1976) (\"The decision will be binding on any case wherein the judgment has not become final at the time of our decision in this case, but shall not have any retroactive application to proceedings already completed on that date.\") Id. I would afford appellant H.R., presumably a \"one-time litigant,\" the benefit of our ruling as a \"reward . . . for efforts expended in promoting the progress of the law.\" Mendes v. Johnson, 389 A.2d 781, 791 (D.C. 1978) (en banc). Because my colleagues do not perceive a parental preference in this context as a departure from prior law, they do not have to reach the prospectivity-retroactivity issue.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. A trial Judge, of course, does not apply a legal standard, as such, during the process of finding facts; but, contrary to Judge Belson's analysis, post at 146-47 \u0026 notes 12, 13, a Judge's belief that a particular legal standard applies may cause the Judge to perceive some facts, relevant to that standard, in a particular way. If a different legal standard were applicable, the Judge might perceive and articulate the same factual data in a different way -- specially facts, as in this case, incorporating a judgment of psychological impact, in contrast with more objectively verifiable facts, such as color, or historical facts, such as the time an event occurred.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eCONCURRING FOOTNOTES\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 Lehr v. Robertson, 463 U.S. 248, 103 S. Ct. 2985, 77 L. Ed. 2d 614 (1983).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 Davis v. Jurney involved a natural mother's attempt to regain custody of her nine-year-old son who had been living with relatives of the boy's father for about six years pursuant to a written agreement. Id. at 847-48. The parents of the child entered into the agreement during a period of time in which they were suffering marital problems. Despite their attempts to preserve the marriage, the parties eventually divorced. The mother visited her son regularly throughout this period of time, however, and exchanged letters with the custodial relatives and her son during an extended stay out of the country which revealed strong ties of affection. Id. at 848. When the mother returned to the District of Columbia, she, with affirmative support from her former husband, sought custody of the child. The relative objected and sought to retain their custody of the boy.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe trial Judge determined that the relatives were fit and proper persons and that the welfare of the child would best be served by awarding custody to them. Id. at 848. The mother appealed contending that the trial Judge improperly relied on the agreement between the parties and failed to consider her preferential claim as the natural mother of the child. Id. at 848.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe court of appeals, after reciting the controlling principle quoted above, remanded the case for a new hearing with instructions to apply the proper standard, namely that where evidence does not show an intent on the part of a natural parent to abandon her rights to custody, the strangers (relatives of the child's father) must bear the burden of establishing the natural parent's unfitness by evidence concerning, but not exclusively, the natural parent's association with the child over the years, her efforts to obtain custody of him and her present suitability to assume the responsibilities of parenthood. Id. at 850.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe rationale of the court was that of Justice Traynor, who, Concurring in In re Guardianship of Smith, 42 Cal.2d 91, , 265 P.2d 888, 891 (1954) (en banc), wrote:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe objection to the rule that custody must be awarded to the parent unless he is unfit carries the harsh implication that the interests of the child are subordinated to those of the parent when the trial court has found that the best interests of the child would be served by giving his custody to another. The heart of the problem, however, is how the best interests of the child are to be served. Is the trial court more sensitive than the parent to what the child's best interests are, better qualified to determine how they are to be served? It would seem inherent in the very concept of a fit parent that such a parent would be at least as responsive as the trial court, and very probably more so, to the best interests of the child.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 The three-year period was apparently viewed by the trial Judge as a period of probation for the natural mother during which her fitness \"might the more certainly be developed.\" Id. at 182, 251 F.2d at 893.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 The court quoted from People ex rel. Portnoy v. Strasser, 303 N.Y. 539, 542, 104 N.E.2d 895, 896 (1952):\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNo court can, for any but the gravest reasons, transfer a child from its natural parent to any other person * * * since the right of a parent, under natural law, to establish a home and bring up children is a fundamental one and beyond the reach of any court, Meyer v. State of Nebraska, 262 U.S. 390, 399, 43 S. Ct. 625, 67 L. Ed. 1042 [(1923)] * * *.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eId. at 183 n.17, 251 F.2d at 894 n.17.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 The District of Columbia adoption statute, D.C. Code § 16-309 (b) (1989 Repl.), provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003ethe court may enter a final or interlocutory degree of adoption when it is satisfied that:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) the prospective adoptee is physically, mentally, and otherwise suitable for adoption by the petitioner;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(2) the petitioner is fit and able to give the prospective adoptee a proper home and education;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(3) the adoption will be for the best interest of the prospective adoptee; and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(4) the adoption form has been completed by the petitioner pursuant to section 10 of the Vital Records Act of 1981.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe best interest standard has been a part of the District's\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eadoption statute for generations. See, e.g., In re Adoption of a Minor, 79 U.S. App. D.C. 191, 193 \u0026 n.6 \u0026 196 n.17, 144 F.2d 644, 646 \u0026 n.6 \u0026 649 n.17 (discussing D.C. Code § 16-201 (1940)), cert. denied, 65 S. Ct. 270 (1944).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 In N.M.S., the natural mother sought to regain custody of her nine and one half year old daughter whom she had voluntarily surrendered to the Public Welfare Department when the child was four days old because she felt that, for financial and other reasons, she was temporarily unable to care for the child. 347 A.2d at 925. The court declined to struggle with what it viewed as the \"abstract\" question of whether a fit parent is subordinate to the best interest of the child, observing that \"there are many varying degrees of fitness, and best interest is hardly an expression of precise meaning.\" Id. at 927. Hypothesizing a potential conflict among prior decisions about which right or interest is superior, that of the natural parent or child, the court suggested that \"probably the holdings can be reconciled by the differing factual situations or perhaps on the proposition that ordinarily a child's best interest is served by being with a fit parent.\" Id. (contrasting Johnson v. Lloyd, 211 A.2d 764 (D.C. 1965); Jackson v. Fitzgerald, 185 A.2d 724 (D.C. 1962); Davis v. Jurney, 145 A.2d 846 (D.C. 1958); Bell v. Leonard, 102 U.S. App. D.C. 179, 251 F.2d 890 (1958), with Cooley v. Washington, 136 A.2d 583 (D.C. 1957); In re Lambert, 86 A.2d 411 (D.C. 1952); Holtsclaw v. Mercer, 79 U.S. App. D.C. 252, 145 F.2d 388 (1944)). Also in Shelton v. Bradley, supra, the court noted in passing a conflict between prior decisions regarding whether parental unfitness had to be demonstrated, but did not need to resolve the matter since a presumption was explicitly set forth in the statute at issue. 526 A.2d at 580-81 n.3. A review of the cases in which the court has commented on a possible conflict indicates, however, that they follow the fit-parent presumption where parents have not abandoned their opportunity interest in custody.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eJudge Ferren's commendable effort to categorize the cases is flawed insofar as he suggests that the cases involving a mother who has surrendered her child to a stranger and is seeking to regain custody place the natural mother on the same footing as the stranger who is seeking custody of the child. See Ferren, J., opinion at 25. The quote from Davis v. Jurney and the Discussion of Bell v. Leonard and Beall v. Bibb, make clear the error of his interpretation. See pp. 1-4, supra, and note 18, infra. Our cases have not diminished the presumption in favor of the fit natural parent; rather, the court has noted that the fact of prior surrender is a factor to be taken into account -- no more -- in evaluating the parent's present fitness.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 The Termination of Parental Rights Act, D.C. Code § 16-2353 (b) (1989 Repl.), was enacted in 1977 and provides in relevant part:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn determining whether it is in the child's best interests that the parent and child relationship be terminated, a Judge shall consider each of the following factors:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(1) the child's need for continuity of care and caretakers and for timely integration into a stable and permanent home, taking into account the differences in the development and the concept of time of children of different ages;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(2) the physical, mental and emotional health of all individuals involved to the degree that such affects the welfare of the child, the decisive consideration being the physical, mental and emotional needs of the child;\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(3) the quality of the interaction and interrelationship of the child with his or her parent, siblings, relative and/ or caretakers, including the foster parent; and\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e(4) to the extent feasible, the child's opinion of his or her own best interests in the matter.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 E.g. In re U.S.W., 541 A.2d 625 (D.C. 1988) (termination of parental rights on account of neglect by natural parents); In re C.O.W., 519 A.2d 711 (D.C. 1987) (same); In re M.M.M., 485 A.2d 180 (D.C. 1984) (same); In re K.A., 484 A.2d 992 (D.C. 1984) (termination of rights of natural parents who abandoned child).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 Thus, in In re J.O.L., 409 A.2d 1073 (D.C. 1979), vacated and remanded, 449 U.S. 989, 101 S. Ct. 523, 66 L. Ed. 2d 286 (1981), the court rejected a challenge to the constitutionality of the adoption statute as applied to a natural parent objecting to an adoption and referred only to the trial Judge's findings in concluding that there was clear and convincing evidence that the children's best interest lay in remaining in a family unit with the stepfather and not with the natural father who had failed to visit the children for five years.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn In re P.G., 452 A.2d 1183 (D.C. 1982), the court again rejected a constitutional due process challenge to the statute, holding that no decision of the Supreme Court required a finding of unfitness of the natural parent before the rights could be terminated over his objection. The court distinguished Caban v. Mohammed, 441 U.S. 380, 99 S. Ct. 1760, 60 L. Ed. 2d 297 (1979) as involving the equal protection clause, and noted that in Santosky v. Kramer, 455 U.S. 745, 102 S. Ct. 1388, 71 L. Ed. 2d 599 (1982), the Court \"carefully refrained from any constitutional holding regarding the substantive criteria, limiting its attention to the standard of proof.\" 452 A.2d at 1185. The court also noted that Quilloin v. Walcott, 434 U.S. 246, 98 S. Ct. 549, 54 L. Ed. 2d 511 (1978) held that due process is satisfied by the best interest standard \"at least where the effect is simply to recognize an existing family unit,\" -- in that case the child had lived with the adoptive family for 9 years -- but declined to address the required standard where the child has not already been integrated into the adoptive family for some time. Id. at 1184-85.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eJ.O.L. and P.G. relied, in turn, on In re J.S.R., 374 A.2d 860 (D.C. 1977), where the court held that the Constitution did not require a finding that a natural parent is unfit before an adoption by a stranger could be ordered but that clear and convincing evidence was required that a natural parent's consent to the adoption was being withheld contrary to the best interest of the child. 374 A.2d at 864 (\"We find nothing offensive to constitutional mandates in our statutory standard which focuses on the best interest of the child rather than solely on the status or abilities of the natural parent.\") The court quoted, with apparent approval, Winter v. Director, Dept. of Welfare, 217 Md. 391, 143 A.2d 81 (1958) in which the court upheld the statute permitting adoption without the parents' consent. In Winter, the court stated that the parent has \"no inherent right of property in a child, and the right the parent has to the custody and rearing of his children is not an absolute one, but one that may be forfeited by abandonment, unfitness of the parent, or where some exceptional circumstances render the parents' custody of the child detrimental to the best interests of the child.\" 217 Md. at 396, 143 A.2d at 84.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 The facts in several cases make clear that the parental preference had been overcome by clear and convincing evidence. See In re K.A., supra, 484 A.2d 992 (natural parents abandoned child); In re J.O.L., supra, 409 A.2d 1073 (father had not visited children for five years, children who lived with natural mother and her husband, and viewed the husband as their \"real father\" and experienced emotional distress upon obligatory visits with natural father; questions also were raised about natural father's mental health and use of illegal drugs); In re J.S.R., supra, 374 A.2d 860 (the child had never known his natural mother, had experienced personality damage from four years of changing foster home placements, and was gaining confidence in his potential adopters' home; natural mother was a victim of multiple sclerosis, dependent on others for most of her physical needs, and had voluntarily surrendered custody of child at birth because she was unable to care for him).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 In D.I.S., the court acknowledged, however, that the right of a natural parent to raise his child is constitutionally protected, albeit not absolute. 494 A.2d at 1326 \u0026 n.16 (citing In re J.S.R., supra, 374 A.2d at 863; Stanley v. Illinois, 405 U.S. 645, 92 S. Ct. 1208, 31 L. Ed. 2d 551 (1972)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 Stanley and Caban hold unconstitutional a statutory presumption of unfitness absent an individualized determination (Stanley) and statutory differentiation between the natural parents with regard to consent to adoption (Caban). Quilloin upholds the constitutionality of a best interest of the child standard in the face of a natural father's claim that an unfitness determination was required where the natural father had never had or sought actual or legal custody of his eleven year old child and where the result of adoption was to give recognition to a family unit already in existence. 434 U.S. at 254-55. The instant case does not fall within the dictum in Quilloin that due process would be offended if \"a State were to attempt to force the breakup of a natural family over the objections of the parents and their children, without some showing of unfitness and for the sole reason that to do so was thought to be in the children's best interest.\" 434 U.S. at 255 (quoting Smith v. Organization of Foster Families, 431 U.S. 816, 862-63, 97 S. Ct. 2094, 53 L. Ed. 2d 14 (1977) (Stewart, J., Concurring in the judgment). Of course, here, while H.R. did not abandon his opportunity interest, the proposed adoption by the O. family, like that in Quilloin, would not place Baby Boy C with a new set of parents with whom he had never before lived.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 In Michael H., the Court upheld the constitutionality of a statutory presumption that a child born to a woman living with her husband is a child of the marriage. The Court rejected the natural father's claims that there is a constitutionally protected liberty interest in a parental relationship and that protection of the marital union of natural mother and husband is an insufficient state interest to support termination of that relationship.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14 Lehr did not hold that the actions of the natural father were insufficient to constitute his seizing of his opportunity interest in a general sense. The Court held only that New York had established a statutory mechanism for seizing one's opportunity interest and failing that, other efforts would not suffice to overcome the defect in the father's failure to register under state law. Hence, this court remains free to decide what factual circumstances constitute a seizing of one's opportunity interest. The District of Columbia's statutory right to immediate notice of an adoption proceeding, however, is a critical factor in deciding whether H.R. seized his opportunity interest. The uncertainties and vagueness about the existence of Baby Boy C and exactly what the natural mother had done explain to my satisfaction that prior to the time that H.R. should have been notified formally of the adoption proceeding he did not abandon his opportunity interest.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe factual circumstances of this case are unusual. The natural father is not a citizen or resident of the United States, and both his cultural and legal background are foreign to the United States. Ideas about raising a child are different in Zaire and concepts of child custody under the civil law system differ in significant respects from the American common law and statutory system. French, not English, is his native language. Furthermore, there was evidence that his financial circumstances did not make it possible for him to come immediately to the United States upon learning that in fact a child had been born. Significantly, however, when he learned of the formal adoption proceeding, he appeared before the court. Our Dissenting colleague unrealistically and, in my view, unreasonably burdens H.R. with knowledge of what American courts would expect a United States citizen to do to demonstrate his commitment to his child, as, for example, by offering to pay support. Of course, support was never at issue here. More importantly, H.R. did far more than offer token support; he wrote immediately to the mother after receiving Barker's first letter and called her, in October 1983, when he had received her response to his letter and asked her to send the baby to him. Then, in January 1984, he called Barker and advised he could not consent to the adoption. Given cultural differences and the delay of the mails, H.R.'s responses were consistent with seizing his opportunity interest; indeed, as Judge Ferren points out, he could do little more than appear in the adoption proceeding, of which he did not, as the statute required, receive immediate notice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15 See Davis v. Jurney, supra, 145 A.2d at 849 (parental preference \"reflecting the wisdom of human experience\" is overcome only by \"compelling circumstances\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16 Furthermore, the concept of best interest of the child is sufficiently broad to enable the trial Judge to recognize that requiring the child to \"make some sacrifice to be with his natural parent or adjust to a new environment . . . does not necessarily mean that his welfare will be correspondingly impaired.\" Again, in the words of Justice Traynor:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIt may not be the best interests of the child to have every advantage. He may derive benefits by subordinating his immediate interests to the development of a new family relationship with his parent, by giving as well as receiving. Thus, although a change in custody from an outsider to a parent may involve the disruption of a satisfactory status quo, it may lead to a more desirable relationship in the long run.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn re Guardianship of Smith, supra, 42 Cal. 2d at , 265 P.2d at 891-92. Courts likewise have recognized that an extended family may include the natural parent. In re Baby Girl M, 191 Cal. App. 3d 786, 236 Cal. Rptr. 660, 662 (1987) (quoting trial Judge's orders). See In the Matter of D.I.S., supra, 494 A.2d at 1323, 1325 (statute provides flexible framework for case by case determination of the best interest of the child) (citing Bazemore v. Davis, 394 A.2d 1377, 1383 (D.C. 1978) (en banc)).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17 It also is consistent with the Supreme Court's decisions in Stanley v. Illinois, 405 U.S. 645, 92 S. Ct. 1208, 31 L. Ed. 2d 551 (1972); Caban v. Mohammed, 441 U.S. 380, 99 S. Ct. 1760, 60 L. Ed. 2d 297 (1979); and Quilloin v. Walcott, 434 U.S. 246, 98 S. Ct. 549, 54 L. Ed. 2d 511 (1978). See note 12, supra. See Ferren opinion at 35-37. The court's concern about established family relationships is relevant, notwithstanding that at the time the child was placed with the prospective adoptive parents there was no established family relationship. See Ferren opinion at 44-45. Time having passed, the fact that Baby Boy C has been living with the prospective adoptive parents throughout the trial and appellate court proceedings cannot be ignored since early permanence and stability may exist by the time a custody decision is rendered upon remand. See also Ferren opinion at 75-79.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18 At most, our standard contemplates the type of circumstances discussed in Beall v. Bibb, supra. Where the preferential claims of a parent were lost by contract, or forfeited by abandonment or misconduct, the court suggested that this would \"afford very strong evidence of the want of natural affection and the lack of fitness for the charge,\" and, thus \"if the succeeding custodians are fit and capable persons under whose care the welfare of the children is reasonably secure, and the relations between them have become such that to sever them would be necessarily cruel or painful, the revived claims of the parents may well be denied.\" 19 App. D.C. at 314 (citations to state cases omitted). See In re B.G., 11 Cal. 3d 679, 114 Cal. Rptr. 444, , 523 P.2d 244, 246, 254-55 (1974) (en banc) (California statute prescribing harm as a factor); UNIFORM PUTATIVE AND UNKNOWN FATHERS ACT § 6(d) (1988).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19 Judge Ferren's caselaw and statutory analysis, see opinion Part III, seeks to categorize cases based on issues not presented and gives insufficient attention to language in opinions indicating awareness of the statutory interpretation of the adoption statute to include a parental preference. To suggest that prior decisions ignored precedent is misleading when the issues were different.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eJudge Ferren's analysis also is based on speculation that the Council of the District of Columbia intended to abandon the long-standing parental preference aspect of the best interest standard when the Council enacted Title VI of the Prevention of Child Abuse and Neglect Act of 1977. All that statute did was to authorize the termination of parental rights in an independent neglect proceeding rather than as part of an adoption proceeding. In re A.W., 569 A.2d 168, 171 (D.C. 1990). The legislative history indicates that the Council intended to facilitate the adoption of children. Id. at 171-72; see also id. at 174-75 (two-fold motivation for statutory change: to hold social services agencies accountable for children adjudicated neglected, and to authorize termination of parental rights in unusual circumstances in a neglect proceeding) (dissenting opinion, Rogers, C.J.). Indeed, the legislative history makes clear that the Council was concerned that unfit parents were hindering the adoption prospects of their children. Hence, the Council's focus was hardly on examining the differences between neglect and relinquishment cases. Enactment of the Title IV is fully consistent with the presumption that a child's best interest is with a fit parent. In any event, there is nothing to suggest that the Council's action was motivated by any constitutional concern or disagreement with judicial interpretation of the adoption statute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eSimilarly, Judge Ferren's reliance on the amendments adopted by Congress in the D.C. Court Reform and Criminal Procedure Act of 1970, Pub. L. 91-358, § 121 (a), Title I, 84 Stat. 522, is misplaced. Section 121 (a) concerns Family Division Proceedings relating to juvenile delinquency, neglect, and persons in need of supervision. It addressed the circumstances warranting state intervention in a family. Congress left the District's adoption statute untouched. It is important not to confuse an adoption proceeding with a proceeding to terminate parental rights, since the latter proceed irrespective of the pendency of an adoption proceeding and does not need to consider the rights of the natural parent vis a vis the prospective adoptive parents.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFurthermore, his reliance on In re Stuart, 72 App. D.C. 389, 394, 114 F.2d 825, 830 (1940), as a basis for constitutionalizing our inquiry, is misplaced. The court's reference to the constitutional rights of natural parents arose in the context of state intervention to deprive the natural parents of custody of their child on the ground that they had failed to provide adequate care and support. The issue on appeal was the sufficiency of the evidence to support the Juvenile Court order placing custody with a stranger. The statute authorized the removal of the child from the custody of her parents \"only when his welfare or the safety and protection of the public cannot be adequately safeguarded without such removal.\" 114 F.2d at 832. The court noted that \"under our constitutional system, the citizen has more than a revocable privilege to possess and rear his children.\" Id. Acknowledging that the right was not absolute, the court defined the limited exceptions in terms of cruelty or neglect or a parent \"unfit in character or mode of life . . ., [such that] the state for the welfare of the child and society may interfere.\" Id. at 832-33. The court reversed on the basis of the evidence of the mother's care for the child in the face of the father's refusal to provide child support. No such state intervention is at issue in the instant appeal and nothing in Stuart is contrary to our holdings that the constitutional right is not absolute.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20 See In re D.R.M., 570 A.2d 796, 804-05 (D.C. 1990) (in determining best interest of child, court may consider any factor which appears relevant under the circumstances; no abuse of discretion to consider factors under D.C. Code § 16-2353 (b)); In the Matter of K.A. supra, 484 A.2d at 998 (\"it may be appropriate\" to apply the first four factors in D.C. Code § 16-2353 (b) where custodial parents are threatened with possible termination of their rights and only if the analysis is unsatisfactory to apply the factors to other potential custodians) (dictum (\"But that is for another day.\")).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21 Unfortunately we are not the first court to recognize that the state's failure to accord the natural father his statutory right to notice has caused his claims to be adversely affected as a result of the passage of time during which his child has been living with the petitioning adoptive family. See In re Baby Girl M., supra, 236 Cal. Rptr. at 665 n.6 (quoting In re Reyna, 55 Cal. App. 3d 288, 304, 126 Cal. Rptr. 138, , (1976)). Indeed, in an analogous situation this court has recently cautioned against the \"adoption juggernaut.\" In re D.R.M., (supra) note 20, 570 A.2d at 807-08.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1 For the most part, I agree with Chief Judge Rogers' statement of the applicable law, and join in her opinion except for its first paragraph and its last two paragraphs, footnotes 12 and 14, and except to the extent it incorporates views set forth in Judge Ferren's opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2 Because the trial court referred to H.R.'s wife as E.R., I will do the same.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3 Chief Judge Rogers' further concerns (Opinion of Rogers, C.J., at ) about the manner in which the trial Judge weighed the evidence concerning the child's best interest are entirely met, in my view, by the additional fact that the trial Judge made her finding of the devastation that would be visited upon the child by the transfer of custody to H.R. on the basis of the testimony of an expert who presumed that H.R. would be an ideal parent.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4 Judge Ferren's recitation of facts, and his postscript as well, fail to take the foregoing Conclusion into account when they set forth as fact portions of H.R.'s testimony which are inconsistent with it and were not specifically credited by the trial Judge.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5 I agree with Chief Judge Rogers' analysis of Lehr, but differ with her view, contrary to the finding of the trial Judge, that \"the uncertainties and vagueness about the existence of Baby Boy C. and exactly what the natural mother had done explain to my satisfaction that prior to the time that H.R. should have been notified formally of the adoption proceeding he did not abandon his opportunity interest.\" (Opinion of Rogers, C.J., at ). The recitation of facts earlier in this opinion makes it clear that H.R. knew enough early on to have acted. For example, in a letter written to L.C. a few days after his child's birth, H.R. said that if life with her future husband is impossible, L.C. could send the child to him to raise. In any event, if there were uncertainties, H.R. could have resolved them with a telephone call. I add that it is unrealistic to posit, as both Chief Judge Rogers and judge Ferren do, that H.R.'s obligation to come forward somehow ceased the day the adoption petition was filed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eI also agree with Chief Judge Rogers' analysis of the development of adoption law in the District of Columbia and its recognition of a parental preference. Her opinion, however, fails to reconcile its acknowledgment of the best interests of the child principle with the trial Judge's clear and fully supported finding of devastation to Baby Boy C. if he should be taken from the only home he has known.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6 As discussed below, appellant's complaint does not relate to the hearing he received, but rather to timely notice. It is clear that, unlike the father in Lehr, appellant received a full hearing, and the court \"listened to his opinion of where the child's best interests\" lay. Lehr, supra, 463 U.S. at 262.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7 The trial court found that appellant had received actual notice of the adoption plans and concluded that this was adequate for due process purposes under the facts of this case. The court's determinations are consistent with the evidence. The cover letter to Barker's forms which appellant received in August 1983, informed him that the child would be placed for adoption and that adoption was a \"proceeding.\" In October, 1983, shortly after the petition was filed, L.C. informed appellant that she had given up her parental rights and that Baby Boy C. had been placed in an adoptive home where the parents were white and the child's older adoptive brother was racially-mixed. Appellant understood L.C. to say that she had gone before a court to renounce her rights. Therefore, appellant had notice of the substance of the petition for adoption shortly after it was filed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eFurthermore, appellant presented no evidence that the failure to provide him notice of the petition for adoption prevented him from taking advantage of his \"opportunity interest.\" Indeed, the evidence shows that he did not grasp his opportunity, despite having notice. The trial court found that he did not tell his fiancee that he had fathered a child until many months after the child's birth. He also testified that he did not come to this country at that time because he did not have enough money to do so, a reason inconsistent with an assertion that his inactivity was the product of lack of notice. H.R. also testified, in any event, that the idea of coming to the United States in the fall of 1983 did not occur to him. Under these circumstances, the actual notice that appellant received satisfied any due process right to notice, and also rendered harmless any failure to give notice required by the adoption laws of the District of Columbia, as discussed below.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8 Even though appellant testified that it would have been difficult for him to provide support because of the relatively low salaries in Zaire and the unfavorable monetary exchange rate, the provision of at least some support is important not only to show one's interest and ability to take care of a child but also to indicate one's intention to assume full custody.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9 Appellant's failure to come forward distinguishes this case from In re Baby Girl Eason, 257 Ga. 292, 358 S.E.2d 459 (1987) (when father who had moved out of state learned from receipt of adoption petition that the mother had given up their child for adoption, father immediately filed for legitimation when baby was two months old), and In re Baby Girl M., 37 Cal. 3d 65, 688 P.2d 918, 207 Cal. Rptr. 309 (1984) (after father was informed of mother's relinquishment of their baby, father filed for custody before infant turned one month old). In these cases, the father, upon learning of the child's birth and the relinquishment of rights by the mother, sought legitimation and custody for himself without hesitation. Both children were still very young infants and there was no evidence that they had developed ties to a prospective adoptive family.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eIn my view, the decision of a California intermediate court in Jermstad v. McNelis, 210 Cal. App. 3d 528, 258 Cal. Rptr. 519 (1989) cited in Judge Ferren's opinion, lends little support to Judge Ferren's broad reading of Lehr. See In re Adoption of Kelsey S., 218 Cal. App. 3d 130, 266 Cal. Rptr. 760, 765 (1990) (disagrees with Jermstad's broad reading of Lehr), petition for review granted, 269 Cal. Rptr. 74, 790 P.2d 238 (1990).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10 The postscript of Judge Ferren's opinion, at page would appear to exempt an unwed father from the requirement to \"come forward to participate in the rearing of his child\" unless he has been given formal notice of a legal proceeding. As I read the Supreme Court authorities, they are dealing on the human level with the behavior that can be expected of the father of a newborn child who is interested in acting as a parent, regardless of notice of a legal proceeding involving the child. See Lehr, supra, at 261.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11 In addition, H.R. exacerbated the trans-oceanic difficulties of communication by failing to keep Barker informed of his current address. To impose, as Judge Ferren's opinion would, upon an adoption agency or the court's continuing duty to inquire under circumstances like those before the court would place an unreasonable burden on the adoption process. It would allow anyone who wished to contest an adoption and was moving from place to place simply to sit back and wait for the court or the agency to locate him. As a result, adoption proceedings could become prolonged and much less certain. In addition, unwed mothers who had relinquished their parental rights could be subjected to continued inquiries that could be emotionally painful. Weighed against these burdens is the simple task of sending a change of address notice to the appropriate parties or making a collect telephone call to Barker. To the extent the majority absolves appellant from any responsibility to keep Barker informed of his whereabouts, I disagree.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12 Malat v. Riddell, 383 U.S. 569, 86 S. Ct. 1030, 16 L. Ed. 2d 102 (1966), cited in Judge Ferren's postscript at 84-85 casts no shadow upon this finding of fact. The \"change of law\" relating to parental fitness and parental preference within the best interests standard, a change recognized only in Judge Ferren's opinion, could not affect the context within which Judge Riley made her finding of devastation to this child.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13 Judge Ferren reasons that if the Judge had begun with \"a presumption that the child's best interests lay in the father's custody\" we cannot be certain \"either that the Judge would have found that a transfer would be devastating or, in any event, that it would be so devastating that, on balance, the father should be denied custody. . . .\" (Opinion of Ferren, J., at ). To the contrary, I submit it is entirely unrealistic to suggest that a finding that the best interests of the child call for transfer to H.R. would be compatible with the Judge's acceptance of the testimony of Dr. Marans concerning the devastating and scarring effect of such a transfer of custody. In any event, the parental preference was given effect when the trial Judge required the adoptive parents and Barker to prevail by clear and convincing evidence. While in my view it was not necessary to apply a clear and convincing test where an unwed natural father had not seized his opportunity interest, the fact is that Judge Riley did apply such a test, and the adoptive parents prevailed. Her ruling should be affirmed.\u003c/span\u003e\n\n",
    "body_length": 282281,
    "citedas": [
      "581 A.2d 1141"
    ],
    "attorneys": "Thomas C. Jones, Jr., for appellant. Thomas R. Spradlin, entered an appearance. David S. Klontz, with whom Michael P. Bentzen, was on the brief, for appellees.",
    "category": [
      "158",
      "36",
      "75"
    ],
    "judges": "Rogers,* Chief Judge, and Ferren and Belson, Associate Judges. Opinion by Associate Judge Ferren at p. 2. Opinion Concurring in part, Dissenting in part, by Chief Judge Rogers at p. 97. Dissenting opinion by Associate Judge Belson at p. 118.",
    "citation_count": 37
  }
}
