{
  "id": "FZtGRWYBTlTomsSB_gJW",
  "document": {
    "title": "STOUT v. HENDRICKS",
    "full_title": "BRUCE L. STOUT ET AL. v. CHARLES O. HENDRICKS, SECRETARY OF STATE OF THE STATE OF INDIANA, ET AL. . NELSON G. GRILLS V. MATTHEW E. WELSH, GOVERNOR OF INDIANA, ET AL., AS MEMBERS OF THE STATE ELECTION BOARD .",
    "jurisdiction": "S.D. Indiana",
    "date": "1963-11-08T00:00:00.000Z",
    "docket": "Nos. IP 61-C-236, 62-C-326",
    "body": "This is a three-judge court composed pursuant to 28 U.S.C. § 2284as required by 28 U.S.C. § 2281 at the request of theDistrict Court. The Court has before it two actions: Bruce L.Stout, et al. v. Charles O. Hendricks, Secretary of State of theState of Indiana, et al., filed August 2, 1961, and Nelson G.Grills v. Matthew E. Welsh, Governor of Indiana, et al., filedAugust 7, 1962. The actions were consolidated as to allproceedings and for trial of all matters in issue by the Courtupon its own motion on November 27, 1962. Each action relates tothe apportionment of the legislative branch of government of theState of Indiana.\n\nThe first action is a class action brought by the plaintiffs,Bruce L. Stout, John E. Hunter, John S. Griffin and David L.Matthews, upon their own behalf and upon behalf of all qualifiedvoters in the respective counties in which plaintiffs live and inthe state, who are similarly situated, as is permitted by Rule23(a) of the Federal Rules of Civil Procedure. The action isbrought against certain named and unnamed defendants as membersof the same class, all of whom are officials of the State ofIndiana or of counties in the State of Indiana, and all of whomare sued in their official capacity.\n\nJurisdiction in the first case, the Stout case, is predicatedupon 42 U.S.C. § 1983 and 1988, the Civil Rights Acts, and upon28 U.S.C. § 1343 and 1392(a), which relate to jurisdiction andvenue of district courts. The complaint, as amended andsupplemented, seeks pursuant to 28 U.S.C. § 2201, a declarationof plaintiffs' rights and of the validity or invalidity of thestatutes of the State of Indiana (Ind.Ann.Stats. §§ 34-102 and34-104 (1949), hereinafter referred to as the \"1921 apportionmentstatutes\") which apportion the members of the Indiana GeneralAssembly among the counties of the State, and further, injunctiverelief as may be proper to prevent defendants from continuing tocomply with the allegedly unconstitutional statutes.\n\nThe complaint in the Grills case is an action by plaintiffNelson G. Grills against the members of the State Election Board,who are also defendants in the Stout case, and is also adeclaratory judgment action brought pursuant to 28 U.S.C. § 2201.The action is said to arise under, and jurisdiction is apparentlypredicated on, Article 4, Section 4, and Article 6 of, and theFourteenth Amendment to, the Constitution of the United States.\n\nAlthough the theories of the two actions are not completelyalike,\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e the basicissue presented by each action is whether election of members ofthe Indiana General Assembly from districts created by thepresent statutes apportioning the legislature, passed in1921,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e is in violation of the State and FederalConstitutions. The first action, the Stout case, is now beforethe Court following a trial upon the merits and upon a motion todismiss the action, and the second action, the Grills case, isbefore the Court upon the motion of the plaintiff for a summaryjudgment and upon an amended motion to dismiss the action, whichmotion to dismiss is to be treated as a motion for summaryjudgment under the provisions of Rule 56 of the Federal Rules ofCivil Procedure, since it contains matters outside the pleadings.\n\nThere is no dispute about the relevant facts. They have beenstipulated into the record and, in part, judicially noticed. TheCourt's detailed statement of these facts is being filedcontemporaneously herewith. It is deemed unnecessary to detailthem in this opinion in view of the agreement by the defendantsthat these facts show that the 1921 apportionment statutes lacka rational basis. This agreement of the defendants sufficientlyanswers the vital question in these consolidated cases, i.e., \"Dothe 1921 apportionment statutes establish classificationspredicated upon a rational basis or are they utterly arbitraryand lacking in rationality?\"\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e This agreement of thedefendants also brings into play the decision of the UnitedStates Supreme Court in Baker v. Carr, 369 U.S. 186, 82 S.Ct.691, 7 L.Ed.2d 663 (1962), under which the instant court is totake jurisdiction and dispose of the plaintiffs' suits. Inrespect to the latter, the Court finds and concludes, in fact andin law, that it has jurisdiction of the parties and the subjectmatter in each action.\n\nIn view of defendants' agreement that there is no rationalbasis for the 1921 apportionment acts, the conclusion follows,Baker v. Carr, that the acts are unconstitutional since they denyequal protection to plaintiffs, and those represented by them, inviolation of the Fourteenth Amendment to the Constitution of theUnited States.\n\nPlaintiffs therefore are entitled to injunctive relief.\n\nThe Stout case was filed in August, 1961, and this three-judgecourt was appointed by Chief Judge Hastings on August 14, 1961.The Grills case was filed in August, 1962. On October 19, 1962,the Court declined, at Grills' insistence, to interfere with theNovember, 1962, election of members of the General Assembly. TheCourt at that time deemed it wise to abstain from action untilafter the General Session of the legislature in January andFebruary of 1963. In that session, a reapportionment bill waspassed by both houses of the General Assembly. It was vetoed bythe Governor. The veto was sustained by the General Assembly. ASpecial Session was called by the Governor for April, 1963, andthe call of the session included the subject of reapportionment.This Court again abstained from action with the expectation thatappropriate reapportionment legislation would be adopted intolaw. Postponement of court action on both occasions wasconsistent with the wholesome doctrine of judicial abstention. Tohave done otherwise on either occasion would have been anunseemly judicial interference with a legislative function andresponsibility.\n\nThe legislature in the Special Session adopted a resolutionproviding for a new basis of apportionment of legislativedistricts. The resolution, if it were to survive all necessarysteps resulting inamendment of the Constitution, would not result in a legislaturefrom reapportioned districts until the 1975 General Session.\n\nIn June, 1963, defendants conceded for the first time in thislitigation that the Indiana apportionment statute of 1921 was, ineffect, unconstitutional. The Court's duty thereupon becameclear.\n\nThis Court cannot perform that duty by accepting thelegislative resolution of April, 1963, as a satisfactory effortto establish a just and constitutional reapportionment ofIndiana's present legislative districts having no rational basis.To accept the resolution as satisfactory would unduly delayjustice for the citizens of Indiana.\n\nThis Court is urged by plaintiffs to direct an \"at-large\"election for members of the General Assembly. The Court is notdisposed to burden the Indiana electors with the obviousconfusing and disrupting consequences of ordering that relief,especially in 1964, the year of a presidential election. This\"cure\" could be worse than the \"disease.\" Nor has the Courtseriously considered declaring void the November, 1962, electionof members of the General Assembly of Indiana upon the vain hopethat \"within thirty days\" the members thereby rendered de factowould adopt a just and constitutional reapportionment statute.To grant this prayer would be reckless.\n\nFinally, plaintiffs ask this Court itself to establish a justreapportionment. This relief the Court must grant in the absenceof just and constitutional reapportionment legislation by theIndiana General Assembly.\n\nIt is unfortunate that federal courts in general have ofnecessity been drawn into assuming legislative responsibilitybecause of the failure of representatives elected by the peopleto abide by their sworn duty under the constitutions of thestates. This Court is concerned to afford to the citizens ofIndiana every practical, possible opportunity to obtain a justand constitutional apportionment through the legislativeprocesses established by them in their fundamental law.\n\nWe have decided, therefore, that we should suspend theeffective date of the injunctive relief to be granted by thisCourt simultaneously with the filing of this opinion; and that weshould defer court action to establish the appropriatereapportionment of legislative districts of the state. This isthe middle path between accepting the legislative resolution ofApril, 1963, and granting the \"at-large\" election or the\"thirty-day\" relief.\n\nWe think the electors of Indiana should have an opportunity in1964 — with the aid of all other persons and groups interested inthe problem — to select representatives for the General Assemblywho may hold best promise of dedication to attaining the goal ofa just and constitutional apportionment in the 1965 GeneralAssembly. We cannot assume that, of necessity, the electorscannot successfully demand and receive from the political partiesof their choice an opportunity to make such a selection.\n\nIt is our opinion, therefore, that the injunctive relief to begranted here should be made effective after the November, 1964,election, and that any court-established reapportionment of theState of Indiana should be dependent upon the failure of theGeneral Assembly elected by the people in 1964 to enactappropriate reapportionment legislation in the 1965 GeneralSession.\n\nDECLARATORY JUDGMENT AND DECREE.\n\nIn accordance with the foregoing opinion, and based upon theCourt's detailed findings of fact being filed contemporaneouslyherewith, and it having been agreed by the defendants that the1921 apportionment statutes (Ind.Ann.Stats. §§ 34-102, 34-104(1949)) have no rational basis, and the Court having consideredthe pending motions and being further fully advised in thepremises,\n\nIt is ordered that defendants' motion to dismiss the complaintin Grills v.Welsh, et al., No. IP 62-C-326, be and it is hereby denied.\n\nIt is further ordered that the motion of plaintiff Grills inCase No. IP 62-C-326 for summary judgment be and it is herebydenied in so far as it differs from the relief prayed for in CaseNo. IP 61-C-236.\n\nThe Court finds, on the facts stipulated, and upon theadmission of defendants by the Attorney General of the State ofIndiana, that there is no rational basis for the said 1921apportionment statutes, and finds that the said statutes areinvidiously discriminatory in violation of the FourteenthAmendment of the Constitution of the United States; and it istherefore declared by the Court that said statutes areunconstitutional and void.\n\nThe Court further finds, by reason of the foregoingdeclaration, that the plaintiffs are entitled to injunctiverelief prayed for in Case No. IP 61-C-236;\n\nIt is therefore ordered, adjudged and decreed, that  the named defendants in each of the consolidated  actions, and the unnamed defendants in the Stout  action, as members of the same class as those named  in said action, all of whom are officials of the  State of Indiana or of counties in the State of  Indiana, and their successors in office, be and they  are hereby restrained and enjoined from conducting  under said 1921 apportionment statutes any election  after the 1964 general election to be held in  November, 1964.\n\nIt is therefore ordered that the Court reserves judgment atthis time upon all other relief prayed by plaintiffs; that theseconsolidated cases are hereby reopened for the purpose ofreceiving additional recommendations from the parties hereto withrespect to the further relief to be granted herein; and the Courthereby reserves jurisdiction in these consolidated causes togrant such further relief as may from time to time be deemedappropriate.\n\nSTATEMENT OF THE FACTS.\n\nBased upon the evidence before the Court in the Stout case,which has been submitted largely by stipulation, and other factsof judicial notice, along with the pleadings, admissions, andaffidavit in the Grills case, the Court finds the facts as hereset out.\n\nThe plaintiffs in the first action, Bruce L. Stout, John E.Hunter, John S. Griffin, and David L. Matthews, are citizens,residents and qualified voters residing in four counties of theState of Indiana, to wit, Allen, Lake, Marion, and St. Josephcounties, respectively. The defendant Charles O. Hendricks is theSecretary of State of the State of Indiana; the duties of hisoffice include receipt of declarations of candidacy fornomination of members of the Indiana General Assembly at primaryelections, transmission to the Clerk of the Circuit Court in eachcounty of a certified list of candidates entitled to be voted forat primary elections, and other administrative duties inconnection with the holding of primary elections at whichcandidates for the Indiana General Assembly are nominated. Thedefendants Matthew E. Welsh, Edwin M.S. Steers and James E.Noland, named in both actions, are the members of the StateElection Board of Indiana. The State Election Board has the dutyof administering the election laws of the State of Indiana intheir statewide application, distributing ballots and othersupplies to local election officials, and generally supervisingthe conduct of elections on a statewide basis and by localelection officials.\n\nThe other named defendants[fn1a] are the Clerks of the CircuitCourt and membersof the County Election Boards of Allen, Lake, Marion and St.Joseph Counties, Indiana. The official duties of the Clerk ofCircuit Court in each county of Indiana include acting as exofficio member and secretary of the County Election Board,publication of the list of candidates for office, includingmembers of the Indiana General Assembly, to be voted upon atprimary elections in such county, furnishing to the Secretary ofState certified statements of the number of votes cast in suchcounty for each candidate for member of the Indiana GeneralAssembly, furnishing certificates of election to those personselected to office in such county, including members of theIndiana General Assembly, preservation of ballots and electionrecords, and other ministerial duties in connection with theholding of primary and general elections in such county. TheCounty Election Board in each county has the duty of conductingall primary and general elections in such county (other than townelections), including preparation and distribution of ballots andvoting machines, appointment and supervision of precinct electionofficials, tabulating the vote of the county for each office andcertifying to the Clerk of Circuit Court the number of votes castfor each candidate for office (including members of the IndianaGeneral Assembly) in each precinct, ward or township of thecounty. The class defendants, not specifically named as partiesto this action, include the Clerks of Circuit Courts and membersof the County Election Boards in each of the ninety-two countiesinto which the State of Indiana is divided.\n\nThe General Assembly of Indiana, as established by Article 4,Section 2, of the Constitution of Indiana, consists of a House ofRepresentatives of one hundred (100) members and a Senate offifty (50) members. Under the Indiana Constitution regularsessions of each General Assembly are held biennially inodd-numbered years (Article 4, Section 9) and are limited induration to sixty-one days (Article 4, Section 29). Specialsessions can meet only upon call of the Governor (Article 4,Section 9) and each special session is limited in duration toforty (40) days (Article 4, Section 29). There is no stateconstitutional limitation upon the number of special sessions ofany General Assembly which the Governor may call.\n\nUnlike many state constitutions, the Indiana Constitutioncontains no provision for initiative or referendum under whichthe people themselves could initiate and pass legislation for thepurpose of reapportioning the Indiana General Assembly. And,under the Indiana Constitution, there is no effective way bywhich a constitutional convention may be called for the purposeof amending the Indiana Constitution, unless the General Assemblyshould provide for placing upon the ballot in any generalelection the question of whether or not such a constitutionalconvention shall be called.\n\nThe provisions of the Indiana Constitution relating to divisionand apportionment of the membership of the General Assembly amongthe counties and districts of the State are as follows:\n\n[Article 4, Sections 2, 3, 4, 5, 6, and 7.]\n\n\"§ 2. Number of members. — The Senate shall not  exceed fifty, nor the House of Representatives one  hundred members; and they shall be chosen by the  electors of the respective counties or districts,  into which the State may, from time to time, be  divided.\n\n\"§ 3. Term of office. — Senators shall be elected  for the term of four years, and Representatives for  the term of two years, from the day next after their  general election: Provided, however, that the  Senators  elect, at the second meeting of the General Assembly  under this Constitution, shall be divided, by lot,  into two equal classes, as nearly as may be; and the  seats of Senators of the first class shall be vacated  at the expiration of two years, and those of the  second class, at the expiration of four years; so  that one-half, as nearly as possible, shall be chosen  biennially forever thereafter. And in case of  increase in the number of Senators, they shall be so  annexed, by lot, to one or the other of the two  classes, as to keep them as nearly equal as  practicable.\n\n\"§ 4. Periodical enumeration. — The General  Assembly shall, at its second session after the  adoption of this Constitution, and every sixth year  thereafter, cause an enumeration to be made of all  the male inhabitants over the age of twenty-one  years. * * *\n\n\"§ 5. Apportionment of representation. — The number  of Senators and Representatives shall, at the session  next following each period of making such  enumeration, be fixed by law, and apportioned among  the several counties, according to the number of male  inhabitants, above twenty-one years of age, in each:  Provided, that the first and second elections of  members of the General Assembly, under this  Constitution, shall be according to the apportionment  last made by the General Assembly, before the  adoption of this constitution. * * *\n\n\"§ 6. Districts — Requirements as to divisions. — A  Senatorial or Representative District, where more  than one county shall constitute a district, shall be  composed of contiguous counties; and no county, for  Senatorial apportionment, shall ever be divided.\n\n\"§ 7. Qualifications of members of assembly. — No  person shall be a Senator or a Representative who, at  the time of his election, is not a citizen of the  United States; nor any one who has not been for two  years next preceding his election, an inhabitant of  this State, and, for one year next preceding his  election, an inhabitant of the county or district,  whence he may be chosen. Senators shall be at least  twenty-five, and Representatives at least twenty-one  years of age.\"\n\nIn 1921, the General Assembly enacted Ind.Ann.Stats., Sections34-102 and 34-104 (1949), (Indiana Acts 1921, Chapter 78, Section2, and Acts 1921, Chapter 271, Section 2) (hereinafter referredto as the \"1921 apportionment statutes\"), which apportioned themembers of the Indiana House of Representatives and Senate amongthe ninety-two counties of the state, as required by theaforementioned provisions of the Indiana Constitution. Suchapportionment presumably was based upon an official enumerationof male inhabitants over twenty-one years of age in each countytaken in 1919 and published by the Auditor of State. Thisapportionment has been in effect for all elections of members ofthe General Assembly beginning with the 1922 elections and is nowin effect. No complete state enumeration, as required by Article4, Section 4, of the Indiana Constitution, for purposes ofapportionment of the Indiana General Assembly, has been taken orcertified since 1931. The statutes (Ind.Ann.Stats. §§ 65-601 to65-625 [Burns' 1951 Repl.]) which provided for a method of takingthe enumeration required under Article 4, Section 4, of theIndiana Constitution were repealed by Indiana Acts 1961, Chapter319, and no law presently in effect provides for a method oftaking such enumeration.\n\nThe districts established by the 1921 apportionment statutes;the number of representatives or senators allocated to eachdistrict; the population per representative and senator of eachdistrict as shown by the 1919 state enumeration of maleinhabitants over twenty-one years of age in each county; thepopulation per representative and senator of the same districtsas shown by the 1960 federal census of voting population in eachcounty; and the relationship of the population per representativeand senator in each district to the population of a districtapportioned upon population, or an \"ideal\" district (with respectto both the 1919 state enumeration and 1960 federal census ofvoting population) are listed in Appendix A (with respect to theHouse of Representatives) and Appendix B (with respect to theSenate). [For purposes of these tables, in instances where onecounty is allocated one or more representative or senator, and inaddition such county is allocated another representative orsenator jointly with an adjoining county, such overlappingdistricts are combined in order to determine population perrepresentative or senator. The population of an \"ideal\" districtis defined to mean the total population of the state (asdetermined by the enumeration or census referred to, as the casemay be) divided by 100, in the case of the House ofRepresentatives (Appendix A), or such population divided by 50,in the case of the Senate (Appendix B).]\n\nBetween 1920 and 1960 the total population of the State ofIndiana, as determined by the decennial U.S. Census for 1920 and1960, respectively, increased from 2,930,390 to 4,662,498,representing an increase in population for the state as a wholeof 59.1 per cent. However, population changes in the variouscounties of Indiana during such period have been very uneven,with seventy-two counties having increased in population duringsuch period and the remaining twenty counties having decreased inpopulation. Eleven counties, including the four large counties inwhich plaintiffs in this action reside, more than doubled inpopulation between 1920 and 1960. Of the counties which decreasedin population during such period, thirteen counties had adecrease of 10 per cent or more, and seven counties had decreasesof more than 20 per cent. In terms of voting population perrepresentative and senator as determined by the 1960 federalcensus, the largest representative district listed in Appendix A(Lake and Porter Counties combined) is 5.8 times as large as thesmallest representative district (Parke County), and the largestsenatorial district listed in Appendix B (Lake County) is 3.9times as large as the smallest senatorial district (Clay andParke Counties combined). Thus, one vote in Parke County for amember of the Indiana House of Representatives has the sameweight as 5.8 votes in Lake or Porter County for a member of theHouse of Representatives, and one vote in Parke or Clay Countyfor a member of the Indiana Senate has the same weight as 3.9votes in Lake County for a member of the Senate.\n\nThe evidence shows that, based upon the 1960 federal census ofvoting population in the various counties of Indiana, includingdistricts now vacant by reason of death or resignation,[fn2a]twenty of the one hundred members of the Indiana House ofRepresentatives represent districts having less than two-thirdsof the population of an \"ideal\" district, and fourteen additionalmembers represent districts having between two-thirds andthree-fourths of the population of an \"ideal\" district.Twenty-six members of the House of Representatives representdistricts having more than 125 per cent of the population of an\"ideal\" district. In the case of the Indiana Senate, eleven ofthe fifty members of that body represent districts having lessthan two-thirds of the population of an \"ideal\" district, andfive additional senators represent districts having betweentwo-thirds and three-fourths of the population of an \"ideal\"district, and thirteen senators represent districts having morethan 125 per cent of the population of an \"ideal\" district. Theevidence further establishes that, based upon the 1960 federalcensus of voting population in the various Indiana counties,eighteen House of Representatives districts electing twentymembers of the House have voting populations per representativeless than halfas large as that of the district including Allen County; nineteendistricts electing twenty-one members of the House have votingpopulations per representative less than half as large as that ofthe district including Marion County; forty-two districtselecting forty-seven members of the House have voting populationsper representative less than half as large as that of St. JosephCounty; and forty-eight districts electing fifty-six members ofthe House having voting populations per representative less thanhalf as large as that of the district including Lake County.Eleven Senate districts each electing one member to the IndianaSenate have voting populations per senator less than half aslarge as that of the districts including Allen County and MarionCounty; thirteen districts each electing one senator have votingpopulations per senator less than half as large as that of thedistrict including St. Joseph County; and twenty-one districtselecting twenty-two senators have voting populations per senatorless than half as large as that of Lake County. Finally, theevidence shows that, according to the 1960 federal census, 35.3per cent of the voting population of Indiana elects 51 per centof the one-hundred members of the Indiana House ofRepresentatives, and 37.4 per cent of the voting populationelects twenty-six of the fifty members of the Indiana Senate.\n\nThe \"adjusted representation\" of each county in Indiana in theHouse of Representatives and the Senate, and the \"adjusted totalrepresentation\" of each county in the General Assembly, ascomputed in accordance with the 1960 federal census of votingpopulation, is listed in Appendix C. \"Adjusted representation\"for each county is computed as follows: The number ofrepresentatives or senators apportioned to such county alone,plus a fraction for each representative or senator which suchcounty shares with one or more other counties, the numerator ofwhich fraction is the voting population of such county and thedenominator of which is the total voting population of allcounties in the representative or senatorial district. \"Adjustedtotal representation\" for each county is computed as follows: (1)The number of representatives apportioned to such county alone,plus (2) twice the number of senators apportioned to such countyalone,[fn3a] plus (3) a fraction for each representative whichsuch county shares with one or more other counties, the numeratorof which is the voting population of such county and thedenominator of which is the total voting population of allcounties in the representative district, plus (4) double [fn4a] afraction for each senator which such county shares with one ormore other counties, the numerator of which fraction is thevoting population of such county and the denominator of which isthe total voting population of all counties in the senatorialdistrict.[fn5a] For purposes of this table (Appendix C), thevarious counties of Indiana are grouped into three categories, asfollows:\n\n(1) \"Rural\" Counties are those counties having no municipalitywith total population of 10,000 or more; (2) \"Semirural\" Countiesare those counties having one or more municipalities with totalpopulation of more than 10,000 but no municipality having totalpopulation of more than 50,000; and (3) \"Urban\" Counties arethose counties having one or more municipalities with totalpopulation in excess of 50,000. As is shown by Appendix C, thedisparity in representation in the General Assembly is notconfined to differences based upon the rural, semirural or urbannature of the various counties. For example, Posey County, arural county, has an Adjusted Total Representation of 0.27 witha 1960voting population of 11,666, while Parke County, also a ruralcounty, has a 1960 voting population of only 9,390, but has anAdjusted Total Representation of 1.74. Johnson County, also arural county, has a 1960 voting population of 25,059 (almostthree times as great as that of Parke County), but has a TotalAdjusted Representation of 0.18. Similar disparities are found incounties classed as \"semirural.\" Thus Porter County has a 1960voting population of 33,694 with an Adjusted Total Representationof 1.26, while another semirural county, Huntington, has anAdjusted Total Representation of 2.26, but has a 1960 votingpopulation of only 20,615. And the urban County of Vigo has 6.66Adjusted Total Representation with a 1960 voting population of68,157, whereas the urban County of St. Joseph has an AdjustedTotal Representation of only 6.76, but had a 1960 votingpopulation of 141,959.\n\nThe above are merely a few of the instances in which theevidence shows that the representative and senatorial districtsin the Indiana General Assembly are not presently apportionedamong the several counties of the State according to the numberof male inhabitants over twenty-one years of age in each, asrequired by Article 4, Section 5, of the Indiana Constitution,and that such districts are not apportioned according to votingpopulation, total population or any other criterion relative topopulation, in either the House of Representatives or the Senate.Nor are such districts apportioned upon a basis of the urban,semirural or rural character thereof. In an apportionment ofdistricts based upon population, whether the criterion used ismale inhabitants over twenty-one years of age, voting population,or total population, and utilizing the 1960 federal censusfigures, with the number of representatives or senators to whicha county would be entitled rounded to the nearest half number,the counties in which plaintiffs in this action reside would beentitled to the following number of representatives and senators:Allen County — 5 representatives and 2 1/2 senators; Lake County— 11 representatives and 5 1/2 senators; Marion County — 15representatives and 7 1/2 senators; St. Joseph County — 5representatives and 2 1/2 senators. The number of representativesand senators which these counties now have (joint floterialrepresentatives and senators being counted for this purpose asapportioned one-half to such county) in accordance with the 1921apportionment statutes, are as follows: Allen County — 3 1/2representatives and 1 1/2 senators; Lake County — 5 1/2representatives and 3 senators; Marion County — 11 1/2representatives and 5 1/2 senators; St. Joseph County — 3representatives and 1 1/2 senators.\n\nThe defendants in this action have not attempted to make, andthe Court has been unable to find, any rational explanation orjustification for the apportionment of the membership in eitherhouse of the Indiana General Assembly, as it presently existsunder the 1921 apportionment statutes, in terms of population,geography, area, economic interests, historical tradition,representation of political units, weighted representation forrural as opposed to urban areas, or any other criterion whichmight conceivably be thought relevant to provide a rational basisfor the districts as they presently exist. The Attorney Generalof Indiana, representing the various state officials who areparty defendants, has candidly stated that the only explanationwhich he can make for the present apportionment, resulting fromfailure of nineteen consecutive general assemblies to performtheir duty to reapportion under the Indiana Constitution is \"thedesire of the individual legislators to retain their seats.\"\n\nThe 93d Indiana General Assembly was elected, from districtscreated by the 1921 apportionment statutes, at the generalelection held November 6, 1962; it convened in regular sessionJanuary 10, 1963, and adjourned sine die March 11, 1963. Duringthe regular session of the 93d General Assembly, six resolutionswere introduced proposing amendments to the Indiana Constitutionrelative to apportionment of the General Assembly.Only one of these, House Joint Resolution 6, was reported fromcommittee. That resolution passed the House but was substantiallyamended in the Senate, the House dissented from the Senateamendments, and it failed to pass during such regular session.During the regular session of the 93d General Assembly, SenateBill 160 passed the Senate by a vote of 40 to 8 and was amendedand passed the House by a vote of 52 to 46, the Senate concurringin the House amendments. This bill, a copy of which is attachedhereto as Appendix D, would have utilized the 1960 federal censusas an enumeration of all inhabitants over twenty-one years of ageof the various counties of Indiana and would have established newrepresentative and senatorial districts effective for allcandidates for the Indiana House of Representatives and Senate inthe 1964 general election and thereafter, repealing the 1921apportionment statutes. However, that bill, which became SenateEnrolled Act 160, was vetoed by the Governor of Indiana, MatthewE. Welsh, on March 15, 1963. In the special session of the 93dGeneral Assembly the Senate sustained such veto on April 1, 1963,by a vote of 23 in favor of overriding the veto and 24 in favorof sustaining it, and such act thereupon failed to become law orto provide for a new apportionment of legislative districts forthe 1964 election. [In his veto message with respect to this act,the Governor stated, \"The redistricting of both the House ofRepresentatives and the Senate which would be accomplished bythis Act is in gross violation of Article 4, Section 5 of theIndiana Constitution, requiring apportionment of Senators andRepresentatives on a population basis,\" and gave a number ofspecific examples of what he considered to be inequities amongvarious counties given the same representation under such act.]\n\nPursuant to the authority vested in him by Article 4, Section9, the Governor of Indiana, Matthew E. Welsh, called a specialsession of the 93d General Assembly, which convened March 12,1963, and adjourned sine die April 20, 1963. During the specialsession of the 93d General Assembly, three additional resolutionswere introduced proposing amendments to the Indiana Constitutionrelative to apportionment of the Indiana General Assembly butnone of these was reported from committee. House Joint Resolution6, Laws 1963, Sp.Sess., c. 47, which had been introduced duringthe regular session, as amended passed both houses of the GeneralAssembly on the last day of such special session, April 20, 1963.Such joint resolution, a copy of which is attached hereto asAppendix E, if adopted as an amendment to the IndianaConstitution, would establish a new basis for apportionment andwould require the General Assembly to pass legislationimplementing such amendment at its first regular sessionfollowing the year in which the 1970 federal decennial census ispromulgated. Such amendment, if adopted, could not be implementedby new apportionment acts until the 1973 regular session, and newdistricts established pursuant to such amendment could not beutilized as the districts for election of members of the GeneralAssembly until the 1974 general election. In accordance with theprocedure set out in Article 16 of the Indiana Constitution foradoption of constitutional amendments, the aforesaid HouseEnrolled Joint Resolution 6 was referred to the next GeneralAssembly, the 94th General Assembly, for reconsideration. UnderArticle 16 of the Indiana Constitution, such resolution, or anyother proposed constitutional amendment, could become a part ofthe Indiana Constitution only if passed by a majority of allmembers elected to each house of two consecutive generalassemblies and if so approved, subsequently ratified by amajority of voters voting upon such proposed amendment at anyelection.\n\nDuring the special session of the 93d General Assembly, threeadditional bills were considered which, if passed, would havereapportioned either the House of Representatives or Senate, orboth, effective for the 1964 general election and thereafter. Allsuch bills failed to pass.Senate Bill 420, which as reported by a conference committeewould have reapportioned both houses of the General Assembly, wasdefeated by the House of Representatives by a vote of 57 to 32,and three successive sets of new conferees who were appointedfailed to agree upon a second conference report. House Bill 1553,which would have reapportioned the House of Representatives only,passed second reading in the House but was not called up forfinal passage. House Bill 1369, which originally dealt with adifferent subject, was reported to the Senate as an amended billto reapportion the senatorial districts and in such form waspassed by the Senate by a vote of 39 to 8, but no further actionon such bill was taken by the House of Representatives.\n\nThe Governor of Indiana has not called a second special sessionof the 93d General Assembly. Unless the Governor of Indianashould call another special session of the 93d General Assembly,no further meeting of that General Assembly will be held. Thenext meeting of the Indiana General Assembly, absent such aspecial session, would normally be the regular session of the94th General Assembly, which would be elected in November 1964,and would convene in January 1965. Thus, the 93rd GeneralAssembly to date has been either unable or unwilling toreapportion the legislative districts among the various countiesof the state, and unless further action is taken, the districtsestablished by the 1921 apportionment statutes will remain ineffect with respect to election of the 94th General Assembly in1964, and for future elections to the Indiana General Assembly.\n\nBefore concluding the statement of the facts, we direct ourattention specifically to the Grills case. On July 29, 1959,Nelson G. Grills, as State Senator, brought an action for adeclaratory judgment against certain other state senators in theMarion Superior Court, Room No. 5, Marion County, Indiana,wherein the capital of the State is located, the cause of actionbeing S 59-600. The Attorney General of the State of Indiana wasserved as required by law and entered his appearance. On March17, 1961, the Judge of that Court rendered a declaratory judgmentdeclaring:\n\n\"1. Chapters 78 and 271 of the Acts of 1921 are  unconstitutional by reason of the apportionment under  their terms failing to comply with the requirements  of Article 4, Section 5 of the Indiana Constitution.\n\n\"2. Any General Assembly, after the date of this  Declaratory Judgment apportioned under the terms of  Chapter 78 and Chapter 271 of the Acts of 1921 is  declared to be in violation of the act of Congress  enabling inhabitants of the territory of Indiana to  form a state, approved April 19, 1816, Article 4,  Sections 1 and 4 and Article 6, Sections 1 and 2 of  the United States Constitution.\n\n\"3. Members of a General Assembly attempting to  serve after the date of this judgment, are without  defacto authority to act as members of the General  Assembly, apportioned under the terms of Chapter 78  and Chapter 271 of the Acts of 1921. It therefore  follows, that Plaintiff and Defendants are in the  same category as all the members of the General  Assembly. Costs assessed against the Plaintiff.\"\n\nNo appeal from said judgment was perfected.\n\nAPPENDIX A\n\n(To Statement of Facts)\n\nINDIANA HOUSE OF REPRESENTATIVES\n\nPresent Districts Ranked According to 1960 Voting      Population Per Representative, Showing Changes in      Population Relative to Ideal District, 1919-1960.\n\nNote: In the case of counties which are assigned            representatives individually and an additional            representative jointly with another county, the            two counties have been combined for purposes of            this table.\n\n1919 State             1960 Federal                                   Enumeration                 Census                                 (Males Over 21)         Voting Population\n\nPopulation              Population\n\nNo. of      Per       % Ideal       Per       % Ideal      District        Reps.       Rep.      District      Rep.      District  -------------------------------------------------------------------------\n\nIDEAL                        8,084                   27,779\n\nParke                 1        5,307        65.6        9,390         33.8  Vermillion            1        6,894        85.3       11,487         41.4  Fountain              1        5,641        69.8       11,580         41.7  Jay                   1        6,674        82.6       13,960         50.2  Sullivan              1        8,656       107.1       14,061         50.6  Clay                  1        8,297       102.6       15,679         56.4  Daviess               1        6,662        82.4       15,893         57.2  Crawford-Harrison     1        7,883        97.5       16,503         59.4  Boone                 1        7,056        87.3       16,682         60.0  Noble                 1        6,606        81.7       16,706         60.1  DeKalb                1        7,367        91.1       16,784         60.4  Ripley-Switzerland    1        8,143       100.7       16,788         60.4  Knox-Pike             2        7,979        98.7       17,106         61.6  Greene                1        9,957       123.2       17,145         61.7  Jasper-Newton         1        6,800        84.1       17,178         61.8  Randolph              1        7,614        94.2       17,536         63.1  Fulton-Pulaski        1        8,304       102.7       17,972         64.7  Cass-Carroll          2        8,121       100.5       18,175         65.4  Benton-White          1        8,411       104.0       18,668         67.2  Gibson                1        8,325       103.0       18,738         67.4  Clinton               1        8,003        99.0       18,965         68.3  Marshall              1        6,437        79.6       19,082         68.7  Morgan                1        6,013        74.4       19,116         68.8  Wabash                1        7,773        96.2       19,287         69.4  Dearborn-Ohio         1        7,619        94.2       19,480         70.1  Perry-Spencer         1        9,235       114.2       19,600         70.6  Montgomery            1        8,741       108.1       19,759         71.1  LaGrange-Steuben      1        7,735        95.7       20,027         72.1  Shelby                1        7,501        92.8       20,401         73.4  Huntington            1        8,469       104.8       20,615         74.2  Henry-Rush            2        7,476        92.5       20,776         74.8  Washington-Orange     1        9,820       121.5       21,087         75.9  Martin-Dubois         1        7,995        98.9       21,324         76.8  Decatur-Jennings      1        9,412       116.4       21,900         78.8  Putnam-Owen           1        9,642       119.3       21,928         78.9  Lawrence              1        7,355        91.0       22,232         80.0  Jackson-Brown         1        8,135       100.6       22,285         80.2  Miami                 1        8,306       102.7       22,524         81.1  Vigo                  3        9,375       116.0       22,719         81.8  Jefferson-Scott       1        7,458        92.3       22,989         82.8  Hendricks             1        5,719        70.7       23,304         83.9  Hamilton              1        5,853        72.4       23,547         84.8  Fayette-Franklin      1        9,123       112.9       23,875         85.9  Wayne-Union           2        7,617        94.2       24,662         88.8  Kosciusko             1        7,074        87.5       24,195         87.1  Howard-Tipton         2        8,263       102.2       24,997         90.0  Adams-Wells           1       10,873       134.5       26,764         96.3  Grant-Blackford       2        9,087       112.4       26,929         96.9  Bartholomew           1        6,772        83.8       27,850        100.2  Tippecanoe-Warren     2        7,458        92.3       28,256        101.7  Floyd                 1        8,511       105.3       30,503        109.8  Madison-Hancock       3        8,450       104.5       30,514        109.8  Elkhart               2        7,949        98.3       31,325        112.8  Vanderburgh-    Warrick-Posey       4        8,617       106.6       31,848        114.6  Delaware              2        8,122       100.5       32,465        116.9  Monroe                1        6,217        76.9       34,316        123.5  LaPorte-Stark         2        8,303       102.7       34,328        123.6  Clark                 1        7,864        97.3       35,657        128.4  Allen-Whitley         4        8,180       101.2       37,331        134.4  Marion-Johnson       12        8,354       103.3       37,429        134.7  St. Joseph            3        8,711       107.8       47,320        170.3  Lake-Porter           6        8,726       107.9       54,502        196.2\n\nAPPENDIX B\n\n(To Statement of Facts)\n\nINDIANA SENATE\n\nPresent Districts Ranked According to 1960 Voting    Population Per Senator, Showing Changes in Population    Relative to Ideal District, 1919-1960.\n\nNote: In the case of counties which are assigned senators          individually and an additional senator jointly with          another county, the two counties have been combined          for purposes of this table.\n\n1919 State             1960 Federal                                   Enumeration                 Census                                 (Males Over 2l)         Voting Population\n\nPopulation              Population\n\nNo. of      Per       % Ideal       Per       % Ideal      District         Sen.       Sen.      District      Sen.      District  --------------------------------------------------------------------------\n\nIDEAL                        16,168                  55,558\n\nClay-Parke            1        13,604      84.1        25,069         45.1  Gibson-Pike           1        13,375      82.7        27,061         48.7  Warren-Fountain-    Vermillion          1        15,526      96.0        28,135         50.6  Jay-Randolph          1        14,288      88.4        31,496         56.7  Whitley-Huntington    1        13,284      82.2        32,970         59.3  Montgomery-Putnam     1        14,735      91.1        34,446         62.0  Dubois-Perry-    Spencer             1        14,386      89.0        35,021         63.0  Adams-Wells-    Blackford           1        14,630      90.5        35,697         64.2  Cass-Fulton           1        16,177     100.1        36,599         65.9  DeKalb-Steuben-    LaGrange            1        15,102      93.4        36,811         66.2  Scott-Jackson-    Washington          1        12,943      80.1        37,034         66.6  Lawrence-Martin-    Orange              1        15,433      95.4        38,644         69.6  Ripley-Dearborn-    Jennings            1        15,773      97.6        39,243         70.6  White-Carroll-    Clinton             1        17,779     110.0        41,081         73.9  Vigo-Sullivan         2        18,392     113.8        41,109         74.0  Knox-Daviess          1        17,569     108.7        41,782         75.2  Kosciusko-Wabash      1        14,847      91.8        43,482         78.3  Grant                 1        14,417      89.2        44,924         80.8  Wayne                 1        13,334      82.5        45,523         81.9  Shelby-Rush-    Fayette             1        17,629     109.0        46,972         84.5  Harrison-Floyd-    Crawford            1        16,394     101.4        47,006         84.6  Hendricks-Morgan-    Owen                1        15,380      95.1        49,661         89.4  Tipton-Hamilton-    Boone               1        17,402     107.6        49,699         89.4  Union-Franklin-    Decatur-Bartholomew 1        18,537     114.7        52,966         95.3  Brown-Monroe    Greene              1        17,870     110.5        55,455         99.8  Ohio-Switzerland-    Jefferson-Clark     1        17,304     107.0        57,466        103.4  Benton-Tippecanoe     1        15,516      96.0        58,268        104.9  Porter-Jasper-    Newton-Pulaski      1        15,953      98.7        58,322        105.0  Madison-Henry-    Hancock             2        17,466     108.0        60,511        108.9  Elkhart               1        15,897      98.3        62,650        112.8  Miami-Howard          1        20,338     125.8        63,048        113.5  Vanderburgh-Posey-    Warrick             2        17,234     106.6        63,696        114.6  Delaware              1        16,243     100.5        64,929        116.9  LaPorte-Starke        1        16,605     102.7        68,655        123.6  Marion-Johnson        6        16,707     103.3        74,858        134.7  Allen-Noble           2        17,256     106.7        76,837        138.3  St. Joseph-Marshall   2        16,285     100.7        80,521        144.9  Lake                  3        15,538      96.1        97,772        176.0\n\nAPPENDIX C\n\n(To Statement of Facts)\n\n1960                                                                      Voting                         Adjusted Representation       Adjusted      Popula-  County                  House        Senate         Total Rep.       tion  --------------------------------------------------------------------------  I Rural\n\nOhio                    0.13          0.04            0.21           2,552  Union                   0.08          0.07            0.22           3,801  Brown                   0.18          0.07            0.32           3,994  Switzerland             0.26          0.08            0.42           4,433  Warren                  0.09          0.18            0.45           5,068  Crawford                0.32          0.11            0.54           5,224  Martin                  0.28          0.15            0.58           5,903  Newton                  0.39          0.12            0.63           6,784  Benton                  0.37          0.12            0.61           6,824  Owen                    0.33          0.15            0.63           7,241  Pulaski                 0.41          0.13            0.67           7,450  Scott                   0.36          0.22            0.80           8,165  Pike                    0.24          0.31            0.86           8,323  Blackford               0.17          0.25            0.67           8,933  Franklin                0.39          0.18            0.75           9,375  Parke                   1.00          0.37            1.74           9,390  LaGrange                0.47          0.25            0.97           9,435  Tipton                  0.19          0.19            0.57           9,470  Spencer                 0.49          0.28            1.05           9,686  Perry                   0.51          0.28            1.07           9,914  Jennings                0.46          0.26            0.98           9,960  Starke                  0.15          0.15            0.45          10,248  Carroll                 0.28          0.25            0.78          10,272  Jasper                  0.61          0.18            0.97          10,394  Orange                  0.50          0.27            1.04          10,509  Fulton                  0.59          0.29            1.17          10,522  Washington              0.50          0.29            1.08          10,578  Steuben                 0.53          0.29            1.11          10,592  Harrison                0.68          0.24            1.16          11,279  Vermillion              1.00          0.41            1.82          11,487  Fountain                1.00          0.41            1.82          11,580  Posey                   0.09          0.09            0.27          11,666  White                   0.63          0.29            1.21          11,844  Decatur                 0.54          0.23            1.00          11,940  Rush                    0.29          0.26            0.81          12,071  Whitley                 0.08          0.37            0.82          12,355  Ripley                  0.74          0.31            1.36          12,355  Wells                   0.47          0.36            1.19          12,698  Warrick                 0.11          0.11            0.33          13,920  Jay                     1.00          0.44            1.88          13,960  Sullivan                1.00          0.17            1.34          14,061  Adams                   0.53          0.39            1.31          14,066  Putnam                  0.67          0.43            1.53          14,687  Dubois                  0.72          0.44            1.60          15,421  Hancock                 0.17          0.13            0.43          15,575  Clay                    1.00          0.63            2.26          15,679  Boone                   1.00          0.34            1.68          16,682  Noble                   1.00          0.11            1.22          16,706  DeKalb                  1.00          0.46            1.92          16,784  Dearborn                0.87          0.43            1.73          16,928  Greene                  1.00          0.31            1.62          17,145  Randolph                1.00          0.56            2.12          17,536  Gibson                  1.00          0.69            2.38          18,738  Marshall                1.00          0.12            1.24          19,082  Morgan                  1.00          0.38            1.76          19,116  Hendricks               1.00          0.47            9.94          23,304  Hamilton                1.00          0.47            1.94          23,547  Kosciusko               1.00          0.56            2.12          24,195  Johnson                 0.06          0.06            0.18          25,059\n\nII Semirural\n\nFayette                 0.61          0.31            1.23          14,500  Jefferson               0.64          0.26            1.16          14,824  Daviess                 1.00          0.38            1.76          15,893  Jackson                 0.82          0.49            1.80          18,291  Clinton                 1.00          0.46            1.92          18,965  Wabash                  1.00          0.44            1.88          19,287  Montgomery              1.00          0.57            2.14          19,759  Shelby                  1.00          0.43            1.86          20,401  Huntington              1.00          0.63            2.26          20,615  Lawrence                1.00          0.58            2.16          22,232  Miami                   1.00          0.36            1.72          22,524  Knox                    1.76          0.62            3.00          25,889  Cass                    1.72          0.71            3.14          26,077  Bartholomew             1.00          0.52            2.04          27,850  Henry                   1.71          0.24            2.19          29,480  Floyd                   1.00          0.65            2.30          30,503  Porter                  0.10          0.58            1.26          33,694  Monroe                  1.00          0.62            2.24          34,316  Clark                   1.00          0.62            2.24          35,657  Howard                  1.81          0.64            3.09          40,524  Grant                   1.83          1.00            3.83          44,924  Wayne                   1.92          1.00            3.92          45,523  Tippecanoe              1.91          0.88            3.67          51,444  LaPorte                 1.85          0.85            3.55          58,407  Elkhart                 2.00          1.00            4.00          62,650  Madison                 2.83          1.63            6.09          75,966\n\nIII Urban\n\nDelaware                2.00          1.00            4.00          64,929  Vigo                    3.00          1.83            6.66          68,157  Vanderburgh             3.80          1.80            7.40         101,805  Allen                   3.92          1.89            7.70         136,967  St. Joseph              3.00          1.88            6.76         141,959  Lake                    5.90          3.00           11.90         293,316  Marion                 11.94          5.94           23.82         424,090\n\nAPPENDIX D\n\n(To Statement of Facts)\n\nSENATE ENROLLED ACT NO. 160\n\n\"AN ACT fixing and prescribing the number of representatives and   senators in the General Assembly of the State of Indiana; and   apportioning the same among the several counties of the state.\n\n\"Be it enacted by the General Assembly of the State of Indiana:\n\n\"Section 1. It is hereby declared the intent of the members ofthe Ninety-third Indiana General Assembly to adopt and toincorporate in this act by reference the official report of theUnited States federal decennial census, taken in the year 1960,as an honest, true, correct and complete enumeration of the maleand female inhabitants of the State of Indiana over the age oftwenty-one years; and upon such report is based a legal and validapportionment of the number of senators and representatives amongthe several counties of the state, pursuant to the provisions ofArticle 4, Section 5, of the Constitution of the State ofIndiana.\n\n\"Sec. 2. For the Ninety-fourth Indiana General Assembly andthereafter the House of Representatives shall consist of onehundred members.\n\n\"Sec. 3. Representatives shall be elected from districts,comprised of one or more counties and having one or morerepresentatives, as follows:\n\nLake County: ten (10) representatives;\n\nPorter County: one (1) representative;\n\nLaPorte County: one (1) representative;\n\nLaPorte and Starke Counties: one (1)  representative;\n\nSt. Joseph County: five (5) representatives;\n\nElkhart County: two (2) representatives;\n\nLaGrange and Noble Counties: one (1)  representative;\n\nSteuben and DeKalb Counties: one (1)  representative;\n\nAllen County: five (5) representatives;\n\nWhitley and Wabash Counties: one (1)  representative;\n\nKosciusko County: one (1) representative;\n\nMarshall and Fulton Counties: one (1)  representative;\n\nNewton, Jasper and Pulaski Counties: one (1)  representative;\n\nBenton and White Counties: one (1) representative;\n\nCass County: one (1) representative;\n\nMiami County: one (1) representative;\n\nWells and Adams Counties: one (1) representative;\n\nGrant County: one (1) representative;\n\nGrant and Blackford Counties: one (1)  representative;\n\nHuntington County: one (1) representative;\n\nHoward County: one (1) representative;\n\nHoward and Tipton Counties: one (1) representative;\n\nCarroll and Clinton Counties: one (2)  representative;\n\nTippecanoe County: one (1) representative;\n\nTippecanoe and Warren Counties: one (1)  representative;\n\nFountain and Montgomery Counties: one (1)  representative;\n\nBoone County: one (1) representative;\n\nHamilton County: one (1) representative;\n\nMadison County: two (2) representatives;\n\nMadison and Hancock Counties: one (1)  representative;\n\nDelaware County: two (2) representatives;\n\nJay and Randolph Counties: one (1) representative;\n\nWayne County: one (1) representative;\n\nWayne and Union Counties: one (1) representative;\n\nHenry County: one (1) representative;\n\nMarion County: fifteen (15) representatives;\n\nHendricks County: one (1) representative;\n\nParke, Putnam and Owen Counties: one (1)  representative;\n\nVigo County: two (2) representatives;\n\nVigo and Vermillion Counties: one (1)  representative;\n\nSullivan and Clay Counties: one (1) representative;\n\nMonroe County: one (1) representative;\n\nMorgan and Brown Counties: one (1) representative;\n\nJohnson County: one (1) representative;\n\nShelby and Rush Counties: one (1) representative;\n\nFayette and Franklin Counties: one (1)  representative;\n\nRipley and Dearborn Counties: one (1)  representative;\n\nDecatur and Jennings Counties: one (1)  representative;\n\nBartholomew County: one (1) representative;\n\nKnox County: one (1) representative;\n\nGreene and Daviess Counties: one (1)  representative;\n\nMartin and Lawrence Counties: one (1)  representative;\n\nJackson and Scott Counties: one (1) representative;\n\nOhio, Switzerland and Jefferson Counties: one (1)  representative;\n\nClark County: one (1) representative;\n\nFloyd County: one (1) representative;\n\nOrange and Washington Counties: one (1)  representative;\n\nCrawford and Harrison Counties: one (1)  representative;\n\nPerry and Spencer Counties: one (1) representative;\n\nDubois and Warrick Counties: one (1)  representative;\n\nPike and Gibson Counties: one (1) representative;\n\nVanderburgh County: three (3) representatives;\n\nVanderburgh and Posey Counties: one (1)  representative.\n\n\"Sec. 4. For the Ninety-fourth Indiana General Assembly andthereafter the Senate shall consist of fifty members.\n\n\"Sec. 5. Senators shall be elected from districts, comprised ofone or more counties and having one or more senators, as follows:\n\nFirst District — Lake County: four (4) senators;\n\nSecond District — Porter, Newton and Jasper  Counties: one (1) senator;\n\nThird District — LaPorte and Starke Counties: one  (1) senator;\n\nFourth District — St. Joseph County: two (2)  senators;\n\nFifth District — Elkhart County: one (1) senator;\n\nSixth District — DeKalb, LaGrange and Steuben  Counties: one (1) senator;\n\nSeventh District — Allen County: two (2) senators;\n\nEighth District — Huntington, Noble and Whitley  Counties: one (1) senator;\n\nNinth District — Kosciuski and Marshall Counties:  one (1) senator;\n\nTenth District — Pulaski, Fulton and Cass Counties:  one (1) senator;\n\nEleventh District — Benton and Tippecanoe Counties:  one (1) senator;\n\nTwelfth District — Carroll, Clinton and White  Counties: one (1) senator;\n\nThirteenth District — Howard and Miami Counties:  one (1) senator;\n\nFourteenth District — Grant and Wabash Counties:  one (1) senator;\n\nFifteenth District — Adams, Blackford and Wells  Counties: one (1) senator;\n\nSixteenth District — Jay and Randolph Counties: one  (1) senator;\n\nSeventeenth District — Delaware County: one (1)  senator;\n\nEighteenth District — Madison County: one (1)  senator;\n\nNineteenth District — Hancock, Henry and Madison  Counties: one (1) senator;\n\nTwentieth District — Boone, Hamilton and Tipton  Counties: one (1) senator;\n\nTwenty-First District — Montgomery, Parke and  Putnam Counties: one (1) senator;\n\nTwenty-Second District — Fountain, Vermillion and  Warren Counties: one (1) senator;\n\nTwenty-Third District — Marion County: five (5)  senators;\n\nTwenty-Fourth District — Marion and Johnson  Counties: one (1) senator;\n\nTwenty-Fifth District — Wayne and Union Counties:  one (1) senator;\n\nTwenty-Sixth District — Fayette, Rush and Shelby  Counties: one (1) senator;\n\nTwenty-Seventh District — Hendricks and Morgan  Counties: one (1) senator;\n\nTwenty-Eighth District — Vigo County: one (1)  senator;\n\nTwenty-Ninth District — Clay, Owen and Sullivan  Counties: one (1) senator;\n\nThirtieth District — Greene, Monroe and Brown  Counties: one (1) senator;\n\nThirty-First District — Bartholomew, Decatur and  Franklin Counties: one (1) senator;\n\nThirty-Second District — Jennings, Ripley, Dearborn  and Ohio Counties: one (1) senator;\n\nThirty-Third District — Clark, Jefferson and  Switzerland Counties: one (1) senator;\n\nThirty-Fourth District — Jackson, Washington and  Scott Counties: one (1) senator;\n\nThirty-Fifth District — Lawrence, Martin and Orange  Counties: one (1) senator;\n\nThirty-Sixth District — Knox and Daviess Counties:  one (1) senator;\n\nThirty-Seventh District — Pike, Gibson and Posey  Counties: one (1) senator;\n\nThirty-Eighth District — Vanderburgh County: one  (1) senator;\n\nThirty-Ninth District — Vanderburgh and Warrick  Counties: one (1) senator;\n\nFortieth District — Dubois, Spencer and Perry  Counties: one (1) senator;\n\nForty-First District — Crawford, Harrison and Floyd  Counties: one (1) senator.\n\n\"Sec. 6. The senators elected in the general election of 1962for a term of four years shall continue to hold their officeuntil their term has expired by limitation.\n\n\"Sec. 6a. The additional senator provided herein for the FirstDistrict, Lake County, shall be elected at the general electionheld in 1964, for a term of two (2) years from the next day afterhis election.\n\n\"Sec. 7. All laws and parts of laws in conflict herewith arerepealed; and chapter 78 and chapter 271 of the Acts of 1921 arehereby specifically repealed.\"\n\nAPPENDIX E\n\n(To Statement of Facts)\n\nHOUSE ENROLLED JOINT RESOLUTION NO. 6\n\n\"A JOINT RESOLUTION proposing an amendment of the Constitution of   the State of Indiana by amending sections 3, 4 and 5 of   Article 4 of the Constitution and to provide for a decennial   reapportionment of the House of Representatives and the   Senate.\n\n\"WHEREAS, the Ninety-third General Assembly of the State of   Indiana recognizes the vital need for a reapportionment of the   General Assembly of the State of Indiana; and\n\n\"WHEREAS, this General Assembly believes that the majority of the   citizens of the State of Indiana desire to establish an   apportionment of the House and the Senate of the General   Assembly, based on population and on the traditional   geographical, governmental, industrial and agricultural areas   of the state, the interests of which areas frequently vary or   conflict; and\n\n\"WHEREAS, this General Assembly firmly believes that the   Constitution of the State of Indiana must be   amended to provide for such apportionment of the General   Assembly: Therefore,\n\n\"Be it resolved by the General Assembly of the State of Indiana:\n\n\"Section 1. The following amendment to the Constitution of theState of Indiana is hereby proposed and agreed to by this, theNinety-Third General Assembly of the State of Indiana, and ishereby referred to the next General Assembly for reconsiderationand agreement.\n\n\"Sec. 2. Section 3 of Article 4 of the Constitution of theState of Indiana is amended to read as follows:\n\n\"Sec. 3. Senators shall be elected for the term of four years andRepresentatives shall be elected for the term of two years,commencing on the day next following their election in suchmanner as may be provided by law. Provided, however, That theSenators elect and holdover Senators at the first meeting of theGeneral Assembly under this amendment of this Constitution, afterapportionment shall divide themselves by lot into two equalclasses, as nearly may be; and the seats of Senators of the firstclass shall be vacated at the expiration of two years, and thoseof the second class at the expiration of four years, so thatone-half, as nearly as possible, shall be chosen bienniallythereafter. Provided, That in cases where more than one Senatoris elected from a Senatorial district, such Senators shall bedivided by lot into two classes, and the terms of the Senators inthe first class shall expire in two years and the Senators in thesecond class shall expire in four years, so that as nearly aspossible thereafter, one-half of the Senators within suchSenatorial districts shall be chosen biennially. Senators electedto fill vacancies in the Senate shall only serve for and duringthe unexpired term of the seat to which they are elected.\n\n\"Sec. 3. Section 4 of Article 4 of the Constitution of theState of Indiana is amended to read as follows:\n\n\"Sec. 4. The census taken in accordance with the provisions ofthe Constitution of the United States pursuant to congressionalenactment in the year 1970, and every ten years thereafter, shallconstitute the enumeration for the purpose of apportioning thenumber of Senators and Representatives as required by thisConstitution.\n\n\"Sec. 4. Section 5 of Article 4 of the Constitution of theState of Indiana is amended to read as follows:\n\n\"Sec. 5. Based upon the enumeration of citizens twenty-one yearsof age and over of the State of Indiana at the first regularsession of the General Assembly next following the year in whichthe 1970 federal decennial census is promulgated, the number ofRepresentatives shall be fixed by law and apportioned among theseveral counties according to the number of inhabitants in eachcounty over twenty-one years of age. Thereafter at the session ofthe General Assembly next following the year in which the census,as prescribed in Section 4 of Article 4 of this Constitution, istaken, the number of Representatives shall be fixed by law andapportioned among the several counties, according to the numberof inhabitants over twenty-one years of age in each county.\n\n\"At the first regular session of the Indiana General Assemblyheld next following the year in which the 1970 federal decennialcensus is promulgated, the number of Senators shall be fixed bylaw and apportioned among the several counties as follows:\n\n\"(a) Each county shall be apportioned one-fifth of a Senator;and\n\n\"(b) The balance of the Senators shall be apportioned among theseveral counties according to the number of citizens twenty-oneyears of age and over in each county of the State of Indiana asdisclosed by the census taken in 1970, as prescribed in Section 4of Article 4 of this Constitution. Thereafter at the session ofthe General Assembly next following the year in which the census,as prescribed in Section 4 of Article 4 of this Constitution, istaken the number of Senators shall be fixed by law andapportioned among the several counties in the same manner.\n\n\"In creating House and Senatorial districts, anyapportionment based upon population shall be as nearly equal aspracticable taking into consideration the natural community areaas well as the economic conditions within the district.\n\n\"In the event any General Assembly, whose duty it is to make anapportionment, shall fail to make the same herein provided, itshall be the duty of the Governor, Secretary of State andAttorney General within thirty (30) days after the adjournment ofthe General Assembly to make such apportionment and when so madeand a proclamation is issued by the Governor announcing suchapportionment the same shall have the same force and effect asthough made by the General Assembly.\"\n\nPrior to the decision of Baker v. Carr (1962), 369 U.S. 186, 82S.Ct. 691, 7 L.Ed.2d 663, the plaintiffs, in Cause Number IP61-C-236, jointly and severally commenced this action in theirown behalf and on behalf of all voters of Indiana similarlysituated by filing their complaint on August 2, 1961.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e ThisThree-Judge District Court was convened on the 14th of August,1961, pursuant to Title 28 U.S.C. § 2281 et seq. to hear anddetermine the action. The complaint was amended on May 25, 1962following the Baker v. Carr decision of the United States SupremeCourt. After the election of and the completion of the regularand special sessions of the 93rd Indiana General Assembly, theplaintiffs filed, on May 17, 1963, their supplemental complaintsetting forth transactions, occurrences, and events which hadtranspired since the filing of their original and amendedcomplaint.\n\nBefore the Court for a ruling is the joint motion to dismissplaintiffs' amended complaint pursuant to Rule 12(b) of theFederal Rules of Civil Procedure filed August 1, 1962 of thefollowing named defendants: Charles O. Hendricks, Secretary ofState of the State of Indiana; Members of the State ElectionBoard composed of Matthew E. Welsh, Governor of the State ofIndiana, as ex officio Chairman, Edwin M.S. Steers and James E.Noland, as members. Three other motions to dismiss were filed onAugust 24, 1961 and September 6, 1961 by certain of the nameddefendants. All of which adopted the same reasons assigned in aprevious motion of the Secretary of State and the State ElectionBoard filed August 24, 1961. These three motions were addressedto the original complaint. They were not renewed as to theamended complaint and are no longer in issue.\n\nUpon trial, the evidence consisted of stipulations andadmissions in the pleadings.After trial on the merits of the issues of the amended andsupplemental complaints and the answer of the Secretary of Stateand the State Election Board, the combined arguments were heardon the issues of the motion to dismiss and the merits of thecase.\n\nThe action is against the named defendants and the classdefendants who are the Secretary of State of the State ofIndiana, all of the members of the State Election Board, all ofthe Clerks of the Circuit Courts of the State of Indiana, and allof the members of each of the ninety-two (92) County ElectionBoards of the State of Indiana. All of the defendants havecertain prescribed duties in conduct of elections of the membersof the General Assembly of the State of Indiana pursuant to theprovision of the Indiana Election Code (Acts of the IndianaGeneral Assembly of 1945, Chapter 208, as amended, being Burns'Indiana Statutes, Section 29-2801 et seq.).\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e\n\nThe plaintiffs assert that the Indiana General Assembly in itsvarious sessions since 1927 has failed and refused to follow themandate of the Indiana Constitution of 1851, as amended, toreapportion itself; that since 1919 (the last enumeration) andsince 1921 (the last apportionment) the growth in population hasbeen uneven among the various counties resulting in a dilutionand debasement of the voting strength and representation ofcertain counties, the voters and inhabitants, includingplaintiffs, therein, whereas certain other counties and thevoters and inhabitants therein have become grosslyoverrepresented contrary to the express provisions of the IndianaConstitution of 1851, as amended. The plaintiffs further assertthat the 93rd Indiana General Assembly failed and refused tofollow the Constitution's mandate in its regular and specialsession since the United States Supreme Court's decision of Bakerv. Carr.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e The plaintiffs ask this Three-Judge District Courtto take jurisdiction of their declaratory judgment action anddeclare the rights of the plaintiffs pursuant to 72 Stat.L. 349,28 U.S.C. § 2201, to wit:\n\n1. \"a. That the present apportionment of the       General Assembly of the State of Indiana has       deprived and continues to deprive the plaintiffs       of liberty and property without due process of       law and has denied and continues to deny to the       plaintiffs the equal protection of the laws, in       violation of the 14th Amendment to the       Constitution of the United States.\"\n\n2. \"b. That Indiana Acts of 1921, Ch. 78, Sec. 2       and Indiana Acts of 1921, Ch. 271, Sec. 2       (Burns' Indiana Statutes, Secs. 34-102 and       34-104) are void and invalid as contrary to the       14th Amendment to the Constitution of the United       States, and the Constitution of the State of       Indiana, by reason of the failure to reapportion       the Legislative districts of the State of       Indiana in accordance with the present       distribution of population among the various       counties of the State as herein alleged.\"\n\n3. \"c. That the right of these plaintiffs to vote       in free and equal elections as guaranteed by       Article 2, Secs. 1 and 2 of the Constitution of       Indiana,       and the right of plaintiffs to be governed by a       General Assembly representative of the people of       the State as guaranteed by Article 1, Sec. 1 of       the Constitution of the State of Indiana, has       been impaired.\"\n\nand that, after a hearing, further relief be granted plaintiffspursuant to 62 Stat.L. 964, 28 U.S.C. § 2202, to wit:\n\n4. \"a. To restrain the defendants from furnishing       forms for nominations, from receiving       declarations of candidacy or nomination       petitions and papers, from preparation of       ballots to be used at primary or general       elections in 1962, from certification of       nominations or elections, and from any other       acts necessary to the holding of elections for       members of the Indiana General Assembly in       accordance with the districts established by the       Indiana Acts of 1921, Ch. 78, Sec. 2 and Ch.       271, Sec. 2 (Burns' Indiana Statutes, Secs.       34-102 and 34-104), until such times as the       General Assembly enacts legislation       reapportioning the State Senatorial and       Representative districts in accordance with the       requirements of the Constitution of the State of       Indiana.\"\n\n5. \"b. (1) To direct the defendants to declare that       the next primary and general elections for       members of the Indiana General Assembly shall be       held on an at-large basis, and to direct them to       take  whatever further action is necessary to       insure that all candidates for election to the       93rd Indiana General Assembly, scheduled to hold       its session in 1963, run at-large throughout the       entire State on the following basis: the 100       candidates for the House of Representatives       receiving the highest number of votes shall be       declared elected to the House of       Representatives; and the 50 candidates for the       State Senate receiving the highest number of       votes shall be declared elected to the State       Senate; and said method of election to continue       until such time as the Indiana General Assembly       enacts legislation reapportioning the State       Senatorial and Representative districts in       accordance with the requirements of the       Constitution of the State of Indiana; or, in the       alternative, (2) To direct the defendants to       hold the next primary and general elections for       members of the 93rd Indiana General Assembly on       the basis of new districts established by decree       of this Court, through mathematical application       of the formulae set out in the Indiana       Constitution to the official 1960 federal census       population figures for the various counties of       the State, and to continue to hold elections on       the basis of such new districts, unless and       until the Indiana General Assembly enacts       legislation reapportioning the Representatives       and Senators among the counties of the State as       required by the Indiana Constitution.\"\n\n6. \"c. To grant such other or further relief as may       seem just, equitable and proper.\"\n\nThe motion to dismiss is grounded on the followingspecifications:\n\nA. \"1. The Complaint, as amended by plaintiff's    Amendments to Complaint, fails to state a claim    upon which relief can be granted to plaintiffs    because the relief sought would be expressly    contrary to the Constitution of the State of    Indiana, in that such relief would be violative of    Art. 2, Sec. 1 and Art. 4, Secs. 2 and 7 thereof.\"\n\nB. \"2. The Complaint, as amended by plaintiffs'    Amendments to Complaint, fails to state a claim    upon which relief can be granted to plaintiffs    because the relief sought would be expressly    contrary to the Constitution of the State of    Indiana, in that such relief would be violative of    Art. 4, Secs. 4 and 5 thereof.\"\n\nC. \"3. The Complaint, as amended by plaintiffs'    Amendments to Complaint, fails to state a claim    upon which relief can be granted to plaintiffs    because the relief sought would be violative of the    separation of powers doctrine provided by Art. 3,    Sec. 1 of the Indiana Constitution, which doctrine    is likewise a vital principle and part of the    foundation of our federal government.\"\n\nFollowing the Baker v. Carr decision, the plaintiff,\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e inCause Number IP 62-C-326, commenced this action\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e on August 7,1962. The action is against the State Election Board of Indiana(one of the defendants in Cause Number IP 61-C-236). Theplaintiff in this action also asserts the same factual backgroundas in IP 62-C-236 and claims that his vote is less effective andhe is denied an equal voice in the government of the state. Hefurther asserts by reason of a judgment entered March 17, 1961 ofthe Marion Superior Court, Room Number 5, declaring Chapters 78and 271 of the 1921 Acts of the Indiana General Assemblyunconstitutional and that members of the Senate of the IndianaGeneral Assembly were thereafter without de facto authority toact. That action was brought by Nelson G. Grills, as Senator ofthe State of Indiana, (the same Mr. Grills suing as an individualin this action) against certain other State Senators. Thejudgment was not appealed by those defendants. The plaintiff asksthis Three-Judge District Court to take jurisdiction of hisdeclaratory judgment action and declare the rights of plaintiffpursuant to 72 Stat.L. 349, 28 U.S.C. § 2201, to wit:\n\n\"Wherefore, the plaintiff prays for an order  declaring the action of the State Election Board of  Indiana in holding an election of members of the  General Assembly from districts which have been  declared unconstitutional to be unconstitutional and  invalid. The plaintiff further prays that pending a  hearing upon the merits of this case, a preliminary  injunction issue enjoining the defendants from  conducting an election in the State of Indiana of  members of the General Assembly from districts  apportioned under acts which have been declared  unconstitutional, that upon a hearing the preliminary  injunction be made permanent; the plaintiff be given  all such other, further and different relief as this  court may deem just and necessary in the  premises. * * *\"\n\nThe defendants filed, on October 8, 1962, an amended motion todismiss plaintiff's complaint supported by verified evidence.(This motion while designated a motion to dismiss is also incontent a motion for summary judgment prescribed by Rule 56 ofthe Federal Rules of Civil Procedure.) The plaintiff filed, onSeptember 7, 1962, a motion for summary judgment supported byverified evidence.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e This Court, on October 19, 1962, deniedplaintiff's motion for summary judgment insofar as it prayed fora preliminary injunction to restrain defendants from conductingthe election for members ofthe General Assembly of Indiana at the November 6, 1962 electionand reserved judgment and ruling on the other issues inplaintiff's and defendants' motions. After trial on the merits,the combined arguments were heard on the issues of the motionsand merits of the case.\n\nThe defendants do not contest the jurisdiction of the Courtover the parties and subject matter of the consolidated actions,nor is there any contest as to the alleged facts. All grounds ofdefendants' motions are directed against the relief demanded byplaintiffs against these defendants, administrators of Indianaelections. A stipulation of the issues of the pleadings filed bythe parties in Cause Number IP 61-C-236, on May 27, 1963, is tothis effect.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e In a statement of the issues of the pleadingsfiled by the defendants in Cause Number IP 62-C-326, on May 17,1963, the defendants admit all rhetorical paragraphs except three(3), seven (7) and ten (10) of the plaintiff's affidavit setforth in footnote six (6) of this opinion. Rhetorical paragraphthree (3) they specifically deny the implication that defendantsmight have the power to enumerate and reapportion the IndianaGeneral Assembly. Rhetorical paragraph seven (7) theyspecifically deny the accuracy of the allegation and assert thatenumerations of the male inhabitants were made in 1925 and 1931.Rhetorical paragraph ten (10) they allege is not evidence but isa conclusion of law which conclusion they deny.\n\nWhen the issues of the cases were resolved to that ofappropriate remedy, the Attorney General of the State of Indianarepresenting the defendants in both actions made the followingstatement:\n\n\"For this Court to successfully effect the  reapportionment of this State, in some manner other  than relying on the State Legislature, it is  essential that the reapportionment be done in a  manner that is not subject to criticism of political  partisanship. This is so because for any  apportionment to be truly effective, it must be  accepted by the people of Indiana. The Attorney  General is an elected official of the State of  Indiana. Any suggestions that he might make, as to an  equitable apportionment of the State would, no matter  how fair, be subject to cries of partisanship. For  this reason,  the Attorney General, unless ordered to do so by this  Court, would respectfully decline to suggest what  remedy this Court should follow. His reason for doing  this is to give this Court a chance to effect a  reapportionment without any taint of political  partisanship attached.\"\n\nAvoiding a dip into the political thicket of remedies, theAttorney General, without suggesting that the Court adopt any ofthe plaintiffs' proffered remedies, briefed the difficulties ofsuch remedies. While the defendants admit that no rationalexplanation of the present apportionment in Indiana can be madeconsistent with the equal protection clause, they suggest itshould not be labeled as hostile or invidious discrimination.That such castigation should be reserved for circumstances asdisclosed in Gomillion v. Lightfoot, 364 U.S. 339, 81 S.Ct. 125,5 L.Ed.2d 110. There are other discriminations. The AttorneyGeneral further challenges plaintiffs', all inclusive assertionsthat the 93rd Indiana General Assembly wholly failed to performits duty under the Indiana Constitution in view of the quotedconstitutional amendment and Senate Bill No. 160 referred to inthis opinion which plaintiffs assert was legally vetoed. TheAttorney General also points out that the plaintiffs' claim, thatthe lack of equal protection results from the failure to complywith the mandate of the Indiana Constitution when the failureresults in discrimination, misses the issue. If apportionment isdiscriminatory, it would make no difference whether thelegislature had followed the Indiana Constitution; to follow theIndiana Constitution might itself amount to a violation of equalprotection. Sims v. Frink, 208 F. Supp. 431, (M.D.Ala. 1962);Davis v. Synhorst, 217 F. Supp. 492, (S.D.Iowa 1963); and Sincockv. Duffy, 215 F. Supp. 169 (D.Del. 1963).\n\nThe relief sought by the plaintiffs against the defendants asadministors of the elections by-passes the frontal approach ofdirect action against the Governor of the State. He alone has thepower of calling that legislative body into special session withveto and approval power of legislation adopted in such a session.He is not a defendant in his capacity as a Governor although heis a defendant in this case as an election official. Certain ofthe relief sought seeks this Court to perform the functions ofthe judicial branch of government and also that of the Governorand the Indiana General Assembly. This power the Court cannotassume.\n\nThe State of Indiana was admitted into the Union on December11, 1816, 3 Stat. 399. It has had Two Constitutions. The last wasdone in convention on February 10, 1851, effective November 1,1851, superseding the one of 1816.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e The 1851 Constitution hasbeen amended\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e and as so amended it was the fundamental law ofIndiana at the time of the commencement of this action and tothis date. The people of Indiana in execution of their right toa republican form of government in Article 4 of such Constitutionvested the legislative authority in the General Assemblyconsisting of a Senate and a House of Representatives. Itsregular and special sessions are limited to sixty-one (61) andforty (40) days respectively. The regular sessions are heldbiennially and commence on the Thursday next after the firstMonday of January the first of which was in the year 1853. Itsspecial sessions are held at any time on proclamation of theGovernor when, in the opinion of the Governor, the public welfareshall require it. The members of the Senate cannot exceed fifty(50) and the House of Representatives cannot exceed one hundred(100), each of whom must have been prior to his election aninhabitant of the State for two (2) years and of the county ordistrict whence he or she is chosen for one (1) year. They arechosen by the electors of the respective counties or districtsinto which the State may, from time to time, be divided. Theterms of office of the members of the House ofRepresentatives are for the term of two (2) years and the membersof the Senate are for the term of four (4) years with one-half ofthe Senators chosen biennially.\n\nPrior to March, 1881, the constitutional basis of apportioningrepresentation was \"white male\" inhabitants, above twenty-one(21) years of age. The electors were also limited to \"white male\"citizens who satisfied certain age and residencerequirements.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e The Fifteenth Amendment to the Constitutionof the United States, effective March 30, 1870, (ratified by theState of Indiana on May 14, 1869) precipitated the amendment ofthe Indiana Constitution in March, 1881, by deleting \"white male\"and establishing the basis of apportioning on the \"male\"inhabitants over the age of twenty-one (21) years. Thequalifications of electors were also changed to \"male\" citizensotherwise qualified.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e The Nineteenth Amendment to theConstitution of the United States, effective August 26, 1920,(ratified by the State of Indiana on January 16, 1920)precipitated the amendment of the Indiana Constitution inSeptember, 1921, by deleting the \"male\" qualification of electorsso that thereafter \"every citizen\" (including women) who hadcertain age and residence requirements became a qualifiedelector.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e No change has been made in Article 4, Sections 4and 5, of the Constitution of Indiana since the NineteenthAmendment to the Constitution of the United States and theamendment to Article 2, Section 2, of the Constitution ofIndiana. The basis of apportionment of the members of the IndianaGeneral Assembly has continued to be on the enumeration of themale inhabitant while their electors are men and women of allraces, creeds and colors, and both men and women are qualified toseek and hold office as members of the Indiana General Assembly.\n\nThe last apportionment made under Sections 4 and 5 of Article4 of the Constitution of Indiana was by the General Assembly's1921 Acts, being Chapter 78 and Chapter 271. Such was based onthe 1919 enumeration of male inhabitants above twenty-one (21)years of age. No apportionment has been made including womeninhabitants in the enumeration. All members of the IndianaGeneral Assembly since 1921 have been selected and elected underthe districting apportioned in the 1921 Acts so based on the 1919enumeration of the male inhabitants, including those nominated inthe May 1962 primary, candidates on the ballots in the November1962 election, and those elected in the November 1962 election.\n\nThe Constitution of Indiana contains no provision forinitiative or referendum by which the electors could apportion.It can be amended only by passage of a proposed amendment by theHouse of Representatives and the Senate at two successive regularsessions prior to submission of any such amendment to theelectors.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e A constitutional convention cannot be calledunless the General Assembly submits such question to theelectors. Action on enumeration and apportionment is thereforedependent upon the General Assembly under the Constitution ofIndiana.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe inhabitant referred to in Sections 4 and 5 of Article 4 ofthe Indiana Constitution of 1851 referred to an inhabitant withall political privileges. Inhabitant as used therein was notsynonymous with an elector. A male inhabitant would have beenenumerated even thoughhe was not a qualified elector, or may never be such as definedin Article 2 of the Indiana Constitution. Inhabitant as usedtherein was not synonymous with citizen. Women were expresslyexcluded and for a while after the 1851 Constitution negroes werealso expressly excluded by the limitation \"white maleinhabitant\".\n\nWomen inhabitants of Indiana were citizens of Indiana and theUnited States long before the adoption of the Fourteenth andNineteenth Amendments to the United States Constitution. Minor v.Happersett, Mo., 21 Wall. 162, 22 L.Ed. 627. They did not thenpossess one of the political privileges of the male citizen, theright to vote. The Fourteenth Amendment reaffirmed the status ofwomen as citizens of Indiana, but it did not qualify her for thestatus of an inhabitant of Indiana for the enumeration andapportionment purposes of Article 4, Sections 4 and 5 of theIndiana Constitution which expressly excluded her by thelimitation \"male inhabitant\". Such sections were not repugnant tothe amendment. The Fourteenth Amendment's equal protectionclause, when adopted, had no effect on the exclusion of womenfrom such sections of Article 4 of the Indiana Constitution andsuch sections were not repugnant to the amendment. The FourteenthAmendment cannot be said to have been intended, when adopted, tosupersede Sections 4 and 5 of Article 4 of the IndianaConstitution.\n\nThe Constitution of the United States never has and does notnow prescribe the factors of enumeration and apportionment of thelegislative bodies of the states. The choice is left to the Stateof Indiana to have a bicameral or unicameral legislature, thenumber of officials, the districting thereof according topopulation, geography, units of government, economic welfare ofthe State and many other factors. Such choice must be based onreason and just need and has been termed \"rationallyexplainable\". Any choice that is not so rationally explainablebrings into focus the equal protection clause. A reading of thedelegates' debates in the constitutional convention whichauthored the 1851 Constitution of Indiana discloses the factorsof choice. The debates also expose the political compromisesnecessary to reach a rationally explainable choice. It is obviousfrom the pleadings and briefs of the uncertainty, if notinability, of one man, let alone one hundred (100)Representatives and fifty (50) Senators to have a meeting of mindand in good faith to propose an equitable plan unshaded byprejudices or the emphasizing of one or more factors.\n\nThe adoption of the Fifteenth and Nineteenth Amendments to theUnited States Constitution, referring to the right to vote, andthe State of Indiana Amended Article 2, Section 2, of itsConstitution, provided that all citizens with uniformqualifications are electors. Thus, the subject of the Fifteenthand Nineteenth Amendments was electors not apportionment or theenumerating of inhabitants who are not even electors but some ofwhom are potential electors. The Nineteenth Amendment itselfcannot be said to have been intended, when adopted, to supersedeSections 4 and 5 of Article 4 of the Indiana Constitution. TheNineteenth Amendment does not of itself make the provisions ofArticle 4, Sections 4 and 5, repugnant and thus supersede them.\n\nIndiana has persistently through the administrations of manyGovernors and sessions of the Indiana General Assembly ignoredthe rights of women inhabitants to be enumerated andapportionment made thereon. Even the plaintiffs in their actionsseek enforcement of enumeration of \"male inhabitants\" and therebyexcluding women. In the 93rd session of the Indiana GeneralAssembly, legislation was introduced which among other thingsprovided for the inhabitants to be enumerated to include womenand thus ignoring the provisions of Article 4, but such billfailed. The quoted constitutional amendment resolved by thespecial session of the 93rd Indiana General Assembly againdemonstrates an unwillingness to merely include women inhabitantswithout effecting other basic changes.Such long inaction through many administrations depicts majorpublic dissatisfaction with the whole of the provisions ofArticle 4, Sections 4 and 5 of the Indiana Constitution. Thefunction of the Court is to only interpret and apply the law.Article 4, Sections 4 and 5, were never intended to include womenand have never been superseded. The whole of Sections 4 and 5must stand the legal test of constitutionality.\n\nThe heart of the relief sought by the plaintiffs is dependenton Article 4 of the Indiana Constitution. Plaintiffs claim thatthe two Acts of 1921 creating the districts are unconstitutionalbecause of the Indiana General Assembly's failure since 1927 toenumerate and apportion in accordance with Article 4, Sections 4and 5 of the Indiana Constitution. Plaintiffs, in Cause Number IP61-C-236, also ask this Court to enumerate and apportion (invarious alternative demands) in accordance with such Article 4,Sections 4 and 5. The Indiana Supreme Court has never passed uponthe constitutionality of the 1921 Acts and Article 4, Sections 4and 5 of the Indiana Constitution, although by the late case ofState of Indiana ex rel. Welsh v. Marion Superior Court, Room 5,et al., (1962), Ind., 185 N.E.2d 18, the Supreme Court of Indianaheld that the Indiana State Election Board was not vested withthe power and authority to make a reapportionment of the IndianaGeneral Assembly as the power to apportion is by the Constitutionvested solely in that body. Thirty-six (36) years of confusion,inaction and the avoidance of presenting the constitutionalapportionment issue to the Indiana Supreme Court for decisionshould impel this Court to reach such issue in this case. It willarise in future litigation with the known multiplicity ofapportionment actions. There are prevalent doubts of the legalityof the election of the members of the Indiana General Assembly inthe immediate future. The manifest public importance of the issuerequires a basic precedent for the immediate future guidance ofIndiana officials and its citizens. Sections 4 and 5 of Article4 of the Indiana Constitution deny the citizens of Indiana, whoseinhabitants and electors include women, the equal protection ofthe laws of Indiana. Discrimination between the sexes for theapportionment of membership of the General Assembly is anunnatural and unreasonable classification. The exclusion of womeninhabitants as a class is discriminatory and just as unreasonableas would be any class exclusion because of an inhabitant's race,creed or color. This discrimination is present by reason of therecited altering and reforming of selected articles and sectionsof the Constitution and the failure to make changes in Article 4,Sections 4 and 5. The provisions of Section 2 of Chapter 78 andSection 2 of Chapter 271 of the 1921 Acts of the Indiana GeneralAssembly also deny the citizens of Indiana the equal protectionof the laws of Indiana for the same reason.\n\nThe 1921 Apportionment Acts were not void ab initio. The actualexistence of such Acts prior to this determination is anoperative fact which has consequences which cannot be ignored.The past, present and future effect of such Acts cannot be erasedby this Court's judgment under the circumstances of this case.Chicot County Drainage Dist. v. Baxter State Bank, (1940)308 U.S. 371, 60 S.Ct. 317, 84 L.Ed. 329; Missouri Utilities Co. v.City of California, Mo., D.C., 8 F. Supp. 454; 8 Cir.,79 F.2d 1003; Phipps v. School District of Pittsburgh, 3 Cir.,111 F.2d 393; J.A. Dougherty's Sons v. Commissioner of Internal Revenue,3 Cir., 121 F.2d 700; and Warring v. Colpoys, 74 App.D.C. 303,122 F.2d 642, 136 A.L.R. 1025. The circumstances facing Indianaare clear without prolonging this opinion. Without the districtscreated by the 1921 Acts, there would be no legislative body. Thegovernmental needs of the State of Indiana require the existenceof a legislative body. No court or any other agency of governmentcan legislate new districts or otherwise perform the legislativepowers of the Indiana General Assemblyprovided for in Article 4 of the Indiana Constitution.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Thepractical as well as the theoretical effect of an immediateenjoining of the defendants in their election duties would bechaos in Indiana's organized government. The districtsestablished by the apportionment acts prior to the 1921 Acts areinvalid for the same reason, and they cannot be utilized orrejuvenated, nor can redistricting be accomplished under Article4, Sections 4 and 5 of the Indiana Constitution by emergencylegislation as such new legislation would be accused of being, ifnot actually, void ab initio.\n\nI respectfully disagree with my senior colleagues of the Courtas to their express or implied approval of the validity ofArticle 4, Sections 4 and 5 of the Indiana Constitution. Decisionon this question is necessary now in the determination of thoseissues reached today and will be material to a determination ofthe postponed decision of the issues of other relief requested bythe plaintiffs. Likewise the determination is material for alegislature who will apportion in the future.\n\nWhen apportionment is made on the enumeration of the maleinhabitants as prescribed by Article 4, Sections 4 and 5, anddistricts are created as prescribed by Article 4, Section 6,there of necessity must be an allowable tolerance. That is, notwo districts will have the same number of male inhabitants butthey will have the same proportionate number of Senators andRepresentatives. No two districts will have the same number ofwomen inhabitants and when the male tolerance is added to theexcess women of the same district over the other district youhave quite a surplus. For example, Marion County has 25,000 morewomen than men; Vanderburgh County has 7,657 more women than men;Lake County has 2,070 less women than men; Tippecanoe County has378 less women than men; and Madison has 2,334 less women thanmen. There are other examples all over the State in the 1930,1940, 1950 and 1960 census. See Appendix \"C\". When tolerances arecompounded the result is substantial discrimination against womenin the various counties. According to the 1960 census Lake Countyhad 147,693 male inhabitants over the age of twenty-one years,which I will call District \"A\". I have assembled a District \"B\"composed of twelve (12) counties whose male inhabitants over theage of twenty-one years total 150,025 in an effort to comply withArticle 4, Sections 4 and 5 and to comply with the whole countyand contiguous counties provisions of Article 4, Section 6. Aso-called slight variance or tolerance exists of 2,332 maleinhabitants in District \"B\" that does not violate the FourteenthAmendment. However, because of Indiana's constitutionaldiscrimination against women, the 145,623 women inhabitants overthe age of twenty-one of District \"A\", according to the 1960census, were not enumerated and the 162,757 women inhabitantsover the age of twenty-one of District \"B\", according to the 1960census, were not enumerated. Thus, another variance of 17,134female inhabitants exist in District \"B\" and a compoundedvariance total of 19,466 in District \"B\". See Appendix \"D\". Theobjective of Article 4, Sections 4 and 5, when adopted was toenumerate all inhabitants with political privileges. When thenegro received political privileges, these sections were amended.When women received political privileges, such sections were notchanged and the objective of Sections 4 and 5 is being ignored.The essential difference between the constitutional provisions ofArticle 4, Sections 4 and 5, and any apportionment statute (be itthe 1921 Acts or the 1965 Acts) is that a constitution generallystates principles and establishes a foundation of law andgovernment, whereas, a statute must provide details of thesubject of which it treats. Article 4, Sections 4 and 5, unlikean apportionment statute,are intended not merely to meet existing conditions but to governfuture contingencies. There is no proviso clause in Article 4,Sections 4 and 5, to the effect that enumeration andapportionment will be based on the male inhabitants so long asthe variance of men to women is inconsequential; and that whenthe variance is significant apportionment will be based on bothmen and women. To leave Article 4, Sections 4 and 5 on the booksis to require future legislatures to enumerate only the males andapportion thereon — they are not a court. Do they have theauthority to count men only at one time and the next time todisregard Article 4, Sections 4 and 5 and count men and women?Also keep in mind how long it takes for the people of Indiana toamend Article 4, Sections 4 and 5, and in the meantimeenumeration and apportionment is over. Our stamp of approval willmislead governmental officials and the public now and in thefuture. The evidence before us discloses the possible confusionthat reigned in the general session of the Indiana GeneralAssembly in 1963. There was a bill introduced which clearlyignored the mandate of Article 4, Sections 4 and 5, because itsought to enumerate and apportion on the basis of both male andfemale inhabitants. The bill failed. It is reasonable to believethat sufficient members of the legislature refused to considerthe bill because it was contrary to the express terms of Article4, Sections 4 and 5. The women as a class of Indiana inhabitantscannot have considered at any time a legislative enactment toenumerate them with the males and apportion accordingly becauseof Article 4, Sections 4 and 5. Women have never been, are notnow and never will be enumerated and apportionment has neverbeen, is not now and never will be inclusive of them because ofArticle 4, Sections 4 and 5. These are facts, discriminatoryfacts, that have existed in the past, present and future. The useof the so-called \"ideal district\" as the starting premise aspresented by plaintiffs ignores essential and material factors ofenumeration and apportionment. This device of statistical proofoverlooks those factors saddled onto the Indiana GeneralAssembly. For example, but not in limitation of otherconstitutional factors, Article 4 of the Indiana Constitutionforbids the division of a county in setting up a district andrequires that where more than one county comprise a district thatsuch counties must be contiguous. Plaintiffs use of the \"idealdistrict\" amounts to no more than \"State Arithmetic\", a system ofcomputing by which differences between individuals, groups andclasses are eliminated by the taking of an average. If suchstatistics prevail then the liberty and individuality of women asa group or class in Indiana will be emasculated. The verydiscrimination complained of by the named four male plaintiffs.The accuracy of plaintiffs arithmetic is not equivalent to theaccuracy of knowledge that when a legislature apportions andcreates districts that districts will be substantially overrepresented and others will be substantially under-represented;also that if women were enumerated, the makeup of counties indistricts will be substantially different than where men only areenumerated.\n\nThe Indiana Constitution contemplates continuity of itsorganized government until the constituted branch of governmenteffects the necessary changes. The 93rd Indiana General Assemblyand its membership is an accomplished fact. The districts underthe 1921 Acts are in effect now and in the future for suchreasonable time as is necessary to legislate new districtscontemplated by Article 4 of the Indiana Constitution exclusiveof its unconstitutional Sections 4 and 5. Time must be measuredby the constitutional requirements of time needed to either enactlegislation or amend the Constitution or both, or effect a newConstitution in convention. It is the Indiana Constitution thatcontrols time requirements. The power to precipitate this lies inthe Governor by calling a special session of the Indiana GeneralAssembly when in his discretion the welfare of the State demandsit and the power to enact or initiate such is in the IndianaGeneral Assembly. The members of the Indiana General Assembly andthe Governor of Indiana by this decree are entitled to beinformed of the status of the districts whereas individualopinion heretofore prevailed. The time required to accomplish theamendment initiated in the past special session of the 93rdGeneral Assembly is too long to justify the continuedconstitutional infringements on the citizens of Indiana and thereis a need for interim relief by legislative action pending theprogress of such constitutional amendment. There is sufficientconstitutional authority in Article 4 of the Indiana Constitutionwithout reliance on the unconstitutional Sections 4 and 5 thereofto enact a law creating legislative districts within which toconduct an election for the membership of the 94th or 95thIndiana General Assembly. Sufficient time may exist for theGovernor and the Indiana General Assembly to take affirmativeaction to replace the 1921 Acts before the 1964 elections,however, such time issue is not before the Court. Judicial noticeis taken of the fact that vacancies exist in the membership ofthe Indiana General Assembly which leaves certain districtsunrepresented should a special session of the General Assembly becalled and convened. Judicial notice is taken of the practicalproblems of the Governor and of the Indiana General Assemblyunder Indiana's Constitution and cannot in the interest of allcitizens of the State so limit the time for accomplishment of theforging of new districts by granting an injunction against theseelection official defendants from conducting an election of themembers of the 94th General Assembly approximately six (6) monthshence. It should be contemplated that appeals may be taken fromthis Court's ruling. Organized government in Indiana will sufferwith the prevalent doubts pending appeal which may not beconcluded until a decision of the Supreme Court of the UnitedStates, at the very earliest, in the middle of the election yearof 1964. Because the Governor and the members of the 93rd IndianaGeneral Assembly are not parties to this action and theconsequent lack of evidence pertaining to the possible issuesthat would be present, the Court should refrain from consideringthe equities or practicalities now facing the Governor in thedecision, which is his under the Constitution, of whether or notthe public welfare of the State now or at any time demands thathe proclaim a special session of the 93rd Indiana GeneralAssembly. Some of the facts which he no doubt will and hasconsidered have been referred to and no doubt there are many morefactual practical considerations upon which the Court need notspeculate.\n\nThe judgment of The Marion Superior Court, Room Number 5,rendered March 17, 1961, is not a binding precedent on this Courtor on these defendants, the members of the State Election Boardof Indiana, as they were not parties to that action and theissues were not the same as presented in this action.Furthermore, none of the parties to that judgment sought or holdthe office of Senator at or as a result of the November 1962election. The notice to and the appearance of the AttorneyGeneral of Indiana in such action does not bind these defendantsor the State of Indiana to such judgment.\n\nTherefore, it is the considered judgment of this member of theCourt that the defendants should be enjoined from conducting aprimary and election in 1966 for members of the 95th IndianaGeneral Assembly in the legislative districts created by the 1921Acts, Section 2 of Chapters 78 and 271 and under the provisionsof Article 4, Sections 4 and 5 of the Indiana Constitution andfrom enforcing such sections of such chapters of the 1921 Actsand Sections 4 and 5 of Article 4 of the Indiana Constitution.\n\nThe parties should be ordered to within ten (10) days submit anappropriate injunction entry for the Court's considerationfor service on the named defendants and each of the classdefendants with a roster including addresses of each of theclass defendants.\n\nThe motions of the defendants in both cases should be denied.The motion of the plaintiff in Cause Number IP 62-C-326 should bedenied.\n\nAPPENDIX A\n\n(To Separate Opinion of Judge Holder)\n\nCONSTITUTION OF STATE OF INDIANA\n\n1851\n\nPreamble\n\nTo the end, that justice be established, public ordermaintained, and liberty perpetuated: We, the People of the Stateof Indiana, grateful to Almighty God for the free exercise of theright to choose our own form of government, do ordain thisConstitution.\n\nArticle 1\n\nBILL OF RIGHTS\n\n§ 1. Natural rights. — We Declare, That all men are createdequal; that they are endowed by their Creator with certainunalienable rights; that among these are life, liberty and thepursuit of happiness; that all power is inherent in the People;and that all free governments are, and of right ought to be,founded on their authority, and instituted for their peace,safety, and well-being. For the advancement of these ends, thePeople have, at all times, an indefeasible right to alter andreform their government.\n\n§ 12. Courts open — Due course of law — Administration ofjustice. — All courts shall be open; and every man, for injurydone to him in his person, property, or reputation, shall haveremedy by due course of law. Justice shall be administeredfreely, and without purchase; completely, and without denial;speedily, and without delay.\n\n§ 23. Privileges equal. — The General Assembly shall not grantto any citizen, or class of citizens, privileges or immunitieswhich, upon the same terms, shall not equally belong to all,citizens.\n\n§ 25. Taking effect of laws. — No law shall be passed, thetaking effect of which shall be made to depend upon anyauthority, except as provided in this Constitution.\n\n§ 26. Suspension of laws. — The operation of the laws shallnever be suspended, except by the authority of the GeneralAssembly.\n\n§ 31. Right to assemble, instruct, and petition. — No law shallrestrain any of the inhabitants of the State from assemblingtogether in a peaceable manner, to consult for their common good;nor from instructing their representatives; nor from applying tothe General Assembly for redress of grievances.\n\nArticle 2\n\nSUFFRAGE AND ELECTIONS\n\n§ 1. Elections free and equal. — All elections shall be freeand equal.\n\n§ 2. Qualifications of electors. — In all elections, nototherwise provided for by this Constitution, every white malecitizen of the United States, of the age of twenty-one years andupwards, who shall have resided in the State during the sixmonths immediately preceding such election; and every white male,of foreign birth, of the age of twenty-one years and upwards, whoshall have resided in the United States one year, and shall haveresided in this State during the six months immediately precedingsuch election, and shall have declared his intention to become acitizen of the United States, conformably to the laws of theUnited States on the subject of naturalization, shall be entitledto vote in the township or precinct where he may reside.\n\n§ 3. Soldiers — Seamen — Marines. — No soldier, seaman, ormarine, in the army or navy of the United States, or of their,allies, shall be deemed to have acquired a residence in theState, in consequence of having been stationed within the same;nor shall any such soldier, seaman, or marine have the right tovote.\n\n§ 4. Residence. — No person shall be deemed to have lost hisresidence in the State by reason of his absence, either onbusiness of this State or of the United States.\n\n§ 8. Disfranchisement. — The General Assembly shall have powerto deprive of the right of suffrage, and to render ineligible,any person convicted of an infamous crime.\n\n§ 9. Effect of holding lucrative offices — No person holding alucrative office or appointment under the United States or underthis State, shall be eligible to a seat in the General Assembly;nor shall any person hold more than one lucrative office at thesame time, except as in this Constitution expressly permitted:Provided, that offices in the militia to which there is attachedno annual salary, and the office of Deputy Postmaster where thecompensation does not exceed ninety dollars per annum, shall notbe deemed lucrative: And provided, also, that counties containingless than one thousand polls, may confer the office of Clerk,Recorder, and Auditor, or any two of said offices, upon the sameperson.\n\n§ 12. Electors free from arrest. — In all cases, excepttreason, felony, and breach of the peace, electors shall be freefrom arrest, in going to elections, during their attendancethere, and in returning from the same.\n\n§ 13. Method of election. — All elections by the People shallbe by ballot; and all elections by the General Assembly, or byeither branch thereof, shall be viva voce.\n\n§ 14. Time of elections. — All general elections shall be heldon the second Tuesday in October.\n\nArticle 3\n\nDISTRIBUTION OF POWERS.\n\n§ 1. Three departments. — The powers of the Government aredivided into three separate departments; the Legislative, theExecutive including the Administrative, and the Judicial; and noperson, charged with official duties under one of thesedepartments, shall exercise any of the functions of another,except as in this Constitution expressly provided.\n\nArticle 4\n\nLEGISLATIVE.\n\n§ 1. The general assembly. — The Legislative authority of theState shall be vested in the General Assembly, which shallconsist of a Senate and a House of Representatives. The style ofevery law shall be: \"Be it enacted by the General Assembly of theState of Indiana\"; and no law shall be enacted, except by bill.\n\n§ 2. Number of members. — The Senate shall not exceed fifty,nor the House of Representatives one hundred members; and theyshall be chosen by the electors of the respective counties ordistricts, into which the State may, from time to time, bedivided.\n\n§ 3. Term of office. — Senators shall be elected for the termof four years, and Representatives for the term of two years,from the day next after their general election: Provided,however, that the Senators elect, at the second meeting of theGeneral Assembly under this Constitution, shall be divided, bylot, into two equal classes, as nearly as may be; and the seatsof Senators of the first class shall be vacated at the expirationof two years, and those of the second class, at the expiration offour years; so that one-half, as nearly as possible, shall bechosen biennially forever thereafter. And in case of increase inthe number of Senators, they shall be so annexed, by lot, to oneor the other of the two classes, as to keep them as nearly equalas practicable.\n\n§ 4. Periodical enumeration. — The General Assembly shall, atits second session after the adoption of this Constitution, andevery six years thereafter, cause an enumeration to be made ofall the white male inhabitants over the age of twenty-one years.\n\n§ 5. Apportionment of representation. — The number of Senatorsand Representatives shall, at the session nextfollowing each period of making such enumeration, be fixed bylaw, and apportioned among the several counties, according to thenumber of white male inhabitants, above twenty-one years of age,in each: Provided, that the first and second elections of membersof the General Assembly, under this Constitution, shall beaccording to the apportionment last made by the General Assembly,before the adoption of this Constitution.\n\n§ 6. Districts. — Requirements as to divisions. — A Senatorialor Representative District, where more than one county shallconstitute a district, shall be composed of contiguous counties;and no county, for Senatorial apportionment, shall ever bedivided.\n\n§ 7. Qualifications of members of assembly. — No person shallbe a Senator or a Representative who, at the time of hiselection, is not a citizen of the United States; nor any one whohas not been for two years next preceding his election, aninhabitant of this State, and, for one year next preceding hiselection, an inhabitant of the county or district, whence he maybe chosen. Senators shall be at least twenty-five, andRepresentatives at least twenty-one years of age.\n\n§ 8. Privileges of members. — Senators and Representatives, inall cases except treason, felony, and breach of the peace, shallbe privileged from arrest, during the session of the GeneralAssembly, and in going to and returning from the same; and shallnot be subject to any civil process, during the session of theGeneral Assembly, nor during the fifteen days next before thecommencement thereof. For any speech or debate in either House,a member shall not be questioned in any other place.\n\n§ 9. Sessions. — The sessions of the General Assembly shall beheld biennially at the capital of the State, commencing on theThursday next after the first Monday of January, in the year onethousand eight hundred and fifty three, and on the same day ofevery second year thereafter, unless a different day or placeshall have been appointed by law. But if, in the opinion of theGovernor, the public welfare shall require it, he may, at anytime by proclamation, call a special session.\n\n§ 10. Officers — Procedure — Adjournment. — Each House, whenassembled, shall choose its own officers, the President of theSenate excepted; judge the elections, qualifications, and returnsof its own members; determine its rules of proceeding, and situpon its own adjournment. But neither House shall, without theconsent of the other, adjourn for more than three days, nor toany place other than that in which it may be sitting.\n\n§ 11. Quorum. — Two-thirds of each House shall constitute aquorum to do business; but a smaller number may meet, adjournfrom day to day, and compel the attendance of absent members. Aquorum being in attendance, if either House fail to effect anorganization within the first five days thereafter, the membersof the House so failing, shall be entitled to no compensation,from the end of the said five days until an organization shallhave been effected.\n\n§ 12. Journal. — Each House shall keep a journal of itsproceedings, and publish the same. The yeas and nays, on anyquestion, shall, at the request of any two members, be entered,together with the names of the members demanding the same, on thejournal; Provided, that on motion to adjourn, it shall requireone-tenth of the members present to order the yeas and nays.\n\n§ 13. Doors to be open. — The doors of each House, and ofCommittees of the Whole, shall be kept open, except in suchcases, as, in the opinion of either House, may require secrecy.\n\n§ 14. Disorderly behavior punished. — Either House may punishits members for disorderly behavior, and may, with theconcurrence of two-thirds, expel a member; but not a second timefor the same cause.\n\n§ 15. Imprisonment for contempt. — Either House, during itssession, may punish, by imprisonment, any person not a member,who shall have been guilty of disrespect to the House, bydisorderlyor contemptuous behavior, in its presence; but such imprisonmentshall not, at any one time, exceed twenty-four hours.\n\n§ 16. Powers of each house. — Each House shall have all powers,necessary for a branch of the legislative department of a freeand independent State.\n\n§ 17. Bills. — Bills may originate in either House, but may beamended or rejected in the other; except that bills for raisingrevenue shall originate in the House of Representatives.\n\n§ 18. Reading and vote. — Every bill shall be read, bysections, on three several days, in each House; unless, in caseof emergency, two-thirds of the House where such bill may bedepending, shall, by a vote of yeas and nays, deem it expedientto dispense with this rule; but the reading of a bill, bysections, on its final passage, shall, in no case, be dispensedwith; and the vote on the passage of every bill or jointresolution shall be taken by yeas and nays.\n\n§ 20. Plain wording. — Every act and joint resolution shall beplainly worded, avoiding, as far as practicable, the use oftechnical terms.\n\n§ 23. Laws must be general. — In all the cases enumerated inthe preceding Section, and in all other cases where a general lawcan be made applicable, all laws shall be general, and of uniformoperation throughout the State.\n\n§ 25. Passage of bills. — A majority of all the members electedto each House, shall be necessary to pass every bill or jointresolution; and all bills and joint resolutions so passed, shallbe signed by the Presiding Officers of the respective Houses.\n\n§ 26. Protest and entry. — Any member of either House shallhave the right to protest, and to have his protest, with hisreasons for dissent, entered on the journal.\n\n§ 27. Public laws. — Every statute shall be a public law,unless otherwise declared in the statute itself.\n\n§ 28. Effective date of statutes. — No act shall take effect,until the same shall have been published and circulated in theseveral counties of this State, by authority, except in case ofemergency; which emergency shall be declared in the preamble, orin the body, of the law.\n\n§ 29. Pay of members — Duration of sessions. — The members ofthe General Assembly shall receive for their services, acompensation to be fixed by law; but no increase of compensationshall take effect during the session at which such increase maybe made. No session of the General Assembly, except the firstunder this Constitution, shall extend beyond the term ofsixty-one days, nor any special session beyond the term of fortydays.\n\n§ 30. Members ineligible to certain offices. — No Senator orRepresentative shall, during the term for which he may have beenelected, be eligible to any office, the election to which isvested in the General Assembly; nor shall he be appointed to anycivil office of profit, which shall have been created, or theemoluments of which shall have been increased, during such term;but this latter provision shall not be construed to apply to anyoffice elective by the People.\n\nArticle 5\n\nEXECUTIVE\n\n§ 1. Governor. — The executive power of the State shall bevested in a Governor. He shall hold his office during four years,and shall not be eligible more than four years, in any period ofeight years.\n\n§ 3. Election. — The Governor and Lieutenant Governor shall beelected at the times and places of choosing members of theGeneral Assembly.\n\n§ 4. Manner of voting. — In voting for Governor and LieutenantGovernor, the electors shall designate for whom they vote asGovernor, and for whom as Lieutenant Governor. The returns ofevery election for Governor and Lieutenant Governor shall besealed up and transmitted to the seat of government, directed tothe Speaker of the House of Representatives, who shall open andpublish them in the presence of both Houses of the GeneralAssembly.\n\n§ 5. Plurality elects. — The persons, respectively, having thehighest number of votes for Governor and Lieutenant Governor,shall be elected; but in case two or more persons shall have anequal and the highest number of votes for either office, theGeneral Assembly shall, by joint vote, forthwith proceed to electone of the said persons Governor or Lieutenant Governor as thecase may be.\n\n§ 6. Contests. — Contested elections for Governor or LieutenantGovernor, shall be determined by the General Assembly, in suchmanner as may be prescribed by law.\n\n§ 9. Term of office. — The official term of the Governor andLieutenant Governor shall commence on the second Monday ofJanuary, in the year one thousand eight hundred and fifty-three;and on the same day every fourth year thereafter.\n\n§ 10. Vacancies. — In case of the removal of the Governor fromoffice, or of his death, resignation, or inability to dischargethe duties of the office, the same shall devolve on theLieutenant Governor; and the General Assembly shall, by law,provide for the case of removal from office, death, resignation,or inability, both of the Governor and Lieutenant Governor,declaring what officer shall act as Governor; and such officershall act accordingly, until the disability be removed or aGovernor be elected.\n\n§ 12. Governor — Commander-in-chief. — The Governor shall becommander-in-chief of the military and naval forces, and may callout such forces, to execute the laws, or to suppressinsurrection, or to repel invasion.\n\n§ 13. Messages — He shall, from time to time, give to theGeneral Assembly information touching the condition of the State,and recommend such measures as he shall judge to be expedient.\n\n§ 14. Bills signed or vetoed. — Every bill which shall havepassed the General Assembly, shall be presented to the Governor;if he approve, he shall sign it; but if not, he shall return it,with his objections, to the House in which it shall haveoriginated; which House shall enter the objections, at large,upon its journals, and proceed to reconsider the bill. If, aftersuch reconsideration, a majority of all the members elected tothat House shall agree to pass the bill, it shall be sent, withthe Governor's objections, to the other House, by which it shalllikewise be reconsidered; and, if approved by a majority of allthe members elected to that House, it shall be a law. If any billshall not be returned by the Governor within three days, Sundayexcepted, after it shall have been presented to him, it shall bea law, without his signature, unless the general adjournmentshall prevent its return; in which case it shall be a law, unlessthe Governor, within five days next after such adjournment, shallfile such bill, with his objections thereto, in the office ofSecretary of State; who shall lay the same before the GeneralAssembly at its next session, in like manner as if it had beenreturned by the Governor. But no bill shall be presented to theGovernor, within two days next previous to the final adjournmentof the General Assembly.\n\n§ 18. Vacancies filled by governor. — When, during a recess ofthe General Assembly, a vacancy shall happen in any office, theappointment to which is vested in the General Assembly; or when,at any time, a vacancy shall have occurred in any other Stateoffice, or in the office of Judge of any court; the Governorshall fill such vacancy, by appointment, which shall expire, whena successor shall have been elected and qualified.\n\n§ 19. Election to vacancies in assembly. — He shall issue writsof election to fill such vacancies as may have occurred in theGeneral Assembly.\n\n§ 20. Change of meeting-place of assembly. — Should the seat ofgovernment become dangerous from disease or a common enemy, hemay convene the General Assembly at any other place.\n\n§ 21. Duties of lieutenant-governor. — The Lieutenant-Governorshall, by virtue of his office, be President of the Senate;have a right, when in committee of the whole, to join in debate,and to vote on all subjects; and, whenever the Senate shall beequally divided, he shall give the casting vote.\n\nArticle 6\n\nADMINISTRATIVE\n\n§ 7. Impeachment of state officers. — All State officers shall,for crime, incapacity, or negligence, be liable to be removedfrom office, either by impeachment by the House ofRepresentatives, to be tried by the Senate, or by a jointresolution of the General Assembly; two-thirds of the memberselected to each branch voting, in either case, therefor.\n\nArticle 10\n\nFINANCE\n\n§ 1. Assessment and taxation. — The General Assembly shallprovide, by law, for a uniform and equal rate of assessment andtaxation; and shall prescribe such regulations as shall secure ajust valuation for taxation of all property, both real andpersonal, excepting such only for municipal, educational,literary, scientific, religious, or charitable purposes, as maybe specially exempted by law.\n\n§ 2. Payment of public debt. — All the revenues derived fromthe sale of any of the public works belonging to the State, andfrom the net annual income thereof, and any surplus that may, atany time, remain in the Treasury, derived from taxation forgeneral State purposes, after the payment of the ordinaryexpenses of the government, and of the interest on bonds of theState, other than Bank bonds, shall be annually applied, underthe direction of the General Assembly, to the payment of theprincipal of the Public Debt.\n\n§ 3. Appropriations. — No money shall be drawn from theTreasury, but in pursuance of appropriations made by law.\n\n§ 4. Statement of receipts and expenditures. — An accuratestatement of the receipts and expenditures of the public money,shall be published with the laws of each regular session of theGeneral Assembly.\n\n§ 5. State debt prohibited — Exceptions. — No law shallauthorize any debt to be contracted, on behalf of the State,except in the following cases: To meet casual deficits in therevenue; to pay the interest on the State Debt; to repelinvasion, suppress insurrection, or, if hostilities bethreatened, provide for the public defense.\n\nArticle 15\n\nMISCELLANEOUS\n\n§ 3. Holding over. — Whenever it is provided in thisConstitution, or in any law which may be hereafter passed, thatany officer, other than a member of the General Assembly, shallhold his office for any given term, the same shall be construedto mean, that such officer shall hold his office for such term,and until his successor shall have been elected and qualified.\n\n§ 4. Official oath. — Every person elected or appointed to anyoffice under this Constitution, shall, before entering on theduties thereof, take an oath or affirmation, to support theConstitution of this State, and of the United States, and also anoath of office.\n\nArticle 16\n\nAMENDMENTS\n\n§ 1. How made. — Any amendment or amendments to thisConstitution, may be proposed in either branch of the GeneralAssembly; and, if the same shall be agreed to by a majority ofthe members elected to each of the two Houses, such proposedamendment or amendments shall, with the yeas and nays thereon, beentered on their journals, and referred to the General Assemblyto be chosen at the next general election; and if, in the GeneralAssembly so next chosen, such proposed amendment or amendmentsshall be agreed to by a majority of all the members elected toeachHouse, then it shall be the duty of the General Assembly tosubmit such amendment or amendments to the electors of the State;and if a majority of said electors shall ratify the same, suchamendment or amendments shall become a part of this Constitution.\n\n§ 2. Separate vote. — If two or more amendments shall besubmitted at the same time, they shall be submitted in suchmanner, that the electors shall vote for or against each of suchamendments separately; and while an amendment or amendments,which shall have been agreed upon by one General Assembly, shallbe awaiting the action of a succeeding General Assembly, or ofthe electors, no additional amendment or amendments shall beproposed.\n\nSCHEDULE\n\nEffective date of constitution. — This Constitution, ifadopted, shall take effect on the first day of November, in theyear one thousand eight hundred and fifty-one, and shallsupersede the Constitution adopted in the year one thousand eighthundred and sixteen.\n\nGeneral assembly. — Sixth. There shall be a session of theGeneral Assembly, commencing on the first Monday of December, inthe year one thousand eight hundred and fifty-one.\n\nLegislators hold over. — Seventh. Senators now in office andholding over, under the existing Constitution, and such as may beelected at the next general election, and the Representativesthen elected, shall continue in office until the first generalelection under this Constitution.\n\nFirst general election. — Eighth. The first general electionunder this Constitution, shall be held in the year one thousandeight hundred and fifty-two.\n\nDone in Convention, at Indianapolis, the tenth day of February,in the year of our Lord one thousand eight hundred and fifty-one;and of the Independence of the United States, the seventy-fifth.\n\nAPPENDIX B\n\n(To Separate Opinion of Judge Holder)\n\nAMENDMENTS TO THE CONSTITUTION OF STATE OF INDIANA\n\nArticle 2\n\n§ 2. As amended in 1881. — In all elections not otherwiseprovided for by this Constitution, every male citizen of theUnited States, of the age of twenty-one years and upwards, whoshall have resided in the State during the six months, and in thetownship sixty days, and in the ward or precinct thirty days,immediately preceding such election, and every male of foreignbirth, of the age of twenty-one years and upwards, who shall haveresided in the United States one year, and shall have resided inthis State during the six months, and in the township sixty days,and in the ward or precinct thirty days, immediately precedingsuch election, and shall have declared his intention to become acitizen of the United States, conformably to the laws of theUnited States on the subject of naturalization, shall be entitledto vote in the township or precinct where he may reside, if heshall have been duly registered according to law.\n\n§ 2. As amended in 1921. — In all elections not otherwiseprovided for by this Constitution, every citizen of the UnitedStates, of the age of twenty-one years and upwards, who shallhave resided in the State during the six months, and in thetownship sixty days, and in the ward or precinct thirty daysimmediately preceding such election, shall be entitled to vote inthe township or precinct where he or she may reside.\n\nArticle 4\n\n§ 4. As amended in 1881. — The General Assembly shall, at itssecond session after the adoption of this Constitution, and everysixth year thereafter, cause an enumeration to be made of all themale inhabitants over the age of twenty-one years.\n\n§ 5. As amended in 1881. — The number of Senators andRepresentatives shall, at the session next following each periodof making such enumeration, be fixed by law, and apportionedamong the several counties, according to the numbers of maleinhabitants, above twenty-one years of age, in each: Provided,that the first and second elections of members of the GeneralAssembly, under this Constitution, shall be according to theapportionment last made by the General Assembly, before theadoption of this Constitution.\n\nAPPENDIX C\n\n(To Separate Opinion of Judge Holder)\n\nDIFFERENCE BETWEEN MALE \u0026 FEMALE INHABITANTS OVER 21 YEARS OF AGE                         IN EACH COUNTY\n\n(plus means — excess women)                   (minus means — excess men)\n\n1930           1940           1950          1960County          Census         Census          Census        Census---------------------------------------------------------------------Adams          minus 162      minus 242      plus 223       plus 488Allen          plus 694       plus 2927      plus 4515      plus 6333Bartholomew    minus 158         0           plus 175       plus 634Benton         minus 181      minus 205      plus 10        plus 220Blackford      plus 16        plus 71        plus 248       plus 371Boone          minus 231      plus 62        plus 504       plus 828Brown          minus 212      minus 332      minus 106      plus 16Carrol         plus 10        plus 3         plus 204       plus 374Cass           plus 212       plus 299       plus 1134      plus 1537Clark          plus 41        plus 140       plus 343       plus 1137Clay           minus 36       minus 88       plus 327       plus 753Clinton        plus 66        plus 46        plus 539       plus 895Crawford       minus 188      minus 202      minus 74       minus 24Davies         plus 27        minus 104      plus 392       plus 747Dearborn       minus 242      minus 366      plus 146       plus 376Decatur        minus 105      minus 161      plus 124       plus 340DeKalb         minus 99       minus 14       plus 281       plus 662Delaware       minus 896      minus 281      plus 1099      plus 2457Dubois         minus 297      minus 288      minus 144      plus 259Elkhart        plus 142       plus 541       plus 1555      plus 2908Fayette        minus 377      minus 237      minus 3        plus 458Floyd          plus 687       plus 903       plus 1060      plus 1633Fountain       minus 135      minus 219      plus 89        plus 240Franklin       minus 425      minus 393      minus 190      plus 123Fulton         minus 77       minus 200      plus 243       plus 370Gibson         plus 86        minus 42       plus 361       plus 908Grant          minus 931      minus 1337     minus 401      plus 348Greene         minus 332      minus 353      plus 256       plus 675Hamilton       minus 26       plus 24        plus 317       plus 741Hancock        minus 46       plus 77        plus 438       plus 659Harrison       minus 263      minus 422      minus 293      plus 109Hendricks      plus 82        minus 69       plus 128       plus 522Henry          minus 447      minus 203      plus 475       plus 1072Howard         minus 224      plus 81        plus 782       plus 1454Huntington     plus 318       plus 406       plus 841       plus 1371Jackson        plus 40        minus 46       plus 361       plus 565Jasper         minus 347      minus 390      minus 255      plus 42Jay            minus 15       minus 214      plus 264       plus 626Jefferson      plus 28        minus 27       plus 277       plus 580Jennings       minus 529      minus 809      minus 192      plus 64Johnson        plus 22        minus 22       plus 422       plus 821Knox           minus 111      plus 9         plus 938       plus 1701Kosciusko      minus 60       minus 209      plus 339       plus 663LaGrange       minus 122      minus 180      minus 47       plus 309Lake           minus 21150    minus 12490    minus 7675     minus 2070LaPorte        minus 3634     minus 3578     minus 2315     minus 1075Lawrence       minus 253      minus 141      plus 398       plus 954Madison        minus 1978     minus 1101     plus 290       minus 2334Marion         plus 7132      plus 12486     plus 18977     plus 25704Marshall       minus 243      minus 83       plus 201       plus 634Martin         minus 284      minus 325      minus 167      plus 3Miami          minus 453      plus 48        plus 542       minus 242Monroe         minus 342      plus 19        minus 1205     minus 220Montgomery     plus 282       plus 257       plus 436       plus 757Morgan         minus 107      minus 147      plus 42        plus 456Newton         minus 228      minus 322      minus 49       plus 208Noble          plus 20        plus 20        plus 446       plus 658Ohio           minus 27       minus 53       plus 42        plus 78Orange         minus 311      minus 310      minus 183      minus 65Owen           minus 129      minus 173      plus 1         plus 165Parke          minus 255      minus 184      plus 73        plus 136Perry          minus 155      plus 8         plus 25        plus 290Pike           minus 182      minus 198      plus 123       plus 197Porter         minus 480      minus 643      minus 494      plus 152Posey          minus 203      minus 209      plus 144       plus 504Pulaski        minus 236      minus 281      minus 121      plus 94Putnam         minus 1083     minus 1046     minus 1157     minus 425Randolph       plus 24        minus 102      plus 349       plus 756Ripley         minus 365      minus 517      minus 170      plus 247Rush           plus 46        plus 84        plus 211       plus 507St. Joseph     minus 2457     plus 166       minus 186      plus 4597Scott          minus 13       minus 202      plus 97        plus 57Shelby         plus 171       plus 66        plus 545       plus 825Spencer        minus 361      minus 391      minus 472      minus 290Starke         minus 416      minus 337      minus 36       plus 160Steuben        minus 178      minus 210      minus 715      minus 176Sullivan       minus 3        minus 146      plus 350       plus 759Switzerland    minus 139      minus 65       minus 19       plus 95Tippecanoe     plus 775       plus 866       minus 2426     minus 378Tipton         minus 46       minus 66       plus 150       plus 376Union          plus 27        minus 75       plus 18        plus 115Vanderburgh    plus 2344      plus 3222      plus 5471      plus 7657Vermillion     minus 566      minus 381      plus 151       plus 437Vigo           plus 1009      plus 2081      plus 2107      plus 3385Wabash         plus 197       plus 37        plus 554       plus 919Warren         minus 276      minus 227      minus 115      plus 62Warrick        minus 207      minus 219      plus 184       plus 474Washington     minus 170      minus 240      plus 25        plus 248Wayne          plus 436       plus 797       plus 1743      plus 2339Wells          minus 132      minus 44       plus 223       plus 494White          minus 161      minus 291      plus 78        plus 316Whitley        minus 142      minus 201      plus 33        plus 377\n\nAPPENDIX D\n\n(To Separate Opinion of Judge Holder)\n\nDISTRICT \"B\"\n\nCounty                Male             Female             Total----------------------------------------------------------------Noble                 8,024             8,682             16,706Allen                65,317            71,650            136,967DeKalb                8,061             8,723             16,784Whitley               5,989             6,366             12,355Adams                 6,789             7,277             14,066Wells                 6,102             6,596             12,698Huntington            9,622            10,993             20,615Steuben               5,384             5,208             10,592LaGrange              4,563             4,872              9,435Kosciusko            11,766            12,429             24,195Wabash                9,184            10,103             19,287Marshall              9,224             9,858             19,082                     -------------------------------------------     Total          150,025           162,757            312,782\n\nDISTRICT \"A\"\n\nCounty                Male             Female             Total----------------------------------------------------------------Lake                147,693           145,623           293,316\n\nSUMMARY:\n\nDistrict \"B\"     plus 2,332       plus 17,134       plus 19,466\n\nMAJORITY RESPONSE:\n\nThe majority of the Court is opposed to reaching out for anissue upon the constitutionality of Sections 4 and 5 of Article4 of the Indiana Constitution of 1851. The issue was notpresented by the parties. No testimony or arguments were heardupon the issue, and no briefs were filed with respect to it.Judge HOLDER'S separate opinion in our view has not a sufficientbasis in the record before us.\n\nThe declaration of any part of the Indiana Constitutionunconstitutional as violating the United States Constitution isas much a question of \"great gravityand delicacy\" as the late Justice Brandeis said, in Ashwander v.Tennessee Valley Authority, 297 U.S. 288, 56 S.Ct. 466, 80 L.Ed.688, of the question of the constitutionality of an Act ofCongress. In that case Justice Brandeis laid down guidelines fortesting constitutionality of an act. These tests are relevanthere, even if we assume that the question had been raised andargued and briefed. Among the tests laid down were that the courtshould not anticipate the constitutional question in advance ofthe necessity to decide; nor upon complaint of one who fails toshow that he is injured by its operation.\n\nThese tests are missing here. The question is being anticipatedby Judge HOLDER at this point: No female has claimed in theseactions that male enumeration is invidious discrimination. And,of course, Sections 4 and 5 do not interfere with the females'right to vote guaranteed by the nineteenth amendment of theConstitution of the United States. The sections deal only withenumeration as a basis for apportionment.\n\nEven though this court should pass over the objection that thetest is not met on this record, the court should not in any eventgo beyond giving the parties an opportunity, if not to litigatethe issue of unconstitutionality in their own interests, then toenlighten the court in its interests.\n\nThe record before us is insufficient upon which to justifydeciding the question raised by Judge HOLDER. It is aconstitution that he is making a judgment upon. It is unnecessarynow to do so since the invalidity of the 1921 apportionmentstatutes is a sufficient basis for the relief being granted atthis time. The majority will, in due time, when the Courtconsiders what further relief may be granted, order the partiesto a full dress briefing and argument on the constitutionalquestion in order that a decision on the question may be giventhorough consideration by the Court.\n\n\u003cspan class=\"fn\"\u003e1. The theory of the first action is, briefly, that by reason ofshifts in population and passage of time, the presentapportionment of the General Assembly results inunderrepresentation of persons living in certain counties inviolation of the State and Federal Constitutions. The theory ofthe second action is, briefly, that by reason of a state courtjudgment declaring the present apportionment statutesunconstitutional and denying de facto authority of the GeneralAssembly, the conduct of an election from the districts createdby the 1921 apportionment statutes violates the FederalConstitution and certain Acts of Congress and the Articles ofCompact of the Ordinance of 1787. The complaint in the secondaction also certains allegations similar to those in the firstaction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Ind.Ann.Stats. §§ 34-102, 34-104 (1949).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. This we believe embraces the traditional test to be applied indeciding whether the equal protection clause of the FourteenthAmendment has been violated. Baker v. Carr, 206 F. Supp. 341, at345 (M.D.Tenn. 1962).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e[fn1a] Elton L. Marquart, Clerk of the Allen County Circuit Court andmember of the Allen County Election Board; John E. Williams, Sr.,Chairman of the Allen County Election Board; Ramon S. Perry,member of the Allen County Election Board; Francis T. Grandys,Clerk of the Lake County Circuit Court and member of the LakeCounty Election Board; Walter C. Zurbriggen, Chairman of the LakeCounty Election Board; William Messex, member of the Lake CountyElection Board; Edwin McClure, Clerk of the Marion County CircuitCourt and member of the Marion County Election Board; Robert S. Smith,Chairman of the Marion County Election Board; Mark W. Gray,member of the Marion County Election Board; Aloysious J.Kromkowski, Clerk of the St. Joseph County Circuit Court andmember of the St. Joseph County Election Board; John E. Doran,Chairman of the St. Joseph County Election Board; and Victor A.Melchiorre, member of the St. Joseph County Election Board.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e[fn2a] By judicial notice we find that there are presently twovacancies in the Senate and one vacancy in the House ofRepresentatives.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e[fn3a] To reflect the fact that there are 50 senators whereas thereare 100 representatives.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e[fn4a] Again, to reflect the fact that there are only one-half as manysenators as representatives.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e[fn5a] See Appendix to Opinion of Mr. Justice Harlan in Baker v. Carr,369 U.S. 186, 342-344, 82 S.Ct. 691, 777-778, 7 L.Ed.2d 663(1962).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e1. The Three-Judge United States District Court for the NorthernDistrict of Indiana, South Bend Division, dismissed an action ofDavid L. Matthews (one of the plaintiffs herein) seeking torestrain the collection of an Indiana tax based on a law enactedin the 1933 session of the Indiana General Assembly which Mr.Matthews asserted was unconstitutional because of the failure ofthe Indiana General Assembly to have effected an enumeration andapportionment as provided for in Article IV of the IndianaConstitution. Matthews et al. v. Handley, Governor of the Stateof Indiana, et al. (1959), D.C., 179 F. Supp. 470; affirmed by theUnited States Supreme Court on December 7, 1960, 361 U.S. 127, 80S.Ct. 256, 4 L.Ed.2d 180.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eThe plaintiffs, Stout et al., have had the legal support andinfluence of the Indiana Civil Liberties Union since inception oftheir action. (The summons required the defendants to serve uponRobert D. Risch, Jerome M. Strauss, John Preston Ward and JohnWood, plaintiffs' attorneys, whose addresses were listed as c/oIndiana Civil Liberties Union, 704 Fletcher Trust Building,Indianapolis, Indiana.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003eNo intervening citizen or inhabitant of Indiana other than Mr.Grills has participated in the litigation despite widespreadpublicity during the two (2) year pendency of the action whichseeks extraordinary relief. All of the citizens and inhabitantsof Indiana are either in the aggrieved class or the accusedfavored class referred to in plaintiffs' action.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. The Indiana Election Code was enacted in 1945 by the IndianaGeneral Assembly during the period when it had not complied withArticle 4, Sections 4 and 5 of the Indiana Constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. In its regular session, the 93rd Indiana General Assemblypassed a reapportionment bill which was vetoed by the Governor ofIndiana and litigation has been predicted to determine thelegality of the veto and the bill. In its special session, theGeneral Assembly passed a Joint Resolution proposing anapportionment basis of members of the Indiana General Assembly byway of an amendment to the Indiana Constitution which is setforth in full as Appendix E to the Statement of Facts, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. The plaintiff is an Indiana attorney and conducted his ownlitigation.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. The Court on its own motion consolidated the actions in CauseNumber IP 61-C-236 and IP 62-C-326 on November 27, 1962.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. \"AFFIDAVIT ACCOMPANYING PLAINTIFF'S MOTION FOR SUMMARY JUDGMENT\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Nelson G. Grills, being duly sworn, deposes and says:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"1. That I am the Plaintiff in the above entitled cause ofaction. I have personal knowledge of the matter hereinafterreferred to, and make this Affidavit in support of thePlaintiff's motion for a summary judgment.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"2. The Plaintiff is a citizen, elector and taxpayer of theCounty of Marion, in the State of Indiana.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"3. The Defendant, Matthew E. Welsh is the duly electedGovernor of the State of Indiana and as Governor is an exofficiomember of the Indiana State Election Board, and Defendants M.S.Steers and James E. Noland are duly appointed and acting membersof the Indiana State Election Board who are charged by the Actsof the Indiana General Assembly of 1945, Chapter 208, Section 11with the duty of supervising all elections and administering theelection laws of the State in their state-wide application andespecially as they relate to State elective officers possessingthe further duty to formulate, adopt and promulgate rules andregulations governing the conduct of elections and in the eventthe election code omits any provisions for any act necessary, inthe opinion of the State Election Board, for the fair, legal andorderly conduct of any election in the State of Indiana, theBoard has the duty to issue proper rulings to correct suchomission.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"4. Article 4, Section 1 of the Indiana Constitution provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"`The Legislative authority of the State shall be  vested in a General Assembly, which shall consist of  a Senate and a House of Representatives.'\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"5. Article 4, Section 4 of the Indiana Constitution provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"`The General Assembly shall, at its second session  after the adoption of this Constitution, and every  sixth year thereafter, cause an enumeration to be  made of all male inhabitants over the age of  twenty-one years.'\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"6. Article 4, Section 5 of the Indiana Constitution provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"`The number of Senators and Representatives shall,  at the session next following each period of making  such enumeration, be fixed by law, and apportioned  among the several counties, according to the number  of male inhabitants, above twenty-one years of age,  in each * * *.'\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"7. The last enumeration made of male inhabitants over the ageof twenty-one (21) years was made in the year 1919.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"8. The last apportionment of Senators and Representativesrequired under Article 4, Section 5 of the Indiana Constitutionwas made by the General Assembly in the year 1921.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"9. The present apportionment of Senators and Representativesamong the several counties is not in accordance with the numberof male inhabitants, above 21 years of age living in thesecounties.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"10. Plaintiff states that the inequality of representationrenders not only his vote less effective but the vote of everyelector in every county in the State which is provided a lessernumber of Senators and Representatives than the population ofthat county would require is denied an equal voice in thegovernment of the State.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"11. Article 4, Section 9 of the Indiana Constitution provides:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"`The sessions of the General Assembly shall be  held biennially at the capital of the State,  commencing on the Thursday next after the first  Monday of January, in the year one thousand eight  hundred and fifty-three, and on the same day of every  second year thereafter, unless a different day or  place shall have been appointed by law. But if, in  the opinion of the Governor, the public welfare shall  require it, he may, at any time, by proclamation,  call a special session.'\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"12. That on the 29th day of July, 1959, Nelson G. Grills, asState Senator brought an action for a Declaratory Judgmentagainst certain other State Senators in Marion Superior Court,Room No. 5, the cause of action being S59-600. The AttorneyGeneral of the State of Indiana was served as required by law andentered his appearance.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"13. That on the 17th day of March, 1961, the Honorable John F.Linder, Judge of the Marion Superior Court, Room No. 5, rendereda judgment in an action brought by Nelson G. Grills, as Senatorof the State of Indiana, against certain other Senators which asa Declaratory Judgment declared:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"`Wherefore, it is declared that:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"`1. Chapters 78 and 271 of the Acts of 1921 are  unconstitutional by reason of the apportionment under  their terms failing to comply with the requirements  of Article 4, Section 5 of the Indiana Constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"`2. Any General Assembly, after the date of this  Declaratory Judgment apportioned under the terms of  Chapter 78 and Chapter 271 of the Acts of 1921 is  declared to be in violation of the act of Congress  enabling inhabitants of the territory of Indiana to  form a state, approved April 19, 1816, Article 4,  Sections 1 and 4 and Article 6, Sections 1 and 2 of  the United States Constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"`3. Members of a General Assembly attempting to  serve after the date of this judgment, are without de  facto authority to act as members of the General  Assembly, apportioned under the terms of Chapter 78  and Chapter 271 of the Acts of 1921. It therefore  follows, that Plaintiff and Defendants are in the  same category as all the members of the General  Assembly. Costs assessed against the Plaintiff.'\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"14. The Defendants, as Members of the State Election Board,under their duties as prescribed by law, are about to and arepreparing, unless enjoined by this Court, to conduct an electionof members of the General Assembly of the State of Indiana fromdistricts which do not legally exist and which are identical tothe districts provided for in Chapter 78 and Chapter 271 of theActs of 1921 which have been declared unconstitutional.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. \"Whereas at the outset of this suit, the position of theAttorney General of the State of Indiana was that the Legislatureof the State of Indiana should reapportion itself pursuant to itsConstitutional mandate, and further that, if the Legislature didnot reapportion itself, this court had no jurisdiction orConstitutional authority to coerce the Legislature to do so and,\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Whereas since the landmark decision of Baker v. Carr, thedefense of the Attorney General's office has been directed towardallowing the State Legislature to reapportion itself and,\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Whereas no rational explanation of the present apportionmentin Indiana can be given in terms of the equal protection clauseof the 14th amendment to the Constitution of the United Statesand,\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Whereas all facts which the undersigned parties deem pertinentand relevant to these proceedings have been stipulated nowtherefore:\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"Come now the undersigned parties hereto by their attorneys ofrecord and hereby agree and stipulate that the sole issue beforethis Court, insofar as such parties are concerned, is whatremedies are proper to cause the State of Indiana to bereapportioned.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e\"The undersigned parties further agree that this stipulation inno way forecloses the full consideration of any additional issueswhich this Court feels should properly be considered.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. See Appendix A.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See Appendix B for those amendments pertinent to this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. See Article 4, Sections 4 and 5, and Article 2, Section 2,Constitution of Indiana of 1851 in Appendix A.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. See Article 4, Sections 4 and 5, and Article 2, Section 2,Constitution of Indiana as amended in 1881 in Appendix B.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See Article 2, Section 2, Constitution of Indiana as amendedin 1921 in Appendix B.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See Article 16, Section 1, Constitution of Indiana in AppendixA.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. State of Indiana ex rel. Welsh v. Marion Superior Court, Room5, et al., (1962), Ind., 185 N.E.2d 18.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. State of Indiana ex rel. Welsh v. Marion Superior Court, Room5, et al., (1962) Ind., 185 N.E.2d 18.\u003c/span\u003e\n\n",
    "body_length": 162232,
    "citedas": [
      "228 F. Supp. 568"
    ],
    "attorneys": "Robert D. Risch, Jerome M. Strauss, and John Wood,Indianapolis, Ind., for plaintiffs in Stout case. Nelson Grills, Indianapolis, Ind., pro se. Edwin K. Steers, Atty. Gen. of Indiana, Indianapolis, Ind., fordefendants in both cases.",
    "category": [
      "242"
    ],
    "judges": "Before Kiley, Circuit Judge, and Steckler and Holder, DistrictJudges.",
    "citation_count": 0
  }
}
