{
  "id": "L4JTPmYBTlTomsSBN7-h",
  "document": {
    "title": "United States v. Promise",
    "full_title": "UNITED STATES OF AMERICA v. MARION PROMISE, A/K/A MARIO .",
    "jurisdiction": "Fourth Circuit",
    "date": "2001-06-29T00:00:00.000Z",
    "docket": "No. 99-4737",
    "body": "As amended July 17, 2001.\n\nArgued: February 27, 2001.\n\nAFFIRMED.\n\nJudge Wilkins announced the judgment of the court and delivered the opinion of the court with respect to Parts I and II A-C, in which Judges Widener, Williams, Michael, Motz, Traxler, and King joined, and an opinion with respect to Part IID, in which Chief Judge Wilkinson and Judges Williams and Traxler joined. Chief Judge Wilkinson wrote an opinion concurring in part and concurring in the judgment. Judge Niemeyer wrote an opinion concurring in the judgment, in which Judge Gregory joined. Judge Luttig wrote an opinion concurring in the judgment, in which Chief Judge Wilkinson and Judges Niemeyer and Gregory joined as to Parts I, II, and III. Judge Motz wrote an opinion concurring in part, dissenting in part, and dissenting in the judgment, in which Judges Widener joined as to Parts I, II, III, and V and Judge Michael and Judge King joined in its entirety.\n\nOPINION\n\nON REHEARING EN BANC\n\nAppellant Marion Promise was charged in a single-count indictment with conspiring to possess with the intent to distribute \"a quantity of cocaine and cocaine base,\" J.A. 33, and was convicted by a jury. Promise was sentenced to 360 months imprisonment based upon a determination by the district court that he should be held accountable for more than 1.5 kilograms of cocaine base. Promise maintains that in light of Apprendi v. New Jersey, 530 U.S. 466, 147 L. Ed. 2d 435, 120 S. Ct. 2348 (2000), the district court committed plain error in failing to treat the specific amount of cocaine base attributed to him as an element of the offense.\n\nFor the reasons set forth below, we conclude that under Apprendi, in order to authorize the imposition of a sentence exceeding the maximum allowable without a jury finding of a specific threshold drug quantity, such drug quantities must be treated as elements of aggravated drug trafficking offenses under 21 U.S.C.A. § 841 (West 1999 \u0026 Supp. 2001), i.e., charged in the indictment and proved to the jury beyond a reasonable doubt. \u003cspan class=\"fnref\"\u003e1\u003c/span\u003e We further conclude that because the indictment that charged Promise did not allege a specific threshold quantity of cocaine or cocaine base and the jury did not make a finding regarding whether the offense involved such a quantity, Promise's conviction subjected him to a maximum penalty of 20 years imprisonment. His sentence of 30 years was therefore erroneous. Although this error was plain and affected Promise's substantial rights, we decline to exercise our discretion to notice the error. Accordingly, we affirm.\n\nI.\n\nEvidence presented at trial established that Promise supplied cocaine base to a drug distribution ring operated by William Moore, Jr. in Gastonia, North Carolina. Moore testified that Promise supplied him with up to two kilograms of cocaine base every other week during the course of their involvement. Promise also provided substantial quantities of cocaine and cocaine base to several of Moore's cohorts. Based upon this evidence, Promise was convicted of conspiracy to possess with the intent to distribute cocaine and cocaine base, see 21 U.S.C.A. § 846 (West 1999). The indictment did not allege a specific quantity of cocaine base, and the jury was not instructed to make a finding regarding the quantity of cocaine base attributable to Promise. \u003cspan class=\"fnref\"\u003e2\u003c/span\u003e At sentencing, the district court determined by a preponderance of the evidence that Promise should be held accountable for more than 1.5 kilograms of cocaine base and, after further determinations, concluded that Promise's sentencing range under the United States Sentencing Guidelines was 360 months to life imprisonment. The court sentenced Promise to 360 months imprisonment. Promise subsequently appealed, arguing for the first time that the district court had erred in treating the quantity of drugs as a sentencing factor rather than as an element of the offense, thereby violating his right to due process. Promise based his argument on Jones v. United States, 526 U.S. 227, 143 L. Ed. 2d 311, 119 S. Ct. 1215 (1999), in which the Supreme Court had held that serious bodily injury was an element of an aggravated offense under the federal carjacking statute rather than a sentencing factor. See Jones, 526 U.S. at 251-52.\n\nPromise's appeal was consolidated with that of a co-defendant, William Patrick Miller. In June 2000, a panel of this court affirmed as to both Promise and Miller. See United States v. Miller, 217 F.3d 842, 2000 WL 774804 (4th Cir.) (per curiam) (unpublished table decision), cert. denied, 148 L. Ed. 2d 317, 121 S. Ct. 410 (2000) (denying Miller's petition for writ of certiorari). With respect to Promise's due process challenge, the panel concluded that Promise could not demonstrate plain error because \"no circuit to address this question has extended Jones to\" 21 U.S.C.A. § 841. \u003cspan class=\"fnref\"\u003e3\u003c/span\u003e Id., 2000 WL 774804, at **1 (citing cases). Promise petitioned for panel and en banc rehearing, arguing that the recent decision of the Supreme Court in Apprendi required this court to reconsider its refusal to extend Jones to § 841. The panel granted panel rehearing and directed the parties to file supplemental briefs. Before the panel issued a decision, we voted to rehear Promise's appeal en banc along with the appeals in United States v. Angle, No. 96-4662, also decided today.\n\nII.\n\nPromise argues that his conviction, or at least his sentence, is invalid because a specific threshold drug quantity was not alleged in the indictment and the jury was not required to make a finding regarding specific threshold drug quantity beyond a reasonable doubt. Promise failed to make this argument before the district court and thus forfeited the asserted error. See Yakus v. United States, 321 U.S. 414, 444, 88 L. Ed. 834, 64 S. Ct. 660 (1944) (\"No procedural principle is more familiar to this Court than that a constitutional right may be forfeited in criminal as well as civil cases by the failure to make timely assertion of the right before a tribunal having jurisdiction to determine it.\"). Our authority to correct forfeited errors is granted by Federal Rule of Criminal Procedure 52(b), which provides that \"plain errors or defects affecting substantial rights may be noticed although they were not brought to the attention of the court.\" See United States v. Olano, 507 U.S. 725, 731-32, 123 L. Ed. 2d 508, 113 S. Ct. 1770 (1993) (interpreting Rule 52(b)); see also United States v. Young, 470 U.S. 1, 15, 84 L. Ed. 2d 1, 105 S. Ct. 1038 (1985) (explaining that \"the plain-error doctrine of Federal Rule of Criminal Procedure 52(b) tempers the blow of a rigid application of the contemporaneous-objection requirement\" by authorizing correction of \"particularly egregious\" forfeited errors (internal quotation marks omitted) (footnote omitted)). As the Court explained in Olano, in order to establish our authority to notice an error not preserved by timely objection, Promise must demonstrate that an error occurred, that the error was plain, and that the error affected his substantial rights. See Olano, 507 U.S. at 732. Even if Promise can satisfy these requirements, correction of the error remains within our discretion, which we \"should not exercise . . . unless the error 'seriously affects the fairness, integrity or public reputation of judicial proceedings.'\" Id. (second alteration in original) (quoting Young, 470 U.S. at 15).\n\nA.\n\nOur first inquiry, of course, is whether an error occurred. Before turning to the substance of Promise's argument, we examine the cases on which he relies, Jones and Apprendi.\n\n1.\n\nJones concerned the federal carjacking statute, 18 U.S.C. § 2119, which at the time provided as follows:\n\n\"Whoever, possessing a firearm as defined in section 921 of this title, takes a motor vehicle that has been transported, shipped, or received in interstate or foreign commerce from the person or presence of another by force and violence or by intimidation, or attempts to do so, shall--\n\n\"(1) be fined under this title or imprisoned not more than 15 years, or both,\n\n\"(2) if serious bodily injury (as defined in section 1365 of this title) results, be fined under this title or imprisoned not more than 25 years, or both, and\n\n\"(3) if death results, be fined under this title or imprisoned for any number of years up to life, or both.\" Jones, 526 U.S. at 230 (quoting 18 U.S.C. § 2119 (Supp. V 1994)).\n\nNathaniel Jones was charged with violating § 2119 in an indictment that did not mention serious bodily injury or death, and the jury that convicted Jones was not instructed to make findings regarding whether serious bodily injury or death resulted from his actions. See id. at 230-31. At sentencing, however, the district court determined by a preponderance of the evidence that one of the victims had suffered serious bodily injury; accordingly, the court sentenced Jones to 25 years imprisonment. See id. at 231.\n\nThe Supreme Court reversed, determining that subsections (2) and (3) of § 2119 set forth elements of aggravated offenses, not sentencing factors relevant to punishment for a single offense defined in the principal paragraph of the statute. Although the Court concluded as a matter of statutory construction that \"the fairest reading of § 2119 treats the fact of serious bodily harm as an element,\" it acknowledged \"the possibility of the other view.\" Id. at 239. The Court determined that the constitutional doubt rule would preclude a reading of the statute that would make bodily injury a sentencing factor rather than an element. See id.; see also id. (\"Where a statute is susceptible of two constructions, by one of which grave and doubtful constitutional questions arise and by the other of which such questions are avoided, our duty is to adopt the latter.\" (internal quotation marks omitted)). Based upon a survey of \"a series of cases over the past quarter century, dealing with due process and the guarantee of trial by jury,\" id. at 240, the Court identified a principle of constitutional law suggested, but never actually adopted, by those cases:\"Any fact (other than prior conviction) that increases the maximum penalty for a crime must be charged in an indictment, submitted to a jury, and proven beyond a reasonable doubt,\" id. at 243 n.6. The Court concluded that if serious bodily injury and death were intended by Congress to be mere sentencing factors, a judicial finding of either of those facts would increase the penalty to which the defendant was exposed from 15 years to 25 years or life imprisonment. See id. at 243-44. The Court believed that such a scheme would be unconstitutional in light of the articulated principle. See id.\n\nA little over a year later, the Court decided Apprendi. Charles Apprendi pleaded guilty, under New Jersey law, to two counts of second degree possession of a firearm for an unlawful purpose and one count of third degree possession of an antipersonnel bomb. See Apprendi, 530 U.S. at 469-70. New Jersey law specifies a maximum term of imprisonment of 10 years for second degree offenses. See id. at 470. However, based on its determination by a preponderance of the evidence that Apprendi had acted with a racially biased purpose, the sentencing court imposed an extended term of imprisonment of 12 years on one of the firearms counts. See id. Apprendi argued to the Supreme Court that the imposition of a penalty greater than the statutory maximum based upon a finding by the court by a preponderance of the evidence, rather than by a jury beyond a reasonable doubt, violated his due process rights.\n\nIn considering this claim, the Court began by noting that \"any possible distinction between an 'element' of a felony offense and a 'sentencing factor' was unknown to the practice of criminal indictment, trial by jury, and judgment by court as it existed during the years surrounding our Nation's founding.\" Id. at 478 (footnote omitted). In the view of the Court, this \"historic link between verdict and judgment,\" id. at 482, and the concomitant proscription of judicial authority to impose a sentence outside of \"the range of sentencing options prescribed by the legislature,\" id. at 481, pointed to the conclusion that \"the judge's role in sentencing is constrained at its outer limits by the facts alleged in the indictment and found by the jury. Put simply, facts that expose a defendant to a punishment greater than that otherwise legally prescribed were by definition 'elements' of a separate legal offense,\" id. at 483 n.10. \u003cspan class=\"fnref\"\u003e4\u003c/span\u003e On this basis, the Court decried \"the novelty of a legislative scheme that removes the jury from the determination of a fact that, if found, exposes the criminal defendant to a penalty exceeding the maximum he would receive if punished according to the facts reflected in the jury verdict alone.\" Id. at 482-83. In light of these principles, the Court adopted the constitutional rule previously suggested in Jones: \"Other than the fact of a prior conviction, any fact that increases the penalty for a crime beyond the prescribed statutory maximum must be submitted to a jury, and proved beyond a reasonable doubt.\" Id. at 490.\n\nApplying this rule to the New Jersey statutory scheme, the Court first observed that it was immaterial that racial bias was formally labeled a \"sentencing factor\" by the New Jersey Legislature: \"The relevant inquiry is one not of form, but of effect--does the required finding expose the defendant to a greater punishment than that authorized by the jury's guilty verdict?\" Id. at 494. The Court determined that there indeed was a difference \"between what Apprendi would have received without the finding of biased purpose and what he could receive with it.\" Id. Therefore, because race bias was not found by a jury beyond a reasonable doubt, the Court concluded that Apprendi's due process rights had been violated. See id. at 497.\n\n2.\n\nHaving examined the decisions most relevant to Promise's argument, we now turn to a consideration of his claim. Promise argues that under Apprendi, specific threshold drug quantities must be treated as elements of aggravated drug trafficking offenses, rather than as mere sentencing factors. We agree.\n\nThe first portion of 21 U.S.C.A. § 841, subsection (a), prohibits, inter alia, possession of controlled substances with the intent to distribute them. See 21 U.S.C.A. § 841(a)(1). Subsection (b)(1) sets forth various penalties that vary according to, inter alia, the quantity of the particular controlled substance at issue. See id. § 841(b)(1). Although no legislative history speaks to the question, we have previously held, as three of my colleagues reiterate now, that Congress intended these specific threshold quantities to be sentencing factors rather than elements of aggravated drug trafficking offenses. See, e.g., United States v. Dorlouis, 107 F.3d 248, 252 (4th Cir. 1997). These factors determine the maximum penalty that may be imposed on a particular defendant; for example, an individual who possesses with the intent to distribute an identifiable but unspecified quantity of a schedule I or II drug is subject to a term of imprisonment of no more than 20 years. See 21 U.S.C.A. § 841(b)(1)(C). A sentence exceeding 20 years may be imposed only upon an additional finding that the offense involved a specific threshold quantity of a schedule I or II controlled substance--for example, 1 kilogram or more of heroin. See 21 U.S.C.A. § 841(b)(1)(A)(i). Thus, if a specific threshold quantity of drugs is not found by the jury beyond a reasonable doubt, a judicial finding of that fact increases the allowable penalty beyond that authorized by the facts found by the jury alone. Accordingly, Apprendi dictates that in order to authorize the imposition of a sentence exceeding the maximum allowable without a jury finding of a specific threshold drug quantity, the specific threshold quantity must be treated as an element of an aggravated drug trafficking offense, \u003cspan class=\"fnref\"\u003e5\u003c/span\u003e i.e., charged in the indictment and proved to the jury beyond a reasonable doubt. \u003cspan class=\"fnref\"\u003e6\u003c/span\u003e In reaching this conclusion, we join every circuit that has applied Apprendi to § 841 in this context. See United States v. Fields, 242 F.3d 393, 395 (D.C. Cir. 2001); United States v. Nance, 236 F.3d 820, 824-25 (7th Cir. 2000); United States v. Hishaw, 235 F.3d 565, 574-75 (10th Cir. 2000); United States v. Doggett, 230 F.3d 160, 164-65 (5th Cir. 2000), cert. denied, 148 L. Ed. 2d 1014, 121 S. Ct. 1152 (2001); United States v. Rogers, 228 F.3d 1318, 1327 (11th Cir. 2000); United States v. Nordby, 225 F.3d 1053, 1058-59 (9th Cir. 2000); United States v. Aguayo-Delgado, 220 F.3d 926, 933 (8th Cir.), cert. denied, 121 S. Ct. 600 (2000); see also United States v. Rebmann, 226 F.3d 521, 524-25 (6th Cir. 2000) (holding that, under Apprendi, death resulting from the use of controlled substances distributed by the defendant is an element of an aggravated offense). We therefore conclude that there was error. \u003cspan class=\"fnref\"\u003e7\u003c/span\u003e\n\nBefore turning to the remaining prongs of the plain error analysis, we pause to consider the treatment of Walton v. Arizona, 497 U.S. 639, 111 L. Ed. 2d 511, 110 S. Ct. 3047 (1990), by the Apprendi Court. In Walton, the Supreme Court upheld a provision of Arizona's capital sentencing statute under which a judge, rather than a jury, determined whether the prosecution had established an aggravating factor necessary to subject the defendant to the death penalty. See Walton, 497 U.S. at 647-49. The Apprendi Court distinguished Walton on the basis that the defendant there was convicted of a capital crime even before the judge found aggravating factors to be present; the judge's findings merely aided in the selection of an appropriate sentence within a range of penalties that already included capital punishment. See Apprendi, 530 U.S. at 496-97 (citing Almendarez-Torres v. United States, 523 U.S. 224, 257 n.2, 140 L. Ed. 2d 350, 118 S. Ct. 1219 (1998) ( Scalia, J., dissenting)); cf. Walton, 497 U.S. at 648 (\"'Aggravating circumstances are not separate penalties or offenses, but are standards to guide the making of [the] choice between the alternative verdicts of death and life imprisonment.'\" (quoting Poland v. Arizona, 476 U.S. 147, 156, 90 L. Ed. 2d 123, 106 S. Ct. 1749 (1986)) (second alteration in original)). The dissent dismissed this proffered distinction as \"baffling\" in light of the fact that \"[a] defendant convicted of first-degree murder in Arizona cannot receive a death sentence unless a judge makes the factual determination that a statutory aggravating factor exists.\" Apprendi, 530 U.S. at 538 (O' Connor, J., dissenting).\n\nIn his concurrence, Justice Thomas wrote that aggravating circumstances in capital cases are different from other facts that can lead to One of my colleagues posits that the rule proposed in Jones is not the rule that the Court adopted in Apprendi. See post at *47. In concluding that the rules are different, my colleague places great significance on a slight modification: Whereas Jones used the phrase \"maximum penalty for a crime,\" Jones, 526 U.S. at 243 n.6, the Apprendi Court employed the term \"statutory maximum,\" Apprendi, 530 U.S. at 490. But these phrases are synonymous; there is no \"maximum penalty for a crime\" other than the maximum prescribed by statute for the facts charged and proven. Moreover, to the extent that this minor semantic difference suggests the possibility of a distinction between the Jones rule and the Apprendi rule, that suggestion is quashed by the Apprendi opinion, which explicitly \"confirmed the opinion . . . expressed in Jones.\" Id. increased punishment because they arise in the \"unique context\" of capital sentencing and are the product of \"special constraints on a legislature's ability to determine what facts shall lead to what punishment.\" Id. at 522-23 ( Thomas, J., concurring). The dissent dismissed this reasoning as well, noting that \"Justice THOMAS gives no specific reason for excepting capital defendants from the constitutional protections he would extend to defendants generally, and none is readily apparent.\" Id. at 539 (O' Connor, J., dissenting).\n\nWe perceive merit both in the manner in which the majority and Justice Thomas distinguished Walton and in the dissent's criticism of those proffered distinctions. As noted by the Apprendi majority, the maximum penalty for first degree murder under Arizona law is death, but Arizona law interposes procedural safeguards, including additional factual determinations, between a finding of guilt and the imposition of a death sentence. Cf. People v. Lee, 318 Ill. App. 3d 417, 743 N.E.2d 1019, 1023, 252 Ill. Dec. 863 (Ill. App. Ct. 2000) (stating that Apprendi procedures apply to Illinois' capital scheme because Illinois, unlike Arizona, sets a maximum penalty of 60 years for first degree murder and then allows a greater sentence upon proof of additional facts). And, as Justice Thomas explained in his concurrence, the additional safeguards provided by Arizona do not necessarily reflect a legislative determination that the elements of first degree murder are, by themselves, insufficient to justify capital punishment; rather, those safeguards were enacted to comply with the strict Eighth Amendment requirements that govern capital cases, which do not include proof beyond a reasonable doubt or fact-finding by a jury. See Clemons v. Mississippi, 494 U.S. 738, 745-46, 108 L. Ed. 2d 725, 110 S. Ct. 1441 (1990) (stating that the Sixth Amendment right to trial by jury does not apply to capital sentencing proceedings and that the Eighth Amendment does not create an independent right to sentencing by jury); Spaziano v. Florida, 468 U.S. 447, 458-59, 82 L. Ed. 2d 340, 104 S. Ct. 3154 (1984) (same).\n\nIn contrast, the penalty gradations in § 841(b)(1) are not the product of constitutionally mandated procedures as a condition precedent to the imposition of the maximum penalty, but rather are the result of congressional prerogative to apply graduated penalties to acts of increasing severity. Thus, for example, Congress authorized a sentence of no more than 20 years imprisonment for a first offender who possesses with the intent to distribute three grams of cocaine base, see 21 U.S.C.A. § 841(b)(1)(C), and it is plain that any sentence greater than 20 years would not be authorized; it is likewise plain that the same offender would face a greater penalty (no less than 5 years and no more than 40 years) if the sale involved six grams of cocaine base rather than three, see id. § 841(b)(1)(B)(iii). No constitutional constraints compelled Congress to classify drug-trafficking offenses in this manner; on the contrary, Congress was free to establish a uniform maximum penalty that did not depend on proof of quantity or other additional facts. But Congress did make the available penalty depend on additional facts, and the Constitution governs the process for determining those facts. Under Apprendi, that process must include charge by indictment and proof to a jury beyond a reasonable doubt.\n\nWe acknowledge Justice O'Connor's sentiment regarding the interplay between Walton and Apprendi: It is at least perplexing, if not \"baffling,\" that due process protections apply to a finding of specific threshold drug quantities under § 841(b)(1) when such protections do not apply to factual findings of aggravating circumstances subjecting a defendant to the death penalty. Apprendi, 530 U.S. at 538 (O' Connor, J., dissenting). It is for the Supreme Court, however, to resolve this conundrum. Until that happens, we must adhere to both Walton and Apprendi.\n\nB.\n\nHaving determined that the district court erred, we must next decide whether the error was plain. To be plain, an error must be \"clear\" or \"obvious,\" Olano, 507 U.S. at 734 (internal quotation marks omitted), at least by the time of appeal, see Johnson v. United States, 520 U.S. 461, 468, 137 L. Ed. 2d 718, 117 S. Ct. 1544 (1997). An error is clear or obvious \"when the settled law of the Supreme Court or this circuit establishes that an error has occurred. In the absence of such authority, decisions by other circuit courts of appeals are pertinent to the question of whether an error is plain.\" United States v. Neal, 101 F.3d 993, 998 (4th Cir. 1996) (internal quotation marks omitted) (citation omitted). In light of Apprendi and the unanimous conclusion of our sister circuits that specific threshold drug quantities must be treated as elements of aggravated drug trafficking offenses, we conclude that the error was plain.\n\nC.\n\nPromise must next demonstrate that the error affected his substantial rights, i.e., that it was prejudicial. See Olano, 507 U.S. at 734; United States v. Hastings, 134 F.3d 235, 240 (4th Cir. 1998) (explaining that an error is prejudicial when it \"actually affected the outcome of the proceedings\"). In order to determine whether Promise can make such a showing, we must first understand the nature of the error, i.e., whether the flaw is in Promise's conviction or in his sentence. Perhaps not surprisingly, Promise asserts that the error is in his conviction: He claims that the indictment failed to allege, and the jury failed to find, an essential element of the offense. The Government, in contrast, asserts that the error affects only Promise's sentence.\n\nWe conclude that the error was not in Promise's conviction. The indictment charged Promise with conspiring to possess with the intent to distribute \"a quantity of cocaine and cocaine base.\" J.A. 33. Thus, Promise was properly charged with conspiring to violate 21 U.S.C.A. § 841. And, there can be no dispute that the jury was properly instructed regarding the elements of the charged offense. Accordingly, we conclude that Promise was properly charged with, and convicted of, conspiring to possess with the intent to distribute cocaine and cocaine base.\n\nThe problem, therefore, lies with Promise's sentence. The facts alleged in the indictment and found by the jury supported a maximum penalty of 20 years imprisonment. Based on a determination of drug quantity by the district court, however, Promise was sentenced to 360 months imprisonment--ten years more than the applicable maximum. We therefore conclude that Promise has demonstrated that this error affected his substantial rights. \u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nWe reject the Government's assertion that the error in Promise's sentence did not affect his substantial rights because prior to trial the Government filed an information alleging that the conspiracy involved \"in excess of 50 kilograms of cocaine;[and] in excess of 50 kilograms of cocaine base.\" J.A. 39. \"An indictment may not be amended except by resubmission to the grand jury, unless the change is merely a matter of form.\" Russell v. United States, 369 U.S. 749, 770, 8 L. Ed. 2d 240, 82 S. Ct. 1038 (1962). The Government did not seek to include a specific threshold drug quantity in the indictment, and Russell teaches us that we cannot assume that the grand jury would have returned an indictment charging specific threshold drug quantity had the Government done so. See id. (\"To allow . . . the court[ ] to make a subsequent guess as to what was in the minds of the grand jury at the time they returned the indictment would deprive the defendant of a basic protection which the guaranty of the intervention of a grand jury was designed to secure.\").\n\nD.\n\nHaving demonstrated that there was error, that the error was plain, and that the error affected his substantial rights, Promise has satisfied the threshold requirements of the plain error test. However, as the Court explained in Olano, \"Rule 52(b) is permissive, not mandatory.\" Olano, 507 U.S. at 735. Thus, it remains within our discretion to notice a plain error. See id. at 735-36. Our discretion is appropriately exercised only when failure to do so would result in a miscarriage of justice, such as when the defendant is actually innocent or the error \"'seriously affects the fairness, integrity or public reputation of judicial proceedings.'\" Id. at 736 (quoting United States v. Atkinson, 297 U.S. 157, 160, 80 L. Ed. 555, 56 S. Ct. 391 (1936) (alteration in original)).\n\nThe mere fact that a forfeited error affects substantial rights does not alone warrant the exercise of our discretion,\"for otherwise the discretion afforded by Rule 52(b) would be illusory.\" 507 U.S. at 737. Indeed, this court is not obligated to notice even structural errors on plain error review, notwithstanding that structural errors are per se reversible when reviewed under a harmless error standard. See Johnson, 520 U.S. at 468-70; see also United States v. Wilkinson, 137 F.3d 214, 224, 227 (4th Cir. 1998) (citing Johnson for the proposition that a reviewing court possesses discretion to refuse to notice structural errors). Rather, we must consider the error in the context of the record as a whole, bearing in mind that \"Rule 52(b) carefully balances the goal of encouraging defendants to seek an accurate and fair trial in the first instance . . . against a recognition that a true miscarriage of justice or a defect calling into question the fairness, integrity, or public reputation of the judiciary must not be allowed.\" United States v. Cedelle, 89 F.3d 181, 185 (4th Cir. 1996); see also Young, 470 U.S. at 16 (observing that \"especially when addressing plain error, a reviewing court cannot properly evaluate a case except by viewing such a claim against the entire record\"); Cedelle, 89 F.3d at 186 (stating that \"central\" to the question of whether to notice a plain error affecting substantial rights \"is a determination of whether, based on the record in its entirety, the proceedings against the accused resulted in a fair and reliable determination of guilt\"). It is appropriate to refuse to notice a plain error when evidence of guilt is overwhelming. See Johnson, 520 U.S. at 470 (refusing to notice plain error in failure to instruct jury on element of offense when evidence was overwhelming and essentially uncontested); United States v. Johnson, 219 F.3d 349, 354 (4th Cir.) (same), cert. denied, 148 L. Ed. 2d 507, 121 S. Ct. 593 (2000); Hastings, 134 F.3d at 244 (same); United States v. Jackson, 124 F.3d 607, 615 (4th Cir. 1997) (same); see also United States v. Mietus, 237 F.3d 866, 875 (7th Cir. 2001) (holding that, even assuming that first three prongs of plain error analysis were satisfied, court would refuse to notice Apprendi error when guilty verdict necessarily established that defendant was responsible for more than threshold quantity of drugs); United States v. Swatzie, 228 F.3d 1278, 1284 (11th Cir. 2000) (same), petition for cert. filed, No. 00-9051 (U.S. Mar. 20, 2001).\n\nIn Johnson, the Supreme Court considered on plain error review a perjury conviction in which an element of the offense, materiality of the false statement, was found by a judge rather than by a jury. See 17 Johnson, 520 U.S. at 464. Finding that the error was plain, the Court assumed that the error was structural and that the error therefore affected substantial rights. See id. at 468-69. Nevertheless, the Court declined to notice the error because the evidence concerning the omitted element was \"overwhelming\" and \"essentially uncontroverted.\" Id. at 470 (internal quotation marks omitted). The Court noted that \"it would be the reversal of a conviction such as this\" that would \"seriously affect[ ] the fairness, integrity or public reputation of judicial proceedings.\" Id. (emphasis added) (internal quotation marks omitted). Accordingly, without even discussing the seriousness of the error, the Supreme Court unanimously declined to notice it. See id.\n\nThis court relied on similar principles in United States v. Bowens, 224 F.3d 302 (4th Cir. 2000), cert. denied, 149 L. Ed. 2d 349, 121 S. Ct. 1408 (2001). Bowens was charged with conspiring to distribute cocaine, cocaine base, and heroin. See Bowens, 224 F.3d at 314. The district court instructed the jury that it could convict upon finding that Bowens had conspired to distribute any one of the three substances. See id. The jury returned a general verdict of guilt that did not specify which drug or drugs the jury believed Bowens had conspired to distribute. See id. The district court imposed a life sentence based upon its assumption that Bowens had conspired to distribute cocaine base, the most heavily punishable object of the conspiracy. See id. We agreed with Bowens' argument--raised for the first time on appeal--that the general verdict returned by the jury authorized a sentence\"only up to the maximum for the least-punished drug offense,\" conspiracy to distribute heroin. Id. (internal quotation marks omitted). We accordingly concluded that the district court had committed plain error in sentencing Bowens for conspiracy to distribute cocaine base instead of for conspiracy to distribute heroin; we further held that the error affected Bowens' substantial rights because he received a life sentence when his sentence for a heroin-based conspiracy could not have been greater than 20 years. See id. at 314-15. However, we declined to notice the error because \"the overwhelming and essentially uncontroverted evidence\" established that Bowens \"was a major participant\" in a conspiracy to distribute cocaine base. Id. at 315.\n\nFor reasons similar to those that guided the Supreme Court in Johnson and this court in Bowens, we decline to notice the error before us. As in Johnson and Bowens, the evidence regarding the element subjected to erroneous treatment was both overwhelming and essentially uncontroverted. Here, witness after witness testified that Promise supplied substantial quantities of cocaine base to Moore's organization:\n\n- Moore testified that during the course of the conspiracy, Promise supplied him with quantities of cocaine base ranging from six ounces (168 grams) to two kilograms every other week. Moore estimated that, altogether, Promise supplied him with more than 20 kilograms of cocaine base.\n\n- Timothy Wallace testified that Promise supplied him with three ounces (84 grams) of cocaine base.\n\n- Aaron Gettys testified that he witnessed a transaction in which Promise supplied Moore with at least 1.5 kilo grams of cocaine base. Gettys also corroborated Moore's testimony that Promise supplied Moore with as much as two kilograms of cocaine base at a time.\n\n- Torianno Hall testified that he witnessed a transaction in which Promise supplied Moore with two kilograms of cocaine base.\n\n- John Gwinn testified that he assisted Moore with a trans action in which Moore obtained over a kilogram of cocaine base from Promise.\n\n- Donald Thompson testified that Promise offered, through Moore, to supply Thompson with nine ounces (252 grams) of cocaine base; Thompson refused the offer because he was not familiar with Promise.\n\nMost importantly, at sentencing Promise did not contest the quantity of drugs the presentence report recommended be attributed to him, nor did he dispute the finding by the district court that he should be held accountable for more than 1.5 kilograms of cocaine base--thirty times more than the threshold quantity of 50 grams necessary to subject him to a statutory sentence of not less than 10 years or more than life imprisonment.\n\nFinally, and critically, the record clearly demonstrates that Promise's decision not to dispute the finding of the specific threshold drug quantity by the district court was not the result of lack of notice that the existence of the specific threshold drug quantity was an important issue in his case. Prior to trial, the Government filed an information contending that Promise was accountable for \"in excess of 50 kilograms of cocaine[ and] in excess of 50 kilograms of cocaine base.\" J.A. 39. Under § 841(b)(1)(A) and the law prevailing in this circuit at the time of Promise's trial, it was clear that a finding of either of these amounts could result in the imposition of a life sentence, if proven by the Government at sentencing. Yet, even armed with this knowledge in advance of trial and his subsequent sentencing, Promise elected not to dispute the critical fact that he was to be held accountable for a large quantity of narcotics that would justify a life sentence.\n\nThere simply can be no doubt that had the indictment included the specific threshold quantity of 50 grams of cocaine base, the jury would have found Promise guilty beyond a reasonable doubt. See Swatzie, 228 F.3d at 1284 (declining to notice plain Apprendi error even though specific threshold drug quantity was not alleged in indictment because defendant did not assert that lack of notice precluded him from disputing drug quantity). It would be a miscarriage of justice to allow him to avoid a sentence for the aggravated drug trafficking crime that the evidence overwhelmingly demonstrates he committed. We therefore declined to notice the error. \u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIII.\n\nThe judgment of conviction and sentence are affirmed.\n\nAFFIRMED\n\nCONCUR BY: WILKINSON; NIEMEYER; LUTTIG; DIANA GRIBBON MOTZ (In Part)\n\nCONCUR: WILKINSON, Chief Judge, concurring in part, and concurring in the judgment:\n\nI vote to affirm the judgment of conviction and sentence.\n\nI.\n\nI share Judge Luttig's view that 21 U.S.C. § 841(b) is a graduated sentencing scheme in which life imprisonment constitutes the maximum penalty. I see no reason to parse that scheme into finer parts for Apprendi purposes. The sentences set forth in Section 841(b) form an integrated sanction for a single Section 841(a) offense. As the drug quantity rises, so too does the sanction until it reaches the maximum penalty of life imprisonment. I would not pull out one strand in the middle of this carefully sequenced scheme and designate it as a maximum sentence under the theory that it is somehow a \"catch-all.\" See, e.g., United States v. Rogers, 228 F.3d 1318, 1327-28 (11th Cir. 2000) (holding that 21 U.S.C. § 841(b)(1)(C) is a catch-all provision under which defendants may be sentenced if drug quantity is not determined by a jury beyond a reasonable doubt). To do so seems to me to intrude the courts and the Constitution into a domain that has long been preeminently legislative. The creation of new offense elements out of the statute's traditional sentencing factors works a serious infringement on the powers of a coequal branch of government. In transmuting a single crime with multiple sentencing factors into a series of separate offenses, my colleagues have replaced the legislature's structure of crime and punishment with their own to the general detriment of popular governance.\n\nII.\n\nI do not believe there was an error in the proceedings below. Assuming, arguendo, that some plain error has indeed occurred, I do not believe that it merits reversal under United States v. Olano, 507 U.S. 725, 123 L. Ed. 2d 508, 113 S. Ct. 1770 (1993), and United States v. Young, 470 U.S. 1, 84 L. Ed. 2d 1, 105 S. Ct. 1038 (1985). Under Olano, before an appellate court can correct an error not raised at trial, there must be (1) error, (2) that is plain, and (3) that affects substantial rights. See Johnson v. United States, 520 U.S. 461, 466-67, 137 L. Ed. 2d 718, 117 S. Ct. 1544 (1997). If all three conditions are met, an appellate court may then exercise its discretion to notice a forfeited error, but only if (4) the error seriously affects the fairness, integrity, or public reputation of judicial proceedings. Id.\n\nI join Section II.D of Judge Wilkins' opinion, which persuasively illustrates that defendant suffered no prejudice whatsoever. I cannot concur in Section II.C of my good colleague's analysis, however, because I do not believe that substantial rights are affected when no prejudice of any kind exists.\n\nIn Olano, the Supreme Court held that, except in rare circumstances, in order to affect substantial rights \"the error must have been prejudicial: It must have affected the outcome of the district court proceedings.\" 507 U.S. at 734. The Court stated that generally \"the defendant must make a specific showing of prejudice to satisfy the 'affecting substantial rights' prong of Rule 52(b).\" Id. at 735. Defendant suffered no prejudice here. Neither the inclusion of the drug weight in the indictment nor an instruction to the jury that it must find beyond a reasonable doubt the amount of drugs in question would have affected the outcome of the district court proceedings. Because Promise has not met his burden of showing prejudice under Rule 52(b), the error in this case did not affect his substantial rights. See, e.g., United States v. Terry, 240 F.3d 65, 74 (1st Cir. 2001) (finding that defendant failed to satisfy the \"affecting substantial rights\" prong of the plain error test where, given the trial evidence about the quantity of drugs, there was no prejudice to defendant); United States v. Candelario, 240 F.3d 1300, 1311-12 (11th Cir. 2001) (same).\n\nOlano demonstrates that substantial rights are not affected when a picture-perfect proceeding would yield exactly the same result as that which actually transpired. That is the case here. The statute permits the thirty year sentence that was imposed. See 21 U.S.C. § 841(b)(1)(B). The evidence as to the requisite drug quantity is so overwhelming that it cannot be contended that Promise did not deserve the sentence he received.\n\nNIEMEYER, Circuit Judge, concurring in the judgment:\n\nA grand jury indicted Marion Promise in one count for conspiring to possess with intent to distribute \"a quantity of cocaine and cocaine base\" in violation of 21 U.S.C. §§ 841(a)(1) and 846. Following the jury's conviction on this count, the district court sentenced Promise to 360 months imprisonment, based on its finding that Promise was accountable for more than 1.5 kilograms of cocaine base. Promise challenges this sentence, relying on the Supreme Court's decision in Apprendi v. New Jersey, 530 U.S. 466, 120 S. Ct. 2348, 147 L. Ed. 2d 435 (2000). He contends that drug quantities are elements of the offense and that his sentence must be vacated because the grand jury did not charge him with aggravating quantities of cocaine and cocaine base and the jury consequently did not find those quantities. Accordingly, he maintains that his sentence must be vacated to allow resentencing at the level appropriate when no jury finding is made as to the amount of cocaine and cocaine base, which under § 841(b) would be a maximum sentence of 240 months.\n\nThe constitutional proposition that Promise advances to vacate his sentence was first identified by a majority of the Supreme Court in Jones v. United States, 526 U.S. 227, 143 L. Ed. 2d 311, 119 S. Ct. 1215 (1999). Drawing on the guarantees contained in the Fifth and Sixth Amendments of the Constitution, the Jones Court expressed serious doubt concerning the constitutionality of allowing the trial judge to make penalty-enhancing findings under the federal carjacking statute, 18 U.S.C. § 2119, by a preponderance of the evidence. See id. at 240-52. The Court raised the possibility that \"any fact (other than prior conviction) that increases the maximum penalty for a crime must be charged in an indictment, submitted to a jury, and proven beyond a reasonable doubt.\" Id. at 243 n.6. But going no further than identifying the potential existence of such a constitutional principle and expressing doubt about the statute before it, the Court concluded it could avoid the constitutional issue by construing the ambiguous statute as providing three separate offenses with distinct elements rather than one offense with sentence enhancing factors. See id. at 251-52.\n\nA year later, however, in Apprendi, the Court, in confirming the Jones constitutional \"proposition\" for the first time as a constitutional principle, articulated its contours more narrowly. It limited application of the principle to circumstances in which the facts increase the penalty only \"beyond the prescribed statutory maximum.\" 120 S. Ct. at 2362-63 (emphasis added). Thus, the principle considered in Jones was limited in application in Apprendi to sentences that exceed the scope of Congress' enactment -- i.e., to circumstances in which the facts increase a penalty beyond the statutory maximum. It would appear, therefore, that the constitutional principle proposed in Jones and defined in Apprendi, rather than limiting Congress' ability to distinguish elements of an offense from sentencing factors, actually preserves Congress' right to define the statutory maximum, at least in the absence of legislative manipulation -- i.e., where it could be found that Congress defined elements of an offense as sentencing factors to avoid the constitutional protections afforded by the Fifth and Sixth Amendments. See id. at 2363 n.16; cf. Cooper Indus., Inc. v. Leatherman Tool Group, Inc., 149 L. Ed. 2d 674, 121 S. Ct. 1678, 1683, 2001 WL 501732, at (2001) (\"Legislatures have extremely broad discretion in defining criminal offenses and in setting the range of permissible punishments for each offense\" (internal citations omitted)). Since Apprendi, however, no court has applied its rationale to hold a statute unconstitutional because it manipulated the elements of an offense by defining them improperly as sentencing factors.\n\nThus, absent evidence of improper congressional manipulation, if a statute clearly distinguishes between an element of the offense and a sentencing factor, these Supreme Court precedents recognize Congress' right to do so. And based on the rationale thoroughly developed by Judge Luttig in Parts I and II of his concurring opinion, I would conclude that the only rational reading of 21 U.S.C. § 841 is that elements of the offense are stated in § 841(a) and the sentencing factors are provided in § 841(b). Before Apprendi, no court reached a different conclusion in interpreting this statute, and in the absence of clear evidence that the elements of the offense have been manipulated, there is no reason to conclude otherwise now. Until that case is credibly made, the constitutional issue does not arise, and we are left with the statutory interpretation made by Judge Luttig in his concurring opinion.\n\nIn his opinion, Judge Wilkins concludes that drug quantity \"must be treated as an element of an aggravated drug trafficking offense, i.e., charged in the indictment and proved to the jury beyond a reasonable doubt.\" Supra at 9 (footnote omitted). With this conclusion, it would necessarily follow that Promise was not charged with an aggravated drug trafficking offense because no more than a detectable amount of drugs was imputed to him in the indictment. Moreover, because Promise was properly charged with a non-aggravated drug trafficking offense, the \"outer limits\" of any sentence are defined by that charge as no more than 20 years. Apprendi, 120 S. Ct. at 2359 n.10. Yet, the district court in this case sentenced Promise to 30 years, believing that it had sentencing authority to do so under 21 U.S.C. § 841(b). If Judge Wilkins' premise that drug quantities are elements of the offense were accepted, then Judge Wilkins could appropriately conclude that the district court erred because the jury, not the judge, would have been required to find drug quantity. But rather than follow the necessary consequence of this premise, Judge Wilkins somehow holds that the district court's sentence was not reversible error under the plain-error doctrine, even though a 30-year sentence would not have been authorized by the indictment returned by the grand jury. Of necessity, therefore, this plain-error analysis requires a constructive amendment of the indictment, a fact Judge Wilkins acknowledges: \"There simply can be no doubt that had the indictment included the specific threshold quantity of 50 grams of cocaine base, the jury would have found Promise guilty beyond a reasonable doubt.\" Supra at 20 (emphasis added). The first error therefore was in the government's failure to obtain an indictment for 50 grams or more. But we do not have the authority to change the offenses that a grand jury charges in an indictment. As we held in United States v. Floresca, \"it is 'utterly meaningless' to posit that any rational grand jury could or would have indicted[the defendant] . . . because it is plain that this grand jury did not, and, absent waiver, a constitutional verdict cannot be had on an unindicted offense.\" 38 F.3d 706, 712 (4th Cir. 1994) (en banc); see also Stirone v. United States, 361 U.S. 212, 215-16, 4 L. Ed. 2d 252, 80 S. Ct. 270 (1960) (\"After an indictment has been returned its charges may not be broadened through amendment except by the grand jury itself\"); id. at 217 (\"[A] court cannot permit a defendant to be tried on charges that are not made in the indictment against him\"); Ex Parte Bain, 121 U.S. 1, 30 L. Ed. 849, 7 S. Ct. 781 (1887) (noting that the scope of an indictment is jurisdictional).\n\nThe indictment in this case properly charged an offense, the jury properly convicted Promise of that offense, and now the sentence is limited by the indictment and the jury's finding. See Apprendi, 120 S. Ct. at 2359 n.10. If quantity were an element of an aggravated offense, such an offense was not charged, and any sentence could not have been based on that offense.\n\nBut because I disagree with Judge Wilkins' conclusion that drug quantity under 21 U.S.C. § 841 is an element of the offense, the difficulties his conclusion raises are not presented. Accordingly, I concur in the judgment of the court, and I join in Parts I, II, and III of Judge Luttig' s concurring opinion.\n\nJudge Gregory has authorized me to indicate that he joins this opinion.\n\nLUTTIG, Circuit Judge, concurring in the judgment:\n\nI believe that, in interpreting 21 U.S.C. § 841, this court, and every other Court of Appeals, has, however understandably, fundamentally misunderstood the Supreme Court's decisions in Almendarez-Torres v. United States, 523 U.S. 224, 140 L. Ed. 2d 350, 118 S. Ct. 1219 (1998), Jones v. United States, 526 U.S. 227, 143 L. Ed. 2d 311, 119 S. Ct. 1215 (1999), and Castillo v. United States, 530 U.S. 120, 147 L. Ed. 2d 94, 120 S. Ct. 2090 (2000), on the one hand, and Apprendi v. New Jersey, 530 U.S. 466, 147 L. Ed. 2d 435, 120 S. Ct. 2348 (2000), on the other, outright substituting Apprendi's constitutional analysis (and a mistaken understanding of that analysis, at that) for the statutory analysis prescribed in Almendarez-Torres, Jones, and Castillo. In misreading these cases in the way that they have -- due largely to the Supreme Court's own failure to distinguish clearly its statutory from its constitutional analyses -- our court and our sister circuits have unwittingly and unnecessarily reached and decided the very question that the Supreme Court has as yet declined to answer, and indeed expressly reserved in Apprendi, namely, whether all facts that could serve to increase a defendant's sentence must be found by the jury beyond a reasonable doubt. And not only have the courts unknowingly decided this issue of inestimable importance to the criminal law, they have decided the question contrary to the way in which I believe the majority of the Supreme Court will, if only by a bare majority and upon a principle of stare decisis, ultimately decide the question, compare McMillan v. Pennsylvania, 477 U.S. 79, 91 L. Ed. 2d 67, 106 S. Ct. 2411 (1986), with Apprendi, 530 U.S. at 487 n.13, holding, in error on the authority of Apprendi, that any fact that increases a sentence, whether or not the increase will result in a sentence that exceeds the maximum penalty prescribed by statute, must be submitted to the jury and proven beyond a reasonable doubt.\n\nThe as-yet quite narrow constitutional principle of Apprendi is that the jury must find beyond a reasonable doubt only any fact that increases the maximum sentence authorized for the statutory offense. And the holdings of Almendarez-Torres, Jones, and Castillo -- that whether any given fact is an element of the offense (requiring proof beyond a reasonable doubt) or a sentencing factor (requiring only proof by a preponderance) is a question of legislative intent, and therefore statutory interpretation -- remain unaffected by Apprendi, except to the extent that the finding of a legislatively-defined sentencing factor results in a sentence in excess of the statutory maximum. Faithful to the limited constitutional principle of Apprendi, but equally faithful to the bedrock principle of Almendarez-Torres, Jones, and Castillo that the power to define criminal offenses rests in the legislature, subject only to constitutional limitations, see, e.g., Staples v. United States, 511 U.S. 600, 604, 128 L. Ed. 2d 608, 114 S. Ct. 1793 (1994) (\"The definition of the elements of a criminal offense is entrusted to the legislature, particularly in the case of federal crimes, which are solely creatures of statute.\" (quoting Liparota v. United States, 471 U.S. 419, 424, 85 L. Ed. 2d 434, 105 S. Ct. 2084 (1985))), I would hold without any hesitation whatsoever that Congress' manifest intent is that the sole offenses established in section 841 are those set forth in sections 841(a)(1) and (a)(2) -- the knowing or intentional manufacture, distribution, or dispensation of a controlled or counterfeit substance, or the possession of such substance with the intent to manufacture, distribute or dispense -- and that those offenses are set forth in their entirety in sections 841(a)(1) and (2).\n\nAs a consequence of this indisputable congressional definition of the section 841 offenses, I would hold that the statutory maximum sentence for commission of these offenses, and therefore the punishment authorized by the jury's verdict of guilt of a section 841 offense, is life imprisonment, plus fine, with the actual sentence imposed dependent upon judicial findings of the presence or absence of the various sentencing factors, including drug amount and type, identified in section 841(b). Because the statutory maximum sentence for commission of the offenses defined by Congress in section 841 is life plus fine, I would hold that the principle of Apprendi that a judiciallyfound fact may not increase a sentence beyond the prescribed statutory maximum is not offended by any of the sentences imposed in the cases before us because none of the sentences at issue exceeds life imprisonment.\n\nI.\n\nAs a matter of statutory interpretation, I believe that Congress intended \"serious bodily injury\" in 18 U.S.C. § 2119 and use or carry of a \"machinegun\" in 18 U.S.C. § 924(c), not as elements of the offenses defined in those statutes, but, rather, as so-called sentencing factors to be determined by the judiciary, as many courts had held prior to Jones and Castillo. I think that this conclusion is relatively clear by application of the conventional tools of statutory interpretation such as text, structure, context, historical usage, and legislative history. And I believe that the majority in Jones (explicitly) and the unanimous court in Castillo (implicitly) came to the opposite conclusions, respectively, only because of the individual Justices' different views over the considerably larger issue of the constitutional limits imposed on the power of the federal and state legislatures to define criminal offenses. That is, unconstrained by their individual views as to the constitutional limitations on the legislatures' power to define offenses, and their natural concern that the opposite constitutional conclusion might ultimately be reached by a majority of their colleagues were the issue addressed, I believe that, based upon conventional statutory analysis, the Court would have reached precisely the opposite conclusions from those that it reached in Jones and Castillo.\n\nAlthough I disagree with the Court's statutory conclusions in both Jones and Castillo, there was arguably at least some basis for concluding that the facts at issue in those cases were intended by the legislature to be elements rather than sentencing factors, or at least for concluding, as in Jones, that there was sufficient question as to congressional intent as to warrant invocation of the rule of constitutional doubt. Unlike the fact of either \"serious bodily injury\" in Jones or use or carry of a \"machinegun\" in Castillo, however, there is no basis whatever for concluding that Congress intended drug quantity (and likely even type) in 21 U.S.C. § 841 to be elements of the statutory offense. Indeed, in my view, as my colleagues today and the United States must ultimately and uncomfortably concede, it is incontestable as a matter of statutory construction that Congress intended these facts not as elements, but as sentencing factors.\n\nA.\n\nThe statutory analysis prescribed by the Court in Almendarez-Torres, Jones, and Castillo that leads to this conclusion is compelling.\n\nFirst, Congress explicitly denominated the specific activities set forth in section 841(a) as the \"unlawful acts\" that it criminalized. That is, in terms whose clarity cannot be disputed, Congress stated that the unlawful conduct prohibited in section 841 is that set forth in section 841(a). See Almendarez-Torres, 523 U.S. at 234 (\"We also note that 'the title of a statute and the heading of a section' are 'tools available for the resolution of a doubt' about the meaning of a statute.\" (quoting Brotherhood of Railroad Trainmen v. Baltimore \u0026 Ohio R. Co., 331 U.S. 519, 528-29, 67 S. Ct. 1387, 91 L. Ed. 1646 (1947))). That conduct is, and is only, the knowing or intentional manufacture, distribution, or dispensation, of a controlled or counterfeit substance, or the possession with intent to manufacture, create, distribute, or dispense, such substance.\n\nSecond, Congress expressly distinguished the conduct that it criminalized in section 841(a) from the punishments that it prescribed for commission of the unlawful acts in section 841(b) by explicitly denominating as \"penalties\" the punishments prescribed in section 841(b).\n\nThird, as if to remove any doubt that it intended the activities described in section 841(a) to constitute the section 841 offenses, Congress expressly stated within the substantive text of section 841(a) itself that \"it shall be unlawful\" for any person to engage in the conduct specified in subsection (a).\n\nFourth, Congress established the section 841 offenses in section 841(a) in a single, complete, self-contained sentence. No reference is necessary to other subparts of the statute in order to complete either the sentence or the obvious thought. To use the Supreme Court's phrase, the offense-defining provision \"stands on its own grammatical feet.\" Jones, 526 U.S. at 233-34.\n\nFifth, further confirming its intent that the lone section 841 offenses are those described, and wholly described, in section 841(a), Congress provided in section 841(b) for the particular \"penalties\" that will obtain for \"any person who violates subsection (a).\" In other words, within the actual text of section 841(b), Congress unambiguously states again its understanding that the violation of section 841 occurs when one completes the conduct recited in section 841(a), predicating its specified punishments upon violation of section 841(a). Indeed, Congress carries forward this same formulation, or its equivalent, throughout the numerous individual subparts of section 841(b). See, e.g., 21 U.S.C. § 841(b)(1)(A) (\"In the case of a violation of subsection (a) of this section involving . . . such person shall be sentenced . . . .\") (emphasis added); § 841(b)(1)(B) (same); § 841(b)(1)(D)(4) (\"Any person who violates subsection (a) of this section by distributing . . . shall be treated as provided in . . . .\") (emphasis added); § 841(b)(1)(D)(5) (\"Any person who violates subsection (a) of this section by cultivating a controlled substance on Federal property shall be imprisoned as provided . .. .\") (emphasis added); § 841(b)(1)(D)(6) (\"Any person who violates subsection (a), or attempts to do so, and knowingly uses a poison, chemical, or other hazardous substance on Federal property . . . .\") (emphasis added).\n\nAnd finally, Congress reinforced that the substantive inter-relationship between the conduct in section 841(a) and the facts in section 841(b) is that between criminal offense and sentence when it introduced section 841(b) with the command that \"any person who violates subsection (a) of this section shall be sentenced as follows[.]\" (emphasis added). It is plain from this language, if from nothing else, that Congress understood section 841(b) to prescribe not additional elements of the offenses established in section 841(a), but, rather, the sentencing factors to be considered when imposing the sentence for commission of the offenses defined in section 841(a).\n\nThus, both the text and structure of section 841 unequivocally confirm a congressional intent that the conduct recited in section 841(a) constitutes the section 841 offenses, and that the facts that appear in section 841(b) are sentencing factors only, not elements of the statutory offenses. \u003cspan class=\"fnref\"\u003e10\u003c/span\u003e In this respect, section 841 is as close as possible to a \"statute[ ] [that] comes with the benefit of provisions straightforwardly addressing the distinction between elements and sentencing factors.\" Jones, 526 U.S. at 232 (citation omitted).\n\nAlthough it is necessary to resort to other statutes only \"if a given statute is unclear about treating such aparticular fact as element or penalty aggravator,\" 526 U.S. at 234 (emphasis added), which section 841 is not, were there any ambiguity in the text and structure of the section as to this congressional intent, the ambiguity would have to be resolved in favor of the very same conclusion by virtue of the practice, or the tradition, of treating drug quantity (and arguably even type) as a sentencing factor, not an element of the crime. See, e.g., id. at 234-35 (noting importance of traditional treatment of fact to whether fact is an element of offense or a mere sentencing factor); Almendarez-Torres, 523 U.S. at 230 (same). The Court seemingly may have defined traditional sentencing factors in such a way as to exclude drug quantity. See, e.g., Castillo, 530 U.S. at 126 (observing that traditional sentencing factors \"often involve either characteristics of the offender, such as recidivism, or special features of the manner in which a basic crime was carried out (e.g., that the defendant abused a position of trust or brandished a gun)\"). But, as even the defendants in the cases before us acknowledge, at least over the past quarter century, drug quantity, if not drug type also, has uniformly been considered by the courts to be a sentencing factor, not an offense element. Whether or not this tradition reaches back to the common law, it is more than sufficient to buttress the conclusion, which is plain from the statutory text and structure, that Congress intended drug quantity as a factor relevant to sentencing only.\n\nB.\n\nThe marked differences between the language and structure of section 841, on one hand, and, on the other, sections 2119 and 924(c) of Title 18, which were addressed by the Court in Jones and Castillo, respectively, only further reinforce the conclusion that Congress intended drug quantity and type as sentencing factors, not elements of the offense.\n\n1.\n\nTurning first to 18 U.S.C. § 2119, the carjacking statute analyzed by the Court in Jones, admittedly \"the 'look' of [a] statute . . . is not a reliable guide to congressional intentions.\" Jones, 526 U.S. at 233. For the reasons identified above, however, section 841 not only has far more of the \"look\" of a statute that defines its offenses in subsection (a) and then provides only penalties in subsection (b) than did section 2119, cf. id., section 841 by all appearances is such a statute.\n\nMore importantly, though, section 841(a), which, like section 2119, \"begins with a principal paragraph listing a series of obvious elements,\" does not merely \"come[ ] close to standing on its own,\" as did section 2119, id. at 232; it does stand on its own. Not only does section 841(a), unlike section 2119, stand alone as a grammatically complete sentence, but, unlike section 2119, it also stands alone as a substantive sentence. It does not \"merely describe some very obnoxious behavior, leaving any reader assuming that it must be a crime, but never being actually told that it is,\" id. at 233 (describing opening paragraph of section 2119); it describes the \"obnoxious\" conduct and \"completes the thought,\" id., providing explicitly that that conduct \"shall be unlawful.\" It is, thus, paradigmatic of the classic \"offensedefining provisions in the federal criminal code, which genuinely stand on their own grammatical feet thanks to phrases such as 'shall be unlawful' . . . which draw a provision to its close.\" Id. at 233-34 (citations omitted).\n\nIn short, whereas text and structure \"[did] not justify any confident inference,\" id. at 234, about Congress' intent whether \"serious bodily injury\" was an element of the section 2119 offense or merely a sentencing factor, just the opposite is the case with section 841. Congress' intent could not be any clearer.\n\nAnd what is clear from the statutory text and structure of section 841 as to Congress' intent with respect to the treatment of drug quantity (and perhaps type also) is, as noted, fully consistent with the \"traditional treatment,\" id., of these facts. Unlike the section 2119 fact of \"serious bodily injury\" at issue in Jones, which Congress had \"unmistakably identified [ ] as an offense element in any number of statutes,\" id. at 235, the fact of drug quantity, like the fact of recidivism in Almendarez-Torres, has seldom (if ever) in recent history explicitly been identified by Congress as an offense element.\n\n2.\n\nThe contrasts between section 841, and section 924(c), which was before the Court in Castillo, are no less instructive. First, while the \"literal language [of section 924(c)], taken alone, appeared neutral\" as to whether firearm type was an element or sentencing factor, Castillo, 530 U.S. at 124, the literal language of section 841 is not, for the reasons discussed above, at all neutral as to the intended treatment of drug quantity and type. One simply cannot reason \"with equal ease,\" id., from the statute's language that Congress intended drug quantity and type to be elements of the section 841 offense, as one could (or at least as the Court said one could) reason that firearm type could be either an element or a sentencing factor.\n\nAnd second, unlike in section 924(c), not only is there nothing in the structure of section 841 to suggest that drug quantity and type are elements of the offense; there is affirmative proof in the structure that they were instead intended as sentencing factors. Whereas Congress \"placed the element 'uses or carries a firearm' and the word 'machinegun' in a single sentence, not broken up with dashes or separated into subsections,\" id. at 125, Congress in section 841 not only did not include the undisputed elements of the knowing or intentional distribution of a controlled substance and the factors of drug quantity and type in a single sentence, it set them forth in entirely separate statutory provisions, and the former in a self-contained, offense-defining sentence. Moreover, unlike section 924(c)(1), in which the first sentence, which included the undisputed elements of the offense, was followed by three successive sentences that indisputably specified sentencing factors only (recidivism, concurrent sentences, parole), giving rise to an inference that the fact of use of a \"machinegun\" referenced in the first sentence was an element also, section 841's inviolate structural separation of offense elements from sentencing factors belies any such inference.\n\nThus, not only does section 841 have a \"look\" that suggests that drug quantity and type are sentencing factors; its structure confirms as much. It has the structure which the Court left little doubt would prove such intent -- the definition of the offense and the provision for penalties in separate, complete sentences. Cf. id. (contrasting the single sentence in 18 U.S.C. § 924(c) with the separately numbered subsection of 18 U.S.C. § 2119).\n\nIndeed, the structure of section 841 is more clearly confirmatory of an intention to treat drug quantity and type as sentencing factors even with respect to the less important \"structural circumstances\" that the Court conceded \"suggested a contrary interpretation\" of section 924(c) from the one ultimately adopted by the Court. Id. Unlike with section 924(c), portions of which Congress itself had subsequently determined \"created not penalty enhancements, but entirely new crimes,\" id., Congress most certainly has made no such determination with respect to section 841. Thus, the titles \"unlawful acts\" and \"penalties\" in subsection 841(a) and (b), respectively, unquestionably retain their interpretive significance. Cf. id. (explaining that, because of Congress' determination that portions of section 924(c) create new crimes, \"the section's title cannot help\" in determining which facts are elements and which are sentencing factors). Nor, unlike section 924(c), has section 841 been amended in such a way that might give rise to uncertainty as to congressional intent. Cf. id. (noting that section 924(c) had been amended to \"separate different parts of the first sentence (and others) into different subsections,\" but observing that \"a new post-enactment statutory restructuring cannot help . . . to determine what Congress intended at the time it enacted the earlier statutory provision that governs the case\").\n\nApart from the text and structure, while it could not be said in Castillo with respect to section 924(c) that \"courts have typically or traditionally used firearm types (such as 'shotgun' or'machinegun') as sentencing factors,\" id. at 126, again it most certainly can, and must, be said with respect to section 841 that courts have uniformly treated drug quantity (if not drug type as well) as a sentencing factor, not as an element of the crime.\n\nAnd finally, although I would suggest that its relevance to congressional intent is at best dubious, I assume that no one would dispute that asking the jury, rather than the judge, to decide drug quantity beyond a reasonable doubt (even if the same cannot be said of drug type) would seriously complicate the criminal trial, unlike requiring of the jury a finding as to firearm type. Cf. id. at 127 (noting that a requirement that the jury decide whether the firearm was a machinegun would \"rarely complicate a trial\").\n\nC.\n\nIn light of the foregoing, so absolutely certain is it that Congress intended the section 841 criminal offenses to be defined exclusively and entirely in section 841(a), and the facts in section 841(b) to be only factors that inform sentencing, that I cannot conceive of a single Justice of the Supreme Court of the United States holding otherwise as a matter of statutory construction. See, e.g., Supplemental Brief of Appellant at 5, Promise (No. 99-4737) (\"To the extent the Court is considering reinterpreting the statute under Jones, the first requirement -- that the statute be susceptible of two interpretations --is not present.\"). Whatever one believes about the constitutional limitations on the legislature to define offenses and their elements, a different conclusion as to Congress' intent in section 841 is implausible, as I think every one of my colleagues today appreciates. It is simply not credible to hold that Congress knowingly and intentionally fashioned some 350 separate offenses in section 841, the number of offenses which, by my rough estimation, would exist under an interpretation of that provision that deems the facts in subsection (b) to be elements of the section 841(a) offenses.\n\nD.\n\nThat the only possible conclusion as to Congress' intent, and the only plausible interpretation of section 841, is that Congress in fact created as offenses only those identified in section 841(a), is attested to by the fact that, prior to the Supreme Court's decision in Jones, it had not occurred to any court in the country to hold that the facts in subsection (b) were offense elements. As the panel opinion in Angle acknowledged, \"historically, this court and all of her sister circuits have held that drug quantity is a sentencing factor, not an element of the crime.\" United States v. Angle, 230 F.3d 113, 122 (4th Cir. 2000), reh'g en banc granted, Jan. 17, 2001; see also Supplemental Brief of Appellant at 4, Promise (No. 99-4737) (\"Every Court of Appeals to consider the meaning of the statute over the last ten years, including this Court, has already held that Congress did not intend for drug quantity to be an element of the offense.\"). In fact, before Jones was decided, every single court to address the issue of Congress' intent in enacting section 841 concluded, as I have, that the elements of the section 841 offense are set forth in their entirety in subsection (a) and that the facts arrayed in subsection (b) are mere sentencing factors, which need not be charged in the indictment or proved to the jury beyond a reasonable doubt. See, e.g., United States v. Caldwell, 176 F.3d 898, 900 (6th Cir. 1999) (drug quantity); United States v. Hare, 150 F.3d 419, 428 n.2 (5th Cir. 1998) (drug quantity); United States v. Stone, 139 F.3d 822, 826 (11th Cir. 1998) (drug type); United States v. Lewis, 113 F.3d 487, 490 (3d Cir. 1997) (drug type); United 38 States v. Dorlouis, 107 F.3d 248, 252 (4th Cir. 1997) (drug quantity); United States v. Fletcher, 74 F.3d 49, 53 (4th Cir. 1996) (drug quantity); United States v. Ruiz, 43 F.3d 985, 989 (5th Cir. 1995) (drug quantity); United States v. Coy, 19 F.3d 629, 636 (11th Cir. 1994) (drug quantity); United States v. Perez, 960 F.2d 1569, 1574-76 (11th Cir. 1992) (drug quantity); United States v. Patrick, 294 U.S. App. D.C. 393, 959 F.2d 991, 995 n.5 (D.C. Cir. 1992) (drug quantity); United States v. Valencia, 957 F.2d 1189, 1197 (5th Cir. 1992) (drug quantity); United States v. Sotelo-Rivera, 931 F.2d 1317, 1319 (9th Cir. 1991) (drug quantity); United States v. Cross, 916 F.2d 622, 623 (11th Cir. 1990) (drug quantity); United States v. Delario, 912 F.2d 766, 769 (5th Cir. 1990) (drug quantity); United States v. Campuzano, 905 F.2d 677, 679 (2d Cir. 1990) (drug quantity); United States v. Moreno, 899 F.2d 465, 473 (6th Cir. 1990) (drug quantity); United States v. Ocampo, 890 F.2d 1363, 1372 (7th Cir. 1989) (drug quantity); United States v. Barnes, 890 F.2d 545, 551 n.6 (1st Cir. 1989) (drug quantity); United States v. Powell, 886 F.2d 81, 85 (4th Cir. 1989) (drug quantity); United States v. Williams, 876 F.2d 1521, 1525 (11th Cir. 1989) (drug type); United States v. Jenkins, 866 F.2d 331, 334 (10th Cir. 1989) (drug quantity); United States v. Wood, 834 F.2d 1382, 1388-90 (8th Cir. 1987) (drug quantity); United States v. Gibbs, 813 F.2d 596, 600 (3d Cir. 1987) (drug quantity); United States v. Normandeau, 800 F.2d 953, 956 (9th Cir. 1986) (drug quantity); United States v. McHugh, 769 F.2d 860, 868 (1st Cir. 1985) (drug quantity). \u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nSignificantly, even in the wake of Jones, which raised the spectre of a constitutional limitation on the legislative power to define offenses, and thus would have prompted a more searching, cautious statutory interpretation, every single court still held that Congress intended the facts in section 841(b) to be sentencing factors. See, e.g., United States v. Grimaldo, 214 F.3d 967, 972 (8th Cir. 2000); United States v. Jackson, 207 F.3d 910, 920 (7th Cir.), vacated and remanded for further consideration in light of Apprendi, 121 S. Ct. 376 (2000), judgment reinstated on other grounds, 236 F.3d 886, 888 (7th Cir. 2001); United States v. Thomas, 204 F.3d 381, 384 (2d Cir.), vacated and remanded for further consideration in light of Apprendi, 121 S. Ct. 749 (2000), reh'g en banc granted, 2000 WL 33281680 (Apr. 20, 2001); United States v. Rios-Quintero, 204 F.3d 214 (5th Cir.), cert. denied, 121 S. Ct. 301 (2000); United States v. Swiney, 203 F.3d 397, 404 n.5 (6th Cir.), cert. denied, 530 U.S. 1238, 147 L. Ed. 2d 288, 120 S. Ct. 2678 (2000); United States v. Hester, 199 F.3d 1287, 1292 (11th Cir.), vacated and remanded for further consideration in light of Apprendi, 121 S. Ct. 336 (2000); United States v. Jones, 194 F.3d 1178, 1185-86 (10th Cir. 1999), vacated and remanded for further consideration in light of Apprendi, 530 U.S. 1271 (2000); United States v. Williams, 338 U.S. App. D.C. 310, 194 F.3d 100, 106-07 (D.C. Cir. 1999), cert. denied 148 L. Ed. 2d 1017, 121 S. Ct. 1156 (2001). \u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nAnd, what is more, no court has ever believed there to be any ambiguity as to congressional intent in this regard. See, e.g., United States v. Doggett, 230 F.3d 160, 163 (5th Cir. 2000) (\"Given the clear congressional intent in § 841 and the uncertain mandate of Jones, we would have been hesitant to overturn our well-established precedent that the quantity of drugs is a sentencing factor and not an element of the offense.\") (citations omitted); id. at 164 (\"Notwithstanding prior precedent of this circuit and the Supreme Court that Congress did not intend drug quantity to be an element of the crime under 21 U.S.C. § 841 and 846, we are constrained by Apprendi to find in the opposite.\"); United States v. Rogers, 228 F.3d 1318, 1327 (11th Cir. 2000) (\"Because [United States v.] Hester[, 199 F.3d 1287 (11th Cir. 2000)] did not find section 841 and its legislative history unclear, Hester retained the rule in this circuit that drug quantity was not an element of the offense.\"); id. (\"In light of Hester's determination that section 841 is not ambiguous and given to alternate interpretation . . . .\"); United States v. Nordby, 225 F.3d 1053, 1058 (9th Cir. 2000) (\"Existing precedent in this circuit states plainly that Congress did not intend drug quantity to be an element of the crime under 21 U.S.C. §§ 841 and 846, and that a defendant may be sentenced under these provisions pursuant to a finding made by a judge at sentencing under a preponderance of the evidence standard. . . . Congress . . . clearly intended that drug quantity be a sentencing factor, not an element of the crime under § 841; the statute is not susceptible to a contrary interpretation.\"); United States v. Aguayo-Delgado, 220 F.3d 926, 932-33 (8th Cir. 2000) (\"Quite simply, we have held repeatedly that because the legislature defined drug quantity as a sentencing factor in 21 U.S.C. § 841(b), a judge could decide drug quantity using a preponderance of the evidence standard. We have maintained this holding regardless of the impact of the drug quantity on the applicable sentencing range.\") (citations omitted); Grimaldo, 214 F.3d at 972 (\"Any argument that Jones requires us to interpret drug quantity as an element of a 21 U.S.C. 841 offense is foreclosed by the language of the statute and by circuit precedent. The structure and plain language of the statute leave no doubt that drug quantity is a sentencing factor.\").\n\nE.\n\nTo be sure, within the past year, following the Supreme Court's decision in Apprendi, all of the courts to have reconsidered section 841, including ours today, have now concluded that drug quantity and type are elements, not simply sentencing factors--precisely the opposite from what they had held prior to Apprendi. See, e.g., United States v. Page, 232 F.3d 536, 543-44 (6th Cir. 2000); Doggett, 230 F.3d at 164; Rogers, 228 F.3d at 1327-28; Nordby, 225 F.3d at 1058; Aguayo-Delgado, 220 F.3d at 933. But just as surely have these courts misunderstood Apprendi's narrow constitutional holding to require the complete abandonment of their earlier and consistent statutory interpretation of section 841, which most certainly it did not. Given their prior, repeated interpretations that the section 841 offenses are set forth in their entirety in section 841(a), and that Congress plainly intended drug quantity and type to be mere sentencing factors, the conclusion is inescapable that these courts have misunderstood Apprendi actually to hold, in effect if not in fact, that any fact that could serve to increase a defendant's sentence must be charged and proven to the jury beyond a reasonable doubt. They have misunderstood Apprendi's holding that any fact that increases a defendant's sentence beyond the maximum sentence statutorily authorized for the offense in question must be proven beyond a reasonable doubt, as a holding that any fact that increases a defendant's sentence must be so proven.\n\nThat the courts have misunderstood Apprendi in this way is evidenced by their failure even to undertake a statutory analysis of the kind prescribed in Almendarez-Torres, Jones, and Castillo to determine the maximum statutory punishment for the offenses defined in section 841, an analysis which would, consistent with their prior holdings that drug quantity and type are not elements of the section 841 offenses, dictate a conclusion that the maximum punishment authorized for commission of the section 841 offenses is life. Rather, they in effect reason backwards from the fact that drug quantity and type can increase an individual defendant's sentence, to the conclusion (constitutional, not statutory) that if quantity and type are not charged and proven to a jury beyond a reasonable doubt, then the statutory maximum penalty can only be that set forth in a subsection of section 841 that imposes a sentence without regard to drug quantity or type.\n\nNowhere is this error in defining the statutory maximum punishment clearer than in the Eleventh Circuit's opinion in Rogers, wherein the court reasoned as follows:\n\nThe statutory maximum must be determined by assessing the statute without regard to quantity. This means that sections 841(b)(1)(A) and 841(b)(1)(B) may not be utilized for sen tencing without a finding of drug quantity by the jury. If a provision of section 841(b) that does not contain a quantity amount applies, for example, section 841(b)(1)(C), then a convicted defendant may still be sentenced under that provision. 228 F.3d at 1327 (footnote omitted; emphasis added).\n\nAnd further confirming its understanding that Apprendi requires every fact that increases a defendant's sentence to be proven beyond a reasonable doubt, even when that fact does not increase the sentence beyond that authorized by the jury's verdict of guilt of the offenses defined in section 841, the court concluded:\n\nIn effect, the jury verdict convicted [Rogers] only of manu facturing, possessing, or distributing an undetermined quan tity of crack cocaine. Because section 841(b)(1)(A) and section 841(b)(1)(B) both turn upon the amount of crack cocaine at issue, those two sub-parts are inapplicable to this case. Therefore, Rogers may only be sentenced under sec tion 841(b)(1)(C), which provides punishment for convic tion of an undetermined amount of crack cocaine. Id. at 1328 (emphasis added).\n\nThe Ninth Circuit made precisely the same error in Nordby that the Eleventh Circuit did in Rogers:\n\nThe judge's finding that Nordby possessed 1000 or more marijuana plants 'increased the penalty for [Nordby's] crime beyond the prescribed statutory maximum.' Section 841(a) contains no penalty provision. But the only sentence under § 841 justifiable under the facts as found by the jury would be a sentence (and possible fine) of not more than five years applicable to possession of less than 50 mari juana plants. The trial court's finding that Nordby possessed 1000 or more plants under § 841(b)(1)(A)(vii) increased Nordby's sentence to 'not [ ] less than 10 years or more than life' and a possible fine. Thus, the judge's finding, made under a preponderance standard, increased the statutory maximum penalty for Nordby's crime from five years to life. 225 F.3d at 1058-59 (citation omitted; emphasis added); id. at 1056 (equating statutory maximum for the offense with\"statutory maximum penalty to which a criminal defendant is exposed,\" explaining that \"Apprendi held that a fact that increases the prescribed statutory maximum penalty to which a criminal defendant is exposed must be submitted to a jury and proven beyond a reasonable doubt.\").\n\nAnd the Sixth Circuit recently embraced the same misunderstanding of Apprendi in United States v. Page:\n\nPursuant to the provisions of § 841, the quantity of drugs is a factual determination that significantly impacts the sen tence imposed. . . . The jury merely found that defendants conspired to distribute and possess to distribute some unde termined amount of crack cocaine. As such, defendants can not be subjected to the higher penalties under § 841(b)(1)(A) or (B). Rather, the maximum sentence that may be imposed on this count is 20 years pursuant to § 841(b)(1)(C). 232 F.3d at 543. See also supra at 2-3 (Wilkins, J.) (\"[B]ecause the indictment that charged Promise did not allege a specific threshold quantity of cocaine or cocaine base and the jury did not make a finding regarding whether the offense involved such a quantity, Promise's conviction subjected him to a maximum penalty of 20 years imprisonment.\" (emphasis added)); United States v. Fields, 242 F.3d 393, 395-96 (D.C. Cir. 2001); Doggett, 230 F.3d at 164-65 (\"Section 841 clearly calls for a factual determination regarding the quantity of the controlled substance, and that factual determination significantly increases the maximum penalty from 20 years under § 841(b)(1)(C) to life imprisonment under § 841(b)(1)(A).\n\nTherefore, we hold that if the government seeks enhanced penalties based on the amount of drugs under 21 U.S.C. § 841 (b)(1)(A) or (B), the quantity must be stated in the indictment and submitted to a jury for a finding of proof beyond a reasonable doubt.\"); Aguayo-Delgado, 220 F.3d at 933 (\"Thus, if the government wishes to seek penalties in excess of those applicable by virtue of the elements of the offense alone, then the government must charge the facts giving rise to the increased sentence in the indictment, and must prove those facts to the jury beyond a reasonable doubt.\").\n\nTo reason in the way these courts have, is not to decide congressional intent; Congress' intent as to the statutory maximum punishment in section 841 does not change depending upon whether drug quantity and type are or are not submitted to a particular jury. To so reason, is unwittingly to impose the constitutional limitation that every fact that serves to increase a defendant's sentence must be charged in the indictment, submitted to the jury, and proven beyond a reasonable doubt, when Congress clearly did not intend such.\n\nII.\n\nHaving concluded, as a matter of statutory interpretation, that Congress unambiguously intended that the section 841 offenses are defined in their entirety in section 841(a), it remains for me only to determine the congressionally-prescribed maximum sentence for commission of those offenses. From the interpretation that the offenses are entirely defined in section 841(a), it follows that the facts of drug quantity and type identified in section 841(b) are not elements of the offenses, but, rather, sentencing factors. And it follows in turn from this that the maximum punishment for commission of a section 841 offense is life, plus fine, as provided for in sections 841(b)(1)(A), (B), and (C), with the actual sentence imposed dependent upon the presence or absence of the various sentencing factors identified in section 841(b). See United States v. Jones, 195 F.2d 205, 206-07 (4th Cir. 1999) (Luttig, J.) (what the defendant could have received in light of aggravating and mitigating factors does not change the statutory maximum). Because Apprendi only constitutionally forbids imposition of a sentence in excess of that authorized by the legislature for commission of that particular offense (when based upon the finding of a fact by a simple preponderance of the evidence), it is apparent that none of appellants' sentences are constitutionally voidable under Apprendi because none of them exceeds life.\n\nIII.\n\nIn reaching the conclusion that I do as to Congress' intent when enacting section 841, I appreciate that I am brought four-square to the constitutional question, lurking in the Supreme Court's majority opinions from Jones to Apprendi and openly addressed and decided in several separate opinions in those cases, of whether any fact that serves to increase a defendant's sentence -- even within the range of punishments authorized by statute -- must be charged in the indictment and proven to the jury beyond a reasonable doubt. See, e.g., Apprendi, 530 U.S. at 498-99 ( Scalia, J., concurring) (\"What ultimately demolishes the case for the dissenters is that they are unable to say what the right to trial by jury does guarantee if, as they assert, it does not guarantee -- what it has been assumed to guarantee throughout our history -- the right to have a jury determine those facts that determine the maximum sentence the law allows.\"); id. at 501 ( Thomas, J., concurring) (\"A long line of essentially uniform authority addressing accusations, and stretching from the earliest reported cases after the founding until well into the 20th century, establishes that the original understanding of which facts are elements was even broader than the rule that the Court adopts today. This authority establishes that a 'crime' includes every fact that is by law a basis for imposing or increasing punishment . . . .\"); Jones, 526 U.S. at 253 (Stevens, J., concurring) (\"Indeed, in my view, a proper understanding of this principle [of due process on which the Court's prior cases have rested] encompasses facts that increase the minimum as well as the maximum permissible sentence . . . .\"). I understand that the question is all the more starkly presented because of the vastly different punishments that can result from different judicial findings as to drug quantity and type, the possibility which has, at bottom, prompted the constitutional concerns that are so evident on the Supreme Court. With all respect to my colleagues on this court and our sister courts, however, I am confident that this is a question entirely different from that decided by the Supreme Court in Apprendi. In fact, I am convinced that it is, rather, the question expressly reserved by the Court when it declined to overrule McMillan v. Pennsylvania; limited the holding of that case to circumstances \"that do not involve the imposition of a sentence more severe than the statutory maximum for the offense established by the jury's verdict\"; and \"reserved for another day the question whether stare decisis considerations preclude reconsideration of [McMillan's] narrower holding.\" Apprendi, 530 U.S. at 487 n.13.\n\nTo believe otherwise, i.e., that this is the issue actually decided by the Court in Apprendi, as I believe my colleagues on this and other courts believe, is simply to confuse the Supreme Court's decisions in Almendarez-Torres, Jones, and Castillo, on the one hand, and its decision in Apprendi on the other. Even post-Apprendi, the Court's decisions in Almendarez-Torres, Jones, and Castillo remain sound and controlling precedents, as to whether, as a matter of statutory interpretation, Congress intended a particular fact to be an element of the offense or a mere sentencing factor. They hold that Congress' intent must be determined by resort to the conventional methods of statutory interpretation such as analysis of text, structure, context, tradition, and legislative history. The Court in Apprendi addressed the entirely different, constitutional question of whether the legislature permissibly may define a particular fact as a sentencing factor and permit its proof upon a simple preponderance of the evidence. And although the Court ominously reserved the enormously significant question of whether every fact that could result in an increase in sentence must be proven beyond a reasonable doubt, it only held that any fact that increases the penalty beyond the statutory maximum prescribed by the legislature must be submitted to the jury and proven beyond a reasonable doubt. (As to this essential limitation on the Court's holding, it must be borne in mind that the additional punishment that Apprendi challenged and the Court invalidated as unconstitutional was imposed via a statute separate altogether from the one under which Apprendi was convicted; thus, there was no question but that Apprendi received a punishment greater than that authorized by the jury's verdict.) Consequently, unless or until the Supreme Court overrules its holding in McMillan that a defendant is not entitled to a jury determination of a fact that serves to increase the defendant's sentence within the statutorily-prescribed punishment range, it is, as a constitutional matter, irrelevant that a particular fact will increase a defendant's sentence -- even increase it significantly -- as the findings as to drug quantity and type can do.\n\nAs to the almost imponderably significant constitutional question of whether any fact that could serve to increase a defendant's sentence must be charged and proven to the jury beyond a reasonable doubt, which obviously so divides the Supreme Court, I would not even begin to venture an answer. I am under no illusions as to the tenor of the Court's majority opinion in Apprendi, which is unmistakably to the effect that the Constitution would require a holding that all facts that increase a defendant's sentence must be proven to the jury beyond a reasonable doubt -- a tenor that is unsurprising given its author's view that such is required by the Constitution. See, e.g., Jones, 526 U.S. at 253 ( Stevens, J., concurring). Indeed, despite assurances that its holding is quite narrow, \u003cspan class=\"fnref\"\u003e13\u003c/span\u003e it is even plain that the overarching principles upon which the Court's decision rested, as wellas much of the opinion's critical language, would dictate a holding that all facts that could serve to increase a defendant's sentence must be proven to the jury beyond a reasonable doubt. \u003cspan class=\"fnref\"\u003e14\u003c/span\u003e However, it is equally clear that the Court did not so hold in Apprendi and has yet to so hold. When it finally does confront the question (as it may have no choice but to do in the context of this very dispute over section 841), I believe the ultimate answer will come down to the stare decisis effect accorded the Court's prior decisions in McMillan v. Pennsylvania, and, to a lesser extent, Almendarez-Torres. Unless or until the Court chooses to overrule these cases, however, I, as a lower court judge, am bound by them. And, accordingly, I would hold today that the Constitution forbids, upon a finding of a mere preponderance, only the imposition of a sentence that exceeds that authorized by the legislature. Where, as in the cases before us, the sentences imposed are within, not beyond, the range of punishments statutorily permitted, the Constitution, according to the Supreme Court in McMillan v. Pennsylvania, is simply not offended.\n\nIV.\n\nThe view of the United States on so fundamental a matter as that we address herein is of importance, and we have sought those views. Having studied the submissions and reflected on the arguments orally advanced by the government, I am convinced that it, too (although no less understandably), is as confused as are the federal courts. In fact, I am confident that government counsel throughout the Department of Justice would readily concede as much. To the extent that I can understand the government's position, however, I am unconcerned that a different conclusion is warranted by it.\n\nAs an initial matter, the United States has vacillated on its position throughout the various litigations that have come before our court. According to counsel for the United States in United States v. Promise, the Department of Justice apprised its attorneys that they may, but were not required to, argue that section 841 states multiple offenses, elements of which appear throughout subsection (b). Pursuant to this authorization, counsel for the government in Promise argued to us forcefully and unequivocally that the statutory offenses of section 841 are, as I maintain above, set forth in their entirety in subsection (a), and that the facts referenced in subsection (b) are mere sentencing factors. Counsel cautioned the panel that \"drug amounts are sentencing factors[,] the Supreme Court has not reversed itself on that and I would submit this court doesn't need to get out in front of the Supreme Court.\" Counsel then analyzed section 841 precisely as required by the Supreme Court's decisions in Almendarez-Torres, Jones and Castillo, and concluded that Congress never intended drug amount to be anything other than a sentencing factor, and that the statutory maximum for a violation of section 841 is life. And even after having had months to reflect on the position taken at argument in preparation for submission of supplemental briefing, the government concluded the same:\n\nA fair reading of the statute demonstrates unequivocally that § 841(a) establishes the elements of the offense and § 841(a) [sic] provides for the gradiated penalties. The facts by which a violation of § 841(a) are proven do not increase the maxi mum penalty for the offense, since the maximum penalty is up to life imprisonment, as provided in § 841(b). United States' Supplemental Brief at 8, United States v. Promise (No. 99-4737).\n\nAlthough acknowledging that the then-current position of the United States was otherwise, counsel for the United States in United States v. Cotton, No. 99-4162, when pressed, forthrightly admitted that she could not construct the statutory argument for the official position of the United States that drug quantity and type must be proven to the jury beyond a reasonable doubt, and that if they were not required to be submitted to the jury, the statutory maximum for the section 841 offense was twenty years. And, when pressed further for her personal view of section 841, she expressed the position that the statutory maximum for commission of the offenses defined in section 841 is indeed life imprisonment:\n\nCounsel: I think that there is an argument in just the way the statute has been written out to say that the offense is con tained in 841(a), and that the sentencing scheme as set forth in 841(b) basically lays out life and works it's way down.\n\nCourt: Is that the position of the Department?\n\nCounsel: No, that is not the position of the Department, your honor. I think the position of the Department, I know that the position of the Department right now is to, for us to, assume that twenty years is the statutory max and we are working our way up, as opposed to down, from life impris onment. But as a drug prosecutor for so many years, I -looking at the way the statute was phrased and where it was written by Congress -- I don't see where the argument is that they were saying all drug offenses are twenty years except for fifty grams of crack, which is a small amount which all of sudden places you at life, or a kilo of heroin. And the majority of these multi-defendant drug prosecutions you are talking about a tremendous quantity of drugs and most of these federal cases that come to court, and that when Congress was crafting the drug statutes, you are looking at cases that are going to be involving what really is a mini mum amount of drugs to invoke that life penalty. And so when I look at the statute itself I think there is a cogent argument to say Congress' intent was that life imprisonment was the maximum penalty and that you work your way down. I can understand the other argument in the reverse and I think we're all assuming . . .\n\nCourt: And how that how do you understand it?\n\nCounsel: I, well . . .\n\nCourt: Piece by piece, how would you construct that argu ment for the opposite position?\n\nCounsel: Um, I would say . . . well, your honor, you know, in all, in all . . . Court: You really can't.\n\nCounsel: In all truthfulness no, I really can't. And I think that's probably why I fall on the side of saying it really is life imprisonment and then coming down from there as opposed to the reverse direction. And I am not exactly sure I understand the reasoning as to why many of the courts, including in some of the other opinions that this court has issued, we've all assumed, for the sake of argument it seems, that twenty years is the statutory maximum and that the other two prongs of 841(b) are in penalty enhancements.\n\nCourt: Have you or anyone in your office seen fit to tell main Justice this view?\n\nCounsel: Your Honor, I know that there has been much dis cussion back and forth between the Narcotics Section of Main Justice, and much discussion within each U.S. Attorney's Office about this particular argument. But we've basically been directed by Department of Justice to say we're going to take, I guess, the \"safe route,\" which is to say it's twenty years, and you should go ahead and be including the amounts in the indictment.\n\nCourt: But the larger question is why, in the zealous repre sentation of your client, the United States, are you in search of the safe route? That's not what most of the lawyers in this room are doing when they represent their clients.\n\nCounsel: Um, well, your honor I'm, I'm, I guess, I'm, in rep resenting this position, uh, as the safe route because it's the position that the Department of Justice is taking at this point, and I am probably going out on a limb by putting forth my own personal view as a drug prosecutor. But I think that, and the court itself has already held in some other opinions -- and I realize that this may be all up for grabs when you reconsider the Angle decision -- that you all have been looking at twenty years as the, uh, the statutory max from which everything else is an enhancement. So I am looking at that, I am working with that body of case law, right now.\n\nCourt: Well the reason that I asked the question, frankly, is because I suspect that main Justice is also in search of a safe route and perhaps my question can make its way back to them as to whether that's what they should be doing.\n\nCounsel: Well I, I definitely am going to take this colloquy today back to my office and perhaps call someone, call our counterparts at Justice to advise them of that . . . .\n\nAnd before the en banc court, the government directly contradicted its earlier position in Promise, and equivocated even on what, a month later, would be its position in Cotton, arguing inconsistently (if not incoherently) that the offenses defined in section 841 appear in their entirety in section 841(a) and that Congress plainly intended drug quantity and type to be sentencing factors only, but, at the same time, that the quantity and type of drugs increase the statutory maximum sentence and \"it is error to impose a sentence that is authorized only by virtue of that increase in the maximum sentence without proving that fact (type or quantity) to the jury beyond a reasonable doubt.\" Letter from Nina Goodman, DOJ, Criminal Division, Appellate Section, to Clerk of Court, Fourth Circuit (Feb. 22, 2001). Thus, like my colleagues, unable to reconcile what it knows to be Congress' intent with what it either believes (mistakenly) or fears (prematurely) to be a holding by the Court in Apprendi that any fact that increases a sentence significantly must be proven to the jury beyond a reasonable doubt, the United States now takes the novel position that a fact that it concedes is not an element of the offense must nevertheless be proven to the jury beyond a reasonable doubt as if it were an element -- apparently confusing a fact that increases a sentence beyond the statutory maximum, which the Supreme Court characterized in Apprendi as the \"functional equivalent\" of an element of a greater offense, see 530 U.S. at 494 n.19, with a fact that increases a sentence, but only within the range of punishments authorized by the legislature. And as if this position were not untenable enough, the United States assures us that, even though this \"non-element\" must be proven to the jury beyond a reasonable doubt as if it were an element, it need not be charged in the indictment for the reason that it is not a \"real\" element -- a position one cannot help but believe was formulated solely because virtually every drug conviction in recent history would have to be reversed otherwise.\n\nI cannot even imagine the Supreme Court accepting such tortured arguments as to those matters that must and must not be proven to the jury beyond a reasonable doubt and those that must and must not be charged in the indictment. Indeed, I have a hard time conceiving even that the Solicitor General would be prepared to advance such an argument before the Supreme Court. Either facts that affect the sentence a defendant receives are elements or they are not; they are not elements for some purposes and not for others. And if they are elements, then they must be charged in the indictment. See, e.g., Apprendi, 530 U.S. at 483 n.10 (\"The judge's role in sentencing is constrained at its outer limits by the facts alleged in the indictment and found by the jury.\"); Castillo, 530 U.S. at 123-24 (\"The question before us is whether Congress intended the statutory references to particular firearm types in § 924(c)(1) to define a separate crime or simply to authorize an enhanced penalty. If the former, the indictment must identify the firearm type and a jury must find that element proved beyond a reasonable doubt.\"); Jones, 526 U.S. at 232 (\"Much turns on the determination that a fact is an element of an offense rather than a sentencing consideration, given that elements must be charged in the indictment, submitted to the jury, and proven by the Government beyond a reasonable doubt.\").\n\nIn the end, I suspect that the government's conundrum, unlike that of my colleagues, is not attributable so much to a misinterpretation of the Court's opinion in Apprendi, as to a misconception as to the consequence of its correct understanding of Congress' intent that drug quantity and type are mere sentencing factors, a misconception that is evident even in the few substantive sentences of the Department of Justice's supplemental letter to the en banc court in this case. There, the Department states that \"Section 841(b), which sets out the penalties for violations of Section 841(a)(1), authorizes increased maximum sentences based on, among other things, the type and quantity of the controlled substances involved in the offense.\" It is true that section 841(b) authorizes increased maximum sentences for particular defendants. What section 841(b) does not do, however, is increase the statutory maximum sentence for commission of the offenses in section 841(a). That statutory maximum sentence is, as a matter of congressional intent, life plus fine. The sentence that any particular defendant receives within the full range of penalties authorized in subsection (b) may depend upon the court's finding as to the presence or absence of the various sentencing factors identified in section 841(b). But the maximum sentence authorized by Congress for commission of the section 841 offense of unlawful manufacture or distribution of a controlled or counterfeit substance, and therefore the maximum sentence permitted by the jury's verdict of guilt of that offense, is always life plus fine --as a matter of statutory interpretation.\n\nAccordingly, nothing in the arguments advanced by the United States gives me any pause that I might be mistaken either as to Congress' intent with regard to drug quantity and type, or as to the effective inapplicability of Apprendi to Title 21, section 841. This is not to say that the Department of Justice will not be proven prescient when the Supreme Court eventually does address the question it reserved in Apprendi. But until the Court does decide that question, the Department is no less bound than I by McMillan v. Pennsylvania. And it is that decision that proves in error the Department's interpretation of the federal drug statute we construe today, not, as the Department believes, Apprendi that proves that interpretation correct.\n\nI am authorized to show that Chief Judge Wilkinson and Judges Niemeyer and Gregory concur in Parts I, II, and III of this opinion.\n\nDISSENT BY: DIANA GRIBBON MOTZ (In Part)\n\nDIANA GRIBBON MOTZ, Circuit Judge, concurring in part and dissenting in part, and dissenting in the judgment:\n\nI concur in parts II A-C of Judge Wilkins's opinion. I do not concur in part II D or part III, however, and I respectfully dissent from the judgment of the court because that judgment affirms Marion Promise's sentence for a crime for which he has never been charged or indicted, and, therefore, never tried or convicted. This plain error not only clearly affects Promise's substantial rights, it also goes to the very heart of the judicial process. If not remedied, this error will \"seriously affect\" the \"fairness, integrity or public reputation of judicial proceedings,\" and so, as the Supreme Court has directed, we \"should correct\" the error. See United States v. Olano, 507 U.S. 725, 736, 123 L. Ed. 2d 508, 113 S. Ct. 1770 (1993). I regret, and dissent from, the court's refusal to do so.\n\nI.\n\nSpeaking for a majority of the court, Judge Wilkins clearly and persuasively explains why a specific threshold drug quantity constitutes an element of the aggravated drug trafficking offenses prohibited by 21 U.S.C.A. § 841 (West 1999), which must be charged in an indictment and proven to a jury beyond a reasonable doubt.\n\nIn this case, the grand jury indicted and the petit jury convicted Promise of a single offense -- conspiracy to possess with intent to distribute \"a quantity of cocaine and cocaine base.\" No specific drug quantity charge was submitted to, or returned by, the grand jury. Consequently, the petit jury that tried Promise never considered the question of drug quantity, let alone found beyond a reasonable doubt that Promise conspired to distribute more than 50 kilograms of cocaine or 50 grams of cocaine base.\n\nThe statute at issue provides that the maximum sentence for conviction of conspiracy to possess with intent to distribute an unquantified amount of cocaine is no more than 20 years imprisonment. See 21 U.S.C.A. § 841(b)(1)(c). Therefore, under the new rule set forth by the Supreme Court in Apprendi, the maximum prison term that the district court could have legally imposed on Promise for this single count of conspiracy involving an unspecified \"quantity of cocaine and cocaine base\" is 20 years. See Apprendi v. New Jersey, 120 S. Ct. 2348, 2359 n.10 (2000) (\"The judge's role in sentencing is constrained at its outer limits by the facts alleged in the indictment and found by the jury.\"). Yet the district court, not having the benefit of the decision in Apprendi, sentenced Promise to 30 years imprisonment pursuant to 21 U.S.C.A. § 841(b)(1)(A)(i) for the more serious crime of conspiracy to possess with intent to distribute a specific threshold quantity of Schedule I or II controlled substance, e.g., at least 50 grams of cocaine base.\n\nJudge Wilkins properly concludes that the district court plainly erred in sentencing Promise to a prison term of 30 years. Judge Wilkins also correctly finds that this plain error affected Promise's substantial rights and rightly recognizes one of the reasons why this is so -- it resulted in Promise receiving a sentence of ten more years in prison than the statute he was charged with violating permits.\n\nThe court's refusal, notwithstanding these conclusions, to recognize this plain error is stunning. This serious misjudgment reflects a failure to appreciate fully both the nature of the error at issue here and the impossibility of overlooking such an error without jeopardizing the fairness, integrity, and reputation of judicial proceedings.\n\nII.\n\nThe error at issue in this case is a sentencing error only in the sense that it can be remedied by vacating Promise's sentence and remanding for resentencing. But, unlike the usual sentencing error, the root of this error is not a simple failure to calculate the correct sentence for the crime for which the defendant has been charged and convicted. \u003cspan class=\"fnref\"\u003e15\u003c/span\u003e Rather, the error here rests on the district court's decision to sentence Promise for a crime for which he was never charged or convicted.\n\nThe imposition of such a sentence is antithetical to our system of justice. It deprives Promise of the most fundamental of rights -- the right to be tried and convicted only on charges presented in an indictment returned by a grand jury. That Promise was properly indicted and convicted of a different (lesser) crime does not change the fact that he was never indicted or convicted of the crime for which he was sentenced. As the Supreme Court reminded us in Apprendi itself, \"'the indictment must contain an allegation of every fact which is legally essential to the punishment to be inflicted.'\" Apprendi, 120 S. Ct. at 2362 n.15 (quoting United States v. Reese, 92 U.S. 214, 232-33, 23 L. Ed. 563 (1875) ( Clifford, J., concurring)) (emphasis added). The indictment here simply did not do that. Using this indictment as the basis for imposing on Promise a 30-year sentence for an aggravated drug offense is precisely the same as using a defendant's indictment and conviction on a manslaughter offense, carrying a maximum penalty of 5 years, as the basis for imposing a life sentence for murder.\n\nThe United States Constitution expressly prohibits such a result. The Constitution guarantees all of us the right to have each element of a crime presented to, and found by, a grand jury prior to being tried, convicted, or sentenced for that crime. Indeed, the Fifth Amendment promises that \"no person shall be held to answer for a capital, or otherwise infamous crime, unless on a presentment or indictment of a Grand Jury.\" U.S. Const. amend V. And the Sixth Amendment ensures that this indictment shall inform the accused \"of the nature and cause of the accusation\" against him. U.S. Const. amend. VI.\n\nMore than a hundred years ago, in its seminal opinion construing these provisions, the Supreme Court noted the importance of a court placing itself \"as nearly as possible in the condition of the men who framed\" the Constitution. Ex Parte Bain, 121 U.S. 1, 12, 30 L. Ed. 849, 7 S. Ct. 781 (1887). Recognizing that the grand jury's critical role in\"protecting the citizen against unfounded accusation\" is of \"very ancient origin,\" long predating the founding of this Country, the Court surmised that the Framers were \"imbued in the common-law estimate of the value of the grand jury.\" Id. at 10-12. The Court concluded that the Framers \"therefore, must be understood to have used the language which they did in declaring that no person should be called to answer for any capital or otherwise infamous crime except upon an indictment or presentment of a grand jury, in the full sense of its necessity and of its value.\" Id. at 12 (emphasis added). For this reason, the Supreme Court held that \"an indictment found by a grand jury was indispensable to the power of the court to try the petitioner.\" Id. at 12-13 (emphasis added).\n\nThe Supreme Court has never retreated from its dictate that the Constitution makes a grand jury's indictment \"indispensable\" to the power to try a defendant for a serious crime. Rather, the Court has consistently and repeatedly reiterated the fundamental nature of the constitutional right to be tried only on charges presented to a grand jury.\n\nParticularly relevant here, the Court has expressly held that \"after an indictment has been returned its charges may not be broadened through amendment except by the grand jury itself.\" Stirone v. United States, 361 U.S. 212, 215-16, 4 L. Ed. 2d 252, 80 S. Ct. 270 (1960) (emphasis added). In the case at hand, although the government presented the grand jury with an indictment containing only the elements necessary to charge Promise with a violation of § 841(b)(1)(C), the district court sentenced him to the more serious crime defined in § 841(b)(1)(A); the court did not formally amend the indictment, but its sentence had the same effect. The Supreme Court in Stirone addressed a similar situation and concluded that \"although the trial court did not permit a formal amendment of the indictment, the effect of what it did was the same.\" Id. at 217. The district court here, as in Stirone, \"destroyed the defendant's substantial right to be tried only on the charges presented in an indictment returned by a grand jury.\" Id. This \"basic right is far too serious\" to be \"taken away with or without court amendment.\" Id. at 217-19. To do so, the Supreme Court has instructed, is \"fatal error.\" Id. at 219.\n\nBy formalizing the grand jury requirement in our Constitution, the Framers indicated their understanding of the importance of convening \"a body of laymen, free from technical rules, acting in secret, pledged to indict no one because of prejudice and to free no one because of special favor.\" Costello v. United States, 350 U.S. 359, 362, 100 L. Ed. 397, 76 S. Ct. 406 (1956). These characteristics of the grand jury provide several \"safeguards essential to liberty in a government dedicated to justice under law.\" Cole v. Arkansas, 333 U.S. 196, 202, 92 L. Ed. 644, 68 S. Ct. 514 (1948).\n\nBecause of the grand jury requirement, before the United States can prosecute anyone for a serious crime, an independent body of the citizenry must \"declare, upon careful deliberation, under the solemnity of an oath, that there is good reason for his accusation and trial.\" Ex Parte Bain, 121 U.S. at 11. This evidentiary function protects all of us \"from an open and public accusation of crime, and from the trouble, expense, and anxiety of a public trial before probable cause is established.\" Id. at 12 (internal quotation marks omitted).\n\nMoreover, because the Sixth Amendment demands that an accused \"be informed of the nature and cause of the accusation\" against him, the \"indictment must set forth . . . every ingredient of which the offence is composed.\" United States v. Cruikshank, 92 U.S. 542, 558, 23 L. Ed. 588 (1875) (internal quotation marks omitted). This notification allows the accused to prepare a defense as to every element of the indicted crime, or, after considering the charged elements and the maximum penalty permitted under the indictment, allows him to forego a trial and plead guilty. See Cole, 333 U.S. at 201. Without notification through indictment, one accused of criminal activity cannot knowingly decide whether to plead guilty or face trial, or adequately defend himself at trial against every element necessary to convict and punish him for a particular crime.\n\nBut the \"most valuable function of the grand jury\" may be \"to stand between the prosecutor and the accused, and to determine whether the charge was founded upon credible testimony or was dictated by malice or personal ill will.\" Hale v. Henkel, 201 U.S. 43, 59, 50 L. Ed. 652, 26 S. Ct. 370 (1906). See also Ex Parte Bain, 121 U.S. at 12 (\"[The grand jury] is justly regarded as one of the securities to the innocent against hasty, malicious, and oppressive public prosecutions.\") (internal quotation marks omitted). The requirement of indictment by grand jury constrains the power of both the prosecutor and the court by limiting what can be submitted for trial, conviction, and sentence. And, indeed, the Supreme Court has stated that \"the very purpose of the requirement that a man be indicted by grand jury is to limit his jeopardy to offenses charged by a group of his fellow citizens acting independently of either prosecuting attorney or judge.\" Stirone, 361 U.S. at 218.\n\nThus, the true measure of the right denied Marion Promise is this: the district court sentenced Promise as if he had been indicted and convicted of a far more serious offense, imposing on Promise ten more years of imprisonment than the offense for which he was actually indicted and convicted permits. In doing so, the district court denied Promise rights guaranteed by the Constitution, which have long been regarded as \"essential to liberty in a government dedicated to justice under law.\" Cole, 333 U.S. at 202.\n\nIII.\n\nNevertheless, this court refuses to recognize this error because it believes, with clear hindsight, that Promise was not innocent of the crime for which he was sentenced -- that the government presented \"overwhelming\" evidence at trial establishing his guilt. Ante at *27. But correcting plain error does not depend on a defendant's innocence. Rather, the Supreme Court has instructed that an appellate court \"should\" exercise its discretion to correct any plain error prejudicing a defendant's substantial rights, which \"seriously affect the fairness, integrity or public reputation of judicial proceedings independent of the defendant's innocence.\" Olano, 507 U.S. at 736-37 (internal quotation marks omitted) (emphasis added). See also United States v. Floresca, 38 F.3d 706, 713 n.18 (4th Cir. 1994) (en banc) (\"The term 'miscarriage of justice' is not the equivalent of 'miscarriage of result.\"); United States v. Hanno, 21 F.3d 42, 49 (4th Cir. 1994) (finding error \"impacts on the fairness, integrity and public reputation of judicial proceedings\" without discussing the evidence of guilt).\n\nCertainly, sentencing a man for a crime for which he has been neither charged nor convicted seriously affects the fairness, integrity, and public reputation of judicial proceedings. Perhaps this is most easily seen by analogy. Returning to the defendant indicted and convicted of manslaughter, but illegally sentenced to life imprisonment for murder -- I hope and trust no member of this court would \"decline to notice\" this \"sentencing\" error, even where the evidence adduced at trial indicated that the defendant's actions likely fit the statutory definition of murder. No such result could be regarded as fair, nor could \"judicial proceedings\" that would permit such a sentence to stand instill \"public confidence.\" See Olano, 507 U.S. at 736. For an appellate court to \"decline to notice\" such an error would constitute a serious abuse of discretion, producing a true \"miscarriage of justice.\" Id. Declining to notice the error in this case gives rise to the same fundamental unfairness, engenders the same lack of confidence in judicial proceedings, results in the same miscarriage of justice, and constitutes the same grave abuse of discretion.\n\nBecause the grand jury is \"not bound to indict in every case where a conviction can be obtained,\" Vasquez v. Hillery, 474 U.S. 254, 263, 88 L. Ed. 2d 598, 106 S. Ct. 617 (1986), our judicial system does not permit this or any other court to usurp the grand jury's role as gatekeeper. The court today attempts to do this sub silentio, stating \"there simply can be no doubt that had the indictment included the specific threshold quantity of 50 grams of cocaine base, the jury would have found Promise guilty beyond a reasonable doubt.\" Ante at *36 (emphasis added). But the fact is that the indictment returned against Promise did not include any aggravated drug offense charge and we do not know what evidence the grand jurors considered. Because of this, we cannot know whether they would have indicted Promise of an aggravated drug offense if such a charge had been submitted to them.\n\nA court cannot rely on its own view of what indictment a grand jury could or would have issued if the grand jury was never presented with a charge, or what verdict a petit jury could or would have reached if the petit jury was never presented with an indictment. \"It is utterly meaningless to posit that any rational grand jury could or would have indicted [the defendant] . . .,because it is plain that this grand jury did not, and absent waiver, a constitutional verdict cannot be had on an unindicted offense.\" Floresca, 38 F.3d at 712 (internal quotation marks omitted). In sum, whether the grand jury would have indicted Promise on the available evidence is irrelevant because:\n\nThe very purpose of the requirement that a man be indicted by grand jury is to limit his jeopardy to offenses charged by a group of his fellow citizens acting independently of either prosecuting attorney or judge. Thus the basic protection the grand jury was designed to afford is defeated by a device or method which subjects the defendants to prosecution for [an element] which the grand jury did not charge. Stirone, 361 U.S. at 218 (footnote omitted) (emphasis added).\n\nFor this reason, contrary to Judge Wilkins's suggestion, the case at hand critically differs from Johnson v. United States, 520 U.S. 461, 468, 137 L. Ed. 2d 718, 117 S. Ct. 1544 (1997), and United States v. Bowens, 224 F.3d 302 (4th Cir. 2000). Simply put, the district courts in Johnson and Bowens, unlike the district court here, did not sentence the defendants to crimes not charged in the indictment returned against them. Because the Johnson and Bowens errors occurred not in failing to present a charge to the grand jury, but in the \"trial process,\" Arizona v. Fulminante, 499 U.S. 279, 310, 113 L. Ed. 2d 302, 111 S. Ct. 1246 (1991), an appellate court could examine that process and discern that \"overwhelming\" and \"essentially uncontroverted\" evidence presented at trial supported the charges the grand jury had returned against the defendants. Johnson, 520 U.S. at 470; Bowens, 224 F.3d at 315. Upon making this assessment of the evidence at trial, the Supreme Court in Johnson and our court in Bowens could conclude with confidence that declining to notice the courts' sentencing errors would not \"seriously affect the fairness, integrity or public reputation of the judicial process.\" Id. (quoting Olano, 507 U.S. at 736).\n\nSuch a determination is impossible in a case like that at hand in which the defendant has never been charged with, or indicted of, the crime for which he has been sentenced. It is impossible because grand jury proceedings are secret. Thus, a court simply\"cannot know whether the grand jury would have included in its indictment\" a charge not before it. Stirone, 361 U.S. at 219. Assessment of the evidence presented at trial provides no reliable assurance as to what facts were presented to, or found by, the grand jury.\n\nTo attempt to judge the fairness of a sentence based on charges never made to a grand jury is to have this court\"make a subsequent guess as to what was in the minds of the grand jurors.\" Russell v. United States, 369 U.S. 749, 770, 8 L. Ed. 2d 240, 82 S. Ct. 1038 (1962). The Supreme Court has outlawed such post hoc judicial guesswork, precisely because it would allow a defendant to \"be convicted on the basis of facts not found by, and perhaps not even presented to, the grand jury which indicted him.\" Id.\n\nThis is why, quite unlike most trial errors, \"an indictment found by a grand jury is indispensable to the power of the court to try [the defendant] for the crime with which he was charged.\" Ex Parte Bain, 121 U.S. at 12-13 (emphasis added). Indeed, \"the lack of grand jury indictment . . . gives rise to a right not to be tried.\" Midland Asphalt Corp. v. United States, 489 U.S. 794, 802, 103 L. Ed. 2d 879, 109 S. Ct. 1494 (1989) (emphasis added). Thus, while it is appropriate for a reviewing court to assess the available evidence in determining when to notice instructional errors or other errors occurring at trial, a court simply does not have the \"power\" to review the evidence presented at trial before a grand jury's indictment allows it to do so. See Stirone, 361 U.S. at 215 (\"The Fifth Amendment requires that prosecution be begun by indictment.\"). \u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nIV.\n\nIn response to what I have written above, my colleagues contend that I improperly \"eschew[ ] a flexible approach in favor of a per se rule requiring appellate courts to notice plain error whenever a defendant suffers a conviction or sentence not authorized by the indictment.\" Ante at *37 n.9. I offer this brief reply.\n\nFirst, I confess that I do believe that sentencing a defendant for a crime for which he was neither indicted by a grand jury nor convicted by a petit jury is an error that always seriously affects the fairness, integrity, and public reputation of our judicial process. Furthermore, I believe that the Constitution requires this conclusion and that the Supreme Court has never held to the contrary. Today, in holding otherwise, this court takes a step toward disregarding altogether the right to grand jury indictment and to trial by petit jury in favor of judicial imposition of a sentence for whatever crime an appellate court believes that a defendant has committed. This, I hope, the Constitution will never permit.\n\nHowever, invocation of a \"per se\" rule is unnecessary to the proper resolution of this case. Rather, balancing all even arguably pertinent considerations requires precisely the same result-- noticing the plain error and ordering re-sentencing. On the other hand, the court's \"flexible approach,\" assertedly \"based on a balancing of numerous considerations,\" id., actually is grounded entirely on just two factors, both of which are irrelevant in the case at hand, gives short shrift to the fundamental nature of the grand jury error before us, and completely ignores the most relevant additional considerations. \u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nFirst, the court exaggerates the significance of two matters that are of minimal importance in the grand jury context--the strength of the government's evidence \u003cspan class=\"fnref\"\u003e18\u003c/span\u003e and post-indictment notice. These \"considerations\" are of little import in this case because, as I explained in part III, grand jury proceedings are secret, and thus no matter what evidence was produced at trial, and no matter what notice the government provided post-indictment, a court simply \"cannot know whether the grand jury would have included in its indictment\" a charge never presented to it. Stirone, 361 U.S. at 219.\n\nThis view entirely accords with Supreme Court precedent. One need look no further than Olano. There, the Court listed numerous cases in which it had reiterated the appropriate plain error standard as set forth in United States v. Atkinson, 297 U.S. 157, 160, 80 L. Ed. 555, 56 S. Ct. 391 (1936); in only one, Silber v. United States, 370 U.S. 717, 8 L. Ed. 2d 798, 82 S. Ct. 1287 (1962) (per curiam), did the Court hold that the plain error should be noticed and corrected. See Olano, 507 U.S. at 736 (collecting cases). The error noticed in Silber, like the error at issue here, involved a defective indictment. (Silber had moved to dismiss the indictment in the trial court; when that motion was erroneously denied, Silber failed to raise the indictment error in the court of appeals or the Supreme Court, but the Supreme Court nonetheless noticed the plain error. Silber, 370 U.S. at 717.) Although the evidence adduced at Silber's trial unquestionably established both his guilt and that he had notice of the unindicted information, see Silber v. United States, 111 U.S. App. D.C. 331, 296 F.2d 588, 590 (D.C. Cir. 1961), the Supreme Court, without any consideration of that evidence or the notice, corrected the plain indictment error and reversed the judgment. Silber, 370 U.S. at 718. Just as the evidence at trial was irrelevant to the Supreme Court's decision to notice the plain indictment error in Silber, it should be irrelevant to our decision to notice the plain error here. \u003cspan class=\"fnref\"\u003e19\u003c/span\u003e\n\nIn addition, in its emphasis on the post-indictment\"notice\" given Promise, the court fails to recognize that the grand jury not only serves to inform a defendant of the charge against him, but that possibly the \"most valuable function of the grand jury\" is \"to stand between the prosecutor and the accused\" to protect a defendant against charges \"dictated by malice or personal ill will.\" Hale, 201 U.S. at 59. Declining to notice this error allows the prosecution and the court to circumvent the grand jury and punish a man on the basis of evidence that they, not the grand jury, deem sufficient. Accordingly, post-indictment notice does nothing to preserve the integrity of the grand jury process or protect our grand jury rights, which are so \"essential to liberty in a government dedicated to justice under law.\" Cole, 333 U.S. at 202.\n\nAt the same time that the court inflates two irrelevant consider ations, it downplays a critical one -- the fundamental nature of the grand jury error. We have previously recognized, even when considering simple instructional error, that the \"fundamental nature of [an] error\" is a factor that an appellate court on plain error review should consider in \"appropriately exercising\" its discretion \"so as to preserve the fairness, integrity and reputation of the judicial process.\" United States v. David, 83 F.3d 638, 648 (4th Cir. 1996). Here, that factor, which the court today barely mentions, weighs heavily in favor of noticing and rectifying the error. For this error--sentencing a defendant for a crime for which he has never been charged, let alone indicted or convicted -- denies a right too vital to be ignored. When \"a plain error is committed in a matterthis absolutely vital to defendants,\" an appellate court properly notices it. Wiborg v. United States, 163 U.S. 632, 658, 41 L. Ed. 289, 16 S. Ct. 1127 (1896) (emphasis added). Indeed, even my colleagues who dissented in Floresca, although refusing to find as the majority did that the indictment was defective, recognized that when, as is concededly the case here, an indictment is truly defective \"it may be that the burden [a defendant must meet to warrant correction of plain error] will be met most of the time.\" Floresca, 38 F.3d at 726 n.17 (Russell, J., dissenting, joined by Wilkinson, Wilkins, Niemeyer, and Williams, JJ.) (emphasis added).\n\nIn addition to refusing to recognize the importance of the vital right denied here, the court today completely ignores the most relevant factors that the Supreme Court has found significant in assessing whether to notice errors that are far less fundamental than the one in this case. Thus, the court pays no mind to a \"consideration\" that helped tip the scales in Johnson v. United States, 520 U.S. 461, 137 L. Ed. 2d 718, 117 S. Ct. 1544 (1997), on which the court so heavily relies. Noticing the error in Johnson would have required reversing the defendant's conviction and possibly resulted in a costly new trial. See Id. at 470 (noting that \"reversal of [the] conviction\" would seriously affect the fairness, integrity and public reputation of judicial proceedings). The consequences of noticing the defect in this case are not nearly as onerous. We can rectify the instant error simply by re-sentencing Promise to the maximum term allowed by the statute for the offense of which he was indicted and convicted. Promise would not be set free, nor would the government have to undertake a new trial. The minimal costs of noticing this\"fatal error,\" Stirone, 361 U.S. at 219, certainly pale in comparison to the damage done to the integrity of our judicial process in failing to correct it.\n\nPerhaps even more surprisingly, the court also ignores the fact that noticing the error in this case does not encourage a defendant to \"sandbag\" the government, i.e., forego timely objection in the trial court for strategic advantage. Yet, the Supreme Court has time and again emphasized that preventing sandbagging is critically important in determining whether to notice plain error. See, e.g., Johnson, 520 U.S. at 466; United States v. Young, 470 U.S. 1, 15, 16 n.13, 84 L. Ed. 2d 1, 105 S. Ct. 1038 (1985); United States v. Frady, 456 U.S. 152, 163, 71 L. Ed. 2d 816, 102 S. Ct. 1584 (1982); United States v. Socony-Vacuum Oil Co., 310 U.S. 150, 238-39, 84 L. Ed. 1129, 60 S. Ct. 811 (1940).\n\nHence, in cases in which the Supreme Court has refused to notice plain error, a timely objection in the trial court could have eliminated, or substantially ameliorated, any error by means well short of the drastic relief -- ordering a new trial -- necessary to remedy the error on appeal. For example, in [Joyce B.] Johnson, 520 U.S. at 464, if the defendant had timely objected to the trial court's determination of materiality, that court could have submitted the question to the jury; in Olano, 507 U.S. at 727-29, if the defendant had timely objected to the presence of alternate jurors during jury deliberations, the trial court could have refused to permit the alternates to be present; in Young, 470 U.S. at 13 and Socony-Vacuum Oil, 310 U.S. at 239-42, if the defendant had timely objected to the prosecutor's arguments, the trial court could have halted the arguments; and in [Enoch T.] Johnson v. United States, 318 U.S. 189, 199-200, 87 L. Ed. 704, 63 S. Ct. 549 (1943), if the defendant had timely objected to the prosecutor's comments on the defendant's failure to testify on certain matters, the trial court could have prohibited the comments or instructed the jury to disregard them. Possible sandbagging by the defendant was, indeed, a problem in all of these cases; correcting the error was necessary to prevent future use of the tactic which created the error.\n\nIn contrast, had Promise timely objected to imposition of the 30-year sentence as contrary to Apprendi, the trial court could only have avoided error by giving Promise precisely the relief that we should now order -- vacating the sentence and remanding for imposition of the proper 20-year sentence. As the court recognizes, \"unquestionably, had the district court been aware of Apprendi at the time of trial, it would have imposed a sentence of 20 years imprisonment, instead of the term of 30 years it actually imposed.\" Ante at *27 n.8. Accordingly, noticing the plain error here would not permit Promise (unlike Olano and the others) to obtain any strategic benefit from his failure to timely object to the error in a timely manner.\n\nThe vital rights and critical error involved here, alone or in conjunction with the most relevant factors the Supreme Court has examined in determining whether to notice less fundamental errors, unquestionably demonstrate that the court abuses its discretion in refusing to notice and correct the error.\n\nV.\n\nToday, this court, on the basis of what it believes the grand jury would have done if the government had sought an indictment for a more serious crime, affirms the sentence Marion Promise received for that more serious crime -- even though Promise was never charged, never indicted, never tried, and never convicted of that crime. Long ago, the Supreme Court warned against allowing a court to \"change the charging part of an indictment to suit its own notions of what it ought to have been, or what the grand jury would probably have made if their attention had been called to suggested changes.\" Ex parte Bain, 121 U.S. at 10. If this is permitted, the Court cautioned, \"the great importance which the common law attaches to an indictment by a grand jury . . . may be frittered away until its value is almost destroyed.\" Id. Unfortunately, that has happened today.\n\nFor the foregoing reasons, I would vacate Promise's sentence and remand to the district court for re-sentencing, with instructions to impose a sentence not exceeding 20 years, the statutory maximum for the sole offense for which Promise was indicted and convicted, as the decision of the en banc court in United States v. Angle, 2001 U.S. App. LEXIS 14410, No. 96- 4662(L) (4th Cir. June 29, 2001) (en banc), requires. Respectfully, I dissent from the majority's refusal to do so.\n\nJudge Widener has authorized me to indicate that he joins parts I, II, III, and V of this opinion. Judges Michael and King have authorized me to indicate that they join in the entire opinion.\n\n\u003cspan class=\"fn\"\u003e1. \"Specific threshold drug quantities\" are those quantities of drugs set forth in 21 U.S.C.A. § 841(b)(1)(A), (b)(1)(B), a finding of which subjects a defendant to a sentence of ten years to life imprisonment ( § 841(b)(1)(A)) or five to 40 years imprisonment ( § 841(b)(1)(B)). We are not here concerned with whether \"death or serious bodily injury resulting from the use of\" a controlled substance distributed by the defendant, e.g., 21 U.S.C.A. § 841(b)(1)(C), which may produce a similar result, must be treated as an element under Apprendi. An \"aggravated drug trafficking offense\" is one that involves a specific threshold drug quantity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Prior to trial the Government did file an information alleging that the conspiracy involved \"in excess of 50 kilograms of cocaine; [and] in excess of 50 kilograms of cocaine base.\" J.A. 39.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Promise was charged not with a substantive drug offense, but with conspiracy. However, 21 U.S.C.A. § 846 specifies that \"any person who . . . conspires to commit any offense\" under, inter alia, 21 U.S.C.A. § 841 \"shall be subject to the same penalties as those prescribed for the offense, the commission of which was the object of the . . . conspiracy.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. In this regard, the Court explained that \"when the term 'sentencing enhancement' is used to describe an increase beyond the maximum authorized statutory sentence, it is the functional equivalent of an element of a greater offense than the one covered by the jury's guilty verdict. Indeed, it fits squarely within the usual definition of an 'element' of the offense.\" Id. at 494 n.19.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. We emphasize that we do not hold that \"all facts that could serve to increase a defendant's sentence must be found by the jury beyond a reasonable doubt.\" Post at *50. Instead, we merely hold that the maximum penalty that may be imposed upon a defendant is the maximum penalty allowed by statute upon proof of only those facts alleged in the indictment and found by the jury beyond a reasonable doubt. Once this maximum penalty is established, a fact (sentencing factor) that may increase the actual sentence imposed within that maximum is not subject to the same requirements.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The Government concedes that under Apprendi, a defendant may be subjected to an enhanced sentence based upon a specific threshold drug quantity only if the jury finds, beyond a reasonable doubt, that that quantity should be attributed to the defendant. However, the Government maintains that specific threshold drug quantities need not be alleged in the indictment. Cf. United States v. Nealy, 232 F.3d 825, 829 (11th Cir. 2000) (referring to a specific threshold drug quantity as \"an element of sentencing\"). The Government rests this argument on a passage in Apprendi in which the Court referred to a sentencing factor that increases the statutory maximum penalty for the offense of conviction as \"the functional equivalent of an element.\" Apprendi, 530 U.S. at 494 n.19; cf. United States v. Aguayo-Delgado, 220 F.3d 926, 933 (8th Cir.) (referring to drug quantity as the functional equivalent of an element), cert. denied, 121 S. Ct. 600 (2000). Essentially, the Government contends that a fact that increases the maximum penalty must be treated as an element for purposes of some rights guaranteed by the Fifth Amendment (e.g., the right to a determination of guilt beyond a reasonable doubt) but not others (e.g., the right to indictment by a grand jury). The Government provides no support for this proposition. Furthermore, the Jones Court explained that the constitutional rule at issue concerns \"the required procedures for finding the facts that determine the maximum permissible punishment[, including] the safeguards going to the formality of notice.\" Jones, 526 U.S. at 243 n.6. It will not be unduly difficult for juries to determine whether an offense involved a specific threshold drug quantity. Under the rule we announce today, the jury need only determine whether drug quantity exceeds specified thresholds. Juries in state drug-trafficking prosecutions routinely perform this function. See, e.g., State v. Virgo, 190 Ariz. 349, 947 P.2d 923, 926 (Ariz. Ct. App. 1997); State v. Moore, 304 N.J. Super. 135, 698 A.2d 1259, 1264 (N.J. Super. Ct. App. Div. 1997). The task of identifying the amount of drugs for which the defendant should be held accountable at sentencing is left to the district court pursuant to the principles set forth in the sentencing guidelines.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Four of my colleagues conclude that the drug quantity finding made by the district court did not increase Promise's sentence \"beyond the prescribed statutory maximum\" for his crime because Congress intended the statutory maximum for his crime to be life imprisonment. Apprendi, 530 U.S. at 490. In my view, my colleagues fail to reconcile this conclusion with the statement by the Apprendi Court that \"constitutional limits exist [regarding a legislature's] authority to define away facts necessary to constitute a criminal offense.\" Apprendi, 530 U.S. at 486. In this regard, the Supreme Court made clear in Apprendi that a fact finding increases a defendant's sentence beyond the statutory maximum whenever it exposes him to \"a penalty exceeding the maximum [the defendant] would receive if punished according to the facts reflected in the jury verdict alone.\" Id. at 483 (second emphasis added). My colleagues do not dispute that 20 years is the maximum penalty that could be imposed based solely on the facts found by the jury; § 841 requires that an additional fact such as a specific threshold drug quantity be established in order to impose a sentence exceeding 20 years. In nevertheless concluding that the maximum penalty for Promise's offense was life, my colleagues fail to acknowledge the focus of the entire discussion in Apprendi, which was that \"the judge's role in sentencing is constrained at its outer limits by the facts alleged in the indictment and found by the jury.\" Id. at 483 n.10 (emphasis added). It is only by failing to come to grips with the lengthy explanation provided by the Court for the rule it adopted in Apprendi that my colleagues can conclude that the constitutional rule announced in Apprendi was complied with here. Were there any question regarding the meaning of the rule announced in Apprendi, it would most certainly be answered by the analysis of the Court in Jones. According to my colleagues, it would be consistent with Apprendi to hold that § 841 imposes a single maximum penalty (life imprisonment) and that the gradations within § 841(b)(1) may be determined by a judge applying the preponderance standard. In Jones, however, the Court concluded that an essentially identical interpretation of § 2119 would violate the rule later adopted in Apprendi. See Jones, 526 U.S. at 243-44. In other words, the Court doubted the constitutionality of imposing a sentence exceeding 15 years (the maximum for the basic offense of carjacking) based on facts (death or serious bodily injury) that had not been proven to a jury beyond a reasonable doubt. Because the doubts expressed in Jones were premised on the rule later adopted in Apprendi, Jones forecloses the interpretation of Apprendi advanced by my colleagues and requires the conclusion reached by this court and every other court to decide this question.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. One of my colleagues maintains that the error did not affect Promise's substantial rights because \"neither the inclusion of the drug weight in the indictment nor an instruction to the jury that it must find [drug quantity] beyond a reasonable doubt . . . would have affected the outcome of the district court proceedings.\" Post at *40. This is not the relevant inquiry because the failure to charge a specific threshold drug quantity in the indictment or to instruct the jury regarding threshold drug quantity was not the error committed by the district court; on the contrary, the indictment, jury instructions, and conviction here are all valid. What was not valid was the sentence imposed, which exceeded the applicable maximum for the facts charged and proven. Cf. United States v. Bowens, 224 F.3d 302, 315 (4th Cir. 2000) (stating that third prong of plain error analysis was \"easily . . . satisfied\" by sentence exceeding applicable maximum for conspiracy to distribute heroin even though there was \"overwhelming and essentially uncontroverted evidence\" that defendant qualified for greater penalty based upon distribution of cocaine base), cert. denied, 149 L. Ed. 2d 349, 121 S. Ct. 1408 (2001). Unquestionably, had the district court been aware of Apprendi at the time of trial, it would have imposed a sentence of 20 years imprisonment, instead of the term of 30 years it actually imposed.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. My determination not to notice the error is based on a balancing of numerous considerations, including the strength of the Government's evidence, the manifest adequacy of notice, and Promise's failure to contest drug quantity despite this notice. I have also given due weight to the importance of grand jury charging practices, which the partial dissent so eloquently extols. (Contrary to the partial dissent's contention, I do not rely on any supposition regarding what the grand jury might have done had the Government sought an indictment charging a specific threshold drug quantity.) The partial dissent, however, makes this last consideration not only dispositive but exclusive, eschewing a flexible approach in favor of a per se rule requiring appellate courts to notice plain error whenever a defendant suffers a conviction or sentence not authorized by the indictment. See post at *108 (\"The United States Constitution expressly prohibits such a result.\"). I do not believe that Supreme Court precedent supports this view. The partial dissent contends that this per se rule derives from Russell v. United States, 369 U.S. 749, 8 L. Ed. 2d 240, 82 S. Ct. 1038 (1962), and Silber v. United States, 370 U.S. 717, 8 L. Ed. 2d 798, 82 S. Ct. 1287 (1962) (per curiam). Russell was not a plain error case, however. Moreover, Russell does not preclude us from considering whether the defendant has received actual notice of a fact omitted from an indictment; rather, Russell only requires us to conclude that such omissions from the indictment necessarily affect a defendant's substantial rights, regardless of whether the defendant had actual notice. See Russell, 369 U.S. at 770. But the fact that the error affects substantial rights (the third prong of the plain error inquiry) does not compel us to notice the error (the final prong). See Olano, 507 U.S. at 737 (stating that reversal is not required whenever a plain error affects substantial rights, because otherwise \"the discretion afforded by Rule 52(b) would be illusory\"). Here, consideration of the entire record leads me to the conclusion that no miscarriage of justice would result from declining to notice the omission of the specific threshold drug quantity from the indictment and the failure to instruct the jury to make a finding regarding threshold drug quantity. Critically, as noted above, the Government filed an information specifically contending that Promise's conspiracy involved \"in excess of 50 kilograms of cocaine [and] in excess of 50 kilograms of cocaine base.\" J.A. 39. The filing of the information does not alter the fact that Promise was deprived of the possibility that the grand jury would not have returned an indictment including a specific threshold drug quantity had the Government sought such an indictment. However, the information filed here at least apprized Promise that drug quantity would be a major issue affecting his sentence. Despite this notice, Promise never contested the amount of cocaine base for which he could be held accountable. In light of these facts, there can be no reasonable doubt that Promise was actually responsible for the specific threshold amount. Neither is Silber controlling here. In Silber, the defendant was convicted of refusing to answer questions posed by a congressional committee, in violation of 2 U.S.C.A. § 192 (West 1997). See Silber, 370 U.S. at 717. The indictment for this offense was invalid under Russell, in that it failed to identify the subject of the congressional inquiry as to which the refusal to answer questions occurred. See id. The Supreme Court concluded that this defect in the indictment amounted to reversible plain error. See id. at 718. In its brief, per curiam opinion, the Court did not discuss the strength of the Government's proof, whether the defendant had actual notice, or whether the evidence concerning the omitted element was disputed; thus, the opinion does not reveal either the facts relating to these issues or how those facts influenced the Court's decision. A court of appeals had previously opined that Silber's culpability was beyond question, see Silber v. United States, 111 U.S. App. D.C. 331, 296 F.2d 588, 590 (D.C. Cir. 1962), but that court was addressing a different issue, and the Supreme Court never alluded to this finding. While Russell and Silber do not foreclose consideration of a broad range of circumstances, other Supreme Court decisions affirmatively command us to examine the entire record when deciding whether to notice plain error. See, e.g., Young, 470 U.S. at 16. Moreover, one of the most recent Supreme Court statements on this issue, Johnson, attaches great weight to the presence of powerful, uncontroverted evidence against the defendant. In relying on Johnson, I do not, as the partial dissent suggests, make the decision to notice plain error \"depend on a defendant's innocence.\" Post at *114. Such an approach would contravene Supreme Court precedent. See Olano, 507 U.S. at 736-37 (explaining that, while \"the court of appeals should no doubt correct a plain forfeited error that results in the conviction or sentence of an actually innocent defendant, . . . an error may seriously affect the fairness, integrity or public reputation of judicial proceedings independent of the defendant's innocence\" (internal quotation marks omitted)). It does not follow, however, that a clear and undisputed demonstration of the defendant's guilt is irrelevant to our decision regarding whether to notice an error. Under Johnson, we may not ignore such a demonstration, as overturning a conviction or sentence resting on overwhelming evidence of guilt and undisputed evidence of drug quantity would itself be a miscarriage of justice. See Johnson, 520 U.S. at 470.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Like the government, I am not sure that the legislative history can be read fairly to suggest either that Congress did or did not intend drug amount and type to be sentencing factors. The appellant in Promise, in an observation against interest, however, is of the view that the legislative history rather clearly suggests that Congress intended at least drug quantity as a sentencing factor. See Supplemental Brief of Appellant at 2, 17, United States v. Promise (No. 99-4737) (citing Comprehensive Crime Control Act of 1984, Pub. L. No. 98-473, 98 Stat. 1837 (1984); S. Rep. No. 225-98, at 255 (1983); and Chapman v. United States, 500 U.S. 453, 461, 114 L. Ed. 2d 524, 111 S. Ct. 1919 (1991) (noting that the Comprehensive Crime Control Act of 1984 \"made punishment dependent upon the quantity of the controlled substance involved\")).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. See also, e.g., United States v. Pena, 51 F. Supp. 2d 364, 366 (W.D.N.Y. 1998) (drug quantity); United States v. Carlos, 906 F. Supp. 582, 590-91 (D. Kan. 1995) (drug type); United States v. Monocchi, 836 F. Supp. 79, 82 (D. Conn. 1993) (drug quantity); United States v. Bush, 813 F. Supp. 1175, 1177-78 (E.D. Va. 1993) (drug quantity); United States v. Ekwunoh, 813 F. Supp. 168, 172 (E.D.N.Y. 1993) (drug quantity); United States v. McDonald, 777 F. Supp. 43, 44 (D.D.C. 1991) (drug quantity); United States v. Taft, 769 F. Supp. 1295, 1311 (D. Vt. 1991) (drug quantity); United States v. Naranjo, 755 F. Supp. 46, 47 (D.R.I. 1991) (drug quantity); United States v. Marshall, 706 F. Supp. 650, 652 (C.D. Ill. 1989) (drug quantity and type).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. See also, e.g., United States v. Parker, 89 F. Supp. 2d 850, 857 (W.D. Tex. 2000); United States v. Harris, 66 F. Supp. 2d 1017, 1034 (D. Iowa 1999); United States v. Bennett, 60 F. Supp. 2d 1318, 1321-22 (N.D. Ga. 1999); United States v. Lilly, 56 F. Supp. 2d 856, 859 (W.D. Mich. 1999); United States v. Favors, 54 F. Supp. 2d 1328, 1331 (N.D. Ga. 1999).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. See, e.g., Apprendi, 530 U.S. at 474 (characterizing as \"narrow\" the issue before the Court); id. at 481 (\"We should be clear that nothing in this history suggests that it is impermissible for judges to exercise discretion -- taking into consideration various factors relating both to offense and offender -- in imposing a judgment within the range prescribed by statute.\"); id. at 484 n.19 (\"This is not to suggest that the term 'sentencing factor' is devoid of meaning. The term appropriately describes a circumstance . . . that supports a specific sentence within the range authorized by the jury's finding that the defendant is guilty of a particular offense.\"); id. at 482-83 (\"The historic link between verdict and judgment and the consistent limitation on judges' discretion to operate within the limits of the legal penalties provided highlight the novelty of a legislative scheme that removes the jury from the determination of a fact that, if found, exposes the criminal defendant to a penalty exceeding the maximum he would receive if punished according to the facts reflected in the jury verdict alone.\") (footnote omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. See, e.g., Apprendi, 530 U.S. at 469 (\"The question presented is whether the Due Process Clause of the Fourteenth Amendment requires that a factual determination authorizing an increase in the maximum prison sentence for an offense from 10 to 20 years be made by a jury on the basis of proof beyond a reasonable doubt.\"); id. at 478 (\"Any possible distinction between an 'element' of a felony offense and a 'sentencing factor' was unknown to the practice of criminal indictment, trial by jury, and judgment by court as it existed during the years surrounding our Nation's founding.\") (footnote omitted); id. at 484 (\"Since Winship, we have made clear beyond peradventure that Winship 's due process and associated jury protections extend, to some degree,'to determinations that [go] not to a defendant's guilt or innocence, but simply to the length of his sentence.'\") (citation omitted); id. at 486 (\"We did not, however, there [in McMillan] budge from the position that (1) constitutional limits exist to States' authority to define away facts necessary to constitute a criminal offense, and (2) that a state scheme that keeps from the jury facts that 'expose [defendants] to greater or additional punishment,' may raise serious constitutional concern.\") (citations omitted); id. at 487 n.13 (\"We reserved for another day the question whether stare decisis considerations preclude reconsideration of [McMillan's] narrower holding.\"); id. at 489 (\"Even though it is arguable that Almendarez-Torres was incorrectly decided, and that a logical application of our reasoning today should apply if the recidivist issue were contested . . . .\"); id. at 494 (characterizing as \"constitutionally novel and elusive\" the \"distinction between 'elements' and 'sentencing factors'\"); id. at 495 (\"When a judge's finding based on a mere preponderance of the evidence authorizes an increase in the maximum punishment, it is appropriately characterized as 'a tail which wags the dog of the substantive offense.'\") (citation omitted).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. Ironically, if this were the source of the error in this case, the court would undoubtedly notice it. See United States v. Ford, 88 F.3d 1350, 1355-56 (4th Cir. 1996) (sentencing defendant at a more \"severe guideline range\" is plain error that \"clearly affects substantial rights\" and \"seriously affects the fairness, integrity, and public reputation of the judicial proceedings,\" and, thus should be noticed despite defendant's failure to raise objection below). See also United States v. Perkins, 108 F.3d 512, 517 (4th Cir. 1997) (\"The district court's plain error allowed Perkins to receive an unwarranted 52-month reduction, 'thereby affecting the substantial rights of the government and the people of the United States that this defendant be sentenced correctly'\" and \"the bestowing of a windfall sentence reduction . . . also seriously affects the fairness, integrity, and public reputation of judicial proceedings.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. Long ago, the Supreme Court expressly held that a court has no \"authority\" to impose a sentence other than that which the law provides for the offense on which a defendant \"was indicted and convicted.\" In re Bonner, 151 U.S. 242, 254, 258, 38 L. Ed. 149, 14 S. Ct. 323 (1894) (Even\"if the court is authorized to impose imprisonment\" for the crime on which the defendant has been indicted and convicted, if the term of imprisonment\"exceeds the time prescribed by law, the judgment is void for the excess.\").\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The court's approach also creates a rule so vague as to be almost impossible to discern or follow; for the court never tells us which of its \"considerations\" is dispositive or how its\"considerations\" are to be weighed. Presumably, even overwhelming and uncontroverted evidence of a defendant's guilt, without post-indictment notice, is insufficient to persuade the court not to notice an error like that at issue here. See ante at *37. But if this sort of evidence were accompanied by a notice, but not one which was \"manifestly adequate,\" should a court notice this sort of error? What if the government provided an adequate notice, and presented strong, but not undisputed, evidence?\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. The court suggests that assessment of the government's evidence and Promise's failure to dispute that evidence are two separate \"considerations,\" see ante at *37 n.9; in fact they are just different parts of a single \"consideration\" -- the strength (\"overwhelming\" and/or \"undisputed\" or not) of the prosecution's evidence -- which, for all we know, the grand jury never considered.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. The court attempts to distinguish Silber on the basis that the Supreme Court \"did not discuss the strength of the Government's proof, [or] whether the defendant had actual notice.\" Ante at *37 n.9. But that is precisely the point. The Supreme Court in Silber corrected the plain error caused by the defective indictment without regard to the trial evidence or the notice given. In fact, the Court thought the defect serious enough to warrant sua sponte correction, despite the defendant's failure to bring the error to the Court's attention. See Silber, 370 U.S. at 718. Furthermore, despite the court's assertion to the contrary, see ante at *37 n.9, for the reasons discussed in part III, the Supreme Court's consideration of the evidence in declining to correct the jury instruction error at issue in Johnson does not alter the fact that the Court looked past the evidence to correct the indictment error in Silber.\u003c/span\u003e\n\n",
    "body_length": 163834,
    "citedas": [
      "255 F.3d 150"
    ],
    "attorneys": "Counsel: Argued: Noell Peter Tin, Charlotte, North Carolina, for Appellant.Nina Swift Goodman, United States Department OF Justice, Washington,D.C., for Appellee.ON Brief: Mark T. Calloway, United States Attorney, Gretchen C.F.Shappert, Office OF The United States Attorney, Charlotte, NorthCarolina, for Appellee.",
    "category": [
      "243",
      "36",
      "75"
    ],
    "judges": "Wilkinson, Chief Judge, and Widener, Wilkins, Niemeyer, Luttig,Williams, Michael, Motz, Traxler, King, and Gregory, Circuit Judge.",
    "citation_count": 229
  }
}
