{
  "id": "FoCVGZQBep42eRA90r46",
  "document": {
    "title": "Host v. United States",
    "full_title": "Robert L. HOST, Jeffrey Best, Lamar J. Williams, Sanquan Carter, and Orlando Carter v. UNITED STATES",
    "jurisdiction": "District of Columbia Court of Appeals",
    "date": "2018-02-15T00:00:00+0000",
    "docket": "Nos. 12-CF-1589, 12-CF-1590, 15-CO-1005, 12-CF-1641, 12-CF-1675, and 12-CF-1699",
    "body": "Blackburne-Rigsby, Chief Judge: Following an extended months-long joint jury trial, appellants Robert Bost, Jeffrey Best, Sanquan Carter, Orlando Carter,1 and Lamar Williams were each convicted of participating in at least orie of two separate, but related conspiracies to commit murder that in total left five dead and eight injured. Specifically, Best, Sanquan, and Orlando were found guilty of murdering Jordan Howe and injuring two others orí March 22, 2010, in retaliation for the theft of Sanquan’s bracelet (“first conspiracy”)-2 On .March. 23, 2010, to avenge Howe’s murder, Howe’s half-brother, Marquis Hicks, along with three friends, shot Orlando. In retaliation for Orlando’s shooting, Bost, Orlando, Best, and Williams conspired to murder Howe’s friends (“second conspiracy”).3 On March' 30, 2010, Bost, Orlando, and Best murdered Tavon Nelson for his firearip and then the three co-conspirators, with assistance , from Williams, conducted a drive-by shooting on the 4000 block of South Capitol Street, Washington, D.C., where some of Howe’s friends had gathered in Howe’s remembrance. The shooting left three dead and six wounded.4 In their consolidated appeals, appellants — both jointly and individually — allege that several errors occurred during the course of their joint jury trial. For the forthcoming reasons, we affirm the judgments of the Superior Court. In light of the length of this opinion, we set forth below the following table of contents as an aid to the reader. Table of Contents I. Factual'Background.. ,1170 A. First Conspiracy: Alabama Avenue Shooting.. .1170 B. Retaliatory Shooting of Orlando..-.1171 C. Second Conspiracy: Murder of Ta-von Nelson and South Capitol Street Shooting.. .1172 D. Government’s Evidence of the Crimes... 1173 E. Convictions and Sentences... 1175 II. Pretrial Issues... 1175 A. Change of Venue... 1175 B. Joinder and Severance... 1178 III. Issues Arising During Trial... 1188 A. Prosecutor’s Statements During Opening and Closing... 1188 B. Technical Issues with Hush-er...1192 C. Statements Against Penal Interest... 1195 D. Withdrawal From Conspiracy Jury Instruction... 1200 E. Other Issues... 1201 IV. Juror’s Note... 1203 V. Best’s Ineffective Assistance of Counsel Claim... 1205 VI. Conclusion... 1213 I. Factual Background A. First Conspiracy: Alabama Avenue Shooting5 On the night of March 21, 2010, Sanquan was at a party with a group of acquaintances, including Andre Morgan and Jordan Howe, who were godbrothers, in the basement apartment of Jam’ya Wilkins, located at 1333 Alabama Avenue, Southeast, Washington, D.C. At the party, San-quan showed off his fake diamond bracelet to numerous individuals, including Howe. After the party, Sanquan realized that his bracelet had been stolen. He became upset and rampaged through Wilkins’s apartment looking for the bracelet, which he suspected that one of the men at the party had stolen. Sanquan, with assistance from Morgan, then went to find Howe at Howe’s apartment, where Sanquan confronted Howe about the bracelet. In response, Howe told Sanquan, “[M]an, nobody got that fake bracelet, not nobody,” and San-quan responded, “[Yj’all motherfu**ers playing. Y’all need to come up with the bracelet.” Morgan and Sanquan then attempted to find and confront the other men at the party, but were unable to locate them. Undeterred, on his way back to the apartment building on Alabama Avenue, Sanquan called his older brother Orlando and told him that he had been robbed and to “bring everything.” When Sanquan called, Orlando was with his friend, Nathaniel Simms, in a silver Kia Spectra, which belonged to Simms’s girlfriend, Brittany Young. Orlando told San-quan on the phone, “[W]e about to be on our way up there” and he then told Simms that Sanquan had just been robbed and that they needed to pick up their other friend, Best, to ride with them to meet Sanquan. Simms and Orlando first went to the home of Orlando’s godmother, Shiree Little, where Orlando picked up his AK-47 rifle, and afterwards, they picked up Best from his home, The three men then went to Williams’s home, where Williams gave them Simms’s .380 pistol and Williams’s shotgun. Orlando told the group, “[Mjoth-erfu**ers robbed my little brother[;j they going to see.” Best replied, “[Ojh, yeah, I love this sh**. I love this sh**.” Williams then showed Best how to use the shotgun. In preparation for the encounter, Orlando switched from his bright red jacket into a black jacket that was in the Kia’s trunk and Best also switched into another jacket. Williams got out of the car before the men drove off toward 1333 Alabama Avenue, Southeast. When Simms, Orlando, and Best arrived at Aabama Avenue, Sanquan approached the car and Orlando told him to “come on.” Sanquan replied, ‘You think I brought [you] all the way over here for nothing?” Sanquan then took the .380 - pistol from Simms. Sanquan, Orlando, and Best approached the apartment -building where the party had occurred earlier and where numerous individuals who had attended the party were still standing outside. San-quan brandished the .380 pistol, Orlando brandished the AK-47, and Best held the shotgun, while Simms remained in the car. Sanquan held the individuals in front of the apartment at gunpoint while he patted them down and demanded the return of his bracelet. After one of the individuals refused to be patted down, Sanquan turned to Orlando and Orlando asked San-quan if he should, “Go ham?”, i.e., whether they should start shooting, to which San-quan replied, “Go ham.” The three men then started shooting at the group indiscriminately. Sanquan fired all five rounds that had been in the .380 pistol, Orlando fired all twenty-eight rounds from the AK-47, and Best fired the shotgun three times. During the shooting, Howe, who was in a car nearby, was hit by a stray bullet and died, while two others, juvenile V.K.M. and Tavon Lambert, were injured by the gunfire. After seeing Howe’s body and realizing that Howe was ■ dead, Morgan, who had supported Sanquan up. to that point but who was Howe’s godbrother, left the scene vowing revenge on the Carter brothers. He immediately went to meet with other friends and told them what had occurred, and they all formed an agreement to murder Sanquan and Orlando in retaliation. Jordan Howe’s cousin, Kalisha Howe, who had been present during the shooting, remained on the scene and identified San-quan that night to the police from a photograph. She also identified Orlando from a nine-person photo array the following day, saying it “could be” him. Wilkins, the woman who hosted the party in her basement apartment, also identified Sanquan on the night of the shooting. After the shooting, Simms drove San-quan, Orlando, and Best to the apartment of one of the Carter brothers’ relatives by marriage, Ronald Ray. At the apartment, the men hid their weapons and boasted about the shooting. .Sanquan explained to the men what had happened before their arrival and complained that he was given a gun with only five bullets. Best said that he was not sure if he had successfully fired the shotgun, but thought • he may have once. Orlando bragged that he had shot Howe and shot at a “nosy” woman on the top floor of the apartment . building.6 After the discussion,' Simms alone left Ray’s apartment. The next day, while Simms was in the Kia with his girlfriend, Young, he met Orlando and Best and allowed Orlando to get his red jacket and Best to get his black jacket from the trunk of the ear, all of which Young later testified to witnessing. B. Retaliatory Shooting of Orlando On March 23, 2010, police arrested Sán-quan for his involvement in Howe’s murder. Meanwhile, Morgan planned his retaliation for Howe’s murder with Howe’s half-brother, Marquis Hicks, and ' two friends. Morgan and the three others drove to Sixth and Chesapeake Streets, Southeast, a location where Orlando was known to hang out, and recognized Orlando in his red jacket. Hicks approached Orlando on foot and shot him, resulting in a graze to Orlando’s head and a bullet in his shoulder. Best and Bost, who was another friend of Orlando’s, were present during the shooting. At the hospital, Orlando told Best, Bost, and Simms that San-quan had been arrested, and that the guns had to be moved from Ray’s apartment. Simms and Best moved the shotgun and the AK-47 from Ray’s apartment to Williams’s apartment. C. Second Conspiracy: Murder of Ta-von Nelson and South Capitol Street Shooting The next day, Simms and Best visited Orlando at his mother’s house, where Orlando told them that he'believed his shooter was one of Howe’s friends, and that he wanted to attack Howe’s funeral in revenge (which was to take place'on March 30). In conjunction with Simms, Best, Bost, and Williams, Orlando decided to procure more guns and to rent a minivan for the shooting. On March 27, 2010, Orlando, Simms,- Best and Bost obtained a 9mm pistol from Orlando’s father and Bost independently obtained a .45 pistol. Simms and Best bought and delivered two boxes of ammunition to Williams. On March 29, Simms, Orlando and Best tried three times to rent a minivan, but no one had sufficient credit to successfully rent the minivan. Orlando then asked his godmother to rent the minivan from a rent-a^ear facility and, after two failed attempts, they successfully rented a silver Chrysler Town \u0026amp; Country minivan at about 5:45 p.m. on March 30; however, Howe’s funeral'had already taken place by that time. Undeterred, Orlando set into motion a new plan to shoot Howe’s relatives. First, Orlando, Best, Bost, Simms, and Williams retrieved the firearms and ammunition. Once the weapons were recovered and the co-conspirators were driving in the. van, however, Williams told the others, “Wall about to go commence, Y’all can let me out right here,” and he exited the van. Because they only had three guns (AK-47, 9mm Glock, and .45 pistol) amongst the four of them, Orlando drove to the Wingate Apartments to rob a man, Tavon Nelson, who he knew carried a gun. Orlando sent Best and Bost to rob Nelson. Best took the 9mm and Bost took the .45 and both wore masks rolled-up to the top of their heads. Best and Bost- attempted to rob Nelson and a shootout occurred at which Nelson was killed. Bost admitted to his cohorts back at the van that he was the one who dealt the killing blow, stating, “Yeah, [Best] hit him, but I finished him.” When Orlando asked where the gun was, however, Best replied that it was left behind with Nelson,, which upset Orlando but he decided nonetheless to drive away without Nelson’s gun. Police responded to the scene within minutes and a witness informed them that, after the shooting, she saw a man run and enter a- silver Chrysler Town \u0026amp; Country minivan. Police recovered seven 9mm shell casings and three .45 shell casings from the scene of .Nelson’s murder. Orlando then drove the van immediately to the 4000 block of South Capitol Street, where many ■ of Howe’s friends were gathered in a front yard, wearing remembrance shirts from Howe’s funeral. Orlando drove up close to the crowd and lowered the van’s windows. Orlando told the other men, “When I pull over, have them guns hanging out the window.” All of the men then pulled down their masks and began firing their weapons. As Orlando drove, Bost fired the .45 pistol from the front passenger window, Simms fired the AK-47 from the rear passenger window, and Best fired the 9mm Glock from both the rear passenger window and the rear driver’s side window. Numerous individuals were shot. Following the shooting, Metropolitan Police Department (“MPD”) Sergeant Las-wuan Washington and his partner, Sergeant Cowan, pursued the minivan because it matched the lookout description officers had received from the witness at the scene of Nelson’s murder. During the pursuit, Sergeant Washington caught a glimpse of Orlando. As the police pursued the minivan, Simms threw the AK-47 out of one of the windows. Orlando then hit a police car in a nearby alley and all four men jumped out of the van and started running in different directions. Officer Christopher Dyke chased Orlando and Best and observed them both remove and throw their jackets to the ground as they ran. When the two men split up, Officer Dyke followed Orlando and caught him, while another officer recovered Best’s jacket. Meanwhile, Simms, who had been running in a different direction, was chased down by Officer Jeremy Bank and eventually surrendered. Officer Daniel Egbert saw Bost flee from the van and pursued him, but was unable to catch him. Best and Bost were both later apprehended by the police in connection with the murders. At the scene of the South Capitol Street shooting, the police found the dying and injured victims “piled up on top of each other.” Brishell Jones, Devaughn Boyd, and William Jones died from their injuries, while six others survived their injuries, but one of whom suffered a severe brain injury- D. Government’s Evidence of the Crimes At the subsequent joint trial of the five co-defendants,7 the government presented considerable evidence linking all five appellants to one or both of the mass shootings. The government’s strongest evidence in proving its case, included: 1. Testimonial.Evidence Testimony from Nathaniel Simms regarding both conspiracies: Simms testified as a government witness to the events leading up to and during the three shoot-ings on Alabama Avenue, at the Wingate Apartment complex, and on South Capitol Street. Simms testified that, around midnight on March 22, 2010, he, Orlando, and Best gathered firearms and drove to Alabama Avenue after learning that Sanquan had been robbed. -Simms testified that he stayed in the car, while Orlando, Best and Sanquan approached a group on Alabama Avenue and opened fire. With regard to the shooting on March 30 on South Capitol Street, Simms testified that he, Orlando, Bost,'- and Best had planned to shoot Howe’s associates in retaliation for the prior shooting of Orlando. He' testified that, before the South Capitol Street shooting, the four of them rode in a minivan to the Wingate Apartment complex, where Bost and Best unsuccessfully attempted to rob Nelson of ’his firearm. Simms further testified that he, Orlando, Bost and Best then rode to South Capitol Street, where he, Bost, and 'Best all fired weapons into a crowd of people wearing remembrance shirts for Jordan Howe. Best’s confession to Martaraina Salazar: The government presented, testimony from Martaraina Salazar, Simms’s girlfriend, that, at about midnight on the night of the South Capitol Street shooting, Best came to her home and picked up a bag that Simms had left there. Salazar testified that Best. later returned and, as they smoked marijuana, he told her details of the shooting. He told her that Simms shot the AK-47 while Bost shot the .45 pistol, that Orlando drove the van, and that a girl had been shot in the head. Best also told Salazar that he hoped that Orlando and Simms would not implicate him. Salazar testified to Best’s confession at trial. Best’s confession to his mother and arrest: On April 22, 2010, police executed a series of search warrants based in part on the information the officers received from Simms. One of the searches was conducted at the home of Best’s mother, Laverne Best. Best called and told his uncle about the search and his uncle picked him up. Best denied any involvement in the shootings to his uncle, but was crying and nervous. Best’s uncle urged him to turn himself in, but Best got out of the car and ran away. Best’s mother Ms. Best, also spoke to Best on the phone and urged him to turn himself in, but Best refused. On April 26, police located and arrested Best. The police brought Ms. Best to the police station, where she, Best,, and a detective spoke in an interrogation room. Once the detective left the room, Best and his mother had a private conversation, which was captured on video. Ms. Best asked her son, “[Y]ou didn’t hurt no one, huh?... Did you?... Huh?... So that’s true out there, huh? Huh?” There was a dispute as to whether Best nodded in response, but the recording of the conversation demonstrated that Best did appear to slightly lower his head and raise it back up, and then look at his mother and move his head again. After this non-verbal response, she asked him, “What for? Cause he shot Orlando?” Best then started crying, lowered his head again, and asked his mother for'a hug, and she responded, “Yea Jeffrey, but I don’t know why you Would do something like that ..see what Orlando got you into.” At trial, Ms. Best was. shown the video of her conversation with her son, but she testified that she had not seen her son nod his head or admit involvement. She was impeached with her grand jury testimony, however, during which Ms. Best stated that she had observed her son nod his head.8 2. Forensic Evidence Minivan: Police searched the minivan and recovered seven AK-47-type casings. Inside the front of the van, police found Orlando’s cell phone, which contained a text message from a number associated with Simms, stating “Funeral on Tuesday.” A mask and a hat containing DNA mixtures, including Orlando’s DNA, were recovered from between the front.seats. A cigarette butt containing Simms’s DNA was found near the rear passenger seat. A swab from the front passenger side door of the minivan contained a single-source partial profile, from which Bost could not be excluded. DNA testing, however, did not reveal Best’s nor Williams’s DNA inside the minivan. Clothing: A DNA sample from the jacket that Officer Dyke recovered during the chase revealed a mixture of at least three individuals; while the swabbing revealed no major contributor, the major contributor of the cutting matched Best’s DNA. A mouth cutting and forehead cutting from the mask recovered behind the church contained mixtures of at least two people’s DNA, of which Bost was the major contributor. Forensic evidence of the shell casings and bullets: Shell casings from the .380 pistol that Sanquan fired were recovered from the scene of the Alabama Avenue shooting. The AK-47 thrown during the chase following the South Capitol Street shooting also matched the casings recovered from both the scene of the Alabama Avenue shooting and the South Capitol Street shooting. The 9mm and .45 caliber casings, recovered from the shooting of Tavon Nelson, were fired by the same-weapons that left casings at the South Capitol Street shooting. 3. Record Evidence Phone Records: An analysis of appellants’ call records showed a web of completed and attempted communications between all appellants (other than Sanquan) in the months leading up to the South Capitol Street shooting on March 30, 2010. However, after the South Capitol Street shooting, Best, Bost, and Williams continued communicating, but none of the three tried to call Orlando or Simms. By April 3, 2010, all communications stopped amongst appellants’ phones. E. Convictions and Sentences On February 21, 2012, appellants were jointly tried for their involvement in either one or both of the conspiracies.9 Following a three-month trial, on May 7, 2012, the jury convicted Sanquan, Orlando, Bost, and Best of all counts. Williams was acquitted of any involvement in the first conspiracy regarding the Alabama Avenue shooting, but was convicted of lesser-included second-degree murder charges for his involvement in the second conspiracy related to the South Capitol Street shooting. On September 11,2012, Orlando, Bost, and Best were sentenced to life imprisonment without release, Sanquan was sentenced to 54 years of imprisonment, and Williams was sentenced to 30 years of imprisonment. These consolidated appeals followed. II. Pretrial Issues A. Change of Venue Orlando, joined by all appellants, argues that the trial court erred in denying his motion for a change of venue to a federal court outside of the District of Columbia, and that, in doing so, the trial court violated his constitutional right to a fair trial. 1. Additional Factual Background On January 19, 2012, Orlando filed a motion seeking a change of venue. He claimed that because of the “pervasive and irremediable adverse local pretrial publicity” regarding his charged role in the South Capitol Street murders, it was impossible for him to receive a fair trial in the District of Columbia, and that the Sixth Amendment required his case to be transferred to a-federal district court outside of Washing-, ton, D.C. Orlando claimed that Super. Ct. Crim. R. .20 (a) authorizes a change of venue for such a purpose.10 . :The trial court summarily denied Orlando’s motion to change venue during a pretrial hearing on January 27. The court later explained its decision on February-9, observing that the Court of Appeals already “has said that there is no ability for change of venue in the District of Columbia,” and that “[m]ore ... significantly” the court was “confident [that it could] pick a fair jury” for the case. The record reflects that the trial court conducted an extensive jury selection process that spanned four days, and that during- the voir dire,, the court questioned the prospective jurors regarding what, if anything, they had heard about the South Capitol Street murders, including their exposure to any media coverage of the mass shooting. Ultimately, of the selected jury, nine jurors did not recall media coverage of the shooting, while three of the jurors11 were exposed to only minimal coverage such that the court and all of the defendants12 were confident that it would not have an effect on the jurors’ ability to be fair and impartial. Further, the trial court admonished the jury both during preliminary and final jury instructions to avoid any outside publicity on.the shooting and to decide the case based solely on the evidence presented at trial. 2. Analysis The trial court did not err in denying Orlando’s motion for a change of venue because that relief is not available for- cases tried\" before the Superior Court of the District of Columbia.13 It is a fundamental Sixth Amendment right that defendants are entitled to “a fair trial by a panel of impartial, ‘indifferent’ jurors,” Welch v. United States, 466 A.2d 829, 834 (D.C. 1983) (quoting Irvin v. Dowd, 366 U.S. 717, 722, 81 S.Ct. 1639, 6 L.Ed.2d 761 (1961)), and ordinarily a change of venue is “an appropriate remedy” “[w]hen a\" threat to this constitutional protection is' posed .... ” Id. However, because the Superior Court of the District of Columbia “sits as a single unitary judicial district,” a-change of venue is not available in the District of Columbia. Id. (citing United States v. Edwards, 430 A.2d 1321, 1346 (D.C. 1981) (en banc)). Accordingly, we have said that the trial court’s denial of a motion for a change of venue is\" “required.” Id, Because it is a “fundamental” rule “in our jurisdiction that ‘no division of this court will overrule a prior decision of this court’ ” Washington v. Guest Servs., Inc., 718 A.2d 1071, 1075 (D.C. 1998) (quoting M.A.P. v. Ryan, 285 A.2d 310, 312 (D.C. 1971)) (footnote omitted), absent en. banc rehearing, the trial court’s denial of Orlando’s motion for a change of venue was likewise “required,” in this case. Welch, supra, 466 A.2d at 834. Further, Orlando’s constitutional right to a fair trial was not violated.14 “Appellant’s right to a fair'trial by an impartial jury, is not defeated ... merely because the requested remedy is unavailable.” Welch, supra, 466 A.2d at 834. “Instead, other measures must be employed to assure that appellant’s right to a fair trial is preserved.” Id. at 834-35. “[I]n the absence of' extreme circumstances, ‘the Sixth Amendment inquiry [usually] turns on the- adequacy of the voir dire.” Id. at 835 (citations omitted). In Welch, we explained: ■ [T]he test we apply in scrutinizing the effectiveness of the voir dire examinations is not whether a juror had been exposed to the facts and issues of the ease nor whether he or she has formed an opinion as to the guilt or innocence of the accused but rather whether the nature and strength of the opinion formed are such as to raise- the presumption of partiality. - Id. at 836. Key considerations in making this determination include the’ juror’s own assertion of whether he or she “is able to lay aside his or her impressions” and the trial court’s assessment of the juror’s demeanor, which is a decision “particularly within the’ province of the trial judge.” Id. (citations and internal quotation marks omitted). '''•\u0026lt;■ ' Here, admittedly, the initial pretrial publicity surrounding the South Capitol Street murders was high, which is not surprising given’the number of casualties involved. However, the record also demonstrates that the .trial court carefully ensured that appellants’ rights to a fair and impartial jury were protected through the voir dire process. Jury selection took place over the course of four days and each prospective juror was individually asked by the court about his or her knowledge of the South Capitol Street murders. The government and defense counsel for each appellant were given the opportunity to further question and strike jurors. The trial court also excused jurors who indicated that they may have been influenced by media coverage. In fact, it is noteworthy that, for such a high-profile case, of the twelve jurors eventually selected, nine had no recollection of relevant media coverage and three were exposed to only minimal coverage. All three jurors who were exposed to some pretrial publicity expressly stated that it would not influence their decision. Because we give weight to a juror’s own assertion of his or her ability to be impartial and defer to the trial court’s assessment of a juror’s credibility, we hold that the trial court’s safeguards during “voir dire served to protect the right to a fair trial by an impartial jury.” Welch, supra, 466 A.2d at 837 (citations omitted). Our conclusion is bolstered by appellants’ defense counsels’ failure to object to any of the impaneled jurors, including the ones who had been exposed to some pretrial publicity, and the fact that Orlando on appeal has not presented any evidence that the jury was actually partial. See United States v. Haldeman, 559 F.2d 31, 60 (D.C. Cir. 1976) (en banc). B. Joinder and Severance Sanquan argues that, because he was only charged with participating in the first conspiracy (the Alabama Avenue shooting), the trial court erred in joining his case with his co-appellants’ charges stemming from the second conspiracy that led to the South Capitol Street murders. Bost makes the same argument but in reverse; he argues that because he was only charged with participating in the second conspiracy, his case was misjoined with his co-appellants’ charges relating to the first conspiracy. They each claim their individual case was prejudiced by the joinder of the two conspiracies. Further, they both alternatively argue that the trial court abused its discretion by refusing to grant their motions for severance. 1. Additional Factual Background On April 20, 2011, the grand jury returned a superseding indictment that explained the government’s theory of the case, including the causal relationship between the first conspiracy and the second conspiracy. The indictment first alleged that Sanquan, Orlando, Best, Williams, and Simms conspired “to assault and kill individuals believed to be responsible for taking” Sanquan’s bracelet. Pursuant to this first conspiracy, the conspirators hunted for the individuals that Sanquan believed were responsible for the theft. Upon locating these individuals, Sanquan and his cohorts assembled and searched them for the missing bracelet and, when Sanquan could not find it, he became “infuriated” and told Orlando and Best to shoot them. Howe was killed in the ensuing hail of gunfire that also wounded V.K.M. and Lambert. Later, Howe’s godbrother, Morgan, half-brother, Hicks, and two other friends shot Orlando in retaliation for Howe’s murder. The indictment further alleged that Orlando, Best, Williams, Simms, and Bost next conspired “to assault and kill friends and associates of Jordan Howe ... in retaliation for the shooting of Orlando Carter that occurred on or about March 23, 2010 .... ” According to the indictment, Orlando “vowed to exact violent revenge and, to that end, recruited co-conspirators” Best, Williams, Simms, and Bost to assist him in killing “as many friends and associates of Jordan Howe as they possibly could .... ” The conspirators gathered as many firearms as they could find and. Orlando instructed Best and Bost to rob Tavon Nelson for his firearm. Best and Bost then shot and murdered Nelson. The conspirators then drove a rented minivan to the 4000 block of South Capitol Street, where Howe’s friends and associates were congregated in remembrance of Howe, and fired multiple weapons, leading to the death of three people and the wounding of six others. Based on the government’s theory of the case as articulated in the indictment, San-quan and Bost filed pretrial motions to declare misjoinder and, alternatively, for severance.15 The government filed a consolidated opposition to Sanquan’s and Bost’s motions, claiming principally that the joinder of the two conspiracies was proper because the first conspiracy “logically” led to the second conspiracy, and that the two conspiracies operated “so closely connected in time and place” that there was substantial overlap of evidence. The trial court denied Sanquan’s and Bost’s motions to declare misjoinder and grant severance on January 6, 2012. The court later explained its reasoning during the pretrial hearing on February. 9, stating that joinder is proper under Super. Ct. Crim. R. 8 (b) “when one offense leads logically to another,” such as “when the subsequent offense is a sequel to the initial offense.” Here, the court found the second conspiracy to commit murder was a sequel to the first conspiracy to commit murder because the “killing of Jordan Howe was the catalyst for the ... retaliatory attempt on Orlando Carter’s life” that led Orlando to conspire with others to embark on the murder of Nelson and the South Capitol Street murders. The court further noted that Sanquan’s and Bost’s motions for severance were “meritless” because they “have failed to rebut the strong presumption in favor of a joint trial after the defendants and offenses were properly joined.” Because there was -a “substantial overlap of evidence with respect to the two charged conspiracies,” the trial court explained, “severance would result in significant prejudice to the [government and the substantial expenditure of additional resources by the court.” The court cited examples of this overlap, including: (1) “the relationship among the defendants”; (2) . four individuals (Orlando, Best, Williams, and Simms) are alleged to, have participated in both conspiracies; (3) the same AK-47 assault, rifle was alleged to have been used in both conspiracies; and (4) the motive for the second conspiracy “grew out of a crime committed in retaliation for the first conspiracy.” Lastly, the court emphasized that it was “confident that the case can be tried in a way that will enable the jury to make individual determinations about the guilt or innocence of each defendant.” Accordingly, the court explained that, in its preliminary instructions to the jury, it would “point[ ] out who is or isn’t charged in the first alleged conspiracy and who is or isn’t charged with respect to Tavon Nelson, and who is or isn’t charged ... with respect to the second conspiracy.” Several steps were taken during the course of trial to ensure that the jury was clear as to the charges pertaining to each individual appellant. As the court promised, it explained in its preliminary instructions to the jury that Sanquan was not charged under, the second conspiracy and Bost was not charged under the first conspiracy, and that each defendant must be given “separate consideration.” .During Simms’s testimony, in the middle of trial, the parties also agreed that the trial court would give the following jury instruction: Any statement made by a defendant after March 22nd, 2010 is not to be used as evidence against Sanquan Carter. Sanquan Carter is not charged with any crime after March 22nd, 2010. Likewise, any statement made by a defendant before March 23rd, 2010 is not to be used as evidence against Robert Bost. The court then again instructed the jury during its closing instructions- that “[e]ach [defendant is entitled to have the issue of his guilt as to each of the crimes for which he is on trial determined by his- own conduct and from the evidence that applies to him as if he were being tried alone.” And, following the government’s rebuttal of Sanquan’s closing argument in which the prosecutor alluded to the fact that San-quan’s initial shooting “started a chain of events” that led to' the South Capitol Street murders, the trial court sua sponte gave a strongly worded curative instruction: It’s for you to determine what connection, if any, there is between the events that are alleged to have occurred at 1333 Alabama Avenue and the events alleged to have occurred at the Wingate and at South Capitol Street. But to be sure that there’s no. confusion from the argument that’s been made I want to underscore that Sanquan Carter is not charged with the conspiracy that’s alleged to have occurred between March 23rd and March 30th. He’s not charged with any of the crimes alleged to have been committed at the Wingate or on South Capitol Street, but even more fundamentally, there’s not a shred of evidence that he has any responsibility whatsoever for the events that are alleged to have occurred between March 23rd and March 30th. So I just want to underscore that. (Emphasis added). Lastly, when the jury sent a note during deliberations that it was confused about how to evaluate evidence against each individual defendant and about the co-conspirator liability instruction, by the parties’ agreement, the trial court-explained to the jury that the instructions were not inconsistent, and that, while “evidence of the ■ conduct of a co-conspirator could potentially be part of the evidence that applies to a defendant ... you are expected to evaluate the issue of each defendant’s guilt individually .,.. ” 2. Legal Principles “Joinder of two or more defendants and multiple offenses in one indictment- for trial is authorized by Rule 8 (b) Davis v. United States, 367 A.2d 1254, 1260 (D.C. 1976).16 “We employ a ‘strong policy favoring joinder’ because it ‘expedites the administration of justice’ in numerous ways.” Ball v. United States, 26 A.3d 764, 767 (D.C. 2011) (citation omitted). “Moreover, joinder is preferred in conspiracy cases .... ” United States v. Eiland, 406 F.Supp.2d 46, 50 (D.D.C. 2005) (referencing Fed. R. Crim. P. 8 (b)). That said, ,“[m]isjoinder ... is an error of law ... subject[ ] ... to de novo review.” Ray v. United States, 472 A.2d 854, 857 (D.C. 1984). Super. Ct. Crim. R. 8 (b) (“Rule 8 (b)”),17 at the time the indictment was returned, stated in full: Two or more defendants may be charged in the same indictment or information if they are alleged to have participated in the same act or transaction or in the same señes of acts or transactions constituting an offense or offenses. Such defendants may be charged in 1 or more counts together or separately and all of the defendants need not he charged in each count. (Emphasis added).18 Per the plain language of Rule 8 (b), it is not necessary that all defendants be charged in each count of the indictment for joinder to be proper, so long as all of the indicted offenses are based on “the same series of acts or'transactions constituting án offense or offenses.” Id. Thus, the key question in this appeal is whether the first conspiracy (in which Bost did not participate) and second conspiracy (in which Sanquan did not participate) can be considered a part of the “same series of acts or transactions,” such that joinder of the charges and the defendants involved in both conspiracies was proper. “Our case law establishes that separate offenses can constitute a joinable ‘series of acts or transactions’ where ‘one offense logically leads to another.’ ” Medley v. United States, 104 A.3d 115, 122 (D.C. 2014) (citations and brackets omitted).19 “An offense leads logically to another when one crime is a .‘sequel’ to the other.” Id. (citations omitted). \"Sequel\" offenses include attempts to cover-up underlying crimes, id., flight, Ball, supra, 26 A.3d at 768, or where the subsequent offense “was directly occasioned by and grew out of’ the underlying offense, Scheve v. United States, 184 F.2d 695, 696 (D.C. Cir. 1950).20 The sequel offense need not “inevitabl[y] result [from] the commission of the underlying crimes ....”. Bush v. United States, 516 A.2d 186, 192 (D.C. 1986) (emphasis added). We have said, however, that “the similarity of modus op-erandi in-each of the-crimes charged,” alone, cannot “fulfill[ ] -Rule 8 (b)’s requirement that [all] defendants be charged with having participated in a series of acts -or transactions .... ” Davis, supra, 367 A.2d at 1261 (internal quotation marks omitted); see also United States v. Suggs, 531 F.Supp.2d 13, 25-26 (D.D.C. 2008) (explaining that the analogous federal Rule 8 (b) “may not be read to embrace similar or even identical offenses, unless those offenses are related.”) (citation and internal quotation marks omitted) (emphasis in original). In short, “[t]he series of acts envisioned by the drafters of Rule 8 (b) is one in which the individual offenses are connected or interrelated in such a manner that proof of charges against one defendant would necessarily have to be introduced in proving the jointly-charged offenses .... ” Davis, supra, 367 A.2d at 1261 (emphasis added). What is or is not considered a “sequel” offense can at times be unclear, so to illustrate this distinction, the decisions in Scheve and Settles v. United States, 622 A.2d 348 (D.C. 1987) are instructive. So, too, is the Seventh Circuit decision in United States v. Velasquez, 772 F.2d 1348 (7th Cir. 1985). In Scheve, three of the four defendants sought to separate their charges of illegally operating a gambling establishment from the fourth defendant Joseph Scheve’s individual charges of assault with intent to kill and assault with a deadly weapon. 184 F.2d at 695-96. Scheve was also charged as a member of the illegal gambling enterprise. Id. The court concluded that the charges were properly joined because “[t]he assault was directly occasioned by and grew out of the gambling offense.” Id. at 696. Specifically, the evidence showed that all four defendants operated the gambling house and when the wife of Ricker, a “heavy loser,” demanded that the gambling house return some of their money, Scheve “pushed” her and then pointed a gun at Ricker and struck him with it. Id. Accordingly, the court concluded that joinder was proper because “there was an unbroken chain of causation between the defendants’ gambling business, Ricker’s losses, his wife’s demand for return of some of the money, Joseph Scheve’s assault on her, Ricker’s apparent attempt to intervene, and Scheve’s assault on Ricker.” Id.21 Likewise, in Velasquez, the Seventh Circuit considered, among other issues, whether charges stemming from one conspiracy to sell cocaine in Chicago were misjoined with a second conspiracy to retaliate against an informant who was initially part of the cocaine conspiracy as part of the “same series of acts or transactions.” 772 F.2d at 1353. The court reviewed case law pertaining to federal Rule 8 (b) and concluded that including the second conspiracy to retaliate against the informant, “[a]s a conspiracy and its coverup are parts of a common plan,” would pose “no possible problem of misjoinder if the government’s argument had any factual basis .... ” Id. at 1354 (citation omitted).22 In contrast, this court concluded in Settles that the two co-defendants’ charges stemming from the first incident of armed rape were misjoined with their charges relating to the second incident of rape, and accordingly, reversed the defendants’ convictions. 522 A.2d at 349. In Settles, the government indicted the co-defendants for committing two brutal rapes, the first on April 7, 1984, and the second, ten days later on April 17. Id. at 350. Although the two attacks shared some of the same violent characteristics, the victims were different and there was no real overlap of proof between the two offenses. Id. at 351, 353. On appeal, they argued that the April 7 offenses were misjoined with the April 17 offenses.23 This court agreed, concluding that .the April 7 charges “were not ‘based on the same act or transaction or series of acts or transactions’ as the April 17 charges.” Id. at 352. Specifically, the court concluded that the attack on the second victim on April 17 was “not a necessary continuation of the abduction and rape of [the first victim] ten days before, and in no way did it logically or necessarily result from the earlier incident. Rather, the evidence makes clear that the two incidents were entirely unrelated.” Id. at 353. The court further found instructive that the government “presented its evidence at trial separately and distinctly, with no actual overlap of proof, between the two offenses,” that the .“two incidents were not closely connected in time or place,” and “there [was not] any real congruence between the two incidents, but only a few superficial similarities.” Id.; see also Davis, supra, 367 A.2d at 1263 (concluding that the counts were misjoined because “there [was] no logical development of or relationship between the offenses because no crime necessarily led to or caused the subsequent offenses”).24 Even if we were to conclude that joinder of the two conspiracies was proper under Rule 8 (b), “severance may still be necessary under Super. Ct. Crim. R. 14 (“Rule 14”), which protects parties from ‘manifest prejudice as a result of being tried -jointly.’ ” Medley, supra, 104 A.3d at 122 (citations omitted).25 However, since there is- a “strong presumption” “when two or more defendants are charged with jointly committing a criminal offense ,.. that they will be tried together,” Bush, supra, 516 A.2d at 192, a party seeking severance has the heavy burden of showing the “most compelling prejudice.” Medley, supra, 104 A.3d at 122-28 (citations and internal quotation marks omitted). “Some amount of prejudice will be permitted in favor of judicial economy and the concomitant expedition of cases,” id. at 123 (citation omitted), and a “defendant is not entitled to severance merely because the evidence against a [co-defendant] is more damaging than the evidence against him.” Bush, supra, 516 A.2d at 192 (citation and internal quotation marks omitted). Rather, a defendant is entitled to severance only if his or her “complicity in the overall criminal venture is de minimis when compared to the evidence against his [co-defendants].” Id, (citation; internal quotation marks, and italics omitted). 3. Analysis of Joinder Sanquan and Bost argue that the trial court wrongly concluded that the shooting of Howe “logically” led to the South Capitol Street murders because the two incidents were standalone crimes, and that the majority of the government’s proffered evidence was unique to each incident. They also argue that the South Capitol Street murders only occurred as a result of the attempt on Orlando’s life by Howe’s friends, and that “[a]n uncharged offense committed by individuals other than those named' in the indictment cannot serve as the exclusive basis for joining two otherwise unrelated conspiracies in one indictment.” Ultimately, the issue boils down to whether the relationship between the two conspiracies is more akin to the “unbroken chain of causation” of events as seen in Scheve or more like the . “unrelated” incidents that this court addressed in Settles. This issue is not necessarily an easy one; many of the facts alleged in the government’s indictment here are similar to the facts in cases where we have concluded that joinder was improper. For example, in Settles, we emphasized that the “two incidents were not closely connected in time or place” because they occurred a week apart from one another. Settles, supra, 522 A.2d at 353. Further, the two incidents in Settles “involved different victims.” Jackson, supra note 19, 623 A.2d at 580. Yet, there is one critical difference between the facts of this’ case and the facts involved in our previous cases, such as in Settles, Davis, and Jacks.on, in which we concluded that there was misjoinder under Rule 8 (b). In each of those cases, the defendants were alleged to have committed several operationally similar, but ultimately isolated and unrelated crimes.26 Rule 8 (a) allows for the joinder of offenses where a single defendant is charged with multiple crimes that are of “the same or similar character or are based on the same act or transaction .... ”, Rule 8 (b), on the other hand, pertains to the joinder of defendants. The similarity of the modus operand! for each criminal incident cannot fulfill the requirements of Rule 8 (b), Jackson, supra note 19, 623 A,2d at 580, and the fact that the same group of individuals may have committed multiple crimes of the “same or similar” nature, without more, is insufficient for purposes of joining the defendants and offenses under Rule 8 (b). In other words, in those misjoinder cases there was “no logical development of or relationship between the offenses because no crime necessarily led to or caused the subsequent offenses.” Davis, supra, 367 A.2d at 1263. This case is different. Unlike the indictments in Settles, Davis, or Jackson, the shooting of Howe and the shootings of Nelson and the individuals on South Capitol Street cannot be considered isolated or “entirely, unrelated.” Settles, supra, 522 A.2d at 353. Rather, the indictment alleges “an unbroken chain of causation,” Scheve, supra, 184 F.2d at 696, from the theft of Sanquan’s bracelet, to his retribution that led to the death of Howe, to Howe’s friends immediately seeking revenge by shooting Orlando, to Orlando’s plan to kill “as many friends and associates of Jordan Howe as they possibly could,” and lastly to the execution of his plan. While Howe’s friends attack on Orlando may not have been an “inevitable result,” it is fair to characterize it as a sequel to the Alabama Avenue shooting. Bush, supra, 516 A.2d at 192. The chain of events here is also akin to the second retaliatory conspiracy alleged in Velasquez, which the Seventh Circuit concluded would have been a permissible basis for joinder. 772 F.2d at 1354. Further, “[t]here is nothing in the language of the rule itself which requires that a person participate in more than one phase of a ‘series’ of acts to come within the rule’s coverage.” Bush, supra, 516 A.2d at 191. The “sequel” conspiracy in this case took place a week after the underlying offense occurred, rather than mere minutes such as in Scheve, supra, 184 F.2d 695, or Ball, supra, 26 A.3d 764. However, while close spatial and temporal connection between the two . offenses may be a consideration, it is not the only or determinative element. See, e.g., Medley, supra, 104 A.3d at 120 (joinder is proper where the two assaults involving the same victim transpired “a year apart from each other”).27 Further, there was a close connection between the victims of the two conspiracies — -the intended targets of the South Capitol Street murders were the relatives and friends of Howe, who was the victim of the first conspiracy. In addition, the co-conspirators murdered Nelson for the specific purpose of stealing his weapon in order'to carry out the drive-by shooting on South Capitol Street. Both Sanquan and Bost attempt to distinguish this case by arguing that there existed an intervening event — the attempt on Orlando’s life by Howe’s friends — that broke any chain of causation between the two'conspiracies. Scheve defeats this argument. In that case, like here, there existed an intervening event between the charge of operating an illegal gambling' house and the subsequent assault — Rick-er’s wife’s attempt to demand her husband’s money back. 184 F.2d at 696. We have further stated that the subsequent offenses nbed not “inevitablíy] result [from] the commission of the underlying crimes” for the offenses- to be a “sequel to those crimes.” Bush, supra, 516 A.2d at 192 (emphasis added).28 Howe’s murder may not have “inevitably” led his friends to attempt to kill Orlando, thereby provoking Orlando to organize the South Capitol Street murders, but we conclude that Howe’s murder did ultimately “lead” to Orlando’s revenge plot, and accordingly, the latter was a “sequel” to the first crime. Bush, supra, 516 A.2d at 192. Ultimately, we conclude that join-der of the two conspiracies was not improper because the second conspiracy can be considered a “sequel” to the first conspiracy, and therefore part of the same “séries of acts or transactions.” Super. Ct. Crim. R. 8 (b). Having concluded that join-der was not improper, we must next decide whether, nonetheless, appellants’ motions for severance should have been granted.29 4. Analysis of Severance While the trial court has broad discretion to grant or deny severance under Rule 14, Bailey v. United States, 10 A.3d 637, 642 (D.C. 2010), “a disparate quantum of evidence” against each co-defendant “may conceivably require a severance under some circumstances.” Sousa v. United States, 400 A.2d 1036, 1041 (D.C. 1979) (citations and internal quotation marks omitted). Severance should be granted “only where the evidence of a defendant’s complicity in the overall criminal venture is de minimis when compared to the evidence against his [co-defendants],” Bush, supra, 516 A.2d at 193 (italics omitted), or when failure to do so would “violate a defendant’s right to due process and a fair trial,” such as when co-defendants “present conflicting and irreconcilable defenses and there is a danger that the jury will unjustifiably infer that this conflict alone demonstrates that both are guilty.” Sweet v. United States, 438 A.2d 447, 451 (D.C. 1981) (citation omitted). In this case, Sanquan’s and Bost’s sole argument as to why their respective motions to sever should have been granted is that their individual cases were prejudiced by admission of evidence of unrelated conduct and offenses; for Sanquan, it is evidence of the second conspiracy, including the South Capitol Street murders, for Bost it is evidence of the first conspiracy that led to Howe’s murder. However, it is well-established that severance is not required “just because a significant portion of the government’s trial evidence is applicable only to [his co-defendants].” Rollerson v. United States, 127 A.3d 1220, 1230 (D.C. 2015) (citation omitted). Moreover, both Sanquan and Bost were active participants in conspiracies to commit first-degree murder, so we cannot say that either of appellants’ “complicity in the overall criminal venture is de min-imis when compared to the evidence against his [co-defendants].” Bush, supra, 516 A.2d at 193 (italics omitted). Specifically, Sanquan was the mastermind behind the first conspiracy that led to Howe’s murder — Sanquan gathered the co-conspirators together for the purpose of finding and killing the person who stole, his bracelet. Bost, likewise, was an active participant in both the South Capitol Street murders and Nelson’s murder; in fact, the evidence showed that he intentionally shot and killed Nelson in an attempt to rob Nelson of his weapon. Lastly, the evidence presented of both conspiracies was not “so complex or confusing that the jury could not make individual determinations about the guilt or innocence of each defendant.” Rollerson, supra, 127 A.3d at 1231 (citation and internal quotation marks omitted). The record further demonstrates that the trial court made efforts to ensure that the jury was not confused about the charges. For example, it reminded the jury on several occasions that Sanquan was not charged with participation in the second conspiracy and Bost was .not charged with participation in the first conspiracy. The court also instructed the jury that no statement made after March 22, the date of the first conspiracy, could be used against Sanquan, and no statement made before March 23, the date the second conspiracy began, could be used against Bost. Lastly, the court gave a strongly worded curative instruction to the jury after the prosecutor’s rebuttal argument, in which the court stressed to the jury that Sanquan could not be held responsible for the South Capitol Street and Nelson murders. Given both Sanquan’s and Bost’s active participation in the first and second conspiracies, respectively, and the trial court’s instructions intended to limit jury confusion, we hold that the trial court did not abuse its discretion when it denied Sanquan’s and Bost’s motions to grant severance.30 III. Issues Arising During Trial A, Prosecutor’s Statements During Opening and Closing Appellant Williams (joined by all other appellants on appeal) argues that the trial court erred in denying his motions for a mistrial based upon alleged improper statements made by the prosecution during its opening statement and initial closing argument. 1. Opening Statement In its opening statement, the prosecution referred to the inscription on the Supreme Court building, “Equal Justice Under Law,” and emphasized to the jurors their role in enforcing the laws. While the prosecution was discussing this theme, the trial court sua 'sponte instructed the prosecution, “I [ ] want you to focus on what the evidence is going to show; this is not a closing argument” and gave the same instruction again in response to an objection by the defense. The prosecution obliged, but at times continued with its theme of asking the jurors to enforce the rule of law and emphasized that “vigilante justice” occurs “when individuals take the law into their own hands.” During a break in the prosecutor’s opening statement, the trial court responded to all objections .raised by the defense. Williams’s counsel went a step further by moving for a mistrial, arguing to the court that the prosecution’s “public policy” theme was improper. The trial court denied Williams’s motion, but acknowledged the merits of the objections and reminded the prosecutor twice that the court had to interject and ask him not to make arguments. The trial court clarified that the references to the inscription on the Supreme Court were improper and cautioned the prosecutor not to make further references. - During a second break in the opening statement, the trial court sustained defense counsel’s objection to the prosecution’s statement that its role was to “fairly enforc[e] the criminal laws,” and thus, the government would not ignore the retaliatory shooting against Orlando. The trial court stated that it would allow the prosecution; “a little bit of leeway” in describing its role in that way,’ since the prosecution would later be calling Jordan Howe’s god-brother, Morgan, as a government witness. ' Once the prosecution completed its opening statemént, Williams’s’ counsel requested a curative instruction from the court to address the “emotional nature” of some of the prosecution’s opening statement. The prosecution did not object to the instruction, but stated that it did not believe the instruction-was necessary and that if the court would give one, it requested’that the instruction be given after all of counsels’ opening statements. The trial court agreed that the instruction would be appropriate due to some emotional reactions in the courtroom during the prosecution’s opening statement’ and the court stated that it would give the instruction after all of the opening statements. The trial court gave the following instruction to the jury after opening statements: “Ladies and gentlemen, this case may evoke emotions from witnesses and others. I want to remind you that you are to base the verdicts in this case on the evidence and the law as I instruct you[,] not ... on emotions.” 2. Closing Argument Additionally, Williams takes issue with several statements made by the prosecution during its initial closing argument, as well as the prosecution’s use of a photograph. While there were several objections raised by the defense, none of the defense counsel moved for a mistrial during the prosecution’s closing argument. Williams argues that the trial court should have sua sponte declared a mistrial due to improper comments made by the prosecution. Williams claims the following comments by the prosecution during its closing argument were improper. First, Williams argues that the prosecution’s characterization of certain government witnesses as “heroes” was improper. During its closing, the prosecution stated that the actions of government witness Michael White, who testified that, he came forward to police officers with information about the South Capitol Street shooting because he was tired of the violence, was “heartening.” Williams’s counsel objected to this characterization, but the trial court did not respond. The prosecution also stated- that Antonio Alston, Williams’s cousin, who came forward and exonerated a juvenile that MPD officers had initially mistakenly identified as the driver of the minivan in the South Capitol Street shooting was a “hero” and to “bless him for that.” The prosecutor stated further, “[i]f we’re not about truth and we’re not about justice, then we’re not about anything.” Later the prosecution told the jury that Alston was doing “God’s work” upon which defense counsel objected, and the trial court sustained the objection. Second, Williams argues the prosecution’s statements that the jury should be “proud” of how MPD conducted its investigation, were improper. The prosecution also asked the jury if they would have had the police stop the investigation after Orlando and Simms had been chased down. The defense objected, and the trial court called all defense counsel to the bench to address their objections simultaneously. The trial court ruled that because there were attacks by the defense on the police’s investigation of the case, the government could “comment on the quality -of the investigation,” but also acknowledged that the prosecution should not suggest that the jurors should show their appreciation for the police department though their verdicts. The court gave a curative instruction, recommended by the defense, that the jury should “determine' the facts in [the] case without prejudice, fear, sympathy or favoritism,” but the court also balanced this instruction with a statement that it is proper for the attorneys to comment on the quality of the police investigation. Third, Williams challenges the prosecution’s use of the photograph of .one of the victims, William Jones, lying dead at;the scene of the South Capitol Street shooting, during its closing argument. For context, prior to trial,-Williams’s counsel objected particularly to the government’s use of this photograph of Jones. The government responded that the photograph was appropriate to support an inference of intent to kill by the appellants who used high power weapons, like the AK-47. The court ultimately found the photograph admissible to meet the government’s burden of proof, but noted it would reconsider “if suddenly there [was] a whole mass of these same photographs over and over and over again.” Defense counsel challenged the prosecution’s use of the photograph as an exhibit in its closing argument, asserting that* the photograph was blown up and was provoking an emotional reaction from the audience. The trial court overruled the objection, finding that although someone in the audience left the courtroom because of an emotional response to the photograph, the prosecution had used the photograph, not .to evoke emotion, but for a “legitimate purpose” of showing the power of the AK-47. Williams now essentially makes the same argument on appeal: that the prosecution’s use of the photograph of Jones prejudiced the defense because the prosecution, “intentionally showed that graphic [photograph] ... when other more appropriate ones were available ... simply for its ... emotional impact upon the jury.” Finally, Williams states that the prosecution’s final statement to the jury during its closing that “[t]he families here are not asking you for vengeance. They’re only asking you for justice,” was improper. 3. Legal Principles “The purpose of an opening statement is to give the broad outlines of the case to enable the jury to comprehend it.” Bailey v. United States, 831 A.2d 973, 981 (D.C. 2003) (emphasis added) (citation, internal quotation marks, and brackets omitted). Therefore, “an opening statement should not be argumentative, nor should it appeal to the passions and sympathies of the jury.” Id. at 981 (internal citation omitted). However, in closing argument, counsel is permitted to make arguments and commentary “as long as it is in the general nature of argument, and not an outright expression of opinion.” Burgess v. United States, 786 A.2d 561, 571 (D.C. 2001) (emphasis added) (citation and internal quotation marks omitted). Both “the scope and extent of [an] opening statement,” as well as “[t]he regulation of closing argument” are left to the discretion of the trial judge. Jennings v. United States, 431 A.2d 552, 560 (D.C. 1981); Anthony v. United States, 935 A.2d 275, 283 (D.C. 2007). Therefore, regarding the issue of an improper statement by counsel during an opening statement or closing argument, “[t]he question of what, if any, remedial action is appropriate is committed to the trial judge’s discretion ... ‘and we do not lightly overturn [its] discretionary rulings.’” Simmons v. United States, 940 A.2d 1014, 1024-25 (D.C. 2008) (footnote omitted). When evaluating claims of prosecutorial error, we must first determine whether the challenged statements from the prosecutor, viewed in context, were, in fact, improper. Bailey, supra, 831 A.2d at 981. If the statements were improper and the claim was properly preserved at trial, a reversal is only warranted if the statements caused “substantial prejudice.” Freeman v. United States, 689 A.2d 575, 584 (D.C. 1997). “The applicable test for prejudice is whether we can say, ‘with fair assurance ... that the judgment was not substantially swayed by the error.’” Anthony, supra, 935 A.2d at 284 (citations omitted); see Kotteakos v. United States, 328 U.S. 750, 765, 66 S.Ct. 1239, 90 L.Ed. 1557 (1946) (announcing the harmless error standard). The four factors to be considered when determining prejudice are “ T) the gravity of the impropriety, 2) its relationship to the issue of guilt, 3) the effect of any corrective action by the trial judge, and 4) the strength of the government’s case.’ ” Fearwell v. United States, 886 A.2d 95, 102 (D.C. 2005) (citations omitted); see also Bailey, supra, 831 A.2d at 981. 4. Analysis The statements made by the prosecution during its opening statement and closing argument can be addressed in tandem. Williams argues that this court must consider the cumulative effects of the prosecutor’s statements, instead of reviewing the statements in isolation. The government argues that the prosecution’s references to the inscription at the Supreme Court were merely a statement of the government’s theory of the case, and thus were not improper. The government also argues that the prosecution’s statements during closing argument were all permissible forms of argument. a. Statements in Opening Statement To begin, the prosecution’s thematic discussion of “Equal Justice Under Law,” and its comments that the defendants had taken the law into their own hands, did not appear to cross the line of permissible opening statements, as the comments were not argumentative. See Bailey, supra, 831 A.2d at 981. However, even if the comments were improper, in the context of this case, the prosecution’s elaboration on this theme was not so grave as to warrant a mistrial. The statements came at the beginning of a long line of opening statements by counsel, in a three-month long trial, and were only statements enunciating a theory of the case, not statements specifically “related to the evidence in the cape.” Id. at 985, Williams makes no specific argument on appeal as to how the statements may have affected the outcome of the trial. See id. (“Appellant has not persuaded us that [the prosecutor’s improper statements] made any real difference in the outcome of the proceedings.”). Moreover, the trial judge was attentive to defense counsel’s concerns and objections, and even interjected sua sponte to instruct the prosecution “to focus on what the evidence is going to show” and not to give a closing argument. See id. at 986; see also Wright v. United States, 508 A.2d 915, 921 (D.C. 1986) (“[T]he court may curtail an opening statement that becomes argumen-' tative or inflammatory.”) (citation omitted). Accordingly, the trial court’s decision not to grant Williams’s motion for a mistrial due to the government’s opening statement was proper, especially because “a mistrial is a severe remedy ... one to be taken only in circumstances manifesting a necessity therefor.” Trotter v. United States, 121 A.3d 40, 53 (D.C. 2015) (brackets, footnote, and internal quotation marks omitted). It was well within the trial court’s discretion to decide, alternatively, to give a curative instruction to the jury to “base [their] verdicts ... on the evidence and ... not ... on emotions” and defense counsel all agreed to this instruction. See id. at 54 (“The trial court was in a position to evaluate the impact of the prosecutor’s [] comments and the likely efficacy of a curative instruction.”) (footnote and internal quotations omitted). b. Statements and Use of a Photograph in Closing Argument Similarly, the statements made by the prosecution during its closing argument did not warrant a mistrial. First, the prosecution’s references to the quality of the police investigation and its statements that the jury should be “proud” of MPD officers were not improper when considered in context. The prosecutor is allowed to respond to defense counsel’s attacks regarding the quality of the police investigation during trial because “it is in the general nature of argument, and not' an outright expression of opinion.” See Burgess, supra, 786 A.2d at 571 (quoting Irick v. United States, 565 A.2d 26, 36 (D.C. 1989)). For example, in Bailey, a prosecutor glorified a police, investigation and his “heroism” in its opening statement and this court held that, while the statements “came close” to the limits of permissible comment, they “did not cross the line, nor ... warrant a mistrial.” Bailey, supra, 831 A.2d at 983. The prosecutor’s references in this case to government witness Alston as a “hero”- and to government witness White’s actions as -“heartening” are similar. Especially in light of the latitude afforded to counsel during closing argument, such statements were not impermissible characterizations in response to defense counsel’s cross-examinations of those witnesses. Additionally, the statements did not- urge the jurors to place themselves “in the position of the victim,” nor did the statements rise to the level of an appeal “to the jury’s emotions.” See Tyree v. United States, 942 A.2d 629, 643 (D.C. 2008) (“This court has repeatedly cautioned that it is improper for the prosecutor to seek to place the jurors in the position of the victim.”). Next, while the prosecutor’s final comment during closing argument that “the families here are not asking you for vengeance. They’re only asking you for justice,” may have appealed' to the sympathy of the jurors, the prosecution did not cross the line by asking the jurors to “send a message to the defendant^]” or to the community with their verdicts, which is “something we have repeatedly condemned.” Bailey, supra, 831 A.2d at 984 (internal quotation marks omitted). Again, Williams has not alleged any specific prejudice that flowed from this final statement in the context of a three-month long trial and lengthy closing arguments by all counsel. See id. at 985 (finding that the prosecutor’s improper comments were not severely prejudicial, as they were made, in a “long closing, argument, after a . long trial, and they were not related to the evidence in the case”). . , . Finally, Williams’s challenge to the prosecutor’s-use of the photograph of William Jones during its closing argument is unavailing. The photograph was admitted into evidence, and as the trial court noted, the photograph was used by the prosecutor to show the high power of the AK-47 to infer appellants’ intent to kill. See Jones v. United States, 27 A.3d 1130, 1142 (D.C. 2011) (“The admission of photographs is within the sound discretion of the trial judge.”) (citations and internal quotation marks omitted); see also Leasure v. United States, 458 A.2d 726, 728 n.2 (D.C. 1983) (holding that the trial court did not abuse its discretion in admitting photographs of the murder victim, as they had probative value, in confirming the identity of the victim, the location of the offense, the cause of death, and appellants’ malice and premeditation”) (internal citations omitted), B. Technical Issues With Husher Orlando, claims that he is entitled to a new. trial because, throughout trial, the courtroom “husher” failed to work properly and exposed the jury to prejudicial and extra-judicial information. He acknowledges, however, that his defense counsel did not raise the husher issue during trial, and that his counsel never made any assertions before the trial court that certain statements may have been 'overheard by the jurors during-bench conferences. Nevertheless, Orlando requests that this court' presume prejudice (1) due to the husher not working properly on at least two occasions within a two-week period of the trial, and (2) because the'judge did not conduct a hearing to determine if the jurors overheard any statements during bench conferences. 1. Additional Factual Background On February 16, 2012,, five days prior to the start of trial, the trial court explained to the jurors, “[t]he [purpose] of the bench conferences is so you won’t hear what we’re talking about. So please don’t try to read lips whenever we’re using them.” On the first day of trial on February 21, during a bench conference, the trial court indicated to one of the courtroom technicians, “Everybody’s able to hear me when I’m talking with the hushers.” Afterwards, the court called all counsel to the bench .and stated, “I think we have the hushers amped up now, so maybe it’ll work,” and then asked for those in the courtroom to let her know if they could hear the court when the husher was on. No one notified the court that they could hear the bench conferences that day. However, approximately two weeks , later, on March 1, during a bench conference, a juror notified the court that the juror could “almost hear [the bench] conversations sometimes ...(emphasis added). The court responded, “Thank you for letting me know” and told someone in the courtroom “the jurors are able to hear when the husher’s on, so we need to get that adjusted at our break, if we could.” The juror clarified ■ that, “It’s just some tones to the conversations. We’re trying not to [hear],” and the court responded, “Right. But I appreciate you telling me that. So thank you. It’s important to have private conversations here.” On March 7, the trial court stated, presumably to a courtroom technician, “Apparently the husher is still a bit of a problem. It is not being loud enough. If you could, during a break, adjust it, I would appreciate that.” The court advised counsel that they “need[ed] to talk very quietly if [they] are doing something at the bench because of it.” During bench conferences that day, no party suggested any further problems with the husher. On March 14, the court asked jurors if the husher was now effective and a juror responded that, “There just needs to be one more speaker.” The trial court then stated, “Okay. We’ll try to talk more quietly. If you can just raise your hand if . you’re hearing us. Thank you. But do make an effort not to listen.” The record does not show that any juror thereafter .raised a hand to indicate a further problem. During a bench conference later that day,.counsel and the court repeatedly reminded each other to keep their voices down. No counsel ever objected or made any requests to the court about the husher. On appeal, Orlando argues for the first time that the jurors were likely able to hear two bench conferences in particular. First is a. bench conference in which the trial court admonished Orlando’s trial counsel for “showboating?’ before the jury. Second is a bench conference during which Orlando’s counsel sought assurance from the prosecution that it would not elicit any testimony from government witness Ronald Ray that Orlando may have shot at Ray or-may have been involved with other persons Shooting at Ray; The first bench conference occurred on March 1, the'same day that the juror first alerted the court to a problem with the husher. During this conference, the trial court admonished Orlando’s counsel for doing “a big raising eyebrow thing in front of the jury” after the court’s rulings, and told counsel, “I don’t want you to be showboating in front of this jury by raising your eyebrows[.]” The judge pointed out to Orlando’s counsel, “there’s been twice in this trial now where after I ruled, you made a big show” and that she was “only using [the] opportunity to say [that] at the bench because [she didn’t] want to, repeat it.” The second bench conference occurred later that same day, immediately prior to government witness Ray’s testimony, where Orlando’s counsel stated to the court and the prosecutor, “I know that there’s some reference in some of the documents that ... Ray was of the thought that .,. Orlando .,. had something to do with someone shooting at him. I just wanted to make sure that [the prosecution was not] seeking to elicit any of those things.” The prosecutor responded, “I am not going to try to elicit those” and further stated that he did not intend “to get into anything [regarding Ray’s]. thoughts, as [Ray] said in the grand jury, that perhaps Orlando ... might have shot at [him].” 2. Legal Principles The trial court “has an obligation to investigate a plausible claim that the jury has been exposed to extrinsic evidence.” Garrett v. United States, 20 A.3d 745, 748 (D.C. 2011). Accordingly, “when it is alleged that a jury has been exposed to extrinsic evidence, the trial court should inquire as to the nature of the evidence and how the jury came to be exposed to. it.” Id. In circumstances in which “the impartiality of a juror has been plausibly called into question, it is the responsibility of the trial judge to hold a hearing to determine whether the allegation of bias has merit.” Medrano-Quiroz v. United States, 705 A.2d 642, 649 (D.C. 1997). However, “[a] trial judge [ ] does not need to engage in an inquiry when an allegation of [] reliance on extrinsic evidence is speculative.” Garrett, supra, 20 A.3d at 749. Orlando cites to Garrett and (Donald) Young for support. Garrett involved a juror note in which the jury asked the court if it could consider a statement a witness had muttered while on the stand, which was not in response to questioning by counsel. Id. at 747. Over the defense’s objection, the trial court sent back a note stating “yes,” without any inquiry into details of what the jury was referring to by “muttered utterance” because the court did not want to violate the jury’s deliberation process. Id. at 747. This court held that the trial court had abused its discretion because after receiving the jury note, the court had “an obligation to investigate” and to “inquire as to the nature of the [extrinsic] evidence and how the jury came to be exposed to it.” Id. at 748-49. In (Donald) Young, the trial court repeatedly criticized Young’s defense attorney throughout trial, often during the defense counsel’s cross-examination of government witnesses. (Donald) Young v. United States, 346 F.2d 793, 795 (D.C. Cir. 1965). Following the trial court’s “severe criticism” of the defense attorney at bench conferences, the defense attorney notified the court the following day that a “number of bystanders” had informed him that they overheard “all of [those] bench conferences,” and the defense moved for a mistrial. Id. The court did not grant the defense’s request for a mistrial and simply stated in response, “[tjhere will be no more bench conferences,” Id. at 796. The D.C. Circuit held that the “court’s continual intervention” during the defense’s cross-examinations may have precluded the defense counsel from “devotfing] his best talents to the defense of his client.” Id. at 794-95 (internal quotation marks and citation omitted). The court further held that the trial court should have held a hearing to determine “whether counsel could produce witnesses to substantiate his allegations,” and that it was not confident that the jury did not hear the court’s remarks. Id. at 796. 3. Analysis This case is distinguishable from both Garrett and (Donald) Young because, here, neither Orlando’s trial counsel nor other defense counsel ever asserted to the trial court that the jury overheard certain statements made during bench conferences. Still, Orlando asserts on appeal that “jurors could overhear extremely prejudicial comments.” This claim is speculative without any record support that the jury actually overheard statements from either of the bench conferences that Orlando discusses. In fact, the record indicates that the trial court was very attentive to the husher issue, and repeatedly sought to ensure that the husher was working properly and to mitigate any concern. Specifically, the court instructed the jury not to try to overhear the bench conferences, informed the courtroom technician at least twice that the husher needed to be fixed, reminded counsel to speak quietly at bench conferences, and asked the jurors to notify the court if they could hear the bench conferences. Thus, the trial court carefully ensured that the jury was not exposed to “extrinsic evidence” from the bench, and there was no evidence that the jury, in fact, was exposed to or overheard any of the comments made during the bench conferences. Furthermore, the defense counsel never made any allegations or raised any concerns to the trial court that the jury may have overheard certain conversations at the bench. In such an instance where the trial court acted carefully in light of the issue with the husher, and given the lack of evidence that the jury actually overheard anything, the trial court did not have a duty to sua sponte inquire as to whether the jurors overheard the bench conferences that Orlando references here on appeal. Accordingly, we reject Orlando’s claim that the issue with the hush-er requires reversal of his convictions and a new trial. C. Statements Against Penal Interest Best argues that his video confession to his mother and his verbal confession to Salazar were both improperly admitted at trial as statements against his penal interest. Best claims that in admitting the statements, the trial court improperly applied prongs one and three under the Laumer standard, which governs the admission of statements against penal interest. See Laumer v. United States, 409 A.2d 190 (D.C. 1979) (en banc).31 Specifically, with regard to Best’s video confession to his mother, Best argues that the trial court improperly applied prong one of the Laumer standard because the' court failed to identify a particular statement made by Best, and instead only based its ruling on non-verbal responses from Best to Ms. Best, which did not rise to the level of “unambiguous assent” to Ms. Best’s statements. He also contends that it is unclear whether his non-verbal and verbal communications amounted to a confession, as opposed to a variety of other “plausible explanations” for his conduct. Best also argues that his gestures to his mother were untrustworthy as statements against his penal interest under prong three of Lau-mer because the gestures were subject to a non-incriminating interpretation — i.e., that he had dropped his head and cried to his mother, not out of an admission of guilt, but instead because he was upset that his mother had taken the side of the police. With respect to Best’s verbal confession to Salazar, Best argues that under the first prong of the Laumer standard, the trial court improperly concluded that Best made the reported statements to Salazar. Best also argues that his alleged statements to Salazar were untrustworthy under prong three of the Laumer standard because the statements were contradicted by evidence at trial. 1. Additional Factual Background a. Admission of Video Prior to trial, the court considered whether the video of Best’s non-verbal interactions with his mother should be admitted as a confession. The trial court ultimately concluded that Best made a statement against penal interest to his mother, stating that Best was not “simply silen[t]” in the video, but instead he and his mother were communicating with one another non-verbally. The court further stated, “There are nods[,] .... [Best’s] weeping, his asking to be hugged, the whole set of communications!;.]” The court also noted that the video shows Ms. Best’s own assessment of her son’s communication to her, which she understood as Best saying that he had been involved in the shootings. The court considered the defense’s assertions that Ms. Best had been misled by leading questions when she testified to the grand jury that her son had admitted his involvement to her. However, the court found that Ms. Best’s statements to the. grand jury corroborated the videotape. The trial court also stressed that by allowing admission of the video, the jury would not be “required to find that [Best] made a statement against interest,” but nonetheless the jury could reasonably make that finding if it chose to do so. The court stated to both the government and defense, “I too have watched this video many, many, many times. And there is this ... very tiny — and, again, it can be debated — but it is a tiny, what looks like a nod in agreement. And it’s part of the communication that went on there.” b. Admission of Salazar’s. Statements Prior to trial and after hearing arguments from the prosecution and from Best’s defense counsel regarding the admissibility of Best’s verbal. confession to Salazar, the trial court determined that Best’s statements .to Salazar were admissible as statements against penal interest. The court acknowledged that there were inconsistencies between Salazar’s testimony and other evidence in the case,32 but found that those inconsistencies were “comparable to many inconsistent .statements we’ve seen throughout this trial of people who are fearful of getting involved ... and’who say-one thing and then later say something else.” The court noted that Salazar’s account was reliable because Best, and Salazar were close friends, so Salazar’s motive to fabricate his confession was not strong. The court also noted that Salazar’s account was .corroborated by other .evidence, including the video surveillance showing Best with the bag that Salazar stated that he had retrieved from her apartment and specific ■ details that Best told Salazar regarding the shooting, such as the fact that a girl had. been shot in the head, 2. Legal Principles The rationale behind the statement against penal interest exception to the hearsay rule is that “reasonable people usually do not make statements against them penal interest unless the statements are true, [and thus,] the statements are reliable ... insofar as they genuinely increase the declarant’s exposure to criminal sanction.” Thomas v. United States, 978 A.2d 1211, 1227 (D.C. 2009) (footnote omitted). “[T]o ascertain whether a proffered statement is admissible under the penal interest exception, the trial court must undertake a'three-step factual analysis.” Id. at 1227-28. The court must determine: “(1) whether the declarant, in fact, made the reported statement; (2) whether the de-clarant is unavailable to testify; and (3) whether corroborating circumstances clearly indicate the trustworthiness of the statement.” Id. at 1228 (footnotes and internal quotation marks omitted). . Best argues that the trial court erred in finding that prongs one and three were met with regard to his video confession to Ms. Best and his alleged confession to Salazar. In determining the first factor, whether the declarant in fact made the reported statement, the court looks to “the veracity of the witness who repeats the declaration.” Laumer, supra, 409 A.2d at 199. In determining the. third factor, the court must ascertain whether there are “corroborating circumstances that clearly indicate the trustworthiness of the statement,” by looking at factors such as “(1) the time of the declaration and the party to whom the declaration was made; (2) the existence of corroborating evidence in the case; [and] (3) the extent to which the declaration is really against the declarant’s penal interest.” Id. at 200 (citations omitted). The trial court’s conclusions that the video of Best’s confession to his mother and Salazar’s statements regarding Best’s confession were admissible as statements against penal interest are legal questions, which this court reviews de novo. Thomas, supra, 978 A.2d at 1225 (quoting Laumer, supra, 409 A.2d at 203). “However; [this court] will not disturb the factual findings supporting the [trial] court’s conclusion unless they are clearly erroneous.” Id. (footnote omitted). 3. Analysis a.. Best’s Video Confession With regard to Best’s video confession to his mother, after reviewing the videotape, we conclude that the trial court properly admitted the video under the statement against penal interest hearsay exception. Whether Best nodded and thereby, in fact, made a statement is “essentially [a] factual determination” to which we give deference to the trial court, unless clearly erroneous. Walker v. United States, 167 A.3d 1191, 1209 (D.C. 2017) (“The clearly erroneous .standard precludes the- appellate court from setting aside a trial court’s finding of fact-unless the judgment' is plainly wrong-or without evidence to support it.”) (footnotes and internal quotation marks omitted).. In making this factual determination, “the trial court’s focus is not on the' -truth of the declaration, but on the veracity of the witness who repeats the declaration.” McCorkle v. United States, 100 A.3d 116, 120 (D.C. 2014)' (citation omitted). In finding that Best’s non-verbal responses to his mother qualified as statements against his penal interest, the trial court made sufficient findings that prong one of the Lau-mer standard was satisfied because the court noted that Best. appeared to give a “tiny” nod. in response to his mother’s question about whether he had hurt anyone. The court also concluded that Ms. Best understood Best to be confessing to her, which was supported by her response to Best in the video, asking him, “What for? Cause he shot Orlando?” The court further noted that Best’s responses such as crying, lowering his head again, and asking his mother for a hug were further non-verbal and verbal communications that qualified as statements against penal interest. Best’s argument on appeal that his non-verbal responses to his mother could not constitute statements fails because Federal Rule of Evidence 801 (a), which this court has. adopted, clearly defines “statement” as an “oral assertion, written assertion, or nonverbal conduct, if the person intended it as an assertion.” Fed. R. Evid. 801 (a) (emphasis added); see also Little v. United States, 613 A.2d 880, 882 (D.C. 1992) (adopting Federal Rule of Evidence 801 (a)’s definition of “statement”). The trial court also made sufficient findings that prong three, whether Best’s statement bore indicia of trustworthiness, was met. In determining whether there are sufficient corroborating circumstances that indicate the reliability of the statement, “relevant considerations include: (1) the timing of the declaration; (2) to whom the statement was made; (3) the existence of corroborating evidence in the case; and (4) the extent to which the declaration is really against the declarant’s interest.” Walker, supra, 167 A.3d at 1209 (footnote and internal quotation marks omitted). This does not require “that the information within the statement be clearly corroborated” but “only that there be corroborating circumstances that clearly indicate the trustworthiness of the statement itself.” Ingram v. United States, 885 A.2d 257, 266 (D.C. 2005) (emphasis and citation omitted). “The corroboration requirement of this rule is a preliminary determination as to the statement’s admissibility, not an ultimate determination about the statement’s truth.” Id. (citation omitted). In making its findings as to prong three, the trial court noted that Best’s statements were corroborated both by Ms. Best’s contemporaneous understanding that Best was confessing to her, and by Ms. Best’s testimony to the grand jury that Best had admitted involvement to her while they were in the interrogation room. On this record, those findings are not clearly erroneous. We have previously noted that “the existence of a close relationship between the declarant and the witness also may provide indications of trustworthiness.” Laumer, supra, 409 A.2d at 201. The statements here were made to Best’s mother who Best presumably trusted — shortly after his arrest. See Anthony v. DeWitt, 295 F.3d 554, 564 (6th Cir. 2002) (“[Statements made to a family member or perceived ally, in confidence, have previously been deemed sufficiently trustworthy.”). Moreover, Best’s involvement in the shooting was significantly corroborated by both eyewitness testimony and DNA evidence implicating him. See, e.g., Walker, supra, 167 A.3d at 1210-11 (corroborating circumstances clearly indicated the trustworthiness of the statement where the statement was made two months after the shooting, to his then-girlfriend whom he presumably trusted, in private, and where the testimony of eyewitnesses and surveillance video supported his presence at the scene); Terry v. United States, 114 A.3d 608, 628-29 (D.C. 2015) (determining that sufficient corroborating circumstances justified admission of the defendant’s statements under the Laumer test because the statements were made to a neighbor, whom he had a close relationship with, the statements were made days after the shooting, and eyewitness testimony and DNA evidence clearly inculpated the defendant). Best asserts, however, that “as a matter of law,” the statements were not truly against his penal interest as his actions in the video could be construed in a way other than admitting guilt — such as remorse that his mother had “turned her back” on him and sided with the police— and therefore, one of the factors weighs against a finding of trustworthiness. Relying on Andrews v. United States, he avers that “if there are two possible interpretations of [a] statement ..., one of which would subject [the declarant] to criminal liability while the other would not, the necessary indicia of trustworthiness [as per Laumer's third prong] are absent.” 981 A.2d 571, 576 (D.C. 2009). There, we agreed with the trial court’s decision to exclude a proposed statement-against-interest because there were two possible meanings of the statement: one of which was incriminating and the other innocuous. In reaching that conclusion, we noted that there was “no evidence in the record to corroborate the statement that [appellants] tried to ‘set up’ all three (or any officers).” Id. (emphasis added). We encounter no such hurdle in this case. Upon review of the videotape, it would not be clearly erroneous to conclude that Best was non-verbally communicating with his mother, and thereby confessing his involvement in the shooting. Such an interpretation is sufficiently corroborated by other compelling, evidence detailing Best’s involvement, as well as Best’s own mother’s contemporaneous understanding of him to be confessing to her. Throughout their interaction, Ms. Best responded to Best’s non-verbal communication with additional questions tailored to what she believed the initial response had been. When asked whether he had hurt anyone, Ms. Best inquired “What for? Cause he shot Orlando?” after understanding Best’s-“tiny” nod to be confirmatory. She further solidified this understanding through her testimony to the grand jury in which she attested that Best had admitted involvement in the shooting to her while they were in the interrogation room. What is more, the entire exchange was captured on video. Thus, it was not clearly erroneous for the trial court to find there was sufficient evidence to corroborate Best’s statements to his mother. Accordingly, the record supports the trial court’s findings that Best’s statements to his mother were admissible under the declaration against penal interest exception to the hearsay rule.33 b. Salazar’s Testimony of Best’s Confession Similarly, there was no error in the trial court’s finding that Best’s confession .to Salazar was admissible. With regard to prong one of the Laumer standard, the court found that Salazar’s statement was reliable because, she and Best were close friends, • and thus, • it was not likely that she would fabricate-his confession to her. Furthermore, even if Salazar was motivated to protect Simms, as the trial court noted, Salazar’s testimony on Best’s confession actually implicated Simms, because she testified that Best told her that Simms shot the AK-47. In addition, Best’s confession to Salazar occurred on the same night of the shooting or very soon thereafter, making the statements more reliable. Although Salazar first indicated to police that Best did not make any statements to her about the shooting, as the trial court noted, Salazar’s inconsistencies were comparable to many inconsistencies from other witnesses at trial who were fearful of getting involved in the case. Under prong three of the Laumer standard, the trial court properly acknowledged that Salazar’s account of Best’s confession to her was corroborated by details surrounding the shooting, such as evidence that Orlando drove, that Simms shot the AK-47, and that a girl had been shot in the head. Best’s main challenges to admission of her statement under prong three are his assertions that he could not have told Salazar that the juvenile was falsely arrested because that information was not public at the time, and in addition, he could not have confessed to Salazar on the night of the shooting because surveillance video from his girlfriend Proctor’s apartment showed that he entered Proctor’s apartment that night and never left to visit Salazar. However, both of these challenges to the video were' successfully presented during cross-examination by Best’s defense counsel. In light of the trial court’s findings that Best’s statements were corroborated 'by many other details of the shooting, this inconsistent evidence was not a basis for the trial court to exclude Salazar’s testimony regarding Best’s statements to her. Accordingly, the trial court properly concluded that prongs one and three' of the Laumer standard were met for-Best’s verbal confession to Salazar.34 D. Withdrawal From Conspiracy Jury Instruction Appellant Williams argues that the trial court erred when it refused to give the withdrawal from conspiracy jury instruction. He claims that his action in leaving the van right before the others committed the South Capitol Street shooting constituted withdrawal from that conspiracy, 1, Additional Factual Background Immediately prior to the South Capitol Street shooting, Williams was in the car with Orlando, Simms, Best, and Bost as they prepared to shoot Howe’s associates. Simms testified at trial that Williams told the men, “Y’all about to go commence. Y’all can let me out right here[,]” before éxiting the car. Due to Simms’s testimony regarding this statement by Williams, at the end of trial, Williams’s counsel requested that the judge give the jury an instruction on the withdrawal from a conspiracy defense. Williams’s counsel requested that the following instruction be read to the jury: A person who may have entered into an agreement to commit a crime — a conspiracy — may subsequently withdraw from that agreement. If he does that, he may no longer be held responsible for actions subsequently taken by his former coeonspirators. To withdraw from such an agreement a person must unequivocally indicate to his co-conspirators that he no longer will participate in the agreed activity. The trial court declined to give that instruction, finding that no “reasonable juror, based on Nathaniel Simms’s testimony about what Lamar Williams said in the minivan ... could find that there was a withdrawal by [] Williams from the conspiracy.” 2. Legal Principles “[A] defendant is entitled to an instruction as to any recognized defense for which there exists evidence sufficient for a reasonable jury to find in his favor.” McCrae v. United States, 980 A.2d 1082, 1086 (D.C. 2009) (citation omitted). “Thus, the proper inquiry is whether there is evidence from either the prosecution or defense that fairly raises the defense.” Id. (citation omitted). “However, where there is no factual or legal basis for a requested instruction, it is not error for the trial court to refuse to instruct .the jury on that defense.” Id. (citation omitted). “[T]o withdraw from a conspiracy one must take affirmative action to disavow or defeat the purpose, or definite, decisive and positive steps'which indicate a full and complete disassociation.” (Mary) Harris v. United States, 377 A.2d 34, 38 (D.C. 1977). “Passive nonparticipation in the continuing scheme is not enough to sever the meeting of minds that constitutes the conspiracy.” Smith, supra, 568 U.S. at 112-13, 133 S.Ct. 714. Our decision in (Mary) Harris v. United States, which discusses withdrawal from a conspiracy, is instructive on this issue. 377 A.2d at 38. In (Mary) Harris, after her daughter was raped, Harris agreed, along with her daughter, her daughter’s son, and other persons, to “find and deal forcibly” with the rapist. Id. at 36. In planning the retaliation, Harris . .helped to identify the suspected rapist and provided a firearm to her daughter’s son, who told her he would “pistpl-whip” the assailant. Id. When a group gathered at the suspected rapist’s home, Harris left and went to a porch, and when a person answered the door at the suspected assailant’s home, he was shot several times with a pistol. Id. Harris was convicted, amongst other charges, of conspiracy to commit an assault with a dangerous weapon for her role in the incidents as an aider and abettor. Id. at 36. On appeal, she argued that there was insufficient evidence to prove that she was an aider and abettor, in part because she had withdrawn from the conspiracy before the shooting occurred. Id. at 38. We emphasized that in order to withdraw from a conspiracy, “one must take affirmative action to disavow or defeat the purpose, or definite, decisive and positive steps which indicate a full and complete disassociation.” Id. We further stated that “[w]hile there was testimony indicating that [Harris] left the scene before the shooting occurred, [that testimony] was in conflict with other evidence” and that furthermore, the evidence was “insufficient to establish withdrawal as a matter of law.” Id. 3. Analysis In this case, Williams’s request to be let out of the car did not constitute an “affirmative action to disavow or defeat the purpose” of the conspiracy. Like the appellant in (Mary) Harris, Williams played a key role in the conspiracy; he helped provide the weapons for the South Capitol Street shooting. Williams’s actions in providing weapons for the shooting demonstrated that he was willing to assist with the commission of • the conspiracy. Furthermore, Williams failed to “disavow” or “defeat the purpose” of the conspiracy, or completely “disassociate” himself from the conspiracy by leaving the car. Leaving the scene before a crime occurs is insufficient to demonstrate withdrawal from a conspiracy. See (Mary) Harris, supra, 377 A.2d at 38 (concluding that the fact that appellant merely left the scene before the shooting occurred was “insufficient to establish withdrawal as a matter of law E. Other Issues Appellants raise several additional arguments that arose during trial that we address summarily. First, Williams argues that the trial court should have granted his mistrial motions due to the government’s presentation of “emotional testimony” .regarding the South Capitol -.Street shooting, which Williams claims was only presented in order to appeal to the jurors’ emotions. Williams points to the’following testimony that he believes was especially inflammatory: (1) the testimony of Officer Neftia Turner, one of the first , responding officers to the South Capitol Street shooting, who gave a detailed account of the crime scene and later cried while testifying; (2) the testimony of Tierra Brown, who was the girlfriend of one of the victims, Jones, and who was also present and shot in the leg during the South Capitol Street shooting; and (3) the testimony of four mothers of victims at the South Capitol Street shooting. Williams also refers to the testimony of Ra’Shauna Brown and the government’s decision to play recordings of a 911 call that included her screams. We conclude that the trial court did not abuse its discretion in denying Williams’s mistrial motions. Certain cases, “particularly those involving tragic death or injury, have an' inherent emotional impact,” Dixon v. United States, 565 A.2d 72, 76 (D.C. 1989), and in such cases, the government is “not required to deliver a dispassionate presentation of sterile facts.” Chatmon v. United States, 801 A.2d 92, 100 (D.C. 2002). However, in the event of an improper comment that is potentially prejudicial, “an effectively worded curative instruction rendered in a timely manner may serve to rectify the error.” Hazel v. United States, 319 A.2d 136, 138 (D.C. 1974). While we question whether the government needed to present testimony from four mothers of the victims, it is evident that throughout trial, the trial court was attentive to the defense’s concerns about the emotional nature of the case and repeatedly instructed the jury to decide the case based on the evidence and the law, and not to be swayed by emotion. There is no reason to believe that the jurors did not follow these instructions. See Metts v. United States, 877 A.2d 113, 118 (D.C. 2005) (stating' that the court would not presume that the jury did not follow the trial court’s curative instruction). Second, Williams argues that the trial court violated his Sixth Amendment right by unduly restricting his ability to cross-examine Simms in regards to his jealous behavior towards the women that he had dated. Specifically, Williams sought to demonstrate at trial that Simms was motivated to falsely implicate Williams in the two conspiracies because Simms was jealous that Williams previously had relations with one of Simms’s girlfriends, Salazar. Williams further sought to elicit testimony from Simms that Simms was jealous that his other girlfriend, Young, might be dating other men during Simms’s incarceration. The trial court restricted Williams’s cross-examination regarding Simms’s jealousy toward Young, and we discern no error in the trial court’s limitations. While “[b]ias or testimonial motivation is always a proper subject of cross-examination,” Rose v. United States, 879 A.2d 986, 995 (D.C. 2005) (citation and internal quotation marks omitted), the trial court still retains “wide latitude ... to impose reasonable limits on such cross-examination based on concerns about, among other things, harassment, prejudice, confusion of the- issues, the witness’ safety, or interrogation that is repetitive or only marginally relevant,” Delaware v. Van Arsdall, 475 U.S. 673, 679, 106 S.Ct. 1431, 89 L.Ed.2d 674 (1986). Here, the trial court’s limitation of Williams’s cross-examination did not preclude Williams from eliciting testimony of Simms’s potential bias against him. Williams was permitted to elicit: (1) evidence that Williams had relations with Salazar prior to Simms’s relationship with her, (2) testimony from Simms and Salazar regarding a prior occasion in which Simms confronted Williams for inappropriately touching .Salazar, and (3) testimony from Simms and Young that Simms was jealous of Young dating other men. It was within the trial court’s discretion to conclude that any further extrinsic evidence regarding the relationship between Simms and Young, and specific instances in which Simms had shown jealousy toward Young, were cumulative with regard to the relationship and level of jealousy that Simms had with Salazar. See Delaware, supra, 475 U.S. at 679, 106 S.Ct. 1431. Third, Best argues that the trial court abused its discretion when it precluded him from calling a witness to impeach Simms regarding his testimony that he never fired a TEC-9, a semi-automatic pistol, in 2007. Best argues that the -witness’s testimony was material and would have contradicted Simms’s earlier testimony that he was “not familiar with guns,” and would have provided support for Best’s argument that it was actually Simms who fired the AK-47 during the Alabama Avenue shooting, while Best remained in the car. The trial court did not err in excluding extrinsic evidence that Simms had allegedly fired a TEC-9 in 2007. As the trial court noted, the 2007 incident “was not material” to Best’s trial; it occurred three years prior to the Alabama Avenue shooting and involved a different weapon. Furthermore, there was no testimony or evidence adduced at trial to support Best’s assertion that it was actually Simms who had fired the AK-47 on Alabama Avenue. See Washington v. United States, 499 A.2d 95, 101 (D.C. Í985) (“It is well settled that a party may not present extrinsic evidence to impeach a witness on collateral issues.”). IV. Jury Note Bost (joined by all appellants on appeal) argues that the trial court abused its discretion in its response to a juror’s note sent during jury deliberations. Essentially, Bost claims that the. trial court should have granted defense counsel’s motions for a mistrial after the juror’s note exhibited signs of coercion, and that, alternatively, the court should have at least given the jury an anti-deadlock instruction. A. Additional Factual Background Jury deliberations began on April 26, 2012. On May 3, one juror sent the trial judge the following note: After several days of deliberations we have come to a point of disagreement where I feel pressure from many members of the group to change my mind regarding my vote on particular counts on which we disagree. The emotions are very intense and I do not want other people’s emotions or feelings to affect my decision. I want to know if it’s possible to be recused at this point. I do not want to make a decision based on pressure from the group. The trial court informed the parties of the note and was “very much open to suggestions or changes” to its proposed response. The court explained that its inclination was to give a “very bland response” that “emphasize[d] civility, respect, listening to each other or expressing views and then stressing that ... we don’t excuse people just because there is disagreement.” Defense counsel for Sanquan argued that, because the note used the pronoun “I,” he was “concerned” that this juror was “individually ... feeling pressure from members of the group to change her mind,” and that the “only cure for this would be a mistrial at this stage.” The trial court “rejected] that [request] completely,” explaining that “there are some people who don’t like conflict at all,” and that the “note is totally consistent with someone ... feeling pressure to change her view ... but there is no suggestion that someone is ... doing anything improper.” The court then engaged in an extended colloquy with the parties, where both defense counsel and the government requested some form of an anti-deadlock instruction. The court, however, was “determined not to give an anti-deadlock instruction now” because it was “very premature to even be thinking along those lines.” The court also rejected the government’s request to take a partial verdict. After soliciting recommendations from the parties, the court gave the following response in open court to the jury the next day on May 4: First, I want to compliment all of you on carefully following my earlier instruction that whenever you send a note you not mention how you are divided on an issue. I .have no idea on what lines you are divided and what the issues may be that are. dividing them. Second, let me stress that you are our jury. We do not excuse jurors based on some disagreeing with others. Any verdict in this case must be the considered view of each juror after an impartial, rational^] and fair examination of the evidence in accordance with my instructions about the law and not improperly influenced by emotions. Third, I want to stress the importance of jurors treating each other with civility and mutual respect in an environment in which every juror is able to express his or her views. With that, I’m going to ask you to return and deliberate. Thank you very much. The jury rendered its verdict on May 7, convicting Sanquan, Orlando, Best, and Bost on all charges, but only convicting Williams of charges stemming from thé second conspiracy. B. Legal Principles “[A] mistrial is subject to the broad discretion of the trial court and our review is deferential.” Van Dyke v. United States, 27 A.3d 1114, 1122 (D.C. 2011) (citations and internal quotation marks omitted). “To determine the coercive effect of the trial court’s instructions to the jury during deliberations, we examine ‘all the circumstances,’ .., and we do so ‘from the juror’s'perspective.’” Id. (citations omitted). “Evaluation of jury coercion requires this court to inquire into: (1) the inherent coercive potential before the trial court; and (2) the actions of the trial.judge in order to determine whether these actions exacerbated, alleviated or were neutral with respect to coercive potential.” Leake v. United States, 11 A.3d 971, 975 (D.C. 2013) ..(citation and internal quotation marks omitted). C. Potential for Coercion Turning first to the “inherent coercive potential” of the situation revealed by the juror’s note, we conclude that the potential for coercion was low. As wé explained in Leake, in determining the potential for coercion: [W]e look to a series of indicators, including: (1) the extent of isolation of a dissenting juror; (2) whether the identity of a dissenting juror is revealed in open court; (3) whether the exact division of the jury’s verdict is disclosed; (4) whether the judge is aware of the identity of the dissenting juror; (5) whether the dissenting juror knows of the judge’s awareness; . (6) whether other jurors feel ‘bound’ by a verdict they announced; and (7) whether the trial court issues an ‘anti-deadlock’ instruction. 77 A.3d at 976 (citing (Robert) Harris v. United States, 622 A.2d 697, 705 (D.C. 1993)). We apply each factor to the situation here. Factor one, the extent of the juror’s isolation, weighs in favor of low potential coercion^ The note came from one juror who indicated that the juror felt pressure from some of the other jurors regarding “particular counts” in which they disagreed. The juror did not say that the juror felt pressure from the entire remainder of the jury, or that they disagreed on all counts. See id. (less coercion when the “precise numerical division of thé jury” has not been revealed) (citation omitted). Factor two, the identity of the juror, was not revealed in open court as the note was passed to the trial court during jury deliberations, rather than during the announcement of the verdict, making it less, likely that the juror felt undue pressure from the rest ,of the jury. Factor three, the exact division of the jury, was also unknown as the court addressed the jury regarding the note without referencing any particular juror, omitting the possibility that they would feel “bound” by any decision that they had made up to that point during deliberations. Factors four and five weigh in favor of coercive potential, because the court knew the juror’s identity. Factors six and seven weigh in favor of low coercive potential. No verdict was announced at the time the court instructed the jury, and the court expressly refused to give an anti-deadlock instruction. Lastly, as the trial court observed, the juror’s note does not reveal any impropriety. on the part of the other jurors, only that deliberations were spirited, which is natural given this high-profile murder case involving five co-defendants. “The persuasive impetus inherent in the requirement of unanimity does not constitute coercion; such an impetus exists any time twelve persons are sent into a jury room to deliberate.” (Robert) Harris, supra, 622 A.2d at 701 (citation omitted). D. Trial Court’s Actions Next, in determining whether the trial court’s actions “exacerbated, alleviated or were neutral with respect to coercive potential,” Leake, supra, 77 A.3d at 977 (citation and internal quotation marks omitted), we consider the following factors: [W]e look to (1) whether the judge made any affirmative efforts .to dispel the coercive potential, (2) whether' the judge’s actions took a middle ground, (3) whether the judge’s actions exacerbated the 'problem by 'effectively contributing to the potential for jury coercion, and (4) whether the judge’s reaction independently created a coercive atmosphere for the jury. Id. Given the low coercive potential of the juror’s note, it was incumbent on the trial court to give a neutral, even-“bland,” instruction. The court followed the rule- in this case, so we cannot say the' court’s answer was an abuse of its broad discretion. Cf. Gray v. United States, 79 A.3d 326, 336-37 (D.C, 2013) (concluding that where the jury’s note exhibited confusion, the trial court’s general statements ■ failed to bring adequate clarity). The court’s response to the juror’s note, in open court, was for the jury to resume deliberations, to recognize that heated discussions during deliberations were natural, but also, to emphasize the need for civility and mutual respect! The trial court’s jury instruction was not coercive. In fact, the instruction reduced any coercive potential by reminding jurors to respect each other’s viewpoints during deliberations and to focus on the evidence presented. Contrary to Bost’s claim, an anti-deadlock instruction admonishing the jury not to “surrender [their] honest conviction[s]” would have been premature as there was no indication that the jury was deadlocked at.the time of the note. We -have consistently cautioned that an anti-deadlock instruction should not “be used prematurely or without evident cause,” and that an anti-deadlock instruction is more of an “ultimate judicial attempt, not a preliminary attempt, to secure a verdict.” Barbett v. United States, 54 A.3d 1241, 1245 (D.C. 2012) (citation and internal quotation marks omitted). For the reasons stated, the trial court did not abuse its discretion in refusing to grant a mistrial or to issue an anti-deadlock instruction. V. Best’s Ineffective Assistance of Counsel Claim The trial court sentenced Best to life imprisonment without' release. During the pendency of his direct appeal, Best filed a D.C. Code § 23-110 (2012 Repl.) motion for a new .trial alleging ineffective assistance of trial counsel. Specifically, Best alleged that his trial counsel, Michael O’Keefe, Esq.,35 provided constitutionally ineffective assistance by failing to file a motion to suppress Best’s videotaped interrogation by MPD detectives. The videotape included a conversation he had with his mother, Laverne Best, in which he may have communicated, non-verbally, that he was culpable. Best claimed that the lead detective, Detective Anthony Patterson, violated his Miranda rights by asking him questions about the shootings after he had invoked his right to counsel. He also claimed in his motion that Ms. Best’s subsequent conversation with him was the “functional equivalent” of police interrogation. Accordingly, Best’s motion argued that Mr. O’Keefe should have filed a motion to suppress the video and Ms. Best’s derivative grand jury testimony regarding her conversation with Best, and that his failure to do so was not harmless, because a motion to suppress would have been meritorious. The trial court convened a hearing on the ineffective assistance of counsel claim and, upon hearing the evidence, denied Best’s motion on the basis that (1) Mr. O’Keefe made a strategic decision not to file a motion to suppress, (2) in any event, Ms. Best’s conversation with Best was not the functional equivalent of interrogation and therefore not subject to the strictures of Miranda, and, (3) even if the challenged evidence should have been excluded, the additional evidence against Best was overwhelming and therefore he suffered no prejudice from its admission. Best filed a collateral appeal of the trial court’s denial of his motion, which we have consolidated with his direct appeal and the direct appeals of his co-defendants. A. Additional Factual Background The footage of the police’s interrogation of Best is available to us on appeal. On April 26, 2010, the United States Marshals Service arrested Best and brought him before MPD Detectives Oliver Garvey and Anthony Patterson. The detectives read him his rights and presented him with a PD-47 card, whereupon Best invoked his right to silence and to an attorney. In response, Detective Garvey explained to Best that they could no longer speak to him about the case. Detective Patterson asked Best whether he knew what he was being charged with, and Best replied that, “The warrant said murder.” Detective Garvey told Best that he was charged with five counts of first-degree murder, to which Best asked, “How you get five counts of murder?” Because Best had already invoked his rights, however, the detectives told him that they could not discuss the case with him any further, but stated that, “In a few minutes if you feel comfortable enough, you can always ask if you want to talk to us. But right now, we can’t talk to you because you already said you don’t want to talk to us.” The detectives then left Best by himself in the interrogation room for about thirty minutes. Detective Patterson then returned to ask Best if he needed to use the restroom. Best said he did and the detective escorted him to the restroom. This fifteen-minute restroom break was not recorded on camera, and it was during this break that Best claimed in his § 23-110 motion that Detective Patterson sought to reinitiate a conversation with Best about the case, in violation of Miranda. Best alleged that, as he was washing his hands, Detective Patterson approached him and encouraged him to talk about the shootings, telling him something to the effect of, “Come on man, let’s talk. I’m the head detective on the Alabama Avenue shooting. I’ll tell you something, then you tell me something.” Best also claims that Detective Patterson told him that he knew Best fired the shotgun on Alabama Avenue, but that he did not intend to hurt anyone, and that Simms was in police custody and was already talking. The police recording captured Best and Detective Patterson as they re-entered the interrogation room. When Detective Patterson turned to leave, Best stopped him and told the detective that he was willing to talk to him, and that it could be recorded. Detective Patterson, assisted by Detective Susan Blue, then re-informed Best of his Miranda rights, and Best waived his rights on the record. The detectives interrogated Best for about three hours on his role in the shootings, but Best repeatedly denied the accusations and did not give any inculpating statements. The detectives then tried a different approach. After Best vocalized his concern that his family had “turned their back” on him, Detective Blue confronted Best regarding rumors that he was suicidal. Detective Blue asked, “Would it help you any if we got your mother down here so you could talk to her?” Best responded, “I do want to talk to my mom.” Detective Blue replied: Okay. Because I don’t want your mother to, you know, the last thing she pretty much remember her child saying is he want to kill himself and you know you go away, and God forbid, whatever because I’m telling you until your heart feel better, you ain’t going to be better. Until you put your heart in a better place you not going to be better. Until you clear your conscience, and you know what? It is what it is, God forgive me, whatever you got to say to make yourself get over that hurdle, until you do it, you’re not going to feel better. You can sit here and listen to us all day long. We can tell you the best advice we know, but until you do the right thing yourself, you’re not going to get no better, and I will go ahead and call your mother personally. Does she know you got locked up? You don’t even know. Okay. I’ll call her myself and tell her that you’re here and see what we can do to get her down here so you get a chance to see her, all right? But I want you to really consider doing the right thing. Best provided Detective Blue with his mother’s number and the Detective called Ms. Best and told Best that she was on her way. Prior to Ms. Best’s arrival, Best admitted that he had suicidal thoughts, and stated that his mother was the “one person I know will never leave my side.” Ms. Best arrived and had a brief one-on-one conversation with Best. She asked if he was there “when they did that,” to which Best whispered something to Ms. Best and directed his mother’s attention to the camera in the room. Detective Blue then re-entered the room and asked Best “to help your mother understand why you’re not doing the right thing.” Ms. Best told Detective Blue that she did not care “what you put out there about him,” but also told Best not to cover for his “so called” friends and to “clear” himself, stating, “If you didn’t do nothing, be a man about it.” Ms. Best also told Best that the poliee had been searching through her home. Detective Blue, likewise, told Best to cut his friends loose and to worry about the “people who worry about you.” Detective Blue then gave Ms. Best and Best another two minutes of one-on-one time. When Detective Blue left the room, Ms. Best told Best, “She’s right, Jeff, I— you didn’t — you didn’t.” She also asked, “You didn’t hurt no one, hmm, hmm, did you? Huh? So that’s true out there? Huh?” Best, in response to this question, gestured with his head. Ms. Best then- asked whether it was because of Orlando’s shooting, at which point Best cried and asked for a hug. They hugged and said they loved each other. Ms. Best then said, “[S]ee what Orlando, see what he got you into” and Best said, “Mom. Mom.” After Ms. Best left, the detectives continued to interview Best, but he continued to deny involvement in the shootings. Accordingly, the only' inculpating statement from the police video is the head movement by Best in response to Ms. Best’s question as to whether what the police were saying was “true out there.” B. § 23-110 Hearing The trial court conducted a § 23-110 hearing on August 20, 24, and 25, 2015, and ruled on September 1, 2015. Best’s sole witness was himself — -he testified that Detective Patterson engaged him in conversation about the shootings during his bathroom break after he had already invoked his right to silence and counsel. According to Best, Detective Patterson told him that he would “tell me something, that he wanted me to tell him something in return and then he told me that I played a part [in] the Alabama Avenue shooting.” In response, Best told the detective that he was willing to speak to him. As for his conversation with his mother, Best admitted that he wanted to speak to his mother, but stated that he believed the reason Detective Blue brought his mother to the room was, “To get me to do the right thing. Basically [to] get me to confess or corroborate.” Best also testified that he felt “upset, confused, — a lot of things” after Ms. Best appeared to agree with Detective Blue’s assertion that. he was involved in the shooting, stating it felt, “Like my mother turned her back on me.” As for Mr. O’Keefe’s knowledge of Best’s alleged conversation with Detective Patterson during the bathroom break, Best explained that he did not speak to Mr. O’Keefe about the incident prior to trial, and that he only informed him that it had happened “after [he] got [his] mother[’s] grand jury statements.” He knew that he “had to come up ... with something to try to get this video out.” Specifically, Best admitted that, with the help of ■a “jailhouse lawyer,” Thomas Jones, they drafted a motion alleging that Detectivé Patterson had engaged in a conversation with Best after he.had already invoked his rights, and that this was a violation of Miranda. Best then provided the motion to Mr. O’Keefe, but Mr. O’Keefe did not present any arguments before the court regarding the motion. The government called Mr. O’Keefe to the stand.- He testified that, once the government was permitted to use Ms. Best’s grand jury testimony, which the government claimed showed that Best had confessed to Ms. Best, he thought the best course of action was to show the video to the jury himself, “so they could see that [Best was not confessing], and that her testimony is, in fact, misleading.” Further, he explained that he read Best’s proposed motion to. suppress, but was immediately suspicious of it because it was “written in the third person ... it talked about ‘your client.'”’ Mr. O’Keefe also found it “very strange” -that he “hadn’t. heard this fact before” after spending a lot of time with Best (“I went to the jail .many, many times.”) and talking about “every aspect” of his case. And that, “now for the first time, almost two years after first getting involved in the case ... there is this conversation with Detective Patterson out in the hallway that was different than what was represented originally when we went over the video,” Mr. O’Keefe explained that “sometimes people in trial start to change their stories when they get nervous” and “they- start to make things up.” Accordingly, Mr. O’Keefe did not credit the prepared motion and did not believe that he “could ethically advance this argument that, in fact, something happened out there that” he did not' believe actually happened. The government also called Detective Patterson, who denied initiating any substantive conversation with Best during the bathroom break; He did admit, however, that he was not “100 percent” sure that absolutely no conversation took place, but maintained that “whatever happened on the way back was initiated by [Best].” The trial court issued its oral findings on September 1 and denied Best’s ineffective assistance claim, stating, “it is clear to [the court] that Mr. O’Keefe’s decision not to file a motion to suppress based on Miranda, was not deficient under Strickland.” Accordingly, the trial court concluded' that it “need not resolve” the question of whether Detective Patterson attempted to re-initiate a conversation with Best after he had invoked his rights, thereby violating his 'Miranda rights. The court emphasized, however, that, “The fact that I have not resolved this issue does not indicate that I believe a Miranda violation occurred, I am just not deciding that issue.” The court credited Mr. O’Keefe’s testimony that Best had initially told him that he had waived his rights in the hopes of getting information from the police, and that Best only mentioned the bathroom encounter for the first time two years after Mr. O’Keefe started his representation. The court also credited Mr. O’Keefe’s testimony. that he found the .motion dubious because of the lateness of the representation and because the note was written in the third person. The court therefore found it “reasonable for Mr. O’Keefe to. decide against filing a motion to suppress based on a Miranda violation that he believed was fabricated and that someone reasonably could believe was fabricated.” The court further observed that “Mr. O’Keefe provided excellent representation to [Best] throughout this trial” and that “[t]his is not a situation where counsel did not know the law and as a consequence did not file a motion to suppress based on Miranda and Edwards.”36 Alternatively, the trial court concluded that the “meeting between [Best] and his mother was not custodial interrogation for purposes of Miranda.” “Only state action implicates a defendant’s rights under the Fifth Améndment.” Lastly, even assuming deficient performance by Mr.-O’Keefe, the court found that “[t]he- case against Mr. Best was so compelling that he would have been convicted without his mother’s testimony about his statements and without the video tape of his meeting with her.” The court pointed to the testimony of Simms, whom the court described as “one of the best witnesses [the court] has observed' in over 20 years on the bench. His testimony in and of itself was powerful. He did not exaggerate. He did not minimize his own role.”, The court, further noted that Simms’s testimony was corroborated by other evidence, including, inter alia, a video of Best unsuccessfully attempting to rent a minivan on the night of the South Capitol Street murders, Best’s. DNA being found on the jacket tossed by one of the men who. escaped from the minivan after the shooting on South Capitol Street, Salazar’s testimony that Best had confessed to her of his involvement, and “very incriminating” telephone records establishing the relationships between the various appellants and suspicious calls made right .before and right .after the South Capitol Street shootings. The court also noted the weakness of Best’s misidentification argument, in light of the considerable incriminating evidence presented at trial. This collateral appeal followed. C. Applicable Legal Principles Our standard of review of a trial court’s denial of an appellant’s ineffective assistance of trial counsel claim is well established. “We accept the judge’s factual findings unless they lack evidentiary support, but we review his or her legal conclusions de novo.” Derrington v. United States, 681 A.2d 1125, 1132 (D.C. 1996) (citation, internal quotation marks, brackets, and italics omitted). Under the two-part Strickland analysis, “[t]o prevail on his ineffective assistance of counsel claim ..., appellant must demonstrate [both] that his counsel’s performance was constitutionally deficient, and that the deficient performance prejudiced his defense.” Otts v. United States, 952 A.2d 156, 164 (D.C. 2008) (citing Strickland v. Washington, 466 U.S. 668, 687, 104 S.Ct. 2052, 80 L.Ed.2d 674 (1984)). First, [t]o establish constitutionally deficient performance, appellant must show that counsel’s “representation fell below an objective standard of reasonableness.” Id. (quoting Strickland, supra, 466 U.S. at 688, 104 S.Ct. 2052) (internal quotation marks omitted). The proper measure of an attorney’s performance is “reasonableness under prevailing professional norms.” Cosío v. United States, 927 A.2d 1106, 1123 (D.C. 2007) (en banc) (quoting Strickland,, supra, 466 U.S. at 688, 104 S.Ct. 2052). Trial counsel is “strongly presumed to have rendered adequate assistance and made all significant decisions in the exercise of reasonable professional judgment.” Id. (quoting Strickland, supra, 466 U.S. at 690, 104 S.Ct. 2052). There are “countless ways to provide effective assistance in any given case,” so “judicial scrutiny of counsel’s performance must be highly deferential.” Id. (emphasis added) (quoting Strickland, supra, 466 U.S. at 689, 104 S.Ct. 2052). Further, “we must judge the reasonableness of counsel’s challenged conduct on the facts of the particular case, viewed as of the time of counsel’s conduct.” Otts, supra, 952 A.2d at 164 (citation and internal quotation marks omitted). Of course, reasonable performance “demands appropriate investigation and preparation by counsel.” Cosio, supra, 927 A.2d at 1123 (citation omitted). Accordingly, it would be “objectively unreasonable for defense counsel to make an uninformed decision about an important matter without justification for doing so.” Id. Second, even if appellant establishes that trial counsel’s performance was deficient, he must also prove that his case was prejudiced by the deficient performance. Otts, supra, 952 A.2d at 164. “To establish prejudice, appellant must show that ‘there is a reasonable probability that, but for counsel’s unprofessional errors, the result of the proceeding would have been different.’ ” Id. (quoting Strickland, supra, 466 U.S. at 694,104 S.Ct. 2052). D. Analysis Here, Best claims that counsel, Mr. O’Keefe, rendered ineffective assistance when he failed to file a motion to suppress during the middle of trial in response to Best’s new revelation that he was approached by Detective Patterson during the bathroom break. “To succeed on an ineffectiveness claim grounded • on counsel’s failure to file a suppression motion, it is the movant’s burden to show that a [Fifth] Amendment claim would have been successful.” (Ronald) Young v. United, States, 56 A.3d 1184, 1193 (D.C. 2012) (citations omitted). “[W]e must give deference to the trial court’s findings of fact as to the circumstances surrounding the appellant’s encounter with the police and uphold them unless they are clearly erroneous.” Id. at 1194 (citation and internal quotation marks omitted). The trial court in this case did not make a factual finding on whether Detective Patterson actually initiated a conversation with Best off-camera during the bathroom break after Best had invoked his right to silence and counsel, in violation of Miranda. Best argues, however, that this court has the authority, for the first time on appeal, to make that factual finding because the only evidence presented points to the existence of such a conversation. However, “it is not our function to decide issues of fact.” Evans v. United States, 122 A.3d 876, 884 (D.C. 2015). Further, contrary to Best’s' claim, there was competing evidence on whether the Detective initiated a conversation with Best; Best claimed it happened, but Detective Patterson claimed that, at most, Best would have initiated the conversation. Regardless, although the trial court declined to make this factual finding, the court at the very least agreed that it was reasonable for Mr. O’Keefe not to have believed Best’s claim during the middle of trial that Detective Patterson sought to reinitiate a conversation after Best had invoked his Miranda rights. We conclude that the trial court did not err in concluding that Mr. O’Keefe’s decision not to file a motion to suppress during the middle of trial did not fall “below an objective standard of reasonableness.” Otts, supra, 952 A.2d at 164 (quoting Strickland, supra, 466 U.S. at 688, 104 S.Ct. 2052). Preliminarily, we conclude jdiat a motion to suppress the video and Ms. Best’s grand jury testimony during the middle of trial would have been considered waived by the trial court. “Objections to the admission of evidence are waived when they are not raised in a pretrial motion to suppress the evidence, ‘unless opportunity therefor did not exist or the defendant was not aware of the grounds for the motion.’ ” Simmons v. United States, 999 A.2d 898, 902 (D.C. 2010) (emphasis added) (citation omitted). Here, by Best’s own admission during the § 23-110 hearing, he did not inform Mr. O’Keefe of the bathroom conversation until after trial had commenced, even though he obviously was “aware, of the grounds for the motion.” Id. (citation and internal quotation marks omitted). Accordingly, a motion to suppress during the middle of the trial based on Best’s new claim would have been considered waived and unsuccessful. Again, “it is the movant’s burden to show that a [Fifth] Amendment claim would have been successful.” (Ronald ) Young, supra, 56 A.3d at 1193. Even setting aside the procedural bar, however, Best cannot demonstrate that Mr. O’Keefe’s refusal to file a motion to suppress was unreasonable. This was not a case where counsel made “an uninformed decision about an important matter without justification for doing so.” Cosio, supra, 927 A.2d at 1123. On the contrary, Mr. O’Keefe explained in great detail why he declined to go forward with Best’s new Miranda claim. He explained that he had worked with Best for about two years up to that point, and that Best had never once mentioned a bathroom conversation with Detective Patterson. Further, the “motion” that Best presented to Mr. O’Keefe was written in the third person and was of dubious nature. Mr. O’Keefe also explained that it was common for defendants to become nervous as the trial grows closer and to make up new allegations. In addition, no police recording shows the existence of this off-camera conversation. Taken together, it was reasonable for Mr. O’Keefe, a seasoned attorney who had worked with Best for two years up to that point, to have believed that the allegations within Best’s pro se motion were not true. See Tibbs v. United States, 628 A.2d 638, 641 (D.C. 1993) (“We hold ... that as a matter of law an attorney is not ineffective for refusing to present testimony which the attorney knows to be false.”). We also agree with the trial court that a motion to- suppress the video and Ms. Best’s grand jury testimony would have been futile. The only potentially inculpating gesture by Best (the head nod after being questioned by his mother) was not the product of custodial interrogation, and therefore not subject to the strictures of Miranda. “Only ‘state action’ implicates a defendant’s rights under the Fifth Amendment.” Graham v. United States, 950 A.2d 717, 732 (D.C. 2008). Accordingly, “the Fifth Amendment privilege is not concerned with moral and psychological pressures to confess emanating from sources other than official concern.” Id. (citations and internal quotation marks omitted). Further,' it does not matter that the police knew there was a “possibility” that an outside source, such as a parent or spouse, may lead a suspect to incriminate oneself. Id. at 733. “Officers do not interrogate a suspect simply by hoping that he will incriminate himself.” Id. (citations and internal quotation marks omitted). Here, the only potentially incriminating gesture by Best emanated from his two-minute one-on-one conversation, with his mother, whom he wanted to come see him at the police station. He also knew that the conversation with his mother was not private and was being recorded, as evidenced by his gestures to his mother earlier in the video. Accordingly, any inculpating gestures he made in response to his mother’s questioning about whether he was involved came from “moral and psychological pressures” outside of police action, and thus not subject to Fifth Amendment protections. Id. at 732. Whether Detective Blue may have hoped or even wished that speaking with his mother would make Best confess is irrelevant.37 Further, contrary to Best’s claim, Ms. Best cannot be considered a state actor at the time she spoke with Best. “This court has held that, in determiningwhether the conduct of third parties is attributable' to the- police for purposes of Miranda, we must focus on how a reasonable person in the suspect’s position would’ perceive the situation;” Broom v. United States, 118 A.3d 207, 215 (D.C. 2015) (citation omitted). Here, a reasonable person could not have believed that Ms. Best was working for the police. First, Best stated “I do want to talk to my mom” and gave the police Ms. Best’s number, so that she could come down to the police station. Second, Ms. Best was acting “on her’own initiative” in her questioning of Best. Id. Third, Best only made the arguably inculpating gestures when he was alone with his mother, away from the police or any alleged state pressure. Best then cried and hugged his mother, and they said they loved each other. Taken- together, none of these circumstances. can lead us to conclude that his mother can be considered a state actor intentionally placed in the interrogation room to coerce a confession.38 VI. Conclusion Based on the above mentioned reasons, the judgments of conviction by the Superi- or Court are Affirmed. . Sanquan Carter and Orlando Carter are brothers. For clarity, this opinion will refer to Sanquan Carter as \"Sanquan” and Orlando Carter as “Orlando.” . The government charged Williams with involvement in the first conspiracy to kill Howe, but the jury acquitted him of those charges. In addition to Howe’s murder, the shooting wounded juvenile V.K.M. and Tavon Lambert, . By the time of the second' conspiracy, the police had already arrested Sanquan in connection with Howe’s murder.. . Specifically, Brishell Jones, Devaugn Boyd, and William Jones w.ere killed, Kevin Attaway was grievously injured, and Jamal Blakeney, Ra’Shauna Brown, JaBarie Smith, Darrick • Lanier, and Tierra Brown were injured,. . A majority of the facts pertaining to the commission of both conspiracies came from the testimony of co-conspirator Nathaniel Simms, who admitted participation in the relevant shootings and served as a witness on behalf of the government, pursuant to a plea agreement. . Ray subsequently identified Sanquan, Orlando, Best, and Simms from separate nine-person photo arrays as the men who had arrived at his house late that night. . While Simms was initially charged with the other co-defendants, he agreed to act as a government witness pursuant to a plea deal, and his case was severed from the others. . The government also presented Harxy Graham, Best’s friend, as a rebuttal witness. Graham testified that he was selling drugs in the area of Sixth and Brandywine Streets on March 30, 2010, when police swarmed the area. He stated that as he proceeded to leave the area in his car, he saw Best coming down Sixth Street, Best was sweating, breathing hard, and not wearing a jacket. Best asked Graham for a ride to his long-time girlfriend Sarah Proctor's apartment. When Graham asked Best about the gunshots, Best said he did not want to talk about it, and they rode to Proctor's apartment. . Specifically, for involvement in the first conspiracy, Sanquan, Orlando, Best, and Williams were charged with conspiracy, first-degree murder, assault with intent to kill while armed (“AWIKWA”), and related charges for the March 22, 2010 shooting at 1333 Alabama Avenue, Southeast. The indictment further alleged charges relating to the second conspiracy. Specifically, the indictment stated that after Orlando was shot in retaliation for Howe’s murder, Orlando, Best, Bost, and Williams conspired from March 23-30, 2010, to shoot attendees of Howe’s funeral. In order to obtain an additional firearm for the shooting, on March 30, 2010, Orlando, Best, and Bost attempted to rob Tavon Nelson of his firearm at the Win-gate Apartment complex, resulting in Nelson’s death. They each were charged with aggravated first-degree premeditated and felony murder for Nelson's murder. Immediately following Nelson's murder, Orlando, Best, Bost, and Williams conducted a drive-by shooting on the 4000 block of South Capitol Street on March 30, 2010, leading to the deaths of Brishell Jones, Devaugn Boyd, and William Jones, and injuries to Kevin Attaway (grievously injured), Jamal Blakeney, Ra’Shauna Brown, JaBarie Smith, Darrick Lanier, and Tierra Brown. For this second shooting, Orlando, Best, Bost, and Williams were further charged with three counts of aggravated first-degree premeditated murder, seven counts of AWIKWA, and related offenses. Orlando was separately charged with assault on a police officer (“APO”) while armed for ramming a police vehicle at the end of a high-speed chase immediately following the South Capitol Street shooting. . Rule 20 (a) states in pertinent part: When an indictment, information, or complaint is pending in the Superior Court against a defendant who is arrested, held, or present in another district, the prosecution may be transferred to that district if: (1) the defendant states in writing a wish to plead guilty or nolo contendere and to waive trial in the District of Columbia, consents in writing to the court’s disposing of the case in the transferee district; and (2) the United States attorneys in both districts approve the transfer in writing. (emphasis added), , Jurors 624, 064, and 490. . None of appellants’ counsel moved to strike these three jurors for cause, sought further questioning, nor raise any objection to their selection. . . The government contends that Orlando failed to preserve his request for a change of venue by not objecting to the jurors that were impaneled. The government also maintains that all of Orlando’s co-appellants, aside from Bost, failed to explicitly join in Orlando’s written motion, and that they therefore cannot join in Orlando's claim on appeal. We need not decide whether'plain error review governs here because Orlando’s argument is meritless under any standard of review,' . Orlando argues that our precedent, though binding, is unconstitutional under.the Supreme Court’s decision in Groppi v. Wisconsin, 400 U.S. 505, 91 S.ct. 490, 27 L.Ed.2d 571 (1971). We see no such tension. In Grop-pi, the defendant was charged with a misdemeanor and, because of “community prejudice,\" sought to change the venue of his trial from Milwaukee County to a different county in Wisconsin where he claimed prejudice against him did not exist, Id. at 506, 91 S.Ct. 490. The trial court denied the motion on the basis that Wisconsin law did not permit a change of venue for misdemeanor cases. The Supreme Court reversed, holding that \"under the Constitution a defendant must be given an opportunity to show that a change of venue is required in his case.\" Id. at 511, 91 S.Ct. 490. The difference between Groppi and here is that Wisconsin is a large state with multiple \"venues” within the same \"jurisdiction,\" whereas, again, in the District of Columbia, the Superior Court of the District of Columbia \"sits as a single unitary judicial district.” Welch, supra, 466 A.2d at 834. \"Venue is to be distinguished from ‘jurisdiction, ’ which refers to the authority or power of the court to take action on a particular charge.... To say that the judiciary has such jurisdiction, however, is not to say, that every judicial district within that judiciary is a proper locality [i.e,, venue] for the prosecution of that offense.” LaFave et al., Criminal Procedure, § 16.1 (a) (3d ed. 2014) (emphasis added). Further, as Groppi emphasized, \"[t]here are many ways to try to assure the kind of impartial jury that the [Constitution] guarantees.” 400 U.S. at 509, 91 S.Ct. 490. Orlando also claims that Super. Ct. Crim. R. 20 authorizes the Superior Court to transfer'his case to a federal court, His reliance on Rule 20. (a) is misplaced. Rule 20 (a) only applies to defendants charged .in Superior Court, but arrested outside of the District of Columbia. The Rule specifies that such defendants may plead guilty or nolo contendere to the charges in federal district court and waive trial in the-District of Columbia, so long as the United States Attorneys in both districts approve the transfer in writing. Orlando, however, was arrested and charged in the District of Columbia, and he elected to go to trial. Accordingly, a change of trial venue was not available to him or his co-appellants, - . Williams and Best also filed motions'to declare misjoinder or, alternatively, to grant severance, but their claims are not relevant for purposes of this appeal. Williams was indicted for involvement in both the first and second conspiracies and he was acquitted of all charges stemming from the first conspiracy. Meanwhile Best sought only severance of a charge of unlawful possession of a handcuff key while at the D.C. Jail, which the trial court granted. . The government claims and appellants do not appear to dispute that \"all offenses and all defendants are properly joined within each of the two charged conspiracies.” Accordingly, the argument on appeal is simply whether the first conspiracy charges (and all defendants involved in those charges) should have been tried separately from the second conspiracy charges.(and the.defendants involved in those charges), even though three of the five co-defendants overlap. . Rule 8 (b) was amended in 2016 to read as follows: The indictment or information may charge 2 or more defendants if they are alleged to have participated in the same act or transaction, or in the same series of acts or transactions, constituting an offense or offenses. The defendants may be charged in one or more counts together or separately. All defendants need not be charged in each count. . In contrast to Rule 8 (b), under Rule 8 (a), \"offenses may be joined if they are either similar in character or based on the same act or transaction,” so long as all offenses are alleged to have been committed by one defendant. Ray, supra, 472 A.2d at 857. . Other types of offenses that meet the definition of \"same series of acts or transactions” include \"offenses committed as a means to a specific common end, or where they are directed toward some shared goal” and “where the offenses are part of a common scheme or plan, involving the same place, a short period of time, and a similar modus operandi ....” Jackson v. United States, 623 A.2d 571, 579 (D.C. 1993). . Opinions issued by the United States Court of Appeals for the District of Columbia Circuit prior to February 1, 1971, are binding on this court. M.A.P., supra, 285 A.2d at 312. . Likewise, in Ball, we held that appellant Ball’s assault on a police officer charge was a “sequel” to appellant Jackson’s reckless driving charge. 26 A.3d at 768. We concluded that the “inception” was the police’s high-speed chase of appellants’ vehicle and \"[o]nce the [vehicle's] tire had blown, the occupants were logically forced to flee by foot, and when the officers closed in on them, the next logical step in evasion was to resist arrest.” Id. In other cases such as Bush and Medley, we concluded that joinder was proper when the \"sequel” offenses were attempts to obstruct justice or to cover-up the underlying offense. Bush, supra, 516 A.2d at 190; Medley, supra, 104 A.3d at 122. . The problem in Velasquez, however, was there was no evidence actually linking the retaliation to the cocaine conspiracy. Velasquez, supra, 772 F.2d at 1354. . It is important to note that the co-defendants did “not contest the fact that they were tried together, nor could they”; their challenge was simply that there should have been two trials, one for each alleged incident. Settles, supra, 522 A.2d at 352. . Similar cases to Settles include Davis and Jackson. In Davis, co-defendants Davis and Warren were charged in a forty-four count indictment alleging that they had raped a dozen women from 1972 to 1973 under similar circumstances. 367 A.2d at 1257-58. Some of the charges pertained to both Warren and Davis, while other charges were specific to Davis and other unidentified individuals. On appeal, Warren argued that the counts charging Warren and Davis were misjoined with counts charging Davis for having committed crimes with other unidentified individuals. This court agreed, concluding that there was \"no specific or unitary goal toward which all of the acts alleged in the indictment were directed” and \"there [was] no logical development of or relationship between the offenses because no crime necessarily led to or caused the subsequent offenses.” Id. at 1263. In Jackson, the three co-defendants were each indicted for armed robbery of three different liquor stores that occurred within a one-week period. 623 A.2d at 575. On appeal, we concluded that the three liquor store robberies, each involving a different store and date, did not share a sufficiently \"close connection” that met the \"series of acts or transactions” test, although we ultimately held that the misjoinder was harmless error. Id, at 581-82, .Super. Ct. Crim. R. 14 at the time the indictment was returned stated in pertinent part: ■ • If it appears that a defendant or the government is prejudiced by a joinder of offenses or of defendants in an indictment or information or by such joinder for trial together, the Court may order an election or separate trials of counts, grant a severance of' defendants or provide whatever other relief justice requires. Rule 14 was revised in 2016 to conform with the federal rule: \"If the joinder of offenses or defendants in' an indictment, an information, or a consolidation for trial appears to prejudice a defendant or the government, the court may order separate trials of counts, .sever the defendants’ trials, or provide any other relief that justice requires.” Super. Ct. Crim. R. 14 (a). . In Settles, it was two rapes of two different women that occurred a week apart from one another. 522 A.2d at 353. In Davis, it was twelve rapes that occurred over the course of a year. 367 A.2d at 1263. In Jackson, it was three liquor store robberies all on different days. 623 A.2d at 581. . Contrary to Sanquan’s and Bost’s argument, joinder of \"sequel” offenses is not limited to cover-ups or flight. But see Medley, ■ supra, 104 A.3d at 122 (\" ‘Sequel’ offenses include, inter alia, attempts to obstruct justice, which make appropriate the joint trial of an underlying offense and additional offenses committed by others in an attempt to hide the underlying offense.”). Scheve is -a perfect example of a case where the “sequel” crime did not constitute an attempt to cover-up or flee from the initial underlying offense. Another such example is Perez v. United States, 968 A.2d 39, 52-53 (D.C. 2009), where the government alleged that the defendants attacked a homeless man qnd then subsequently, when individuals passing by attempted to stop the attack, the defendants attacked the passersby and killed one of them. Id. at 53. We concluded that there was no. misjoinder of the assault on the homeless man, the murder, and the attack on the other passersby. Id. at 78-79. . Appellants also .argue that “[i]t is implicit in the language of Rule 8 (b) that while not .every defendant needs to have participated in every illegal act, all defendants must have participated in the series of illegal acts,” and that, because no appellant was charged in the attempt on Orlando’s life, the two conspiracies were improperly joined. We disagree with this argument. On this point, we agree with the government that the indictment need not charge every possible offense to establish that offenses are sequels for purposes of Rule 8 (b) joinder. The government need not have charged Howe's friends for shooting Orlando in order for the trial court to conclude that, as a factual matter, the shooting of Orlando was the link between the two conspiracies. . Alternatively, the government argues that the two conspiracies constituted a “part of. a common scheme or plan” with a “substantial overlap.in proof of the various crimes.” Jackson, supra note 19, 623 A.2d at 579. The government highlights the overlaps in evidence such as, inter alia, the fact that both conspiracies involved appellants Orlando, Best, and Williams, and turned-govemment-collaborator Simms; both involved use of the same AK-47; both relied on Williams to store the weaponry; and there was substantial overlap of evidence, in particular Simms's testimony. Id. at 581 (\"Where offenses are considered to constitute a series of ■ acts or transactions because they are part of a common scheme or plan, it is also necessary that there be a substantial overlap in ' proof the various crimes such that it would be difficult to separate proof of one from the other.”). While evidence of overlap is important, we think it is more important to decide whether the indictment actually \"show[ed] ... a common scheme connecting the two conspiracies,\" United States v. Nicely, 922 F.2d 850, 853 (D.C. Cir. 1991) (emphasis added), for joinder under the common scheme or plan criterion. Davis, supra, 367 A.2d at 1262 (common scheme or plan is one of three categories of cases that permit joinder under Rule 8 (b)). The D.C. Circuit, in analyzing the analogous federal Rule 8 (b) has held that \"[ojverlapping memberships,” alone, will not authorize joinder under Rule 8 (b) \"if the conspiracies cannot be tied together into one conspiracy, one common plan or scheme.” Nicely, supra, 922 F.2d at 853 (citation and internal quotation marks omitted). Here, it is difficult to see how the two conspiracies reasonably constitute an overarching \"common scheme or plan,” such that it could be considered, even if not charged, as one large conspiracy. The initial conspiracy to retaliate against individuals who stole Sanquan's bracelet does not share a similar purpose or plan with the second conspiracy to retaliate against Howe’s friends and family for the shooting of Orlando. While we agree with the government that the two conspiracies \"logically” led to one another, and that the charges and defendants were properly joined, we cannot agree that the two conspiracies constitute a \"common scheme or plan.” . Lastly, both Sanquan and Bost claim that the trial court should have given an additional limiting instruction that the jury could not use any evidence relating to one conspiracy in the evaluation of the other. We see no prejudice and, therefore, no error from the trial court’s omission to give this additional limiting instruction, especially considering the fact that appellants failed to request such an instruction. See Griffin v. United States, 144 A.3d 34, 36 (D.C. 2016) (failure to object to instruction limits appellate review to plain error). The trial court explained to the jury during preliminary instructions and again during closing instructions that Sanquan was not charged for acts committed under the second conspiracy and Bost vice versa. We are satisfied that these instructions prevented jury confusion on the charges. \"It is accepted that in any trial involving multiple defendants, some amount of potential prejudice is permissible if outweighed by considerations of economy and expedition in judicial administration,” Payne v. United States, 516 A.2d 484, 490 (D.C. 1986) (citation omitted). . The standard “requires that the trial judge undertake a three-step inquiry to ascertain (1) whether the declarant, in fact, made a statement; (2) whether the declarant is unavailable; and (3) whether corroborating circumstances clearly indicate the trustworthiness of the statement.” Laumer, supra, 409 A.2d at 199. . The court was presented with evidence that: (1) Best never returned to Salazar’s apartment at the'time she claimed that he made his confession to her, (2) Salazar had a motive to testify against Best in order to protect her boyfriend Simms, (3). Salazar admitted to smoking marijuana during the time of the alleged confession, (4) Salazar initially told police that Best never made any statements to her regarding the shootings, and (5) there was a discrepancy in her statement because she said that Best told her M.C. (the juvenile who was mistakenly arrested) was innocent, when at the time, the fact that M.C. had been arrested was not known to the public. . The court also found that Best’s non-verbal responses to his mother were admissible as adoptive admissions, a ruling which Best likewise challenges on appeal. We agree with the trial court's decision. “A defendant may make an admission by adopting or acquiescing in the statement of another.” Blackson v. United States, 979 A.2d 1, 6 (D.C. 2009) (citation and internal quotation marks omitted). The adoption need not be explicit, but may be inferred by the surrounding circumstances of the conversation. Id. at 7. For the same reasons that we conclude the trial court did not err in admitting the videotape under prong one of the Laumer standard, we conclude that Best’s non-verbal responses were admissible as adoptive admissions as evidence against Best based on the context and surrounding circumstances of the conversation. . Salazar’s testimony about Best’s confession. would likewise be admissible as an admission of a party opponent as evidence against Best. See, e.g., Chaabi v. United States, 544 A.2d 1247, 1248 (D.C. 1988) (\"The basis for allowing an admission into evidence is the ability of the party to rebut the testimony, thereby avoiding the danger prevented by the hearsay rule, that is, the inability to cross-examine an out-of-court assertion.”) (citation and internal quotation marks omitted). . Michael O’Keefe was appointed as an Associate Judge on the Superior Court of the District of Columbia in September 2013, following the conclusion of his representation of Best. For purposes of this opinion, we will refer to Judge O’Keefe as \"Mr. O’Keefe.” . In Edwards v. Arizona, 451 U.S. 477, 485-86, 101 S.Ct. 1880, 68 L.Ed.2d 378 (1981), the Supreme Court held that a defendant who invokes his Miranda right to counsel cannot be reinterrogated without the presence of counsel unless the defendant initiates the subsequent conversation. ■ . This case is similar to Graham, where the defendant, after invoking his right to counsel, spoke privately to his mother arid after a forty-five minute conversation, confessed to murder. 950 A.2d at 725-26. . Because we conclude on three individual bases that the motion, to suppress would have failed, we need not consider the prejudice prong of Strickland. We do note, however, that the evidence against Best was substantial as recited by the trial court in its findings.\n\n",
    "body_length": 162854,
    "citedas": [
      "178 A.3d 1156"
    ],
    "attorneys": "- Kristina A. Crooks for appellant Robert L. Bost., E. Benton Keatley, with whom Jeffrey T. Green, Lowell J. Schiller, Karen S, Smith, and Blair J. Greenwald were on the brief, for appellant Jeffrey Best., Thomas T. Heslep for appellant Lamar J. Williams., Joshua Deahl, Public Defender Service, with whom James Klein and Samia Fam, Public Defender Service, were on the brief, for appellant Sanquan Carter., R. Trent McCotter, with whom Jessie K. Liu and Michael W. Khoo were on the brief, for appellant Orlando Carter., Stephen F. Rickard, Assistant United States Attorney, with whom Channing D. Phillips, United States Attorney at the time the brief was filed, and Elizabeth Trosman, John-P. Mannarino, Michael D. Britain, and T: Anthony Quinn, Assistant United States Attorneys, were on the brief, for appellee.",
    "category": [],
    "judges": "Blackburne, Ferren, Fisher, Rigsby",
    "citation_count": 1
  }
}
