{
  "id": "M8XwXmYBTlTomsSBKH2b",
  "document": {
    "title": "CITIZENS COMMITTEE TO RECALL RIZZO v. BOARD ELECTIONS CITY AND COUNTY PHILADELPHIA ET AL.",
    "full_title": "CITIZENS COMMITTEE TO RECALL RIZZO, BY SHELLY D. YANOFF, TRUSTEE AD LITEM, ET AL. v. THE BOARD OF ELECTIONS OF THE CITY AND COUNTY OF PHILADELPHIA ET AL. IN NO. 90. APPEAL OF THE HON. FRANK L. RIZZO, MAYOR OF THE CITY OF PHILADELPHIA, IN NO. 89",
    "jurisdiction": "Supreme Court of Pennsylvania",
    "date": "1976-11-19T00:00:00.000Z",
    "docket": "Howard Gittis, Bernard Chanin, Philadelphia, for appellant in No. 89.",
    "body": "OPINION\n\nThis matter is before this Court on appeals\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e by appellants, the Board of Elections of the City and County of Philadelphia (hereinafter referred to as the \"Board of Elections\" or the \"Board\") and the Honorable Frank L. Rizzo, Mayor of the City of Philadelphia (hereinafter referred\n\n    to as \"Mayor Rizzo\" or the \"Mayor\"), from an Order of the Court of Common Pleas of Philadelphia County, entered on September 16, 1976. The order of the trial court was entered in an action in mandamus initiated by the appellees, Citizens Committee to Recall Rizzo and Shelly D. Yanoff, Henry T. Reath, Arthur F. Grant, Joseph Mikuliak, H. Patrick Swygert and Alfred Fleming, individually and on behalf of classes of persons similarly situated (hereinafter referred to collectively as the \"Recall Committee\"), to compel the validation of the petition to recall Mayor Rizzo, which the Recall Committee had submitted to the Board of Elections pursuant to Article IX of the Philadelphia Home Rule Charter.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e The end result of the Order issued by the court below was to grant the Recall Committee's request for a writ of mandamus compelling the Board of Elections to accept the recall petition for filing and to implement the requisite procedures for the holding of the recall election on November 2, 1976.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe chronology of the case, although not fundamental to the resolution of the issues presented on these appeals, is of assistance in placing in perspective the difficulties which enshroud these proceedings.\n\nOn June 15, 1976, the Recall Committee submitted to the Board a petition to recall Mayor Rizzo, consisting of 20,156 pages of paper containing 210,806 signed lines, and accompanied by 5,039 affidavits, pursuant to Section 9.9-101(1) of the Philadelphia Home Rule Charter. As provided by Section 9.9-101(3) of the Charter, the Board of Elections commenced an examination of the petition\n\n    for the purpose of determining its validity for filing or rejection.\n\nOn June 30, 1976, prior to expiration of the fifteen-day period for completion of the examination as provided by statute, the Board filed an action for declaratory judgment, seeking an extension of the fifteen-day requirement and the Court of Common Pleas, by Order dated July 7, 1976, granted an extension to the Board to midnight on August 9, 1976.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e The Board of Elections, seeking a further extension of time, filed a Petition to Amend the Order of July 7, 1976, on August 4, 1976. The trial court permitted the Board to continue its examination of the recall petition during the pendency of the proceedings on its subsequent petition for extension of time. Prior to a ruling by the trial court on the Board's Petition for further extension of time, the Board, on August 24, 1976, ruled that the recall petition was invalid and rejected it.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e On August 25, 1976, the Recall Committee initiated an action in mandamus against the Board, seeking to require the Board to file the recall petition and to order a recall election. On August 30, 1976, appellant, Mayor Rizzo, petitioned to intervene as a defendant\n\n    and that petition was granted on August 31, 1976.\n\nThe trial court determined that an expeditious resolution of the issues was required because of the public importance of the recall question and the approaching deadline for placing the recall issue on the November ballot. Accordingly, it set forth an accelerated schedule for the filing of responsive pleadings and supportive briefs, pursuant to Pennsylvania Rule of Civil Procedure 1003. Upon resolution of the mandamus action in favor of the Recall Committee, these appeals followed.\n\nOn these appeals we are confronted with three primary issues: (1) the propriety of the trial court in entertaining the action in mandamus and granting the writ as requested; (2) the sufficiency of the evidence and the correctness of the legal position upon which the Board rejected the recall provisions; and (3) the constitutionality of the recall provisions of Article IX of the Philadelphia Home Rule Charter.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e These issues will be addressed seriatim.\n\nI. Mandamus\n\nAppellant, Board of Elections, has contested the propriety of the action in mandamus brought by the Recall Committee on the theory that the trial court lacked jurisdiction to review the decision of the Board by way of mandamus. Jurisdiction relates only to the competency of the particular court to hear and determine the controversy of the class to which the disputed case belongs. American Labor Party Case, 352 Pa. 576, 44 A.2d 48 (1945). \"The test of jurisdiction is whether the court has power to enter upon the inquiry, not whether it may ultimately decide that it is unable to grant the relief\n\n    sought in the particular case.\" Main Cleaners \u0026 Dyers, Inc. v. Columbia Super Cleaners, Inc., 332 Pa. 71, 74, 2 A.2d 750, 751 (1938). Whether the writ of mandamus was properly granted by the trial court below in no way affects the competency of that court to entertain such an action. The trial court may have had jurisdiction to consider the action for a writ of mandamus in the instant case; yet may have acted erroneously in granting the requested relief. These are separate inquiries and require individual consideration. American Labor Party Case, supra.\n\nJurisdiction to consider a petition for a writ of mandamus against a board of elections unquestionably lies in the court of common pleas by virtue of statutory grant.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e Cf. Oberleitner v. Bolinger, 42 Pa.D. \u0026 C.2d 623 (1967). The Board, however, contends that the Recall Committee's proper recourse was to perfect an appeal from the Board's determination, pursuant to the provisions of the Local Agency Law.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e Even if the Board is correct in its contention, this argument does not go to the jurisdiction of the lower court to entertain an action for a writ of mandamus, but only to whether the writ was properly granted. It cannot be seriously argued that the Local Agency Law in some way removes the jurisdiction of the court of common pleas to hear petitions for writs of mandamus against boards of elections. See Young v. Littlestown Area School District, 24 Pa. Commw. 621, 358 A.2d 120 (1976); Flinn v. Pittenger, 19 Pa. Commw. 54, 338 A.2d 735 (1975); Manheim Township School District v. State Bd. of Educ., 1 Pa. Commw. 627, 276 A.2d 561 (1971). We are convinced that the court below did have the requisite jurisdictional power to entertain the instant controversy through a petition for a writ of mandamus.\n\nBeing so convinced, our inquiry must now turn to the alternative question raised by appellant Board of Elections, as to whether the order of the court below, granting the writ of mandamus to the appellees, was appropriate under the circumstances present here.\n\nInitially, we are obliged to emphasize that mandamus is an extraordinary legal remedy which will only issue when the petitioner seeking relief establishes that: (1) there is a want of any other adequate, appropriate and specific remedy available; (2) there is a clear legal right to which he is entitled; and (3) there exists a corresponding duty on the part of the defendant. Porter v. Bloomsburg State College, 450 Pa. 375, 301 A.2d 621 (1973); Valley Forge Racing Assoc. v. State Horse Racing Commission, 449 Pa. 292, 297 A.2d 823 (1972); Mellinger v. Kuhn, 388 Pa. 83, 130 A.2d 154 (1957); Garratt v. Philadelphia, 387 Pa. 442, 127 A.2d 738 (1956). The burden of proof is clearly upon the party seeking this extraordinary remedy to establish his legal right to such relief.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e\n\nIn considering the first prerequisite to obtaining relief in mandamus, we must determine if the appellees had available an adequate alternative legal remedy by which to seek relief from the Board's determination. If so, the court below should have denied the requested extraordinary writ. Mellinger v. Kuhn, supra; Commonwealth v. Mitchell, 82 Pa. 343 (1876). In Commonwealth v. Mitchell, supra, at 350, this point was clearly enunciated:\n\n\"It is a well-established rule that he who sues for the writ of mandamus, must have some well-defined right\n\n    to enforce, which is specific, complete and legal, and for which there is no other specific legal remedy, and the right he claims must be independent of that which he holds in common with the public at large.\" (emphasis added)\n\nIt is the position of the Board, in this regard, that the Recall Committee possessed an adequate alternative legal remedy to that of mandamus by way of the appeal process provided under the Local Agency Law.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e The trial court found, however, that the \"determination\" made by the Board of Elections as to the validity of the recall petition did not fall within the meaning of \"adjudication\" as defined by Section 11302 of the Local Agency Law.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e Relying on that conclusion, the trial court rejected the proposition that the Local Agency Law provided an adequate alternative legal remedy to that of mandamus. For the reasons which follow, we agree with the court below in this respect.\n\nFirst, in the definition of \"adjudication\" provided in the Act, Section 11302 speaks of a decision affecting rights of \"the parties to the proceeding in which the adjudication is made\" (emphasis added). In the case of a recall petition being submitted for acceptance (filing) to the Board of Elections, no provision is made for \"parties,\" other than perhaps the Board itself, to be a part of the \"proceeding\" to determine the petition's validity. Section 9.9-101 of the Philadelphia Home Rule Charter provides only that the recall petition \"shall be tendered for filing to the board of elections.\" The Board then, in brief, has the obligation to either approve or disapprove the petition. No provision is made which contemplates\n\n    the participation of the petitioner in any proceeding before the Board.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nSecond, the Act in Section 11302(3) defines \"party\" as \"any person who appears in a proceeding before a local agency . . . .\" (emphasis added). Since the appellees did not make an appearance at the examination \"proceeding\" of the recall petition (and could not have done so under any provision of the Charter), by definition the appellees in the instant case would not fall within the compass of the Local Agency Law provisions.\n\nIn addition, a reading of the Local Agency Law in its entirety leads to the conclusion that the Act was intended to encompass \"adjudications\" in which the parties are given an opportunity to present evidence either in support or against the propositions being undertaken. Thus, we conclude that not all decisions or determinations rendered by \"local agencies\" are within the scope of the Local Agency Law and that, in particular, the determination by the Board of Elections in rejecting the recall petition was not subject to review under the provisions of the Local Agency Law. See, e. g., Young v. Littlestown Area School District, 24 Pa. Commw. 621, 358 A.2d 120 (1976); Flinn v. Pittenger, 19 Pa. Commw. 54,\n\nA.2d 735 (1975); Manheim Township School District v. State Bd. of Educ., 1 Pa. Commw. 627, 276 A.2d 561 (1971). The Recall Committee had no other adequate legal remedy available to it and, therefore, satisfies the first prerequisite for relief in mandamus.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e\n\nIt is axiomatic that mandamus will issue only to compel an officer or agency to perform a purely ministerial duty.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Valley Forge Racing Assoc. v. State Racing Commission, 449 Pa. 292, 297 A.2d 823 (1972); Rose Tree Media School District v. Dept. of Public Instruction, 431 Pa. 233, 244 A.2d 754 (1968). \"[I]t is well settled that mandamus will never lie to compel a review of a decision of an administrative body or person invested with discretion, which has already acted in the matter in accordance with law.\" Raffel v. Pittsburgh, 340 Pa. 243, 246, 16 A.2d 392, 393 (1940).\n\nMandamus is inappropriate to control the exercise of discretion vested in a public officer who is obliged to perform a particular duty. But a duty may be discretionary within limits and the officer may not transgress those limits. If he does, mandamus is an appropriate remedy. Work v. United States ex rel. Rives, 267 U.S. 175, 177, 45 S.Ct. 252, 69 L.Ed. 561 (1925). In Travis v. Teter,\n\nPa. 326, 330, 87 A.2d 177, 179 (1952), this Court stated:\n\n\"It is well settled that in a mandamus proceeding a Court can compel a public official who is vested with a discretionary power to exercise that discretion; but (unless the discretion is arbitrarily or fraudulently exercised or is based upon a mistaken view of the law) it cannot interfere with or control the official's discretion or judgment. Expressed another way, it is the discretion and judgment of the official (who is vested with a discretionary power) which prevails and not that of a Court or a jury or a person aggrieved; and a Court cannot compel such official to exercise his discretion in a manner which will produce a result which the Court may deem wise or desirable. . . .\" (emphasis added)\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e\n\nThe issue with which we are now confronted is whether the trial court's grant of the writ of mandamus operated to usurp the proper exercise of the Board's discretion or whether it operated to remedy an arbitrary, fraudulent or illegal exercise of such discretion. Prior to reaching a conclusion on this point, it is necessary to determine the exact nature and scope of the Board's discretionary power under the applicable provision of the Home Rule Charter.\n\nSection 9.9-101(3)\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e of the Philadelphia Home Rule Charter sets forth the obligations of the Board with respect to the examination of the recall petition. The language of that section imports a duty which is partially ministerial and partially deliberative. As to the ministerial aspect of the Board's duty, there appears to be little doubt that the Board is obliged to \"complete its examination of the petition within fifteen days and shall\n\n    thereupon file the petition if valid or reject it if invalid.\" This duty is purely ministerial in the sense that the Board is required to act on the validity of the petition within the prescribed time frame. See, e. g., State v. Scott, 52 Nev. 216, 285 P. 511 (1930).\n\nHowever, in reaching the decision of whether to accept the petition, the Board is accorded the ultimate discretion as to the validity of the petition. In exercising that discretion the Board was bound to do so in good faith and in a legally sound manner. The discretion, in other words, was not unrestrained. Tanenbaum v. D'Ascenzo, 356 Pa. 260, 51 A.2d 757 (1947).\n\nThe trial court, by concluding that the writ of mandamus should issue, obviously believed that the Board transcended the parameters of that discretion in rejecting the signatures which fell into the enumerated unacceptable categories. In so holding, the trial court fell into error by substituting its determination as to the sufficiency of the recall petition for that of the Board. See City Commission of Pampa v. Whatley, 366 S.W.2d 620 (Tex.Civ.App.1963); Fraser v. Cummings, 48 Cal.App. 504, 192 P. 100 (1920).\n\nThat the scope of review by a court in a mandamus proceeding is severely limited was made clear by this Court in Morrison v. Pittsburgh, 351 Pa. 95, 98, 40 A.2d 406, 407 (1944):\n\n\"'Where a person or body is clothed with judicial, deliberative, or discretionary powers, and he or it has exercised such powers according to his or its discretion, mandamus will not lie to compel a revision or modification of the decision resulting from the exercise of such discretion, though, in fact, the decision may have been wrong.' Souder v. Philadelphia et al., 305 Pa. 1, 8, 156 A. 245; Raffel v. Pittsburgh, 340 Pa. 243, 16 A.2d 392.\"\n\nIn Slessinger v. Fairley, 340 Pa. 273, 275, 16 A.2d 710, 711 (1940), this Court, considering the request for a writ\n\n    of mandamus for the reinstatements of several police officers, reasoned that:\n\n\". . . the learned court below took the position that [admissible hearsay evidence] was not sufficient to establish just cause for plaintiffs' dismissals. In this the court fell into error, since it had no authority in a mandamus proceeding to weigh admissible testimony and hold that the administrative body was not warranted in arriving at its decision. Raffel v. City of Pittsburgh et al., 340 Pa. 243, 16 A.2d 392.\"\n\nAlthough the identical factual situation has not previously been considered by this Court, the question, as to the scope of the discretion vested in a board of elections (or municipal officer) in validating a recall petition, has been considered in other jurisdictions. In the case of Fraser v. Cummings, 48 Cal.App. 504, 508-09, 192 P. 100, 102 (1920), the California Court of Appeals was presented with a mandamus action to compel certification of a recall petition by the city clerk. In concluding that mandamus would not lie in that instance, the court stated:\n\n\"Where the city clerk refuses to act as required by the charter, or where there is a showing of such an abuse of discretion as would indicate that no discretion was exercised, the courts may by mandamus compel the clerk to perform his duty under the charter. But here the showing is that the clerk did perform his duty and if, in the exercise of that duty, he reached a different conclusion from what this court might reach on the question of the necessity of showing the cross streets, this court has no jurisdiction to substitute its judgment for his. In other words, the people of the city of Oakland have in their charter conferred upon the city clerk the exclusive power to finally determine whether a recall petition conforms to all requirements of the charter, and they have thereby denied to the courts the power of reviewing such determination in a\n\n    proceeding of this kind. It is the function of the courts to interpret the law as they find it, and to leave to the municipal officers the duty of executing the law as enacted. Where the people have conferred upon a ministerial officer an exclusive power to determine for them a certain fact, it is not the province of the courts to substitute their judgment for that of the officer so chosen. To do so would be to set aside the plain dictates of the law.\" (emphasis added)\n\nAccord, City Commission of Pampa v. Whatley, 366 S.W.2d 620 (Tex.Civ.App.1963); Hartsock v. Merritt, 93 Cal.App. 365, 269 P. 757 (1928).\n\nIn the instant case, the trial court erred in granting the writ of mandamus by reversing the Board's determination that the petition was defective as a result of its finding that 115,818 signatures were void due to illegal notarizations and that 22,159 signatures were invalid because of irregularities in the appended affidavits. In reaching its decision, we believe the trial court was substituting its determination as to the propriety of the petition for that of the Board of Elections. This was clearly erroneous. The city charter vested the discretionary power as to the sufficiency of the petition for recall in the Board and it was error for the lower court to substitute what it believed to be a more appropriate finding for that of the Board. In the case of City Commission of Pampa v. Whatley, 366 S.W.2d 620, 623 (Tex.Civ.App.1963), the Texas Court of Civil Appeals stated:\n\n\"'Although mandamus is the appropriate remedy to compel the performance of a duty which is plain, positive, and ministerial in character and clearly imposed by law, it does not necessarily follow merely because the duty is discretionary or that the element of discretion exists in part, that mandamus will not lie. The correct rule is that mandamus will not lie where the duty is clearly discretionary and the party upon whom the duty rests has exercised his discretion reasonably Page 15} and within his jurisdiction; that is, upon facts sufficient to support his action.'\"\n\nQuoting Ferris, Extraordinary Legal Remedies § 206. See also Miller v. State, 53 S.W.2d 838, 840 (Tex.Civ.App.1932). It is true that the Board could not base its determination on arbitrary and capricious grounds or an erroneous interpretation of law: Garratt v. Philadelphia, 387 Pa. 442, 127 A.2d 738 (1956); Tanenbaum v. D'Ascenzo, 356 Pa. 260, 51 A.2d 757 (1947), but we are not persuaded that such was the case with respect to the above mentioned categories. Rather, we believe that the Board made a good faith determination within the lawful bounds of its discretion that the petition was defective as a result of the signatures which fell into the \"illegal notarizations\" and \"irregular affidavits\"\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e categories. Whether this Court would adopt the stringent criteria employed by the Board if we were charged with the deliberative power to certify the recall petition is irrelevant. The discretionary power to determine the validity of the recall petition was vested neither in this Court nor the court below, but in the Board of Elections. As long as that body exercised such deliberative powers within the ambit of the authority granted to it in the Home Rule Charter, the trial court was not at liberty to substitute its determination for that of the Board.\n\nIt must be remembered that in order for the appellees to be entitled to the issuance of the writ of mandamus,\n\n    they must demonstrate that they have a clear legal right to such remedy. The burden cannot be shifted to the Board of Elections to justify its decision. We, therefore, conclude that the Board did not exceed its discretionary powers regarding the invalidation of those signatures which fell within the above mentioned classifications and that the trial court erred in granting the writ of mandamus in the instant case.\n\nII. Sufficiency of the Recall Petition\n\nIn regard to the sufficiency of the petition, the court below held that the Board of Elections had acted arbitrarily and contrary to law when it rejected approximately 67,000 signatures on the petition.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Having validated these, the court held that sufficient signatures had been presented for the Board to file the petition and place the recall question on the ballot.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e We reverse the finding that the required number of signatures was presented because the court below, in this mandamus action, improperly substituted its judgment for that of the Board.\n\nThe Board found that 57,494 signatures were accompanied by irregular affidavits, but it rejected only 22,159 for this reason alone.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e The affidavits were found to be\n\n    false for either of two reasons: (1) there were gross irregularities on the petitions to which they were appended; or (2) the affiants had falsely sworn as to their addresses or their status as registered voters in Philadelphia. The court below, overturning the ruling of the Board that these 22,159 signatures should not be counted because of the false affidavits, added them to the already validated signatures. In so doing, the court erred.\n\nThe Charter sets out the requirements for the recall petition as follows:\n\n\"(2) Each elector signing a recall petition shall add to his signature his occupation, his residence, stating the ward, and the date of signing. Signatures on a recall petition may be on separate sheets but each sheet shall have appended to it the affidavit of some person, not necessarily a signer of the petition, that to the best of the affiant's knowledge and belief the persons whose signatures appear on the sheet are registered electors of the City, or of the district, as the case may be, that they signed with full knowledge of the contents of the petition, and that their residences are correctly given.\"\n\nCharter, § 9.9-101(2) (emphasis added). It then proceeds to delineate the Board's power with regard to any petition filed:\n\n\"(3) A recall petition shall be tendered for filing to the board of elections having jurisdiction over elections in the City. Such board shall examine it to see whether it contains a sufficient number of apparently genuine signatures. The board may question the genuineness of any signature or signatures appearing on the recall petition and if it shall find that any such signature or signatures are not genuine, it shall disregard them in determining whether the petition contains a sufficient number of signatures. It shall also disregard any signature dated more than sixty days before the date the petition was tendered for filing.\n\n    the purported signators.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e We are not concerned here with the validity of the particular signatures which led the Board to challenge these affidavits. The issue before us is whether the Board could properly find the affidavits to be false based upon the large number of such defects which appeared on these sheets.\n\nOur courts have held that an affiant must have some knowledge of the facts in the affidavit to which he is swearing. Socialist Labor Case, 332 Pa. 78, 1 A.2d 831 (1938); Frank Petition, 173 Pa. Super. 400, 98 A.2d 255 (1953); In re Nomination Petition of Elliott, 26 Pa. Commw. 20, 362 A.2d 438 (1976). We do not find it to be an unreasonable inference from the evidence before the Board that the affiants were aware of these irregularities and, therefore, could not have properly sworn to these affidavits. Such patent irregularities raise a question as to the accuracy of the affiant's statement that to the best of his \"knowledge and belief the persons whose signatures appear on the sheet are registered electors of the City . . . that they signed with full knowledge of the contents of the petition, and that their residences are correctly given.\" Charter, § 9.9-101(2).\n\nAdditionally, there arose a negative inference from the failure of the affiants to answer the Board's subpoenas and to explain the discrepancies in their petitions. When a party having control of material evidence fails to produce it, an inference arises that the evidence would be unfavorable to that party. See Downey v. Weston, 451 Pa. 259, 301 A.2d 635 (1973); Haas v. Kasnot, 371 Pa. 580,\n\nA.2d 171 (1952); Lutsko v. Department of Transportation, 13 Pa. Commw. 150, 318 A.2d 361 (1974). The subpoenas were issued in order to permit the affiants to explain the irregularities. Such an opportunity negates any conclusion that the Board's finding was arbitrary. It was for the Board to weigh these findings against the facial validity of the affidavits. Where, as here, there is evidence upon which the Board could base its determination, the court, in a mandamus action, cannot substitute its judgment as to the weight of such evidence. Slessinger, supra; Raffel, supra.\n\nThe Board also properly rejected those affidavits in which the affiant had sworn to false statements. Whether the statements were mandated by the Charter, or otherwise material, is not the issue. This Court will take a strict approach when the probity of the process is involved. See In re Nomination Petition of Cianfrani, 467 Pa. 491, 359 A.2d 383 (1976). Any falsity in an affidavit casts doubt on the accuracy of the entire affidavit and thus, the authenticity of the petition. The Board could properly conclude that the affidavits were false.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nHowever, the court below held that even if these affidavits were false the otherwise valid signatures should not be discounted. This holding was also in error. The Charter itself requires that \"each sheet shall have appended to it the affidavit of some person, not necessarily a signer of the petition, that to the best of the affiant's knowledge and belief the persons whose signatures appear [have met certain requirements].\" Charter, § 9.9-101(2). The Board shall eliminate any sheet which does not have the required affidavit attached. Charter, § 9.9-101(3).\n\nAs Mr. Justice Nix stated for the Court in Cianfrani, supra:\n\n\"[O]ur cases have made clear that the provisions of the election laws relating to the form of nominating petitions and the accompanying affidavits are not mere technicalities but are necessary measures to prevent fraud and to preserve the integrity of the election process. See, e. g., Catherine Township Liquor Referendum Case, 382 Pa. 291, 293, 114 A.2d 145, 146 (1955); Harrisburg Sunday Movie Petition Case, 352 Pa. 635, 638, 44 A.2d 46, 47 (1945). The requirements of sworn affidavits are to insure the legitimacy of information crucial to the election process. Thus, the policy of the liberal reading of the Election Code cannot be distorted to emasculate those requirements necessary to assure the probity of the process.\"\n\nId. at 494, 359 A.2d at 384 (emphasis added). The Court went on to hold that \"a false affidavit must be at least equated with the failure to execute the affidavit.\" Id. Since affidavits are necessary for the probity of the recall process, the submission of false affidavits did not comply with the Charter provision that the required affidavits be appended and, therefore, the signatures were properly rejected by the Board. This holding reaches not only the 22,159 signatures rejected under this category, but the entire 57,494 signatures accompanied by these affidavits. Thus, regardless of the validity of these signatures under any of the other categories, they must be rejected if accompanied by a false affidavit.\n\nThe next classification to which we turn is that termed \"illegal notarizations.\" The court below held that the Board's rejection of 115,818 signatures for this reason was erroneous because, even if the notaries acted improperly, this should not invalidate otherwise proper signatures. We disagree. The Board acted properly when it found these notarizations to be illegal and refused to count the signatures to which the affidavits were attached.\n\nThe court, therefore, was in error in substituting its judgment when the Board acted neither arbitrarily nor contrary to law.\n\nThe Notary Public Law provides in pertinent part: \"No notary public may act as such in any transaction in which he is a party directly or pecuniarily interested.\" Act of August 21, 1953, P.L. 1323, § 19(e), 57 P.S. § 165(e) (1964). The purpose of such a statute is to ensure impartiality on the part of a notary with regard to the matter before him. This policy was articulated in a case concerning a statute which provided that no bank officer or stockholder could serve as a notary public.\n\n\"A notary has a sort of judicial power. His protests, attestations, and other official acts, certified under his hand and seal of office, are evidence of the facts therein certified. It is necessary, therefore, that he should not be interested in favor of the parties who are oftenest invoking his services.\"\n\nCommonwealth v. Pyle, 18 Pa. 519, 520 (1852).\n\nIn the present case, affidavits notarized by sixteen people were found by the Board to have been illegally notarized because these people had a direct interest in the matter. These sixteen included the attorney for the Recall Committee, the coordinator and two salaried employees of the Committee who were also circulators of the petition, and twelve persons who were only circulators.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e What degree of interest would bar a person from acting as a notary public is a question to be answered on the facts of each case. See Schirmer v. Myrick, 111 Vt. 255, 20 A.2d 125 (1940); 66 C.J.S. Notaries § 6 at 618. On the facts of this case, these people had a direct interest\n\n    within the meaning of our statute which would bar their notarization of these affidavits.\n\nThese persons were separate and apart from the general public with regard to their interest in this petition.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e They were dedicated to the success of this petition, eventually seeking the removal of the Mayor. All were actively involved in the yeoman effort to promote the recall, whether in the organization of the drive or in the actual solicitation of the signatures necessary for its success. When one steps beyond the point of signing his name to a petition and actually solicits other signatures, he has more than a general interest as a citizen in the outcome. By notarizing these affidavits they were performing an act essential to the achievement of their interests since affidavits are required for filing of the petition. Charter, § 9.9-101(3). They were advancing their own interests by ensuring the success of their efforts and the achievement of their political goals. This is the type of action by a notary public which the statute is designed to prevent because the impartiality which lends credence to the authenticity of the affidavit is destroyed. See, e. g., Commonwealth v. Pyle, supra. This rule has been applied where a candidate notarized the affidavits of circulators of his own nomination petition. State ex rel. Reed v. Malrick, 165 Ohio St. 483, 137 N.E.2d 560 (1956); Schirmer v. Myrick, supra. The key to such decisions appears to be the destruction of impartiality by the candidate's interest in having his nomination succeed. We see no reason to distinguish on the basis of candidacy. Here, these people had an interest in a similar\n\n    political goal -- getting a question on the ballot -- which was advanced by their actions.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e\n\nWe therefore hold that Section 19(e) of the Notary Public Law barred these people from acting as notaries in this case. Since this section is a limitation upon the power of notaries to act, their acts were nullities and the affidavits were void. The Board, therefore, properly rejected the signatures to which these void affidavits were appended. Charter, § 9.9-101(3). See Cianfrani, supra. The court below is reversed.\n\nWhile either of these issues alone is dispositive of the issue of sufficiency,\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e we note that the court below was correct in holding that the Board acted erroneously under the law in striking the signatures in the following categories: \"insufficient signature;\" \"abbreviations,\" \"initials,\" \"incorrect ward;\" and \"forgeries/alterations.\" The signatures rejected for those reasons should have been counted as valid and the court properly corrected the abuse of the Board's discretion.\n\nIII. Constitutionality of Recall\n\nThough we reverse the court below on procedural grounds, it is still necessary to resolve the question of the constitutionality of the recall provisions in the Philadelphia Home Rule Charter. We understand that many\n\nPennsylvania municipalities, boroughs and townships have or are presently considering the inclusion of recall provisions in their governing charters, and we would be neglectful of our duty if we did not promptly rule on this matter. All sides in this contest have argued with great learning and skill the constitutional validity of recall. We are convinced, after listening to and reading these arguments, that recall, as provided for in the Philadelphia Home Rule Charter, is violative of the Pennsylvania Constitution, Article VI, Section 7.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Rather than dashing the hopes and expectations of citizens around the state who may approve recall proposals only to find, by a later ruling of this Court, that their actions were to no avail, we prefer to set guidelines for the future. See Schultz v. Philadelphia, 385 Pa. 79, 122 A.2d 279 (1956).\n\nUndoubtedly, the entire Home Rule Charter of Philadelphia has the force and status of an enactment of the legislature. Addison Case, 385 Pa. 48, 122 A.2d 272 (1956). As such, it is presumed constitutional and the burden of proving a violation rests on those who allege unconstitutionality. Cali v. Philadelphia, 406 Pa. 290, 177 A.2d 824 (1962); Statutory Construction Act of November 25, 1970, P.L. 707, added December 6, 1972, P.L. 1339, § 3, 1 Pa.C.S. § 1922(3). The presumption in favor of the constitutionality of statutes is a strong one, reflecting \"on the part of the judiciary the respect due to the legislature as a co-equal branch of government.\" School Districts of Deer Lakes and Allegheny Valley v. Kane, 463 Pa. 554, 562, 345 A.2d 658, 662 (1975). Indeed, as we have stated before, we must defend statutes against constitutional attack unless they \"clearly, palpably and plainly\" violate the Constitution. Daly v. Hemphill, 411 Pa. 263, 271, 191 A.2d 835, 840 (1963). But, the presumption is neither irrebuttable nor conclusive.\n\nThe judiciary, no less than the legislature, is sworn to uphold the Supreme Law, the Constitution. It is the \"absolute framework of government,\" adopted by the people of Pennsylvania, \"and no person nor branch of government has any more power than is provided\" therein. Shapp v. Butera, 22 Pa. Commw. 229, 233, 348 A.2d 910, 912 (1975); Cali v. Philadelphia, supra; Commonwealth ex rel. Truscott v. Philadelphia, 380 Pa. 367, 111 A.2d 136 (1955); Bowman's Case, 225 Pa. 364, 74 A. 203 (1909). When constitutional powers have been exceeded by a legislature or a municipality, it is the obligation of the judiciary to preserve the fundamental law and declare contrary actions null and without effect.\n\nThe constitutional power we are here concerned with is contained in Article VI, Section 7, and governs the removal of civil officers:\n\n\" All civil officers shall hold their offices on the condition that they behave themselves well while in office, and shall be removed on conviction of misbehavior in office or of any infamous crime. . . . All civil officers elected by the people, except the Governor, the Lieutenant Governor, members of the General Assembly and judges of the courts of record, shall be removed by the Governor for reasonable cause, after due notice and full hearing, on the address of two-thirds of the Senate.\" (emphasis added)\n\nThis provision establishes in no uncertain terms that elected civil officers may be removed from office only for cause. So long as they \"behave themselves well,\" said officers \"shall hold their offices.\" \"Removal is the penalty for misbehavior.\" Bowman's Case, supra, at 367, 74 A. at 204. Furthermore, the provision allows for removal, after due process has been accorded the officer, upon conviction of \"misbehavior in office or of any infamous crime,\" or \"on the address of two-thirds of the Senate.\" See Houseman v. Commonwealth, 100 Pa. 222 (1882).\n\nFor constitutional officers, or officers created by the Constitution, the methods of removal provided for in Article VI, Section 7, are exclusive. Bowman's Case, supra; Marshall Impeachment Case, 360 Pa. 304, 62 A.2d 30 (1948). The legislature, however, may determine different methods of removal for legislatively created officers. Article VI, Section 1, provides that: \"All officers, whose selection is not provided for in this Constitution, shall be elected or appointed as may be directed by law.\" The authority so conferred necessarily implies the power to \"establish a method for the incumbent's removal.\" Marshall Impeachment Case, supra, at 310, 62 A.2d at 33; Weiss v. Ziegler, 327 Pa. 100, 193 A. 642 (1937); Milford Township Supervisors' Removal, 291 Pa. 46, 139 A. 623 (1927); Commonwealth ex rel. Vesneski v. Reid, 265 Pa. 328, 108 A. 829 (1919). This power attaches to both legislatively created, appointed civil officers, Watson v. Pennsylvania Turnpike Commission, 386 Pa. 117, 125 A.2d 354 (1956), and elected civil officers created by the legislature. Weiss v. Ziegler, supra; Milford Township Supervisors' Removal, supra. The power in regard to elected civil officers is limited, however, by the specific requirement of Article VI, Section 7, that all such officers be removed only for cause. Thus, while the legislature may provide for different methods of removal, different, for example, from impeachment, the method chosen must always be premised on cause, demonstrated after notice and hearing, and sufficient, under the Constitution, to permit removal. The \"cause\" requirement of Article VI, Section 7, is a broad requirement, expressly applicable to all civil officers, whether they be created by the Constitution or the legislature. The legislature is bound to follow its dictates when it determines a method of removal for an elected civil officer. See Richie v. Philadelphia, 225 Pa. 511, 74 A. 430 (1909).\n\nWe need not rely solely on the precise words of the Constitution to support the conclusion stated above for\n\n    there are many cases which have reached the same determination. In Milford Township Supervisors' Removal, supra, the Court upheld the constitutionality of a township statute providing for the removal of the township supervisor, an elected officer created by the legislature, upon proof, in the court of quarter sessions, of neglect of duty or other malfeasance in office. Id., 291 Pa. at 50, 139 A. at 624-25. The Court held that the statute created a permissible removal method, pursuant to Article XII, Section 1 (now Article VI, Section 1), as it was conditioned on proof of cause:\n\n\"It has been frequently decided . . . that, where a term of office is subject to the control of the Legislature, that tribunal may abolish the office, and thereby constitutionally oust the officer during the running of his term [citations omitted]. It would seem logically to follow that . . . a general act, providing for a forfeiture on a judicial determination of a breach of the constitutional 'condition that they behave themselves well while in office ' . . . ought also to be permissible . . . .\"\n\nId., at 51, 139 A. at 625 (emphasis added).\n\nMilford, supra, was followed by the Court in Weiss v. Ziegler, supra, a case involving the removal provisions of the School Code of 1911, which provided for the removal of District School Superintendents \"after hearing, by a majority vote of the board of school directors of the district, for neglect of duty, incompetency, intemperance, or immorality, of which hearing notice of at least one week has been sent by mail to the accused . . . .\" Id. 327 Pa. at 101, 193 A. at 643. See also Lumley v. Hughestown Borough Town Council, 362 Pa. 532, 66 A.2d 833 (1949); Marshall Impeachment Case, supra.\n\nThe need for cause and due process in any legislatively created means of removal for elected civil officers was especially emphasized in Foltz Appeal, 370 Pa. 567, 88 A.2d 871 (1952). Pursuant to the Township Code, 682\n\n    citizens of Sewickley Township filed in the lower court a complaint and petition for the removal of the elected township supervisors. The court below, however, found insufficient cause to remove the officers and refused to declare the offices vacant. On appeal to this Court, Mr. Justice Musmanno, speaking for the Court, held no malfeasance or misfeasance had been shown and that removal of the elected officers, therefore, was not possible:\n\n\"When the people of any municipality, in a duly constituted election, select certain individuals to conduct their local government, those representatives of the people may be removed from office only upon showing of a perverseness which amounts to criminality or culpable indifference to their official duties. This Court, speaking through Mr. Justice Simpson, aptly said in the case of Commonwealth ex rel. Vesneski, Appellant, v. Reid, 265 Pa. 328, 333, 108 A. 829, 831:\n\n'. . . the people are entitled to the services of the officer during the entire term for which they elected him (Lloyd v. Smith, 176 Pa. 213, 35 A. 199), unless he be removed in the way prescribed by the Constitution, if the officer is a constitutional officer (Bowman's Case, 225 Pa. 364, 74 A. 203), or by the Legislature or under its authority in the manner provided by Constitution or statute, if the officer is not a constitutional officer.'\n\nThere are certain mandatory functions required of township supervisors, the failure to perform which will subject them to removal. Crane's Appeal, 344 Pa. 624, 26 A.2d 457. This does not mean, however, that they should be threatened with dismissal for honest errors in judgment or for mistakes in administration not occasioned by cupidity or pathological sloth. People demand of their representatives government which is efficient and in meticulous keeping with the highest standards of devotion to their interests. But they are not prepared to dismiss their public officials simply\n\n    because they do not achieve perfection in every minute detail of bureaucratic operation. It is quite obvious that the officeholder who must perform his duties with the sword of Damocles constantly hanging over his head can be of little use to the citizens who have the right to expect of him the demonstration of initiative and energy in advancing their welfare within the orbit of their prescribed duties and trust.\"\n\nId. at 571-72, 88 A.2d at 873 (emphasis added).\n\nIt is clear, from the foregoing, that the power of the legislature to shape and frame the tenure of legislatively created civil officeholders must be considered together with the requirement of Article VI, Section 7, that all elected civil officers be removed only for sufficient cause established by due process. The Constitution authorizes the adoption of alternative means of removal subject to the express rule that removal be for cause. A removal scheme which is premised on something less is unconstitutional and void.\n\nWe hold that the recall provisions of the Philadelphia Home Rule Charter established such a scheme and, thus, are unconstitutional. In the instant matter, the recall of the Mayor of Philadelphia, pursuant to those provisions, was attempted. The Mayor's office is legislatively created and, so, the legislature may determine the method of removal for that office. Milford Township Supervisors' Removal, supra. But the Mayor, himself, is an elected \"civil officer,\" and his removal, no matter what method is employed, must be for cause, after notice and hearing have been accorded the officer. See Milford, supra; Georges Township School Directors, 286 Pa. 129, 133 A. 223 (1926); Commonwealth ex rel. Vesneski v. Reid, 265 Pa. 328, 108 A. 829 (1919). The recall provisions of the Philadelphia Home Rule Charter, enacted pursuant to the Act of April 21, 1949, P.L. 665, § 1 et seq., 53 P.S. § 13101 et seq., require neither cause nor due process before an elected civil officer may be forced to either resign\n\n    or face a recall election. Recall is \"initiated upon petition signed by registered electors,\" and every such petition \"shall name the officer against whom it is directed.\" Title 351, Pennsylvania Code, § 9.9-101(1). Yet, as the Charter is presently written, the officer's name, alone, may serve as the motivating force behind his removal. This procedure is antithetical to Article VI, Section 7 of the Constitution which ensures that duly elected officials are not removed from office by whim or caprice. Thus, the recall provisions fail the constitutional test, \"clearly, palpably and plainly,\" and are invalid.\n\nThe order of the court below is reversed.\n\nO'BRIEN, Justice (concurring).\n\nI agree with the opinion of Chief Justice Jones that the recall provisions of the Philadelphia Home Rule Charter are unconstitutional. I am unable, however, to agree with the reasoning of the opinion of Chief Justice Jones and hence this concurring opinion.\n\nAll legislative enactments, including the Philadelphia Home Rule Charter, are presumed to be constitutional. This presumption can be rebutted if the recall provisions of the Charter \"clearly, palpably and plainly\" violate the Constitution. Singer v. Sheppard, 464 Pa. 387, 346 A.2d 897, 900 (1975).\n\nArticle VI of the Pennsylvania Constitution deals with \"Public officers\" and their removal. This article has two specific sections dealing with removal of \"public officers\" which read as follows:\n\nArticle VI, § 6:\n\n\"The Governor and all other civil officers shall be liable to impeachment for any misbehavior in office, but judgment in such cases shall not extend further than to removal from office and disqualification to hold any office of trust or profit under this Commonwealth. The person accused, whether convicted or acquitted, shall nevertheless be liable to indictment, trial, judgment and punishment according to law.\" (Emphasis supplied.)\n\nArticle VI, § 7:\n\n\" All civil officers shall hold their offices on the condition that they behave themselves well while in office, and shall be removed on conviction of misbehavior in office or of any infamous crime. Appointed civil officers, other than judges of the courts of record, may be removed at the pleasure of the power by which they shall have been appointed. All civil officers elected by the people, except the Governor, the Lieutenant Governor, members of the General Assembly and judges of the courts of record, shall be removed by the Governor for reasonable cause, after due notice and full hearing, on the address of two-thirds of the Senate.\" (Emphasis supplied.)\n\nThese two sections of the Constitution are the only ones that speak to the issue of removal of civil officers. The opinion of Chief Justice Jones believes that any removal procedure can be constitutional as long as removal is based on cause. It is my opinion that any removal procedure not specifically mentioned in the Constitution is invalid.\n\nThe opinion of Chief Justice Jones and the dissenting opinions of Mr. Justice Eagen and Mr. Justice Pomeroy speak of the distinction between constitutional and non-constitutional officers. In Milford Township Supervisors' Removal, 291 Pa. 46, 139 A. 623 (1927), this court held that non-constitutional officers could be removed in a legislatively provided manner, even though the procedure was not mentioned in the Constitution. I find it impossible to reconcile Milford Township\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e with the Constitution and sound principles of constitutional construction.\n\nIt is well settled that a state constitution, as opposed to the Federal Constitution, is a limiting instrument. As this court stated in Com. v. Benn, 284 Pa. 421, 432, 131 A. 253, 256 (1925), \". . . the power of a state legislature is supreme in all matters, except in so far [sic] as it may be restricted by the Constitution . . . .\" As Article VI, §§ 6 and 7 must be construed as restricting the allowable methods for removal of all civil officers, it becomes clear that the \"recall\" provisions of the Philadelphia Home Rule Charter are unconstitutional.\n\nThis court, in the past, has used Article VI, § 1, of the Pennsylvania Constitution, which provides: \"All officers, whose selection is not provided for in this Constitution, shall be elected or appointed as may be directed by law,\" in distinguishing constitutional from non-constitutional officers for purposes of removal from office. In Weiss v. Ziegler, 327 Pa. 100, 104, 193 A. 642, 644 (1937), this court, in speaking of Article XI, Section 1 (the forerunner to Article VI, Section 1), stated:\n\n\". . . The authority so conferred to provide for the election or appointment of other officers necessarily\n\n    involves and implies legislative power to annex conditions of tenure.\" (Emphasis supplied.)\n\nWhile Article VI, Section 1, implies the power to provide for conditions of tenure for non-constitutional officers, said conditions cannot include methods of removal, because Article VI, Sections 6 and 7, specifically enumerate the methods and the reasons for removal of all civil officers. It is well settled that a conflict between specific and general provisions in the Constitution will be resolved in favor of the specific provisions. Lennox v. Clark, 372 Pa. 355, 93 A.2d 834 (1953).\n\nI believe that the specific language on removal in Article VI, §§ 6 and 7, controls and, therefore, removal is not a \"condition of tenure\" that would permit a different method of removal for non-constitutional officers. Viewed in this light, I believe the distinction between constitutional and non-constitutional officers is irrelevant on the removal question.\n\nThe removal provisions in Article VI relate to all civil officers. As our Constitution must be viewed as an instrument restricting the powers of the legislature, inclusion of the removal provisions necessarily restricts the legislature from providing for other methods. In Com. ex rel. Smillie v. McElwee, 327 Pa. 148, 158-159, 193 A. 628, 633 (1937), this court stated:\n\n\". . . No principle is more firmly imbedded in our law than that when the Constitution expressly provides a single method for accomplishing a particular purpose that method is exclusive. . . . The abolition of certain offices is a legislative function, but the abolition of officers is not.\" (Citations omitted.) (Emphasis in original.)\n\nIt is my opinion that the constitutional scheme of removal is reasonable and comprehensive, covering all civil officers both elected and appointed. Statutes which attempt to legislate in areas covered by the Constitution\n\n    must meet the test of the Constitution rather than the Constitution meeting the test of the statutes.\n\nI realize that removal by the constitutionally allowed method may be cumbersome. The legislature and the courts, however, cannot allow procedures proscribed by the Constitution. I express no opinion on the wisdom or necessity of \"recall\". If the people of this commonwealth desire that \"recall\" be allowed, I believe the Constitution must be amended to allow it.\n\nNIX, Justice (concurring).\n\nRecognizing the major importance of our decision today, I am constrained to set forth those reasons which occasioned my decision in this matter. The issues as I perceive them are whether, assuming the validity of the recall provision, there has been sufficient compliance with the terms of that provision as to require the acceptance of the tendered petitions. Secondly, and most importantly, is the question of the validity of a recall concept in light of the language of the Constitution of this Commonwealth. I recognize, as noted by Mr. Justice Eagen, that often a constitutional issue is not reached where a cause can be resolved on non-constitutional grounds. While this is generally a salutary principle, I agree with Mr. Chief Justice Jones that it would not be appropriately applied in this instance. In view of the interest of numerous communities in this Commonwealth concerning the feasibility of a recall provision, I believe it to be our responsibility, since the question has been raised, to address the constitutional issue and thereby avoid the uncertainty that would otherwise prevail.\n\nFor various reasons, the opinion of Mr. Chief Justice Jones found that the petitions offered by the appellees were insufficient. In my judgment that finding can be sustained solely upon the invalidity of the affidavits notarized by the fifteen circulators and/or coordinators.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ea I\n\n    accept and concur in the reasoning of the Court in declaring these petitions invalid. Since the elimination of these signatures reduces the total of valid signatures to a number insufficient to require the Board to accept the petition, it is therefore unnecessary for me to consider the remaining categories of signatures which were also deemed to be invalid.\n\nThe most serious question presented is that of the constitutional validity of a recall provision. I believe that the third clause in Article VI, Section 7 of the Pennsylvania Constitution stands as a clear limitation on the power of the legislature in that it establishes the sole and exclusive means for removing from office any elected official in the Commonwealth,\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e regardless of whether the elected office concerned is considered a \"constitutional\" office, or an office created by legislative fiat. This interpretation, in my view, is mandated by a plain and untechnical reading of the language of that provision. I therefore concur with the holding of the Court that the recall provision in the Philadelphia Home Rule Charter is unconstitutional.\n\nA proper analysis of the meaning and import of a constitutional provision must begin, as always, with an examination of the language itself. Further, we are reminded at the outset that the Constitution is not to receive a technical construction, but is to be interpreted in light of ordinary language, Commonwealth ex rel. Tate v. Bell, 145 Pa. 374, 22 A. 641 (1891), and that it is entitled to a construction, as nearly as may be, in accordance with the intent of its makers. O'Connor v. Armstrong, 299 Pa. 390, 149 A. 655 (1930); Moers v. City of Reading,\n\nPa. 188 (1853). With these fundamental principles of construction in mind, we turn to Article VI, Section 7, which provides in full as follows:\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nAll civil officers shall hold their offices on the condition that they behave themselves well while in office, and shall be removed on conviction of misbehavior in office or of any infamous crime. Appointed civil officers, other than judges of the courts of record, may be removed at the pleasure of the power by which they shall have been appointed. All civil officers elected by the people, except the Governor, Lieutenant Governor, members of the General Assembly and judges of the courts of record, shall be removed by the Governor for reasonable cause, after due notice and full hearing, on the address of two-thirds of the Senate.\n\nA plain reading of this provision reveals three distinct clauses relating to the removal of \"civil officers\".\n\nThe first clause applies, without limitation, to \"all civil officers,\" and directs that such officers \"shall be removed\" on conviction of crime or misbehavior in office. This Court has held many times that this provision is mandatory, Bowers v. Pennsylvania Labor Relations Board, 402 Pa. 542, 167 A.2d 480 (1961), even self-executing, Commonwealth v. Hiltner, 307 Pa. 343, 161 A. 323 (1932), and that it applies to all officers, whether they are appointed or elected, and whether they are the so-called \"constitutional\" officers, or those holding an office created by legislative act. McSorley v. Pennsylvania Turnpike Commission, 390 Pa. 81, 134 A.2d 201 (1957).\n\nThe second clause to Article VI, Section 7 is cast, however, in different terms. It employs language not mandatory nor compulsory but rather directory and advisory\n\n    stating that \"[a]ppointed civil officers . . . may be removed at the pleasure of the power by which they shall have been appointed.\" (emphasis added). Recognizing this distinction in the language, our decisions have permitted the power of removal of appointed officials to be vested in other than the Governor, Commonwealth ex rel. Attorney General v. Benn, 284 Pa. 421, 131 A. 253 (1925) and have also permitted conditions to be imposed upon the exercise of the power of removal, such as \"cause.\" See, e. g., Bowers v. Pennsylvania Labor Relations Board, supra; Watson v. Pennsylvania Turnpike Commission, 386 Pa. 117, 125 A.2d 354 (1956).\n\nThe third and final provision for removal contained in Article VI, Section 7 is found in clause three: \" All civil officers elected by the people . . . shall be removed by the Governor for reasonable cause . . . on the address of two-thirds of the Senate.\" (emphasis added). A close reading of this language is not necessary to observe that, like the first clause in Article VI, Section 7, its terms are mandatory, admitting of no exceptions. It indisputably applies to all elected officers, and sets forth in unambiguous language the exclusive method, absent impeachment, conviction of crime or misbehavior in office, of removing such elected officers.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e No other construction may reasonably be imposed on the language.\n\nThe dissenters, however, assert that this clause applies only to \"constitutional\" officers, contending that offices created by the legislature are excluded from the operation of this provision. Such a construction, in my view, is anomalous and completely untenable. The position taken by the dissenters not only requires different interpretations of identical language, but it completely undercuts the symmetry provided by all three clauses of Article VI, Section 7. While each of the three clauses has a distinct application, they are clearly interrelated, providing a comprehensive and exclusive mechanism for\n\n    removal.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The first clause touches all officers, requiring without exception removal upon \"conviction.\" The second clause comports with the common law principle that the power to appoint comprehends the power to remove. Clearly, appointed officers are subject to removal upon \"conviction\" as well. Elected officials, also subject to removal upon conviction, can be removed by operation of the third clause for reasonable grounds.\n\nThe dissenters attempt to support their view that clause three of Article VI, Section 7 may be ignored in this instance by relying upon a distinction that has been made in some of the early decisions of this Court between constitutional and non-constitutional offices. Until 1927, this Court had not specifically held that the third clause of Article VI, Section 7 was other than the exclusive method of removing elected officers.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e However, in Milford Township Supervisors' Removal, 291 Pa. 46,\n\nA. 623 (1927), the Court adopted the rule that Article VI, Section 7 did not apply to elected offices created by the legislature. The notion that this provision is mandatory only to constitutionally created elected officers was first expressed in dictum in Bowman's Case, 225 Pa. 364, 74 A. 203 (1909).\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e The Milford Court, through tortuous reasoning, elevated this dictum for the first time to a rule of decision, and established the dichotomy between constitutional and non-constitutional elective offices in order to exclude the latter from the provisions of the third clause of Article VI, Section 7.\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e\n\nIt should be noted that the majority of the decisions which have considered the distinction between constitutional\n\n    and non-constitutional officers were matters concerning appointive officials.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e The second clause of Article VI, Section 7 was obviously intended to incorporate the common law principle that the power to appoint also encompasses the power to remove. See, e. g., Field v. Commonwealth, 32 Pa. 478, 481-82 (1859) and cases cited therein. While at times the language of these decisions may obfuscate their true rationale, a close reading compels the view that the simple principle announced is that the legislature is in fact the appointing authority in each instance where it has created the office, even though it may have provided for another officer or agency to actually make the appointment of a person to fill the office.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e Since the language of this clause is directory and the legislature is not mandated to provide an unfettered right of removal, such a scheme would not be in violation of the terms of this clause. Additionally, since this clause confers an unfettered right of removal upon the \"appointing authority\", this power is not exceeded by a more restrictive removal procedure.\n\nThese decisions however provide no support for the Milford Court's attempt to transplant this dichotomy in\n\n    cases of elected officials. First, it must be reiterated that although the language of the second clause is advisory, the language of the third clause is mandatory and must be followed. Further, the use of the phrase \"all civil officers elected by the people\" eliminates any legitimate basis for the exclusion of any group within this class.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nThe fallacy of the Milford Court's reasoning becomes more apparent in view of its concession that Article VI, Section 7 \"is not limited to what are frequently termed constitutional officers . . .\". 291 Pa. at 52, 139 A. at 625. That Court then attempted to avoid the effect of this fundamental concession by construing Article XII, Section 1 of the 1874 Constitution (now Article VI, Section 1)\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e as superseding the express terms of Article VI, Section 7. This interpretation, reached without reference to a single authority, is abhorrent to the fundamental principle of constitutional construction that specific provisions, such as Article VI, Section 7, unless otherwise clearly indicated, must prevail against inconsistent general provisions. Buckley v. Holmes, 259 Pa. 176, 102 A. 497 (1917). Article XII, Section 1 has nothing at all to do with the removal of civil officers.\n\nIn the 1874 Constitution, all provisions concerning the removal of civil officers\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e were contained in Article VI, entitled \"Impeachment and Removal from Office.\" Sections one through three of this Article set forth all provisions concerning impeachment. Section four (now Article VI, Section 7) set forth the only available processes for removal other than impeachment. On the other hand, Article XII was entitled \"Public Officers\";\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e Section one of this Article, the provision relied upon in Milford, accomplished no more than to give the General Assembly the power to provide for the creation, election and appointment of officers \"whose selection is not provided for in this Constitution . . .\" Pa.Const. of 1874, art. XII, § 1. These powers, particularly where the office created is an elective one, are wholly distinct from removal.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e I can find no basis for the Milford Court's interpretation of this provision as superseding Article VI, Section 7. Such a construction constitutes not only a serious distortion of the plain language of the Constitution, but subverts the fundamental purpose of the third clause in Article VI, Section 7, which was undoubtedly to provide a greater degree of security in office\n\n    to the elected officials than the appointed officials provided for in clause two. I am therefore compelled to view the Milford decision as a blatant exercise of judicial legislation, reaching a result which ignores the clear intent of the document it was interpreting for the purpose of achieving the Court's theory of government.\n\nThis Court has not hesitated in the past to disregard prior precedent where it believed that a decision was based on erroneous or invalid premises. See, e. g., Frame v. Sutherland, 459 Pa. 177, 327 A.2d 623 (1974).\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e It is my firm conviction that the Court today is duty bound to correct the distorted interpretation of Article VI, Section 7 propounded by the Milford Court and blindly followed by its progeny.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e My own view is that we should restore to that section its true meaning, rather than exacerbate the confusion which will undoubtedly be occasioned by the majority and dissenting opinions today.\n\nThere are those in the dissent who have implied that the insistence upon compliance with the clear meaning of the Constitution would thwart progress and pervert the will of the people in the municipality instantly involved. I remind them that the Constitution embodies the wishes and aspirations of all of the people of this Commonwealth and they alone must be and should be the final arbiters as to the validity of any proposed change in the terms of that document. No segment of the population, no branch of government is entitled to assume this authority. The framers of the Charter, as illustrious as they might have been, and the people of Philadelphia, in adopting those provisions, were nevertheless circumscribed\n\n    by the power they received from the legislature. Thus, this is not a question of the right of the people of Philadelphia nor the eminence of the framers of the Home Rule Charter, but the authority of the legislature to confer upon a municipality a right to act in this manner. The ultimate source of power which determines the legitimacy of the legislative delegation is the people of the Commonwealth and their views have been expressed through their Constitution. The perimeters provided by the Constitution may not be exceeded without an affirmative expression from all of the citizens of this Commonwealth. As I have stated, it is my view that the people have expressed through their Constitution an intent to set forth carefully defined methods by which elected officials may be removed during their term of office. I cannot agree with the dissenters who would ignore these provisions, nor can I accept the view of Mr. Chief Justice Jones, who would attempt to modify these procedures. If, in fact, the people of Pennsylvania are convinced that recall is a desirable governmental device, they alone must make that decision through their established procedures for amending the Constitution.\n\nEAGEN, Justice (dissenting).\n\nIt is a well-established general principle of this Court that we will not determine a constitutional issue unless and until this determination is absolutely necessary to a resolution of the controversy before us. See, e. g., Lattanzio v. Unemployment Compensation Board of Review, 461 Pa. 392, 336 A.2d 595 (1975); Binder v. Triangle Publications, Inc., 442 Pa. 319, 275 A.2d 53 (1971); Lynch v. Owen J. Roberts School District, 430 Pa. 461, 244 A.2d 1 (1968). In my view, we need not and should not decide the constitutionality of the recall provision of the Philadelphia Home Rule Charter at this time. See\n\n    and compare Ashwander v. Tennessee Valley Authority, 297 U.S. 288, 346-47, 56 S.Ct. 466, 482-83, 80 L.Ed. 688 (1935) (concurring opinion, Brandeis, J.).\n\nIf, however, we must decide at this juncture whether or not Philadelphia's recall scheme violates the Pennsylvania Constitution, I must conclude that it does not. As the opinion of the Chief Justice correctly observes, \"the entire Home Rule Charter of Philadelphia has the force and status of an enactment of the legislature\" and \"[a]s such, it is presumed constitutional and the burden of proving a violation rests on those who allege unconstitutionality.\" Opinion of the Chief Justice at 244. The opinion, however, concludes that the recall provision \"clearly, palpably and plainly\" violates Article VI, Section 7 of the Pennsylvania Constitution because it is not predicated upon cause \"amounting to criminality or misbehavior while in office.\" Opinion of the Chief Justice at 244. I cannot agree.\n\nIn addition to the impeachment provisions contained in Article VI, Sections 4-6, the Pennsylvania Constitution in Article VI, Section 7 contains three additional and distinct provisions pertaining to the removal of civil officers:\n\n\"All civil officers shall hold their offices on the condition that they behave themselves well while in office, and shall be removed on conviction of misbehavior in office or of any infamous crime. Appointed civil officers, other than judges of the courts of record, may be removed at the pleasure of the power by which they shall have been appointed. All civil officers elected by the people, except the Governor, the Lieutenant Governor, members of the General Assembly and judges of the courts of record, shall be removed by the Governor for reasonable cause, after due notice and full hearing, on the address of two-thirds of the Senate.\"\n\nAs the Chief Justice recognizes, however, we have long held that the constitutional provisions pertaining to the\n\n    removal of civil officers are exclusive with regard to constitutional officers only, and that the constitutional provision that \"All officers, whose selection is not provided for in this Constitution, shall be elected or appointed as may be directed by law\" (now contained in Article VI, Section 1) necessarily contains the implication that the terms of such non-constitutional, legislatively-created officers may be conditioned or terminated as provided by the legislature. Thus, in Milford Township Supervisors' Removal, 291 Pa. 46, 51, 139 A. 623, 625 (1927), we held that a statute \"providing for a forfeiture on a judicial determination of a breach of the constitutional 'condition that [township supervisors] behave themselves well while in office'\" was not violative of the Constitution.\n\nI do not believe, however, that this holding enunciated a constitutional requirement that a legislatively-sanctioned procedure for the removal of a non-constitutional elected officer must necessarily be predicated upon cause, any more than it required that such a procedure be predicated upon a \"judicial determination.\" I am not so persuaded because of the fact that in the same paragraph in which the Court announced this holding, it specifically recognized that \"where a term of office is subject to the control of the legislature, that tribunal may abolish the office, and thereby constitutionally oust the officer during the running of his term . . . .\" Id. (Quoted in the opinion of the Chief Justice at 245.) Clearly such a constitutionally-permitted ouster of an elected civil officer would not require a finding of criminality or misbehavior in office.\n\nThe opinion of the Chief Justice nevertheless now concludes that the provisions of Article VI, Section 7 require that the removal of even a non-constitutional elected civil officer, as the Mayor of Philadelphia unquestionably is, be conditioned upon cause amounting to criminality or misbehavior in office and that, in contrast to the quasijudicial procedure for removal of an elected incumbent\n\n    contained in the Philadelphia Charter of 1919 which we upheld in Marshall Impeachment Case, 360 Pa. 304, 62 A.2d 30 (1948), the recall procedure contained in the present Home Rule Charter is unconstitutional. In my view, the language of the Constitution will not support such a construction. I believe that the language contained in Article VI, Section 7 and emphasized by the Chief Justice as establishing the requirement of cause must be interpreted in the context in which it appears. Thus, the statement that \"All civil officers shall hold their offices on the condition that they behave themselves well while in office\" must be read in conjunction with the requirement that they \"shall be removed on conviction of misbehavior in office or of any infamous crime,\" and it must be limited to that context. If this provision really means that all officers are entitled to retain their offices for the length of their terms as long as they behave well, the following provision that \"Appointed civil officers . . . may be removed at the pleasure of the power by which they shall have been appointed\" is blatantly contradictory. The third provision, that dealing only with elected civil officers, does require \"reasonable cause\" before an officer can be removed by the Governor on the address of two-thirds of the Senate, but I am not persuaded that the alternative removal procedures permitted with regard to non-constitutional elected officers must inevitably be conditioned on \"reasonable cause\" any more than they must inevitably be conditioned upon a two-thirds vote of a deliberative body.\n\nMy greatest obstacle to accepting the Chief Justice's analysis is that it fails to address itself to the distinct and particular nature of the recall process. Clearly in our system of representative democracy an officer duly chosen by the people should not be removed from office by his fellow representatives of the people -- be they executive, legislative, or judicial -- without reasonable cause; otherwise the right of the people with regard to the selection\n\n    of these officers would be undermined. But the concept of recall contemplates that the term of an officer democratically elected by the people is conditioned upon the officer's remaining subject to a democratic referendum wherein he may be removed by the people. Thus, the removal provision in the Constitution most clearly analogous to the recall of a non-constitutional elected officer is the one in Article VI, Section 7 which provides that \"Appointed civil officers . . . may be removed at the pleasure of the power by which they shall have been appointed.\" I therefore see no constitutional bar to the people as a whole removing at their pleasure a non-constitutional officer the people themselves have appointed (elected).\n\nBecause of my interpretation of the Pennsylvania Constitution, I find the analysis of recall in Gordon v. Leatherman, 450 F.2d 562 (5th Cir. 1971) pertinent to the present case, even though that case was decided on the basis of the Federal Constitution. A commissioner of Dade County, Florida, there sought declaratory and injunctive relief against the carrying out of a recall election pursuant to procedures contained in the Dade County Home Rule Charter and expressly permitted by the Florida Constitution. He contended that the absence in the recall provision of a requirement of cause deprived him of his office, a valuable property right, without due process, and the District Court agreed with him. A panel of the Fifth Circuit unanimously reversed, stating in pertinent part:\n\n\"Where a home rule charter provision requires a statement of charges in a recall petition, such procedure is not necessitated by any notion of a due process command for notice, but is required by the very nature of a political system which permits removal only for cause. In Dade County, however, the charter provides a structure whereby commissioners serve at the will of\n\n    the electorate, and as such, no statement need be made of reasons for recall.\n\n\"Furthermore, there is a fundamental difference between the expulsion or removal of a public official by the state and that same activity by the voters. . . . Any governmental body is required to act fairly, but that is not true as to a voter. Insofar as the United States Constitution is concerned, an elector may vote for a good reason, a bad reason, or for no reason whatsoever.\" [Footnote omitted.]\n\nGordon v. Leatherman, supra at 566-67. Petitions for rehearing and rehearing en banc were denied in Gordon. For the reasons stated above, I believe the same considerations are here applicable with respect to the Pennsylvania Constitution.\n\nNor is the opinion of the late Mr. Justice Musmanno in Foltz Appeal, 370 Pa. 567, 88 A.2d 871 (1952), quoted in the opinion of the Chief Justice, authority to the contrary. First, it should be noted that the issue in Foltz was whether a complaint seeking the removal of township officers, pursuant to a statute providing for judicial removal at the behest of 5% of the township's registered electors if the officer in question refused or neglected to perform his duties, stated the necessary cause. Thus, not only did Foltz not involve a procedure providing for recall after a democratic vote of the electorate, but it was decided on a non-constitutional ground. Hence, the language quoted in the opinion of the Chief Justice to the extent it suggests recall is unconstitutional, is clearly only dictum. Second, and more significantly, the analysis of Mr. Justice Musmanno in that opinion is clearly based upon the right of the people to retain the services of officers they themselves have elected, and the need to protect the people from the arbitrary removal of their chosen officers. The language of the opinion provides no basis for holding that the people need to be protected from themselves.\n\nIt is not our province here to determine the legislative wisdom of subjecting elected non-constitutional officers to recall elections at the petition of a minority of the electorate. In my view, however, there is no constitutional impediment to such a scheme, and a procedure whereby such an officer may be removed by a majority vote of the very people who have elected him does not \"clearly, palpably and plainly\" violate the Pennsylvania Constitution.\n\nAlthough I find no constitutional infirmity in the recall provision of Philadelphia's Home Rule Charter, I would not decide the validity of the recall petition on the existing record, because up to this point neither side to the litigation has been given an opportunity in an adequate hearing to be heard or to properly litigate the validity of the recall petition. And, needless to say, the opportunity to be heard is fundamental to our system of jurisprudence.\n\nIn this connection, it should first be noted that neither the Citizens Committee to Recall [Committee] nor Mayor Rizzo, to whom the recall proceedings were directed, was given the opportunity to present evidence before the Board of Elections [Board]. Then, when the issue of the validity of the petition came before the Court of Common Pleas in an action instituted on behalf of the Committee and in which Mayor Rizzo was permitted to intervene, neither Mayor Rizzo nor the Committee was permitted to introduce any evidence other than that which the Board had considered. In fact, when Mayor Rizzo asked for permission to call as witnesses before the court twenty-five individuals who circulated the sheets of the recall petition and to show through the testimony of these witnesses that the affidavits attached to a large number of sheets\u003cspan class=\"fnref\"\u003e1\u003c/span\u003e were false in a substantive manner, the court denied the request. This ruling, in my view, was error, and clearly it was foreign to the fundamental\n\n    principle that parties to a litigation should be given the opportunity to be heard. Mayor Rizzo should have been given the opportunity to prove what his offer indicated. Likewise, the Committee should have been given the opportunity to refute the evidence offered by Mayor Rizzo and the chance to present all relevant evidence it deemed necessary to aid the court in resolving the validity of the petition.\n\nThe ruling of the court denying the parties the opportunity to be heard, as related above, was premised on the court's conclusion that the issue of the validity of the petition was properly before the court in an action in mandamus, and that, since the mandamus action followed a hearing before the Board, an administrative agency, the court's review was limited to the administrative record.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003e Under all the circumstances, I disagree.\n\nFirst, I am not convinced mandamus was proper under the circumstances. If an adequate remedy existed at law, unquestionably mandamus should not have been entertained. And, in my view, an adequate remedy at law was provided under the Local Agency Law. The opinion of the Chief Justice states the Local Agency Law was inapplicable because the Board's decision as to the validity of the recall petition was not an \"adjudication\" as that term is defined under the Act.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003e\n\nThe opinion gives two reasons to justify the above statement. First, the Philadelphia Home Rule Charter, 351 Pa.Code 9.9-100 et seq., does not provide for participation of the Committee in any proceeding before the Board. Second, since Section 2(3) of the Local Agency Law, 53 P.S. § 11302(3), defines \"party\" as any person who appears in a proceeding before a local agency, and since the Committee did not appear before the Board in a proceeding, it does not constitute a party.\n\nWhile the Committee and Mayor Rizzo did not appear before the Board, they were not given the opportunity, because the Board did not conduct a full hearing, that is, a proceeding, in which all the interested parties could have appeared and been heard. Therefore, the second reason given why the Board's decision was not an adjudication is without merit, because the Court should not determine what should have occurred by reasoning from what did, in fact, occur. As to the first reason, I agree the Home Rule Charter does not provide for a hearing. Rather, it requires the Board to examine the petition. But, it is now well established that Section 4 of the Local Agency Law, 53 P.S. § 11304, mandates an adversary hearing whenever a determination is made that otherwise constitutes an \"adjudication\" under Section 2(1), 53 P.S. § 11302(1).\u003cspan class=\"fnref\"\u003e4\u003c/span\u003e Since the Board's determination instantly was within the definitional purview of \"adjudication\" in all respects except as to the Committee appearing in a proceeding, i. e., an adversary hearing, before the Board, and since Section 4 of the Local Agency Law, 53 P.S. § 11304, if applicable, would have required such a hearing before the Board at which the Committee could have appeared, I see no reason not to read the Home\n\nRule Charter in conjunction with the Local Agency Law and rule that the Local Agency Law mandates the examination of the recall petition pursuant to the Home Rule Charter be conducted in the context of an adversary hearing.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003e The Charter has the effect of a statute and it should be read in conjunction with the Local Agency Law.\n\nIf such had been done instantly, the Local Agency Law would have mandated a full adversary hearing prior to the Board making its final determination, and the Committee and the Mayor could have appeared at the hearing to present evidence and advocate their respective positions with regard to the standard to be applied in determining the validity of the petition and the application of those standards to the petition involved herein. This procedure would have eliminated the fundamental injustice which I believe occurred in these proceedings.\n\nEven assuming mandamus was the proper form of action, I would still remand this case for a hearing de novo.\n\nAs noted above, the trial court rejected an offer of proof by Mayor Rizzo to show that numerous affidavits filed as part of the recall petition were false.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003e The court said:\n\n\"[N]one of it is relevant to this particular proceeding which the court perceives as limiting the court to a review of what the Board did, what legal actions they have taken.\"\n\nThis ruling, even if mandamus was the proper form of action,\u003cspan class=\"fnref\"\u003e7\u003c/span\u003e was error.\n\nThe effect of this ruling was to limit the scope of review in the mandamus action to that which the Board considered and thereby deny Mayor Rizzo the opportunity to present evidence to establish the invalidity of the recall petition. Furthermore, the ruling also so limited the scope of the proceeding that the Committee could not introduce evidence as to the validity of the petition, in rebuttal or otherwise. Thus, competent, relevant, and\n\n    perhaps determinative evidence which would aid in establishing the validity or invalidity of the recall petition has never been introduced at any time in these proceedings. Under such circumstances, I am not prepared to rule on the validity of the recall petition even if mandamus was the proper form of action.\n\nBoth the Committee and the Mayor have been denied the opportunity to present relevant evidence in order to properly advocate, in the same forum and before the same decision maker, the validity of the recall petition. This opportunity, indeed this right, is fundamental to our system of law, and I am not prepared to rule on the other issues presented and thereby finally determine the validity of the recall petition where the parties have been denied this right.\n\nIf the Local Agency Law is applicable as I have suggested, then all the parties should have been notified of the proceedings and allowed to present relevant and competent evidence at a hearing before the Board. The Court of Common Pleas would then have limited review, and consideration of only that which was presented to the Board would have been proper. If the Local Agency Law is inapplicable, then as with election cases, the mandamus proceeding should not have been limited. In either event, both the Committee and the Board should have been afforded a full and fair opportunity to litigate the validity of the recall petition either before the Board or the court. As the record has been presented to this Court no full and fair opportunity to litigate has been afforded the parties. Thus, I respectfully suggest this Court should determine the proper procedure to be followed, vacate the order of the Court of Common Pleas, and remand the record for a hearing de novo.\n\nPOMEROY, Justice (dissenting).\n\nThe Court today strikes down as violative of the Constitution of Pennsylvania the recall provisions of Philadelphia's\n\nHome Rule Charter. As an alternative ground of decision, three members of the Court would hold that the court of common pleas erred in directing that the Board of Election of Philadelphia [hereinafter \"the Board\"] should accept for filing the recall petition tendered to it by the \"Citizen's Committee to Recall Rizzo\" [hereinafter \"The Citizen's Committee\"] relative to the incumbent mayor of Philadelphia, the Hon. Frank L. Rizzo, and should place the recall question before the electors at the next regular election (November, 1976). Being convinced that both of these conclusions are erroneous, I must respectfully dissent.\n\nI\n\nThe first and basic question is that of constitutionality, for if the recall provision were indeed invalid on this score, there would be no need to consider the other challenges to the correctness of the action of the court of common pleas.\n\nIn its approach to this question, the initial premises of the opinion announcing the decision of the Court\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ea are correct, but they are overlooked in the final conclusion that is reached. Mr. Chief Justice JONES acknowledges that the Home Rule Charter of Philadelphia has the force and status of a legislative enactment, and that its constitutionality is to be judged in this light.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003ea He also\n\n    accepts the well established principle that statutes are presumed to be constitutional and are not to be declared un constitutional unless \"clearly, palpably and plainly\" violative of our fundamental law. Singer v. Sheppard, 464 Pa. 387, 393, 346 A.2d 897, 900 (1975); Daly v. Hemphill, 411 Pa. 263, 271, 191 A.2d 835, 840 (1963). The Court, however, construes Article VI, Sec. 7 of the Constitution of Pennsylvania to prohibit removal of any elected civil officer except for cause. This, in my judgment, is a distortion of the constitutional provision.\n\nSection 7 of Article VI stipulates that civil officers hold office on condition that they \"behave themselves well while in office\" and provides that, if they should be convicted \"of misbehavior in office or of any infamous crime,\" they shall be removed. With respect to civil officers who are elected,\u003cspan class=\"fnref\"\u003e3\u003c/span\u003ea Section 7 provides that removal shall be by the Governor \"for reasonable cause\", on the address of two-thirds of the Senate.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003ea This section is not,\n\n    however, a guarantee that officers may be removed only in the case of a conviction or pursuant to the Senatorial address procedure; it merely makes mandatory that they shall be removed in either of those eventualities. The idea that conviction of an office-holder of a crime by a court or of some other misbehavior by the Senate, is a sine qua non of removal is nowhere to be found in the Constitution; rather it is altogether a creation of the majority of the Court in this case.\n\nIt is to be kept in mind, and the majority does not dispute, that the office of mayor is not a constitutional position;\u003cspan class=\"fnref\"\u003e5\u003c/span\u003ea it exists only by virtue of legislative action, and in the case of Philadelphia, is created by the Home Rule Charter, Section 1-102. At least since 1927,\u003cspan class=\"fnref\"\u003e6\u003c/span\u003ea the Court has repeatedly held that an officer whose office is created by the legislature may be removed as the legislature may provide. Weiss v. Ziegler, 327 Pa. 100, 193 A. 642 (1937); Commonwealth v. Beattie, 364 Pa. 572, 73\n\nA.2d 664 (1950); Milford Township Supervisors' Removal, 291 Pa. 46, 139 A. 623 (1927). In Milford Township the Court squarely ruled that \"although article VI, section 4 [of the Constitution; now Art. VI, Sec. 7] is not limited to what are frequently termed constitutional officers, it is not applicable where the legislature, having the right to fix the length of a term of office, has made it determinable by judicial proceedings, on other contingencies than the mere passage of time.\" 291 Pa. at 52, 139 A. at 625. At another point the Court held that \"if a fair construction of the statute, providing for [the election of public officers], results in the conclusion that, under it, they were only intended to be conditionally elected for a specified term, that effect must be given to the legislative intent, notwithstanding the provisions of article VI, section 4 [now Sec. 7] . . . .\" Ibid. at 50, 139 A. at 624 (my emphasis).\u003cspan class=\"fnref\"\u003e7\u003c/span\u003ea In Marshall Impeachment Case, 360 Pa. 304, 62 A.2d 30 (1948) a case involving the Receiver of Taxes of Philadelphia,\u003cspan class=\"fnref\"\u003e8\u003c/span\u003e the Court held that the office involved was not a constitutional one, and the incumbent was subject to the removal procedures of the statutes creating the office, viz., impeachment by City Council. Adhering to what had been held in Milford Township, supra, the Court declared that \"if an office is the creature of the Legislature, the latter can establish a method for the incumbent's removal.\" 360 Pa. at 310, 62\n\nA.2d at 33.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003e See also Commonwealth ex rel. Kelly v. Sanderson, 11 Pa.County Ct. 593 (C.P.Lack.1891).\n\nThe law on this subject was succinctly summarized by Mr. Justice (later Chief Justice) Charles Alvin Jones, writing for the Court, in Watson v. Pennsylvania Turnpike Commission, 386 Pa. 117, 125 A.2d 354 (1956):\n\n\"It is therefore established in this State beyond respectable controversy that, where the legislature creates a public office, it may impose such terms and limitations with reference to the tenure or removal of an incumbent as it sees fit. There is nothing in the Constitution prohibiting such action while, on the other hand, Article XII, Section 1 [of the Constitution], expressly admits of it.\" 386 Pa. at 123, 125 A.2d at 356.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003e\n\nWhile not purporting to overrule Milford Township, supra, and its progeny, the opinion announcing the decision of the Court attempts to explain away these cases by stating that although they allow different methods of removal from those prescribed by the Constitution, \"the method chosen must always be premised upon cause\" and that this cause must be established \"after notice and hearing\" and be sufficient to permit removal under the Constitution (opinion of the Chief Justice, ante at 245). The cases simply do not say this; the Chief Justice has chosen to read such requirements into them.\n\nIn separate concurring opinions, Mr. Justice O'BRIEN and Mr. Justice NIX hold recall unconstitutional on grounds which go beyond those of the opinion announcing\n\n    the decision of the Court. Mr. Justice O'BRIEN would hold that any removal procedure relating to civil officers not specifically mentioned in the Constitution is prohibited. He bases this conclusion on his belief (1) that Art. VI, Sections 6 and 7 specifically enumerate the exclusive reasons and methods for removal of all civil officers, and (2) that for purposes of removal there is no distinction between constitutional and non-constitutional officials.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003ea Mr. Justice NIX would hold that clause 3 of Art. VI, Sec. 7 is the exclusive method, other than impeachment, of removing all elected civil officers, whether or not the office is provided for in the Constitution. Thus both concurring opinions would flatly overrule this Court's holdings in Milford Township, supra, and Marshall Impeachment Case, 360 Pa. 304, 62 A.2d 30 (1948). Not even the appellants in this case argued for a result so drastic. I can find no justification for either reading of the Constitution. Not only would both opinions overrule long-established precedent holding to the contrary, but both Justices construe the relevant provisions of the Constitution in a fashion which, in my view, is overly restrictive and unwarranted.\n\nThere is nothing in the language or scheme of Art. VI, Sec. 6 (impeachment) or Art. VI, Sec. 7 (address) which in any way indicates that the modes of removal specified are exclusive of all others.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003eb Nor do the concurring\n\n    opinions point to anything in the relevant provisions which require the conclusion of exclusivity. While I agree that the language of Art. VI, Sections 6 and 7 (excluding Art. VI, Section 7, clause 2) is mandatory, I fail to see how this factor leads inexorably to the conclusion that the methods of removal provided for are exclusive. Art. VI, Section 6 merely states that in the event a civil officer misbehaves while in office he \"shall be liable to impeachment. . . .\" This clearly does not mean that a civil officer may be removed only by impeachment. Similarly, clause 3 of Art. VI, Sec. 7 provides that with respect to civil officers who are elected, removal shall be by the Governor \"for reasonable cause\" on the address of two-thirds of the Senate. Once again, as discussed supra, there is nothing in this section which states that officers may be removed only pursuant to the Senatorial address procedure.\n\nIf, as I believe, there is nothing in the Constitution which states that the specified modes of removal are exclusive, then the argument of the concurring Justices that the general provisions of Art. VI, Sec. \u003cspan class=\"fnref\"\u003e110\u003c/span\u003ec must give way to the specific provisions of Art. VI, Sections 6 and 7, is inapplicable. The rule that specific provisions prevail over inconsistent general provisions applies only when two sections of the same instrument are in conflict. Since Art. VI, Sections 6 and 7 are not exclusive, however, it is clear that these provisions in no way conflict with Art. VI, Sec. 1 as interpreted in Milford Township, supra.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003ed\n\nFor my part, I cannot square today's holding with what until today has been the law: \" Where the legislature [here the people of Philadelphia through the adoption of the Home Rule Charter] creates a public office, it may impose such terms and limitations with reference to the tenure or removal of an incumbent as it sees fit.\" Watson v. Pennsylvania Turnpike Commission, supra, 386 Pa. at 123, 125 A.2d at 360.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003e\n\nEnough has been said to demonstrate that the Court, while paying lip-service to the rule that a legislative enactment must be upheld unless it \"clearly, palpably and plainly\" violates the Constitution, nevertheless disregards that admonition in striking down the recall provisions of Philadelphia's charter. Thus discussion of the constitutional challenge might well end at this point. But more, I think, should be said. For one of the reasons that the Court has, as I think gone astray in the decision of this case is its total obliviousness to the history and purpose of Philadelphia's home rule charter and of the recall provision which is a part of it. A brief recital of these factors of history and purpose may serve to point up the wrongness of the Court's approach to the constitutional question, discussed above, and also its approach\n\n    to the specific rulings of the trial court on the challenges to the sufficiency of the recall petition, discussed below in part IV of this opinion.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003e\n\nII\n\nThe touchstone for consideration of the constitutionality and legal effect of the Charter is Article I, Section 2 of the Pennsylvania Constitution:\n\n\"All power is inherent in the people, and all free governments are founded on their authority and instituted for their peace, safety and happiness. For the advancement of these ends they have at all times an inalienable and indefeasible right to alter, reform or abolish their government in such manner as they may think proper.\"\n\nIn 1922, the people of Pennsylvania amended the Constitution to provide for adoption by a city of a home rule charter whereby it could exercise the powers and authority of local self-government. Art. 15, Sec. 1.\u003cspan class=\"fnref\"\u003e13\u003c/span\u003e This constitutional right to home rule remained unavailed of for\n\n    twenty-seven years, until the General Assembly adopted the First Class City Home Rule Act, Act of April 21, 1949, P.L. 665, 53 P.S. § 13101 et seq. The Philadelphia City Council promptly took advantage of the enabling act by appointing a charter commission. The commission prepared a charter which was presented to and adopted by the electors of Philadelphia on April 17, 1951, to be generally effective on January 7, 1952.\u003cspan class=\"fnref\"\u003e14\u003c/span\u003e\n\nThe recall provision of the Charter, Article IX, Section 9-100 et seq., flatly declares that \"[a]ny person holding an elective office of the City . . . shall be subject to removal from office at a recall election . . . .\" Charter, Sec. 9-100.\u003cspan class=\"fnref\"\u003e15\u003c/span\u003e The commission's statement of purposes set forth in the annotation to this section is instructive, and is reproduced in full in the margin.\u003cspan class=\"fnref\"\u003e16\u003c/span\u003e\n\nWith a view, however, of protecting against vexatious use of the recall, the Charter prohibits the filing of a petition against any incumbent within the first year or the last six months of the term of his office or within six months after an unsuccessful recall election against him. Sec. 9-105.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003e\n\nAs long ago as 1909 the Supreme Court of Washington was confronted with a challenge to the recall provision contained in the home rule charter of the City of Everett, Washington. Hilzinger v. Gillman, 56 Wash. 228, 105 P. 471 (1909).\u003cspan class=\"fnref\"\u003e18\u003c/span\u003e Because of the similarity of the issues\n\n    there considered to those presented by the case at bar I deem it worthwhile to set forth the holdings of the Hilzinger case at some length.\n\nThe claim was made by the city councilman of Everett against whom a recall petition had been filed that the petition was invalid because the recall provision of the charter (Sec. 281) was in conflict with another section of the charter (Sec. 25) which provided for removal by the city council for enumerated causes.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003e To this the Washington Supreme Court, speaking through Mr. Justice Gose, answered:\n\n\"Section 25 provides for a summary removal of an elective officer for certain specified causes; whereas, section 281 [the recall provision] contemplates a recall of the officer at any time that his official conduct is not responsive to the wish or will of a majority of the electors . . . . Whilst this section provides that the reason for the recall shall be stated in the petition, the charter does not provide that any specific reason shall be necessary or controlling. The whole scheme or system of the charter makes it apparent that the right of recall of elective officers was reserved to the people, to be exercised at any time the public interest was thought to require it.\" 105 P. at 473.\n\nThe incumbent officer next urged that there was neither constitutional nor legislative authority for the recall provision. The court held that the enabling act authorizing cities of the first class to adopt a charter was broad enough to include recall. The act provided that \"the mayor and members of the city council shall have the powers, shall be elected at the times, in the manner, and for the terms prescribed in the charter.\" Addressing the\n\n    question of the length of the term of office to which the councilman had been elected, the court stated:\n\n\"[H]e was elected to hold office until the first Tuesday after the first Monday in January, 1910, unless removed for cause or recalled in the manner provided [in the Charter]. His term, while in a measure fixed, was subsequent to the condition that 25 per cent of the electorate . . . could by petition express their disapproval of his official action upon one or more measures of local policy, and demand that he be sustained by a vote of confidence or retire. . . . Both the constitution and the general law recognize that large growing cities should be empowered to determine for themselves, and in their own way, the many important and complex questions of local policy which arise, and it is only when some act in the execution of that policy conflicts with the general law or contravenes the constitution that the act can be questioned.\" Id. at 474.\n\nIt was finally argued, as in the case at bar, that the Everett charter recall violated the constitutional provision for removal of officers \"for misconduct or malfeasance in office.\" This contention also was found to be without merit. Said the Court: \"The people of the City of Everett in framing the charter intended that their representatives should be held strictly amenable to both existing and changing public sentiment on all local measures, and that if the official conduct of any elective officer failed at any time to so respond, he was subject to recall if the majority of the electorate in his district so determined. The appellant accepted the trust subject to this power in his constituency, and the duration of his term is dependent upon the wish of the majority as expressed at the polls. The removal sought is not of the character provided in the Constitution. Whether the interests of the City will be better subserved by a ready obedience to public sentiment than by a courageous adherence\n\n    to the views of the individual officer on questions of public concern is a political and not a legal, question.\" Id. at 474. In my view, the Washington court's decision and reasoning are sound and should be persuasive authority as this Court, sixty-five years later, confronts the same problem.\n\nIn the states where recall has been introduced, it is frequently provided that petitions shall contain a statement of the reasons for which removal is sought. Depending on the particular statutory provisions, these reasons may be purely political or may relate to specific grounds such as malfeasance in office. As stated by the Wisconsin Supreme Court in In re Recall of Certain Officials of City of Delafield, 63 Wis.2d 362, 372, 217 N.W.2d 277, 282 (1974): \"[T]he grounds for recall in the various jurisdictions range from any reason to malfeasance.\" Thus in Colorado, for example (where recall is constitutionally recognized), \"the dissatisfaction, whatever the reason, of the electorate is sufficient to set the recall procedures in motion.\" Bernzen v. City of Boulder v. Wells, 525 P.2d 416 (Colo.1974). The Court observed in that case that \"the framers, by requiring that a recall petition contain the signatures of at least 25% of all votes cast in the last election . . . assured that a recall election will not be held in response to the wishes of a small and unrepresentative minority. However, once at least 25% of the electorate have expressed their dissatisfaction, the constitution reserves the recall power to the will of the electorate. Courts of law are not to intercede into the reasons expressed by the majority.\" 525 P.2d at 419. But even where, as in Wisconsin, \"good cause\" must be alleged in a recall petition, the courts generally will not inquire into its sufficiency. As the court stated in City of Delafield, supra : \"Generally, statutory provisions relating to recall are liberally interpreted in favor of the electorate. The power granted to an electorate to remove certain elected officials through\n\n    recall procedure is political in nature and it is for the people and not the courts to decide the merits of the reasons stated in the petition.\" 217 N.W.2d at 283. See also In re Recall Petition of Miles Beckstrom, Mayor of Montreal, etc., 63 Wis.2d 375, 217 N.W.2d 283 (1974).\n\nThese and other decisions from outside of Pennsylvania are not, of course, controlling here. But they indicate that, whether or not recall has been recognized in a state constitution and whether or not a petition must assert reasons for the proposed removal, the decision to seek and obtain recall of an officer is essentially a political one, and not a matter of judicial intervention. As one writer puts it, \"The popular recall [in contradistinction to impeachment] is designed to be used even in cases where the officer has simply got out of line with public opinion and has taken official action to which citizens object. It is political in its nature. It is intended to help voters keep their officers constantly amenable to popular control, and 'to aid the officeholder in retaining a candidate's state of mind.'\" W. Anderson and E. Weidner, American City Government 333 (Rev.Ed., 1950). (Footnote omitted).\u003cspan class=\"fnref\"\u003e20\u003c/span\u003e See also Ibid. at 334.\n\nWhat has been said indicates that there is no constitutional need to justify the use of recall in terms of cause and a due process hearing. Recall is simply not within the ambit of the impeachment or address sections of the\n\nPennsylvania Constitution. But if we are to speak those terms, it is difficult to imagine a better \"cause\" in a democratic republic than the will of the people, in whom, as our constitution declares, inheres all power; and difficult to conceive of a process more \"due\" than an election by the people in the manner provided by law. The Court's failure to recognize that the right of the people of Philadelphia, whether or not wisely bestowed, to recall their elected official, was within the grant of power to the City by the General Assembly, as permitted by the 1922 home rule amendment to the Constitution, unhappily reduces chapter 1 of article IX of the Charter \"to a mere scrap of paper\" and makes that portion of \"the much heralded grant of Philadelphia home rule an illusion and a nullity.\" See Addison Case, 385 Pa. 48, 55, 122 A.2d 272, 275 (1956); Lennox v. Clark, 372 Pa. 355, 379, 93 A.2d 834, 845 (1953).\n\nIII\n\nAppellant Rizzo argues that Philadelphia's recall provision violates not only the Constitution of Pennsylvania, but also the Fourteenth Amendment to the Constitution of the United States.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e This challenge also I find to be meritless. As Judge Savitt correctly observed in his opinion below, \"[c]hallenges to the constitutionality of recall have been uniformly rejected in the courts of other states, see State ex rel. Topping v. Houston, 94 Neb. 445, 143 N.W. 796 (1913); Roberts v. Brown, 43 Tenn.App. 567, 310 S.W.2d 197 (1957); Stone v. Wyckoff, 102 N.J.Super. 26, 245 A.2d 215 (1968).\" (Opinion of Savitt, J., at 126a-7 Record).\n\nIn response to a claim that a recall provision containing no requirement of cause violated the due process\n\n    clause of the Fourteenth Amendment, a unanimous Fifth Circuit Court of Appeals held:\n\n\"What is provided by the Dade County provisions is a political system in which commissioners are to serve at the will of the people. There is nothing inherently unconstitutional in such a system, and no court has so held.\" Gordon v. Leatherman, 450 F.2d 562, 566 (5th Cir. 1971).\n\nThe appellant also asserts that recall, because it might result in reversing the majority vote at the preceding mayoralty election in which the incumbent was chosen for office, somehow impairs the right to vote and therefore violates the voters' rights to equal protection of the laws. This too is without merit. As the trial court succinctly observed:\n\n\"Clearly, a minority of voters cannot oust an incumbent at a recall election under the Philadelphia Home Rule Charter, Section 9-103(3). In a society which for so long has recognized the right to vote as paramount, it is difficult to see how an additional election, scheduled upon the petition of the electorate, creates an unconstitutional burden on that right.\" (Opinion of Savitt, J., at 126a-9 Record).\n\nConstitutional questions aside, the Mayor further contends that recall is in conflict with the First Class City Home Rule Enabling Act, Act of April 21, 1949, P.L. 665, §§ 17, 18, 53 P.S. §§ 13131, 13133, and the Pennsylvania Election Code, Act of June 3, 1937, P.L. 1333, 25 P.S. §§ 2600 et seq., and therefore must give way to these statutes of general applicability. His argument runs as follows: (1) § 17 of the Home Rule Enabling Act requires that elective city officials \"shall be nominated and elected only in the manner provided by, and in accordance with, the provisions of the Pennsylvania Election Code . . .\", Act of April 21, 1949, P.L. 665, § 17, 53 P.S. § 13131; (2) the Pennsylvania Election Code is a comprehensive statute which preempts the area of\n\n    nomination and election of public officers; (3) recall is legislation governing the exercise of the political process through the electoral machinery; therefore, (4) recall is invalid.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nThe fatal flaw in this reasoning, however, is that the Election Code does not deal in any way with the removal of elected officials from office; it deals solely with the nomination and election of such officials. In contrast, the recall provision of the Philadelphia Home Rule Charter, like the removal provisions in the various statutes relative to the governance of municipalities in this State, is a method of removing an elected officer and has nothing whatever to do with nominating or electing someone to office.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nIV\n\nHaving concluded that the trial court was correct in holding that the recall provisions of the Philadelphia Home Rule Charter are contrary to neither the federal nor state constitutions, or Acts of Assembly, it is now necessary to determine whether or not the court was also on sound ground in issuing a writ of mandamus to compel the filing of the recall petition.\n\nIt is well settled that mandamus is an extraordinary writ which will issue to compel the performance of a ministerial act or mandatory duty when there exists a\n\n    clear legal right in the plaintiff, a corresponding duty in the defendant, and a want of any other appropriate and adequate legal remedy. Valley Forge Racing Association v. State Horse Racing Commission, 449 Pa. 292, 295, 297 A.2d 823, 824-25 (1972); Philadelphia Presbytery Homes v. Abington Board of Commissioners, 440 Pa. 299, 303, 269 A.2d 871, 873 (1970); Unger v. Hampton Township, 437 Pa. 399, 401-02, 263 A.2d 385, 387 (1970). The opinion of Mr. Chief Justice JONES announcing the decision of the Court\u003cspan class=\"fnref\"\u003e23\u003c/span\u003ea does not dispute this. Nor does it dispute the equally well-established principle that although mandamus will not issue to compel the performance of a discretionary act, the writ will issue when the exercise of such discretion is arbitrary, fraudulent, or based upon an erroneous view of the law. See Valley Forge, supra; Commonwealth v. Caplan, 411 Pa. 563, 568-69, 192 A.2d 894, 896 (1963); Garratt v. Philadelphia, 387 Pa. 442, 448, 127 A.2d 738, 741 (1956); Hotel Casey Co. v. Ross, 343 Pa. 573, 583-85, 23 A.2d 737, 742-43 (1942).\n\nDespite its agreement with these basic principles, however, the opinion announcing the decision of the Court holds that with respect to the categories of signatures labelled by the Board of Elections \"irregular affidavits\" and \"illegal notarizations\", the lower court improperly substituted its judgment for that of the Board, and thereby fell into error in issuing the writ of mandamus compelling the filing of the recall petition.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e I cannot\n\n    agree with this conclusion. In my view, Judge Savitt was correct in ruling that the Board acted arbitrarily and contrary to law when it rejected in toto the signatures in the above two categories.\n\nA.\n\nAccording to the Board's staff report, 905 affidavits affecting 57,494 signatures were placed in a group designated \"irregular affidavits\".\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e Of the total number of\n\n    affidavits deemed \"irregular\", those affecting at least 20,304 signatures were determined by the Board to be \"patently false\" because of \"gross irregularities\" on the sheets to which they were attached.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e The appellant Board contends, and the opinion of Mr. Chief Justice JONES agrees, that it acted properly in reaching this conclusion because (1) the large number of irregular signatures created an inference that the affidavits were false, and (2) a negative inference arose from the failure of the affiants to the questioned affidavits to respond to subpoenaes issued by the Board. I submit that this reasoning is untenable.\n\nThere is no dispute whatever that the affidavits affecting 20,304 rejected signatures were valid on their face. No evidence was presented that the 20,304 signatures themselves were not genuine. Nor was there any evidence before the Board that, although some signatures were defective, the affiants acted fraudulently in any respect.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e No effort was made to enforce the subpoenaes\n\n    directed to the affiants, either at the Board level or at trial. In fact, the only evidence before the Board was that some of the signatures on certain sheets of the petition did not meet the Charter requirements as interpreted by the Board. Despite this total absence of direct evidence that the affidavits were in fact false, however, the opinion announcing the decision of the Court declares that the Board could legitimately reach this conclusion on the basis of the two inferences above stated. In my view mere conjecture is, as a matter of law, an insufficient basis for rejecting facially valid affidavits and thereby nullifying otherwise genuine signatures. See In re Bower, 41 Ill.2d 277, 242 N.E.2d 252 (1968); Petition of Smith, 114 N.J.Super. 421, 276 A.2d 868 (1971); Lefkowitz v. Cohen, 262 App.Div. 452, 29 N.Y.S.2d 817, aff'd. 286 N.Y. 449, 36 N.E.2d 680 (1941). Thus, I would hold that the evidence before the Board regarding the affidavits affecting 20,304 signatures was insufficient as a matter of law to support its finding of falsity. I would therefore affirm the lower court's ruling that the Board acted arbitrarily and not in accordance with the law when it rejected these signatures.\n\nB.\n\nIt was stipulated between the parties to this suit that 16 persons (the lawyer for the Citizens Committee and 15 circulators) notarized affidavits attached to sheets\n\n    containing 115,818 signatures.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e These signatures were placed by the Board of Elections in an independent category labeled \"illegal notarizations.\" Based upon its interpretation of the Notary Public Law,\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e the Board ruled that these 16 persons had a direct interest in the success of the recall movement and therefore that they had illegally notarized the affidavits appended to the 115,818 signatures. As a result, the Board concluded that the affidavits so notarized were void and refused to count the signatures to which they pertained. In upholding this determination, the opinion announcing the decision of the Court adopts the Board's reasoning and holds:\n\n\"Section 19(e) of the Notary Public Law barred these [16] people from acting as notaries in this case. Since this section is a limitation upon the power of the notaries to act, their acts were nullities and the affidavits were void.\" (Opinion of the Chief Justice, ante at 243).\n\nIn my judgment, this holding is erroneous.\n\nI seriously doubt that the attorney for the Citizens Committee or the circulators were \"interested\" persons within the meaning of the Notary Public Law.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e See\n\nThus, like Judge Savitt, I would hold that under the circumstances of this case the Board acted arbitrarily and not in accordance with the law in refusing to count the 115,818 signatures because of \"illegal notarizations.\"\n\nFor all of the above reasons, therefore, I would affirm the trial court's order directing the Board to place the recall question on the ballot.\n\nROBERTS, Justice (dissenting).\n\nOn September 30, 1976, the majority struck the recall vote, directed to be held pursuant to the twenty-five year old Philadelphia Home Rule Charter, from the November 2 ballot.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003eb In reversing the trial court, the majority deprived the citizens of Philadelphia of their Charter right to decide at the polls whether to retain the Mayor.\n\nToday, the Justices who struck the recall vote from the ballot attempt to explain their September 30 order and proceed to completely strip the people of Philadelphia of their Charter right to recall elected Charter officials.\u003cspan class=\"fnref\"\u003e1\u003c/span\u003ec By abolishing recall, they plunge the city into the pre-Charter past, leaving the citizens without any procedure for removing elected officials.\n\nThe Opinion of the Chief Justice, announcing that the four Justices adhere to their September 30 order striking recall from the ballot, first declares the recall petition invalid. Not content just to invalidate that petition, the\n\nOpinion of the Chief Justice and the Concurring Opinions proceed to hold that recall, a time honored institution in American democratic government, is unconstitutional. Nothing in any of the opinions justifies this result. The trial court properly corrected the legal errors and arbitrary action of the Board of Elections which earlier rejected the recall petition. The trial court's order, which directed the Board to hold the recall election, should be affirmed. In holding recall unconstitutional, the opinions striking down recall misunderstand the nature of recall and misconstrue the Pennsylvania Constitution.\n\nMost shocked by the sudden and strange demise of the Charter recall would be the three civic leaders and legal scholars who drafted the Charter: William A. Schnader, Robert T. McCracken and Abraham L. Freedman; the twelve other distinguished members of the Charter Commission; the 259,396 voters who approved the Charter on April 17, 1951; and the thousands of Pennsylvanians who have adopted home rule charters containing recall provisions.\n\nToday's decision is without support in law, fact, reason or public policy. Denying the voters the right to recall officials elected under a Charter which reserves that power to the people reflects distrust of the judgment of the electorate. This compels vigorous dissent.\n\nI.\n\nA. Recall is a traditional institution in American local government.\n\nRecall is a vote by the citizens to determine whether a public official shall be removed from office prior to the expiration of his term.\u003cspan class=\"fnref\"\u003e2\u003c/span\u003eb Recall procedures similar to\n\n    those adopted in Philadelphia were first introduced in this country in the Charter of the city of Los Angeles in 1903.\u003cspan class=\"fnref\"\u003e3\u003c/span\u003eb Between 1903 and 1930, recall provisions were adopted in over one thousand municipalities in the nation.\u003cspan class=\"fnref\"\u003e4\u003c/span\u003eb By 1976, recall for some or all state officers had been authorized in twelve states and for some or all local officers in twenty-eight states.\u003cspan class=\"fnref\"\u003e5\u003c/span\u003eb In Pennsylvania alone, twenty-three cities and townships have adopted charters with recall provisions, and recall has been included in the recommended charters of six counties.\u003cspan class=\"fnref\"\u003e6\u003c/span\u003eb\n\nThe recall power is founded upon the most fundamental principle of our constitutional system: all power stems from the people.\u003cspan class=\"fnref\"\u003e7\u003c/span\u003eb In creating representative government, the people may reserve the power to change their representatives at will. As Thomas Jefferson wrote:\n\n\"I consider the people who constitute a society . . . the source of all authority in that [society]; as free to transact their common concerns by any\n\n    agents they think proper; to change these agents individually . . . whenever they please . . . .\"\u003cspan class=\"fnref\"\u003e8\u003c/span\u003eb\n\nRecall procedures give life to this fundamental principle of representative government. Elected officials are merely agents of the popular will; the recall process affords the electorate the opportunity to pass upon the performance of its representatives prior to the expiration of their terms of office.\u003cspan class=\"fnref\"\u003e9\u003c/span\u003eb Recall is designed to maintain the continuous responsiveness of elected officials to the people.\u003cspan class=\"fnref\"\u003e10\u003c/span\u003eb It establishes a tenure system for public office based upon the ability of the officeholder to maintain the confidence of the electorate.\u003cspan class=\"fnref\"\u003e11\u003c/span\u003eb\n\nRecall should not be confused with impeachment. In recall, unlike impeachment, officials are not accused of\n\n    high crimes and misdemeanors, nor are they removed from office by another branch of government. The elaborate, sometimes cumbersome, impeachment procedures are unnecessary when the people themselves remove their elected officials. Recall is designed to give the voters an expeditious and effective means of removing officials. Like any other popular vote, recall provides due process through the electoral process.\u003cspan class=\"fnref\"\u003e12\u003c/span\u003eb\n\nIn sum, recall was established as an instrument of democracy. It reserves to the electorate a direct role in government and embodies the best in the American political tradition. It is now, and for over seventy years has been, a respected institution in thousands of American municipalities. Drawing upon this tradition, the people of Philadelphia adopted recall as part of their Home Rule Charter.\n\nB. Recall is basic to the objectives of the Philadelphia Home Rule Charter.\n\nA quarter of a century ago, the voters of Philadelphia overwhelmingly adopted the Home Rule Charter prepared and submitted to them by the Philadelphia Charter Commission. To foster a more efficient and economical city government, the citizens authorized concentrations of power in the Mayor, City Controller and Councilmen,\u003cspan class=\"fnref\"\u003e13\u003c/span\u003eb but expressly reserved to themselves the power to recall their elected officials. It is this reservation of the power to recall that established the voters' most important check on their city government.\n\nRecall is indeed crucial to the proper functioning of the Charter. It affords voters dissatisfied with the performance of an official elected under the Charter the opportunity to call the official to account at the polls prior to the expiration of his term. Recall's purpose is to keep\n\n    elected officials responsive to the will of the electorate. It is the exercise of the same power that is invoked in electing an official in the first place. The voters of Philadelphia concluded, as have voters in thousands of other municipalities across the nation, that government is enhanced when elected officials are continuously accountable to the people. For these reasons, the Charter guaranteed that the power to elect included the power to recall.\n\nThe recall provisions do not, and were never intended to require the establishment of cause for removal. The Charter Annotations, prepared by the Charter's distinguished drafting committee,\u003cspan class=\"fnref\"\u003e14\u003c/span\u003eb specifically state that \". . . no charges are required to be lodged . . . against an elected official to subject him to a recall election . . . .\"\u003cspan class=\"fnref\"\u003e15\u003c/span\u003eb Indeed, the recall provisions were intended to replace the cumbersome and ineffective impeachment procedures of the 1919 Charter. The Charter Commission rejected impeachment and recommended to the voters that recall be adopted in the expectation that it would prove \"a more satisfactory device for the removal of an elected official.\"\u003cspan class=\"fnref\"\u003e16\u003c/span\u003eb The voters overwhelmingly agreed with the Charter Commission and chose to rely upon recall to check the performance of their city officials. This reliance upon the electoral process fully conforms with basic democratic principles.\n\nThe opinions striking down recall unnecessarily and unwisely strip the Charter of its vital provision for insuring citizen control of government and leave the people of Philadelphia without any effective procedure for removing Charter officials.\u003cspan class=\"fnref\"\u003e17\u003c/span\u003eb The concentration of power in city officers remains, but the voters' right to recall has been abolished. The opinions striking down recall distort the Charter into a one-sided grant of power to the government without accompanying voter control over the exercise of those powers.\n\nThe circumstances surrounding the adoption of the Charter indicate that the powers granted the Mayor and other city officials were dependent upon the reservation of the recall power. There is nothing to suggest that the voters would have authorized the powers granted in the absence of an effective voter check upon their use. Rather, the power to recall was reserved to the people as a comprehensive alternative to other limitations on official power which would have otherwise been imposed. Invalidating recall undermines the principal objectives of the Charter and abrogates the right of the people to control their city government.\n\nII. THE RECALL PETITION IS SUFFICIENT\n\nA. Genuine signatures cannot be rejected on the basis of technical imperfections in the attached affidavits.\n\nThe trial court held that the Board of Elections acted contrary to the law in rejecting 22,159 signatures because\n\n    of what the Board determined were \"irregular affidavits.\" The Board rejected these admittedly genuine signatures because of \"defects\" it found in the affidavits attached to the sheets on which the voters signed. If this action was arbitrary, capricious, or based on erroneous interpretation of law, the trial court properly ordered the Board to accept the signatures. Garratt v. Philadelphia, 387 Pa. 442, 127 A.2d 738 (1956). Yet the Opinion of the Chief Justice states that the Board acted within its discretion in disenfranchising the 22,159 voters who correctly signed their names to the petition.\n\n1.\n\nThe largest group of \"irregular affidavits,\" which the Board relied on to invalidate 20,304 signatures, suffered from what the Board called \"patent falsities.\" In the course of its investigation, the Board set up 15 categories of \"defective\" signatures. Among these was the category of \"initials,\" signatures which included an initial where none appeared on the registration card or which omitted an initial included on the registration card. Another category, which the Board called \"forgeries,\" included any instance where someone other than the voter filled in part of the line, for example the date or the voter's ward, but the genuiness of these signatures was not challenged. The Board then tabulated all the \"defective\" signatures. Sheets having more than 25% \"defective\" signatures were rejected for \"patent falsity,\" and all of the signatures on those sheets were rejected.\u003cspan class=\"fnref\"\u003e18\u003c/span\u003eb\n\nThe irrationality of such a procedure becomes apparent in light of the Chief Justice's determination that five of the categories, involving nearly half of the allegedly defective signatures, were valid. The Board erred as a matter of law in setting up these categories. If the adoption of these categories was an abuse of discretion, then surely it was an abuse of discretion to invalidate perfect signatures because other signatures on the same page had these so-called \"defects.\" The Chief Justice's reasoning on \"patent falsities\" is totally inconsistent with his determination that the signatures in the \"initials,\" \"abbreviations,\" \"insufficient signatures,\" \"incorrect ward,\" and \"forgeries/alterations\" categories are valid. For example, if a petition containing 100 signatures included 75 perfect signatures and 25 which fell into the \"initials\" category, the Board could not reject the 25 signatures for defective initials. At the same time, however, the Opinion of the Chief Justice would allow the Board to use these 25 valid signatures as a basis for rejecting all 100 signatures, including the 75 perfect signatures, for \"patent falsities.\" Why are the 75 perfect signatures being rejected -- is it because they are too good? No governmental body can possess the kind of discretion the Opinion of the Chief Justice would vest in the Board. The rejection of perfect signatures for \"patent falsities,\" when even the \"defective\" signatures are valid, is the epitome of arbitrary and capricious action.\n\nEven if the Board limited itself to those categories of signatures which are legally invalid, its action in rejecting other signatures on the same page would be arbitrary and capricious:\n\n\"The difficulty with the position . . . is that . . . persons whose signatures are admittedly genuine and whose signatures were properly obtained, are disenfranchised through no fault of theirs and because their names happen to be on sheets which contain names that are irregular. In the absence of proof that the . . . signatures were not genuine, it would be unjust to rule out such signatures.\"\n\nLefkowitz v. Cohen, 262 App.Div. 452, 456, 29 N.Y.S.2d 817, 821, aff'd, 286 N.Y. 499, 36 N.E.2d 680 (1941). The trial court properly held that the Board acted arbitrarily, and not in accordance with the law, in rejecting genuine signatures merely because they were on the same petition as some faulty ones.\n\nThe Board's somewhat contorted reasoning for its action is that if a number of the signatures on a sheet are invalid, the affidavit must be false, because the affiant must have known that the petition included invalid signatures. One problem with this approach is that the affidavit only requires a statement that \"to the best of the affiant's knowledge and belief\" the signers are registered voters who have given their correct addresses. 351 Pa.Code, § 9.9-101(2) (1974). By far the largest single category of signatures invalidated by the Board was of persons who were not registered to vote. As it is unlikely that the affiant will know, apart from what the signer tells him, whether the signer is registered, the invalid signature cannot support an inference that the affidavit is false. Furthermore, the affiant is not required to certify that the signatures do not fall into other categories set up by the Board, such as duplicates or incomplete lines. The invalidation of signatures on such grounds has no bearing on the truth of a circulator's affidavit.\n\nAs the Supreme Court of Illinois held in In re Bower, 41 Ill.2d 277, 242 N.E.2d 252 (1968):\n\n\"[I]n the absence of proof by a fair preponderance of the evidence that a circulator has acted fraudulently in obtaining false signatures, only those signatures proved to be unauthentic by the objectors should be stricken. See Kaesser v. Becker, 295 Mo. 93, 243 S.W. 346, 350. In State ex rel. Jensen v. Wells, 66 S.D. 236, 281 N.W. 99, it is said that in order to be considered fraudulent, an affidavit or verification attached to a petition for a referendum must not only be false but also be made fraudulently as established by the evidence, that is, with an intent to deceive. (281 N.W. at 103).\"\n\nId. at 285, 242 N.E.2d at 257. It should be noted that the Supreme Court of South Dakota adopted the standard in State ex rel. Jensen v. Wells, supra, even though the affiant was required to know personally each person who signed the petition. Here, no such personal knowledge is required. There is insufficient evidence to support a conclusion that an affidavit is false, let alone that it is fraudulent, simply because some of the signatures on the petition may be invalid. The trial court properly concluded that the Board did not act in accordance with the law when it invalidated over twenty thousand signatures because of \"patent falsities\" in the affidavits.\u003cspan class=\"fnref\"\u003e19\u003c/span\u003eb\n\n.\n\nThe second group of \"irregular affidavits\" rejected by the Board involves affiants who were not registered voters and affiants who gave addresses different from those on their registration cards.\u003cspan class=\"fnref\"\u003e20\u003c/span\u003eb This group affects such a small number of signatures, less than 2000, that even if the Board properly rejected these signatures, there would still be enough valid signatures to require the recall vote to be held. Once again, however, the trial court correctly determined that the Board abused its discretion:\n\n\"It is noted that under the provisions of the Charter, Section 9-101(2), the circulator/affiant of the recall petition need not be a registered voter, nor need his address be given on the affidavit. Therefore, the rejection of these signatures by the Board constitutes a triumph of form over substance.\"\n\nOpinion of Savitt, J., C.P. No. 3466, at 48 (filed September 16, 1976). In order to be actionable, a statement must not only be false, it must also be material, or made\n\n    with the purpose of inducing reliance. Certainly there is no evidence here of any intent to deceive. The Board's action, in rejecting these affidavits, was arbitrary and capricious.\n\n3.\n\nThe Opinion of the Chief Justice insists that the trial court adopted its own standards for matters within the scope of the Board's discretion. This includes the discretion, according to the Opinion of the Chief Justice, to reject signatures the Board has checked and determined to be genuine simply because the attached affidavit is false. Even when the falsity is immaterial -- or amounts to no more than collecting signatures which turn out to be invalid or, as in the case of signatures in the \"initials\" category, are valid but imperfect -- the Opinion of the Chief Justice would give the Board discretion to reject the petition. I cannot believe that the Board is vested with so arbitrary a power. I cannot believe that the distinguished committee which drafted the Charter, the Charter Commission, or the people who voted for the Charter, would reserve to the people the right to recall elected officials and then vest such broad discretionary powers in the Board of Elections as to render that power a nullity.\n\nIndeed, the condonation of the Board's use of \"irregular affidavits\" to invalidate the petition is inconsistent with the determination in the Opinion of the Chief Justice that five other categories rejected by the Board are valid. The Opinion states that it is an abuse of discretion to reject a signature merely because the voter gave an incorrect ward, even though the Charter requires signers to list their wards. Surely it is an abuse of discretion to reject an entire sheet of genuine signatures because of an \"irregularity\" in the attached affidavit having to do with matters which need not appear in the affidavit. Conclusory statements that \"falsity was a question of fact\" are not dispositive. What makes \"falsity\" a question of fact, but \"forgery\" a question of law? There\n\n    must be a basis for any finding of falsity, and the effect of any such finding is a question of law.\n\nConfronted with a similar case of an election board's rejection of a petition because of technical inaccuracies in the affidavit, the Supreme Court of Ohio held:\n\n\"[W]e think that the determination made by the board against the validity of the petition was too technical, unreasonable and arbitrary -- in short, an abuse of discretion -- and that upon the facts which [the board] had in its possession it was under the clear legal duty to approve and accept the petition . . . .\"\n\nState ex rel. Schwarz v. Hamilton County Board of Elections, 173 Ohio St. 321, 323, 181 N.E.2d 888, 890 (1962). The same reasoning should be applied here.\n\nIn announcing the arbitrary powers held by the Board, the Opinion of the Chief Justice relies heavily on Fraser v. Cummings, 48 Cal.App. 504, 192 P. 100 (1st Dist.1920). Accordingly, it is instructive to see how California courts, following the mandamus standard set out in Fraser, have treated cases involving allegedly defective affidavits attached to voters' petitions. In Whittemore v. Seydel, 74 Cal.App.2d 109, 168 P.2d 212 (3d Dist.1946), the court issued a writ of mandate against city officials who rejected a petition because the attached affidavits were not properly dated. The court reasoned:\n\n\"To construe the provision . . . regarding the affidavit so as to render the whole proceeding void . . . would be a case of the tail's wagging the dog. Here the petition and the affidavits furnished [sufficient] evidence . . . [to determine] that the requisite number of qualified electors had signed. Under such circumstances the wishes of said electors should not be defeated by the omissions of the affidavits.\"\n\nId. at 116, 168 P.2d at 216.\n\nIn Truman v. Royer, 189 Cal.App.2d 240, 11 Cal.Rptr. 159 (1st Dist.1961), the affidavits were false in a material respect in that the law required the affiant to be a voter of the city and several of the affiants were not. Nevertheless, the city clerk proceeded to check the signatures on the sheets to which the affidavits were attached and found them to be satisfactory. The affidavit requirements were mandatory on the petitioners. The court stated, however, that the affidavits:\n\n\". . . are for the benefit and convenience of the clerk, and if he checks the petition with the voters register and finds the signers qualified, he must certify the petition as sufficient. People v. City of Belmont, 1929, 100 Cal.App. 537, 541, 280 P. 540. The defective affidavits accompanying the referendum petition are not part of the petitions themselves, and failure of such should not invalidate a petition which was in fact signed by the requisite number of qualified voters who themselves had complied with all statutory requirements to make their petition effective. Whittemore v. Seydel, supra, 74 Cal.App.2d at pages 115-116, 168 P.2d at pages 217-218. Inasmuch as the power of referendum is one reserved to the people, and in order to protect the people in the exercise of this power, statutory and charter provisions dealing with such powers are always liberally construed in favor of the power. Blotter v. Farrell, 1954, 42 Cal.2d 804, 809, 270 P.2d 481. The Clerk was duty bound to certify the petition as sufficient when his investigation disclosed an ample number of qualified signers.\"\n\nId. at 243, 11 Cal.Rptr. at 162. Clearly, here, where the alleged defects in the affidavits were not material -- the affiants in this case were not required to be registered voters -- the Board was duty bound to certify the signatures which it found to be genuine after its investigation.\n\nNothing in Nomination of Cianfrani, 467 Pa. 491, 359 A.2d 383 (1976), compels a contrary result. In Cianfrani,\n\n    the candidate, in his affidavit, falsely swore that he was a member of the Democratic Party. Such a false statement might be of considerable importance to the voters signing his petition. Even if a candidate intends to change his registration after filing his petition, it may be a matter of concern to the voters signing the petition that he will have been a member of their party for so short a period. It might also concern them that the candidate has falsely sworn to an affidavit. A voter who would not have signed the petition if he knew the truth about the candidate cannot be said to have been disenfranchised when the candidate is disqualified. The voter who signs a recall petition, on the other hand, does not care whether the circulator is registered or has moved since registering. The voter's concern is with the official subject to recall, not with the individual circulating the affidavit. The voter signing a recall petition is disenfranchised if the petition is thrown out because of irregularities in the circulator's affidavit.\n\nMore importantly, in Cianfrani it was the candidate himself who swore to the false affidavit. With a recall petition, where no candidate is trying to benefit by his own misconduct, there is no reason to penalize innocent voters who signed the recall petition. Petition of Smith, 114 N.J.Super. 421, 276 A.2d 868 (1971). Similarly, Lefkowitz v. Cohen, 262 App.Div. 452, 29 N.Y.S.2d 817, aff'd, 286 N.Y. 499, 36 N.E.2d 680 (1941), held that the strict standard applicable when the candidate himself has participated in fraud does not apply when the candidate was not involved in the petition irregularities.\n\nFinally, this Court in Nomination of Cianfrani, supra, based its decision on Catherine Township Liquor Referendum Case, 382 Pa. 291, 114 A.2d 145 (1955). In a companion case, decided the same day, this Court held that an affidavit was not invalid because the circulator used her husband's name preceded by the title \"Mrs.\" instead of\n\n    signing her name as it appeared on the registration roles. In an unanimous decision this Court reasoned:\n\n\"[T]he objections to the petitions related to no more than innocent and immaterial irregularities, free of fraud, and therefore to be ignored and not permitted to prevent a full and free expression of the electorate's will with respect to the questions submitted . . . .\"\n\nBlair Township Liquor Referendum Case, 382 Pa. 295, 299, 114 A.2d 148, 149 (1955). Likewise here, the supposed defects of the affidavits to the recall petition were innocent and immaterial. The people of Philadelphia should not be deprived of their right to vote on the recall issue due to such technicalities. By signing the petition, over one hundred and fifty thousand voters have expressed their desire that a recall vote be held. It is a tragedy that the Opinion of the Chief Justice would allow the Board to disenfranchise these voters because of immaterial technicalities. There can be no doubt that the trial court correctly ruled that the Board's efforts to prevent the recall because of claimed irregularities in the affidavits was an abuse of the Board's discretion and contrary to the law.\u003cspan class=\"fnref\"\u003e21\u003c/span\u003e\n\nB. The Notarizations are legal.\n\nThe Opinion of the Chief Justice states that 115,818 signatures to the recall petition are invalid because they were on sheets notarized by persons who supported recall. These notaries include the attorney for the Recall Committee, salaried employees of the Committee, and individuals\n\n    who circulated petitions. All were in fact notaries, and none notarized his own sheets. According to the Opinion of the Chief Justice, these persons were \"directly or pecuniarily interested\" in the transaction so as to render their notarizations in violation of the Notary Public Law. Act of August 21, 1953, P.L. 1323, § 19(e), 57 P.S. § 165(e) (1964). This conclusion ignores the well established principle that \"general employment or employment as [an] agent or attorney in a matter gives a notary no such interest as to invalidate an official act done by him . . . .\" 66 C.J.S. Notaries § 6 at p. 618; Commercial Credit Corp. v. Blau, 393 S.W.2d 558 (Mo.1965). It also conflicts with prior case law in Pennsylvania.\u003cspan class=\"fnref\"\u003e22\u003c/span\u003e\n\nAn almost identical argument was presented to the court in Gallipolis v. State, 36 Ohio App. 258, 173 N.E. 36 (1930), where an attorney for parties seeking a referendum had notarized the petition. The court found no impropriety in the attorney's action, and upheld the grant of a writ of mandamus compelling the City to hold the referendum.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003e\n\nThat the Opinion of the Chief Justice has stretched the words of the Notary Public Law far beyond their intended application is revealed by its suggestion that to hold that petition circulators were not \"directly or pecuniarily interested\" would be inconsistent with the determination that they have standing to bring this action. The Notary Public Law and the law of standing serve different purposes, and the nature of the interest necessary to confer standing is far different from that which would disqualify a notary public. The interest necessary to confer standing is relatively minor, see e. g., United States v. SCRAP, 412 U.S. 669, 93 S.Ct. 2405, 37 L.Ed.2d 254 (1973), and to hold that such an interest would disqualify a notary public would foreclose many suits, because no person could be found who could validly notarize the pleadings. Indeed, some states have held that a taxpayer or elector has standing to bring an action in mandamus to compel a recall vote:\n\n\"The petition alleges that the plaintiff is an elector and taxpayer of the city of Richmond, and as such it is clear that he is directly interested in the subject-matter of this action.\"\n\nConn v. City of Richmond, 17 Cal.App. 705, 710, 121 P. 714, 716-17 (1st Dist. 1912) (emphasis added); accord, Miller v. Greiner, 60 Cal.2d 827, 36 Cal.Rptr. 737, 389 P.2d 129 (1964). If the interest necessary to confer standing was enough to disqualify a notary, no voter or taxpayer would be able to notarize a recall petition.\n\nIt should be clear that the provision of the Notary Public Law is aimed at situations where the notary's self-interest creates a serious danger of fraud -- hence the emphasis on \"pecuniary interest.\" Such is not the case here, where, as the Board's own investigation discovered,\n\n    the petition sheets which the Opinion of the Chief Justice states were illegally notarized contain genuine and valid signatures.\n\nEven if the Opinion of the Chief Justice has interpreted the Notary Public Law correctly, it provides no reason to invalidate the petition. Its interpretation of the Notary Public Law is unquestionably a strange and novel one, and it cannot be said that the circulators knew, or could have known, that the Opinion would reach such a conclusion. I would adopt the rule in Stern v. Board of Elections, 14 Ohio St.2d 175, 237 N.E.2d 313 (1968), where the Ohio Supreme Court held that, given the public policy in favor of free elections, a petition should not be invalidated for technical failure to comply with the notary public statute. The 156,214 citizens who signed the recall petition should not be disenfranchised simply because of a pronouncement that the petition was improperly notarized. As the court below observed: \"It would be unconscionable to hold that the remedy for an improper notarization is the invalidation of the petition. It is the perpetrator of the wrong who may be subject to penalty, surely not the concerned elector who signed the petition.\" Opinion of Savitt, J., C.P. No. 3466, at 51-52 (filed September 16, 1976).\n\nThe extreme technicality with which both the affidavits and the notarizations have been treated in this case can only be justified on the basis of a supposition that recall petitions are suspect. Such a view evinces a belief that the citizens of Philadelphia cannot be trusted to vote responsibly -- that they cannot be expected, by their yesno vote, to distinguish proper recall movements from those situations where an official should be retained. It rejects the expectations of the drafters of the Charter that \"the electorate will exercise its power wisely . . . .\" 351 Pa.Code, § 9.9-100 Annot. 2 (1974). It ignores the interpretation given to other home rule charters that \"legislation affording the people a right to\n\n. . . recall public officials is to be given the same liberal construction as that extended to election statutes generally.\" Reites v. Wilkerson, 99 Cal.App.2d 500, 503, 222 P.2d 81, 83 (2d Dist. 1950). Courts are, and must be, extremely protective of the right to vote; the treatment of the recall petition in the Opinion of the Chief Justice is a drastic departure from this standard.\n\nIII. RECALL IS CONSTITUTIONAL\n\nA. The Opinions striking down recall should not have reached the issue.\n\nIf the Board of Elections properly rejected the recall petition, this case should be decided on non-constitutional grounds. By proceeding further and unnecessarily addressing the constitutional issue, the opinions striking down recall depart from basic principles of judicial decision making.\u003cspan class=\"fnref\"\u003e23\u003c/span\u003ea It is well settled that courts do not decide constitutional issues where a non-constitutional ground is dispositive. Wood v. Strickland, 420 U.S. 308, 314, 95 S.Ct. 992, 997, 43 L.Ed.2d 214 (1975); Hagans v. Levine, 415 U.S. 528, 547, 94 S.Ct. 1372, 1384, 39 L.Ed.2d 577 (1974); Ashwander v. T.V.A., 297 U.S. 288, 347, 56 S.Ct. 466, 483, 80 L.Ed. 688 (1936) (Brandeis, J., concurring). This Court has consistently adhered to this\n\n    principle.\u003cspan class=\"fnref\"\u003e24\u003c/span\u003e Most recently, in Lattzanzio v. Unemployment Compensation Board of Review, 461 Pa. 392, 336 A.2d 595 (1975), this Court stated:\n\n\"[T]he basic law of this jurisdiction [is] that statutes are presumed constitutional, and we will not reach constitutional issues where the matter can be decided on non-constitutional grounds.\"\u003cspan class=\"fnref\"\u003e25\u003c/span\u003e\n\nId. at 395, 336 A.2d at 597 (citations omitted).\n\nThere is no jurisprudential need to reach the constitutionality of the recall provisions. The Opinion of the Chief Justice and the Concurring Opinions dash \"the hopes and expectations\" of thousands of Pennsylvanians by unnecessarily and erroneously abolishing recall without affording them an opportunity to be heard. The opinions attempt to justify this abrupt departure from precedent by noting that many municipalities, boroughs and townships in Pennsylvania have, or are presently considering recall provisions in their governing\n\n    charters.\u003cspan class=\"fnref\"\u003e25\u003c/span\u003ea The Justices striking down recall should heed the principle that:\n\n\"[U]nder our constitutional system courts are not roving commissions, assigned to pass judgment on the validity of the Nation's laws.\"\n\nBroadrick v. Oklahoma, 413 U.S. 601, 602, 93 S.Ct. 2908, 2915, 37 L.Ed.2d 830 (1973).\n\nB. Philadelphia's recall provisions are constitutional.\n\nThe discussion of the constitutionality of recall in the Opinion of the Chief Justice and the Concurring Opinions is both inappropriate and erroneous. Recall does not violate Article VI, section 7 of the Pennsylvania Constitution. This section provides:\n\n\"All civil officers shall hold their offices on the condition that they behave themselves well while in office, and shall be removed on conviction of misbehavior in office or of any infamous crime. Appointed civil officers, other than judges of the courts of record, may be removed at the pleasure of the power by which they shall have been appointed. All civil officers elected by the people, except the Governor, the Lieutenant Governor, members of the General Assembly and judges of the courts of record, shall be removed by the Governor for reasonable cause, after due notice and full hearing, on the address of two-thirds of the Senate.\"\u003cspan class=\"fnref\"\u003e25\u003c/span\u003eb\n\nIn order to invalidate the recall provisions of the Charter, the Opinion of the Chief Justice rewrites Article VI, section 7, and misconstrues the decisions of this Court which have interpreted it. The Concurring Opinions of Mr. Justice O'Brien and Mr. Justice Nix not only rewrite the Constitution, but would overrule the decisions of this Court which have distinguished between constitutional and non-constitutional officers in the application of the constitutional removal provisions. Moreover, the opinions striking down recall ignore the well developed body of law from other jurisdictions sustaining recall against the constitutional arguments presented here.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003e There is nothing in the Pennsylvania Constitution\n\n    or the decisions of this Court which prohibits the people of Philadelphia from holding their elected officials accountable through the recall mechanism. The opinions striking down recall have \"'wrest[ed] the words of the organic law to a purpose which it does not disclose.'\" Richie v. Philadelphia, 225 Pa. 511, 517, 74 A. 430, 432 (1909), quoting Donohugh v. Roberts, 11 Wkly.N.C. 186 (1881).\n\nThe trial court properly determined that the recall provisions were not in conflict with the Pennsylvania Constitution. That decision should be affirmed.\n\n1. The Opinion of the Chief Justice rewrites the Constitution.\n\nThe Opinion of the Chief Justice rewrites Article VI, section 7, in order to justify his result. Article VI, section 7 provides that \"All civil officials elected by the people . . . shall be removed by the Governor for reasonable cause, after due notice and full hearing, on the address of two-thirds of the Senate.\" The Opinion of the Chief Justice inserts the word \"only\" before the phrase \"for reasonable cause\" and holds that elected civil officials may be removed only for cause. This interpretation of Article VI, section 7 is not supported by the language of the section and is internally inconsistent. The Opinion states that although elected civil officials\n\n    can be removed only for cause, the Legislature may provide for different methods of removal. If the Opinion interprets the phrase \" shall be removed . . . for reasonable cause\" to mean that elected officials can only be removed for cause, then it must also interpret \" shall be removed by the Governor . . . on the address of two-thirds of the Senate\" to mean that officials can be removed only by the Governor on the address of two-thirds of the Senate.\n\nThe only reasonable interpretation of Article VI, section 7 is that when the Governor removes elected public officials he may do so only for reasonable cause on the address of two-thirds of the Senate. The requirement of \"reasonable cause\" only refers to the Governor's removal powers; Article VI, section 7 reads that elected officials shall be removed \"by the Governor for reasonable cause . . . .\" It bears no relation to the voters' right to recall.\n\nImplicit in the Chief Justice's interpretation of Article VI, section 7 is that the sole condition for holding elected office is that officers \"behave themselves well while in office.\" Just as the Opinion of the Chief Justice injects the word \"only\" to modify \"for reasonable cause\", so it has inserted the word \"sole\" before the word \"condition.\" Nowhere does Article VI, section 7 provide that the exclusive condition for holding elected office is good behavior. The Opinion of the Chief Justice, under the guise of constitutional interpretation, again rewrites Article VI, section 7 to comport with his own notions of representative government. In so doing, the Opinion also confuses two distinct removal procedures.\u003cspan class=\"fnref\"\u003e26\u003c/span\u003ea Since there is nothing in Article VI, section 7 which provides\n\n    that elected officials hold office solely on the condition of \"good behavior,\" this provision does not preclude the people of Philadelphia from electing their public officials subject to the Charter recall provisions.\n\nArticle IX of the Constitution authorizes the General Assembly to provide for local governments.\u003cspan class=\"fnref\"\u003e27\u003c/span\u003e This article indicates that the framers of the Constitution recognized the importance of local control of municipal affairs. The power to recall municipal officials, who have been elected subject to charters providing for recall, is fully consonant with the constitutional scheme for local self-government. When Article VI, section 7 is interpreted in light of Article IX, it is clear that the constitutional framers did not intend its removal provisions for state officers to limit the right of municipalities to enact recall for local officials.\n\nOther jurisdictions with similar home rule provisions in their constitutions have interpreted their constitutional removal provisions so as not to limit a municipality's right to enact a Charter providing for recall of local officials.\n\nIn Bonner v. Belsterling, 137 S.W. 1154 (Tex.Civ.App.1911), aff'd, 104 Tex. 432, 138 S.W. 571 (1911), elected members of the Board of Education challenged the constitutionality of recall as violative of the state constitutional removal provisions which required cause and trial by jury. The court held that the constitutional removal provisions were inapplicable to municipal officers. As the constitution provided for local self-government the court reasoned that the constitutional removal\n\n    provisions for state officers did not limit the municipality's right to enact recall provisions:\n\n\"The office . . . is an office created by the charter . . . and such member is a municipal officer . . . . The office is created by the charter, which also contains the recall provision, and it was under this charter that . . . appellant was elected . . . . [Recall] is not in conflict with the Constitution. The Constitution recognizes that . . . cities should be permitted to determine for themselves and in their own way the many important questions of local policy as they arise.\"\n\n137 S.W. at 1158.\n\nIn Dunham v. Ardery, 43 Okl. 619, 143 P. 331, 333 (1914), a leading case on recall, the court rejected the argument that the constitutional removal provisions were exclusive as to municipal officials.\n\n\"To so hold would be equivalent to holding that our Constitution was diametrically opposed to the charter form of government and the principle known as the recall. If it were not intended under the constitution to give cities adopting the Charter form of government, the power and right to put in practice the power to recall their officers, then there would have been some express inhibition; and in the absence of such, we are not warranted in holding that such power is by implication inhibited.\"\n\n2. The Opinion of the Chief Justice misapplies the decisions of this Court.\n\nPrior decisions of this Court lend no support to the Chief Justice's construction of Article VI, section 7. The decisions of this Court interpreting the removal provisions of the Constitution, have consistently distinguished between \"constitutional\" officers, those created by the Constitution, and \"non-constitutional\" officers, those\n\n    whose selection is not provided for in the Constitution.\u003cspan class=\"fnref\"\u003e28\u003c/span\u003e Sections 6 and 7 of Article VI form the sole basis for the removal of constitutional officers.\u003cspan class=\"fnref\"\u003e29\u003c/span\u003e Since the Legislature can neither create nor abolish constitutional offices, it has no power to alter the conditions of these constitutional offices by enacting alternatives to the constitutional removal provisions. Bowman's Case, 225 Pa. 364, 367-68, 74 A. 203, 204 (1909). This rationale is not applicable to public officials whose positions are created by the Legislature. Article VI, section 1 of the Pennsylvania Constitution provides:\n\n\"All officers, whose selection is not provided for in this Constitution, shall be elected or appointed as may be directed by law.\"\n\nBecause the Legislature may \"direct\" the election or appointment of officers whose selection is not provided for in the Constitution, it may also \"direct\" a method of removal other than those provided for in the Constitution.\u003cspan class=\"fnref\"\u003e30\u003c/span\u003e\n\nThe constitutional removal provisions are only pertinent for non-constitutional officers where the Legislature has not provided for alternative removal procedures.\u003cspan class=\"fnref\"\u003e31\u003c/span\u003e Where the Legislature has provided alternative methods of removal, the constitutional provisions are simply not applicable.\n\nThe office of the Mayor of Philadelphia is not enumerated in the Constitution and is therefore not a constitutional office. The office of Mayor is created by the Charter and is subject to the Charter's recall provisions. Article IX, section 2 of the Pennsylvania Constitution authorizes municipalities to enact home rule charters under which the municipality may exercise any function or power not denied by the Constitution or General Assembly. The Home Rule Charter Act,\u003cspan class=\"fnref\"\u003e32\u003c/span\u003e enacted pursuant to Article IX, section 2 provides:\n\n\"The city taking advantage of this act . . . shall have complete powers of legislation and administration in relation to its municipal functions, including the power and authority to prescribe the elective city officers. . . .\" (Emphasis added.)\u003cspan class=\"fnref\"\u003e33\u003c/span\u003e\n\nThis Court, in Addison's Case, 385 Pa. 48, 122 A.2d 272 (1956), held that the Philadelphia Home Rule Charter had the force and status of a legislative enactment. Therefore, the recall provisions of the Charter provide a valid legislative alternative to the constitutional removal\n\n    provisions. Since the office of Mayor is a Charter office, and not a constitutional office, the Charter provisions and not the constitutional removal provisions apply.\n\nThis Court has consistently recognized the power of the Legislature to enact provisions for the removal of non-constitutional elected officials. Today the Opinion of the Chief Justice adopts the long discredited position that Article VI, section 7 limits the Legislature's power to prescribe the removal of non-constitutional officers.\u003cspan class=\"fnref\"\u003e34\u003c/span\u003e The Opinion misapplies the decisions of this Court, and ignores the underlying rationale for the distinction between constitutional and non-constitutional officers.\n\nThe Chief Justice's reliance upon the decisions of this Court which have upheld legislative removal procedures for non-constitutional officers is misplaced. In each of these cases, the removal procedure specifically provided for removal for cause. Therefore, this Court has never faced the question whether the Legislature may enact a removal procedure which does not require cause.\u003cspan class=\"fnref\"\u003e35\u003c/span\u003e Nothing in these cases suggests that this Court upheld these legislative removal procedures because they required cause. The Opinion of the Chief Justice infers the constitutional\n\n    necessity for cause from the mere fact that the Legislature has heretofore chosen alternatives which required cause. The error in the Chief Justice's reasoning lies in his assumption that because legislative schemes have provided for removal for cause, cause is constitutionally mandated.\n\nThus, these cases do not support the conclusion of the Opinion of the Chief Justice that cause is essential in any means of removal established by statute or home rule charter for non-constitutional offices. In fact, the decisions have no bearing on the constitutionality of Philadelphia's recall provisions.\n\nThe Opinion of the Chief Justice primarily relies on Foltz Appeal, 370 Pa. 567, 88 A.2d 871 (1952), to assert that cause and due process are essential in any legislatively created means of removal for elected civil officials. This reliance on Foltz is unfounded. Foltz only addressed the issue whether the petitioners had established a \"refusal or neglect to perform duties\" as was required by the statutory removal procedure at issue. The complaint and petition in Foltz were brought pursuant to section 503 of the Second Class Township Law (1947 P.L. 1481, as amended, 53 P.S. § 19093-503) which provides that:\n\n\"[I]f any township officer refuses or neglects to perform his duties, the court of quarter sessions, upon complaint in writing by five percentum of the registered electors of the township, may issue a rule upon such officer to show cause why his office should not be declared vacant and another appointed in his stead. . . . Upon hearing, and proof that the facts alleged in the complaint are true, the court may declare the office vacant and appoint another in his stead, to hold office during the term of the officer deposed, or to make such other order as to the court may seem just or proper.\"\n\nThe Court in Foltz determined that there was insufficient evidence for the Court to remove the supervisors for the reasons required in section 503. The case did not hold that the electorate could not recall elected officials without cause.\n\nThe Chief Justice's extensive quotation from Foltz, which involved the judicial removal of an elected official, is simply not relevant to recall. Removal by a recall election is vastly different from removal by another branch of the government. Removal of an elected official by another branch of government nullifies the electorate's choice that a particular individual shall hold office. It also presents a danger that one branch of government may become dominant by abusing its power of removal, thus undermining our system of checks and balances. These may be important reasons for requiring that cause be established before another branch of government removes an elected official. Where the right of removal is reserved to the people these considerations are not present. As the Court of Appeals for the Fifth Circuit noted in Gordon v. Leatherman, 450 F.2d 562, 567 (5th Cir. 1971):\n\n\"[T]here is a fundamental difference between the expulsion or removal of a public official by the state and that same activity by the voters.\"\n\nThe reasons for the recall of an official, as in every electoral process, are properly left to the people:\n\n\"[A]n elector may vote for a good reason, a bad reason, or for no reason whatsoever. That principle applies to recall elections as it does to all other elections.\"\n\nGordon v. Leatherman, supra, 450 F.2d at 567.\u003cspan class=\"fnref\"\u003e36\u003c/span\u003e\n\n. The Opinion of the Chief Justice confuses recall with impeachment.\n\nThe Chief Justice's discussion of the alleged constitutional infirmities of recall evinces a misapprehension of the nature and purpose of recall. Because he confuses recall with impeachment, the Chief Justice ignores cases from other jurisdictions which have considered the validity of recall. Recall is based on the principle that elected officials take office on the condition that they be accountable to the electorate throughout their term of office. The Opinion of the Chief Justice confuses recall and impeachment by holding that elected officials can only be removed for cause.\n\nThe Opinion of the Chief Justice implicitly views the entire concept of recall as antithetical to the Pennsylvania Constitution. This offends the letter and spirit of the Constitution. Article I, section 2 proclaims that \"[A]ll power is inherent in the people\" and reserves to the people the right to \"alter, reform or abolish their government.\" The recall of elected officials effectuates this basic declaration of the Constitution.\n\nThe theoretical basis of recall is found in the very section of the Pennsylvania Constitution which the Opinion of the Chief Justice uses to strike it down. Article VI, section 7, expressly permits the removal of appointed officials at the discretion of the appointing power.\u003cspan class=\"fnref\"\u003e37\u003c/span\u003e Recall has been characterized as the dismissal of an appointed officer one step removed. The electorate, the \"appointing\" and ultimate source of power in a democracy, can remove elected officials who are \"appointed\" by the electorate. State ex rel. Topping v. Houston, supra;\n\nAm.Jur.2d, Public Officers and Employees § 239 (1972). In Topping, the court reasoned:\n\n\"The idea of removing public officers at the discretion of the appointing power . . . is not a novel one. The concept that this may be done at the direct instance and upon the motion of the electors, the ultimate source of power in a republic, only carries back the power of removal one step farther. If it is not obnoxious to the Constitution to allow an elected officer to remove an appointed one, how can it be a violation of that law to allow it to be done by the people themselves.\"\n\n94 Neb. at 455, 143 N.W. at 800.\n\nCourts which understand the nature and purpose of recall have upheld its validity. Home rule charter provisions providing for recall of elected officials have been upheld against the contention that recall violates state constitutional provisions as to method of impeachment, length of tenure of office, and method of removal.\u003cspan class=\"fnref\"\u003e38\u003c/span\u003e\n\nIn Hilzinger v. Gillman, supra, the court upheld the recall provisions of Everett, Washington against the contention that they violated the state's constitutional removal provisions. The court noted:\n\n\"It is finally urged that the recall provision in the charter is violative of section 3, art. 5, of the Constitution, which provides that: 'All officers not liable to impeachment shall be subject to removal for misconduct or malfeasance in office in such manner as may be provided by law.' . . . The people of the city of Everett in framing the charter intended that their representatives should be held strictly amenable to both the existing and changing public sentiment on all local measures, and that, if the official conduct of any elective officer failed at any time to so respond, he was subject to recall if the majority of the electorate in his\n\n    district so determined. The appellant accepted the trust subject to this power in his constituency, and the duration of his term of office is dependent upon the [wish] of the majority as expressed at the polls. The removal sought is not of the character provided for in the Constitution. Whether the interests of the city will be better subserved by a ready obedience to public sentiment than by a courageous adherence to the views of the individual officer on questions of public concern is a political, and not a legal, question.\"\n\nHilzinger, 56 Wash. at 234, 105 P. at 473-74.\n\nCourts have held that the validity of recall is not predicated on any requirement that officials be removed for cause.\u003cspan class=\"fnref\"\u003e39\u003c/span\u003e They have recognized that the recall of an elected official, like his election in the first place, is a political and not a judicial decision.\u003cspan class=\"fnref\"\u003e40\u003c/span\u003e\n\nIn Conn v. City Council, supra, the court in upholding the validity of recall, noted:\n\n\"Manifestly the purpose of the charter in providing for a recall election is to give the people of the municipality the right to cut short the official term of every elected officer whose conduct in office is for any cause\n\n    unsatisfactory or distasteful to the body of the community. . . . [N]owhere in the procedure . . . is anything said, either expressly or impliedly, which requires a recall petition to designate the specific acts for which a removal is sought. . . .\n\n\"It will not be disputed that the electors of a community are as well qualified to determine whether an . . . officer shall remain in office as they were to decide upon his qualifications for office in the first instance; and in so far as the charter of the city of Richmond is concerned, it is clearly the privilege of the people at the polls, rather than the province of the courts, to pass upon the sufficiency of the grounds . . . for the removal of an elected officer by the modern method of a recall election.\"\n\n17 Cal.App. at 712, 121 P. at 717 (1st Dist. 1911) (emphasis added).\n\nThus, there is no basis for any conclusion that public officials can be removed only for cause, after notice and a hearing. Such a conclusion can only be based on a failure to comprehend the differences between recall and impeachment.\n\nTwenty-five years ago, the drafters, the Charter Commission and the people of Philadelphia recognized the difference between impeachment and recall, and overwhelmingly chose recall. In its report to the voters, the Charter Commission stated:\n\n\"There has been much public criticism of the process of impeachment prescribed by the present Charter. We have sought a more satisfactory device for the removal of an elected official . . . . [W]e have found it in recall . . . .\"\n\nReport To The Voters, supra at 13. The abolition of recall is a judicial usurpation of what is clearly a decision for the people.\n\n. The Concurring Opinions misconstrue the Constitutions.\n\n     a. Like the Opinion of the Chief Justice, the Opinions of Mr. Justice O'Brien and Mr. Justice Nix are compelled to rewrite the Constitution in order to invalidate recall. Both opinions state that the constitutional removal provisions are the exclusive procedures for the removal of elected civil officials. While the two opinions use somewhat different reasoning, both reach their conclusion on the basis of a textual analysis of Article VI.\n\nMr. Justice Nix reasons that the provisions of Article VI, section 7, clauses 1 and 3 are mandatory and therefore exclusive. Although Mr. Justice Nix would have it appear that exclusivity is mandated from a \"plain and untechnical reading\" of Article VI, section 7, a textual analysis of the section does not support this interpretation.\n\nArticle VI, section 7, cl. 1 provides that all civil officers shall be removed upon conviction of misbehavior in office or for any infamous crime. Article VI, section 7, cl. 3 provides that elected civil officials shall be removed by the Governor for reasonable cause on the address of two-thirds of the Senate. Although the language of these provisions may be mandatory in the event of conviction for misbehavior in office or for an infamous crime, or upon the establishment of reasonable cause, there is no language indicating that they are exclusive.\u003cspan class=\"fnref\"\u003e41\u003c/span\u003e\n\nMr. Justice O'Brien concludes that the inclusion of several removal mechanisms in the Pennsylvania Constitution necessarily excludes all others. He recognizes that while the Federal Government is a government of delegated powers, the State is not so limited. Nevertheless, he determines that the power to remove all civil officers is limited to those methods specifically enumerated in the Constitution. There is no basis for such a conclusion. In the absence of express language of limitation, it does not follow that a provision in the State Constitution, making procedures available without the need for legislative enablement, necessarily prevents the Legislature from enacting similar provisions.\n\nThe Concurring Opinions conclude, solely from the words of the Constitution, that the removal provisions are exclusive. Since there is no language of exclusivity in these provisions, however, any conclusion that they are exclusive cannot come from language of the Constitution, but must be derived from an analysis of the constitutional framework.\u003cspan class=\"fnref\"\u003e42\u003c/span\u003e\n\nContrary to the approach taken in the Concurring Opinions, the Constitution is not to be interpreted by the application of mechanistic rules, so as to give the words a meaning which does not appear on their face and which undermines the basic purposes of the Constitution. Rather, this Court should interpret the constitutional removal provisions in light of the overall constitutional scheme. As this Court stated in Commonwealth ex rel. Smillie v. McElwee, 327 Pa. 148, 193 A. 628 (1937):\n\n\"'Written constitutions should be construed with reference to and in the light of well-recognized and fundamental principles lying back of all constitutions, and constituting the very warp and woof of these fabrics.'\"\u003cspan class=\"fnref\"\u003e43\u003c/span\u003e\n\nLooking at the overall constitutional scheme, there is a basis for deciding that the constitutional removal provisions are exclusive as to constitutional officers. This principle, however, stems from the distinction between constitutional and non-constitutional officers set out in Article VI, section 1.\u003cspan class=\"fnref\"\u003e44\u003c/span\u003e It cannot be used to support the\n\n    reasoning of the Concurring Opinions that the constitutional removal provisions are exclusive as to non-constitutional officers as well.\n\nWhen the Constitution created certain offices, rather than leaving them to be created by the Legislature, it intended that these offices be independent of the Legislature. Since the Legislature does not have the power to create the office, it cannot abolish it nor alter the conditions of tenure. This balance of power, envisioned by the Constitution, would be destroyed if the Legislature could enact conditions of tenure, including removal provisions, for constitutional officers other than those provided for in the Constitution.\n\nNone of these considerations are present, however, in the case of those offices which the Constitution specifically allows the Legislature to create. The Constitution envisions that the Legislature may provide for the selection and removal of both elected and appointed officers. To hold that the constitutional removal provisions proscribe the Legislature's power to control officers which they have created subverts this constitutional framework.\n\nThe Concurring Opinions' interpretation of the Constitution also subverts the constitutional provisions for local self-government. Article IX of the Pennsylvania Constitution authorizes the General Assembly to provide for local government. It provides for the delegation of comprehensive power to municipal government. Central to this constitutional scheme of local self-control is the power of local government to select and remove its own elected officials. When the removal provisions of Article\n\nVI are construed in light of Article IX it is clear that the constitutional framers did not intend the removal provisions enumerated in the Constitution to proscribe the power of local government to remove local officials.\n\nIn Commonwealth ex rel. Smillie v. McElwee, supra, this Court recognized the importance of home rule, and the importance of the proper distribution of power between state and local government, in our constitutional framework:\n\n\". . . the principle of 'home rule,' i. e., local self-government, which, like the triparte separation of governmental powers, is a vital part of both the foundations and the general framework of our state and federal governments.\"\n\n\". . . [T]he primary and vital idea of [home rule] is, that local affairs shall be managed by local authorities . . . .\"\n\n327 Pa. at 152, 193 A. at 630.\n\nWhen construed in this context, it is clear that the constitutional removal provisions were not intended to limit the power of local government and its citizens to remove their own officials.\n\n     b. In order to invalidate recall, the Concurring Opinions are compelled to assert that the long line of cases which have distinguished between constitutional and non-constitutional officers should be overruled. This distinction is articulated in the Constitution itself,\u003cspan class=\"fnref\"\u003e45\u003c/span\u003e and had\n\n    been recognized by this Court at least since 1867.\u003cspan class=\"fnref\"\u003e46\u003c/span\u003e Yet the Concurring Opinions would have it appear that Milford Township Supervisors' Removal, supra, created a new rule of decision when it held that Article VI, section 7, cl. 3 does not apply to the removal of non-constitutional officers if the Legislature enacts alternative removal procedures. Milford did not announce a new doctrine; it merely applied a well established doctrine to facts well within the contemplation of the cases which established the doctrine.\n\nOver a century ago, this Court recognized the distinction between constitutional and non-constitutional officers and unequivocally sanctioned the power of the Legislature to select and remove non-constitutional elected officers:\n\n\"Not having been mentioned by the Constitution, the legislature was left with unrestricted power to prescribe what the duties of the office should be, what the length of its tenure, what its emoluments, and how it should be filled. Having the power to create, they have also the power to regulate, and even destroy.\"\n\n    of the power of revision and repeal by the legislature. . . .\"\n\nCommonwealth v. Moir, 199 Pa. 534, 548-49, 49 A. 351, 355 (1901) (citations omitted).\n\nIn Bowman's Case, supra, this Court held that the constitutional removal provisions were exclusive as to constitutional officers. In so doing, this Court noted the distinction between constitutional and non-constitutional officers and expressly recognized that non-constitutional officers might not be subject to the constitutional removal provisions:\n\n\"As a constitutional . . . officer, elected by the people, he is to be removed from his office only by the Governor for reasonable cause after due notice and full hearing, on the address of two-thirds of the Senate, for, though others filling purely legislative offices may be without the constitutional provision as to removal, he is clearly within it.\"\n\n225 Pa. at 368, 74 A. at 204. (emphasis added). Bowman was not the first case to recognize the distinction between constitutional and non-constitutional officers. Rather Bowman was merely referring to an already well established principle. In the same year that Bowman was decided, this Court stated:\n\n\". . . a clear distinction is recognized by our cases between a constitutional office enjoying exemption from legislative interference and control and one wholly legislative, created and abolished at the legislative will.\"\n\nRichie v. Philadelphia, 225 Pa. 511, 513, 74 A. 430 (1909).\n\nTen years after Bowman, this Court reemphasized the importance of the distinction between constitutional and non-constitutional officers in Commonwealth ex rel. Vesneski v. Reid, supra. Although Reid specifically held that in the absence of a legislative enactment an elected\n\n    official had to be removed on the basis of the constitutional removal provisions, the opinion clearly sanctions legislative alternatives to the constitutional removal provisions in the case of non-constitutional elected officials.\u003cspan class=\"fnref\"\u003e48\u003c/span\u003e\n\nThus, it is clear that Milford did not announce a new rule of decision. Rather, it merely applied a well established doctrine, articulated by the Constitution, and consistently adhered to by this Court for over a century. Moreover, subsequent cases have uniformly adopted Milford's rationale.\u003cspan class=\"fnref\"\u003e49\u003c/span\u003e There is no reason to overrule this long line of cases.\u003cspan class=\"fnref\"\u003e50\u003c/span\u003e They are consistent with the letter of the Constitution and give effect to the constitutional\n\n    distribution of power between state and local government.\n\n     c. The Concurring Opinions state that the constitutional removal provisions are exclusive, but there is no language in the Constitution which supports their interpretation. The opinions employ mechanistic rules of interpretation to give the removal provisions a meaning which does not appear on their face. They fail to comprehend Article VI, section 1, the constitutional provision which authorizes the Legislature to select and remove non-constitutional officers, and assert that the cases interpreting this provision should be overruled. At the same time, the Concurring Opinions fail to give the constitutional removal provisions an interpretation which is consistent with the overall constitutional framework. If a majority of this Court were to adopt the position taken in the Concurring Opinions, local government and its citizens would be powerless to remove their own elected officials, and the constitutional provision for local self-government would be undermined.\n\nMoreover, the Concurring Opinions only obfuscate the issue presented: the validity of recall. As the Concurring Opinions recognize, the position they take is contrary to the case law in this jurisdiction. Since the Concurring Opinions do not overrule these cases, the Legislature still has the power to enact removal provisions governing the offices it creates. While the Concurring Opinions may question whether the Legislature should have this power, they provide no basis for a conclusion that this power does not include the authority to provide for recall. Thus, the Legislature may provide for the removal of non-constitutional officials, and this power must include the ability to authorize the recall of non-constitutional elected officials. Provisions for the recall of the Mayor of Philadelphia have been adopted pursuant to this authority; the recall provisions of the Philadelphia Home Rule Charter are constitutional.\n\nIV.\n\nThe citizens of Philadelphia, by their vote adopting the Home Rule Charter, determined that officials elected under the Charter accept office subject to recall by the electorate. In reserving to themselves the power to recall elected officials, the citizens of Philadelphia, like thousands of other Pennsylvanians, have acted in accordance with well established principles of American self-government. Their decision to adopt a procedure for more direct control over city government \"is a classic demonstration of 'devotion to democracy . . . .'\" City of Eastlake v. Forest City Enterprises, 426 U.S. 668, 679, 96 S.Ct. 2358, 2364, 49 L.Ed.2d 132 (1976), quoting James v. Valtierra, 402 U.S. 137, 141, 91 S.Ct. 1331, 1334, 28 L.Ed.2d 678 (1973).\n\nAlthough they cannot agree on their reasons, the Opinion of the Chief Justice and the Concurring Opinions, without necessity or justification, pronounce recall unconstitutional. Like democracy itself, recall may not be perfect, but it is not for this Court to question the wisdom of its adoption. One can only hope that in the future, in another setting, this Court will come to a more realistic and enlightened view and restore to Pennsylvania their right to recall.\n\nI dissent and would affirm the trial court's order directing that the recall vote be held.\n\n\u003cspan class=\"fn\"\u003e1. This Court possesses jurisdiction to consider these appeals by virtue of Section 205 of the Appellate Court Jurisdiction Act, Act of July 31, 1970, P.L. 673, Section 205, 17 P.S. § 211.205. We granted appellants' request to assume plenary jurisdiction of the appeals in this cause by Order dated September 20, 1976.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. Title 351, Pennsylvania Code, Section 9.9-100 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Upon validating the recall petition, the Board of Elections is required, pursuant to Section 9.9-102 of the Home Rule Charter, to notify the incumbent named in the petition. If the incumbent does not resign from his office within ten days after the said notice is given to him, the Board must arrange a recall election pursuant to Section 9.9-103.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. City Commissioners v. Citizens Committee and the Honorable Frank L. Rizzo, C.P., No. 3706 (filed July 7, 1976). The Court of Common Pleas retained jurisdiction in that case until such time as action on the petition was taken by the Board.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. On August 24, 1976, the Board's staff submitted its report to the Board summarizing the results of the examination of the recall petition. This report was adopted by the Board by a 2-1 vote. The report disclosed that there was a total of 210,806 entries on the petition. Of these, the staff found 122,296 to be defective for enumerated reasons. (See Opinion of Savitt, J., C.P., No. 3466, pp. 32-34, filed September 16, 1976). Under Section 9.9-101(1) of the Philadelphia Home Rule Charter, a recall petition must contain signatures equal in number to 25% of the votes cast for the office of Mayor at the last preceding mayoralty election in order to qualify for filing. There is no dispute in the instant case that the requisite number of valid signatures is 145,448. Since the calculation of the staff report determined that only 88,894 signatures were valid, the Board rejected the petition on the basis of insufficient valid signatures.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. The additional issues raised by the parties on these appeals we deem to be ancillary to the determination of the three primary issues, as stated. Therefore, we will dispose of these lesser points within the broader framework of the discussion of the more fundamental issues in the course of this opinion.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. Act of June 8, 1893, P.L. 345, as amended, 12 P.S. § 1911 et seq. (This act has been suspended by the Rules of Civil Procedure except insofar as the act authorizes actions of mandamus.)\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. Act of December 2, 1968, P.L. 1133, 53 P.S. §§ 11301 et seq.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. In Williams v. Rowe, 3 Pa. Commw. 537, 545, 283 A.2d 881, 885 (1971), the court stated: \"In requesting the extra-ordinary relief provided for by mandamus and by the Pennsylvania Rules of Civil Procedure No. 1098, supra, the appellants had a heavy burden to prove to the court that their right to a summary judgment was clear and free from doubt. See Rogoff v. Bunche Company, 395 Pa. 477, 151 A.2d 83 (1959) and Travis v. Teter, 370 Pa. 326, 87 A.2d 177 (1952).\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Act of December 2, 1968, P.L. 1133, 53 P.S. § 11307.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. See Opinion of Savitt, J., C.P., No. 3466, pp. 17-24 (filed September 16, 1976).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Title 351, Pennsylvania Code, Section 9.9-101(3), reads in full as follows: \"A recall petition shall be tendered for filing to the board of elections having jurisdiction over elections in the City. Such board shall examine it to see whether it contains a sufficient number of apparently genuine signatures. The board may question the genuineness of any signature or signatures appearing on the recall petition and if it shall find that any such signature or signatures are not genuine, it shall disregard them in determining whether the petition contains a sufficient number of signatures. It shall also disregard any signature dated more than sixty days before the date the petition was tendered for filing. The board shall eliminate any sheet of the petition which is not accompanied by the required affidavit. The invalidity of any sheet of the petition shall not affect the validity of the petition if a sufficient number of signatures remains after eliminating such an invalid sheet. The board shall complete its examination of the petition within fifteen days and shall thereupon file the petition if valid or reject it if invalid.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. Persuasive authority for this position also may be found in the analogous provision for the remedy of mandamus to review rejections of nomination petitions under the Election Code of 1937, P.L. 1333, 25 P.S. § 2936. See, e. g., Petition to Set Aside Sunday Movies, 41 Schuylkill L.R. 182, 184 (1945).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. In Work v. United States ex rel. Rives, 267 U.S. 175, 177, 45 S.Ct. 252, 69 L.Ed. 561 (1925), Mr. Chief Justice Taft summarized the modern law of mandamus: \"Mandamus issues to compel an officer to perform a purely ministerial duty. It can not be used to compel or control a duty in the discharge of which by law he is given discretion. The duty may be discretionary within limits. He can not transgress those limits, and if he does so, he may be controlled by injunction or mandamus to keep within them. The power of the court to intervene, if at all, thus depends upon what statutory discretion he has.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. See also Porter v. Bloomsburg State College, 450 Pa. 375, 301 A.2d 621 (1973); Garratt v. Philadelphia, 387 Pa. 442, 127 A.2d 738 (1956).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. See note 12, supra, for the text of this particular provision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. As to the category of \"irregular affidavits,\" the appellant, Mayor Rizzo, submits on this appeal that the trial court also erred in refusing to permit him to introduce evidence at trial that the affidavits were defective. It was the opinion of the trial court that in the case of an action in mandamus it is limited to the consideration of that evidence which the defendant officer or agency considered. It is true that this is the general rule in the case of a proceeding in mandamus. Crede v. Pittsburgh, 355 Pa. 369, 49 A.2d 700 (1946). But this rule is not applicable where there was no hearing or opportunity to submit evidence by the \"interested parties\" in the proceedings below. See 52 Am.Jur.2d Mandamus § 468, at 790-91; 55 C.J.S. Mandamus § 334, at 588. Cf. Detoro v. Pittston, 344 Pa. 254, 25 A.2d 299 (1942); Socialist Labor Case, 332 Pa. 78, 1 A.2d 831 (1938).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. These signatures had been placed by the Board in the following categories as reasons for their rejection: initials 21,195 signaturesabbreviations 2,962 signaturesinsufficient signature 3,482 signaturesincorrect ward 11,209 signaturesforgeries/alterations 6,313 signaturesirregular affidavits 22,159 signatures.The category of \"illegal notarizations\" was checked independently of the others and 115,818 signatures were found to be uncountable for this reason.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. This petition required 145,448 signatures and the court found a total of 156,214 valid signatures were presented to the Board. See note 5, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. See note 18, supra. The remaining 35,335 were disregarded because of defects in the signatures themselves unrelated to the affidavit.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The record differs as to the figure used to determine which affidavits to challenge. In his report to the Board, Joseph Migatz, Voter Registration Supervisor, used the figures of one-third to three-fourths irregular signatures. Record at 1345a. At trial, Mr. Migatz testified that the base figure was 25%. Record at 462a.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Included among the sheets rejected for this reason were the following: (1) a set of sheets containing 95 signatures, 85 of which were defective under the Board's criteria and 55 of those were not registered; (2) a set of sheets containing 105 signatures, 103 of which were defective under the Board's criteria, 30 of which were apparently signed by the same person and most of which were completed by the same person; (3) a set of sheets containing 29 signatures, 25 of which were not registered.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. Examples of false address, one criterion for determining falsity of the affidavit, were provided to the Board by Mr. Migatz: \"Gloria Tukes, and a couple of other people where there was a vacant lot, and one gentleman where there was a boarded-up home and nobody was there within six months, and yet within the date that he had signed, swore to the thing, it was already boarded up.\" Record at 1352a-53a.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Attorney Harvey notarized petitions containing 1,532 signatures. Coordinator Yanoff and the salaried employees, all also circulators, notarized approximately 40,000 signatures. The other twelve circulators notarized the remainder. There was also some evidence, although unclear, that Attorney Harvey may have been a circulator. He was, however, a member of the Recall Committee as well as its attorney.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. We note that in holding that appellees had standing in mandamus, the court below stated that they had \"the necessary special interest to maintain this action. The Citizens' Committee is the association which organized and directed the obtaining of over 210,000 signatures on the recall petition.\" Opinion of Savitt, J., C.P., No. 3466, p. 20 (filed September 16, 1976). The members of the Committee, such as the attorney, coordinator and the salaried employees, cannot now assert that their interest was merely a general one.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. We are not persuaded by City Commission of Gallipolis v. State ex rel. Houck, 36 Ohio App. 258, 173 N.E. 36 (1930). Our statute is much broader in its prohibition than the one construed in that case to apply only to affidavits filed in litigation. More forcefully, the Ohio Supreme Court in State ex rel. Reed v. Malrick, 165 Ohio St. 483, 137 N.E.2d 560 (1956), seemed to disagree with that narrow reading of the Ohio statute. It stated that its holding that a candidate cannot notarize the affidavits for his own petition was \"consistent with the restrictions imposed by statute upon notaries in the exercise of their authority in taking depositions. The evil to be avoided by this restriction is the same in both instances.\" Id. at 490, 137 N.E.2d at 565.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. Since the court found a total of 156,214 valid signatures, reversal as to the 57,494 or the 115,818 would clearly put the total below the necessary 145,448 signatures.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. Since we reach our decision on grounds of unconstitutionality under the Pennsylvania Constitution, we do not, and need not, determine the preemption claim of appellants or the constitutionality of recall under the Federal Constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. All such officers, of course, are also subject to removal by the process of impeachment, see Pa.Const. art. VI, §§ 4, 5, 6, or upon \"conviction of misbehavior in office or of any infamous crime.\" See Pa.Const. art. VI, § 7, cl. 1. Furthermore, the power of those promulgating a home rule charter is derived from the power invested in the legislature, and therefore obviously cannot exceed the bounds of legislative power.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. For the sake of clarity, I refer to this provision throughout as Article VI, Section 7. In the Constitution of 1874, this provision was found in Article VI, Section 4. On May 17, 1966, Articles VI, VII, and XII of the 1874 Constitution were consolidated and renumbered in Article VI.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See note 2, supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In his dissenting opinion, post at p. 293, n. 41, Mr. Justice Roberts attempts to argue that the constitutional methods for removal should not be considered exclusive by asserting that such construction was rejected by this Court in Commonwealth v. McCombs, 56 Pa. 436 (1867). I am curious, however, as to how he can rely on that case for his proposition, considering that the McCombs Court was construing the Constitution of 1838. It should be emphasized that the 1838 Constitution did not contain the comprehensive removal scheme added to the Constitution of 1874. Rather, the former Constitution contained a provision analogous only to the first clause of Article VI, Section 7. See Pa.Const. of 1838, art. VI, § 9. In my view, there is no basis for interpreting constitutional language by relying on a case decided before that language existed. Further, McCombs addressed the question of the right of the legislature to attach conditions to a term of office. To interpret this power to include the right to provide ultimate means for removal fails to recognize the distinction between a condition of office and the procedure to be followed for removing an incumbent from an office. While a violation of a condition of office may ultimately result in a ground for removal, that is nonetheless distinguishable from the actual process of removal that may be required. Thus, under the third clause of Article VI, Section 7, the legislature is free to determine what may constitute reasonable grounds for removal, however, it is not free to provide a different process for attaining removal. As to this, the third clause of Article VI, Section 7 is exclusive.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. See Comment, Current Problems in Pennsylvania Law, 99 U.Pa.L.Rev. 829, 837 (1951).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. In Bowman's Case, supra, the Court struck down a statutory procedure for removing an elected justice of the peace, a constitutionally created office, as violative of the third clause of Article VI, Section 7. The Court unfortunately ventured beyond the precise issue in that case, however, to say that \"non-constitutional\" offices may not be within the constitutional provisions for removal. This dictum was not only patently unnecessary to the Court's decision, but was included without any citation of authority for its validity.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. In his dissenting opinion, Mr. Justice Roberts asserts that Commonwealth v. Moir, 199 Pa. 534, 49 A. 351 (1901), Commonwealth ex rel. Braughler v. Weir, 165 Pa. 284, 30 A. 835 (1895), and Commonwealth v. McCombs, 56 Pa. 436 (1867), support his proposition that, as to elected officials, the dichotomy was recognized prior to this Court's decision in Milford. It should first be noted that all of these cases dealt with the power of the legislature to abolish a legislatively created office. The dissenting opinion therefore fails to acknowledge the distinction between the abolishment of an office and the removal of an officer from an existing office. In the cases relied upon, the dichotomy was used only in connection with the right of the legislature to abolish a legislatively created office. These cases thus provide no support for the legitimacy of this dichotomy where the consideration is the right to remove an incumbent from an existing office. Abolition of an office is a matter wholly distinct from removal, and is therefore irrelevant to the question presently at bar. See, e. g., Carey v. Altoona, 339 Pa. 541, 16 A.2d 1 (1940); Lloyd v. Smith, 176 Pa. 213, 35 A. 199 (1896). It should also be noted that Commonwealth ex rel. Vesneski v. Reid, 265 Pa. 328, 108 A. 829 (1919) likewise provides little support to the position taken in the dissent. While the Vesneski Court repeated the dictum from Bowman's Case, supra, it specifically held that the elected burgess in that case was removable solely by the methods provided in the Constitution.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. See, e. g., Naef v. City of Allentown, 424 Pa. 597, 227 A.2d 888 (1967); Bowers v. Pennsylvania Labor Relations Board, 402 Pa. 542, 167 A.2d 480 (1961); Buell v. Union Township School District, 395 Pa. 567, 150 A.2d 852 (1959); Watson v. Pennsylvania Turnpike Commission, 386 Pa. 117, 125 A.2d 354 (1956); Commonwealth ex rel. Reinhardt v. Randall, 356 Pa. 302, 51 A.2d 751 (1947); Commonwealth ex rel. Houlahen v. Flynn, 348 Pa. 101, 34 A.2d 59 (1943); Kraus v. Philadelphia, 337 Pa. 30, 10 A.2d 393 (1939); Suermann et al. v. Hadley, 327 Pa. 190, 193 A. 645 (1937); Weiss v. Zeigler, 327 Pa. 100, 193 A. 642 (1937); Commonwealth ex rel. Attorney General v. Hiltner, 307 Pa. 343, 161 A. 323 (1932); Muir v. Madden, 286 Pa. 233, 133 A. 226 (1926); Commonwealth ex rel. Attorney General v. Benn, 284 Pa. 421, 131 A. 253 (1925).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. This concept has on occasion been expressed by referring to the officer empowered by the legislature to fill the office as the \"agent\" of the legislature. See, e. g., Watson v. Pennsylvania Turnpike Commission, 386 Pa. 117, 125 A.2d 354 (1956); Commonwealth ex rel. Attorney General v. Benn, 284 Pa. 421, 131 A. 253 (1925).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. This view is supported by the fact that the clause expressly excludes certain specified elected civil officials not intended to be covered within its provisions. Thus, the doctrine of expressio unius est exclusio alterius clearly applies. See Pane v. Commonwealth, Department of Highways, 422 Pa. 489, 222 A.2d 913 (1966); Commonwealth ex rel. Maurer v. Witkin, 344 Pa. 191, 25 A.2d 317 (1942). The Milford Court, however, apparently ignored this basic rule of construction.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. Article XII, Section 1 provided in full as follows: All officers whose selection is not provided for in this Constitution, shall be elected or appointed as may be directed by law: Provided, That elections of State officers shall be held on a general election day, and elections of local officers shall be held on a municipal election day, except when, in either case, special elections may be required to fill unexpired terms. Article XII, Section 1 was consolidated on May 17, 1966, with Articles VI and VII, renumbered to its present Article VI, Section 1, and amended to delete the proviso.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. A provision governing the removal of judges of the courts of record was included in the Judiciary Article, Article V, Section 15. Pa.Const. of 1874, art. V, § 15.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e14. In 1966, Article XII, Section 1 was consolidated with, inter alia, the provisions of Article VI, and the new Article VI was entitled \"Public Officers\". See note 12, supra. In Mr. Justice Pomeroy's dissenting opinion, post at pp. 263-264, n. 10b, it is contended that this consolidation should be viewed as a legislative \"adoption\" of the judicial gloss imposed on the former Article XII, Section 1. Such reasoning, however, is clearly strained. If the legislature had intended the former Article XII, Section 1 to operate as an exception to the third clause of Article VI, Section 7, it could have so provided by express language. This it did not do. The 1966 reconsolidation should therefore be interpreted according to what it accomplished; the grouping together, in Article VI of the Constitution, all provisions relating to \"public officers\".\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e15. While the power of appointment traditionally encompassed the power of removal, no such corresponding power was recognized in the case of an elected official.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. This writer dissented in Frame, expressing the view that the majority's opinion in that case could be justified only by rejecting longstanding prior cases relevant therein. The crux of my dissent in Frame was that the majority reached its result by simply ignoring those previous decisions.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. See, e. g., Marshall Impeachment Case, 360 Pa. 304, 62 A.2d 30 (1948).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e2. As to the court's ruling that mandamus was proper, it should be noted that the authorities relied upon in support of this ruling antedated the passage of the Local Agency Law, Act of December 2, 1968, P.L. 1133, § 1 et seq., 53 P.S. § 11301, et seq. As to the court's ruling that its scope of review was limited to the administrative record, it should be noted that this was based on precedent where the administrative agency conducted a full hearing; instantly, of course, the Board did not.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e3. Section 2 of the Local Agency Law, 53 P.S. § 11302(1) provides: \"(1) 'Adjudication' means any final order, decree, decision, determination or ruling by a local agency affecting personal or property rights, privileges, immunities or obligations of any or all of the parties to the proceeding in which the adjudication is made, but shall not mean any final order, decree, decision, determination or ruling based upon a proceeding before a court, or which involves the seizure or forfeiture of property, or which involves paroles or pardons.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e4. See, e. g., Young v. Littlestown Area School District, 24 Pa. Commw. 621, 358 A.2d 120 (1976); Kudasik v. Board of Dir., Port Allegheny School District, 23 Pa. Commw. 208, 350 A.2d 887 (1976); Flinn v. Pittenger, Sec. Ed., 19 Pa. Commw. 54, 338 A.2d 735 (1975); Hutnik v. Duquesne School District, 8 Pa. Commw. 387, 302 A.2d 873 (1973). Cf. Nicolella v. Trinity A. Sch. Dist., 444 Pa. 544, 281 A.2d 832 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e5. In his dissenting opinion, Mr. Justice Roberts argues that de novo review by a court should not follow an administrative determination regarding a recall petition as is required with a nomination petition under the Election Code, Act of June 3, 1937, P.L. 1333, Art. IX, § 976, as amended, 25 P.S. § 2936, because of the vast number of signatures involved in a recall petition. And while Mr. Justice Roberts does not suggest that because of this factor a full and fair hearing is required at the administrative level pursuant to the Local Agency Law, his position fully supports the view that the Local Agency Law should apply such that an administrative hearing is required and review by the court limited following the administrative determination. To the extent that the failure to express a view that the Local Agency Law is applicable instantly or that a full administrative hearing is otherwise required implies that such a hearing is not required at the administrative level, I cannot agree with Mr. Justice Roberts. Whether in the context of a nomination petition where a full hearing is afforded before the court, or in the context of a recall petition where a full hearing is arguably required before the administrative body, a full hearing is required at some level of the proceedings, be it before the administrative body or the court, because recall petitions confront the decision maker with triable issues of fact and a hearing is therefore essential. Indeed, the Election Code clearly recognizes this because it provides for a full and fair hearing before the court.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e6. In his dissenting opinion, n. 27, Mr. Justice Pomeroy implies the Mayor's offer, if proved, would not establish the signatures were not genuine but only that some affidavits were \"irregular.\" I cannot agree. The offer, if proved, would establish the affidavits were false. If false, the affidavits would have to be disregarded. The Charter requires rejection of any sheet not having an affidavit. 351 Pa.Code § 9.9-101(3). Thus, the offer, if proved, because of the number of allegedly false affidavits and because of the number of sheets and signatures thereon that could not then be counted, would have shown the petition to be numerically insufficient to warrant a recall. Nor can I agree that a court's discretion is so broad as to preclude the Mayor from presenting evidence as to the validity of the petition at any level of the proceedings.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e7. The ruling would have been correct if, as I have suggested earlier, the Local Agency Law was applicable and the Board was thereby required to conduct an adversary hearing because in that context the evidence could have been introduced at the hearing before the Board. But, since it is said the Local Agency Law is inapplicable and thus the Mayor and the Committee had no right to appear at a hearing before the Board and present evidence when the Board conducted its examination, the ruling in the context of a mandamus action was clearly erroneous as the opinion of the Chief Justice recognizes. But the opinion of the Chief Justice fails to recognize how this erroneous ruling, in effect, denied the parties any opportunity ever to fully and fairly litigate the validity of the petition before the same decision maker and in the same forum. 1a Mr. Justice O'BRIEN and Mr. Justice NIX, in separate concurring opinions, hold recall unconstitutional under the Pennsylvania Constitution on grounds which go beyond those enunciated by the Chief Justice in his opinion announcing the decision of the Court. Both concurring opinions, however, agree with the conclusion of the Chief Justice that removal must be premised upon cause. Thus any references in this part of the dissenting opinion to the opinion of the Chief Justice should be read as applying with equal force to those parts of the separate concurring opinions of Mr. Justice O'BRIEN and Mr. Justice NIX which hold that removal must be based upon cause. 2a Under Article IX, Sec. 2 of the Constitution of Pennsylvania, a municipality which adopts a home rule charter \"may exercise any power or perform any function not denied by the Constitution, by its home rule charter or by the General Assembly at any time.\" The Home Rule Charter Act, Act of April 21, 1949, P.L. 665, § 17, 53 P.S. § 13131, provides that the city taking advantage of the Act \"shall have complete powers of legislation and administration in relation to its municipal functions, including the power and authority to prescribe the elective city officers . . .\" See Addison Case, 385 Pa. 48, 122 A.2d 272 (1956). 3a Appointed officers, as distinguished from elected officers, may, except for judges, be removed by the power which appoints them. Pennsylvania Constitution, Art. VI, Sec. 7. 4a The full text of Art. VI, Sec. 7 is as follows: \"All civil officers shall hold their offices on the condition that they behave themselves well while in office, and shall be removed on conviction of misbehavior in office or of any infamous crime. Appointed civil officers, other than judges of the courts of record, may be removed at the pleasure of the power by which they shall have been appointed. All civil officers elected by the people, except the Governor, the Lieutenant Governor, members of the General Assembly and judges of the courts of record, shall be removed by the Governor for reasonable cause, after due notice and full hearing, on the address of two-thirds of the Senate.\" Address by the Senate as provided in this section is one of two traditional methods of removing public officers. The other method is impeachment. Article VI, Sec. 6 provides that \"The Governor and all other civil officers shall be liable to impeachment for any misbehavior in office.\" The power of impeachment lies solely in the House of Representatives (Sec. 4), and all impeachments are tried by the Senate, concurrence of two-thirds of the members present being required (Sec. 5). The difference in scope of the grounds for removal by means of impeachment and address, respectively, is unclear. See the discussion of these provisions in Reference Manual No. 5, The Judiciary, of the Pennsylvania Constitutional Convention of 1967-1968, part V, 157 et seq. 5a A public officer whose office is established by the Constitution may be removed only as provided in the Constitution; the legislature has no power to provide a method for his removal. Bowman Case, 225 Pa. 364, 74 A. 203 (1909). See Marshall Impeachment Case, 360 Pa. 304, 62 A.2d 30 (1948). See generally, Note, Removal of Public Officers in Pennsylvania: The Constitutional Provisions, 99 U.Pa.Rev. 829 (1951). 6a The power of the legislature to regulate and control the incidents of an office created by it was forcibly enunciated by the Court more than a century ago: \"Not having been mentioned by the Constitution, the legislature was left with unrestricted power to prescribe what the duties of the office should be, what the length of its tenure, what its emoluments, and how it should be filled. Having the power to create, they also have the power to regulate, and even destroy.\" Commonwealth v. McCombs, 56 Pa. 436, 439 (1867). See also, Commonwealth ex rel. Braughler v. Weir, 165 Pa. 284, 289, 30 A. 835 (1895). 7a In Weiss v. Ziegler, supra, the rule of Milford Township and its antecedents was extended to legislative provisions for removal of appointed officers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e8. For a later stage of the litigation surrounding the attempt to remove Mr. Marshall as Receiver of Taxes, see Marshall Impeachment Case, 363 Pa. 326, 69 A.2d 619 (1949). There is evidence that the draftsmen of the Philadelphia Home Rule had the tortuous Marshall litigation in mind when they sought through the recall provision \"a quicker and better procedure\" whereby to deal with the problem of an unsatisfactory public servant. See Charlton F. Chute and Edgar B. Cale, \"The Charter Commission and Its Work\", 13 The Shingle 102 (May, 1950). See also paragraph 1 of the Annotation to Sec. 9-100 of the Philadelphia Charter which refers to \"the impeachment procedure under the Act of June 25, 1919, P.L. 531, Art. IV, Sec. 9, and the experience thereunder.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e9. If no provision for removal of an officer is made in a statute creating the office, the appropriate constitutional method of removal must be followed. Watson v. Pennsylvania Turnpike Commission, 386 Pa. 117, 123, 125 A.2d 354, 356-57 (1956).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e10. Art. XII, Sec. 1 of the Constitution provided that \"All officers, whose selection is not provided for in this Constitution, shall be elected or appointed as provided by law. . . .\" This clause is now Article VI, Sec. 1 of the Constitution of Pennsylvania. 10a As our cases demonstrate, the distinction between constitutional and non-constitutional officers pre-dates the 1874 Constitution, Commonwealth v. McCombs, 56 Pa. 436 (1867), and was repeatedly recognized prior to Milford Township, supra. See, e. g., Commonwealth ex rel. Braughler v. Weir, 165 Pa. 284, 30 A. 835 (1895); Richie v. Philadelphia, 225 Pa. 511, 74 A. 430 (1909); Commonwealth ex rel. Vesneski v. Reid, 265 Pa. 328, 108 A. 829 (1919); Georges Township School Directors, 286 Pa. 129, 133 A. 233 (1926). 10b It is worthwhile to note that our cases holding that an officer whose office is created by the legislature may be removed as the legislature may provide were decided before May 17, 1966. On this date Articles VI, VII and XII of the 1874 Constitution were consolidated and renumbered in Art. VI, and minor changes were made. No further changes were made at the 1968 Constitutional Convention. If the delegates to the Convention were dissatisfied with this Court's prior construction of Art. VI, Sections 6 and 7, they easily could have rewritten those sections to require a different result. That they did not do so suggests strongly an acceptance of our interpretation of those sections. 10c See note 10 supra. 10d Mr. Justice NIX's statement that \"[t]he fallacy of the Milford Court's reasoning becomes more apparent in view of its concession that Article VI, Section 7 'is not limited to what are frequently termed constitutional officers . . .'\" [Concurring opinion of Mr. Justice NIX, ante at 253] is misleading. This was not a \"concession\" but merely a recognition of prior law which stated that when the legislature creates an office, but does not provide for a method of removal, the methods specified in the constitution control. See Georges Township, supra, at 134, 133 A. 233. For a subsequent statement of this rule, see Watson v. Pennsylvania Turnpike Commission, 386 Pa. 117, 123, 125 A.2d 354, 356-57 (1956).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e11. Mr. Chief Justice JONES's reliance on Foltz Appeal, 370 Pa. 567, 88 A.2d 871 (1952) is misplaced. The holding in that case was that there was insufficient evidence to warrant removal for cause of a township supervisor by judicial proceedings. Recall was in no way involved and the passage quoted by the majority (Opinion of the Chief Justice, ante at 246) from Mr. Justice Musmanno's opinion in Foltz is dictum. It may be that the public should not hold \"a sword of Damocles\" over the head of a public office holder in the form of possible removal from office for less than constitutional cause, but that is an argument going to the wisdom of the removal provision in question, not to its legality.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e12. As was said by Mr. Justice, later Chief Justice Bell, concurring in Lennox v. Clark, 372 Pa. 355, 93 A.2d 834 (1953); \". . . the Charter must be considered and interpreted in the light of the intention of the framers thereof and of the legislature and the voters which in this class of cases are entitled to great weight: [citing cases].\" 372 Pa. at 389, 93 A.2d at 850.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e13. By the turn of the century four states, Missouri, California, Washington and Minnesota, had provided constitutional home rule for cities. Since then at least twenty other states have adopted constitutional provisions granting varying degrees of home rule to cities. See C. Kneier, City Government in the United States 69-92 (3rd ed. 1957). Under the Pennsylvania Constitution of 1968, home rule is provided for in Article IX, Sec. 2. By that section all municipalities of the State are accorded the right and power to frame and adopt, by referendum, home rule charters. Absent enabling legislation by the General Assembly, the Constitution now provides that a home rule charter, or a procedure for framing and presenting one, may be placed before the electors of a municipality by initiative of the people or by the governing body of a municipality. The terms \"initiative\" and \"referendum\" are defined in Sec. 14 of Article IX. 14 The work of the City Charter Commission in framing the Charter during 1950-1951 is described in several contemporaneous articles in The Shingle, a publication of the Philadelphia Bar Association, especially volume 14, No. 4, for April, 1951. See, e. g., Abraham L. Freedman's appreciation of Lewis M. Stevens, Secretary of the Commission, 14 Shingle 79-80; Paul A. Wolkin, \"Government for Philadelphians by Philadelphians,\" 14 Shingle 82-85. See also C. Chute and E. Cole, \"The Charter Commission and Its Work\", 13 Shingle 102 (May, 1950); Thomas Raeburn White, \"More Power for the Voters\", 13 Shingle 180 (November, 1950). The Commission was composed of 15 members, described by Abraham Freedman in his article above cited as \"a group of extremely able men.\" The drafting committee for the Charter consisted of William A. Schnader, former Attorney-General of Pennsylvania, as chairman, Abraham L. Freedman, who became city solicitor of Philadelphia and later Judge of the United States Court of Appeals for the Third Circuit, and Robert T. McCracken, Esq. Paul A. Wolkin, Esq. was legislative draftsman. 15 As the annotations indicate, the recall provisions of the Charter were drawn from the charters of the City of Los Angeles and the City of St. Louis. The recall in this country was apparently first introduced in 1903 in the City Charter of Los Angeles. C. Kneier, City Government in the United States 398 (3rd ed. 1957). See also Ibid. at 387.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e16. \"1. The power is vested in the electorate to recall officials elected by them so that such officials may be directly responsible for their behavior in office to the electorate. The Charter vests responsibilities of great magnitude in the Mayor, the City Controller and Councilmen. The electorate is entitled to expect the proper discharge of those responsibilities and in accordance with promises made when office was sought, barring changes in circumstances which justify other courses of action. The power of the electorate to recall should serve as a spur to elected officials to be faithful to this trust. It is also intended to serve as an expeditious and effective means for removing from office an elected official who has failed to sustain such trust. Cf. the impeachment procedure under the Act of June 25, 1919, P.L. 581, Article IV, Section 9, and the experience thereunder. \"2. While no charges are required to be lodged formally against an elected official to subject him to a recall election, it is anticipated on the basis of experience in other jurisdictions having the recall, that the electorate will exercise its power to recall wisely, for good reasons and in accordance with the purposes and spirit of the recall. \"3. Elected officials subject to recall are the Mayor, the City Controller, the City Treasurer and Councilmen. \"4. Officials holding an elective office are subject to recall regardless of the manner in which they were designated to hold office.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e17. The Commission's annotation to this Section is as follows: \"1. An elected official should be afforded a reasonable period of time after election to office to establish a performance record. Thus no recall petition may be filed during the first year of office. This limitation does not apply to the first year of a term of office to which a person is reelected when the new term immediately follows the preceding one. \"2. A recall election during the last six months of a term of office is a fruitless procedure, for the incumbent, should he wish to remain in office, would within six months or less have to seek re-election in any event. \"3. The recall is not intended as a means for harassing elected officials. Thus if a recall election fails, no petition for recall may be filed until six months have expired since such an election.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e18. At the time of this decision the Constitution of Washington authorized the adoption of home rule charters by cities of the first class, but contained no recall provision.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e19. \"[I]nability or wilful failure properly to perform his duties, or the commission of a crime or misdemeanor involving moral turpitude, absence from the city for 20 days without consent, open failure or refusal to discharge his duties, the habitual use of intoxicating liquors to excess, or any permanent disability preventing the proper discharge of his duties.\" 105 P. at 473.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e20. The motivation for recall in the Philadelphia City Charter was described in analogous terms by one closely involved in the drafting of the charter: \"In 1691 the framers of the Charter were gravely concerned that those chosen for office might decline to serve because there were certain personal expenditures involved in being a City official. Any one who refused to take an office was subject to heavy fines and penalties. Today's Philadelphians do not fear that one chosen to be Mayor or a Councilman will turn the office down. They are concerned that once he is in office he will be difficult to turn out should he prove to be incompetent or unworthy of the office he holds. The new Charter answers this problem through the recall.\" P. Wolkin, \"Government for Philadelphians by Philadelphians\", 14 the Shingle at 85 (April 1951).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e21. The majority, holding the recall provision invalid under the Pennsylvania Constitution, does not deal with appellant's federal claim.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e22. Appellant Rizzo makes an analogous argument with respect to § 18 of the Home Rule Enabling Act. Act of April 21, 1949, P.L. 665, § 18, 53 P.S. § 13133. Section 18 of the Act declares that \"Notwithstanding the grant of powers contained in this act, no city shall exercise powers contrary to, or in limitation or enlargement of, powers granted by acts of the General Assembly which are . . .' (b) Applicable in every part of the Commonwealth. (c) Applicable to all the cities of the Commonwealth.\" The appellant argues (1) that the Election Code is such a statute within the meaning of § 18; (2) recall is legislation affecting the exercise of political rights with respect to elective officers; therefore, (3) recall is invalid.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e23. The argument that recall conflicts with § 18 of the Home Rule Enabling Act, see note 22 supra, fails for these same reasons. See also Addison Case, 385 Pa. 48, 55, 122 A.2d 272, 275 (1956). 23a The opinion of the Chief Justice is the only one of the opinions of the majority which deals at length with the rulings of the trial court relative to whether or not a writ of mandamus should have issued to compel the filing of the recall petition. Thus, this part of this dissenting opinion is necessarily directed primarily to the opinion of the Chief Justice.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e24. Mr. Chief Justice JONES holds that the trial court was correct in ruling that the Board \"acted erroneously under the law\" in invalidating the signatures which it placed in the other contested categories, and concludes that these signatures \"should have been counted as valid . . . .\" [Opinion of the Chief Justice, ante at 243.] I quite agree with him in this respect, although I find it completely at variance with the holding of error as to the two categories mentioned in the text. The following is a summation of the number of signatures in the several categories of claimed defects which are held valid as a result of the opinion announcing the decision of the Court, and with which this dissenting opinion is not concerned: Initials 21,208Abbreviations 2,967Insufficient signatures 3,460Incorrect Ward 11,285Forgeries/Alterations 6,429 45,449(These figures are taken from the Board's \"refined totals\". See Opinion of Savitt, J. at 126a-57).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e25. Of these 57,494 signatures, 35,335 were also placed by the Board in other categories of deficiencies, and were rejected by the Board for those other reasons as well. Thus, only 22,159 signatures were ultimately placed in the category of \"irregular affidavits\". Not all of these 22,159 signatures, however, were rejected for the same kinds of asserted irregularity. The original category of \"irregular affidavits\", which contained 905 affidavits affecting 57,494 signatures was comprised of three sub-categories: (1) \"patent falsities\", which included 781 affidavits attached to sheets containing 52,468 signatures; (2) \"false address\", which included 66 affidavits attached to sheets containing 3,216 signatures; and (3) \"not registered\", which included 58 affidavits attached to sheets containing 1,810 signatures. The affidavits placed in the \"patent falsities\" sub-category were deemed to be false because they were attached to sheets of signatures which were found to contain large numbers of \"grossly irregular\" signatures. These irregularities included, inter alia, non-registered signers, duplicative signings, and defective addresses, as well as signatures rejected under other categories set up by the Board, such as \"initials\", \"abbreviations\", \"insufficient signatures\", \"incorrect ward\", and \"forgeries and alterations\". (Record at 1287a-88a). The affidavits placed in the sub-category \"false address\" were deemed to be false because the stated addresses of the affiants were incorrect. The affidavits placed in the \"not registered\" sub-category were deemed to be false because, contrary to the recitals in the affidavits, the affiants were not registered voters. It was stipulated between the parties that of the 22,159 signatures ultimately placed in the category of \"irregular affidavits\", 20,304 were rejected under sub-category (1) -- \"patent falsities.\" (Record at 1289a). Since, as set forth in the text, I believe the trial court was correct in its validation of these 20,304 signatures, and this number suffices, when added to the number of signatures validated by the trial court in other categories, to reach the required 25% of votes cast for mayor at the last election, I find it unnecessary to consider whether or not the trial court was correct in reversing the Board as to the 1,855 signatures which the Board had rejected under sub-categories (2) and (3) above.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e26. See note 25 supra.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e27. At trial the mayor offered to call various of the circulators primarily to impugn their affidavits by a showing of irregularities. The offer asserted a failure of some affiant-circulators to appear in person before the notaries, and insufficient knowledge on the part of circulators as to the signers' residences and status as registered electors to enable the circulators to make the affidavits. The offers did not go to fraud or forgery, or directly attack the genuineness of signatures, but the conclusion was sought to be drawn that the affidavits which would be proved to be defective as indicated were therefore false and that the signatures to which they pertained should be disregarded. Cf. In re Nomination of Cianfrani, 467 Pa. 491, 359 A.2d 383 (1975). Whether or not new evidence was appropriate in this mandamus action where the court was sitting in review of the action of an administrative body, was a matter of discretion with the court. See generally, L. Jaffe, Judicial Control of Administrative Action 176 et seq., esp. 185-87 (abridged Student Ed., 1965). In this case, where the Board had made an extensive and complete investigation, where time was of the essence, and where the offers, even if proved, would not have shown that signatures were not genuine but only that some affidavits were irregular, it cannot be said that the court abused its discretion in refusing the offers.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e28. The Board found that the lawyer for the Citizens Committee notarized 47 petitions involving 1,532 signatures and that the 15 circulators notarized 2,827 petitions involving 114,286 signatures.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e29. Act of August 21, 1953, P.L. 1323, § 19(e), 57 P.S. § 165(e) (1964). This subsection provides as follows: \"(e) No notary public may act as such in any transaction in which he is a party directly or pecuniarily interested.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e30. The opinion announcing the decision of the Court cites State ex rel. Reed v. Malrick, 165 Ohio St. 483, 137 N.E.2d 560 (1956) and Schirmer v. Myrick, 111 Vt. 255, 20 A.2d 125 (1940) to support its holding that the 16 circulators in this case had a direct interest in the affidavits notarized by them. In both cases cited, however, a candidate for office notarized his own nomination petitions. In such a situation there is a significant danger of fraud since a candidate stands to benefit personally by his own acts and therefore can be said to be directly and pecuniarily interested in the instrument notarized. In contrast, the circulators in this case had nothing to gain personally by having the recall question placed on the ballot.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e31. It is not contended that the 16 notaries public in question lacked the power to administer oaths in general. It is argued only that they exercised the power wrongfully in this case.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e32. Act of August 21, 1953, P.L. 1323, § 19(a), 57 P.S. § 165(a) (1964). 1b The Chief Justice, Mr. Justice O'Brien, Mr. Justice Nix and Mr. Justice Manderino voted to reverse, while Mr. Justice Eagen voted to remand. Mr. Justice Pomeroy and this writer dissented, and noted that the trial court's order placing the recall vote on the ballot should be affirmed. 1c The four Justices who voted to strike the recall vote from the ballot issue three opinions in support of their September 30 order. The Chief Justice and Mr. Justice O'Brien file separate opinions, and Mr. Justice Nix files an opinion in which he is joined by Mr. Justice Manderino. Thus, there is no opinion of the Court. The four Justices who voted to reverse still maintain that the recall vote cannot be held, and that recall is somehow unconstitutional, but cannot find a common ground to justify their September 30 order. 2b C. Adrian, State and Local Government 138 (4th ed. 1976) [hereinafter cited as Adrian]; F. Bird \u0026 F. Ryan, The Recall of Public Officers 304 (1930) [hereinafter cited as Bird \u0026 Ryan]; Black's Law Dictionary 1433 (4th rev. ed. 1968); E. Phelps (ed.), The Recall 1 (1913) [hereinafter cited as Phelps]. 3b Bird \u0026 Ryan, at 4. Recall was not totally unknown in this country before 1903. The Articles of Confederation contained a recall provision. \"For the more convenient management of the general interests of the United States, delegates shall be annually appointed in such manner as the legislature of each state shall direct . . . with a power reserved to each state to recall its delegates, or any of them, at any time within the year, and to send others in their stead for the remainder of the year.\" Articles of Confederation, art. V, quoted in id. 3 n. 2. One writer has noted that recall was effectively employed at a critical juncture in the history of this country. The Pennsylvania delegates to the Continental Congress were recalled because they refused to sign the Declaration of Independence and were replaced by delegates willing \"to carry out the imperative mandate of the people.\" Schaffner, Recall, in Phelps, supra at 37. 4b Bird \u0026 Ryan, supra at 4. 5b Adrian, supra at 139. 6b Source: Pennsylvania Department of Community Affairs. 7b E. g., Pa.Const. art. I, § 2; The Federalist No. 39 (J. Madison). 8b Cabinet Opinion, April 28, 1793, quoted in E. Dumbauld, The Political Writings of Thomas Jefferson 79 (1955). 9b C. Beard \u0026 B. Shultz (eds.), Documents On the State-Wide Initiative, Referendum and Recall 52 (1970); D. Wilcox, Government By All the People 170-71 (1912) [hereinafter cited as Wilcox]. In the absence of recall provisions, the people can elect their representatives only at stated intervals. One commentator has stated: \"According to this theory . . . governors and mayors are temporary princes of [their] jurisdictions. . . . Under this theory, the people are regarded as incapable of self-government, as not qualified to express or have an opinion on specific governmental policies, but only to pass upon the efficiency of their government in a general way. . . . The Recall does not accept this theory of representative government. It holds that a representative is a servant, an agent, not a master.\" Wilcox, supra at 170-71; see Bird \u0026 Ryan, supra at 4. 10b Proponents of recall assert that several benefits flow from its availability: it provides a check upon unresponsive public officials; it permits the people to correct their mistakes when incompetent officials are elected; it permits the concentration of responsibility in individual officers and the establishment of longer terms of office without sacrificing accountability to the public. See generally Adrian, supra at 139; Bird \u0026 Ryan, supra at 8-11; Wilcox, supra at 169-83. 11b Gilbertson, The Recall -- Its Provisions and Significance, in The Initiative, Referendum and Recall 218 (C. King ed. 1912) [hereinafter cited as Gilbertson]. 12b See Bird \u0026 Ryan, supra at 4-5; Gilbertson, supra at 219. 13b See 351 Pa.Code § 9.9-100, Annot. 1 (1974); Report to the Voters by the Philadelphia Charter Commission 6-7 (February 14, 1951) [hereinafter cited as Report to the Voters]. 14b The three members of the committee were among the most experienced and respected members of the legal profession. Robert T. McCracken was a former President of the Pennsylvania Bar Association and a former Chancellor of the Philadelphia Bar Association. William A. Schnader was a former Attorney General, a former President of the National Conference of Commissioners on Uniform State Laws and was then First Vice-President of the American Law Institute. Abraham L. Freedman was a member of the Philadelphia, Pennsylvania, and American Bar Associations, the faculty of Temple University Law School and later served as a Judge on United States Court of Appeals for the Third Circuit. This outstanding committee was aided by Paul A. Wolkin, who served as Legislative Draftsman. For many years he has been Assistant Director of the American Law Institute. 15b 351 Pa.Code § 9.9-100, Annot. 2 (1974). 16b Report to the Voters, supra at 13. 17b The removal provisions of Article VI, section 7, cl. 3 of the Pennsylvania Constitution, which require a two-thirds vote of the Senate after a full hearing, are unlikely to be used except in the most flagrant cases. These procedures would require the Senate to devote considerable time to matters which may be of purely local concern and their use could breed resentment against state intervention into purely local affairs. See E. Schultz, American City Government 280 (1949). Despite this, three Justices of this Court would hold that these removal provisions are exclusive. Their interpretation would force the citizens of a municipality to rely on state intervention for the removal of local officials and would leave local governments and their citizens powerless to remove their own elected officials. 18b Joseph A. Migatz, voter registration supervisor, testified as to how the Board determined which sheets were \"patently false\": \"A. I checked all the worksheets and where there were glaring defects I pulled them . . . . Q. What rules of thumb did you use? How did you go about doing this? A. Get the amount of signatures on the petition and how many defects were on the petition, and if there was a great percentage of defects, I would -- Q. Was there any particular number of defects? A. Usually from 25 percent up. Q. How did you determine whether there were defects on the petition, that is, what information did you use to make that determination? A. I went right down the sheet, whatever it was, addresses outside of Philadelphia, bad address, can't distinguish address, double signatures, the whole categories, all the categories.\" In one instance, a sheet containing 94 signatures was thrown out, even though 74 of the signatures were perfect. Another sheet, containing 102 signatures, was invalidated because three were by persons not registered, two had signed other petitions, 25 either omitted or included an initial not on the registration card, and seven suffered from similar defects. 19b The Chief Justice's effort to support the conclusion that the affidavits were false, by drawing a negative inference from the circulators' failure to explain the invalid or imperfect signatures on the petition, is totally unpersuasive. The petitioners, asserting first amendment claims, failed to appear before the Board. As the cases on which the Opinion of the Chief Justice relies hold, however, and as the Opinion itself states, the negative inference arises \"when a party having control over evidence fails to produce it.\" (emphasis added). But the Chief Justice determines there were no parties before the Board. For the Opinion of the Chief Justice to characterize the circulators' failure to appear as a failure to explain the discrepancies is also misleading. The circulators were told only to appear before the Board; they were not told they would have the opportunity to demonstrate that their affidavits were valid. Furthermore, as the trial court held: \"The Board sought neither enforcement of the subpoenas nor a further extension of time for this purpose. Therefore it must be assumed that it was the Board's decision to voluntarily halt the inquiry. In these circumstances, the Board may not draw unfavorable inferences from the failure of the circulators to appear.\" Opinion of Savitt, J., C.P. No. 3466, at 46 (filed September 16, 1976). In short, the circumstances giving rise to the negative inference, have not been established. Moreover, an inference in effect creates a presumption of the invalidity of the affidavits. If there is to be any presumption, it should be that affidavits are valid, in the absence of a showing of fraud, so that the voters who signed the petition are not disenfranchised. See In re Bower, 41 Ill.2d 277, 242 N.E.2d 252 (1968). 20b The reason for the \"incorrect address\" is unclear. While a few affiants gave incorrect addresses, others may simply have moved since their last registration. 21 The Opinion of the Chief Justice also suggests that the trial court should have accepted offers of proof made by the Mayor that the affidavits were irregular. As the authorities cited by the Chief Justice hold, the general rule is that when a mandamus action follows a formal administrative hearing, review is limited to the administrative record. It does not follow, however, that a court hearing a mandamus action is required to accept additional evidence in situations where no formal administrative hearing has been conducted. When informal administrative actions are reviewed, the trial court has discretion to admit or reject additional evidence. \"Typically . . . mandamus is used where the administrator has acted or is entitled to act without a formal required hearing. . . . There may have been an elaborate investigation, medical examinations, examination of objects, and opportunities to meet administrative objections. There may be what one might call a 'quasi' record, but in none of these cases is there a record in the strict sense. The court in the exercise of its discretion may . . . permit simply the introduction of additional evidence on one or another issue; it may refuse to receive additional evidence . . . . Whether to take new evidence will depend on the fairness and completeness of the administrative hearing or investigation.\" L. Jaffe, Judicial Control of Administrative Action 186-87 (1965). The court below limited its review to the \"record\" before the Board and declined to accept the evidence offered by the Mayor. On appeal, our role is limited to determining if the trial court's decision was an abuse of discretion. Cases involving nomination petitions, see e. g., Socialist Labor Case, 332 Pa. 78, 1 A.2d 831 (1938), are not applicable to this proceeding. The Pennsylvania Election Code specifically provides for de novo review of the Board's actions on nomination petitions. Act of June 3, 1937, P.L. 1333, art. IX, § 976, as amended, 25 P.S. § 2936 (Supp.1976). No such requirement is made for recall petitions, nor would one be appropriate. A nomination petition for a municipal office requires only 100 signatures, Act of June 3, 1937, P.L. 1333, art. IX, § 912(d), as amended, 25 P.S. 2872(a) (1953), whereas over 145,000 signatures were required for this recall petition. De novo review of such a large number of signatures could tie up a recall petition for an extended period, and would conflict with the timetable set out in the Charter. Section 9-101 of the Charter gives the Board only 15 days to review the petition and, if the incumbent does not resign within ten days afterwards, Section 9-103 requires a vote within 90 days. 351 Pa.Code §§ 9.9-101-9.9-103 (1974). Thus, as the Chief Justice states elsewhere in his Opinion, the usual standard of review on mandamus applies. Since the court is not expected to make a de novo review, it is not required to admit any additional evidence a party might offer. The offers of proof related to matters into which the Board had already investigated. Especially given the efforts in the Charter to expedite procedures \"so that the affairs of the City will not suffer from a longer postponement of the time for resolving the issue,\" 351 Pa.Code § 9.9-103, Annot. 2 (1974), the trial court did not abuse its discretion in refusing to admit this time consuming evidence. As a court reviewing a challenge to a recall petition under the Los Angeles Home Rule Charter observed: \"The courts are ever mindful of the desirability of having recall petitions presented to the people . . . without delay or excessive expenditure of time.\" Reites v. Wilkerson, 99 Cal.App.2d 500, 502, 222 P.2d 81, 83 (2d Dist. 1950) (citation omitted). 22 Representation of a party does not disqualify an attorney from notarizing documents for his client, except when the documents are filed in a lawsuit where he is attorney-of-record. American Bleacher Corp. v. Fried \u0026 Gerbert, Inc., 35 Pa.D. \u0026 C.2d 729 (C.P.Bucks 1965). Nor is an employee of an attorney disqualified. Educators Mutual Ins. Co. v. Serosky, 73 D. \u0026 C. 337 (C.P.Luzerne 1950). Even a partner of an attorney-of-record, who stands to share in any fees earned, is not disqualified. Geisweit v. Marden, 1 D. \u0026 C.2d 697 (C.P.Lycoming 1954). Commonwealth v. Pyle, 18 Pa. 519 (1852) is in no way inconsistent with these cases. Pyle was disqualified not because of his interest in any particular document he notarized, but because of a statute specifically prohibiting bank stockholders from holding the office of notary public. 23 The cases cited in the Opinion of the Chief Justice State ex rel. Reed v. Malrick, 165 Ohio St. 483, 137 N.E.2d 560 (1956); Schirmer v. Myrick, 111 Vt. 255, 20 A.2d 125 (1941), both involve candidates who notarized their own petitions for nomination. A candidate, as opposed to a mere petition circulator, has a direct and pecuniary interest in his nomination and election. Also, courts enforce laws relating to petition procedures much more strictly when there is a suggestion that a candidate may be benefiting by his own wrongdoing. Compare Nomination of Cianfrani, 467 Pa. 491, 359 A.2d 383 (1976), with Petition of Smith, 114 N.J.Super. 421, 276 A.2d 868 (1971). 23a The Concurring Opinion of Mr. Justice Nix accepts the conclusion of the Opinion of the Chief Justice that the recall petition is invalid because it was illegally notarized. Having reached this conclusion, it was inappropriate for either the Chief Justice or Mr. Justice Nix to proceed to address the issue of the constitutionality of recall. The Concurring Opinion of Mr. Justice O'Brien does not state whether the recall petition is sufficient. It may be that Mr. Justice O'Brien has decided that the petition is sufficient, in which case he must address the constitutional issue. Because his Concurring Opinion expresses no view on the validity of the petition, however, it is not clear whether Mr. Justice O'Brien has addressed the constitutional issues only after rejecting the other objections to placing the recall vote on the ballot. 24 Binder v. Triangle Publications, Inc., 442 Pa. 319, 275 A.2d 53 (1971); Commonwealth v. Haugh, 439 Pa. 212, 266 A.2d 657 (1970); Shuman v. Bernie's Drug Concessions, 409 Pa. 539, 187 A.2d 660 (1963); Robinson Township School District v. Houghton, 387 Pa. 236, 128 A.2d 58 (1956); Altieri v. Allentown Officers \u0026 Retirement Board, 368 Pa. 176, 81 A.2d 884 (1951). 25 Here, where the recall provisions have been submitted to the voters of Philadelphia and received their approval, the presumption in favor of the constitutionality of recall is strengthened. Tosto v. Pennsylvania Nursing Home Loan Agency, 460 Pa. 1, 16, 331 A.2d 198, 205 (1975). \"Courts may not declare a statute unconstitutional 'unless it clearly, palpably, and plainly violates the Constitution.' Daly v. Hemphill, 411 Pa. 263, 271, 191 A.2d 835, 840 (1963). This presumption in favor of the constitutionality of a statute is strengthened where, as here, the program has been submitted to the voters and has received their approval. We would be overstepping our constitutional bounds were we to strike down an act bolstered by such a strong presumption of constitutionality on the basis of a constitutional provision designed to eliminate an evil far removed from the public goals of this enlightened legislation.\" 25a The opinions striking down recall undermine their stated rationale for reaching the issue. They claim to address the constitutionality of recall in order to clear up the uncertainty in the area, but they only add to the confusion which they have created. The opinions striking down recall cannot agree on why recall is unconstitutional, and the two Concurring Opinions needlessly cast a cloud on the constitutionality of all local procedures for removing elected officials. 25b The Pennsylvania Constitution contains several different removal mechanisms for public officials. Article VI, section 6 provides that all civil officers are subject to impeachment for misbehavior in office: \"The Governor and all other civil officers shall be liable to impeachment for any misbehavior in office, but judgment in such cases shall not extend further than to removal from office and disqualification to hold any office of trust or profit under this Commonwealth. The person accused, whether convicted or acquitted, shall nevertheless be liable to indictment, trial judgment and punishment according to law.\" Article VI, section 7, quoted in the text, provides for three distinct removal procedures. First, all civil officers shall be removed from office if convicted by a court of either misbehavior in office or any infamous crime. Second, appointed civil officers may be removed at the pleasure of the appointing power. Finally, elected civil officers may be removed by the Governor for reasonable cause, after due notice and full hearing, on the address of two-thirds of the Senate. The Opinion of the Chief Justice inextricably focuses on this last procedure and gives it comprehensive and independent significance beyond its place in the constitutional scheme. Recognizing the untenability of this position, the other Justices voting to reverse claim that their decision follows from the existence of the various removal mechanisms in the Constitution. But their conclusion that these procedures are exclusive, so that local governments and their citizens are powerless to remove their own elected officials, is equally unpersuasive. Both views ignore the overall constitutional scheme, especially the relationship between state and local government. See Pennsylvania Constitution, article IX. Moreover, the Constitution itself recognizes the distinction between constitutional and non-constitutional officers. Pennsylvania Constitution, article VI, section 1. 26 See Conn v. City Council, 17 Cal.App. 705, 121 P. 714 (1st Dist. 1911) (recall upheld against contention that it violated state constitutional provisions regarding tenure of office, removal and impeachment); Good v. Common Council, 5 Cal.App. 265, 90 P. 44 (2nd Dist. 1907) (tenure of office); Campbell v. Johnson, 182 So.2d 244 (Fla.1966) (broad based constitutional attack); DuBose v. Kelly, 132 Fla. 548, 181 So. 11 (1938) (due process); Eckerson v. City of Des Moines, 137 Iowa 452, 115 N.W. 177 (1908) (tenure of office, impeachment); Pinder v. Board of Supervisors, 146 So. 715 (La.App.1933) (removal); Graham v. Roberts, 200 Mass. 152, 85 N.E. 1009 (1908) (tenure of office); State ex rel. Topping v. Houston, 94 Neb. 445, 143 N.W. 796 (1913) (removal, due process); Leers v. Diehl, 11 N.J.Misc. 525, 167 A. 216 (1933) (broad based constitutional attack); State ex rel. Hackley v. Edmonds, 150 Ohio St. 203, 80 N.E.2d 769 (1948) (removal); Dunham v. Ardery, 43 Okl. 619, 143 P. 331 (1914) (removal); State ex rel. Timothy v. Howse, 134 Tenn. 67, 183 S.W. 510 (1916) (removal); Roberts v. Brown, 43 Tenn.App. 567, 310 S.W.2d 197 (1957) (tenure of office, due process); Bonner v. Belsterling, 104 Tex. 432, 138 S.W. 571 (1911) (removal, tenure of office, due process); Hilzinger v. Gillman, 56 Wash. 228, 105 P. 471 (1909) (tenure of office, removal); but see Williams v. Schwarz, 197 Ala. 40, 72 So. 330 (1930). 26a The phrase \"on the condition that they behave themselves well while in office\" modifies that section of Article VI, section 7 which provides for removal on conviction of misbehavior in office or any infamous crime. It does not refer to the separate procedure which provides for removal by the Governor for reasonable cause. 27 Article IX, section 2 provides: \"Municipalities shall have the right and power to frame and adopt home rule charters. . . . A municipality which has a home rule charter may exercise any power or perform any function not denied by this Constitution, by its home rule charter or by the General Assembly at any time.\" 28 Watson v. Pennsylvania Turnpike Commission, 386 Pa. 117, 125 A.2d 354 (1956); Marshall Impeachment Case, 360 Pa. 304, 62 A.2d 30 (1948); Commonwealth ex rel. v. Davis, 299 Pa. 276, 149 A. 176 (1930); Milford Township Supervisors' Removal, 291 Pa. 46, 139 A. 623 (1927). See also Commonwealth ex rel. Vesneski v. Reid, 265 Pa. 328, 108 A. 829 (1919); Richie v. Philadelphia, 225 Pa. 511, 74 A. 430 (1909). 29 Marshall Impeachment Case, 360 Pa. at 309, 62 A.2d at 32; Bowman's Case, 225 Pa. 364, 74 A. 203 (1909). Current Problems in Pennsylvania Law, 99 U.Pa.L.Rev. 829, 829-30 (1951). 30 In Milford Township Supervisors' Removal, supra, this Court rejected the argument that the Constitution provides the exclusive procedure for the removal of non-constitutional officers. The Court held that the Constitutional provisions were \"not applicable\" to non-constitutional officers where the Legislature had provided an alternate method of removal. In Commonwealth ex rel. v. Davis, 299 Pa. at 279, 149 A. at 177-78, this Court rejected the contention that the \"sweeping language . . . 'all officers elected by the people . . . shall be removed by the Governor,' . . . means that 'officers elected by the people' shall not be removed in any other way.\" Subsequently, in Watson v. Pennsylvania Turnpike Commission, supra, this Court stated: \"It is therefore established in this State beyond respectable controversy that, where the legislature creates a public office, it may impose such terms and limitations with reference to the tenure or removal of an incumbent as it sees fit. There is nothing in the Constitution prohibiting such action while, on the other hand, Article XII, Section 1 [now Article VI, section 1] expressly admits of it.\" 386 Pa. at 123, 125 A.2d at 356 (emphasis added). 31 Milford, 291 Pa. at 52, 139 A. at 625. In Commonwealth ex rel. Vesneski v. Reid, supra, the Court held that absent legislatively authorized removal procedures, a municipality must rely on the removal provisions in the Constitution for the removal of non-constitutional officers. 32 Act of April 21, 1949, P.L. 665, §§ 1 et seq., 53 P.S. §§ 13101 et seq. (1949).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e33. Id. § 13131.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e34. At one time, there was some confusion as to whether Article VI, section 7 limited the power of the Legislature to enact alternatives for the removal of non-constitutional officials. A lower court opinion, affirmed per curiam by this Court, included in dictum a statement that the removal provisions of the Pennsylvania Constitution were exclusive, without making a distinction between constitutional and non-constitutional officers. Commonwealth ex rel. Lowell v. Hoyt, 254 Pa. 45, 98 A. 782 (1916). However, this Court in Milford, supra, clarified the matter and reaffirmed the distinction between those offices created by the Constitution and those which the Legislature can create and abolish. Since then, this Court has \"made every effort to sustain statutory removal plans in their application to other than 'constitutional' officers.\" Current Problems in Pennsylvania Law, 99 U.Pa.L.Rev. 829, 837 (1951).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e35. The Opinion of the Chief Justice would have it appear that the issue before this Court is well settled. Even the Mayor concedes that the issue whether cause is constitutionally required for the removal of non-constitutional elected officials is novel.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e36. Gordon makes clear that in the context of recall the electoral process is the essence of due process.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e37. Article VI, section 7 provides: \"Appointed civil officers . . . may be removed at the pleasure of the power by which they shall have been appointed.\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e38. See note 26.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e39. In Gordon v. Leatherman, supra, the court upheld recall provisions similar to those of the Philadelphia Charter against the contention that recall violated the due process clause of the fourteenth amendment of the United States Constitution because the recall provisions did not require cause. Noting that the Charter provided for a political system in which the elected officials serve at the will of the people, the court held \"there is nothing inherently unconstitutional in such a system, and no court has held otherwise.\" Id. at 566. The decision whether to require cause before an official can be removed by the electorate is a political decision. The people may recall an elected official without any statement of reasons.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e40. State ex rel. Topping v. Houston, supra; Conn v. City Council, supra. See also Initiative, Referendum, and Recall, 106 A.L.R. 555 (1937). \"Recall statutes do not contemplate a judicial inquiry into the truth of the specific charges of misconduct but are designed to afford relief from popular dissatisfaction with official misconduct of an officer.\" 63 Am.Jur.2d, Public Officers and Employees, § 238 (1972).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e41. Mr. Justice Nix argues that because the terms of Article VI, section 7, cl. 3 are mandatory, they are exclusive. He implies that when a provision is mandatory, it necessarily is exclusive. Even if the removal provisions of Article VI, section 7, cl. 3 are mandatory, and the Governor and the Senate could be compelled to exercise their removal powers, there is no basis for concluding that they are exclusive. Just because an officer must be removed under certain circumstances does not mean that he cannot be removed under other circumstances. The fallacy that the removal provisions of Article VI, section 7 are exclusive because some of them are mandatory, has long been rejected by this Court. Mr. Justice Nix states that the provisions of Article VI, section 7, cl. 1 are mandatory. But in Commonwealth v. McCombs, 56 Pa. 436 (1867) this Court held that the provisions of this clause (then Article VI, section 9 of the Constitution of 1838) simply created a condition of tenure for non-constitutional officers, and did not prevent the Legislature from enacting other conditions for holding office. This Court stated that any attempt to read this removal provision as exclusive \"is a great perversion of its meaning. It was never intended to put offices created by the legislature beyond the control and regulation of the creating power.\" Id. at 441.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e42. Mr. Justice O'Brien relies on Commonwealth ex rel. Smillie v. McElwee, 327 Pa. 148, 193 A. 628 (1937), to conclude that the provisions for the removal of civil officers enumerated in Article VI must be read to exclude all others. However, Smillie is not based on a textual analysis, such as Mr. Justice O'Brien's, but on an analysis of the broader constitutional scheme. This case involved an effort by the Legislature to replace members of the county tax boards, appointed by the county commissioners, with appointees of the Auditor General of the Commonwealth. This Court concluded that the statute: \". . . violates the principle of 'home rule,' i. e., local self-government, which, like the triparte separation of governmental powers, is a vital part of both the foundations and the general framework of our State and Federal governments.\" Id. at 152, 193 A. at 630. Only after considering the effect of the statute on local government, and concluding that the legislation was \"dissonant with American constitutional concepts,\" Id. at 158, 193 A. at 632, did the Court read Article VI, section 7 (then Article VI, section 4) to invalidate the statute. Far from being based on a rule of construction for interpreting the language of the Constitution on its face, Smillie is based on the relationship between state and local government under the Constitution. It cannot be read to support Mr. Justice O'Brien's interpretation of the Constitution, which would restrict the control of localities over their own officials. Moreover, Smillie involved an interpretation of what is now Article VI, section 7, cl. 2, which only applies to the power to remove appointed officials. The statement that the clause was exclusive only means that appointed officials cannot be removed except by the appointing power: \"As the Legislature did not appoint the incumbents, it cannot remove them.\" Id. at 159, 193 A. at 633. Thus, the decision has no application to an effort by the citizens to remove from office an official they have elected.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e43. 327 Pa. at 158, 193 A. at 633, quoting State ex rel. White v. Barker, 116 Iowa 96, 104, 89 N.W. 204, 207 (1902). This guideline of constitutional construction is followed by the United States Supreme Court: \"[The meaning of constitutional provisions] is to be arrived at, not only by a consideration of the words themselves, but by considering, as well, the context, the purposes of the law, and the circumstances under which the words were employed.\" District of Columbia v. Carter, 409 U.S. 418, 420, 93 S.Ct. 602, 604, 34 L.Ed.2d 613 (1973), quoting Puerto Rico v. The Shell Co., Ltd., 302 U.S. 253, 258, 58 S.Ct. 167, 169, 92 L.Ed. 235 (1937). In another context, the United States Supreme Court has noted that \"constitutional analysis is not a 'legalistic minuet in which precise rules and forms must govern.' Instead we must 'examine the form of the relationship for the light it casts on the substance.'\" Committee for Public Education v. Nyquist, 413 U.S. 756, 789-90, 93 S.Ct. 2955, 2974, 37 L.Ed.2d 948 (1973), quoting Lemon v. Kurtzman, 403 U.S. 602, 614, 91 S.Ct. 2105, 2112, 29 L.Ed.2d 745 (1971).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e44. Article VI, section 1 provides: \"All officers, whose selection is not provided for in this Constitution, shall be elected or appointed as may be directed by law.\" For those offices whose selection is not provided for in the Constitution, the Legislature may determine the conditions of tenure, including procedures for removal. Thus, it is the Constitution itself which distinguishes between constitutional officers, those named in the Constitution, and non-constitutional officers, those within the coverage of Article VI, section 1. Since there is nothing in the language of the Constitution which supports the Concurring Opinions' interpretation that the removal provisions are exclusive, there is no basis for their conclusion that Article VI, section 1 is inapplicable because it is inconsistent with the more specific removal provisions of Article VI, section 7. When these provisions are read together, they clearly indicate a constitutional scheme in which the Legislature is limited in its regulation of constitutional officers, but may attach conditions to the tenure of non-constitutional officers. The Concurring Opinions fail to comprehend the significance of Article VI, section 1 and in effect read it out of the Constitution. Mr. Justice O'Brien asserts that even if the Legislature has the power to determine conditions of tenure, it does not have the power to provide for the removal of non-constitutional officers. This is both illogical and contrary to our case law. If an officer holds office subject to certain conditions, this means that he shall lose his office if he violates the conditions. In other words, when the conditions are violated, he shall be removed. Mr. Justice O'Brien, by distinguishing the power to establish conditions from the power to remove, renders the power to establish the conditions of tenure illusory. Our cases have recognized that the power to create non-constitutional offices necessarily implies the power to abolish, and the lesser power of regulation and removal. See, e. g., Marshall Impeachment Case, supra; Milford Township Supervisors' Removal, supra; Commonwealth v. McComb, supra. Mr. Justice O'Brien also states that the Legislature's power to abolish non-constitutional offices does not establish the power to remove non-constitutional officers. While there may be some merit to this distinction when the Legislature enacts a new removal provision after an incumbent takes office, it has no application where, as here, the removal provisions are enacted when the office is created. If the removal provisions are in effect when the incumbent is elected, they are a condition of his tenure. He takes office subject to the removal provisions. See Suermann v. Hadley, 327 Pa. 190, 200, 193 A. 645, 651 (1937).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e45. Article VI, section 1. Mr. Justice Nix reasons that the cases establishing the distinction between constitutional and non-constitutional officers are in fact based on the difference between appointed and elected officials. But these cases rely on Article VI, section 1 which makes no distinction between appointed and elected officials. It authorizes the Legislature to provide for both \"elected or appointed\" offices. The case law interpreting Article VI, section 1 has recognized that it does not make a distinction between appointed and elected officials and has applied the provision to both appointed and elected officials. In fact, the distinction between constitutional and non-constitutional officers was first announced in a case involving an elected official. Commonwealth v. McCombs, supra. Since then, this Court has repeatedly reaffirmed the doctrine in cases involving elected officials. See Marshall Impeachment Case, 360 Pa. 304, 62 A.2d 30 (1948); Commonwealth ex rel. v. Davis, 299 Pa. 276, 149 A. 176 (1930); Milford Township Supervisors' Removal, 291 Pa. 46, 139 A. 623 (1927); Commonwealth ex rel. Vesneski v. Reid, 265 Pa. 328, 108 A. 829 (1919); Commonwealth v. Moir, 199 Pa. 534, 49 A. 351 (1901); Commonwealth ex rel. Braughler v. Weir, 165 Pa. 284, 30 A. 835 (1895). Moreover, nothing in the cases which have treated constitutional and non-constitutional officers differently in any way supports Mr. Justice Nix's interpretation; their rationale is equally applicable to elected or appointed non-constitutional officers. Compare Milford, supra, with Weiss v. Ziegler, 327 Pa. 100, 193 A. 642 (1937).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e46. Commonwealth v. McCombs, 56 Pa. 436 (1867).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e47. In Lloyd v. Smith, 176 Pa. 213, 221, 35 A. 199, 201 (1896), this Court noted that \"An office . . . not constitutional, exists by the will of the legislature only, and may be abolished at any time . . . .\"\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e48. \"As it is, the people are entitled to the services of the officer during the entire term for which they elected him . . . unless he be removed in the way prescribed by the Constitution, if the officer is a constitutional officer . . . or by the Legislature or under its authority in the manner provided by the Constitution or statute, if the officer is not a constitutional officer . . . .\" 265 Pa. at 333-34, 108 A. at 831. \". . . [M]unicipalities of the State must be satisfied with the methods and causes of a motion therein provided, until and unless the legislature, in its wisdom, shall add thereto.\" Id. at 335, 108 A. at 832.\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e49. Bowers v. Pennsylvania Labor Relations Board, 402 Pa. 542, 167 A.2d 480 (1961); Watson v. Pennsylvania Turnpike Commission, 386 Pa. 117, 125 A.2d 354 (1956); Commonwealth ex rel. Bunch v. Beattie, 364 Pa. 572, 73 A.2d 664 (1950); Marshall Impeachment Case, 360 Pa. 304, 62 A.2d 30 (1948); Commonwealth ex rel. v. Davis, 299 Pa. 276, 149 A. 176 (1930).\u003c/span\u003e\n\n\u003cspan class=\"fn\"\u003e50. Our case law distinguishing between constitutional and non-constitutional officers is also significant in that it provides the background against which the present constitutional removal provisions were adopted. Cases interpreting both the Constitution of 1838 and the Constitution of 1874 relied on what is presently Article VI, section 1 to distinguish between constitutional and non-constitutional officers. These cases hold that the removal provisions are not exclusive as to non-constitutional officers. In 1966, the constitutional removal provisions were readopted. They were renumbered and modified in minor form, but there was no attempt to alter the language upon which the distinction had been based. Thus, the readoption of this section, in 1874 and again in 1966, lends support to the conclusion that the cases distinguishing between constitutional and non-constitutional officers give the proper effect to the constitutional provisions.\u003c/span\u003e\n\n",
    "body_length": 273197,
    "citedas": [
      "367 A.2d 232",
      "470 Pa. 1"
    ],
    "attorneys": "Howard Gittis, Bernard Chanin, Philadelphia, for appellant in No. 89. Sheldon L. Albert, City Sol., Michael N. Silver, Asst. City Sol., for appellant in No. 90. Gregory M. Harvey, Philadelphia, for appellees.",
    "category": [
      "75"
    ],
    "judges": "Jones, C. J., and Eagen, O'Brien, Roberts, Pomeroy, Nix and Manderino, JJ. O'Brien, J., filed a concurring opinion. Nix, J., filed a concurring opinion in which Manderino, J., joins. Eagen, J., filed a dissenting opinion. Roberts, J., filed a dissenting opinion. Pomeroy, J., filed a dissenting opinion.",
    "citation_count": 0
  }
}
