{
  "id": "T6JfR2YBTlTomsSBegER",
  "document": {
    "title": "Xebec Development Partners v. National Union Fire Insurance Co.",
    "full_title": "XEBEC DEVELOPMENT PARTNERS, LTD. AND v. NATIONAL UNION FIRE INSURANCE COMPANY OF PITTSBURGH, PA. AND .",
    "jurisdiction": "California Court of Appeal",
    "date": "1993-01-13T00:00:00.000Z",
    "docket": "No. H007441",
    "body": "Defendant National Union Fire Insurance Company of Pittsburgh, Pa., appeals from a judgment for more than $7 million obtained against it by plaintiff Xebec Development Partners, Ltd. (XDP) on claims assigned to XDP by insureds under a policy of directors and officers liability and corporate reimbursement insurance (the D\u0026O policy) issued by National Union. XDP cross-appeals from the same judgment, asserting that the amount of its judgment was improperly limited.\n\nThe jury implicitly, and properly, found that National Union had breached the D\u0026O policy. But the jury's assessment of damages cannot stand; the judgment must be reversed and the matter remanded for further trial of the issue of damages for breach of contract. XDP is entitled to no recovery from National Union beyond such damages, together with prejudgment interest and costs (excluding attorney fees) ancillary to such damages, as may be fixed in further proceedings conducted in accordance with this opinion.\n\nThe D\u0026O policy had been issued by National Union to Xebec Corporation (Xebec) and was applicable to claims made during the policy period. Subject\n\nto policy terms and conditions, the D\u0026O policy provided for payment of indemnity in two categories:\n\n(1) Loss : National Union promised to pay, on behalf of directors and officers of either Xebec or any of its designated subsidiaries, \"loss . . . arising from any claim or claims . . . made . . . by reason of any Wrongful Act . . . in their respective capacities as Directors or Officers.\" \"Loss\" was defined as \"any amount which the Insureds are legally obligated to pay for a claim or claims made against them for Wrongful Acts, and shall include damages, judgments, settlements, costs, charges and expenses . . . incurred in the defense of actions . . ..\" \"Wrongful Act\" was defined as \"any breach of duty, neglect, error, misstatement, misleading statement, omission or other act done or wrongfully attempted by the insureds . . . or any matter claimed against them solely by reason of their being such Directors or Officers . . ..\" National Union also promised to pay, on behalf of Xebec and its designated subsidiaries, \"any amount [Xebec or a subsidiary] shall be required or permitted by law to pay to a Director or Officer as indemnity\" for claims of essentially the kind defined with respect to directors and officers. The policy provided no coverage for claims made against Xebec or its subsidiaries as entities.\n\n(2) Costs of defense : The policy provided that \"[n]o costs, charges, expenses and settlements shall be incurred without the Insurer's consent which shall not be unreasonably withheld; however, in the event of such consent being given, the Insurer will pay, [subject to provisos and limitations not relevant here], 100%% of all such costs, charges, expenses and settlements . . ..\" Under the policy terms National Union could arguably require that the corporation (always subject to National Union's consent) advance the costs of defense, to be reimbursed by National Union upon completion of the defense. But there was evidence that as a matter of industry practice, generally followed by National Union, D\u0026O insurers would be willing, upon some showing of the corporation's inability to pay, to advance costs of defense currently. This procedure was referred to as \"interim funding.\"\n\nThe D\u0026O policy, and the policy application which became a part of the policy, further provided in pertinent part:\n\n(a) That \"as a condition precedent\" to their rights to be indemnified under the policy Xebec, its subsidiaries, and its directors and officers \"shall . . . give to the insurer notice as soon as practicable in writing of any claims made upon\" directors or officers.\n\n(b) That Xebec, its subsidiaries, and its directors and officers \"shall give the Insurer such information and cooperation as it may reasonably require and as shall be in the . . . power\" of the corporations, directors and officers.\n\n(c) That \"all Directors and Officers shall furnish the insurer with copies of investigations, pleadings, and all other papers relating to an occurrence which could give rise to a possible claim under the . . . policy.\"\n\n(d) That \"the Directors and Officers will give the insurer the right to associate with them in the defense and settlement of any claim that appears reasonably likely to involve the insurer and the Directors and Officers will cooperate with the insurer in the defense of such claim.\"\n\nBeginning in 1983 XDP, a limited partnership, had entered into research and development agreements (RDA's) with Xebec by the terms of which XDP was to provide nearly $14 million in funding to Xebec for certain high-technology research and development work, and Xebec was to assign specified proprietary rights in the technology to XDP. Xebec agreed that the money XDP provided under the RDA's would be used only for specified costs incurred in performing the research and development work.\n\nIn 1985 certain XDP limited partners, including one Crary, concluded that Xebec had been diverting the research funds to unauthorized uses, and thereupon filed a lawsuit (the Crary lawsuit) against Xebec and certain of its subsidiaries. The Crary lawsuit was filed as a partner derivative action, and XDP was designated as a technical defendant.\n\nNone of Xebec's directors or officers was named as a defendant in the Crary lawsuit. Nevertheless, in December 1985 Xebec submitted a copy of the Crary complaint to National Union as notice of a \"potential occurrence\" under the D\u0026O policy, pointing out that the complaint designated \"Doe\" defendants. Early in 1986 National Union acknowledged receipt of the complaint, stated that it would \"treat this matter as an occurrence which may subsequently give rise to a claim . . .,\" and asked that National Union be notified if the complaint were amended to name directors or officers as defendants. The language \"occurrence which may subsequently give rise to a claim\" came directly from the policy, invoking a policy provision under which XDP's subsequent lawsuit against Xebec directors and officers (the Toreson-Hoebich lawsuit) was treated as a claim made during the policy period.\n\nIt appears that National Union received no further notice concerning the Crary lawsuit. Nor did it receive notice of a cross-complaint by XDP or of an independent lawsuit by XDP, both arising out of the RDA's and filed during 1986 but neither directed to individual directors or officers of Xebec.\n\nIn January 1986 a Xebec shareholder named Heideman (and one other shareholder) filed a securities class action (the Heideman lawsuit), not\n\ndirectly related to the RDA's, against Xebec and other entities and individuals, including Xebec's officers and directors. National Union was notified of the claims against officers and directors in the Heideman lawsuit and concurred in selection of counsel (the Orrick firm) to represent both Xebec and its officers and directors in that lawsuit. National Union provided interim funding for defense of directors and officers in the Heideman lawsuit.\n\nBecause there had been no activity reported to it for one year, National Union closed its file on the Crary lawsuit in January 1987.\n\nIn February 1987, as an economy measure, Xebec allowed the D\u0026O policy to expire.\n\nIn March 1987 XDP and another entity filed the Toreson-Hoebich lawsuit against Xebec directors and officers Toreson and Hoebich, asserting conversion and breach of fiduciary duties with respect to the RDA's and praying for approximately $6.5 million in damages. Toreson and Hoebich retained the Orrick firm to represent them in the Toreson-Hoebich lawsuit. It is undisputed that, by virtue of the December 1985 notice to National Union of the Crary lawsuit, the Toreson-Hoebich lawsuit constituted a claim made within the policy period of the D\u0026O policy. But until September 24, 1987, no one notified National Union of the Toreson-Hoebich lawsuit.\n\nThe Heideman lawsuit proceeded along its own track, separate from the lawsuits arising out of the RDA's. The Crary lawsuit had been submitted to binding arbitration, and by April 1987 all the lawsuits arising out of the RDA's had been consolidated in the arbitration proceedings. An arbitration \"trial,\" before a panel of three attorney arbitrators, was set for July 1987 but was then continued to September 28, 1987.\n\nBy late spring 1987 Xebec had fallen behind in paying the Orrick firm's legal fees. To reduce its legal costs Xebec retained an attorney named Haun, formerly both a member of the Orrick firm and house counsel at Xebec, to do part of its legal work at a lower cost. By early summer 1987 the Orrick firm had advised Xebec that it wished its account brought up to date.\n\nIn August 1987 the Orrick firm moved for summary judgment on behalf of Xebec in the arbitration proceeding, arguing primarily that Xebec had performed sufficiently under the RDA's and therefore that XDP was not entitled to recover the money it had provided. In response XDP submitted extensive documentation to show that Xebec and its subsidiaries, officers, and directors had in fact wrongfully diverted a substantial part of the money.\n\nThe arbitrators denied summary judgment, and from the arbitrators' remarks both Haun and the Orrick firm's attorneys concluded that the arbitration trial might produce a result unfavorable to all defendants including Toreson and Hoebich as individuals.\n\nIn mid-September 1987, the Orrick firm, having been informed that Xebec had diverted funds intended for payment on the Orrick firm's account to other uses, told Xebec and the other defendants that it would withdraw from its representation of them in the arbitration proceedings. At about this time Xebec, through Toreson as its president, concluded that the defendants should undertake to settle the disputes in arbitration, entered into an agreement with Haun by which Haun was to receive an incentive fee to get the matter settled, and asked the Orrick firm to set up a settlement meeting with XDP. An Orrick firm attorney immediately called the principal attorney for XDP, Bisset, and arranged a meeting on September 18.\n\nNo attorney from the Orrick firm attended the September 18 meeting. It is apparent from the record that Xebec could not have expected the Orrick firm to act for the defendants, after September 15, unless arrangements satisfactory to the Orrick firm were made to pay the approximately $675,000 unpaid balance of attorney fees the firm had theretofore billed.\n\nToreson, Haun, Crary, Bisset, and a principal of XDP's general partner attended the September 18 meeting. National Union still had not been given notice of the Toreson-Hoebich lawsuit, was unaware of the meeting, and was not represented. All five participants testified for XDP at trial, and their accounts were consistent and succinct: Toreson stated that the defendants' financial condition was such that they could not fund a settlement. One alternative Toreson suggested was that the defendants' rights against National Union under the D\u0026O policy be assigned to XDP in return for an arrangement releasing the defendants from the claims in arbitration. XDP asked that the defendants verify their financial condition and that they provide the D\u0026O policy to Bisset for review. There may have been mention of a minimum settlement figure of $5 million, but Bisset acknowledged in testimony that the defendants who were represented at the meeting indicated \"they were prepared to discuss any kind of settlement that XDP wanted to do so long as it didn't involve payments by them of any significant amount of money.\" There was no settlement negotiation, as such, at the September 18 meeting: It was contemplated that Bisset and Haun would discuss settlement after XDP received the information it had requested.\n\nBisset had first heard of the possibility of insurance coverage at the August summary judgment hearing, when an Orrick firm attorney mentioned\n\nit in passing. After the hearing Bisset had questioned the attorney, who ultimately told Bisset that coverage had expired before the Toreson- Hoebich complaint was filed in March 1987. The attorney's statement did not take account of the fact the claims-made provision of the policy had been satisfied by notice to National Union of the Crary lawsuit in December 1985.\n\nBisset testified that on September 21, having reviewed the policy, Bisset told Haun that XDP would need to have a judgment entered against the defendants and would want Xebec to pay certain royalties in cash. There was Discussion of giving the defendants a covenant not to execute on the judgment. According to Bisset, this was all preliminary Discussion and he was to submit a more formal settlement proposal to Haun.\n\nInstead (Bisset testified), on September 22 Haun sent a written settlement proposal to Bisset. Bisset and Haun agreed in testimony that Bisset immediately rejected the proposal by telephone and then, on September 23 and 24, sent his own written proposals to Haun. The crux of these proposals was that Toreson and Hoebich, jointly and severally with the corporate defendants, would stipulate to an arbitration award and confirmatory judgment against them for $8,650,263, plus costs and fees, and would receive a covenant not to execute.\n\nAt trial National Union tendered, and the court received, substantial evidence to the effect that Toreson and Hoebich would not have been liable as individuals for more than a small fraction of this amount and might not have been liable, as individuals, at all.\n\nAs of September 24, 1987 (a Thursday, four days before the scheduled start of the arbitration \"trial\" on Monday, Sept. 28), National Union still had not been given notice of the Toreson-Hoebich lawsuit and was not aware of, and had not participated in, the settlement Discussions between Bisset and Haun.\n\nOn the afternoon of September 24, Haun called a New York law firm which had represented National Union in connection with the Heideman lawsuit and spoke with one of the firm's attorneys, Kristiansen. Kristiansen received the call at 4:45 p.m., New York time. Haun described the situation and told Kristiansen the matter was scheduled to go to \"trial\" on September 28. Haun testified that he told Kristiansen that \"the only thing I could think of to get my clients out of this predicament was to either settle the case along the lines that we had been talking about or get National Union to step in and pick up the cost of continuing to defendant [ sic ] the litigation.\" Kristiansen's recollection was somewhat different: He testified that Haun \"told me that\n\nOrrick . . . had been representing the directors and officers and that they had incurred approximately [$675,000] in fees which had not been paid. . . . He told me that if National Union did not step in and defend the directors an[d] officers, did not pay the back fees, as well as paying the fees ongoing, that Orrick would not continue to represent parties in the litigation. And that if National Union didn't pick up those fees, Xebec and Toreson and Hoebich would stipulate to an [$8 million] nonrecourse judgment in favor of the plaintiff XDP and assign any right which they might have under [the D\u0026O policy] to XDP.\" Kristiansen called Haun back twice to obtain more information and copies of documents.\n\nOn September 25 Kristiansen received copies of pleadings and met with one of his senior attorneys and National Union representatives. Then Kristiansen called Haun and told him that National Union would not pay defense costs because notice had been given too late and National Union had been substantially prejudiced by the delay.\n\nAlso on September 25, counsel for parties to the various consolidated actions arranged for the first of a series of continuances of the arbitration \"trial.\"\n\nOn September 29 Kristiansen transmitted a written statement of National Union's position to Haun. Among other things, Kristiansen's letter said: \"Due to the complete failure of Xebec and its directors and officers to provide National Union with any information regarding this claim, which conduct constitutes breaches of [enumerated provisions] of the policy, National Union hereby disclaims any responsibility for the costs of defense and/or indemnity which may be asserted by Xebec and/or Messrs. Toreson and Hoebich under National Union's policy in connection with the claims asserted by XDP against Xebec, its subsidiaries and Messrs. Toreson and Hoebich.\"\n\nOn the same day Bisset transmitted a copy of a draft settlement agreement (incorporating a proposed stipulated award of slightly more than $9.8 million in favor of XDP and against Xebec, Toreson, and Hoebich) to Kristiansen, and advised Kristiansen that the parties intended to present the stipulation to the arbitrators on September 30. At trial Bisset attributed the difference between the earlier $8.6 million figure and the $9.8 million to attorney fees and interest. In his own testimony at trial Bisset maintained that every element of the settlement had been carefully analyzed by Bisset and Haun, on the basis of substantial evidence accumulated for the arbitration \"trial,\" that the amount assigned to each element represented a realistic\n\nappraisal of the element's settlement value, and that the total settlement amount was some $2.5 million less than XDP's actual out-of-pocket loss.\n\nKristiansen responded by telephone that National Union's previously stated position was final. Kristiansen reiterated this position, in writing, on September 30 and again on October 2, as the arbitration \"trial\" was repeatedly postponed. In the course of correspondence and telephone calls Kristiansen expressed indifference to Bisset's proposals to send him the settlement draft and to travel personally to New York to discuss the situation. The record reflects that over the same period Haun sent Kristiansen several written invitations to negotiate concerning National Union's participation, and particularly concerning \"allocation\" of the settlement amount (for purposes of coverage under the D\u0026O policy) between claims against Toreson and Hoebich, as directors and officers, and claims, not covered by the D\u0026O policy, against corporate defendants. Kristiansen either rejected or did not respond to each of these overtures. At trial he and other National Union witnesses asserted that as of September 24 the prejudice to National Union's position had been irremediable, primarily because (in their view) its belated entry into the matter might well jeopardize a settlement which could hardly have been better from the standpoint of their insureds Toreson and Hoebich. National Union professed to be concerned that anything it might do to set aside a settlement under which Toreson and Hoebich would walk away financially untouched could be construed as a violation of National Union's duty of good faith toward Toreson and Hoebich as its insureds.\n\nOn October 6 Crary signed the settlement papers and Bisset took them to a scheduled status hearing before the arbitrators. Immediately before the hearing Haun informed Bisset that Toreson and Hoebich now insisted on an agreement from the corporate defendants for indemnification in the event Toreson and Hoebich should be required to incur further legal costs, and that such an agreement would require shareholder approval which might delay proceedings for two months. Toreson testified '[w]e were concerned that the insurance company would sue us because we were assigning our rights to the policy to somebody else and that there would be some legal exposure . . ..\"\n\nOver the following week Bisset and Haun worked out an amendment to the settlement agreement to provide for shareholder approval, and the arbitrators reset the trial for February 1, 1988, as a date certain.\n\nOn October 14, Xebec paid $40,930 to XDP as its full royalty payment required by the settlement. By October 16 all defendants except one Xebec\n\nsubsidiary had signed the settlement agreement, and on October 22 Xebec issued a press release reporting it had tentatively settled all disputes involving XDP. On October 23 Haun wrote to Kristiansen, explaining that shareholder ratification of the settlement would not be obtained before mid-January. Kristiansen did not reply.\n\nIn December the last corporate defendant signed the settlement agreement. In January 1988 the settlement agreement was ratified by shareholders of the corporate parties.\n\nBy the terms of the settlement agreement XDP undertook to deliver to Xebec, upon entry of final judgment, a form of covenant not to execute which provided in pertinent part that XDP \"will not at any time levy execution on or otherwise seek to enforce the Final Judgment\" as against Xebec, Toreson and Hoebich, but that the covenant \"shall not limit enforcement of the Final Judgment or any claim or right against any person or entity other than\" Xebec, Toreson or Hoebich, \"including without limitation [their] insurers.\"\n\nAttached to the settlement agreement as ratified was a form of \"Award of Arbitrators,\" to be made \"in accordance with the parties' stipulation,\" which in relevant part fixed the joint and several liability of Xebec, Toreson and Hoebich to XDP at $9,033,479 in principal and interest, plus $800,000 in attorney fees, for a total of $9,833,479. The form omitted an additional $123,139.16 in separate liability for Xebec, and included a recital that Toreson and Hoebich were entitled to indemnification from Xebec under the Corporations Code, but was otherwise identical to the proposed stipulated award Bisset had transmitted to counsel for National Union on September 29. Also attached to the settlement agreement were a form of \"Stipulation and [Proposed] Order Confirming Arbitration Award and Directing Entry of Final Judgment\" and a one-paragraph form of \"Final Judgment.\"\n\nOn January 19, after short deliberation, the arbitrators signed an award in the form attached to the settlement agreement. It appears from the record that only Bisset and Haun appeared before the arbitrators, and there is no suggestion in the record that any question or objection as to the propriety of the stipulation for an arbitration award was raised by anyone.\n\nNo executed copy of a stipulation for judgment appears in the record, but on January 21, 1988 (two days after the arbitration award was signed), the superior court entered an order, in the form attached to the settlement agreement, confirming and adopting the award \"as the final judgment in this action, which judgment shall be entered forthwith.\"\n\nOn January 29 Bisset, for XDP, sent National Union a demand for payment of the full amount of the $9,833,479 judgment together with \"your insureds[']\" right to reimbursement of \"approximately $900,000\" in attorney fees and expenses. National Union did not respond. Eleven days later, on February 9, 1988, XDP sued National Union for the amount demanded, plus interest, punitive damages, and additional attorney fees, on three broad theories of liability: Breach of the insurance contract, of a covenant of good faith and fair dealing implicit in the insurance contract (cf. Comunale v. Traders \u0026 General Ins. Co. (1958) 50 Cal. 2d 654, 658-661 [328 P.2d 198, 68 A.L.R.2d 883]), and of subdivision (h) of Insurance Code section 790.03. (Cf. Royal Globe Ins. Co. v. Superior Court (1979) 23 Cal. 3d 880 [153 Cal. Rptr. 842, 592 P.2d 329]; Moradi-Shalal v. Fireman's Fund Ins. Companies (1988) 46 Cal. 3d 287 [250 Cal. Rptr. 116, 758 P.2d 58].) Various cross-claims were made but are not involved in this appeal. As pleaded in the four counts of XDP's complaint and clarified in the course of the trial proceedings, XDP's theories related to the elements of the recovery is sought as follows:\n\n1. Breach of contract. In the first count of its complaint XDP sought recovery of the amount of the January 21, 1988, judgment against Toreson and Hoebich, plus interest, \"[b]oth under the D\u0026O policy and as damages proximately caused by its breach of the D\u0026O policy.\" Throughout trial and in summation Bisset made clear that XDP believed it was in any event entitled to the full amount of the judgment, upon contract principles, under the explicit terms of the insurance contract. In the second count of its complaint XDP sought further to enforce the asserted rights of Toreson and Hoebich, under the D\u0026O policy, to recover attorney fees and other expenses they had incurred in defending against XDP's claims.\n\n2. Breach of the implied covenant of good faith and fair dealing. XDP's third count undertook to enforce the asserted rights of Toreson and Hoebich to recover for National Union's allegedly wrongful refusals to pay defense costs and to settle. As it took its case to the jury XDP made clear that it sought recovery on this theory only as to attorney fees and related litigation costs in two increments: Defense costs including attorney fees, incurred by Toreson and Hoebich after National Union's refusals (which occurred no earlier than Sept. 25, 1987), and XDP shown costs of pursuing this lawsuit.\n\n3. Breach of subdivision (h) of Insurance Code section 790.03. This theory was pleaded in XDP's fourth count. By it XDP (as its theories developed during trial) sought recovery for National Union's asserted bad faith insurance practices, in two increments. First, in its own right, as a \"third party\" claimant, XDP manifestly in ended to use section 790.03\n\nprimarily as a predicate for a claim for punitive damages which would not otherwise be available to it. Second, XDP wished to use section 790.03, as the assignee under the settlement agreement of Toreson's and Hoebich's \"first party\" rights against National Union, as a basis, alternative to its breach-of-contract theory, for its claim to recover the defense costs Toreson and Hoebich had incurred both before and after September 24, 1987.\n\nIn the course of trial the superior court granted National Union's motion for judgment on the pleadings as to XDP's Insurance Code section 790.03 theories. The parties stipulated that XDP's claims for defense costs--in essence, for attorney fees incurred by Toreson and Hoebich--and for XDP's own attorney fees, should be tried by the court, after the jury returned verdicts on other issues. Thus, XDP went to the jury on its theories of breach of contract and breach of the implied covenant of good faith and fair dealing, but asked the jury to award damages only under its first contract count. As to the theories upon which it sought attorney fees it asked the jury only to make special findings for the use of the trial court in assessing XDP's attorney-fee claims in separate and subsequent proceedings.\n\nThe trial court gave the jury a special findings form that addressed specific questions separately as to breach of contract and as to breach of the implied covenant of good faith and fair dealing. The jury found:\n\nAs to breach of contract :\n\n(1) That Xebec, Toreson and Hoebich had failed to give notice of the claim against Toreson and Hoebich or had otherwise failed to cooperate with National Union.\n\n(2) That these failures had not substantially prejudiced National Union.\n\n(3) That the settlement agreement had not been collusive.\n\nAs to breach of the implied covenant of good faith and fair dealing :\n\n(1) That National Union had acted unreasonably toward Xebec, Toreson or Hoebich in its handling of the claim after it received the September 24, 1987, telephone call from Haun.\n\n(2) That National Union's failure to act reasonably had proximately caused damage to Toreson, Hoebich or Xebec.\n\n(3) That Xebec, Toreson or Hoebich had acted unreasonably toward National Union.\n\n(4) That the failure of Xebec, Toreson or Hoebich to act reasonably had proximately caused damage to Xebec, Toreson or Hoebich.\n\n(5) That the comparative percentages of unreasonable conduct were 25 percent attributable to Xebec, Toreson, Hoebich or their attorneys and 75 percent attributable to National Union or its attorneys.\n\nThe jury returned a general verdict for XDP and against National Union for $7,375,000. This general verdict was almost exactly 75 percent of the amount fixed in the settlement agreement as incorporated in the January 1988 arbitration award and, by reference, if the judgment confirming the award.\n\nIn the ensuing nonjury proceedings on attorney fees and costs, the court ruled that XDP could not recover attorney fees or costs as the assignee of Toreson and Hoebich, but could recover 75 percent of its own attorney fees in prosecuting this action by virtue of its assigned claim for breach of the implied covenant of good faith and fair dealing. After disallowing particular items of claimed fees and costs, and reducing net allowable fees by 25 percent, the court entered judgment for XDP for a total of $9,848,564.01.\n\nThe parties' arguments on appeal, prepared and presented by the offices of trial counsel, do not always focus on cognizable appellate issues. In response to requests from the court the parties have submitted lengthy supplemental briefing. It has proved helpful to reorganize and to recast the parties' contentions in an outline based on XDP's theories of liability.\n\nBREACH OF CONTRACT\n\nXDP's first theory, on which it has consistently relied for recovery based on the amount specified in the underlying settlement and in the award and judgment based on the settlement, was that National Union had breached the literal terms of the insurance contract, that Xebec, Toreson and Hoebich, as insureds, were entitled to damages attributable to the breach, and that by virtue of assignment of the insureds' rights XDP was entitled to sue for and to collect the damages.\n\n1. STANDING.\n\nAs a general rule, \"in the absence of an assignment a third party claimant cannot bring an action upon a duty owed to the insured by the insurer.\" (Clemmer v. Hartford Insurance Co. (1978) 22 Cal. 3d 865, 889 [151 Cal. Rptr. 285, 587 P.2d 1098].) The trial court instructed the jury that\n\nToreson and Hoebich had assigned \"any and all of their rights or claims against . . . National Union\" to XDP. Implicit in this instruction is an admonition that the assignment was valid. On appeal National Union has not questioned the validity of the assignment insofar as it relates to XDP's breach of contract theory, and as to that theory the assignment appears to have been entirely orthodox. (Cf. generally, 1 Witkin, Summary of Cal. Law (9th ed. 1987) Contracts, ยง 933, p. 833 et seq.) Smith v. State Farm Mut. Auto. Ins. Co. (1992) 5 Cal. App. 4th 1104 [7 Cal. Rptr. 2d 131], decided while this appeal was pending and briefed by the parties at the court's request, involved assignment of a conceptually distinguishable claim for asserted breach of the implied covenant of good faith and fair dealing.\n\nShortly before trial XDP for the first time suggested that it could pursue contract remedies against National Union not only as the assignee of the insureds but also directly, in its own right, under subdivision (b)(2) of Insurance Code section 11580. XDP's subsequent motion to amend its complaint to refer to subdivision (b)(2) was taken under submission and apparently never ruled on. In any event XDP could not properly have proceeded under subdivision (b)(2), because XDP's underlying action against Toreson and Hoebich patently was not \"based upon bodily injury, death, or property damage\" within the meaning of the section. (Cf. Rolf Homes, Inc. v. Superior Court (1960) 186 Cal. App. 2d 876, 880-881 [9 Cal. Rptr. 142].)\n\n2. BREACH.\n\nXDP was of course required to prove that National Union had breached the insurance contract. Initially XDP asserted that National Union had done so (1) by failing and refusing in the fall of 1987, after notice of claims against the insureds, to consent to or to pay the insured's costs of defense, and (2) by failing, in early 1988, to indemnify XDP (as the assignee of Toreson and Hoebich) for the amount of the judgment entered against Toreson and Hoebich. But at trial XDP requested instructions, and argued its case to the jury, upon only the first assertion: That National Union had breached the contract by refusing to pay costs of defense for Toreson and Hoebich. The court informed the jury of both assertions, but in its instruction on XDP's burden of proof described only the first Neither party complains of this apparent inconsistency.\n\nA. COVERAGE.\n\nThe question of breach would not arise if the policy patently did not extend to the claim made upon it. Thus, for example, if Xebec had requested\n\npayment of its defense costs, a refusal by National Union could not have been a breach because the policy did not cover claims against the corporation as distinct from its directors and officers.\n\nNational Union complains that in the course of its instructions the trial court told the jury to \"assume\" there was coverage under the D\u0026O policy. National Union asserts that the instruction \"amounted to a directed verdict on virtually the entire case.\"\n\nThe assertion disproportionately aggrandizes the instruction the court actually gave, and disregards relevant circumstances surrounding the decision to give the instruction.\n\nThe court's instruction was that \"for purposes of your deliberations you must assume that the claims asserted by [XDP against Toreson and Hoebich were covered by the insurance policy. The defendant is still entitled to assert defenses to justify or excuse it from paying the plaintiff, however.\"\n\nThis instruction was arrived at in the course of colloquy between the court and counsel, out of the presence of the jury, immediately before the court instructed the jury. In the course of trial National Union did not deny that Toreson and Hoebich were directors and officers (and thus that claims against them arising out of their activities as directors and officers would presumptively be within the policy's coverage) but did from time to time assert either that there had been no colorable claim, within the policy coverage, against either Toreson or Hoebich as an individual, or at least that some elements of XDP's claims against the individuals were not covered. The court ultimately determined that it should resolve the question of coverage, in the broad sense, as a matter of law and should instruct the jury in accordance with its determination, and made the parties aware that in its view there was coverage, as a matter of law, of the claims XDP had made against Toreson and Hoebich. In the preinstruction colloquy counsel for XDP suggested that the jury \"needs to know\" the court's Conclusion. The court expressed countervailing concerns that, on the one hand, a categorical instruction that there was coverage might lead the jury to disregard evidence of coverage defenses, but, on the other hand, the jury might be \"sort of left at sea\" if no instruction at all were given. At this point counsel for National Union suggested that the court and counsel had previously agreed (apparently in proceedings off the record) \"something like we were going to go forward on assuming there is coverage . . ..\" After further Discussion the court proposed essentially the instruction it ultimately gave, acknowledging that it was \"offering a middle ground\" rather than informing the jury\n\ncategorically. Counsel for National Union then said: \"We would be willing to go along with that and it probably prejudices us more because we definitely believe there is no coverage and we are allowing the jury to assume coverage. We don't want to be taken as waiving it should be [XDP's counsel's] struggle and not our struggle, but we would agree to it.\"\n\nVague as this colloquy is, it appears to amount to acquiescence by National Union in the instruction as given, coupled with an expression of intent to reserve its objection that the trial court was wrong on the law: That as a matter of law there was not coverage.\n\nBut having reserved the coverage issue National Union does not appear to return to it in this court.\n\nB. DUTY TO DEFEND VERSUS DUTY TO PAY COSTS.\n\nAt the outset XDP took the position that the D\u0026O policy imposed a \" duty to defend \" on National Union, and National Union responded that the policy imposed at most a duty to pay defense costs subject to its advance consent which could not be unreasonably withheld. National Union's position is consistent with judicial construction of other D\u0026O policies (cf., e.g., National Union Fire Ins. Co. v. Stites Prof. Law Corp. (1991) 235 Cal. App. 3d 1718, 1727 [1 Cal. Rptr. 2d 570]; cf. also Helfand v. National Union Fire Ins. Co. (1992) 10 Cal. App. 4th 869, 879 [13 Cal. Rptr. 2d 295]; Gon v. First State Ins. Co. (9th Cir. 1989) 871 F.2d 863, 867-868), and XDP appears to have come around to this position.\n\nThe significance of the distinction between duty to defend and duty to pay defense costs will depend on the context in which the issue is raised. Here the relevant question was whether National Union had (as XDP asserted) breached a duty imposed upon it by the insurance contract, whatever the exact nature of that duty might have been. To answer the question the jury would need to know the exact nature of the duty. National Union argues that the jury was improperly instructed that the insurance contract imposed a duty to defend. National Union appears to be wrong. The trial court told the jury:\n\n(1) That the insurance contract \"required [National Union] to pay for defense costs, for claims filed against the officers and directors of Xebec charging them with wrongful acts . . ., and to indemnify the directors and officers for any amount for [ sic ] which they became lawfully obligated to pay to an injured party on account of such wrongful conduct.\" National Union's objection does not reach this language, which is reasonably accurate.\n\n(2) That \"under the terms of the policy the defendant was obligated to pay the cost of defending Toreson and Hoebich against the claims which [XDP] filed against Toreson and Hoebich,\" subject to \"an agreement . . . that prior to incurring any attorney fees which were to be paid by the defendant Toreson and Hoebich would ask for and obtain the defendant's consent . . . [which] would not be unreasonably withheld.\" National Union argues that the instruction did not take sufficient account of its assertion \"that the policy was already in 'breach' by the insureds before National Union was asked to respond.\" This is a matter of coverage defense, considered below. Certainly the instruction does not tell the jury that National Union's relevant duty under the policy was a duty to defend.\n\nC. ASSERTED INCONSISTENCY IN FINDINGS.\n\nThe jury was not asked to make special findings as to whether National Union had breached the duty to pay defense costs. National Union argues that in postverdict proceedings the court expressly found that National Union had not breached the duty. Apparently National Union is referring to the trial court's Conclusion, stated during trial and referred to somewhat obliquely in its written postverdict orders on attorney fees, that because (in the court's view) National Union had not received sufficient notice of XDP's claims against Toreson and Hoebich, and thus had been given no opportunity to grant or withhold consent to defense costs, before September 24, 1987, National Union had no retroactive duty to pay the attorney fees Toreson and Hoebich had incurred (primarily to the Orrick firm, which by September 24 had effectively withdrawn from the representation) before that date. The court's order did not extend to, and thus did not imply a finding as to, National Union's asserted duty to pay costs of defense (including attorney fees) for Toreson and Hoebich from and after September 24.\n\nD. ANTICIPATORY REPUDIATION.\n\nUnder the trial court's view of the evidence, the only breaches of National Union's duty to pay defense costs would have related to costs incurred from and after September 24, 1987. The evidence shows that National Union made quite clear, beginning on September 25, that it would not consent to, or pay, defense costs to be incurred in the future in the Toreson- Hoebich lawsuit. The trial court instructed the jury, in part, that \"[i]f a party to an insurance contract disclaims a future obligation to perform under the insurance contract the other party to the insurance contract is entitled to treat the disclaimer as a breach of the insurance contract even if the performance\n\ndisclaimed is not yet due.\" National Union asserts that the instruction was erroneous, arguing that \"[t]he doctrine of 'anticipatory repudiation' is generally not applicable to insurance contracts\" and \"is peculiarly inapplicable in the context of a contract of indemnity. \" (Italics in original.)\n\nNational Union's argument overtaxes the cases on which it relies. It is established that \"[t]here can be no anticipatory breach of a unilateral contract.\" (Cf. generally, 1 Witkin, Summary of Cal. Law, supra, Contracts, ยง 811-812, pp. 731-732.) This rule has been applied to certain kinds of insurance contracts in circumstances which have rendered the contracts unilateral, and National Union cites some of these cases (cf., e.g., Garage etc. Employees Union v. Pacific Mut. Life Ins. Co. (1969) 2 Cal. App. 3d 706, 712 [82 Cal. Rptr. 821]), but these cases by no means establish that there can never be an anticipatory repudiation of an insurance contract. More to the point, the instruction was at worst superfluous: By the time XDP filed its lawsuit, the time for National Union's performance had passed and National Union, rightly or wrongly, unequivocally maintained its refusal to perform (either by interim funding or by reimbursement). Although arguably overbroad, the instruction could not have prejudiced National Union.\n\nE. SETTLEMENT.\n\nIn its supplemental briefing XDP suggests that the D\u0026O policy imposed on National Union a duty to accept a settlement entered into by its insureds, and that National Union breached its duty by rejecting the settlement Haun described to Kristiansen.\n\nXDP relies on policy language which does not support its Conclusion. The language, in an amendment to both the company reimbursement and the directors and officers liability coverages of the policy, is a provision for payment of costs in the limited circumstances in which an insured may be required to contest legal proceedings; the provision refers in passing to payment of \"settlements.\" XDP argues that this provision \"expressly gave the insureds the right to settle\" and thus implicitly required National Union to acquiesce in any such settlement. On the face of the provision XDP's argument is tenuous at best; more to the point, another provision of the same policy amendment expressly states that \"[n]o . . . settlements shall be incurred without the Insurer's consent which shall not be unreasonably withheld . . ..\"\n\nIn any event XDP did not effectively raise the point in the trial court.\n\nF. COVERAGE DEFENSES.\n\nNational Union did not and could not deny that it flatly and unequivocally refused to pay defense costs, or that it persisted in its refusal over the several\n\nmonths between September 24, 1987, and entry of XDP's judgment in January 1988.\n\nInstead, National Union asserted, as coverage defenses, that it was released from its duty to pay defense costs by its insureds' antecedent breaches of duties imposed upon the insureds under the insurance contract.\n\nI. ASSERTED BREACHES BY THE INSUREDS\n\nA. NOTICE.\n\nThe D\u0026O policy required, \"as a condition precedent to\" the insureds' rights to be indemnified, that Xebec give National Union \"notice as soon as practicable in writing of any claims made upon the insureds.\" The contract also incorporated an agreement to furnish National Union with \"copies of investigations, pleadings, and all other papers relating to an occurrence which could give rise to a possible claim . . ..\" In January 1986 National Union had acknowledged notice (with respect to the Crary lawsuit) of \"an occurrence which may subsequently give rise to a claim,\" but it is undisputed that the first relevant claim made explicitly upon Toreson and Hoebich was XDP's March 1987 lawsuit, and that although Xebec, Toreson and Hoebich were aware of that lawsuit from the outset, National Union was not given any form of notice or information concerning the lawsuit until September 24, 1987, six months later. The jury expressly found that Xebec, Toreson and Hoebich failed to give notice of the claim.\n\nB. COOPERATION.\n\nThe D\u0026O policy required that Xebec \"give the Insurer such information and cooperation as it may reasonably require and as shall be in the Insured's power.\" The jury expressly found that Xebec, Toreson and Hoebich had failed to cooperate with National Union.\n\nII. PREJUDICE.\n\nNational Union tacitly acknowledges that the jury's findings that the insureds had failed to give notice or otherwise to cooperate were not sufficient in and of themselves to establish National Union's coverage defenses. In the circumstances of this case National Union had the burden of showing it was substantially prejudiced by the insureds' breaches. (Northwestern Title Security Co. v. Flack (1970) 6 Cal. App. 3d 134, 140-144 [85 Cal. Rptr. 693]; cf. Clemmer v. Hartford Insurance Co., supra, 22 Cal. 3d at pp. 881- 884; Campbell v. Allstate Ins. Co. (1963) 60 Cal. 2d 303, 305-307\n\n[32 Cal. Rptr. 827, 384 P.2d 155]; Select Ins. Co. v. Superior Court (1990) 226 Cal. App. 3d 631, 636 [276 Cal. Rptr. 598]; but see Helfand v. National Union Fire Ins. Co., supra, 10 Cal. App. 4th 869 [notice-prejudice rule does not apply to notice which is an \"element of coverage,\" citing cases involving claims-made- and-reported policies].) The jury was so instructed, and explicitly refused to find substantial prejudice.\n\nNational Union attacks the jury's negative finding, arguing that \"prejudice appears as a matter of law, and a properly instructed jury could not have found otherwise.\" If National Union were right, this court could properly conclude that National Union had borne its burden of proof of substantial prejudice and could set aside the jury's special finding on that ground. But if the record does not show substantial prejudice as a matter of law, the jury's finding must be deemed supported by an implicit determination, fully within the powers of the trier of fact, that National Union simply had not borne its burden.\n\nThe record unquestionably contains strong evidence that an insurer in National Union's position stood to be gravely prejudiced by an inability to assure itself that Toreson and Hoebich had selected competent counsel, to exercise its contractual privilege \"to associate with them in the defense and settlement\" of XDP's claims at a point early enough in the proceedings to have some meaningful opportunity to participate in those proceedings, and otherwise to assure that both its and its insureds' interests were protected. Unlike a standard liability insurance policy, this D\u0026O policy neither imposed a duty to defend upon National Union nor gave National Union the concomitant right to control and manage the defense. Nevertheless as a practical matter National Union might, with earlier notice, have been able effectively and consistently to serve both its insureds' interests and its own.\n\nBut these perceptions are necessarily speculative and by the same token insufficient to establish substantial prejudice as a matter of law. The insurer's burden \"is not carried by a showing of possibility of prejudice to the insurer. Rather, actual prejudice must be shown. [Citation.] The insurer 'must establish at the very least that if the cooperation clause had not been breached there was a substantial likelihood the trier of fact would have found in the insured's favor.' [Citation.]\" (Northwestern Title Security Co. v. Flack, supra, 6 Cal. App. 3d at pp. 141-142.) XDP tendered evidence of its own which (whether or not sufficient to have supported a finding of no prejudice had the burden been on XDP) was sufficient to raise a doubt as to whether National Union was substantially prejudiced by the six-month delay in notice and other \"cooperation.\" National Union's evidence does not compel a finding of substantial prejudice as a matter of law.\n\nIn supplemental briefing National Union argues that Smith v. State Farm Mut. Auto. Ins. Co., supra, 5 Cal. App. 4th 1104, demonstrates it was substantially prejudiced, as a matter of law, by the \"stipulated\" judgment entered in January 1988. National Union also asserts that \"the requirement of 'substantial prejudice' . . . is really something of a non-sequitur in 'stipulated judgment' cases.\" Apparently the second argument (which is not wholly clear on its face) is intended as a variant of the first. In this case neither argument appears to reach the question whether as a matter of law the insureds' failure to give notice to, or otherwise to cooperate with, National Union before September 24, nearly four months before the stipulated judgment was signed, substantially prejudiced National Union under the insurance contract. The language from Smith on which National Union relies relates not to prejudice antecedent to the stipulated judgment but rather to prejudice inherent in use of a stipulated judgment, coupled with a covenant not to execute, to support a subsequent action by an assignee for breach of the implied covenant of good faith and fair dealing. Rose v. Royal Ins. Co. (1991) 2 Cal. App. 4th 709 [3 Cal. Rptr. 2d 483], which National Union also cites, involved the propriety of a broadly worded no-action clause under Insurance Code section 11580 and contributes nothing to National Union's argument.\n\nFinally, National Union asserts that the jury's special verdicts expressly found \"that Toreson and Hoebich had acted unreasonably and that their unreasonable conduct had contributed to the ultimate size of the judgment. This requires a finding of 'substantial prejudice' as a matter of law.\" At best the argument is disingenuous. What the jury found, not in the context of the notice and cooperation clauses of the insurance contract but with respect to XDP's claim for breach of the implied covenant of good faith and fair dealing, was that Xebec, Toreson or Hoebich had acted unreasonably toward National Union and that their failure to act reasonably had proximately caused damage to Xebec, Toreson or Hoebich. These findings appear to have no tendency at all to show substantial prejudice to National Union, with respect to the judgment or anything else.\n\nG. SUMMARY.\n\nBy finding no substantial prejudice the jury effectively negated National Union's coverage defenses. Its general verdict, under instructions the thrust of which was to require it to return such a verdict, if at all, only on a theory of breach of contract, necessarily implies a finding of breach of the contract by refusal to pay defense costs. The evidence sufficiently supports the implicit finding, and National Union has suggested no reason cognizable in an appellate court why the implicit finding of breach should not be upheld.\n\n3. DAMAGES.\n\nIn broad generality a party to a contract who is injured by breach of the contract, and who elects to seek damages (rather than one of several alternative remedies) for the breach, should receive the cash equivalent of the benefit of performance of the contract. (1 Witkin, Summary of Cal. Law, supra, Contracts, ยง 813, pp. 732-733.)\n\nThe generalization applies to an insurance contract such as this one. If all conditions of performance were met, in net effect the benefit of performance of the contract, to Toreson and Hoebich, was that the total of their unreimbursed legal obligations to pay covered claims and their expenses of defending against such claims should in no event exceed minimal \"retention\" amounts specified in the contract and not at issue here. To the extent they were not indemnified for amounts they could be legally compelled to pay, or reimbursed for costs of defense, in excess of the retention amounts, Toreson and Hoebich would suffer contract damages. As their assignee XDP sought to recover such damages.\n\nA. LOSS.\n\nThe policy provisions directly relevant to indemnification of Toreson and Hoebich define indemnifiable \"loss\" as \"any amount which the Insureds are legally obligated to pay . . ..\" To prove damages on the basis of unindemnified loss XDP needed to prove both the legal obligation to pay and the amount of the obligation. (Cf. Fidelity \u0026 Deposit Co. v. Whitson (1960) 187 Cal. App. 2d 751, 757 [10 Cal. Rptr. 6].)\n\nAn insured might incur, or assume, an obligation to pay a covered claim in any of several circumstances ranging from enforcement of a litigated civil judgment at one extreme to voluntary payment whether pursuant to a negotiated settlement or simply by way of acquiescence in the claimant's demands, at the other. Given breach by the insurer, the easiest case for assessment of indemnity damages almost certainly would be one in which the third party claimant had forced the insured to trial and had obtained a fully litigated judgment fixing the amount due on the claim. Such a judgment, in contested proceedings, would provide relatively persuasive evidence of both the obligation and its amount. On the other hand a wholly voluntary payment would have very little tendency to demonstrate, in and of itself, the fact and amount of a legal obligation to pay. An insurer in National Union's position could rationally insist, in such a situation, on some independent verification of the validity and amount of the obligation to pay asserted as a basis for indemnity. The farther down the continuum from\n\ncontested judgment to voluntary payment the facts lie, the more difficult it will be to prove the existence of an \"amount which the insureds are legally obligated to pay.\"\n\nI. COVENANT NOT TO EXECUTE.\n\nNational Union asserts in essence that because, by virtue of the covenant not to execute, Toreson and Hoebich would never be required to pay XDP's claim, there was no \"amount which [Toreson and Hoebich] are legally obligated to pay\" and thus no \"loss\" for National Union to indemnify under the insurance contract, either directly under the policy or indirectly by responding in damages to XDP as the insureds' assignee.\n\nThe parties argue this issue in terms of the distinction between liability insurance policies (which provide what the Civil Code calls \"an indemnity against liability\" (Civ. Code, ยง 2778, subd. 1)) and indemnity insurance policies (which provide \"indemnity against claims, or demands, or damages, or costs\" (id., subd. 2); cf. generally, Gribaldo, Jacobs, Jones \u0026 Associates v. Agrippina Versicherunges A.G. (1970) 3 Cal. 3d 434, 446 [91 Cal. Rptr. 6, 476 P.2d 406]; 3 Cal. Insurance Law \u0026 Practice (1992 rev.) ยง 41.12[4], pp. 41-30, 41-31.)\n\nXDP argues that the D\u0026O policy is a liability policy and, as such, is subject to the well-established rule that upon breach of the insurer's duty to defend the insured may, in the absence of fraud and without forfeiting his or her right to be indemnified by the insurer, assign that right to the third party claimant in exchange for the claimant's covenant not to execute or otherwise enforce its claim against the insured. (Critz v. Farmers Ins. Group (1964) 230 Cal. App. 2d 788, 794- 799 [41 Cal. Rptr. 401, 12 A.L.R.3d 1142]; cf. Samson v. Transamerica Ins. Co. (1981) 30 Cal. 3d 220, 240- 241 [178 Cal. Rptr. 343, 636 P.2d 32].)\n\nNational Union argues, to the contrary, that the policy is an indemnity policy under which the right of Toreson and Hoebich to be indemnified would arise only after they had paid the amount of the liability asserted against them (Gribaldo, Jacobs, Jones \u0026 Associates v. Agrippina Versicherunges A.G., supra, 3 Cal. 3d at p. 447 [\"an indemnitor is not liable for a claim made against the indemnitee until the indemnitee suffers actual loss by being compelled to pay the claim\"]; cf. Civ. Code, ยง 2778, subd. 2), and that since the covenant not to execute removes any compulsion upon Toreson and Hoebich to pay the asserted liability National Union had no duty to indemnify Toreson and Hoebich.\n\nAlthough the question is undoubtedly close (cf. Note (1985) 32 UCLA L.Rev. 690, 691), a persuasive argument can be made for the Conclusion that\n\nthis is a liability policy. (Cf. Okada v. MGIC Indem. Corp. (9th Cir. 1986) 823 F.2d 276, 280; Mt. Hawley Ins. v. Federal Sav. \u0026 Loan Ins. Corp. (C.D.Cal. 1987) 695 F.Supp. 469, 474-475; Nat. Union Fire Ins. of Pittsburgh v. Brown (S.D.Fla. 1991) 787 F.Supp. 1424, 1429-1430; Note (1967) 80 Harv.L.Rev. 648, 651-653.) As such the policy would be subject to the general rule permitting the insured, without jeopardizing the enforceability of his or her claim, to assign it in exchange for a covenant not to execute.\n\nBut even were this court to agree with National Union that the policy requires indemnity only for losses already paid, it would not be obliged to agree with National Union that the covenant not to execute would ipso facto release National Union from any obligation to pay indemnification under the policy. Assuming, for purposes of analysis, that the settlement accurately reflected, and that the arbitration award and judgment sufficiently implemented, a legally enforceable obligation upon Toreson and Hoebich to pay an enormous sum to XDP, it would be an idle exercise to require Toreson and Hoebich to fund an actual cash payment to XDP and then to pursue their own right of indemnity against National Union. Given these admittedly hypothetical assumptions, the result would be essentially the same in either case: National Union would pay the sum, XDP would receive the sum, and Toreson and Hoebich would be neither wealthier nor poorer for the experience. In a sense Toreson and Hoebich may be regarded as middlemen, and the assignment and covenant not to execute may be regarded as mechanisms by which the transaction can be simplified by permitting the middlemen to withdraw in order to allow XDP to proceed directly against National Union. There is no apparent just purpose to be served by insisting, in these circumstances, on a hypertechnically literal payment from Toreson and Hoebich to XDP. One text implies that no more is required, in the indemnity insurance context, than that the liability of the person to be indemnified have been \"discharged by satisfaction of a judgment or otherwise.\" (3 Cal. Insurance Law \u0026 Practice, supra, ยง 41.12[4], pp. 41-30, fn. omitted.) To satisfy any perceived need to honor form, it might be said that Toreson and Hoebich did in fact discharge their liabilities to XDP by the very act of assigning their claims against National Union in return for a covenant not to enforce the liabilities.\n\nThe real issue as to damages attributable to unreimbursed loss under the insurance contract in this case is as to the weight to be given to the procedure, far short of a contested judgment, by which the parties other than National Union purported to fix the value of XDP's claim. The covenant not to execute may bear circumstantially upon the validity of transactions among XDP, Xebec, Toreson and Hoebich. (Cf., e.g., Smith v. State Farm Mut.\n\nAuto. Ins. Co., supra, 5 Cal. App. 4th at p. 1114 [validity of judgment for purposes of assignment of claim for breach of implied covenant of good faith and fair dealing]; Wright v. Fireman's Fund Ins. Companies (1992) 11 Cal. App. 4th 998, 1014-1016 [14 Cal. Rptr. 2d 588] [validity of judgment for purposes of direct action under Ins. Code, ยง 11580, subd. (b)(2)].) But the covenant not to execute does not ipso facto cause XDP's asserted claim for damages for breach of contract, or National Union's asserted obligation ultimately to pay the claim, to disappear.\n\nII. JUDGMENT OR ARBITRATION AWARD.\n\nThroughout the proceedings below, and in this court, XDP has taken the position that upon proof that National Union had breached the insurance contract and that other conditions of recovery existed, XDP (as the assignee of Toreson and Hoebich) was entitled to recover, from National Union, the full amount of the judgment entered on January 21, 1988.\n\nIn its instructions to the jury the trial court assigned to XDP the burden of proving, among other elements of its claim for breach of contract, that \"the settlement has been reduced to a judgment which defendant is obligated to pay under the terms of the insurance policy,\" but the court stopped short of saying that National Union would in any event be obliged to pay the full amount of any judgment XDP might prove. Nor did the court give the jury any further guidance as to how to recognize that a settlement had been \"reduced to a judgment\" or to determine that it was \"a judgment which defendant is obligated to pay under the terms of the insurance policy\" or that XDP had borne the burden of proving either element. In summation, as he had in objecting to this element of the burden of proof instruction before it was given, Bisset asserted that the judgment had been admitted in evidence and was therefore established without despute.\n\nA. LITIGATED JUDGMENT.\n\nIn some of its arguments XDP appears to regard the January 1988 judgment as tantamount to a fully litigated Disposition of contested proceedings.\n\nIf under a liability insurance policy the insured, denied a defense by the insurer, is forced to a contested trial and suffers an adverse judgment, as a general rule the insurer that wrongfully refused to defend will be liable to the insured in the amount of the judgment against him or her, plus his or her costs of defense. (Gray v. Zurich Insurance Co. (1966) 65 Cal. 2d 263, 279 [54 Cal. Rptr. 104, 419 P.2d 168]; Arenson v. Nat. Automobile \u0026 Cas. Ins. Co.\n\n(1955) 45 Cal. 2d 81, 84 [286 P.2d 816]; cf. also Samson v. Transamerica Ins. Co., supra, 30 Cal. 3d at p. 237.) The basis of this rule was spelled out in an early Court of Appeal opinion: \"The law is well settled that, where one is bound either by law or agreement to protect another from liability, he is bound by the result of a litigation to which such other is a party, provided he had notice of the suit and an opportunity to control and manage it. [Citations.] The judgment recovered in such a case is the mode by which the insured proves to the insurer that the intrinsic character of the accident was such that he was liable for the consequences of it, and the judgment is conclusive evidence that the insured was liable, and to the extent of the amount of the judgment. [Citations.]\" (Lamb v. Belt Casualty Co. (1935) 3 Cal. App. 2d 624, 631 [40 P.2d 311].) A judgment in an action which the insurer, with notice, refused to defend has been said to have collateral estoppel effect upon the insurer. (7 Witkin, Cal. Procedure (3d ed. 1985) Judgment, ยง 297, pp. 735- 736, citing Geddes \u0026 Smith v. St. Paul Mercury Indem. Co. (1959) 51 Cal. 2d 558, 561 [334 P.2d 881].) Citing this court's recent opinion in Thibodeau v. Crum (1992) 4 Cal. App. 4th 749, 755 [6 Cal. Rptr. 2d 27], XDP argues that in this case the arbitration award should also be given collateral estoppel effect.\n\nAside technical distinctions between liability policies and indemnity policies, it is clear enough that the D\u0026O policy in this case differed from an orthodox liability insurance policy at least in that it imposed on National Union not a duty to defend Toreson and Hoebich but only a duty to pay for their defense. National Union's practice, consistent with the policy language and with industry practice, was to permit the insured to select counsel and to control the defense. Nevertheless, an adverse judgment following a contested trial in which the insured presumably acted so far as possible to protect his or her interests would surely be a valid, and arguably the best, indicator of the fact and amount of the insured's liability and thus of the insurer's duty to indemnify the insured. If the insured, without the contribution to defense costs the insurer had contracted to provide, achieved a good result in defense against the claim, certainly the insurer could not complain; if, on the other hand, a good faith defense was rendered less effective by the insurer's failure to pay defense costs the insurer arguably should not be permitted to complain.\n\nBut none of these considerations is involved in this case, because there is no evidence of contested proceedings before either the arbitrators or the court. What happened, in short, was that defendants/insureds Xebec, Toreson and Hoebich arrived at a settlement with claimant XDP, that the settlement itself incorporated proposed forms to be used by the arbitrators\n\nand by the court to endorse the settlement, and that in brief and wholly uncontested proceedings the arbitrators, and subsequently the court, signed the forms created in the settlement process. None of the assurances of validity implicit in judicial proceedings openly contested to final judgment, or even in contested arbitration proceedings, were furnished by this process; if the January 1988 judgment had binding effect as against National Union, it must necessarily have achieved that effect in some manner other than by application of the general rule applicable to contested judgments.\n\nB. STIPULATED JUDGMENT.\n\nOf course parties may stipulate to a judgment binding as between them (Code Civ. Proc., ยง 664.6; California State Auto. Assn. Inter-Ins. Bureau v. Superior Court (1990) 50 Cal. 3d 658, 664-665 [268 Cal. Rptr. 284, 788 P.2d 1156] (CSAA)); had National Union entered into the stipulations embodied in the settlement in this case it would have been so bound. (50 Cal. 3d at pp. 664-665.) But National Union was in no sense a party to these stipulations. It is difficult to justify a Conclusion that in these circumstances the judgment had, or should be accorded, any significant with respect to National Union beyond that of the underlying settlement agreement.\n\nIn a series of rulings the trial court refused to give the judgment conclusive effect against National Union as a matter of law. In perhaps unintentional mitigation of the implication, in its burden of proof instruction, that XDP might establish a right to the full amount of the settlement by proving that the settlement had been \"reduced to a judgment which defendant is obligated to pay under the terms of the insurance policy,\" the court further instructed the jury, among other things, that given a breach of the insurance contract the insured might enter into a reasonable settlement and then seek indemnity for the amount of the settlement and later associated \"settlements and stipulated judgments\" in an instruction to the effect that a showing of collusion would render either of them irrelevant to National Union's indemnity obligation.\n\nOn appeal XDP renews its assertion that it was entitled, upon its breach of contract theory, to the full amount of the January 1988 judgment. Its primary argument is that National Union in fact received a sufficient opportunity to litigate collusion in the arbitration proceedings and before the superior court: \"If National Union believed that the stipulation and proposed award were collusive, it could have intervened in the arbitration to ask the arbitrators to reject them. Failing that, it could have intervened in the action to oppose confirmation of the award and entry of judgment. Failing that, it had six\n\nmonths to move to set aside the judgment under Code of Civil Procedure [section] 473.\" Because National Union did none of these things, XDP argues, National Union \"should have been precluded as a matter of collateral estoppel from contesting the amount of the underlying judgment against its insureds.\"\n\nXDP relies primarily on two cases: Clemmer v. Hartford Insurance Co., supra, 22 Cal. 3d 865 and State Farm Mut. Auto. Ins. Co. v. Superior Court (1989) 211 Cal. App. 3d 5 [259 Cal. Rptr. 50] (State Farm 1989).\n\nClemmer was a direct action (under subd. (b)(2) of Ins. Code, ยง 11580) by third party claimants against the insurer on a judgment previously obtained against the insured. The insured had shot and killed the claimants' decedent and had been convicted of murder; thereafter the claimants obtained a wrongful death judgment against the insured by default. The insurer had been aware of the shooting within a week after it occurred but was given notice of the wrongful death action only after the insured's default had been entered and one day before the proving-up hearing. The Supreme Court rejected the insurer's argument that in these circumstances the insurer could not be bound by the amount of the default judgment against its insured, reasoning that the insurer could have moved for relief from the default, at any time within six months, under Code of Civil Procedure section 473, and that its failure to seek adjudication of the damages in this way foreclosed its argument that it was not bound.\n\nNational Union perceives a significant distinction between the default judgment in Clemmer and the stipulated judgment in this case, arguing that the default proving-up proceeding preserved a semblance of independent adjudication under court supervision which is wholly lacking in this case. The point is well taken. Another point, which the parties have disputed in other contexts, is that National Union's options to pursue remedies to block or set aside the award and judgment entered in implementation of the settlement were severely limited by an obvious dilemma: On its face the settlement was highly advantageous to National Union's insureds Toreson and Hoebich, leaving them with a covenant not to execute which as a practical matter assured they would not be out of pocket. Any action National Union were to take in the consolidated arbitration proceedings on the RDA's, or in court proceedings to confirm the award, could benefit National Union only at risk to its insureds' beneficial settlement. Throughout these proceedings National Union has taken the colorable position that the only action it could take, consistent with its obligation of good faith toward its insureds, was to litigate in separate proceedings its assertion that it could\n\nnot be bound by the settlement, award, or judgment. These separate proceedings were commenced within three weeks after XDP obtained its stipulated judgment, and National Union has vigorously pursued its own interests, without jeopardizing the interests of Toreson and Hoebich, since then. This court need not fault National Union for its choice of tactics. Clemmer is distinguishable.\n\nState Farm 1989 involved the question whether an award made in judicial arbitration proceedings, and entered as a judgment against the insureds under Code of Civil Procedure section 1141.23, constituted a \"conclusive judicial determination\" of the insureds' liability, within the meaning of Moradi-Shalal v. Fireman's Fund Ins. Companies, supra, 46 Cal. 3d at pages 306, 313, for purpose of a surviving bad faith action under subdivision (h) of Insurance Code section 790.03 and Royal Globe Ins. Co. v. Superior Court, supra, 23 Cal. 3d 880. The Court of Appeal concluded that the judgment following judicial arbitration had the requisite effect and that the fact neither party had requested a trial de novo (Code Civ. Proc., ยง 1141.20, subd. (b)) did not make the judgment \"a 'stipulated judgment' which may not be considered a conclusive judicial determination.\" (211 Cal. App. 3d at p. 14.) The Court of Appeal then added the dictum on which XDP relies: \"In addition, it seems to us that a stipulated judgment, although the product of negotiation and agreement rather than contested proceedings, can satisfy the concerns expressed in Moradi- Shalal to the same extent as a judgment following a fully contested trial. [Citation.] The issue of liability is necessarily resolved by the agreed judgment unless it has been the product of fraud or collusion or the insurer was denied the opportunity to participate in and defend the action against its insured.\" (211 Cal. App. 3d at pp. 14-15, fn. omitted.) In a footnote, the Court of Appeal added that \"insurer participation would not be necessary in all cases. For example, it would not be required where the insurer has denied coverage and refused to provide a defense. In such a circumstance, the insured is free to agree with the claimant to a judgment resolving the issue of his liability which, if coverage is subsequently established, would constitute a final judicial determination of that liability binding upon the insurer even though it was not a party to the action or to the agreement. [Citation.]\" ( at p. 15, fn. 11; cf. also Sunseri v. Camperos Del Valle Stables, Inc. (1986) 185 Cal. App. 3d 559, 561-562 [230 Cal. Rptr. 23] [insurer would be bound by stipulated judgment, after notice, unless it could show either lack of coverage or fraud and collusion].)\n\nThe State Farm 1989 dictum must be read in light of the Supreme Court's opinion, one year later, in CSAA, supra, 50 Cal. 3d 658. CSAA dealt directly with the question State Farm 1989 had not been required to reach: Whether\n\na stipulated judgment would satisfy Moradi-Shalal 's requirement of a conclusive judicial determination for purposes of a subsequent surviving Royal Globe action. CSAA did not mention State Farm 1989 but, like State Farm 1989, spoke in terms of collateral estoppel. The Supreme Court reasoned that \"a stipulated judgment is indeed a judgment,\" involving judicial discretion at least insofar as it reflected a Judge's discretionary determination that the stipulation need not be rejected for reasons of public policy, and concluded that \"a stipulated judgment may properly be given collateral estoppel effect, at least when the parties manifest an intent to be collaterally bound by its terms. Where, as here, an insurer signs a stipulation in which the insured admits liability, that insurer is privy to the agreement and can be collaterally estopped from relitigating liability to the same extent as the insured. [Citations.]\" (50 Cal. 3d at pp. 664-665, fn. omitted.) In a footnote the Supreme Court touched on the situation where (as here) the insurer does not sign or otherwise join in the stipulation: \"Our holding is a narrow one. In the case before us the insurer both participated in the settlement and signed the stipulation. If, however, the insurer had not received reasonable notice of the settlement, or were not allowed to control the insured's defense in the proceedings, any stipulated judgment would only be presumptive evidence of the insured's liability. [Citations.] In such a case, the issue of an insured's liability would be subject to litigation in the section 790.03[, subdivision] (h) suit, thereby conflicting with the policies of Moradi-Shalal. \" ( at pp. 665-666, fn. 5; cf. also Studley v. Benicia Unified Sch. Dist. (1991) 230 Cal. App. 3d 454, 460 [281 Cal. Rptr. 631] [insurer not bound by stipulation in which it did not join and by which it explicitly stated it would not be bound].)\n\nPatently, the Supreme Court's somewhat narrower view, in CSAA, of the binding effect of a stipulated judgment should be taken to supersede the broader view of the Court of Appeal in State Farm 1989.\n\nCSAA apparently did not involve a covenant not to execute. The effect of that added element was squarely considered in Smith v. State Farm Mut. Auto. Ins. Co., supra, 5 Cal. App. 4th 1104, which involved (among several issues) two principal questions: Whether a stipulated judgment (not participated in by the insurer) entered into in consideration of a covenant not to execute will support an insured's assignment to a third party claimant of the insured's claim against the insurer for breach of the implied covenant of good faith and fair dealing; and whether such a judgment will satisfy Moradi-Shalal for purposes of a surviving Royal Globe action. The Court of Appeal answered both questions in the negative. Among other considerations in support of its Conclusions the Court of Appeal drew an analogy\n\nbetween the settlement before it and a similar arrangement which, according to another court, \" 'would be to invite collusion between the claimants and the insured' by allowing them to 'bootstrap[] their damages with the ingenious assistance of counsel.' \" (5 Cal. App. 4th at p. 1114, quoting from Doser v. Middlesex Mutual Ins. Co. (1980) 101 Cal. App. 3d 883, 892- 893 [162 Cal. Rptr. 115]; cf. also Wright v. Fireman's Fund Ins. Companies, supra, 11 Cal. App. 4th at p. 1023.)\n\nNeither CSAA nor Smith dealt directly with the issue of the effect of a stipulated judgment upon calculation of damages recoverable from an insurer for an asserted breach of the insurance contract, but certainly the cases provide clear guidance. It would be difficult to quibble with the principle, inferable from CSAA, that if the insurer has joined in the stipulation it may properly be bound by the figure to which it stipulated. Where the insurer did not join in the stipulation, a judgment based on the stipulation may be entitled to presumptive weight but should bind the insurer only to the extent it represents a true independent adjudication of the insured's liability. CSAA and Smith are relevant insofar as they indicate that for other, but certainly not wholly irrelevant, purposes, judgments based on stipulations in which the insurer did not join should not be regarded as binding adjudications of the insurer's interests, and that this should particularly be so where the stipulation was given for a covenant not to execute.\n\nThus, the stipulated judgment added no probative force, relevant to the issue of damages, to the settlement itself. Similar analysis requires a similar Conclusion as to the stipulated arbitration award.\n\nIII. PRESUMPTION FROM SETTLEMENT.\n\nThe next question is whether the settlement itself is material to the issue of damages.\n\nWhere, following breach of the insurance contract by the insurer, the insured has elected to settle rather than to risk an adverse judgment, it has been broadly suggested that he or she may sue the insurer \"to recover the amount of the settlement\" plus defense costs. (Clark v. Bellefonte Ins. Co. (1980) 113 Cal. App. 3d 326, 335 [169 Cal. Rptr. 832], citing many Court of Appeal cases; cf. also, Isaacson v. California Ins. Guarantee Assn. (1988) 44 Cal. 3d 775, 791 [244 Cal. Rptr. 655, 750 P.2d 297] [Ins. Code, ยง 1063-1063.14]; Walters v. American Ins. Co. (1960) 185 Cal. App. 2d 776 [8 Cal. Rptr. 665].) But although the insured (or his or her assignee) obviously can sue for the settlement amount, it is now clear that the settlement will not inevitably fix the amount the insured can recover but will instead give rise\n\nonly to a presumption as to the fact and amount of injury to the insured: \"In a later action against the insurer for reimbursement based on a breach of its contractual duty to defend the action, a reasonable settlement made by the insured to terminate the underlying claim against him may be used as presumptive evidence of the insured's liability on the underlying claim, and the amount of such liability. [Citations.]\" (Isaacson v. California Ins. Guarantee Assn., supra, 44 Cal. 3d at pp. 791-792 [Ins. Code, ยง 1063-1063.14]; cf. Kershaw v. Maryland Casualty Co. (1959) 172 Cal. App. 2d 248, 256-257 [342 P.2d 72]; cf. also American Title Co. v. Anderson (1975) 52 Cal. App. 3d 255, 261 [125 Cal. Rptr. 24]; Fidelity \u0026 Deposit Co. v. Whitson, supra, 187 Cal. App. 2d at pp. 757-758.)\n\nThe rationale for giving a settlement only presumptive effect was spelled out, in dictum, in an early Court of Appeal case: \"[W]here there is no trial and no judgment establishing the liability of the insured, but a settlement of the litigation has been made, the question whether the liability of the insured was one which the contract of insurance covered is still open, as is also the question as to the fact of liability and the extent thereof, and these questions may be litigated and determined in the action brought by the insured to recover the amount so paid in settlement. The settlement, or a judgment rendered upon a stipulation of such a settlement, becomes presumptive evidence only of the liability of the insured and the amount thereof, which presumption is subject to being overcome by proof on the part of the insurer. [Citations.]\" (Lamb v. Belt Casualty Co., supra, 3 Cal. App. 2d at pp. 631- 632.)\n\nTo rely on the presumption that the settlement accurately reflected the liability of Toreson and Hoebich to XDP and the amount of the liability for purposes of an action against National Union, XDP as the proponent of the presumption bore the burden of proving by a preponderance of the evidence the basic or foundational facts that the settlement (1) was occasioned by a breach of the insurance contract by National Union, (2) was valid with respect to National Union, and (3) was reasonable in the sense that it reflected an informed and good faith effort by the settling parties to reconcile their presumably differing views as to the relative strengths of their respective claims and defenses. Any issue as to the existence of any of these basic or foundational facts would be for the trier of fact--in this instance the jury--to resolve. (Cf. United Sav. \u0026 Loan Assn. v. Reeder Dev. Corp. (1976) 57 Cal. App. 3d 282, 296-297, 300 [129 Cal. Rptr. 113]; 1 Witkin, Cal. Evidence (3d ed. 1986) ยง 177, 179, pp. 150-151, 153-154; 2 BAJI (7th ed. 1986 bound volume) appen. C, pp. 335-338.)\n\nOnce the basic or foundational facts were established the effect of the presumption would depend on whether, under the Evidence Code, the presumption is to be classified as one \"affecting the burden of producing\n\nevidence\" (Evid. Code, ยง 603) or as one \"affecting the burden of proof.\" ( ยง 605; cf. generally Fisher v. City of Berkeley (1984) 37 Cal. 3d 644, 694-697 [209 Cal. Rptr. 682, 693 P.2d 261]; Rancho Santa Fe Pharmacy, Inc. v. Seyfert (1990) 219 Cal. App. 3d 875, 882-884 [268 Cal. Rptr. 505]; Hewitt v. Meaney (1986) 181 Cal. App. 3d 361, 367 [226 Cal. Rptr. 349]; United Sav. \u0026 Loan Assn. v. Reeder Dev. Corp., supra, 57 Cal. App. 3d 282, 296-297; 1 Witkin, supra, ยง 176-179, pp. 150-154; 2 BAJI, supra, appen. C, pp. 335-338.)\n\nIn this case a presumption affecting the burden of producing evidence would require National Union only to produce evidence sufficient to support a finding that the presumed fact (as distinct from the basic or foundational facts) did not exist: That the settlement did not accurately reflect the fact or amount of liability. It has been suggested that \"some quantum of evidence casting doubt on the truth of the presumed fact\" will suffice. (Rancho Santa Fe Pharmacy, Inc. v. Seyfert, supra, 219 Cal. App. 3d at p. 882.) Were the trial court to determine, preliminarily, that National Union had produced sufficient evidence, then the presumption would not be made known to the jury and XDP would be required to prove its damages without recourse to the presumption. ( at p. 882; United Sav. \u0026 Loan Assn. v. Reeder Dev. Corp., supra, 57 Cal. App. 3d at p. 301.) Procedurally, the trial court, before instructing the jury, will begin by determining whether the opponent of the presumption has produced evidence sufficient in any event to rebut the presumption: If so, then the question whether the basic or foundational facts have or have not been established will be moot.\n\nOn the other hand, a presumption affecting the burden of proof would require National Union to persuade the jury, by a preponderance of the evidence, that the settlement did not accurately reflect the fact or amount of liability. Rebuttal evidence sufficient to support a finding that the presumed fact does not exist would not cause the presumption to disappear: It would be for the jury, if it found the basic or foundational facts, then to decide whether it was persuaded by the opponent's rebuttal evidence.\n\nThe trial court instructed the jury that XDP had the burden of proving, among other things, \"that because the defendant breached the insurance contract after it received notice of the claim Toreson and Hoebich found it prudent to settle the claim which was being asserted against them,\" and gave the following additional instructions as to the significance of the settlement:\n\n\"If an insurance company is notified of a claim against its insured and the insurance company breaches the insurance contract the insured is entitled to\n\nmake a reasonable settlement of the claim in good faith and may then seek indemnity from the insurance company of the amount of the settlement.\n\n\"A reasonable settlement made by the insured with a third par[t]y claimant raises a presumption that the insured was liable to the third party in the amount of the settlement.\n\n\"Now, notice you must find both an insurance company breached the insurance contract and that the insured entered into a reasonable settlement before you may presume that the insured was liable to the third party in the amount of the settlement.\"\n\nThe court later gave a general definition of the term \"reasonable,\" but did not allocate the burden of proving that the settlement was or was not reasonable. The court gave no further instruction as to the meaning or effect of the \"presumption\" to which its settlement instructions referred.\n\nIn appropriate procedural sequence National Union's essentially alternative contentions with respect to the presumption from settlement are:\n\n(1) That the presumption is one affecting the burden of producing evidence, and that because National Union produced evidence sufficient to rebut the presumed fact the presumption disappeared from the case and the jury should not have been told about it.\n\n(2) That on the basic or foundational fact of the validity of the settlement with respect to National Union, (a) the evidence demonstrated as a matter of law that the settlement was collusive and therefore void, and in any event the trial court committed several instructional errors with respect to collusion; and (b) the settlement was void because Toreson and Hoebich entered into it in breach of the insurance contract.\n\n(3) That on the basic or foundational fact of the reasonableness of the settlement, (a) the evidence was insufficient to show Toreson and Hoebich entered into the settlement reasonably or in good faith; and (b) the trial court failed to define a reasonable settlement or to allocate the burden of proof as to reasonableness, implied in response to a jury question that the settlement could be presumed reasonable, and made other instructional errors.\n\nAdditional issues integral to these contentions are discussed in analytic sequence.\n\nA. CLASSIFICATION OF THE PRESUMPTION.\n\nNational Union argues first that the asserted presumption affected only the burden of producing evidence.\n\n\"Evidence Code section 603 defines a presumption affecting the burden of production as one 'established to implement no public policy other than to facilitate determination of the particular action in which the presumption is applied.' As the Law Revision Commission's comments to section 603 make clear, presumptions affecting the burden of producing evidence 'are not expressions of policy; they are expressions of experience. They are intended solely to eliminate the need for the trier of fact to reason from the proven or established fact to the presumed fact and to forestall argument over the existence of the presumed fact when there is no evidence tending to prove the nonexistence of the presumed fact.' [Citation.]\n\n\"Thus, when the party against whom such a presumption operates produces some quantum of evidence casting doubt on the truth of the presumed fact, the other party is no longer aided by the presumption. The presumption disappears, leaving it to the party in whose favor it initially worked to prove the fact in question.\n\n\"Evidence Code section 605 defines the presumption affecting the burden of proof as one 'established to implement some public policy other than to facilitate the determination of the particular action in which the presumption is applied, such as the policy in favor of establishment of a parent and child relationship, the validity of marriage, the stability of titles to property, or the security of those who entrust themselves or their property to the administration of others.'\n\n\"As commentators have recognized, presumptions backed by policy concerns are justifiably given greater weight under our state's scheme. 'Certainly if a presumption is not based on probability, but is based solely on social policy, there may be more, and not less, reason to preserve it in the face of contrary proof. A presumption based on social policy may need an extra boost to ensure that the policy is not overlooked in the face of some explanation given by the opponent.' [Citation.]\n\n\"Despite the laudable efforts of the Legislature to assist in classifying the burdens, determining which burden is involved is, to say the least, often confusing. As the Law Revision Commission noted in commenting on section 605, the burden of proof, like the burden of production, is frequently 'designed to facilitate determination of the action in which [it is] applied. Superficially, therefore, such presumptions may appear merely to be presumptions affecting the burden of producing evidence. What makes a presumption one affecting the burden of proof is the fact that there is always some further reason of policy for the establishment of the presumption.'\n\n[Citation.]\" (Rancho Santa Fe Pharmacy, Inc. v. Seyfert, supra, 219 Cal. App. 3d at pp. 882-883; cf. also Fisher v. City of Berkeley, supra, 37 Cal. 3d at p. 696; William Dal Porto \u0026 Sons, Inc. v. Agricultural Labor Relations Bd. (1987) 191 Cal. App. 3d 1195, 1210 [237 Cal. Rptr. 206].)\n\nIt is apparent that the presumption at issue here may be said to embody a rational inference that a valid settlement reflecting a reasonable accommodation of the parties' perceptions of the realities of their dispute will imply the existence and closely approximate the amount of an actual liability from the defendants to the plaintiff. In this sense the presumption might be said to be an \"expression[] of experience\" subject to characterization as affecting only the burden of producing evidence.\n\nBut it is also apparent that there clearly is, in this instance, \" 'some further reason of policy for the establishment of the presumption.' \" The presumption does not arise unless it is shown, in addition to the validity and reasonableness of the settlement, that the settlement was occasioned by the insurer's breach of the underlying insurance contract. Where such a breach has occurred, there is an obvious need, as a matter of policy, to permit the insured to protect his or her position by settling the third party's claim, so long as the settlement is in fact reasonable. The unacceptable alternative would be to compel the insured, following the insurer's breach, invariably to force the dispute to trial and thus to risk additional (and perhaps uninsured) exposure and to incur unnecessary expenditure of the insured's own money and of the state's overtaxed judicial resources. It is sound and rational to conclude that the burden of showing that the settlement does not reflect the fact and amount of the insured's liability should fall upon the insurer whose breach has occasioned the settlement. (Cf. Butler Bros. v. American Fidelity Co. (1913) 120 Minn. 157, 169 [139 N.W. 355, 359-360].)\n\nThe presumption is therefore properly to be classified as one affecting the burden of proof. It follows that mere production of evidence sufficient to support a finding that the presumed facts were false would not have sufficed to dispel the presumption: Upon proof of the foundational facts, National Union would have been required to persuade the jury by a preponderance of the evidence that the settlement did not accurately reflect the existence or amount of Toreson's and Hoebich's individual liability, as directors and officers, to XDP.\n\nB. FOUNDATIONAL FACTS.\n\nXDP as the proponent of the presumption bore the burden of proving by a preponderance of the evidence the basic or foundational facts that the\n\nsettlement (1) was occasioned by a breach of the insurance contract by National Union, (2) was valid with respect to National Union, and (3) was reasonable.\n\n(1) BREACH.\n\nNational Union does not directly question whether XDP did or could establish, in support of the presumption, that the settlement was occasioned by an antecedent breach, by National Union, of the insurance contract. But National Union does argue (with respect to the distinct foundational element of the validity of the settlement) that by entering into the settlement Xebec, Toreson and Hoebich breached the policy provision that \"[n]o . . . settlements shall be incurred without the Insurer's consent which shall not be unreasonably withheld . . .,\" and that the settlement was invalid for that reason.\n\nNational Union's contention begs the closely contested question whether it had wrongfully breached the insurance contract, and thus had in legal effect released Toreson and Hoebich to make \" 'a reasonable settlement of the claim in good faith' \" supportive of the presumption (Isaacson v. California Ins. Guarantee Assn., supra, 44 Cal. 3d at p. 791 [Ins. Code, ยง 1063-1063.14]), before the settlement was entered into. The trial court's instructions arguably advised the jury of the necessary sequence: The court told the jury that to recover on its contract theory XDP had the burden of showing \"that because the defendant breached the insurance contract . . . Toreson and Hoebich found it prudent to settle . . ..\" The jury was not asked to make a special finding on the issue, but its general verdict, coupled with the presumption that it followed the court's instructions, sufficiently imply that it found National Union breached the contract before Toreson and Hoebich entered into the settlement. Although the factual issue was undeniably close and difficult, for purposes of review this court must conclude that the evidence was sufficient to support the jury's implicit finding.\n\n(2) VALIDITY.\n\nTo have the benefit of the presumption XDP was obliged to prove that the settlement was valid as to National Union. In addition to its assertion that the settlement had been made in breach of the insurance contract, from the outset National Union took the position that the settlement was collusive and therefore void.\n\nThe trial court instructed the jury twice on collusion.\n\nFirst the court told the jury that \"[w]ith respect to the defense of collusion, the defendant has the burden of proving by a preponderance of the evidence\n\nall of the facts necessary to establish that the settlement was the result of an agreement between two or more persons to use the provision of law to obtain from the defendant an amount which was disproportionate to what the defendant would be obligated to pay under the policy, or to obtain some other benefit which they were otherwise not entitled to receive--they were not lawfully entitled to receive.\"\n\nA few minutes later the court instructed the jury as follows:\n\n\"The defendant asserts a separate affirmative defense that the settlement between the plaintiffs Toreson and Hoebich was collusive.\n\n\"Collusion is an agreement between two or more persons to defraud a person of his rights by the forms of law or to obtain an object forbidden by law. It implies the existence of fraud of some kind, the employment of fraudulent means or of lawful means for the accomplishment of an unlawful purpose, a secret combination, conspiracy or concert of action between two or more persons for fraudulent or deceitful purposes.\n\n\"To establish that the settlement was collusive the defendant must establish by a preponderance of the evidence the following:\n\n\"That the settlement was the result of an agreement between two or more persons to use the proceedings of law to obtain from the defendant an amount which was disproportionate to what the defendant would be obligated to pay under the policy, or to obtain some other benefits which they were otherwise not entitled to receive.\n\n\"Settlements and stipulated judgments which are the product of collusion convey no rights against the [insurer]. If you find the settlement in the underlying action was the result of collusion you must disregard it and not take it into account in determining what amount, if any, the defendant is obligated to pay under the insurance policy.\"\n\nThe jury was asked to make a special finding on collusion, and expressly found that the settlement agreement had not been collusive.\n\nNational Union does not question the trial court's definition of collusion (which essentially tracked instructions National Union had requested), but it attacks other aspects of the court's instructions, and the jury's special finding, on several grounds.\n\nNational Union argues that the settlement must be regarded as collusive as a matter of law. So far as relevant to the appeal, the thrust of this\n\ncontention must be that the jury's special finding must be reversed because as a matter of law the jury could not properly make it. Given the nature of the appellate function, this is a contention a reviewing court would endorse only in the clearest case. The case before the court unquestionably contains evidence from which a trier of fact might have found collusion, but this court is not a trier of fact. The record falls considerably short of compelling the finding of collusion National Union seeks.\n\nTo give National Union the benefit of any doubt, its point might be construed as an assertion that the jury's finding was not supported by substantial evidence.\n\nAnalysis of such an assertion would be affected by the applicable burden of proof in the trial court. If (as the trial court twice instructed the jury) the burden was on National Union to prove that the settlement was collusive, then the jury's finding need have been supported by nothing more than a rational Conclusion that National Union had failed to bear its burden, and this court would reverse only if collusion and thus, necessarily, that National Union had borne its burden) were demonstrated as a matter of law. The record does not so demonstrate.\n\nNational Union argues that the trial court misallocated the burden of proof. In National Union's view XDP had the burden of proving that the settlement was not collusive, and therefore the trial court's burden of proof instruction was erroneous. Although in the trial court National Union neither proposed an instruction allocating the burden of proof to XDP, nor expressly objected to the instruction the court gave, the point may be raised on appeal. (U.S. Roofing, Inc. v. Credit Alliance Corp. (1991) 228 Cal. App. 3d 1431, 1446-1447 [279 Cal. Rptr. 533]; cf. Code Civ. Proc., ยง 647.) National Union argues (1) that Ross v. Canadian Indemnity Ins. Co. (1983) 142 Cal. App. 3d 396, 404 [191 Cal. Rptr. 99], directly supports its position, (2) that as a policy matter XDP should have the burden because in the circumstances it had, and National Union could not have had, access to evidence relevant to the collusion issue (cf., e.g., Haft v. Lone Palm Hotel (1970) 3 Cal. 3d 756, 769-775 [91 Cal. Rptr. 745, 478 P.2d 465), and (3) that XDP clearly did have the burden of proving that the settlement on which it relies was, in various respects, reasonable, and \"this . . . burden of proof is functionally the same thing as a burden of negativing collusion.' \"\n\nNone of National Union's arguments are sufficient to offset the perception that in the circumstances of record collusion was, and in its pleadings and through the trial proceedings National Union treated it as, an affirmative\n\ndefense as to which, under the orthodox rule. National Union as the proponent of the defense had the burden of proof. (Cf. generally, Evid. Code, ยง 500.)\n\nRoss, a pleading case, does not hold to the contrary. In the course of reversing a judgment of dismissal upon a general demurrer sustained, the Court of Appeal observed that it could not resolve \"the issue of possible collusion\" on the pleadings but that (in circumstances generally comparable to these) unless the plaintiffs \"can demonstrate to the trial court that the stipulation of judgment and accompanying agreements were made in good faith\" the defendant's liability on the judgment would be limited. (142 Cal. App. 3d at p. 404.) This language falls considerably short of allocating the burden of proof is to an affirmative defense of collusion.\n\nThere is no compelling analogy between this case and the special circumstances of cases, such as Haft, in which an orthodox burden of proof has been shifted to accommodate both the realities of a particular situation and compelling considerations of public policy.\n\nThere is a certain logic to National Union's assertion that XDP's undeniable burden of proving that the settlement was reasonable should extend to and include a burden of disproving National Union's collusion defense: Certainly a settlement that was collusive, under the court's definition, could not be considered reasonable. On the other hand, proof that the settlement was not collusive obviously would not suffice, in and of itself, to demonstrate that the settlement was reasonable : The concepts overlap but do not coincide. National Union might have been satisfied to request (as it did) that the jury be instructed that XDP bore the burden of proving the settlement was fair and reasonable and to argue to the jury that because there was substantial evidence the settlement was collusive the jury could not find it to have been fair and reasonable. Instead, National Union elected, for apparent tactical reasons (perhaps including a perception that collusion could be argued to avoid the settlement altogether), to raise the narrower concept of collusion as an affirmative defense. National Union itself suggested a colorable distinction between the concepts: The reasonableness of the settlement would bear only on its availability as the basis for a presumption that it accurately states the fact and amount of the insured's liability; on the other hand a collusive settlement, being wholly void, would support neither assessment of damages nor the assignment to XDP which was intrinsic to the settlement and essential to XDP's standing in this court. Having elected to raise the narrower but potentially more significant issue of collusion, National Union was properly required to bear the burden of proving the defense.\n\nNational Union also challenges the court's instruction that if the settlement was found to be collusive the jury 'must disregard it and not take it into account in determining what amount, if any, the defendant is obligated to pay . . ..\" National Union had requested that the jury be instructed (among other things relevant to collusion) that \"[a] release and settlement which is collusive is void and unenforceable\" it argues on appeal that, rather than the instruction it gave, the trial court should have given National Union's instructions to the asserted effect \"that a collusive settlement was void in its entirety. \" National Union argues that the instruction the court gave was \"a 'formula instruction' and a nonsensical one at that,\" and that it was \"an invitation to the jury to engage in a kind of 'comparative collusion' test, eliminating those portions of the settlement that they found 'collusive.' \"\n\nNational Union's argument is difficult to follow. The cited instruction closely resembles another of National Union's requests and clearly advises the jury to disregard the settlement as a whole if it was collusive. In any event the point was mooted by the jury's finding that the settlement was not collusive: The jury gave itself no occasion to decide what to do about a settlement that was collusive.\n\n(3) REASONABLENESS.\n\nTo be entitled to presumptive effect on the issue of damages the settlement between the insured and the third party plaintiff must have been reasonable. (Cf. Isaacson v. California Ins. Guarantee Assn., supra, 44 Cal. 3d at p. 791 [Ins. Code, ยง 1063-1063.14].)\n\nAlthough often stated, the requirement of reasonableness appears never to have been clearly defined in the context of the presumption at issue here. Certainly, reasonableness is to be assessed primarily if not exclusively from the perspective of the insured who (or whose assignee) will thereafter seek to compel the insurer to pay or to reimburse the settlement amount. From the cases it may be inferred that the choice of settlement in preference to trial must itself be reasonable (cf. Walters v. American Ins. Co., supra, 185 Cal. App. 2d at p. 786; cf. also Critz v. Farmers Ins. Group (1964) 230 Cal. App. 2d 788, 801-802 [41 Cal. Rptr. 401, 12 A.L.R.3d 1142]), at least to the extent that the insured \"could not expect to escape at less cost by defending the suits\" (St. Louis Beef Co. v. Casualty Co. (1906) 201 U.S. 173, 182 [50 L.Ed. 712, 717, 26 S.Ct. 400]), and that the insured must settle upon \"the best terms possible\" (Zander v. Texaco, Inc. (1968) 259 Cal. App. 2d 793, 802 [66 Cal. Rptr. 561]). Obviously these considerations may be synthesized on the commonsense basis that an insured must have informed\n\nhimself or herself adequately as to the nature and viability of the third party's claims against him or her, may reasonably settle only if it will be to his or her personal advantage to do so, may not reasonably settle for more than the reasonably predictable cost of defending the action and paying the amount of the claim discounted by any reasonable likelihood that the third party will not prevail, and must in any event make good faith efforts to achieve the best--which is to say the least expensive--settlement possible in light of the circumstances known to the insured at that time.\n\n(A) SUFFICIENCY OF EVIDENCE.\n\nNational Union argues that XDP did not produce evidence sufficient to prove that Toreson and Hoebich had \"conducted a 'reasonable' or 'good faith' defense to the case against them . . ..\" National Union's argument is based on an implied-indemnity case, Sunset-Sternau Food Co. v. Bonzi (1964) 60 Cal. 2d 834 [36 Cal. Rptr. 741, 389 P.2d 133], which is distinguishable from this action in several respects. But as spelled out in National Union's briefing the argument raises the more pertinent contention that Toreson and Hoebich had not been shown to have acted reasonably or in good faith in entering into the settlement with XDP. Specifically National Union argued that by agreeing to submit to arbitration proceedings to which they were not contractually bound Toreson and Hoebich waived rights to discovery, jury trial, and effective appeal, that they agreed to be represented by the Orrick firm that was already representing defendants with interests inconsistent with Toreson's and Hoebich's, that they stipulated to liability which exceeded the prayer against them by $3 million and was based in large part on a corporate debt in excess of $5 million for which they were not liable as individuals, and that they also accepted liability for $800,000 in attorney fees for Bisset which may not have been incurred at all and in any event were not their responsibility. National Union also points to testimony to the effect that neither Toreson nor Hoebich believed he had any substantial personal liability.\n\nAll of these assertions are supported by evidence of record, and the evidence would unquestionably justify findings that the $9.8 million settlement figure (considered without reference to the covenant not to execute by which Toreson and Hoebich were effectively shielded from any financial exposure at all) did not reasonably reflect either the fact or the amount of any liability Toreson and Hoebich might have had as individuals. In this sense the evidence would have supported a Conclusion that the settlement (apart, again, from the covenant not to execute) was not reasonable from the perspective of insureds Toreson and Hoebich.\n\nBut this catalog of evidence supportive of findings the jury might have made in National Union's favor is essentially irrelevant, on appeal, to the question whether the evidence considered as a whole was sufficient to support a Conclusion that the settlement was reasonable in the requisite sense. Once again, this court is not a trier of fact: That this court might, as a trier of fact, have been persuaded by the evidence National Union enumerates is immaterial. The pertinent question is whether the record contains \"evidence . . . of ponderable legal significance\" that is \"reasonable in nature, credible, and of solid value\" (Estate of Teed (1952) 112 Cal. App. 2d 638, 644 [247 P.2d 54]) to support XDP 's contention that the settlement was reasonable.\n\nThe question is close, but this court is obliged by the constraints of its appellate role to conclude that in fact XDP produced evidence sufficient to support a finding of reasonableness and thus to pose an issue of fact for the jury to resolve one way or the other.\n\nThe dispositive question is whether the trial court's instructions sufficiently framed the issue for the jury.\n\n(B) INSTRUCTIONS.\n\nThe trial court instructed the jury that an insurer's breach permits its insured to make a \"reasonable\" and \"good faith\" settlement, and that to support a presumption that the insured was liable to the third party in the amount of the settlement, the settlement must be reasonable. But the court's only advice to the jury arguably relevant to how to determine whether the settlement was in fact reasonable was the following adaptation of a standard negligence instruction:\n\n\"Now, as used in this instruction the term 'reasonable' means what a person of ordinary prudence would do under the circumstances similar to these shown by the evidence.\n\n\"You will note that the person whose conduct we set up as a standard is not the extraordinarily cautious individual nor the exemplary skillful one but the person of reasonable and ordinary prudence.\n\n\"In determining whether an act or omission of a person constitute[s] a reasonable or an unreasonable act you must consider all of the surrounding circumstances shown by the evidence.\" (Cf. BAJI No. 3.10 [Negligence and Ordinary Care--Definitions].)\n\nThe court's instructions neither particularized reasonableness to settlement agreements nor allocated the burden of proof as to reasonableness.\n\nNational Union had requested the following instructions germane to these issues, none of which the court gave:\n\n\"The parties to the settlement owe a duty of good faith to any absent person or entity that has a financial interest in the amount of the settlement. The duty of good faith extends beyond fraud or dishonesty and encompasses any kind of unfair dealing.\"\n\n\"A settlement, to be one made in good faith, must strike harmony between the competing public policies encouraging settlements and the equitable sharing of costs among the parties at fault. The underlying question is whether the terms and amount of settlement represents a good faith determination of relative liabilities or responsibilities. If you find the underlying settlement is not reasonable, you must not be bound by it.\"\n\n\"The plaintiff has the burden of proving by a preponderance of the evidence all facts necessary to establish:\n\n\"\n\n\"9) That the settlement was made in good faith and that its terms fairly represent the proportionate liability of all defendants [in] the underlying action.\n\n\"\n\n\"12) That the terms and amount of settlement in the underlying action were reasonable and fairly represented the liability of the directors and officers in the underlying action, including damages, attorneys' fees and interest . . ..\"\n\n\"Plaintiff is required to demonstrate that the stipulated judgment and accompanying settlement agreements were made in good faith. If the plaintiff does not demonstrate that fact you must not consider the amount of the underlying judgment as evidence on Toreson's and Hoebich's liability to XDP, if any.\"\n\nIn the course of its deliberations the jury directed the following written questions to the court:\n\n\"1. Regarding the use of the word 'damage' in our questions [special findings form], does this refer to the 9.8 million dollar settlement?\n\n\"2. Do we base our award of damages solely on that amount?\"\n\nThe court responded, in writing, as follows:\n\n\"You have an instruction on the measure of damages. You also have an instruction on the circumstances under which you may presume that the settlement is reasonable. If under these instructions you find the settlement reasonable you must then find the proper measure of damages.\n\n\"In making a decision on the amount of damages you should take into consideration all of the evidence in the case, including but not limited to the amount of the settlement.\" (Italics added.)\n\nIt is immediately apparent that in the context of issues as complex as these the trial court's failure to advise the jury more precisely as to the meaning of a \"reasonable\" settlement, and its failure to instruct that the burden of persuading them that the settlement was reasonable was upon XDP as the proponent of the presumption, were potentially fatal omissions. National Union's instruction requests, while not wholly unobjectionable as to accuracy or form, were sufficient to raise and preserve the points for appeal. The court's reference, in answer to the jury's questions, to a nonexistent \"instruction on the circumstances under which you may presume that the settlement is reasonable\" could only have seriously exacerbated the situation. In net effect the jury was left at liberty to consider evidence which at best (from XDP's perspective) was closely balanced, on an issue pivotal to determination of the weight to be given the settlement in calculating damages, without adequate relevant guidance from the trial court.\n\nC. EFFECT OF THE PRESUMPTION.\n\nThe record contains evidence sufficient to support a finding that the settlement did not accurately reflect the fact or amount of Toreson's and Hoebich's liability, as individuals, to XDP (and thus their damages for breach of the insurance contract). Under guidelines developed by the Committee on Standard Jury Instructions. Civil, of the Los Angeles County Superior Court, the trial court should have instructed the jury that if it found the foundational facts, it must further find that the settlement did accurately reflect the damages incurred by Toreson and Hoebich as XDP's assignors unless National Union had produced evidence which persuaded the jury otherwise. (2 BAJI, supra, appen. C p. 337.)\n\nThe trial court gave no instruction at all on the effect of the presumption. The jury was left without guidance as to this crucial aspect of the damages case.\n\nIV. THE UNDERLYING MERITS.\n\nThroughout the trial the court and counsel debated the extent to which the jury should be made aware of the merits of XDP's claims against Toreson and Hoebich as individuals. XDP took the position that National Union should not be permitted to go behind the stipulated judgment of January 1988, while National Union repeatedly argued, in essence, that the merits of the underlying case should be fully tried to this jury. In pretrial rulings the trial court was equivocal: It denied XDP's in limine motion to preclude collateral attack upon the stipulated judgment, concluding that National Union should be permitted to try to convince the jury \"that indeed there was fraud and collusion.\" But in the same colloquy the court said that \"[i]t will be the object of this court to prevent us having to go back and to do a lot of relitigating of the matters that were involved. There are some issues having to do with now and how far the thing was put together, but I think we can focus on in a way that will preclude us from having to get in all the matters that are involved in the underlying arbitration.\" Similar equivocation characterized the trial proceedings. Substantial evidence on the underlying merits, much of it from witnesses called and exhibits tendered by XDP, was permitted to go to the jury; the trial court's theory appears to have been that the evidence was relevant primarily to National Union's theory that the settlement, award, and judgment were products of fraud and collusion. But the court also from time to time admonished the jury that (for example) \"we're not involved in the trial of issues involved in\" the RDA lawsuits and \"you're not hearing the lawsuit that was brought by XDP against Xebec, Toreson and Hoebich . . .,\" and limited the jury's consideration of evidence potentially relevant to the validity of XDP's claims against Toreson and Hoebich. And despite the substantial evidence the jury had received, not only as to the facts of the underlying dispute but also as to various witnesses' perceptions of the law applicable to those facts, the trial court refused all of National Union's several proposed instructions on the law pertinent to the liability of Toreson and Hoebich, as individuals, to XDP for the various elements of the settlement amount. The court gave no instructions at all as to the law material to the underlying dispute. After counsel summed up, and shortly before the jury retired, the trial court made quite clear to the jurors that its omission had been deliberate: \"Ladies and gentlemen, there is one part I do want to clarify, I made reference to it during the course of the trial but I wanted to say [it] to you again[. B]oth attorneys in their closing arguments have referred to the legal issues which were in dispute in the lawsuit, and the arbitration brought by [XDP] and Xebec, the underlying lawsuit. [P] You heard that in the arbitration that the parties had various legal theories having to do [with] whether Xebec or Toreson and Hoebich were\n\nrelated to [XDP] for breach of the contract or financial conversion having to do with the liability of corporate officers and directors. [P] You are not being called upon to decide whose theory was correct in the arbitration proceeding. You are not called upon to decide whether those legal theories on one side are more valid than the other side. Your responsibility is to decide whether or not the plaintiff or defendant have carried their respective burdens of proof on issues in this case. [P] You may, of course, consider the facts that the parties were asserting these legal theories against each other as circumstances under which the settlement took place, but I have fully instructed you on the law with respect to the issues in the case and the law that you should use for the purpose of deciding this case.\"\n\nOn appeal National Union asserts that the jury should have been permitted to consider the full merits of XDP's underlying claims against Toreson and Hoebich as individuals. The contention is well taken.\n\nNational Union argues that the underlying merits were relevant, in the first instance, to a determination whether a presumption from the fact of settlement would be available to XDP. In National Union's view the underlying merits bore directly on the questions (1) whether the settlement was collusive (and therefore invalid) and (2) whether XDP had proved that the settlement was reasonable.\n\nThe answers to these questions depended not directly on the underlying merits but rather on Toreson's and Hoebich's reasonably based perceptions of the underlying merits. If (for example) Toreson and Hoebich had been professionally advised, and on the basis of that advice had believed, that they were individually liable for all the claims XDP had made against the various RDA defendants, then arguably their settlement would have been reasonable in the requisite sense whether or not the professional advice was accurate. Similarly the existence of a collusive intent would depend not so much on the underlying merits as on what Toreson and Hoebich perceived the underlying merits to be: If their reasonable perception was that National Union would be obliged to pay no less than $9.8 million under its D\u0026O policy in any event, then arguably their decision to settle in such a way as to expose National Union to a claim in that amount could not be regarded as collusive even if Toreson's and Hoebich's reasonable perceptions were in fact wrong. The underlying merits would have some tendency in reason to support inferences that Toreson and Hoebich were or should have been aware of the merits, but (depending on other evidence) might not be dispositive.\n\nBut given that neither the stipulated arbitration award nor the stipulated judgment provided independent support for a finding of damages, the underlying merits were relevant to the damages issue whether or not XDP was able to invoke the presumption.\n\nIf XDP did invoke the presumption, affecting the burden of proof as to damages, the burden would have passed to National Union to persuade the jury that Toreson and Hoebich (as XDP's assignors) had not been injured by National Union's breach or at least that their damages should be less than the settlement amount. Under the insurance contract the ultimate measure of Toreson's and Hoebich's damages with respect to loss would be the amount they were legally obligated to pay to XDP. The presumption would approximate that amount on the basis of the settlement. To rebut the settlement figure National Union would be entitled to prove that on the underlying merits the settlement figure was wrong.\n\nIf, on the other hand, XDP had not succeeded in invoking the presumption, then the burden would have remained on XDP to prove the damages to its assignors, and it would have set about proving those damages in exactly the same way: by proving the underlying merits.\n\nBecause the question whether XDP had successfully invoked the presumption might not be resolved before the jury retired, it was incumbent on both sides to have made their best cases with respect to the underlying merits. Obviously their positions on the underlying merits would not have coincided: XDP's best case would be that Toreson and Hoebich were individually liable for all elements of XDP's claim, while National Union's would be that Toreson and Hoebich were not liable at all. Each side offered evidence to support its case, and the trial court, despite its occasional professions of a desire to limit such proof, let in most of the evidence tendered by the parties. National Union, as the party aggrieved with respect to this issue, has not identified specific evidence excluded.\n\nBut the evidence relevant to XDP's claims against the RDA defendants was only one element of the underlying merits. The complex interrelation of liabilities of the various corporate and individual defendants depended directly on how the law applied to the facts of the dispute. The merits would have represented a synthesis of facts and law, almost certainly to be arrived at in either of two ways: By asking the jury to make special findings relevant to XDP's claims against the RDA defendants, to which the trial court could subsequently apply the law, or by instructing the jury as to the law pertinent to XDP's underlying claims.\n\nThe trial court did neither. In the context of the evidence and instructions the jury did hear, the omission was fatal to a valid determination of XDP's damages. The issue of damages attributable to the \"loss\" provisions of the insurance policy must be retried.\n\nV. RETRIAL.\n\nIn Moradi-Shalal v. Fireman's Fund Ins. Companies, supra, 46 Cal. 3d 287 the Supreme Court required that the insured's liability to a third party asserting a surviving Royal Globe claim have been conclusively determined in prior separate judicial proceedings, and made clear that a prior settlement would not meet the requirement of a conclusive judicial determination. In rationalizing its Conclusions the Supreme Court made the points, among others, that if the insured's liability were left to be litigated in the Royal Globe action itself, both the existence of insurance and the fact of any prior settlement could improperly influence the jury in its consideration of the liability issue. (46 Cal. 3d at pp. 311-312.)\n\nSimilar concerns have been raised both legislatively (cf. Evid. Code, ยง 1152, 1155) and judicially (cf., e.g., Smith v. State Farm Mut. Auto. Ins. Co., supra, 5 Cal. App. 4th at p. 1112) in other contexts, and were adverted to by the parties at trial of this action. Upon retrial the problem will be directly encountered: The jury will necessarily be made aware of the insurance coverage which is essential to XDP's claims, and of the settlement which XDP may legitimately tender to establish a rebuttable presumption as to damages, as it considers whether Toreson and Hoebich, as individuals, were legally obligated to pay XDP's claims arising out of the RDA's.\n\nThe solutions courts have devised in the context of surviving Royal Globe claims (Moradi-Shalal v. Fireman's Fund Ins. Companies, supra, 46 Cal. 3d at p. 306) and of assigned claims for violation of the implied covenant of good faith and fair dealing (Smith v. State Farm Mut. Auto. Ins. Co., supra, 5 Cal. App. 4th at pp. 1112-1114) are not readily adaptable to the situation of this case. Here XDP, as the beneficiary of an orthodox assignment of rights, has successfully asserted that National Union breached its insurance contract. All of the elements the confluence of which has concerned courts and legislators in the past are directly relevant to the determination whether, and if so in what amounts, XDP's assignors were damaged. Even were this court inclined to \"fashion procedural rules avoiding this result\" (Smith v. State Farm Mut. Auto. Ins. Co., supra, 5 Cal. App. 4th at p. 1112) in an orthodox breach of contract action, it would be far too late to apply such rules, in fairness to both parties, in this case.\n\nThe crux of the problem is the perceived potential reaction of jurors, in assessing the liability of the insureds, to information that the insureds were in fact insured and had in fact agreed to compromise their claims. The best available solution to the problem would be to make clear to the jurors why\n\nthe insurance and the settlement are relevant in this case, and to emphasize to the jurors that neither the insurance nor the settlement should be considered for any other purpose. Both technical and tactical considerations arising out of the actual trial proceedings will enter into decisions whether such instructions should be given and (if so) how they should be phrased. This court will not direct such instructions, but having identified the issues will leave them to the trial court and counsel at retrial.\n\nB. DEFENSE COSTS.\n\nBy its second count XDP sought to recover defense costs, almost all of them attorney fees, incurred by Toreson and Hoebich in defending against, and ultimately in settling, XDP's claims based on the RDA's. Neither the settlement, nor the arbitration award or judgment integral to the settlement, extended to these readily ascertainable costs. But insofar as subject to the D\u0026O policy's provision for payment by National Union subject to its consent \"which shall not be unreasonably withheld,\" the costs were potential elements of Toreson's and Hoebich's damages attributable to National Union's breach of the insurance contract.\n\nNevertheless, the trial court, hearing the defense costs issues in bifurcated nonjury proceedings after the jury returned its verdicts, ruled that XDP could not recover Toreson's and Hoebich's defense costs \"because the insureds failed to comply with independent contractual requirements on their part to be performed in order to be entitled to be indemnified for attorney's fees.\"\n\nOn appeal XDP asserts that the court was wrong and that XDP should be permitted to recover the costs.\n\nXDP subdivides its argument on the basis of its perception of the court's reasons for its rulings. National Union acquiesces in the organization XDP has adopted, which rationally reflects rulings and remarks the court made in the course of the trial proceedings.\n\nI. THE ORRICK FIRM'S FEES AND DISBURSEMENTS\n\nSo far as the record reflects, the only defense representation Toreson or Hoebich received in these proceedings before September 15, 1987, was provided by the Orrick firm. The Orrick firm effectively withdrew from the representation as of September 15; the record does not indicate that Toreson and Hoebich incurred any financial obligation to the Orrick firm thereafter.\n\nXDP discusses the Orrick firm's fees and disbursements in two increments: Those incurred before XDP filed the Toreson-Hoebich lawsuit (on Mar. 19, 1987), and those incurred thereafter.\n\nA. BEFORE MARCH 19, 1987.\n\nConsistent with views it had intimated during the trial, the trial court instructed the jury that the 1985 Crary lawsuit \"did not assert that the directors or officers of Xebec had committed any wrongful conduct, and thus did not constitute a claim which was covered by the insurance policy issued by [National Union][;] therefore, no duty by [National Union] to pay defense costs arose as a consequence of that lawsuit. [P] Any questions as to whether [National Union] breached any duty to its insured must be based upon its conduct after March of 1987 when the lawsuit entitled [XDP] versus Toreson and Hoebich was filed.\"\n\nXDP reasonably concludes that with respect to the period before the Toreson-Hoebich lawsuit was filed the trial court's ruling denying recovery of defense costs was based primarily on the perception that no duty to pay defense costs had arisen during that period. XDP argues that the perception was incorrect: In XDP's view, notice of the Crary lawsuit imposed upon National Union a duty of reasonable investigation which would have disclosed \"that Toreson and Hoebich personally were directly involved and had potential liability within the scope of the D\u0026O policy and therefore that National Union had an immediate corresponding duty to advance defense costs.\" XDP relies on liability insurance cases in which a duty to defend was held invocable by facts, from any source, known or discoverable by reasonable investigation. (CNA Casualty of California v. Seaboard Surety Co. (1986) 176 Cal. App. 3d 598, 606 [222 Cal. Rptr. 276]; California Shoppers, Inc. v. Royal Globe Ins. Co. (1985) 175 Cal. App. 3d 1, 37-38 [221 Cal. Rptr. 171]; cf. also, Standard Oil Co. of California v. Hawaiian Ins. \u0026 Guaranty Co., Ltd. (1982) 65 Hawaii 521, 527 [654 P.2d 1345, 1349].)\n\n(1) ALLOCATION\n\nAn initial difficulty with XDP's argument is the frailty of its assumption that Toreson and Hoebich incurred, or had any occasion to incur, defense costs before they first were named as defendants in March 1987.\n\nXDP argues in essence that virtually all of the Orrick firm's work \"related to the defense of the case as a whole on behalf of all defendants,\" and therefore that the costs could fairly be charged to National Union without allocation.\n\nThe argument gives short shrift to the provisions of the D\u0026O policy and to undisputed evidence of industry practice under D\u0026O policies such as this one. In short, the policy and industry practice permit insureds under D\u0026O\n\npolicies to make their own arrangements for defense, subject only to a reasonable opportunity for the insurer to give or to withhold consent to payment of the cost of the defense. Implicit in this arrangement is an assumption that the insured will be aware of the need for defense and will make that need known to the insurer. There is no evidence that Toreson or Hoebich needed or was provided a defense, in any matter other than the essentially unrelated Heideman lawsuit, before March 1987. It would be wholly unworkable, and at variance with the policy language and with understood and accepted industry practice, to hold that a D\u0026O insurer may be bound to pay, without notice or advance consent, the cost of legal work done for defendants other than the insured solely on the basis that the work ultimately proved to have been beneficial to the insured.\n\n(2) NOTICE\n\nAside the allocation problem, XDP's argument for what might be called inquiry notice based on the Crary lawsuit is flawed in several respects. Primarily, it fails to give appropriate weight to the distinction between the historically broad duty to defend embodied in most California liability insurance policies and the considerably narrower duty to pay defense costs incorporated in this and similar D\u0026O policies. The liability policies to which XDP's cases relate contemplate the insurer's duty to protect its insured from even a tenuous assertion of liability; in that context it is rational to require an insurer with notice of facts that reasonably imply a potential assertion of liability to make further inquiry, at risk of being held responsible on the basis of the facts such inquiry would have developed. The situation is significantly different where, as under this D\u0026O policy, management and control of the defense--including, implicitly, the power to decide whether to interpose a defense at all--remains with the insured and the insurer is simply required, on appropriate notice, to fund or to reimburse the cost of the defense the insured elects to undertake. In all but the clearest case it would serve no sound purpose to expect the D\u0026O insurer before actual notice, to attempt to divine whether the insured will ultimately need, or want, a defense.\n\nMore fundamentally, in all but the clearest case questions whether the circumstances were sufficient to put the insurer on inquiry, and (just as relevantly) whether reasonable inquiry would turn up facts sufficient to make clear that the insured would need and want to defend himself or herself, will be essentially factual. (Cf. Span, Inc. v. Associated Internat. Ins. Co. (1991) 227 Cal. App. 3d 463, 482 [277 Cal. Rptr. 828].) XDP's suggestion that in this case the facts were so clear as to leave only a legal question\n\nsusceptible of being answered de novo in this court must be rejected. The question whether Toreson and Hoebich were subject to liability as individuals remained open, and closely contested, throughout the trial of this action more than four years after the Crary lawsuit was filed. Indeed, XDP and its principals did not themselves undertake to pursue claims directly against Toreson and Hoebich for more than a year after Crary filed the initial lawsuit. The Crary complaint does not hint at individual liability. National Union arguably took the most rational course by asking that Xebec notify it in the event any individual director or officer was named as a defendant. The trial court implicitly resolved the factual issue against inquiry notice. This court will not disturb the trial court's amply supported factual finding.\n\nB. AFTER MARCH 19, 1987.\n\nThe trial court made clear that in its view the policy required, as a condition precedent to a duty to pay defense costs, that National Union be given notice of the claim (and, implicitly, of the insureds' determination to defend themselves). The jury found, on uncontradicted evidence, that Xebec, Toreson and Hoebich had failed to give notice of the claim against Toreson and Hoebich. XDP acknowledges that, with respect to costs of defense that Toreson and Hoebich unquestionably did incur between March 1987 and first notice to National Union on September 24, 1987, the trial court based its denial of defense costs on the fact National Union had not received actual notice.\n\nXDP argues that lack of notice was rendered inconsequential by the jury's additional finding that the omission had not prejudiced National Union.\n\nBut the existence or absence of prejudice to National Union is simply irrelevant to National Union's duty to indemnify costs incurred before notice. The policy plainly provides that notice is a condition precedent to the insured's right to be indemnified; a fortiori the right to be indemnified cannot relate back to payments made or obligations incurred before notice. Plainly, the indemnity provisions of the policy extend not only to \"loss\" as defined but also to defense costs, and the notice provision makes particular sense with respect to defense costs in light of the policy's specific provision for reasonable consent before costs may be incurred. The prejudice requirement, discussed in detail above, applies only to the insurer's attempt to assert lack of notice as a policy defense against payment even of losses and costs incurred after belated notice. Again the rule makes sense: The fact that notice, received before the indemnifiable event was not given \"as soon as\n\npracticable in writing\" should not cut off the unaccrued indemnification right so long as the delay did not compromise the insurer's own policy rights.\n\nII. HAUN'S FEES AND DISBURSEMENTS.\n\nAfter the Orrick firm withdrew in mid-September 1987, such representation as Toreson and Hoebich received was provided by Haun. Insofar as incurred before Haun called Kristiansen on September 24, Haun's fees and disbursements were properly held unrecoverable for the reasons applicable to the Orrick firm's. But the trial court had a simpler basis for denying recovery of all of Haun's fees and disbursements in this matter, regardless when incurred: The court had excluded evidence, for this purpose, of the amount of Haun's fees and disbursements, upon the narrow ground that in the course of discovery XDP had asserted an attorney-client privilege as to Haun's billing materials and that it would be unfair to National Union to permit XDP to withdraw the claim of privilege and thus to make the evidence available to itself, once trial had begun.\n\nXDP attacks the trial court's order. XDP characterizes the order as a form of discovery sanction and argues that National Union had not been prejudiced by Haun's failure to produce the materials until he was called as a witness at trial, and that inasmuch as there had been no motion to compel the discovery in question the trial court had no authority to impose sanctions at trial. XDP points out that National Union, having received the materials from Haun at trial, in fact made use of them to cross-examine him and then referred to the materials in summation.\n\nThe relevant record is so sketchy as to make review of XDP's contentions difficult.\n\nXDP's complaint made clear that XDP sought recovery, under the insurance contract as well as upon a theory of breach of the implied covenant of good faith and fair dealing, of \"[e]xpenses, including attorneys' fees and disbursements paid or payable to Orrick and other counsel, relating to the defense of Toreson and Hoebich with respect to XDP's claims . . ..\"\n\nIn discovery National Union formally demanded that XDP produce, at deposition, \"[a]ll documents relating to payments by Xebec and any of its subsidiaries on behalf of itself and any of its subsidiaries for attorneys' fees and expenses incurred in the Crary and related proceedings . . .,\" and \"[a]ll documents relating to payments by Xebec Partners, . . . Toreson and . . . Hoebich and any subsidiaries on behalf of itself and any of its subsidiaries for attorneys' fees and expenses incurred in the Crary and related proceedings . . ..\"\n\nIt sufficiently appears that either Haun or Xebec, or both, had in their possession, at the time this discovery demand was made, billing materials which reflected Haun's charges for fees and disbursements in defense of Toreson and Hoebich. XDP does not deny that a full response to National Union's document demands would have included the Haun materials.\n\nThe record indicates that the deposition notice gave rise to a classic take-no-prisoners discovery dispute, but what ultimately came of the dispute, and particularly of the document demands, is not wholly clear. Unfortunately, it appears that much of the trial colloquy between court and counsel that might have shed light on the issues was unreported. XDP called Haun as a witness; during his direct examination the court declared the evening recess and then, out of the jury's presence, permitted counsel to inquire about the billing materials. Counsel for XDP represented that shortly before trial Xebec had withdrawn its previous assertion of attorney- client privilege with respect to certain matters apparently including Haun's billing materials; Haun testified that he would not have turned over the billing materials before Xebec waived the privilege. Counsel then tendered the materials as an exhibit and National Union objected that it had received the materials only that morning despite having requested them on discovery.\n\nThe court appears to have inferred that Xebec (and by association of interests Toreson and Hoebich), through XDP as their assignee, had formally asserted the attorney-client privilege in response to the document demand and now proposed to waive the privilege. The court concluded that the evidence should not come in. The crux of its reasoning: \"I have to regard it as though Toreson and Hoebich holding the privilege said I'm not going to tell you what my claims are prior to trial. And then at the point of trial they come in and say and now here is the amount that I had to pay and I want that included in the damages against this defendant and it seems to me that having withheld it onto [ sic ] the grounds of privilege before they cannot on the day of trial waive the privilege and say and now I wanted it as damages. . . . [P] It's not a question of fault . . .. What it is is a question of fairness . . ..\"\n\nAssuming the trial court's inference as to what occurred was sound, the trial court's ruling patently was not in the nature of a discovery sanction. The statutory discovery power extends only to matters \"not privileged\" (Code Civ. Proc., ยง 2017, subd. (a)), and at least as a practical matter any party called upon to respond to discovery may, without risk of sanction, withhold discovery on the basis of a colorably asserted privilege. (Cf. generally, 2 Hogan, Modern Cal. (Discovery 4th ed. 1988) ch. 12, Privilege,\n\npp. 53-190.) Ordinarily a legitimate claim of privilege would be adhered to at trial, and the evidence (no matter how relevant) would be kept from the trier of fact for policy reasons deemed persuasive by the Legislature.\n\nA party who asserts a privilege as to evidence essential to some element of his or her case will usually be obliged as a practical matter to forsake that element; his or her decision to do so will have been a necessary part of the decision to assert the privilege. But at least in circumstances such as those before the court here, the party cannot have it both ways: He or she cannot assert the privilege in discovery and then (having as a practical matter denied the adversary's legitimate discovery rights) waive the privilege and offer the proof at trial without taking or suffering steps appropriate to cure the prejudice to the adversary. Here, the trial court implicitly, and reasonably, concluded that, on the tenth day (already spread over a period of nearly a month) of a jury trial of complex issues with enormous amounts at stake, it was too late to do anything to mend the prejudice to National Union and that XDP must simply be required to abide by its assertion of privilege. The order was well within the court's broad inherent powers to control the proceedings before it; the technical rules of statutory discovery sanctions were inapplicable. National Union's subsequent use of the billing materials was entirely consistent with the court's Conclusion that it would be unfair to permit XDP to use them for a considerably different purpose.\n\nIn its reply brief XDP argues, somewhat disingenuously, that it never asserted the privilege with respect to these billing materials, that it was Haun who asserted the privilege, and that XDP \"could not have produced Haun's bills because they were not within its possession, custody or control; indeed, XDP was not even aware that they existed.\" Whether or not XDP was aware of Haun's billing materials, or played any part in refusing a document demand directed to XDP rather than Haun, it is clear that XDP was perfectly prepared to seek nearly $80,000 in additional damages on the basis of the materials and that the arguments it now seeks to raise should have been raised, and resolved, in the trial court. This court cannot quibble with the Disposition the trial court reached.\n\nIt should be noted that for purposes of retrial of the damages issues the fairness problem has been resolved: National Union has had access to Haun's billing records since the time of the first trial. On retrial XDP may again seek recovery of Haun's fees and costs under the insurance contract, and Haun's billing records, if otherwise admissible, should not now be excluded from evidence on the basis of fairness.\n\nBREACH OF IMPLIED COVENANT OF GOOD FAITH AND FAIR DEALING\n\nXDP's second major theory was that by refusing to pay its insured's defense costs or to participate in the proposed settlement National Union had breached the covenant of good faith and fair dealing implicit in its insurance contract with its insureds Xebec, Toreson and Hoebich, and that on this basis XDP, as the assignee of the insureds, was entitled to recover the damages to which Xebec, Toreson and Hoebich would have been entitled by virtue of the breach.\n\nXDP initially pled this theory broadly enough to suggest it claimed (in accordance with the orthodox measure of recovery for breach of the implied covenant of good faith and fair dealing in the insurance context) any assignable damages proximately caused the insureds by the breach. (Cf. Neal v. Farmers Ins. Exchange (1978) 21 Cal. 3d 910, 925 [148 Cal. Rptr. 389, 582 P.2d 980]; Brandt v. Superior Court (1985) 37 Cal. 3d 813, 871 [210 Cal. Rptr. 211, 693 P.2d 796]; Comunale v. Traders \u0026 General Ins. Co., supra, 50 Cal. 2d at p. 660.) But at trial XDP limited its claim for breach of the implied covenant to recovery of attorney fees and litigation costs in two increments: Those incurred by Toreson and Hoebich after National Union refused to pay them; and the costs XDP itself incurred to pursue, as assignee, insurance benefits due Toreson and Hoebich Consistent with this limitation and with the parties' stipulation that determination of the amounts of allowable fees and costs would be bifurcated for separate nonjury trial after the verdict, the jury was instructed concerning the implied covenant and was asked to make special findings relevant to breach and to allocation of damages, but was neither given a measure of damages nor asked to fix damages for breach of the implied covenant.\n\nA number of interesting issues are suggested by XDP's theory and the procedures under which it was tried. Among them are (1) whether this court should follow the apparently applicable holding of the First District, Smith v. State Farm Mut. Auto. Ins. Co., supra, 5 Cal. App. 4th at pages 1112-1115, that before an insured can validly assign his or her claim for breach of the implied covenant of good faith and fair dealing the insured must either have suffered an adverse judgment or at least have been required to pay a monetary settlement, and that the requirement of an adverse judgment cannot be satisfied by a stipulated judgment for which the insured received a covenant not to execute, and (2) whether countervailing claims of breach of the reciprocal implied covenant of good faith and fair dealing may be compared and offset under principles analogous to those stated in Li v. Yellow Cab Co. (1975) 13 Cal. 3d 804 [119 Cal. Rptr. 858, 532 P.2d 1226, 78\n\nA.L.R.3d 393]. (Cf., e.g., California Casualty Gen. Ins. Co. v. Superior Court (1985) 173 Cal. App. 3d 274, 283-284 [218 Cal. Rptr. 817]; Patrick v. Maryland Casualty Co. (1990) 217 Cal. App. 3d 1566, 1572-1573 [267 Cal. Rptr. 24].) But the court need not reach these issues: As a matter of law in the circumstances of record XDP should not have recovered either increment of attorney fees or costs in any event.\n\n1. FEES AND COSTS INCURRED BY TORESON AND HOEBICH.\n\nAs a practical matter all fees and costs incurred by Toreson and Hoebich, after National Union refused (on and after Sept. 25, 1987) to pay defense costs, were for Haun's services. The trial court properly concluded that XDP's assertion of the attorney-client privilege as to Haun's billing records foreclosed proof of Haun's fees and costs at trial. Now that National Union has had access to the billing records the evidence may properly be admitted at retrial, but the question of recovery of Haun's fees and costs may be resolved as part of the issue of damages for breach of contract which must in any event be retried: It would be unnecessary, and potentially confusing to the jury, to reopen XDP's theory of breach of the implied covenant of good faith and fair dealing for this narrow purpose.\n\n2. XDP'S OWN FEES AND COSTS.\n\nXDP persuaded the trial court to award it attorney fees it incurred to maintain this action against National Union. Its theory of recovery, based on Brandt v. Superior Court, supra, 37 Cal. 3d at page 819, was (as restated in this court) that \"[p]ursuant to the jury's special finding that National Union acted unreasonably, XDP was entitled to recover the attorneys' fees and other expenses that it incurred in enforcing its contractual rights against National Union.\"\n\nBrandt does not support recovery of XDP's attorney fees for pursuing the claims assigned to it by National Union's insureds. XDP suggests no other theory of recovery, and no other theory appears.\n\nBrandt held that \"[w]hen an insurer tortiously withholds benefits, . . . attorney fees, reasonably incurred to compel payment of the policy benefits, [are] recoverable as an element of the damages resulting from such tortious conduct.\" (37 Cal. 3d at p. 815.) Brandt explained that \"[w]hen an insurer's tortious conduct reasonably compels the insured to retain an attorney to obtain the benefits due under a policy, it follows that the insurer should be liable in a tort action for that expense. The attorney's fees are an economic loss--damages--proximately caused by the tort. [Citation.] These fees must\n\nbe distinguished from recovery of attorney's fees qua attorney's fees, such as those attributable to the bringing of the bad faith action itself.' (37 Cal. 3d at p. 817.)\n\nXDP's characterization of its rights against National Union is imprecise. It has no \"contractual rights\" against National Union. Nor has it, strictly speaking, rights of recovery based in tort. Until it received assignment of the insureds' rights. XDP was simply a third party claimant: A stranger to the policy and to the parties to the insurance contract. Once it received the assignment, and assuming for purposes of analysis that the assignment (in the context of asserted breach of the implied covenant of good faith and fair dealing) was valid, it had and could assert only those rights the insureds had had, and it could assert the rights only in the stead of the insureds.\n\nIf National Union had tortiously withheld insurance benefits from Xebec, Toreson and Hoebich, and if Xebec, Toreson, or Hoebich had incurred attorney fees to compel payment of those benefits, then Xebec, Toreson or Hoebich arguably would have had claims for those attorney fees as tort damages, under Brandt, although whether those claims could have been assigned to XDP is problematic. (Cf. Murphy v. Allstate Ins. Co. (1976) 17 Cal. 3d 937, 942 [132 Cal. Rptr. 424 155 P.2d 584].) But there is no showing that any of the insureds incurred attorney fees to compel payment of benefits, as clearly distinguishable from attorney fees incurred to resist XDP's claims for misappropriation of research moneys.\n\nOnce the claims of Xebec, Toreson and Hoebich asserted against National Union had been assigned to XDP, XDP could elect to sue on those claims and it did so elect. But the fees it thus incurred cannot be construed as tort damages to XDP, because National Union had no duty to XDP to pay policy benefits to anyone. XDP was simply bringing what amounted to a collection action on assigned claims, and no right to claim attorney fees incurred to bring such an action has been shown.\n\nINSURANCE CODE SECTION 790.03\n\nXDP's third major theory was that it was entitled to civil remedies for National Union's asserted breach of provisions of subdivision (h) of Insurance Code section 790.03, both in XDP's own right (as a nonparty to the insurance contract and thus a third party claimant) and as an assignee of the insureds' first party claims for bad faith insurance practices.\n\nSuch claims were validated by the Supreme Court in Royal Globe Ins. Co. v. Superior Court, supra, 23 Cal. 3d 880, but the validation was short-lived:\n\nIn Moradi-Shalal v. Fireman's Fund Ins. Companies, supra, 46 Cal. 3d at page 306, the Supreme Court prospectively abrogated the Royal Globe theory of civil recovery, permitting then-pending (or surviving) Royal Globe claims to proceed subject to a requirement that, as a condition precedent to maintenance of a third party Royal Globe claim, there have been a prior \"conclusive judicial determination\" that the insured was liable to the third party.\n\nMoradi-Shalal was decided in August 1988, several months after this action was filed; accordingly XDP's Royal Globe claims survived subject to the Moradi-Shalal limitations. In the trial court National Union argued, and the trial court ultimately agreed, that both XDP's third party and first party Royal Globe claims must fail for want of a prior conclusive judicial determination that Xebec, Toreson and Hoebich were liable to XDP.\n\nOn appeal XDP argues that the trial court's order barring its Royal Globe claims was wrong both as to the third party claim and as to the first party claim.\n\n1. THIRD PARTY CLAIM\n\nAs to its third party claim XDP argues that, in light of State Farm 1989, supra, 211 Cal. App. 3d 5 and CSAA, supra, 50 Cal. 3d 658, the January 21, 1988, judgment satisfied Moradi-Shalal.\n\nXDP's settlement clearly would not satisfy Moradi- Shalal itself. In Moradi-Shalal the Supreme Court made quite clear that \"settlement without more does not constitute a determination of the insured's liability\" (46 Cal. 3d at p. 308) and that for reasons it explained in some detail the requisite determination of liability could not be made within the surviving Royal Globe action itself: \"[T]he insured's liability must be judicially determined before a Royal Globe action can be brought. \" (at p. 313, italics added.) For reasons stated above, the stipulated judgment called for in the settlement, and ultimately obtained on the basis of the settlement in uncontested proceedings in which National Union did not participate, cannot be deemed to have added any real element of judicial determination to the settlement. No controverted issue was presented to the superior court, which simply applied an essentially ministerial imprimatur to an uncontested arbitration award which was, in turn, the product of the settlement agreement.\n\nXDP is prepared to concede that its judgment was stipulated to. It relies on its contention that both State Farm 1989 and CSAA validate stipulated judgments as conclusive judicial determinations within the meaning of Moradi-Shalal.\n\nThe short answer is that, as discussed above, the broad State Farm 1989 dictum on which XDP relies has been effectively superseded in relevant respects by the language of the Supreme Court's subsequent CSAA opinion, and that CSAA does not support XDP's position in the circumstances of record here.\n\nThe trial court granted National Union's motion for judgment on the pleadings as to XDP's Insurance Code section 790.03 theory two months before CSAA was filed, but the court's ruling essentially anticipated the Supreme Court's position in CSAA. The court pointed out, in granting the motion and later in denying reconsideration of its ruling, that the liability of Toreson and Hoebich to XDP had not necessarily been resolved as to National Union.\n\nThe record supports the trial court's Conclusion, which is also consistent with a recent holding that a stipulated judgment given (as, in necessary effect, in this case) in exchange for a covenant not to execute on the judgment \"is not entitled to the significance otherwise properly accorded to a stipulated judgment under the Moradi-Shalal decision.\" (Smith v. State Farm Mut. Auto. Ins. Co., supra, 5 Cal. App. 4th at pp. 1116-1117.)\n\n2. FIRST PARTY CLAIM.\n\nXDP argues that the Moradi-Shalal requirement of a prior conclusive judicial determination does not apply to its first party Royal Globe claim. Respectable authority supports XDP's position (Fortman v. Safeco Ins. Co. (1990) 221 Cal. App. 3d 1394, 1401 [271 Cal. Rptr. 117]; Continental Casualty Co. v. Royal Ins. Co. (1990) 219 Cal. App. 3d 111, 126 [268 Cal. Rptr. 193]; Bodenhamer v. Superior Court (1987) 192 Cal. App. 3d 1472, 1480 [238 Cal. Rptr. 177]); it is apparent that in this respect the trial court erred.\n\nBut the error was harmless. XDP's briefing has made clear that it asserted an assigned first party Royal Globe claim only to seek recovery of defense costs incurred by Toreson and Hoebich for the services of the Orrick firm and, later, Haun. All fees and costs Toreson and Hoebich incurred from and after September 24, 1987, were for Haun's services, and the trial court properly concluded that XDP's assertion of the attorney-client privilege foreclosed proof of these fees and costs. The trial court also properly concluded that National Union had no duty, as Toreson's and Hoebich's insurer, to pay fees or costs Toreson and Hoebich incurred before September 24. Hence, at the first trial XDP could not have recovered these fees and costs in any event. The issue of Haun's fees from and after September 24 may be reopened, at retrial, as an element of damages for breach of the\n\ninsurance contract; it would be unnecessary, and could confuse the jury, to renew XDP's Royal Globe theory for this narrow purpose.\n\nGENERAL VERDICT\n\nXDP received a general verdict for almost exactly 75 percent of the amount of the stipulated judgment. On appeal it asserts that it should have had the full amount.\n\nXDP first reiterates that the stipulated judgment should have been deemed conclusive of the amount of damages necessary to compensate Toreson and Hoebich, and thus of the amount XDP, as their assignee, could recover. For reasons explored above, this argument is unpersuasive in the circumstances of record.\n\nXDP then points out the virtual coincidence between the jury's allocation of unreasonableness--75 percent to National Union and 25 percent to Xebec, Toreson and Hoebich, and their attorneys--and the ratio of its verdict to the amount of the stipulated judgment, and suggests that the inference is irresistible that the jury improperly applied comparative fault principles (under the trial court's instructions on the implied covenant of good faith and fair dealing) to a verdict necessarily based on breach of contract.\n\nTo bolster its argument that this was in fact a contract verdict, XDP tenders a juror's declaration to that effect. The declaration appears to be in substance a statement concerning the jury's mental processes and thus to be inadmissible in light of Evidence Code section 1150, but the point may be mooted: Under the parties' theories and the court's instructions, the verdict could only have been based on XDP's contract theory.\n\nNational Union's suggestion that (despite the vivid coincidence) the jury should be presumed to have followed its instructions and to have determined the contract damages to have been an amount which happened to be 75 percent of the January 1988 judgment is persuasive, but again the point is essentially moot: The judgment must in any event be reversed for further proceedings on damages.\n\nSUMMARY AND DISPOSITION\n\nTo summarize:\n\nIn proceedings brought by XDP, under valid assignment of the contract claims of Toreson and Hoebich under the D\u0026O policy, the jury implicitly\n\nfound that National Union, by refusing to give reasonable consideration to the request of Toreson and Hoebich that it pay the costs of their defense, breached its insurance contract. The finding of breach was supported by substantial evidence and is not tainted by significant error in rulings, proceedings, or instructions, and will not be disturbed on appeal. It follows that XDP, as assignee, was entitled to recover contract damages for injury to Toreson and Hoebich attributable to the breach; if no injury were proved XDP as assignee would in any event be entitled to nominal damages for breach of the insurance contract. (Sweet v. Johnson (1959) 169 Cal. App. 2d 630, 632-633 [337 P.2d 499]; Ross v. Frank W. Dunne Co. (1953) 119 Cal. App. 2d 690, 700 [260 P.2d 104]; cf. Ericson v. Playgirl, Inc. (1977) 73 Cal. App. 3d 850, 859 [140 Cal. Rptr. 921, 96 A.L.R.3d 427].)\n\nBut the jury's assessment of damages attributable to the breach must be reversed, and the cause must be remanded for further proceedings on damages. Properly to assess damages, in the circumstances of record, the jury needed to be clearly informed (1) that neither the stipulated arbitration award nor the stipulated judgment controlled their assessment, (2) that the nature and amount of the settlement among XDP, Xebec, Toreson and Hoebich, were entitled to no more than presumptive effect, and (3) how to determine whether a presumption arose and (if so) how to proceed in light of the presumption. Whether or not the settlement was entitled to presumptive effect, the jury needed to be fully informed as to both the facts of the underlying dispute between XDP and Toreson and Hoebich with respect to the RDA's and the law applicable to those facts. The trial proceedings were defective in all these respects.\n\nThe trial court properly concluded, as a matter of law, that for want of a prior conclusive judicial determination of Toreson's and Hoebich's liability XDP could not maintain a surviving Royal Globe action against National Union under Insurance Code section 790.03 that XDP could not recover attorney fees or costs attributable to services rendered to Toreson and Hoebich before September 24, 1987, and that evidence essential to XDP's claim for attorney fees and costs incurred by Toreson and Hoebich from and after September 24 should be excluded from evidence for this purpose. These Conclusions will not be disturbed on appeal, but upon remand XDP may properly seek recovery, as an element of Toreson's and Hoebich's damages for breach of the insurance contract for attorney fees and defense costs reasonably and necessarily incurred by Toreson and Hoebich in defending against XDP's claims from and after September 24, 1987.\n\nAs a matter of law, XDP cannot recover its own attorney fees in this action. The trial court's Conclusion to the contrary was erroneous.\n\nAccordingly the judgment entered June 29, 1990, is reversed and the cause is remanded for further proceedings as follows:\n\n(1) Further trial shall be limited to the issues of damages proximately caused to Toreson and Hoebich, or either of them, by National Union's breach of the express terms of the insurance policy and of the actual costs of suit (excluding attorney fees) to which XDP may be entitled at the Conclusion of the further trial.\n\n(2) Evidence admissible at the further trial shall include all otherwise admissible evidence relevant to whether Toreson or Hoebich, or both, were legally obligated as individuals to pay amounts to XDP by reason of XDP's claims based on the RDA's, and (if so) to the amounts Toreson and Hoebich were legally obligated to pay, and (whether or not Toreson and Hoebich were so obligated) to attorney fees and defense costs incurred by Toreson or Hoebich, or either of them, in defending against XDP's claims from and after September 24, 1987. No evidence shall be received concerning attorney fees or costs of defense incurred by Toreson or Hoebich before September 24, 1987, or concerning attorney fees incurred by XDP in this action.\n\n(3) At the further trial the jury shall be instructed, in addition to other relevant matters:\n\n(a) That it has previously been established that National Union has breached the D\u0026O policy and the only issue remaining for the jury to determine is the amount of damages Toreson and Hoebich, as XDP's assignors, sustained as a proximate result of the breach.\n\n(b) That the measure of such damages is the amount (if any) that Toreson or Hoebich or both of them were legally obligated to pay to XDP by reason of XDP's claims based on the RDA's, plus any attorney fees and defense costs Toreson and Hoebich, or either of them, reasonably and necessarily incurred in defending against XDP's claims from and after September 24, 1987, but that the damages do not include any attorney fees or defense costs Toreson or Hoebich or either of them incurred before September 24, 1987.\n\n(c) That the stipulated arbitration award made January 19, 1988, and the stipulated judgment entered January 21, 1988, are to be regarded by the jury only as agreed parts of the settlement among XDP, Xebec, Toreson and Hoebich and not as independent determinations, by the arbitrators or the court, that Toreson or Hoebich or both of them were legally obligated to pay any amount or amounts to XDP.\n\n(d) As to all rules of law material to the jury's consideration, in light of the evidence, of whether Toreson or Hoebich, or both, were legally obligated as individuals to pay amounts to XDP by reason of XDP's claims based on the RDAs, and (if so) of the amounts Toreson and Hoebich were legally obligated to pay.\n\n(e) As to the rebuttable presumption, affecting the burden of proof, that the settlement among XDP, Xebec, Toreson and Hoebich accurately reflected the fact or amount, or both, of Toreson's and Hoebich's legal obligations as individuals to XDP. The instruction shall cover both the burden of XDP to prove by a preponderance of the evidence the basic or foundational facts of the presumption and the effect of the presumption if the basic or foundational facts are found, in accordance with the procedure outlined at 2 BAJI, supra, appendix C, pages 336-337 and with the views expressed in this opinion.\n\n(4) Upon return of the jury's verdict the trial court shall enter judgment in the amount of the damages fixed by the jury in accordance with these directions, or, if the jury fixes no damages, in a nominal amount not to exceed $10, plus interest on the amount so fixed from January 21, 1988, to the date of judgment. If the amount of the judgment, exclusive of interest, is more than $25,000, the trial court shall add to the judgment $43,376.71 in actual costs of suit to the Conclusion of the first trial as fixed by the court in the judgment entered June 29, 1990, plus XDP's actual costs of suit (excluding attorney fees) from the date of remittitur herein as fixed in accordance with law. If the amount of the judgment, exclusive of interest, is $25,000 or less, costs shall be determined by the trial court in its discretion. (Code Civ. Proc., ยง 1033, subd. (a).)\n\nEach party shall bear its own costs on appeal.\n\nCottle, Acting P. J., and Bamattre-Manoukian, J., concurred.\n\nA petition for a rehearing was denied February 10, 1993, and the petition of appellant Xebec Development Partners, Ltd., for review by the Supreme Court was denied April 1, 1993. Mosk, J., and Panelli, J., were of the opinion that the petition should be granted.\n\nDisposition\n\nEach party shall bear its own costs on appeal.\n\n\u003cspan class=\"fn\"\u003e* Judge of the Santa Clara Superior Court sitting under assignment by the Chairperson of the Judicial Council.\u003c/span\u003e\n\n",
    "body_length": 167815,
    "citedas": [
      "12 Cal. App. 4th 501",
      "15 Cal. Rptr. 2d 726"
    ],
    "attorneys": "James Bohm, Robinson \u0026 Wood, Thomas R. Fellows, Roberta M. Knapp and Helen A. Sabo for Defendant and Appellant. William Bisset and Charles Avrith for Plaintiff and Respondent.",
    "category": [
      "124",
      "252",
      "184"
    ],
    "judges": "Opinion by Stone, J.,*fn* with Cottle, Acting P. J., and Bamattre-Manoukian, J., Concurring.)",
    "citation_count": 0
  }
}
